[
  {
    "title": "British-Egyptian Activist Alaa Abd el-Fattah Released After Sentence Commuted",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 14:36:19 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The British-Egyptian activist is one of six people whose sentences President Abdul Fattah al-Sisi commuted, according to state media.",
      "He was arrested in 2019 in Egypt and sentenced in 2021 to five years in jail for &quot;spreading false news&quot;.",
      "Prominent British-Egyptian democracy advocate Alaa Abd el-Fattah has been freed after years of detention. His release follows a petition from Egypt’s human rights council and increased international pressure.",
      "<p>Reports say writer, who has served six years for liking a Facebook post, has also been given a presidential pardon</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates\">Middle East crisis –",
      "Abdel Fattah was a symbol of the 2011 uprising but was arrested two years later. He has since spent almost all of the past 12 years behind bars."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5bcc/live/91f678a0-97b1-11f0-a98f-a5aede2eafbc.jpg",
    "titles": [
      "Egypt's president pardons British-Egyptian activist Alaa Abdel Fattah",
      "Egyptian-British activist Alaa Abd el-Fattah granted presidential pardon",
      "Egypt pardons jailed activist Alaa Abd el-Fattah",
      "British-Egyptian activist Alaa Abd el-Fattah to be freed from prison",
      "Egypt’s president pardons jailed Arab Spring activist Alaa Abdel Fattah"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.947,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British-Egyptian activist Alaa Abd el-Fattah, arrested in 2019 and sentenced in 2021 to five years for \"spreading false news,\" has been released. His freedom comes after President Abdul Fattah al-Sisi commuted his sentence along with five others, following a petition from Egypt’s human rights council and international advocacy. Abd el-Fattah, known for his role in the 2011 uprising, spent nearly 12 years in detention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Christian Horner Leaves Red Bull, $107M Deal Ends Era of Success",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 11:34:33 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Sky Sports",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Christian Horner formally leaves Red Bull after agreeing a severance deal following his sacking as team principal in July.",
      "Christian Horner formally leaves Red Bull after agreeing a severance deal following his sacking as team principal in July.",
      "The former Red Bull team principal has reportedly agreed a $107m payoff deal with the Formula One team.",
      "<ul><li><p>Former team principal was sacked in July</p></li><li><p>Can return to F1 next season</p></li></ul><p>Christian Horner has officially left Red Bull after agreeing what is understood to be a multimillion pound settlement. The former team principal <a href=\"https://www.theguardian.com/sport/",
      "Christian Horner has officially left Red Bull after agreeing a multi-million pound exit package that will allow him to make a swift return to Formula 1.",
      "<p>Christian Horner and Red Bull say they have finalized the process of Horner leaving the team he led to eight Formula 1 drivers&#8217; titles, two months after he was removed as team principal.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8ed2/live/6c1c7ae0-97a1-11f0-879b-435833d9ab67.jpg",
    "titles": [
      "Christian Horner formally leaves Red Bull with £52m pay-off",
      "Horner formally leaves Red Bull with £52m pay-off",
      "Christian Horner leaves Red Bull after agreeing exit from F1 team",
      "Christian Horner formally leaves Red Bull with large pay-off",
      "Horner officially leaves Red Bull as deal agreed to allow 2026 F1 return",
      "Red Bull, Christian Horner finalize split"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.889,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.807,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian Horner has officially departed from Red Bull after finalizing a severance deal, two months following his removal as team principal in July. The agreement, reported to be worth $107 million, concludes his tenure with the team, which saw eight Formula 1 drivers' titles under his leadership. Horner is now eligible to return to Formula 1 next season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration to Endorse Leucovorin for Autism Treatment",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 11:33:16 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Some studies have suggested an association between the two, but experts say there is no causal relationship.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5nYUx4cVlYemFCdDVHM2hoc2RYVWQ1N3hmd2l5V0w1TlBHLXFRTm1pZ1VWcmxMMk50bE91WjhBLUJpeDRYMGFuc21iU2pIQlRzYThfcDhwb1RZY3F0R3c1dTNBYWdjeVl1YkFpQjVSaXdZaklN?oc=5\" target=\"_blank\">Trump to link autism to Tylenol use during pregnancy</a>&nbsp;&nbsp;<fo",
      "Federal health officials also are expected to highlight leucovorin as a potential autism treatment, according to The Washington Post.",
      "<p>Washington Post says announcement imminent despite guidelines showing drug – known as paracetamol elsewhere – is safe for pregnant women to take</p><p>Donald Trump’s <a href=\"https://www.theguardian.com/us-news/trump-administration\">administration</a> is on Monday expected to tie pregnant women’s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/efd6/live/8b5ddf10-979d-11f0-84a3-e314c0b97a4c.jpg",
    "titles": [
      "Trump will reportedly link pain reliever Tylenol to autism - but many experts are sceptical",
      "Trump to link autism to Tylenol use during pregnancy - Axios",
      "Trump administration reportedly plans to link autism to Tylenol use during pregnancy",
      "Trump officials reportedly set to tie Tylenol to autism risk"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.888,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Federal health officials are expected to endorse leucovorin as a potential autism treatment, as per The Washington Post. Despite guidelines indicating the safety of paracetamol (known as leucovorin elsewhere) for pregnant women, this announcement is anticipated to come from Donald Trump's administration on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ACC Fines Syracuse $25K, Issues Reprimand for Faking Injuries Against Clemson",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 11:46:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The ACC fined Syracuse $25,000 and publicly reprimanded the school for faking injuries in a 34-21 win over Clemson last weekend, calling its actions \"unethical and contrary to the spirit of the rules.\"",
      "Syracuse wasn't very subtle when trying to slow down Clemson's offense",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQT2NOWTFIaC12THJIZEJkdGRfVWdLNnM2ZTFpUll1UF9fRVVMYWN6OW5rQzl3TlduMXd2bnZsWUQzY1h3Y1ZpUjRaa0haS1E3V1Y5c2tROC11aFIwRzVPazB2SHRyZWE4QjdscW5uek90N0w3NzdjMVIyWkl3alRnb3JzUXBqaG9hS0dPbXR3?oc=5\" target=\"_blank\">Syracuse Fined by ACC for Faking In"
    ],
    "image_url": "",
    "titles": [
      "Syracuse fined for faking injuries vs. Clemson",
      "ACC fines Syracuse $25,000 for faking injuries in win over Clemson",
      "Syracuse Fined by ACC for Faking Injuries to Stop Clock vs. Clemson - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The ACC fined Syracuse University $25,000 and issued a public reprimand for the school's unethical behavior during a 34-21 victory over Clemson, where they were found to have faked injuries to slow down the game. This action was deemed contrary to the spirit of sportsmanship and the rules of the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCF Assistant Coach Shawn Clark Dies at 50 After Medical Emergency",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 11:46:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "UCF assistant coach Shawn Clark, who was the head coach at Appalachian State for five seasons, died Sunday at 50.",
      "Clark coached his alma mater for five full seasons and most recently joined Scott Frost's staff at UCF",
      "UCF offensive line coach Shawn Clark died Sunday at 50 years old nearly two weeks after he was hospitalized with a medical emergency, the school announced.  Clark suffered the medical emergency on Sept. 9 and had been away from the team.  “Shawn was so much more than a coach,” UCF coach Scott Frost "
    ],
    "image_url": "",
    "titles": [
      "UCF assistant, ex-App St. coach Clark dies at 50",
      "Shawn Clark dies at 50: UCF assistant, former Appalachian State coach recently suffered 'medical emergency'",
      "Shawn Clark, UCF offensive line coach and former Appalachian State coach, dies at 50"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shawn Clark, UCF assistant coach and former Appalachian State head coach, passed away at 50 after a medical emergency on Sept. 9. He had been hospitalized for nearly two weeks before his death. Clark, who had recently joined Scott Frost's staff at UCF, was remembered by Frost as \"so much more than a coach.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyberattack Disrupts Airport Check-ins at Heathrow, Brussels, Berlin",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 14:27:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Since Friday, Europe&#039;s busiest airports have faced significant disruptions after hackers hit automated check-in systems.",
      "The EU's cybersecurity agency ENISA said the type of ransomware that caused airport chaos last week has been identified. Severe disruptions over the weekend affected flight hubs in Berlin, London, Brussels and Dublin.",
      "A disruption to check-in and boarding systems had snarled departures through Saturday at airports in Berlin, Brussels, Dublin and London."
    ],
    "image_url": "",
    "titles": [
      "Cyberattack on European airports caused by ransomware, EU finds",
      "European airports disruption due to ransomware — EU agency",
      "Cyberattack Causes Delays at Heathrow and Other Airports in Europe"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A cyberattack targeting Collins Aerospace's check-in software caused significant disruptions at several airports, including Heathrow, Brussels, and Berlin. The attack led to difficulties in checking in, printing boarding passes and bag tags, and dispatching luggage. Brussels Airport anticipated heavy disruptions and flight cancellations into Sunday. The incident affected departures across multiple airports, including Dublin and London, throughout Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Reform UK's Plan to Limit Benefits and Visa Access Sparks Debate",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 13:14:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The party claims ending the scheme and restricting access to benefits will save hundreds of billions of pounds - but Rachel Reeves says the plans 'have no basis in reality'.",
      "Reform UK leader says people with settled status would be forced to reapply for new visa after five years",
      "<p>Reform UK plans to force non-citizens to apply for visas, with high salary thresholds and no access to NHS services</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates\">UK politics live – lates"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6d32/live/2f1d3de0-97ac-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Reform says it will scrap indefinite leave to remain for migrants if it wins next election",
      "Farage vows to ditch indefinite leave to remain for migrants",
      "Farage vows to scrap indefinite leave to remain, placing thousands at risk of deportation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Reform UK proposed a policy to end a current scheme and limit benefits access, aiming to save billions. However, Rachel Reeves criticized the plan as unrealistic. Additionally, the party wants non-citizens to reapply for visas every five years, with conditions including high salary requirements and no NHS access. Critics and political figures have engaged in a debate over the feasibility and impact of these proposals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pascal, Weaver, White Star in First Star Wars Film Since 2019",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 14:04:13 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.theverge.com"
    ],
    "snippets": [
      "<p>Pedro Pascal, Sigourney Weaver and Jeremy Allen White team up for first movie in Star Wars universe since 2019</p><p>The <a href=\"https://www.theguardian.com/film/starwars\">Star Wars</a> universe is returning to the big screen with our first look at <a href=\"https://www.theguardian.com/film/2024/",
      "Here is the first trailer for The Mandalorian and Grogue ahead of its release next year. Action and Grogu antics abound.",
      "The return of Star Wars to movie theaters is looking pretty familiar. Disney just released the first trailer for The Mandalorian and Grogu, which looks like a mixture of the adventurous vibe of the original trilogy and the cuteness of the Disney Plus series. The early clip includes blazing speeders "
    ],
    "image_url": "https://i.guim.co.uk/img/media/842dddfa60953e850d7f676ccbfb11660b096c25/972_0_2008_1608/master/2008.jpg?width=140&quality=85&auto=format&fit=max&s=341c75cc1d5e2be6053baf3e0788920f",
    "titles": [
      "The Mandalorian and Grogu trailer: first look at big-screen Star Wars spinoff",
      "Watch The First ‘The Mandalorian And Grogu’ Trailer Here",
      "The Mandalorian and Grogu channels classic Star Wars in first trailer"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pedro Pascal, Sigourney Weaver, and Jeremy Allen White are starring in \"The Mandalorian and Grogu,\" marking the first Star Wars movie since 2019. Disney released the first trailer, showcasing a blend of adventure reminiscent of the original trilogy and elements from the Disney Plus series. The film is set to release next year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France, UK Among 11 Nations to Recognize Palestinian Statehood at UN Assembly",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 08:46:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The UK, Australia and Canada have recognised a Palestinian state, while France and other countries are set to do so in the coming days.",
      "President Emmanuel Macron, backed by several other European countries, described France's move as a \"necessity\".",
      "Despite widespread international recognition of Palestine, some Western nations have said they will only endorse Palestinian statehood as part of a comprehensive peace agreement with Israel. But the tide is changing.",
      "<p>Pippa Crerar and Kiran Stacey discuss the UK’s recognition of Palestine as a state. With the US and Israel criticising the move, what will it mean for the war in Gaza, and for diplomacy?</p><p>Plus, what do we know about the split at the top of Jeremy Corbyn and Zarah Sultana’s new leftwing party"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0ae7/live/fc9130a0-978a-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "What does recognising a Palestinian state mean?",
      "France to recognise Palestinian state but Germany and Italy say not yet",
      "Which countries recognize Palestinian statehood?",
      "What does the UK recognising Palestinian statehood really mean? – podcast"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.838,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the upcoming UN General Assembly, France, the UK, and nine other countries plan to recognize Palestinian statehood. This move comes despite some Western nations' stance of only endorsing Palestinian statehood within a comprehensive peace agreement with Israel, indicating a shift in international policy towards Palestine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Typhoon Ragasa Spurs Evacuations in Philippines, China",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 08:18:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Phys.org"
    ],
    "domains": [
      "www.bbc.com",
      "phys.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "Ragasa has hit northern Philippines and is barrelling towards southern China.",
      "Thousands were evacuated and hundreds of flights canceled ahead of the major storm.",
      "The Chinese city of Shenzhen began preparing to evacuate 400,000 people while residents of the northern Philippines sought shelter from gale-force winds Monday as Super Typhoon Ragasa continued on a collision course with southern China."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b144/live/224b06f0-97c1-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Super typhoon hits Philippines as thousands evacuate",
      "Super Typhoon Ragasa Hits the Philippines, Headed for Hong Kong",
      "China prepares to evacuate 400,000 as super typhoon makes landfall in Philippines"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.83,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Super Typhoon Ragasa has prompted evacuations in the northern Philippines and is now heading towards southern China, with Shenzhen preparing to evacuate 400,000 people. Thousands have already been evacuated, and hundreds of flights have been canceled due to the storm's approach.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Carney to Discuss Two-State Solution at UN General Assembly",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 22 Sep 2025 12:17:50 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Carney is scheduled to attend a high-level segment on Palestine and the implementation of a two-state solution — a Palestinian state existing in peace alongside Israel",
      "Prime Minister Mark Carney is set to meet with world leaders at the United Nations General Assembly on Monday after joining other nations in recognizing Palestinian statehood as the institution faces pushback from the Trump administration over efforts to condemn the turmoil in the Middle East. The U"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/Carney-UNGA.jpg?quality=65&strip=all",
    "titles": [
      "Carney to meet world leaders attending UN General Assembly",
      "Carney to meet other leaders attending UN General Assembly"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Minister Mark Carney will attend the United Nations General Assembly to discuss the implementation of a two-state solution for Israel and Palestine. This follows his recognition of Palestinian statehood amid criticism from the Trump administration regarding the UN's stance on Middle East conflicts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardinals' James Conner to Miss Season, Requires Ankle Surgery",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 11:46:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Cardinals running back James Conner suffered a season-ending right ankle injury during Sunday's loss to the 49ers, and he will require surgery, a source told ESPN.",
      "<p>Arizona Cardinals running back James Conner was taken off the field on a cart with a right ankle injury in the third quarter of Sunday&#8217;s game against the San Francisco 49ers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: RB Conner suffers season-ending injury",
      "Report: Cardinals’ James Conner suffers season-ending ankle injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "James Conner, the running back for the Arizona Cardinals, suffered a right ankle injury during the game against the 49ers, leading to his season ending prematurely. He will undergo surgery for this injury, as confirmed by a source to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Reid Attributes Sideline Spat with Kelce to Passion as Chiefs Beat Giants",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 11:46:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Chiefs coach Andy Reid brushed off his sideline dustup with Travis Kelce on Sunday night as Kansas City picked up its first win of the season, beating the Giants.",
      "Kansas City Chiefs head coach Andy Reid defended Travis Kelce's \"passion\" after a heated exchange with his veteran tight end during Sunday night's win over the New York Giants.&#160;"
    ],
    "image_url": "",
    "titles": [
      "Chiefs get 1st win as Reid brushes off Kelce dustup",
      "Kelce clashes with Chiefs coach Reid in win over Giants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kansas City Chiefs head coach Andy Reid downplayed a heated exchange with tight end Travis Kelce during Sunday night's game, attributing it to Kelce's \"passion.\" Despite the sideline incident, the Chiefs secured their first win of the season by defeating the New York Giants.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pitt to Retire Aaron Donald's No. 97 Jersey on Nov. 15",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 11:46:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Three-time NFL Defensive Player of the Year Aaron Donald will become the 11th Pitt player to have his number retired when the Panthers honor his No. 97 on Nov. 15.",
      "Donald will join the likes of Larry Fitzgerald and Dan Marino"
    ],
    "image_url": "",
    "titles": [
      "Pitt retiring Aaron Donald's No. 97 jersey vs. Irish",
      "Pittsburgh to retire Aaron Donald's jersey ahead of its Week 12 game against Notre Dame"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Donald, a three-time NFL Defensive Player of the Year, will have his No. 97 jersey retired by the University of Pittsburgh on Nov. 15, making him the 11th player from Pitt to receive this honor. He joins notable alumni like Larry Fitzgerald and Dan Marino in this prestigious group.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Predicts Washington to Cover Spread vs. Ohio State in Week 5",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 15:24:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's computer model has revealed its Week 5 college football picks, which include Washington covering versus No. 1 Ohio State",
      "Bill Bender breaks down the Week 5 college football slate and what the best bets of the week are."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/13/a20b2dbb-e452-4976-89a6-d4a2421439c7/marcel-reed-cbs-2.jpg",
    "titles": [
      "College football odds, picks, predictions for Week 5, 2025: Model backs Washington, Texas A&M in best bets",
      "College football picks, predictions against the spread for Week 5 matchups"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's computer model predicts Washington will cover the spread against No. 1 Ohio State in Week 5 of college football. Additionally, Bill Bender provides an analysis of Week 5's college football games, highlighting the best bets for the week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hoosiers Shine in Big Ten, Week 5 Top 20 Teams Updated",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 10:21:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "After a month of college football in the books, how is each team's quarterback situation looking?",
      "The Hoosiers made a massive statement on Saturday with their convincing win in the Big Ten showdown",
      "SportsLine college football betting expert Thomas Casale breaks down his top 20 teams ahead of Week 5",
      "Updating the comprehensive ranking of all 136 FBS teams coming out of Week 4 action"
    ],
    "image_url": "",
    "titles": [
      "College football Power Rankings: How the Top 25 looks through Week 4",
      "College Football Power Rankings: Indiana skyrockets after blowout win over Illinois as Illini plummet",
      "College football Week 5 power ratings: Oklahoma moves up a tier, Texas Tech enters top 20 after Week 4 wins",
      "College football rankings: Oklahoma, Indiana vault into top 10 in CBS Sports 136 after notable Week 4 wins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After the first month of college football, teams' quarterback performances vary widely. The Hoosiers impressed with a significant win in their Big Ten game on Saturday. SportsLine's Thomas Casale has updated his top 20 teams list for Week 5. Additionally, a comprehensive ranking of all 136 FBS teams has been updated following Week 4's results.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyberattack Disrupts Major European Airports, Thousands Affected",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-22T14:16:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "NHL",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Thousands of passengers have seen flights delayed or canceled after a cyberattack on major European airports. One expert says that, with the perpetrators still a mystery, the chaos may not be over.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPZFcwYnR3MGR4MGNUcFF5cHM0SmdwSkh5a2N5YkY1b2hNYjZuTDFwSUgtdHpfbndoNGRMdkJFaHdwRGkxckJ2MDdQMEN3akc4T2plaWpQNW11SEttY0J6TS1waTduQlpjbnZWSHRuQVFzSzQ5MzVVQUhFNzNZclRsdmhWZw?oc=5\" target=\"_blank\">PIT@MTL: What you need to know</a>&nbsp;&nbsp;<fo"
    ],
    "image_url": "",
    "titles": [
      "Airport cyberattacks: What you need to know",
      "PIT@MTL: What you need to know - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thousands of passengers experienced delays or cancellations after a cyberattack targeted major European airports. The identity of the attackers remains unknown, raising concerns that the disruptions may continue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Holland Concussed on \"Spider-Man\" Set, Filming Paused",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 09:15:27 -0400",
    "source": "Forbes",
    "sources": [
      "Business Insider",
      "Forbes"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Tom Holland appears to be okay, but a concussion he suffered on the set of Spider-Mana: Brand New Day, pausing filming.",
      "Tom Holland suffered a concussion on the set of \"Spider-Man: Brand New Day.\" Filming of the highly anticipated 2026 release was stopped."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d14b17347469dfd8649752/0x0.jpg?width=960",
    "titles": [
      "Tom Holland Head Injury Halts ‘Spider-Man: Brand New Day’ Filming",
      "Tom Holland was injured after a stunt gone wrong on the set of 'Spider-Man: Brand New Day,' reports say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tom Holland sustained a concussion on the set of \"Spider-Man: Brand New Day,\" leading to a temporary halt in filming. Despite the incident, he appears to be okay. The movie is scheduled for release in 2026.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brussels Airport Cuts 50% Flights After Cyberattack on Check-In System",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 09:58:16 GMT",
    "source": "BBC",
    "sources": [
      "TechCrunch",
      "BBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Brussels Airport asks airlines to cancel nearly half of their outgoing flights on Monday.",
      "A cyberattack targeting Collins Aerospace, a provider of airport check-in systems, sparked delays and disrupted flights across Europe over the weekend."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dcb9/live/5f3c2610-97a9-11f0-af62-91486a511a31.jpg",
    "titles": [
      "EU cyber agency says airport software held to ransom by criminals",
      "EU cyber agency confirms ransomware attack causing airport disruptions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Brussels Airport requested airlines to cancel almost 50% of their outgoing flights on Monday due to a cyberattack on Collins Aerospace's airport check-in systems. This incident caused widespread delays and disruptions to flights across Europe over the weekend.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Imposes $100K Fee on H-1B Visas, Sparks Corporate Concern",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 23:39:47 +0000",
    "source": "New York Times",
    "sources": [
      "Fortune",
      "New York Times"
    ],
    "domains": [
      "fortune.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers.",
      "The founder of Greycroft Partners says \"there is not a single company that I have invested in the last 10 years that could afford to pay this.\""
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/20/multimedia/20xp-h1b-explainer/20biz-h1b-visas-qvgl-mediumSquareAt3X.jpg",
    "titles": [
      "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?",
      "Over 70% of H-1B visa holders are Indian citizens. Its government says Trump jacking the fee to $100,000 is ‘likely to have humanitarian consequences’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.708,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump signed a proclamation imposing a $100,000 annual fee on H-1B visas, aimed at skilled foreign workers. This move has caused significant concern among corporations in America and has been criticized by immigration hard-liners for allegedly replacing American workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Suggests Murdochs May Buy TikTok in Fox News Interview",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 17:51:34 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE1ZREhDMGtuaTBVeGFEbWpNTENhUnlFOVVGbE9qRGg4WU1qYkVOUV9oUzJmZ0haOUlaTEIzeHNEdVNKaTBhUG9oTjRXNnEyQjlZMF9UX2ZONEJ6Y25yNXN2Mk5CYXN4bU0?oc=5\" target=\"_blank\">Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says</a>&nbsp;&nbsp;",
      "The Trump administration has been talking up a potential TikTok deal this weekend, with President Donald Trump telling Fox News on Sunday that Rupert Murdoch and his son Lachlan are \"probably\" going to be involved."
    ],
    "image_url": "",
    "titles": [
      "Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says - Axios",
      "Trump says Lachlan and Rupert Murdoch might invest in TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.614,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump mentioned in a Fox News interview that Rupert Murdoch and his son Lachlan are likely to be part of the group purchasing TikTok in the U.S. This statement comes amid discussions by the Trump administration about a potential deal for the social media platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 to Unveil Space Tech Future in San Francisco",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 14:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "First reveal of the Space Stage agenda at TechCrunch Disrupt 2025, October 27-29 in San Francisco. Whether you’re a space junkie, a startup builder, or an investor chasing the edge of innovation, the Space Stage will deliver insights on what’s next in one of the most dynamic sectors in tech.",
      "Register for TechCrunch Disrupt 2025 by September 26 and save up to $668 before Regular Bird pricing disappears.\n\nDisrupt 2025 gives you an exclusive look at tomorrow's tech. Founders can connect with the right investors and partners to scale their startups. Investors can discover their next portfol"
    ],
    "image_url": "",
    "titles": [
      "Lift off: First look at the Space Stage agenda at TechCrunch Disrupt 2025",
      "5 days left to save up to $668 on your TechCrunch Disrupt 2025 pass"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.964,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025, happening in San Francisco from October 27-29, will feature the first reveal of the Space Stage agenda, focusing on the future of space technology. Attendees, ranging from enthusiasts to investors, will gain insights into this dynamic sector. Early registration by September 26 offers savings up to $668. The event aims to connect founders with investors and partners, highlighting innovation in tech.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Bass and \"Ghost\" Marsupial Species Discovered",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 13:39:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-two-new-bass-species-hiding-in-plain-sight/\" rel=\"nofollow\" title=\"Scientists Discover Two New Bass Species Hiding in Plain Sight\"><img alt=\"Altamaha Bass\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/im",
      "<a href=\"https://scitechdaily.com/scientists-discover-new-ghost-species-of-marsupial-closely-related-to-the-kangaroo/\" rel=\"nofollow\" title=\"Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo\"><img alt=\"Woylie Illustration\" class=\"webfeedsFeaturedVisual wp-post-ima"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Two New Bass Species Hiding in Plain Sight",
      "Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.948,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists have identified two new bass species previously unrecognized and a new \"ghost\" species of marsupial closely related to kangaroos. These discoveries, made through genetic analysis and field observations, highlight the ongoing diversity in both aquatic and terrestrial ecosystems. The findings, published in separate studies, expand our understanding of species diversity and underscore the importance of conservation efforts for these newly identified animals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  }
]