[
  {
    "title": "Colts add Philip Rivers to team for Seahawks game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 14:29:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sky Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "skysports.com",
      "sportsnet.ca",
      "cbssports.com"
    ],
    "snippets": [
      "The Colts elevated the newly unretired quarterback from the practice squad to the 53-man active roster Saturday, making him officially eligible to play Sunday against the Seahawks.",
      "The Indianapolis Colts promoted 44-year-old quarterback Philip Rivers to the active roster Saturday, making him eligible to play — and perhaps start — in Sunday's crucial game at Seattle. Indy (8-5) brought the Pro Football Hall of Fame semifinalist out of retirement Tuesday when it signed him to th",
      "The recently signed 44-year-old quarterback was promoted to Indianapolis' 53-man roster Saturday.",
      "Over four years after his last snap, Philip Rivers has been elevated from the Indianapolis Colts practice squad to the team's active roster to start against the Seattle Seahawks on Sunday.",
      "It’s once again Phillip Rivers’ time under centre for the Indianapolis Colts.",
      "In a shocking turn of events, the 44-year-old Philip Rivers could lead the offense just days after joining the team"
    ],
    "image_url": "",
    "titles": [
      "Rivers activated, eligible to play vs. Seahawks",
      "Colts activate 44-year-old QB Philip Rivers, making him eligible to play Sunday against Seahawks",
      "Philip Rivers to start Sunday for Colts against Seahawks, per report",
      "Colts to start 44-year-old Rivers vs Seahawks in Sunday's NFL",
      "Reports: Colts QB Philip Rivers to start against Seahawks",
      "Philip Rivers expected to start at QB for Colts vs. Seahawks days after coming out of retirement"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47293673/sources-colts-activate-philip-rivers-ahead-seahawks-game",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/colts-activate-44-old-qb-195838383.html",
      "https://sports.yahoo.com/articles/philip-rivers-start-sunday-colts-194528865.html",
      "https://www.skysports.com/nfl/news/12040/13483052/philip-rivers-indianapolis-colts-to-start-44-year-old-quarterback-vs-seattle-seahawks-in-sundays-nfl",
      "https://www.cbssports.com/nfl/news/philip-rivers-starting-colts-seahawks-week-15-retirement/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47293673/sources-colts-activate-philip-rivers-ahead-seahawks-game",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.971,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.899,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a sports event, but does not offer any deeper insights or actionable information for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Indianapolis Colts have promoted 44-year-old quarterback Philip Rivers to their 53-man active roster, making him eligible to play in Sunday's game against the Seattle Seahawks. Rivers, a Pro Football Hall of Fame semifinalist, was signed earlier in the week after coming out of retirement. This move comes over four years after his last NFL appearance.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Belarus frees 123 political prisoners after talks with United States",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 15:10:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "The Guardian",
      "New York Times",
      "CBC News",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "ft.com",
      "theguardian.com",
      "nytimes.com",
      "cbc.ca",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Nobel Peace Prize winner among dozens released as United States removes potash sanctions.",
      "Opposition activist Maria Kolesnikova is among those released in exchange for a deal with the US.",
      "More than 100 political prisoners freed but another 1,000 remain behind bars",
      "Nobel prize winner Ales Bialiatski and opposition figure Maria Kalesnikava among those freed after US talks with Alexander Lukashenko The Belarusian president, Alexander Lukashenko, has freed 123 prisoners, including Nobel peace prize winner Ales Bialiatski and leading opposition figure Maria Kalesn",
      "The release of the prisoners, including a Nobel laureate and two opposition leaders, was part of a monthslong rapprochement between Washington and Minsk.",
      "Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday, including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava, after two days of talks with an envoy for U.S. President Donald Trump, an American statement said.",
      "Belarus Frees 123 Political Prisoners as US Lifts Potash Ban Bloomberg.com",
      "VILNIUS, Lithuania (AP) — Belarus freed Nobel Peace Prize laureate Ales Bialiatski, key opposition figure Maria Kolesnikova and dozens of other political prisoners on Saturday, capping two days of talks with Washington aimed at improving ties and getting crippling U.S. sanctions lifted on a key Bela"
    ],
    "image_url": "",
    "titles": [
      "Belarus frees 123 prisoners including Ales Bialiatski as US lifts sanctions",
      "Belarus frees 123 prisoners as US lifts sanctions",
      "Belarus frees Nobel laureate after US lifts potash sanctions",
      "Belarus releases 123 prisoners including opposition leaders after US lifts sanctions",
      "Belarus Frees Prominent Political Prisoners as U.S. Lifts Some Trade Sanctions",
      "Belarus frees Nobel winner, top opposition figures as U.S. lifts more sanctions",
      "Belarus Frees 123 Political Prisoners as US Lifts Potash Ban - Bloomberg.com",
      "Belarus frees Nobel Prize laureate Bialiatski, opposition figure Kolesnikova as US lifts sanctions"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/belarus-frees-123-prisoners-including-ales-bialiatski-as-us-lifts-sanctions?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c4gpwlkklyxo?at_medium=RSS&at_campaign=rss",
      "https://www.ft.com/content/b344814e-4725-4924-9871-b3170d74d1ef",
      "https://www.theguardian.com/world/2025/dec/13/belarus-releases-123-prisoners-including-opposition-leaders-after-us-lifts-sanctions",
      "https://www.nytimes.com/2025/12/13/world/europe/belarus-frees-prisoners-trade-sanctions.html",
      "https://www.cbc.ca/news/world/belarus-frees-prisoners-9.7014930?cmp=rss",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxNVU1lLWU0bE9vZmdJUHRqcU9FdG1ZR05uMFVsZUJxWkdSWkx1aFJHUHlEU2duZmZOY2ZDWW9RX3lXalFza3pYWF9SdFNKVjdXTHVPTi1vX0JvUXRjTmFpSlhXc1FnazZtenVPZFZtSjBzSlg3RGw4MERPZU9xWDZKY2Nubm5kb3ZTbXg0N09LUWF1R1VZWnRmVDlHSHRPc0lHSklWZHNSTnNxYzZGeVE?oc=5",
      "https://financialpost.com/pmn/us-says-it-will-lift-some-trade-sanctions-on-russias-ally-belarus"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/belarus-frees-123-prisoners-including-ales-bialiatski-as-us-lifts-sanctions?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.861,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.878,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about the political situation in Belarus and the impact of US sanctions. However, it doesn't provide information on the solutions or improvements to the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Belarus has released 123 political prisoners, including Nobel Peace Prize laureate Ales Bialiatski and opposition activist Maria Kolesnikova, following two days of talks with the United States. The release was part of an agreement that led the U.S. to lift sanctions on Belarus's potash industry. Despite the releases, over 1,000 political prisoners reportedly remain detained in Belarus.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "King Charles says his cancer treatment will soon be lessened",
    "domain": "politics",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 08:22:19 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Washington Post",
      "New York Times",
      "CBC News"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "washingtonpost.com",
      "nytimes.com",
      "cbc.ca"
    ],
    "snippets": [
      "The monarch revealed the positive outlook in a recorded message broadcast on British television as part of a campaign to promote screening, which increases the likelihood of successful treatment.",
      "King Charles shares 'good news' of reduced cancer treatment in TV address Reuters",
      "Charles encouraged all Britons to undergo cancer screening, crediting early detection with “enabling me to continue leading a full and active life.”",
      "The British monarch said that his treatment would be reduced in the new year, in a recorded message emphasizing the value of cancer screening.",
      "King Charles said on Friday that his doctors can reduce his treatment for cancer in the new year, describing the moment as a \"blessing\" and a testament to remarkable medical advances."
    ],
    "image_url": "",
    "titles": [
      "King Charles III says early diagnosis allows his cancer treatment to be reduced",
      "King Charles shares 'good news' of reduced cancer treatment in TV address - Reuters",
      "King Charles says cancer treatment to be reduced, calls it ‘personal blessing’",
      "King Charles Shares ‘Good News’ About His Cancer Treatment in Video Message",
      "King Charles says doctors can reduce his cancer treatments in new year"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643510/king-charles-cancer-treatment",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMingFBVV95cUxQbW5NaVc2aEdxMzJjYndvNHMzRWtNM1FBekRyZzR0dmtjX2RHSUpOakFIeGpnLWRSRERoelAxc210c21JRWtrdjR6RXo2Q0d4RjNEdURPQkEyMXd1VmxWQVNoS3U3VDhwRTdSdDNfWk16UlZ4ZTNaOEtQZS0ycndCRE5Kc000QkhHM3RRQkxCTWRPaG5PRTVzVHBYSXVqZw?oc=5",
      "https://www.washingtonpost.com/world/2025/12/12/king-charles-cancer-treatment-reduced/",
      "https://www.nytimes.com/2025/12/12/world/europe/king-charles-cancer-update.html",
      "https://www.cbc.ca/news/world/king-charles-cancer-treatment-new-year-9.7014149?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643510/king-charles-cancer-treatment",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.819,
      "consensus": 0.995,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.863,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story is constructive in that it raises awareness about the importance of early diagnosis in cancer treatment. However, it lacks depth and doesn't provide actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "King Charles announced in a televised message that his cancer treatment will be reduced in the new year, following positive progress. He credited early detection for his recovery and urged the public to participate in cancer screening, highlighting its role in improving treatment outcomes.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli military says it killed Hamas commander in Gaza strike",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 15:16:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Reuters",
      "Al Arabiya",
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "news.google.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "There was no immediate confirmation from Hamas or from medics that Saad was among the dead.",
      "The strike killed Raed Saad, a senior commander in Hamas' Qassam Brigades, the Israeli military said.",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza Reuters",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza Al Arabiya English",
      "If Saed is dead he would be most senior militant to be killed since October ceasefire, in attack on car that reportedly left four dead The senior Hamas commander Raed Saedhas been killed in a strike on a car in Gaza City, the Israeli military said on Saturday. The attack killed four people and wound",
      "The Israel Defense Forces said Raed Saad had worked to reestablish Hamas’ capabilities and weapons manufacturing. Hamas said the strike violated ceasefire.",
      "Hamas said the attack on Saturday was a breach of the truce. The militant group did not comment on Israel’s claim to have killed one of its members."
    ],
    "image_url": "",
    "titles": [
      "Israel claims to have killed senior Hamas commander, Raed Saad, in Gaza",
      "Israel targets senior Hamas official in deadly Gaza strike",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza - Reuters",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza - Al Arabiya English",
      "Israel says its military killed Hamas commander Raed Saed in Gaza City strike",
      "Israel kills senior Hamas commander in Gaza, challenging fragile truce",
      "Israel Says It Killed Senior Hamas Commander, Despite Cease-Fire"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/israel-says-it-hit-key-hamas-member-in-gaza-city?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cx2dklj3rxvo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPVUxvYzhpWF8tQkhvbG9KRWJUSndsbDFQSHlEaWlLMTVRVXB3dFh0Ry1xcEhLOVctQXBDYWhSM1UxN1lWS0wxd3ltNFhVbFBiUnFLWl9fWVpybWxJS3NzdVV5NDdMcE55N1lrd2FmUDJ3a0NmckYxVGZpRXZFT0JiTk1pMWNMUm5aZldWbG5RUjg2eV9MSGVBRzNpYm5laS01RnFGTWdJcXgzRFdjMENzNXo3UFZWc2JhaWljTTd3?oc=5",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxQWktLaFJxRm81MHhRR0RCel92RXczRzl6TXV1SjlKU2Uza3VwclVWYkRDUDAyTWJuQVNVb0tWX0FxZFNTS3UzUkR2X0F6N2hFb2cyTEdUdmkzcGs0eElQTHlVQmVSMXk3bFhjSGNkd0hiR1Y1eUNGNFljeHlqQ1A3dUpzR3I1cXBwY0ZsLUhxM1NsZ0hmS1RyZFlFYXRGLTdTb0JhRE03U1pPYmpJcmx1ZmV2TThIMVA1ODZkOUtRVXA5aFZSX3hn0gHMAUFVX3lxTFBtNUFSMGVsc0lkdWFLRlk1emN4NmJwX18zckU4eHVSMU1rMXNYTkJvcmxJWnU2YUJrX1JxR1k5SE1GT0pkbnk2OERDaWtCd0c1d3hEb3U4bG5BV01HMVp6RDdPQ2RubngxTkt1WXltQWE0QWxOQW02aVF4VnFacC1hWUFISGJqOF93bzV3MmgyRTVFTlZwX0U0NzZuVkhHZmw5MXlJa1V1UTlfSmZ4Vm95NXVjV3p6eFcta2RXS0hkbjkyV2RRaDQ3bWtFcg?oc=5",
      "https://www.theguardian.com/world/2025/dec/13/israel-says-its-military-killed-hamas-commander-raed-saed-in-gaza-city-strike",
      "https://www.washingtonpost.com/world/2025/12/13/raed-saad-hamas-killed/",
      "https://www.nytimes.com/2025/12/13/world/middleeast/israel-hamas-commander-gaza-strike.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/israel-says-it-hit-key-hamas-member-in-gaza-city?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.863,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.859,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing conflict between Israel and Hamas. However, it lacks depth and doesn't provide any solutions, improvements, or innovations to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Israeli military said it killed Raed Saad, a senior commander in Hamas' Qassam Brigades, in a strike on a car in Gaza City that left four people dead. Hamas did not confirm Saad's death but stated the attack violated the ceasefire. There was no immediate confirmation from medics or Hamas regarding Saad's status.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Fighting continues between Thailand and Cambodia at the border",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 13:24:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian",
      "New York Times",
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "nytimes.com",
      "cbc.ca"
    ],
    "snippets": [
      "Cross-border fighting between Thailand and Cambodia has shown no signs of easing.",
      "Thailand vows to keep fighting Cambodia after Trump ceasefire claim Reuters",
      "Thai PM says military will keep fighting and Cambodia suspends border crossings as casualties rise Thailand-Cambodia fighting explained Thailand’s caretaker prime minister has denied the existence of a ceasefire with Cambodia, despite Donald Trump announcing that both countries had agreed to halt fi",
      "The conflict appeared to have continued unabated on Saturday morning, a day after President Trump said a cease-fire was supposed to have resumed.",
      "Thailand’s prime minister said he had talked with the U.S. president, urging him to pressure Cambodia to resolve a deadly border clash, after a previous truce broke down.",
      "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
      "Fighting rages on Thai-Cambodian border despite Trump’s ceasefire claim AP News",
      "Trump says he’s sealed Thailand-Cambodia ceasefire, but fighting continues AP News"
    ],
    "image_url": "",
    "titles": [
      "Thai-Cambodia fighting continues despite US ceasefire claim",
      "Thailand vows to keep fighting Cambodia after Trump ceasefire claim - Reuters",
      "Thailand denies Trump ceasefire claim as clashes with Cambodia continue at border",
      "Thailand Rejects Trump’s Claim That It Reached a Cease-Fire With Cambodia",
      "Trump Says Leaders of Thailand and Cambodia Agree to Cease-Fire",
      "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
      "Fighting rages on Thai-Cambodian border despite Trump’s ceasefire claim - AP News",
      "Trump says he’s sealed Thailand-Cambodia ceasefire, but fighting continues - AP News"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/13/thai-cambodia-fighting-continues-despite-us-ceasefire-claim?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxPMjU1TmRPZEtjcUczdWxyLVdDQlpVbXhiSXdkX29Xd2wxQ2ZXaE5yc0t2Y3JvbmlOSmVJejdWNExJS0plNkVUblNWV0VoQmgwYW5FNV81ZWZYdUZubUFpTXFOZWZkc2NkbVlpc2dTajJXTnQyRDZXalN0U0t1RXBWeThYQXlJOGRvMWdfWDI1NUhDTUdsNXlwUXNEUE04Q2ZsTVlwNXppei1vanFLRkVqZGlQZFNOd1p1YVhvcjUzaTRPdjAwSFE?oc=5",
      "https://www.theguardian.com/world/2025/dec/12/thailand-and-cambodia-agree-to-restart-ceasefire-brokered-by-us-says-trump",
      "https://www.nytimes.com/2025/12/13/world/asia/thailand-cambodia-trump-ceasefire.html",
      "https://www.nytimes.com/2025/12/12/world/asia/thailand-cambodia-trump-call.html",
      "https://www.cbc.ca/news/world/thailand-cambodia-border-fighting-continues-9.7014953?cmp=rss",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRGdhWjJFejAyYkVJN2lMU0YwVnhVdi05OWd3UU40SldiSjFGVWNWWGFpQ3NuVEZtTUZna2lTWlNLVUc1WWtzaHQ3SlRYekFyNHRYYlV2MDg1ZWNqWnVtMUMxUmNTX1JJSFkxY053NDFpWnJyakdjZVdPaWhfLTZSaVdZUXJfV041ZGtNc3g0V180WlBzbmRfZ2k4eUxLS25Sd3AxQklhQ0NPd0RXXzhB?oc=5",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxQSTNFU3UxZTBQN3gybGQ1YVYzY3ByTzFNRThja1JMT0FReFpfN3BEWjVtVzVkRk1WOG5GM01xazNVUjRTQlk0cXYtNEY0YjJQVU04Wlo1NTk5Y2k0ellkYUVZSGZyQnpDb2gyY1RvYWpOWGlWSUdWTDRDalJELWxSYzRiVksxWFpzTkt0azN3b0VDUVV4X29zUkZVQ0dseWgwNW5N?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/13/thai-cambodia-fighting-continues-despite-us-ceasefire-claim?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.82,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.846,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the conflict between Thailand and Cambodia, but it doesn't provide depth or insight into the causes, impacts, or potential solutions to the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Cross-border fighting between Thailand and Cambodia has shown no signs of easing.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Vancouver Canucks trade Quinn Hughes to Minnesota Wild",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 11:56:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "globalnews.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Hockey trade season has begun! Find grades for each GM involved in all the big swaps here.",
      "NHL Trade Grades for Quinn Hughes to the Wild, Marco Rossi, Zeev Buium to the Canucks Bleacher Report",
      "The Vancouver Canucks' front office has known for months that the team's captain was unlikely to stick around long term, Friday, he was dealt to Minnesota.",
      "Minnesota Wild Acquires Defenseman Quinn Hughes From the Vancouver Canucks NHL.com",
      "Canucks move quickly to make most out of Hughes trade in deal with Wild NHL.com",
      "The Vancouver Canucks ‘ front office has known for months that the team’s captain was unlikely to stick around long term. Now the Quinn Hughes era has officially come to an end. Vancouver dealt the superstar defenceman to the Minnesota Wild on Friday for forwards Marco Rossi and Liam Ohgren, defenceman Zeev Buium and the Wild’s first-round pick in the 2026 NHL entry draft. “It’s definitely not an easy day for the franchise here,” Canucks general manager Patrik Allvin said on a video call Friday night. “Quinn Hughes has been a big part of the organization and a great person and a great hockey...",
      "Vancouver Canucks general manager Patrik Allvin talks about how the trade for star defenceman Quinn Hughes came to be, how long it has been in the works, and the impact of losing the captain of the team.",
      "Quinn Hughes Traded to Wild from Canucks in Blockbuster Deal After Devils Rumors Bleacher Report",
      "Hughes traded to Wild by Canucks in blockbuster deal NHL.com"
    ],
    "image_url": "",
    "titles": [
      "NHL trade grades: Report cards for Hughes, Jarry deals",
      "NHL Trade Grades for Quinn Hughes to the Wild, Marco Rossi, Zeev Buium to the Canucks - Bleacher Report",
      "Canucks trade captain Quinn Hughes to Wild",
      "Minnesota Wild Acquires Defenseman Quinn Hughes From the Vancouver Canucks - NHL.com",
      "Canucks move quickly to make most out of Hughes trade in deal with Wild - NHL.com",
      "Canucks trade Quinn Hughes to Wild",
      "‘Not an easy day’: Canucks’ Allvin breaks down Hughes trade to Wild",
      "Quinn Hughes Traded to Wild from Canucks in Blockbuster Deal After Devils Rumors - Bleacher Report",
      "Hughes traded to Wild by Canucks in blockbuster deal - NHL.com"
    ],
    "url": "https://www.espn.com/nhl/story/_/id/47286518/nhl-2025-26-trade-grades-deals-report-cards-rankings-biggest-deals",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPMThtZkotNWhodDhVd2NYRDJER0Y2N3hXSkpkUzNtSnZ1OTdxOFZfNWFLdTZjenNHVl9kaDJ2dmFiclpqUTVVdExfa2VDX0ZzOTg0OGdpbXhoWVpBcktPSGRWQlpKSkFXUGQzZ3FDTkVaQUhlX1ktd1cxQkZMM2lZSWlFWHJ0dWhxMExmR09JYy1WY19Kd1gySmFKdlE4cmF2aTQ5dnJUdllVU2FZb3pF?oc=5",
      "https://globalnews.ca/news/11576557/canucks-trade-captain-quinn-hughes-to-wild/",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQUXhuN2t6ZktkNzRWeFE1MHJ1clN3eEs2aEJaUGo3WjJPOFQtRDdSSEZiRkY2MUJCUTNrbGZpSlBBN3F1T012c2dsbmtiZC01Z3FjMVpXbkVQalVBemFQcDhjZVdIVWFGUHBkM1QyTGxpTFVrWFgyZXp6R1A2RkR4VnR5UU9EQlJpQ1JjcVJWaHpJM3piOHdOZWVTOW1EVmlEdk00ZFJ6VQ?oc=5",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZnpYdWF5MWwwcnZWc25ndHJqWWowWmdoX0dwMC1Zc2U0Y1JZbVlVckNEVWIyQXY3VlZ6WlNtcG1WQm41WE50SjRRTzJwYXo5YUg3cGY0SHdqQklNMU9MNTJ0STlYOUlOMi1lb0thNnhEQ0RwcE9QdlpMZGZ1b3Z4Ni1mVEM2OE9FRmJJLWZqZmJYTXF5TmJSWlpR?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOMFZSQ0RCeTdYbDlRU1ZITVZwQS1jWUhDYkFXeTRsN2JnbXFEVnpvU0k4dV9YZGxKcEZlNUFKclQ0NDVKeHlvNzhtU1I1Ql82VEFYbDVBNlRGZUY2dFVqWU8wTTRILTA2QTFWNU9xZ0x6ajBGMFNRSXJBdDJuempzMmxpU0NvOVFFdlN4akFqa2FrZ09YUUJRbGFrWFFNbURPb3ptb3RKZWNFRzRoaVNneVZuTnM?oc=5",
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPT1BzS3VCSHdxSUprTF9QRHBoc2NCY1plZE03Z3ZXVmZMTHlvTkFDQ05sTDE5cXdKUEZneG9odmFmYVlJUlltbzRQMTVOZWpCYW5FOTBzQUdVc3p6RmJpSVBmd25Uc3RrUjM2UlpVQlR0N3Z2SmlUQmlnUnNndE1xa3FMckVjang2RUNr?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nhl/story/_/id/47286518/nhl-2025-26-trade-grades-deals-report-cards-rankings-biggest-deals",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.904,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.824,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Vancouver Canucks have traded defenseman and team captain Quinn Hughes to the Minnesota Wild. In exchange, the Canucks receive forwards Marco Rossi and Liam Ohgren, defenseman Zeev Buium, and the Wild’s first-round pick in the 2026 NHL entry draft. Canucks general manager Patrik Allvin acknowledged Hughes' significant impact on the organization.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Gunman kills two US soldiers and interpreter in Syria patrol",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 13:56:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Deutsche Welle",
      "Reuters",
      "The Guardian",
      "Bloomberg",
      "ABC News",
      "Al Arabiya",
      "Financial Times",
      "Washington Post",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "dw.com",
      "news.google.com",
      "theguardian.com",
      "abcnews.go.com",
      "ft.com",
      "washingtonpost.com",
      "forbes.com"
    ],
    "snippets": [
      "US Central Command says lone gunman was 'engaged and killed' after launching attack in central Syria.",
      "Two US soldiers and a civilian interpreter were killed in the attack, according to the US Central Command.",
      "US Central Command said two service members and a civilian were ambushed by a lone \"Islamic State\" gunman in central Syria. It is the first deadly incident towards US forces since Bashar Assad was ousted last year.",
      "Two U.S. soldiers, one interpreter killed in Syria, Pentagon says Reuters",
      "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria Reuters",
      "US Central Command reports an ambush on Saturday, the first attack to inflict US casualties since fall of Bashar al-Assad Two US army soldiers and one American civilian interpreter have been killed and several other people wounded in an ambush on Saturday by the Islamic State group in central Syria,",
      "Two US Soldiers, Civilian Killed in Syria, Pentagon Says Bloomberg.com",
      "Two U.S. soldiers and an interpreter were killed in an ambush by an apparent ISIS gunman in Syria Saturday, officials said.",
      "Two US soldiers, one interpreter killed in ISIS ambush in Syria: CENTCOM Al Arabiya English",
      "Trump threatens retaliation against Isis for assault on a counterterrorism operation",
      "A joint U.S.-Syrian security patrol was attacked in the city of Palmyra, the Pentagon and Syria’s state news agency reported.",
      "No group has claimed responsibility for the attack, but early intelligence reportedly suggests the Islamic State was responsible."
    ],
    "image_url": "",
    "titles": [
      "ISIL kills two US soldiers, interpreter in Syria’s Palmyra, Pentagon says",
      "Three Americans killed by IS gunman in Syria, US military says",
      "US citizens killed by 'IS gunman' in Syria, CENTCOM says",
      "Two U.S. soldiers, one interpreter killed in Syria, Pentagon says - Reuters",
      "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria - Reuters",
      "Three Americans killed in Syria by suspected Islamic State gunman, Pentagon says",
      "Two US Soldiers, Civilian Killed in Syria, Pentagon Says - Bloomberg.com",
      "US soldiers, interpreter killed during ambush in Syria: Officials",
      "Two US soldiers, one interpreter killed in ISIS ambush in Syria: CENTCOM - Al Arabiya English",
      "Two US soldiers and a civilian killed in attack in Syria",
      "2 U.S. soldiers, civilian interpreter killed in attack in central Syria",
      "3 Americans Killed In Syria Attack"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/joint-syrian-us-patrol-comes-under-attack-near-palmyra-state-media?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c9d9vpxjp2go?at_medium=RSS&at_campaign=rss",
      "https://www.dw.com/en/us-citizens-killed-by-is-gunman-in-syria-centcom-says/a-75147344?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSUJkV1RTV3ZEelpoQ2JSNEF4OUI1VU8wSGZxSlc4Y1ktbEJuc2wyMnNqaDRnc09kZnl1R0E2aUN0UFRXWWUyc3NOWUhMa1J0QUdVOHNQMEVqcmd2cmtfNUwzV3RjRVd5WWl1VDl1T3dnSDlpSzU3aU00eUhXaEpZZnZ1VzVJNHpqQW5XODh2VkNzU1Z3eTlsb0ljZnY3RVlldWtkdm0wSVpXLTV1OGJwbVpB?oc=5",
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPWXlEbkhJWU5LaWg5dUZEMHduZnpYdWNWY2J2OVRhNU8wbXJ6OEJFbThOY1BnQlhjWDdFQ0xYem80RXBjMDV4OUNlN0JtOFJnXzd5My1KZ0c3eWtyLTFneS12bU9tMVlEOE90TkxzbVFzeEdxbUZPTEp0Ri10MUFxY0xVRVI4VUxKMWs5TFg2SXBZQ295WTdlUE5wcmg4WTcxbGhTWWdieWJKQ1g2Qi1hSHF4d0QtWjRaRHFiR1ZvVEdDUQ?oc=5",
      "https://www.theguardian.com/us-news/2025/dec/13/americans-killed-syria-islamic-state",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxQRVJ4NGdPMjViZ1hKajFzdzlmc1J4S0gtaXZGMkpweHZ4bkl4VWVBN3k2LXZ1dF95NTdvaW5GWVN3RnNUX3dKMDRQQXFFazl4bWJOSW5RSzNsVlNSUGlLT2VNR1NrQ3lWRjZvMmlsYzVZcGJ5UEZKcWRib2l6OTZaX3BXbmQ0a09NMkJPWmNPOFNjWUR1bERVRENVNlUtT2ZOb0N0djZjaXcxYW9mUlN5TURtdw?oc=5",
      "https://abcnews.go.com/International/us-soldiers-civilian-interpreter-killed-ambush-syria-apparent/story?id=128376036",
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxOT3hsczh3VUowQS0tUGdCcmR2TUpkSG9jc25XMnAzZ3U0eGw2a2VaT0pnalZ6NHpsOThBSEN6c2RRWDF6V0pKV3ZKN3dMVTYyaGRHajB3eklCM0ZGbVZYUFBsNGRKd09ySWhFUEwwWV9TM0ozTlRod1NncFpxWXFPYXpLMV9sQmdyZVNUelliNWszUDlHZXFWaVN4WXRuZGx0RHFxWm1OdldQcU9iUVIzNTRZMVhxZHE1S1VEOU9zcnBvU3Q4YlpTOHhR0gHPAUFVX3lxTE5vVjdhUHhzUFRralZQM1RlbzhxcUFWT1V6dkREWlMxUWVfbXZzZnFjS040bWdGU3p5dm9NYWVxSE1tUFV0a1NkMmNuUVhpQWZmeHhsV01yX1pvNlBRbnZVRjg1NHVCTVdkdHkwcHotOFRnNzJ2ZTdJdzA3bWFZSGE3NldqWmJDOFc4X3ZoVzFmRjc5TTlibmFjaEktdmhkWXNCSmhqWVB1dzIwOUpVcEthSWw2aWdpdGFybUFoQWxHdExnUkFkekRGZGlEUTQ1Zw?oc=5",
      "https://www.ft.com/content/51f72b21-acce-4993-835d-3b3e656948fd",
      "https://www.washingtonpost.com/world/2025/12/13/syria-attack-soldiers-killed/",
      "https://www.forbes.com/sites/saradorn/2025/12/13/3-americans-killed-in-syria-attack/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/joint-syrian-us-patrol-comes-under-attack-near-palmyra-state-media?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.832,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A lone gunman ambushed a joint U.S.-Syrian security patrol in Palmyra, central Syria, killing two U.S. soldiers and a civilian interpreter on Saturday. U.S. Central Command reports the attacker, believed to be linked to the Islamic State group, was killed at the scene. This is the first deadly attack on U.S. forces in Syria since Bashar al-Assad was ousted in 2024. Several others were wounded.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Hockey player Bobby Rousseau dies at age 85",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Dec 2025 18:41:35 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Robert (Bobby) Rousseau, a four-time Stanley Cup champion with the Montreal Canadiens in the 1960s, has died. He was 85.",
      "Rousseau dies at 85, 4-time Stanley Cup winner with Canadiens NHL.com"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/12/ed76508b079f280df55180254d01ac217d2664beb5a7558f29d2f9d7df7486b0.jpg?quality=65&strip=all",
    "titles": [
      "Four-time Stanley Cup champion Rousseau dead at 85",
      "Rousseau dies at 85, 4-time Stanley Cup winner with Canadiens - NHL.com",
      "Robert Rousseau, four-time Stanley Cup champ with Canadiens, dead at 85"
    ],
    "url": "https://globalnews.ca/news/11576715/canadiens-robert-rousseau-dies/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQeWVDdm44S2tSWTlLZ0RGb0VURFhxb2lHTTdWOE5DcTNseWh1cTVIRDJDVHo4anF3M1FTZWlPRjhRV0R3dTNCOFhwbFdMZ3lCMWJmQl9RVWFoTnZRUWVOVDc4N24zcEs1cEEzSjVuRWRWc0YzUWtrbGRjUEFwcHkwWlBiTzFqOURFZS1EWjFrRWlzeFdDeWRLdzJNSkwwWEMwalBnQzBYYw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11576715/canadiens-robert-rousseau-dies/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.791,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: dead); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Robert (Bobby) Rousseau, a four-time Stanley Cup champion with the Montreal Canadiens during the 1960s, has died at the age of 85. Rousseau was known for his successful NHL career and significant contributions to the Canadiens' championship teams.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Fans upset after Messi event in Kolkata ends very quickly",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 11:59:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "CBC News",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "dw.com",
      "cbc.ca",
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "The Inter Miami and Argentina forward is in India for a tour, taking in events in Kolkata, Hyderabad, Mumbai and Delhi.",
      "Thousands packed a stadium in eastern India for Lionel Messi’s visit. Heavy security and limited access left many waiting for hours without seeing him. After he left early, some fans reacted angrily, citing ticket price.",
      "Lionel Messi's tour of India kicked off chaotically on Saturday as fans threw objects, ripped up seats and invaded the pitch at Kolkata's Salt Lake Stadium after the Argentine soccer great made only a brief appearance at a ticketed event.",
      "Lionel Messi's \"GOAT Tour\" of India was marred by chaotic scenes on Saturday after fans threw ripped up seats and invaded the pitch.",
      "A stop on Lionel Messi's 'GOAT' tour in India went wrong as fans invaded the pitch and destroyed the stadium after the event was cut short."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9e7c/live/40bf1c10-d813-11f0-aae2-2191c0e48a3b.png",
    "titles": [
      "Angry fans throw chairs and bottles at Messi event in India",
      "Fans storm pitch after Messi leaves India event early",
      "Organizer arrested after fans rip up seats, throw objects during Lionel Messi visit to India",
      "Messi statue event in India marred by fan unrest",
      "Fans invade pitch and destroy stadium after Messi event ends early"
    ],
    "url": "https://www.bbc.com/news/articles/c4g66nll48do?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.dw.com/en/fans-storm-pitch-after-messi-leaves-india-event-early/a-75139863?maca=en-rss-en-top-1022-rdf",
      "https://www.cbc.ca/news/world/soccer-fans-messi-india-9.7014882?cmp=rss",
      "https://www.espn.com/soccer/story/_/id/47292297/lionel-messi-statue-unveiling-india-marred-fan-unrest",
      "https://www.skysports.com/watch/video/13483088/lionel-messi-event-in-india-goes-wrong-as-fans-invade-pitch-and-destroy-stadium"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c4g66nll48do?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.788,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.775,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Lionel Messi's \"GOAT Tour\" in India began in Kolkata, where thousands attended a ticketed event. The event was cut short after Messi made only a brief appearance, leading to unrest among fans. Some attendees threw objects, ripped up seats, and invaded the pitch at Salt Lake Stadium, citing frustration over high ticket prices and limited access.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "New photos show Epstein with Trump Clinton Bannon Prince Andrew Gates",
    "domain": "politics",
    "source_domain": "bbc.co.uk",
    "location": "global",
    "published": "Sat, 13 Dec 2025 04:15:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "ABC News",
      "Reuters",
      "Associated Press",
      "Bloomberg"
    ],
    "domains": [
      "bbc.co.uk",
      "dw.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "Republicans accuse Democrats of playing politics with release of Epstein photos",
      "Over a dozen photos showed disgraced financier Jeffrey Epstein spending time with Donald Trump, Bill Clinton, far-right personality Steve Bannon, Microsoft's Bill Gates, among others.",
      "Democrats on the House Oversight Committee have released more photos from the estate of Jeffrey Epstein, including ones of Donald Trump and Bill Clinton.",
      "House Oversight Democrats released more photos from the estate of Jeffrey Epstein, including some never-before-seen images of Epstein with famous men whose connections have previously been reported.",
      "Trump appears in newly released photos from Jeffrey Epstein's estate Reuters",
      "House Democrats release photos of Trump, Clinton and Andrew from Epstein’s estate AP News",
      "Trump, Clinton, Bannon Included in Release of Epstein Photos Bloomberg.com"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0lqdxrf.jpg",
    "titles": [
      "Democrats release photos of Trump from Epstein estate",
      "Democrats release Epstein photos with Trump and Clinton",
      "Newly released photos from Epstein estate include images of Trump, Clinton",
      "WATCH:  Newly released photos from Epstein estate include images of Trump, Clinton",
      "Trump appears in newly released photos from Jeffrey Epstein's estate - Reuters",
      "House Democrats release photos of Trump, Clinton and Andrew from Epstein’s estate - AP News",
      "Trump, Clinton, Bannon Included in Release of Epstein Photos - Bloomberg.com"
    ],
    "url": "https://www.bbc.co.uk/sounds/play/p0mnc4k5?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.dw.com/en/democrats-release-epstein-photos-with-trump-and-clinton/a-75139654?maca=en-rss-en-top-1022-rdf",
      "https://abcnews.go.com/US/newly-released-photos-epstein-estate-include-images-trump/story?id=128345597",
      "https://abcnews.go.com/US/video/newly-released-photos-epstein-estate-include-images-trump-128361073",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxNNU9JZ09oU3daeUZTR1dxRTJ5QXoxeENCbDdXOXNrbXhpSTAzVENPRDVzcTZDalJiREJpUkpZeF9oVTRMOV85VnZnUThWczVqTmhrdGZKTWRyc0RpTjJvNjBRcUhUZFMybDl0NVpGYlk0TVQ4dFhzQmFWZ1hYOHBpOTNZVFpqUXZ1b0xjNm01czNOM2EzVFp6Z0ZsVQ?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUWxCZk5FSklmMUcySjlRaXNDYlVHRTNnaFdNSzNUQWJ6TGZLYnBpMEdpa1ctQk5wWFRfVm1qb2lmSDU4eDF6V1h0NGViMWhKZ0UweFlJbGxrTUk2dUpTaTFKRzc5ODlkeWdiQ2ZBTXE1emFtUGM0d3NxMl9rLTgtSHJYc0pVM3RfSDNRVzJnLTlUczJwRHRydHpfdHZFZkotOVBTWWJrOUFSTU10RzFodnhzaWY?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNT3I0Q3JreDc4S1g0WjdfQkNNdFNsZlNyQ0ZrUDExTjJ1THhUN21GX0xmdVF4ZVVvZ1ZKTDByeWxSRTk2bjZWQXdGb1dfSThHdlJjbDh0THE0LTJEZUpVZU9EX2tad2JrUVJwZGo1VWdlS2RILTFJeE9VbVRzQXFzek9XMENZSmNEb3N0X1AzR3h3dmtWUElTd1AtRmdmd3lCV0p5Rm9xWlVRQkVCOXNtbG9R?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.co.uk/sounds/play/p0mnc4k5?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.636,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.771,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems to be more about generating sensationalism than providing useful information or awareness. It doesn't appear to offer actionable insights or report on solutions to problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On December 13, 2025, House Oversight Committee Democrats released additional photos from Jeffrey Epstein's estate, showing Epstein with public figures including Donald Trump, Bill Clinton, Steve Bannon, Prince Andrew, and Bill Gates. Republicans criticized the release, calling it politically motivated. The photos include some images not previously made public.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Former Michigan football coach charged with stalking and home invasion",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 09:08:39 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Sports Illustrated",
      "ABC News"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Fired University of Michigan football coach Sherrone Moore \"barged his way\" into the apartment of a woman with whom he had been having an affair after she reported the relationship to the school and he lost his job, prosecutors said.",
      "Fired Michigan football coach Sherrone Moore charged with stalking, home invasion Reuters",
      "$29 million college football coach surges as favorite to replace Sherrone Moore at Michigan Sports Illustrated",
      "Moore is now out on bond after appearing in court on Friday following his firing and arrest on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Fired Michigan football coach charged with home invasion and stalking",
      "Fired Michigan football coach Sherrone Moore charged with stalking, home invasion - Reuters",
      "$29 million college football coach surges as favorite to replace Sherrone Moore at Michigan - Sports Illustrated",
      "WATCH:  Former Michigan football coach Sherrone Moore appears in court Friday"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643517/michigan-football-coach-sherrone-moore-charged-stalking",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNRTZYdUdCMG1GX0hTNkRibXhUWXp4eVAtcnVERjZDR3B6VVB2QTk3VjJsSHY5MzQtOFEtOE9ULUxFYTNWaHFmSVI5SDJGZ2Zyd3BDSEJqX1ItNDlLbmdoamhlamN6b25XcVlfeUNmYm1ySU5lSTVFUk5ONHl6RmlpdHktbWE2eXZldHVMYjYtWmFFZVNneWdWVHNDWlVLWnFLZjRiaVF5c0F6RnNxT0xzVFpkekt6OVpRLURSNXNKMU4?oc=5",
      "https://news.google.com/rss/articles/CBMi7AFBVV95cUxQMFBQSG1LUV9pRFEwMXdpRTU3Z0l2eDE4T05pSTlVVU84cUZRLUI0TGxqTGI3SVpwM21IbVQ5TGxPUFlONVVVelZ4Y2RIYzZSRDRBMTBJMDVZNDRZQVVoejFKYTVJMHRUUWowNVIyNU1YUkVTUVhJZFkwOWtmQUhHNjlfc3ROWnZBdk01QkE0Z1VIbEo2NUltbXVid2Y2S0dKVnM1R0ZReVgtV3dBc0p4NzVqYUNFV01mSG8xV2FNdU9ac25jWWREeGYxc3Z4OUllNl9tbV9LTGlTYllkN3lobzNZUjZYUFJOZGl4NQ?oc=5",
      "https://abcnews.go.com/Entertainment/video/former-michigan-football-coach-sherrone-moore-appears-court-128375227"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643517/michigan-football-coach-sherrone-moore-charged-stalking",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.837,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.771,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former University of Michigan football coach Sherrone Moore has been charged with stalking and home invasion after allegedly entering the apartment of a woman with whom he had an affair. Moore was fired following the woman's report to the university and was arrested on Wednesday. He appeared in court on Friday and is now out on bond.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nobel winner Narges Mohammadi arrested again in Iran",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 14:17:23 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Rights groups condemn re-arrest of Nobel laureate Mohammadi in Iran Reuters",
      "The human rights activist was released on furlough from prison last year, but was detained again on Friday, along with several other human rights activists.",
      "Iran arrests Nobel Peace Prize winner Narges Mohammadi, supporters say The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Rights groups condemn re-arrest of Nobel laureate Mohammadi in Iran - Reuters",
      "Iran Arrests Nobel Laureate Narges Mohammadi Amid Broader Crackdown",
      "Iran arrests Nobel Peace Prize winner Narges Mohammadi, supporters say - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQOTdNY3RJY21PeXJZQllMelZ2dHF3T3RRbmFKQlJRNHlnZ3pTZDdpcFAwMHc4NGFudGNnVEhTVGlPLURNQU1xbDZxZDNOaU80azhwR3gtU25jTVpsQUNBaEtuVVJfQ3FiTl9fZTE1WktuUzY2eVVlZDg2YXRvS0RiYkRzUkI3ekxxTEJBLWJWTUI4T2Y2aVRWYmFrcFRrYmVpVzVmOHFXWkZreWJKNGhHX0ZYaHQyU19GWWpXQWhzVVliUQ?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/12/world/middleeast/iran-arrests-narges-mohammadi.html",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYTBUcGxfS1puWWVNM1FWYkkzZHBJUW9JemRlTV9Od2VrQlAzbHoxXzJnYU1Ub1RrZC1zSXF3QjQ1SjhqcDdUVERuWTRxTTdRWFlENWMwenhqeDMySGtmLVpYOXNuYmtOdEdwcHdpa2xVSDZtOW9ibTNSTHpUeUZkaHR2MmpqZ1NsWG9MU01mdEs1QmZjWjczeTJMZjZaNlQxVDlZ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQOTdNY3RJY21PeXJZQllMelZ2dHF3T3RRbmFKQlJRNHlnZ3pTZDdpcFAwMHc4NGFudGNnVEhTVGlPLURNQU1xbDZxZDNOaU80azhwR3gtU25jTVpsQUNBaEtuVVJfQ3FiTl9fZTE1WktuUzY2eVVlZDg2YXRvS0RiYkRzUkI3ekxxTEJBLWJWTUI4T2Y2aVRWYmFrcFRrYmVpVzVmOHFXWkZreWJKNGhHX0ZYaHQyU19GWWpXQWhzVVliUQ?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.84,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.764,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the human rights situation in Iran, which is a useful context. However, it doesn't report on any solutions or improvements, and its focus is more on the negative aspects of the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nobel Peace Prize laureate and human rights activist Narges Mohammadi was re-arrested in Iran on Friday, according to supporters and rights groups. Mohammadi had previously been released on furlough from prison last year. Several other human rights activists were also detained. Rights organizations have condemned the arrests.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Group sues President Trump over new White House ballroom",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 12:02:40 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Trump's White House ballroom construction draws lawsuit from preservationists Axios",
      "Trump sued by preservation group to halt White House ballroom Reuters",
      "The lawsuit argues that President Trump was legally required to get federal approvals before demolishing the historic East Wing of the White House."
    ],
    "image_url": "",
    "titles": [
      "Trump's White House ballroom construction draws lawsuit from preservationists - Axios",
      "Trump sued by preservation group to halt White House ballroom - Reuters",
      "Trump sued by preservation group seeking to halt White House ballroom construction"
    ],
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9oMlJlakZFMzRlTjNMUEF2Qjd5TlcwWEN5UzFaMTFESVRlc0RJZ3hsWnpjalhwdWFZcC12Q1FHXzdvcUQ4RUV3SkxzY1kyUmNReWdMMVBXNXJmLVRmajAwRFJDeWNURVBPZHVrdC1Ybi1NaTN5NWc?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQUmxaSnEySERmWU93aUlxcC10QnNTVXZTX2pMNzhFTGcyYUFlQXEtU1NBQ3RIZWROZDBTX0s1ZktXQ2NqZTI3NlZ0TkJDbkNhOHFIemVjMmhZbGM1c2pnUHIzX09MUVdrSE5ydWVvaFNkOU82Z18xSHZWZ0x5UXNxWGI0ejB3Yi1vaU9PTVdobEdzT2pFRFBISjZQX0NqN1JGVEJoRVRWZjNsZW1hZmNfRA?oc=5",
      "https://www.cnbc.com/2025/12/12/trump-lawsuit-ballroom-white-house-east-wing.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9oMlJlakZFMzRlTjNMUEF2Qjd5TlcwWEN5UzFaMTFESVRlc0RJZ3hsWnpjalhwdWFZcC12Q1FHXzdvcUQ4RUV3SkxzY1kyUmNReWdMMVBXNXJmLVRmajAwRFJDeWNURVBPZHVrdC1Ybi1NaTN5NWc?oc=5",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.789,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.761,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some awareness about the conflict between development and preservation, but without more context, it's hard to say how useful it is to the reader. It doesn't report on solutions, but it does highlight an ongoing issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A preservation group has filed a lawsuit against President Trump to stop the construction of a new ballroom at the White House. The group claims Trump failed to obtain required federal approvals before demolishing the historic East Wing. The legal case is ongoing, with preservationists seeking to halt further work on the project.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Churches use protest Nativity scenes to talk about immigration raids",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 10:04:21 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Supporters of the displays say the Bible is on their side, but critics call the scenes sacrilegious and politically divisive, accusing the churches of abusing sacred imagery.",
      "Church Nativity scenes add zip ties, gas masks and ICE to protest immigration raids AP News"
    ],
    "image_url": "",
    "titles": [
      "Church Nativity scenes add zip ties and gas masks to protest immigration raids",
      "Church Nativity scenes add zip ties, gas masks and ICE to protest immigration raids - AP News"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643532/church-nativity-scenes-protest-ice-immigration-raids",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNYUthUFZFWjJkR3VXdGNTTFZ5ZDBHQ2ZTMnEwdk5sVk1USmJrUHExZHRQdklFSXQtSkRCWHFKYVY0M01iYkJrT2NKWlROby02TXhnajRuR3F1WnBLVG03TFlBS2xILWwxTHV6T3p4ODE3QVIwUDlkOHNNRW9qZHJQN0o5MmFkQkExaTBFa1JCUjFxaUxaWDRtN2lXQ1lmS1QzbmxrM3JXdUwtWkRvMEk0YmtkY2hmV0VZMzl3LQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643532/church-nativity-scenes-protest-ice-immigration-raids",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.858,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.747,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it raises awareness about a social issue (immigration raids) and how a community (the church) is responding. However, it doesn't provide actionable insights or report on solutions to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several churches have incorporated zip ties, gas masks, and references to ICE into their Nativity scenes to protest immigration raids. Supporters argue these displays align with biblical teachings, while critics claim they misuse religious imagery and create political division. The displays have sparked debate over the role of churches in political activism.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Chelsea manager Maresca says he felt alone before Everton win",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 19:17:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com",
      "skysports.com"
    ],
    "snippets": [
      "Chelsea manager Enzo Maresca says the past 48 hours are “the worst” since joining the club last summer.",
      "Chelsea manager Enzo Maresca expressed his unhappiness at a lack of support at the club and said he had just endured his worst period since arriving in the summer of 2024. Maresca didn't specify who he was referring to, but stressed it wasn't Chelsea fans. “The last 48 hours has been the worst since",
      "Enzo Maresca has described the 48 hours leading into Chelsea's 2-0 win over Everton as the \"worst 48 hours since he joined the club\"."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1a86/live/d72b9c10-d853-11f0-a8dc-93c15fe68710.jpg",
    "titles": [
      "'Worst 48 hours' since I joined Chelsea - Maresca",
      "Maresca slams lack of support at Chelsea after 'worst' period in his time at the club",
      "'Worst 48 hours at the club' - Confusion after Maresca's cryptic Chelsea revelation"
    ],
    "url": "https://www.bbc.com/sport/football/articles/cy95yqzenvjo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/maresca-slams-lack-support-chelsea-194110743.html",
      "https://www.skysports.com/football/news/12040/13483075/enzo-marescas-cryptic-chelsea-revelation-causes-confusion-worst-48-hours-at-the-club"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/cy95yqzenvjo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.745,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Chelsea manager Enzo Maresca described the 48 hours before the team's 2-0 win over Everton as his worst period since joining the club in summer 2024. Maresca expressed disappointment over a lack of support at Chelsea, clarifying that his comments were not directed at the fans.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Floods in Washington state cause damage and people are rescued",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 17:26:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "No fatalities reported in flooding, which prompted Trump to approve emergency declaration request from governor Record-breaking flood waters in Washington state have started slowly retreating after days of devastation that saw neighborhoods inundated, emergency rescues from cars and rooftops, and wi",
      "Record floods in Washington state trigger dramatic rescues and evacuations AP News"
    ],
    "image_url": "https://i.guim.co.uk/img/media/34c5bf5c252adf1cbf29c00e40954e7e7aca201f/400_0_4000_3200/master/4000.jpg?width=140&quality=85&auto=format&fit=max&s=caeec30c1a1c2731ab8e88126cee2ac5",
    "titles": [
      "Washington state flood waters receding after days of rescues and evacuations",
      "Record floods in Washington state trigger dramatic rescues and evacuations - AP News"
    ],
    "url": "https://www.theguardian.com/us-news/2025/dec/13/washington-state-flood-waters-recede",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxQRVc3Z0FCTWREd0pSbWgtaXdhYnBwZlVLekcyLXFKR01WdnhIMXdJUG5TclVCN1V3VmNYSHAzM0szY3l5Tld5LXFmZDRnVDNJQ2QxZmZ6QlRBQ056akRJN0k3WjRYUTB3T0RNQmM0RlhYWkFyYWNZZXdkaGQwODNJRnZja0o3TDhLUEthYWRGSVlVMVRnRzZlVA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/us-news/2025/dec/13/washington-state-flood-waters-recede",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.744,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a natural disaster, potentially helping readers understand the situation and its impacts. However, it doesn't seem to offer insights into solutions or improvements, nor does it provide a deep understanding of the causes or systems at play.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Record-breaking floods in Washington state caused widespread damage, leading to emergency rescues and evacuations. No fatalities have been reported. Former President Trump approved the governor's request for an emergency declaration. Floodwaters are now beginning to recede.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Liverpool beats Brighton two to zero with Ekitike scoring twice",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 18:05:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "aljazeera.com",
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Mohamed Salah came off the bench to assist the second of Hugo Ekitike's double as Liverpool returned to winning ways.",
      "Mohamed Salah came off the bench after just 25 minutes for Liverpool's Premier League clash with Brighton & Hove Albion.",
      "Mohamed Salah made history off the bench on his Liverpool return in a comfortable 2-0 win over Brighton as Hugo Ekitike's double took the champions up to sixth in the Premier League."
    ],
    "image_url": "",
    "titles": [
      "Salah assists Ekitike’s second as Liverpool beat Brighton in EPL",
      "Salah makes EPL history on Liverpool return",
      "Salah makes history on Anfield return as Liverpool beat Brighton to go sixth"
    ],
    "url": "https://www.aljazeera.com/sports/2025/12/13/salah-assists-ekitikes-brace-as-liverpool-beat-brighton?traffic_source=rss",
    "alternate_urls": [
      "https://www.espn.com/soccer/story/_/id/47294011/mohamed-salah-makes-premier-league-history-liverpool-return",
      "https://www.skysports.com/football/liverpool-vs-brighton-and-hove-albion/report/531284"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/12/13/salah-assists-ekitikes-brace-as-liverpool-beat-brighton?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Mohamed Salah returned from the bench to assist Hugo Ekitike's second goal as Liverpool defeated Brighton & Hove Albion 2-0. Ekitike scored both goals, helping Liverpool move up to sixth place in the Premier League. The match marked Salah's return and a return to winning form for Liverpool.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "US lifts sanctions on Brazilian judge Alexandre de Moraes and wife",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 00:23:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian",
      "Washington Post",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "US lifts sanctions on Brazil judge targeted by Trump Reuters",
      "Justice Alexandre de Moraes and his wife had been under Global Magnitsky sanctions after conviction of ex-president The US Department of the Treasury has lifted sanctions imposed on the Brazilian supreme court justice who oversaw the conviction of the former president Jair Bolsonaro. Justice Alexand",
      "The U.S. imposed sanctions on Brazilian Supreme Court Justice Alexandre de Moraes four months ago, calling former president Jair Bolsonaro’s prosecution a “witch hunt.”",
      "US Lifts Sanctions on Brazil Judge Who Led Bolsonaro Trial Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "US lifts sanctions on Brazil judge targeted by Trump - Reuters",
      "US treasury lifts sanctions on Brazilian judge who presided over Bolsonaro case",
      "Trump lifts sanctions on Brazilian judge targeted over Bolsonaro case",
      "US Lifts Sanctions on Brazil Judge Who Led Bolsonaro Trial - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQ21ERHZPVUwwRkhGV1RKME8zY25oTEZuS0tUVllXNlo1NEJMS1hfcHR4LUJkYTRzaEdfZEtDeXlLTUVoMzRtYnpELWxyc1dLYWZHQ1VfQmNMNl9LTkNKMnZYXzd0UThnR01ENXRjaEc2TTdDTnE4SnY0RS1tQ2lrZmp5am9GMFNiVWZ4R0g4QW00bm96UlRfbE5yZ3paYXpDRGFkZHVldk90UQ?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/12/brazilian-judge-sanction-lifted-bolsonaro",
      "https://www.washingtonpost.com/national-security/2025/12/12/brazil-sanctions-lifted-trump-moraes-bolsonaro/",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQVzFxQ1dkbGRHVlNkM1M1Q0xvSzI5NEdmejNGUjI2dDJEdkJHNV9DMnRXZktSbWVxWURFeDJjUVdmTm9TNUNXYm01cW9VZFN4Nmljc015ZzUxb0labVI3b0VueW5qV3FRWHVEX2dXMy1WWHVzUUZyTTlXS2RQMWF4M0pUSDFGT0pYRkg2UjREeGRvZGtramNJMUNWZ2ZHZUQtUjdpZ2txQ25qdEpX?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQ21ERHZPVUwwRkhGV1RKME8zY25oTEZuS0tUVllXNlo1NEJMS1hfcHR4LUJkYTRzaEdfZEtDeXlLTUVoMzRtYnpELWxyc1dLYWZHQ1VfQmNMNl9LTkNKMnZYXzd0UThnR01ENXRjaEc2TTdDTnE4SnY0RS1tQ2lrZmp5am9GMFNiVWZ4R0g4QW00bm96UlRfbE5yZ3paYXpDRGFkZHVldk90UQ?oc=5",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.571,
      "consensus": 0.888,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.732,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about changes in US foreign policy and their impact on individuals targeted by sanctions. However, it does not delve into the reasons for the original sanctions or their effectiveness, limiting its overall constructiveness.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. Department of the Treasury has lifted sanctions on Brazilian Supreme Court Justice Alexandre de Moraes and his wife. The sanctions were imposed four months ago after de Moraes oversaw the conviction of former president Jair Bolsonaro. The U.S. had previously criticized Bolsonaro’s prosecution, but the sanctions have now been removed.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Eight Bangladeshi UN peacekeepers killed in attack in Sudan region",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 18:38:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Eight people also injured in fighting with 'terrorists' in disputed region between Sudan and South Sudan.",
      "Bangladesh says peacekeepers killed, injured in Sudan UN base attack Reuters"
    ],
    "image_url": "",
    "titles": [
      "Bangladesh says six peacekeepers killed in attack on UN base in Abyei",
      "Bangladesh says peacekeepers killed, injured in Sudan UN base attack - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/bangladesh-peacekeepers-killed-attack-un-base-abyei-sudan?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQaDI1WERfT0tUME02NlRQVkJnMXlQZnBRVlQ4UE02RWRoZUthTnVpZ0Q1N3Q2dzlDR0JCWDd1SWlydVN0RDBfRzhiTkJ1SGdnUDVvMGgwRWZYNS1mX0NTczVpWGdqU2NuT0FfSGhuQzBPa3dkdFRuUWtvcDdxNXNfQXc4Z2tQWEh4a18xT3laSHJZb0J4VVJXZnV1SW5DaTl1anhhc19rOXNxbzAwd0V0UEt3RVcxWVJpbHVR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/bangladesh-peacekeepers-killed-attack-un-base-abyei-sudan?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.723,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a violent incident in Abyei, but it lacks depth or insight into the causes, impacts, or potential solutions to the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Eight Bangladeshi UN peacekeepers were killed and eight others injured in an attack by armed groups on a UN base in a disputed region between Sudan and South Sudan, according to Bangladeshi officials. The incident occurred amid ongoing violence in the area. The UN and Bangladesh condemned the attack and called for accountability.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Chelsea beats Everton 2 to 0 with Palmer scoring",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 14:49:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Chelsea went back into the top four as Cole Palmer got himself on the scoresheet in a 2-0 win over Everton.",
      "Cole Palmer showed his importance to Chelsea as the England international found the net to help the Blues put a difficult run of form behind them with a 2-0 victory over Everton at Stamford Bridge.",
      "FREE TO WATCH: Highlights from Chelsea’s win against Everton in the Premier League."
    ],
    "image_url": "",
    "titles": [
      "Chelsea ratings: Palmer, Neto, Gusto 8/10 in Everton win",
      "Palmer strikes as Chelsea get back on track with Everton win",
      "Palmer back in the goals as Chelsea beat Everton!"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47292377/chelsea-ratings-palmer-gusto-shine-win-everton",
    "alternate_urls": [
      "https://www.skysports.com/football/chelsea-vs-everton/report/531282",
      "https://www.skysports.com/watch/video/13482985/chelsea-2-0-everton-premier-league-highlights"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47292377/chelsea-ratings-palmer-gusto-shine-win-everton",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.708,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Chelsea defeated Everton 2-0 at Stamford Bridge, with Cole Palmer scoring for the Blues. The win moved Chelsea back into the Premier League's top four and ended their recent poor run of form. Highlights of the match are available to watch.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "South Carolina quarterback LaNorris Sellers may return next season",
    "domain": "business",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 14:29:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "South Carolina quarterback LaNorris Sellers is nearing a deal to return to the school for 2026, sources told ESPN's Pete Thamel.",
      "The Gamecocks are closing in on a result that could stabilize the program and alter the transfer quarterback market"
    ],
    "image_url": "",
    "titles": [
      "Sources: Sellers finalizing return to South Carolina",
      "South Carolina QB LaNorris Sellers nearing deal to return to Gamecocks for 2026 season"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47293704/sources-lanorris-sellers-finalizing-return-south-carolina",
    "alternate_urls": [
      "https://www.cbssports.com/college-football/news/south-carolina-lanorris-sellers-gamecocks-2026-season-transfer-portal/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47293704/sources-lanorris-sellers-finalizing-return-south-carolina",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.705,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "South Carolina quarterback LaNorris Sellers is close to reaching an agreement to return to the school for the 2026 season, according to ESPN's Pete Thamel. The potential deal could provide stability for the Gamecocks and impact the transfer quarterback market. No official announcement has been made yet.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Russian attacks cut power for many homes in Ukraine",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 12:38:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com"
    ],
    "snippets": [
      "A ceasefire deal appears distant as energy facilities are hit in Ukraine; Russia says a drone kills two.",
      "Over a million households have been left without power after Russia's overnight drone and missile attacks. The strikes come on the eve of US-Ukraine talks in Berlin. DW has more."
    ],
    "image_url": "",
    "titles": [
      "Russian attacks cut power for thousands in Ukraine as peace talks press on",
      "Ukraine: Russian strikes cut power to thousands"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/russian-attacks-cut-power-for-thousands-in-ukraine-as-peace-talks-press-on?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/ukraine-russian-strikes-cut-power-to-thousands/live-75139974?maca=en-rss-en-top-1022-rdf"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/russian-attacks-cut-power-for-thousands-in-ukraine-as-peace-talks-press-on?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.701,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant international event and its impacts, contributing to readers' understanding of the situation. However, it does not appear to highlight any solutions or progress.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Overnight Russian drone and missile attacks in Ukraine have left over a million households without power and damaged energy facilities. Russian authorities report two deaths from a drone strike. The escalation comes ahead of scheduled US-Ukraine talks in Berlin. A ceasefire agreement remains out of reach.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Venezuela sends more oil to companies tied to Cuba",
    "domain": "politics",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 14:45:01 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Firms with ties to Cuba are getting a larger share of Venezuelan oil exports, as the island’s security agents boost President Nicolás Maduro’s defenses.",
      "Cuban foreign ministry called US military action ‘maritime terrorism’ under a policy of ‘economic suffocation’ Cuban officials have denounced the US seizure of the Skipper oil tanker off Venezuela ’s coast on Wednesday, calling it an “act of piracy and maritime terrorism” as well as a “serious viola"
    ],
    "image_url": "https://static01.nyt.com/images/2025/12/12/multimedia/12int-venezuela-cuba-oil-qcpz/12int-venezuela-cuba-oil-qcpz-mediumSquareAt3X.jpg",
    "titles": [
      "Venezuela Oil Tanker Seized by U.S. Was Part of Effort to Finance Cuba",
      "Cuba denounces US seizure of oil tanker off Venezuela’s coast as ‘piracy’"
    ],
    "url": "https://www.nytimes.com/2025/12/12/world/americas/venezuela-cuba-oil-tanker.html",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/dec/13/cuba-denounces-us-seizure-oil-tanker-off-venezuela-coast"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/12/12/world/americas/venezuela-cuba-oil-tanker.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.694,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the geopolitical dynamics between Venezuela, Cuba, and the U.S. However, without more context or depth, it's hard for readers to gain a deeper understanding or actionable insights.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Venezuelan oil exports are increasingly going to firms linked to Cuba, as Cuban security agents strengthen President Nicolás Maduro’s defenses. On Wednesday, Cuban officials condemned the US seizure of the Skipper oil tanker off Venezuela’s coast, describing it as “piracy and maritime terrorism” and a violation of international law.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Zoe Ball leaves Saturday radio show Emma Willis takes over",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 16:49:33 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Broadcaster Emma Willis will take over presenting the Saturday afternoon programme.",
      "Ball will be replaced by Emma Willis but will continue to host special programmes for the station Zoe Ball has announced she is leaving her role as presenter of her BBC Radio 2 show. Speaking on the show, the 55-year-old said she would be replaced by the broadcaster Emma Willis. Ball will present he"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3a5a/live/5ec84300-d83e-11f0-bc70-31f58a039043.jpg",
    "titles": [
      "Zoe Ball steps down from BBC Radio 2 Saturday show",
      "Zoe Ball to leave role as presenter of her BBC Radio 2 show"
    ],
    "url": "https://www.bbc.com/news/articles/cly512v8dxko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/tv-and-radio/2025/dec/13/zoe-ball-to-leave-role-as-presenter-of-her-bbc-radio-2-show"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cly512v8dxko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.689,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a change in a radio show's host lineup, but it doesn't contribute meaningfully to the reader’s understanding, decision-making, or sense of agency. It lacks depth or insight into why this change occurred or what it means for the program or its listeners.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Zoe Ball has announced she is stepping down as presenter of her BBC Radio 2 Saturday afternoon show. She will be replaced by broadcaster Emma Willis. Ball will continue to host special programmes for the station.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "John Cena wrestles his last WWE match against Gunther",
    "domain": "business",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 19:16:24 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "cbssports.com",
      "forbes.com"
    ],
    "snippets": [
      "All the information you need to watch John Cena's final match at WWE Saturday Night's Main Event live event in Washington, D.C.",
      "John Cena vs. Gunther closes Saturday Night's Main Event on December 13. Here's the start time, how to watch, and the full card.",
      "John Cena wrestles his final match in WWE at Saturday Night's Main Event in Washington, D.C. on December 13, 2025.",
      "WWE Saturday Night's Main Event 42 match card, start time and betting odds as John Cena faces Gunther in retirement match.",
      "WWE Saturday Night's Main Event 42 could feature a number of surprises, including John Cena defeating Gunther on his way out."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/09/06c5e45c-bb5f-49e4-b1fb-abfcecd820df/john-cena-wwe-gunther-saturday-nights-main-event-last-time-now-tournament-retirement-final-cbs-sports-pro-wrestling-dec-9-2025.jpg",
    "titles": [
      "John Cena final match: Start time, where to watch legendary wrestler on Saturday Night's Main Event",
      "WWE Saturday Night’s Main Event: What Time Is John Cena’s Last Match?",
      "WWE Saturday Night’s Main Event Start Time, Odds And Streaming Info On Dec. 13, 2025",
      "WWE Saturday Night’s Main Event 42 Match Card, Start Time And Odds",
      "WWE Saturday Night’s Main Event 42: 5 Potential Surprises and Returns"
    ],
    "url": "https://www.cbssports.com/wwe/news/2025-wwe-saturday-nights-main-event-date-location-john-cena-final-match-card-start-time/",
    "alternate_urls": [
      "https://www.forbes.com/sites/brianmazique/2025/12/13/wwe-saturday-nights-main-event-what-time-is-john-cenas-last-match/",
      "https://www.forbes.com/sites/alfredkonuwa/2025/12/13/wwe-saturday-nights-main-event-start-time-odds-and-streaming-info-on-dec-13-2025/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-42-match-card-start-time-and-odds/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-42-5-potential-surprises-and-returns/"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/wwe/news/2025-wwe-saturday-nights-main-event-date-location-john-cena-final-match-card-start-time/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: start; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "John Cena wrestled his final WWE match against Gunther at Saturday Night's Main Event 42 in Washington, D.C. on December 13, 2025. The event marked Cena's retirement from WWE competition. The match headlined the card, with fans able to watch live coverage and access start times and betting odds.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Police arrest two men after village Christmas tree cut down",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 15:46:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Police say they are in the process of charging a man with criminal damage after the tree was felled.",
      "Tree, which was planted more than 10 years ago, was felled hours after its Christmas lights were switched on Two men have been arrested in relation to a “disgusting act of mindless vandalism” after a Christmas tree which had stood in a village for more than 10 years was cut down. On Wednesday, the t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1601/live/d9223460-d831-11f0-94e7-8f2327f3d498.jpg",
    "titles": [
      "Men arrested after village Christmas tree cut down",
      "Two men arrested after Christmas tree in Durham village chopped down"
    ],
    "url": "https://www.bbc.com/news/articles/c62nnpez1l4o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2025/dec/13/two-men-arrested-after-christmas-tree-in-durham-village-chopped-down-hours-after-lights-switched-on"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c62nnpez1l4o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.681,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a local incident but does not offer any deeper insights or actionable information for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Police are charging a man with criminal damage after a Christmas tree, which had stood in a village for over 10 years, was cut down hours after its Christmas lights were turned on. Two men have been arrested in connection with the incident. The investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Chinese Coast Guard sprays water at Filipino boats three hurt",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T09:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Authorities say three Filipino fishermen were injured when the Chinese Coast Guard fired water cannon at their boats. The incident comes amid rising confrontations in the South China Sea.",
      "Philippines says fishermen hurt, boats damaged by China in South China Sea Reuters"
    ],
    "image_url": "",
    "titles": [
      "Philippines says China Coast Guard damages fishing vessels",
      "Philippines says fishermen hurt, boats damaged by China in South China Sea - Reuters"
    ],
    "url": "https://www.dw.com/en/philippines-says-china-coast-guard-damages-fishing-vessels/a-75140557?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxNM0VCQktpRW5RYks4QWRoRlpNQ2oxcnljdWNSZ21JR0I5bVZaSHN2YXJpSHhmMUR2bm5YNkJaX3lmWDNsYUxfZ2pVR0ZtVlVKQ2dZamExNVo0TFNpeWw5NEVCM05ObXdRVzE2cGIyNjMzOW10NlEtNGlDVG5XOExxVEJOdHM5QmFmRXVqRXVHOXplY2c5bTVvY3ZnOF9WelJ0RXNrZGU3X0F3NHZWWVkxRW5pVGswUnljV3c?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/philippines-says-china-coast-guard-damages-fishing-vessels/a-75140557?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.739,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.676,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about ongoing territorial disputes and aggressive actions in the South China Sea. It provides useful context for understanding regional tensions, but it does not highlight any progress or solutions to the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Three Filipino fishermen were injured and their boats were damaged after the Chinese Coast Guard used water cannon against them in the South China Sea, according to Philippine authorities. The incident reflects ongoing tensions and confrontations between the Philippines and China in the disputed waters.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "SpaceX now valued at 800 billion plans to go public in 2026",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 05:17:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "SpaceX insider share sale sets $800 billion valuation amid possible IPO, letter shows Reuters",
      "SpaceX Sets $800 Billion Valuation, Confirms 2026 IPO Plans Bloomberg.com",
      "The valuation vaults past the previous record of $500 billion that ChatGPT owner OpenAI set in October."
    ],
    "image_url": "",
    "titles": [
      "SpaceX insider share sale sets $800 billion valuation amid possible IPO, letter shows - Reuters",
      "SpaceX Sets $800 Billion Valuation, Confirms 2026 IPO Plans - Bloomberg.com",
      "SpaceX sets $800 billion valuation, confirms 2026 IPO plans"
    ],
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMndjbzF6T1htWUhMazhmZEFSdl91SHJHRGZCVEt0Ry1XdFM5amcwZmgxei10R2xnUU83LTZ4MzJFeTRqYzl2UWZaNWNBVGVLUFJ6d0ZZVk1ZYThVWFNkbWVJcEtxTkhqYWQxUFdCdUNyb29Ia3hNbkRHa1RDMUhtRFpuRDliZU9tODBLTHlEWE5DUHptbzlOYldQaENfa3NTODA0?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOTlg3Rkc1U0ItTWhsLXhZWHBBVzFGQlRKNEJTbTFIeHhMLXEzektjWjRmY3V4eks0eHVGM2sxOEo5NERHd0o2WUdPb2pFRTNFeWNWdW5PX1FZSzZnMmc3eHlkNGlHdGEtMWxPcjRGbTQ0dWRBNk5iM1RvSTNyTHJpQi1BNWhzRDgzVW9UZXdEam1OUm9lMTl0RHdDNG9vUTVmeTYwcTdvZEFqeE1MeThGeExR?oc=5",
      "https://fortune.com/2025/12/13/spacex-ipo-plan-2026-secondary-offering-insider-share-sale-800-billion-valuation/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMndjbzF6T1htWUhMazhmZEFSdl91SHJHRGZCVEt0Ry1XdFM5amcwZmgxei10R2xnUU83LTZ4MzJFeTRqYzl2UWZaNWNBVGVLUFJ6d0ZZVk1ZYThVWFNkbWVJcEtxTkhqYWQxUFdCdUNyb29Ia3hNbkRHa1RDMUhtRFpuRDliZU9tODBLTHlEWE5DUHptbzlOYldQaENfa3NTODA0?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.654,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: possible); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "SpaceX has set its valuation at $800 billion following an insider share sale, according to a letter seen by Reuters. The company also confirmed plans for an initial public offering (IPO) in 2026. This valuation surpasses the previous record of $500 billion set by OpenAI in October 2025.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Investors look to old industries instead of big tech for 2026",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 14:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Wall Street Skips Tech and Goes Old School for Growth in 2026 Bloomberg.com",
      "One theme is becoming prevalent as the new year approaches: The technology giants that have been shouldering this bull market will no longer be running the show."
    ],
    "image_url": "",
    "titles": [
      "Wall Street Skips Tech and Goes Old School for Growth in 2026 - Bloomberg.com",
      "Wall Street Skips Tech and Goes Old School for Growth in 2026"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOWEtxWnYtamptMEZoV0x0OFQzWF9ndEt1WTU5VVk5elVBaUNKMmVXZ3JmT1I1bkRCMGlkR2dBMFN2cTloTjB4LUJEWHdyWVBJd3lDSTR5VkdQUUpCb0ZWZ1NWa2ZPTjF5SmZJaGlLOU9VY3phV29GdDBfbmFPcEtaeWJsbTNDb3BRcmZ5X2RkZFdrNHhxZ2x0aEZhcjBzVVprQXhiRzk5SndqQ1lCblVMYnV3?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/wall-street-skips-tech-and-goes-old-school-for-growth-in-2026"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOWEtxWnYtamptMEZoV0x0OFQzWF9ndEt1WTU5VVk5elVBaUNKMmVXZ3JmT1I1bkRCMGlkR2dBMFN2cTloTjB4LUJEWHdyWVBJd3lDSTR5VkdQUUpCb0ZWZ1NWa2ZPTjF5SmZJaGlLOU9VY3phV29GdDBfbmFPcEtaeWJsbTNDb3BRcmZ5X2RkZFdrNHhxZ2x0aEZhcjBzVVprQXhiRzk5SndqQ1lCblVMYnV3?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "As 2026 approaches, Wall Street investors are shifting focus away from major technology companies, which have driven recent market growth. Instead, there is increased interest in traditional sectors for potential gains in the coming year, according to Bloomberg. This marks a notable change in investment strategy heading into 2026.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Australia to ban high supermarket prices from July 2025",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 11:30:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms Bloomberg.com",
      "Australia will ban supermarket price gouging from July 1 under a new law the government says would protect shoppers from excessive grocery prices charged by major retailers."
    ],
    "image_url": "",
    "titles": [
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms - Bloomberg.com",
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPR0xsd3dacTJsYTVBTkNQZWZWTUxIWVcyU2p6aUQyYm16TXlGZ0JMUDRFUkthcW9ncUQwNzBvRmJBZ2pFeThVLWpxRThiUEpaejJuWTFjQ1ZReXN1SFUxQTVMRW12MEo0T2x1NEJTTGV6SkRtcmZNZHdwcXd6RDBtNzVoVzV0c2Rsc2VhUWhqdFd0WW5DWHM4eEpSeXdjM2lpTmNoYU9kU0VpamswdjRiVXJtdHpnUVlDZ0VsbzlyRQ?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/australia-to-ban-supermarket-price-gouging-in-sweeping-competition-reforms"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPR0xsd3dacTJsYTVBTkNQZWZWTUxIWVcyU2p6aUQyYm16TXlGZ0JMUDRFUkthcW9ncUQwNzBvRmJBZ2pFeThVLWpxRThiUEpaejJuWTFjQ1ZReXN1SFUxQTVMRW12MEo0T2x1NEJTTGV6SkRtcmZNZHdwcXd6RDBtNzVoVzV0c2Rsc2VhUWhqdFd0WW5DWHM4eEpSeXdjM2lpTmNoYU9kU0VpamswdjRiVXJtdHpnUVlDZ0VsbzlyRQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: ban); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Australia will ban supermarket price gouging starting July 1, 2025, as part of new competition reforms. The law aims to protect consumers from excessive grocery prices charged by major retailers. This measure is intended to increase fairness and transparency in supermarket pricing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Green energy stocks rise as tech companies use more power",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 08:30:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Green Stocks Are Big Winners as Tech Boom Drives Energy Demand Bloomberg.com",
      "It was supposed to be a glum year for green stocks as President Donald Trump pushed his Big Oil agenda. Instead, the sector is booming as artificial intelligence powers massive demand for all kinds of energy."
    ],
    "image_url": "",
    "titles": [
      "Green Stocks Are Big Winners as Tech Boom Drives Energy Demand - Bloomberg.com",
      "Green Stocks Are Big Winners as Tech Boom Drives Energy Demand"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNemdJZ0hOcnRpWjBhM2pqQmdIUURBVElUaGJPZU15N3I0eHpkZjRrQmstdmlhRTE1WkExemJiOExhMVliT1lHcHhhcGRodFZndllBSzBEdncwNmpDX0dPT3lPWFZQbU8yTVpjaWVtcGVObDZBWFRjUzVPc0NtdG9ZM3ZoU1R5MzhfM2ZkSFdOTDhMZXdyVzZVd2N0UXM1Vi14MlJCSnRwcWZHUTVZX3hEcW9lVQ?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/green-stocks-are-big-winners-as-tech-boom-drives-energy-demand"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNemdJZ0hOcnRpWjBhM2pqQmdIUURBVElUaGJPZU15N3I0eHpkZjRrQmstdmlhRTE1WkExemJiOExhMVliT1lHcHhhcGRodFZndllBSzBEdncwNmpDX0dPT3lPWFZQbU8yTVpjaWVtcGVObDZBWFRjUzVPc0NtdG9ZM3ZoU1R5MzhfM2ZkSFdOTDhMZXdyVzZVd2N0UXM1Vi14MlJCSnRwcWZHUTVZX3hEcW9lVQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.715,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.603,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Green Stocks Are Big Winners as Tech Boom Drives Energy Demand Bloomberg.com",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "States sue over new 100000 fee for H 1B visa applications",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 03:09:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Trump's $100,000 H-1B visa fee draws legal challenge from US states Reuters",
      "States to Sue Over Trump’s $100,000 H-1B Application Fee Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump's $100,000 H-1B visa fee draws legal challenge from US states - Reuters",
      "States to Sue Over Trump’s $100,000 H-1B Application Fee - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQVTNVdDhacU9mMW0zV1UtamNCQkhnMkNGZzFTSm9sMkRDOGstWGh5ZUxNeVZLaWMwWm83VW82UDkxZGpxME5WZ0VUQ3FpOGd4YjYxTDRzaWcwY3ZwZmVEUmJOWDRqdDhOX2FmOUFyTkprOGNJRkpwLVhuQVdkSFdsSnV6ZllHRVh6d016SFlmRzVUWF9td1ppTFB0X2d1YzhEbTZhSjA5ZUdULUlmSWxRUkJwUFZKY2xjZzllOXhHSGo3TVVs?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQUE5kZWNLVWFxUW1iWEVBX2VBOUhoU0VjQkJkZktiTFlNS1U4LW5LeVpxS2xValFLSjVvUWduUXZEY250MVMwNS1vQWZvY2ZMRkg2OEpRdTRkSlMyeHN6Qm5ZNEdDZjRfVFJoVC1kUk51ZVc2LUlzMjB2QmZkUmtqeFZVRG1GUXdaeFR5VFFjSnNwSGRVV1B0YkdKcm4zZldyNGw1cXlVcGsySDFxU3JLZWlJenk?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQVTNVdDhacU9mMW0zV1UtamNCQkhnMkNGZzFTSm9sMkRDOGstWGh5ZUxNeVZLaWMwWm83VW82UDkxZGpxME5WZ0VUQ3FpOGd4YjYxTDRzaWcwY3ZwZmVEUmJOWDRqdDhOX2FmOUFyTkprOGNJRkpwLVhuQVdkSFdsSnV6ZllHRVh6d016SFlmRzVUWF9td1ppTFB0X2d1YzhEbTZhSjA5ZUdULUlmSWxRUkJwUFZKY2xjZzllOXhHSGo3TVVs?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.616,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.576,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Several U.S. states have filed a legal challenge against a new $100,000 H-1B visa application fee introduced by former President Donald Trump. The states argue that the fee is excessively high and could harm businesses and workers. The lawsuit is ongoing, and the court has not yet issued a decision.",
    "is_trending": false,
    "trending_score": 0.0
  }
]