[
  {
    "title": "Court Overturns $464M Fine Against Trump in Fraud Case, Upholds Other Sanctions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 15:52:08 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "ABC News",
      "Business Insider",
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "The Guardian",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "abcnews.go.com",
      "www.forbes.com",
      "www.cnbc.com",
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.businessinsider.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The New York court decided that the fine was excessive, and likely violated the US Constitution.",
      "The court&#039;s ruling delivers a major victory to the US president, who has rejected accusations he inflated his assets.",
      "A New York appeals court has ruled that US President Donald Trump will not be required to pay a $464 million (nearly €400 million) fine but it upheld other punishments in the civil fraud case.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOQ24xSk9ONUdRVGh4T1NlNXdWUFVta3R2YWdlalExb2Z4SWpNOXJvN2FvbEdocjBSeElPc0J5Vm5VRGpqWEhTeDlrallRakI1LUVJbG50X2J6UC0tR1R1M0ZoUnRVZzMwaXFRZ3Zwc2JVeGZOUGZsbW56RVpQeVpNR3dIRQ?oc=5\" target=\"_blank\">President Trump's massive civil fraud penalty jus",
      "A New York appeals court has thrown out the half billion-dollar civil fraud judgment against President Donald Trump, his family and his company.",
      "The fraud lawsuit against President Donald Trump and others, which led to the penalty, was filed by New York State Attorney General Letitia James.",
      "<p>Trump was sued by New York over inflated financial statements used for favorable terms from lenders and insurers</p><p>An appeals court has thrown out the massive civil fraud penalty against <a href=\"https://apnews.com/hub/donald-trump\">Donald Trump</a>, ruling on Thursday in <a href=\"https://www",
      "The court ruled the fine—now more than $500 million—is “excessive.”",
      "A group of five New York judges struck down the fines issued by the trial court, finding it excessive &mdash; but couldn't agree on much else."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3066/live/eec1baf0-7ea6-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Appeals court throws out Trump's $500m civil fraud penalty",
      "New York appeals court tosses $515m civil fraud penalty against Trump",
      "US court throws out massive fraud penalty against Trump",
      "President Trump's massive civil fraud penalty just got tossed out - Axios",
      "Appeals court throws out Trump's $454 million civil fraud judgment",
      "Trump half-billion-dollar civil fraud penalty thrown out by appeals court",
      "Court throws out $500m civil fraud penalty against Donald Trump",
      "Trump’s $450 Million Fine For Civil Fraud Thrown Out By Appeals Court",
      "Appeals court tosses Trump's $500 million civil fraud penalty &mdash; but leaves a path open for appeal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.973,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.845,
    "summary": "A New York appeals court has overturned a $464 million fine against President Donald Trump in a civil fraud case, deeming it excessive and likely a violation of the US Constitution. The case, filed by New York State Attorney General Letitia James, accused Trump of inflating his assets to secure favorable terms from lenders and insurers. While the court dismissed the financial penalty, it upheld other sanctions against Trump, his family, and his company. This decision represents a significant legal victory for the President amidst ongoing legal challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Uganda to Accept Some US Deportees Under Temporary Deal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 13:52:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A Ugandan official said the country would prefer to receive people from African nationalities under the agreement.",
      "Uganda said it would accept some migrants deported from the US, but not those with criminal records. The Trump administration earlier deported migrants to the third countries of Eswatini and South Sudan.",
      "<p>African country’s foreign ministry says the two states are working on the details of a deal over deportees</p><p>Uganda has reached an agreement with the US to take in deportees from third countries who may not get asylum but are “reluctant” to go back to their own countries, according to Uganda’",
      "The East African country said it had reached a deal to accept an unspecified number of deportees, who would not include people with criminal records or unaccompanied minors.",
      "The East African country said it made a “temporary deal” to accept people who were not granted asylum in the United States."
    ],
    "image_url": "",
    "titles": [
      "Uganda agrees to deal with US to take in deported asylum seekers",
      "Uganda agrees to conditional US migrant deal",
      "Uganda reaches agreement with US to take in some failed asylum seekers",
      "Uganda Agrees to Take Deportees From U.S.",
      "Uganda says it reached deal with U.S. to take ‘third country’ deportees"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.953,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.82,
    "summary": "Uganda has agreed to accept some migrants deported from the United States, excluding those with criminal records and unaccompanied minors. This arrangement, described as a \"temporary deal,\" is part of an agreement with the US to take in deportees who may not receive asylum and are unwilling to return to their original countries. The deal is focused on migrants from African nationalities, and the two countries are currently finalizing the details. This follows previous deportations by the Trump administration to third countries like Eswatini and South Sudan.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Ukrainian Arrested in Italy for 2022 Nord Stream Pipeline Attack",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 11:16:43 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "German prosecutors say the man was in a group that planted explosives in the Baltic Sea.",
      "Serhii K was part of crew who planted devices on the pipelines, the German prosecutor&#039;s office said.",
      "The Russian-European gas pipeline was the target of a deliberate attack in September 2022.",
      "<p>Serhiy K is believed to have been onboard boat from where 2022 attack on gas pipelines was carried out</p><p>A Ukrainian man alleged to have been involved in the 2022 detonation of the Nord Stream pipelines carrying gas from Russia to Germanyhas been arrested in Italy, according to German authori",
      "The suspect is accused of being part of group that placed explosives on the pipelines after hiring a sailing yacht that departed from Rostock, on Germany’s Baltic coast."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1fd5/live/143c4a80-7e7e-11f0-9e05-3dbec5559644.jpg",
    "titles": [
      "Ukrainian held in Italy over Nord Stream gas pipelines blast mystery",
      "Ukrainian man arrested in Italy over Nord Stream pipeline blasts",
      "Germany: Arrest made over Nord Stream pipeline explosions",
      "Italian police arrest Ukrainian man over Nord Stream pipelines blast",
      "Ukrainian suspect arrested 3 years after alleged Nord Stream pipelines sabotage"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.884,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.813,
    "summary": "A Ukrainian man, Serhii K, has been arrested in Italy for his alleged involvement in the September 2022 attack on the Nord Stream gas pipelines, which transport gas from Russia to Europe. German prosecutors claim he was part of a group that planted explosives on the pipelines, using a sailing yacht hired from Rostock, Germany. This deliberate act targeted the Russian-European gas infrastructure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukrainian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Walmart Adjusts Prices Amid Tariff Challenges, Aims to Keep Costs Low",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 21 Aug 2025 11:55:32 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "MarketWatch",
      "NPR"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "The world's largest retailer — like many others — has been absorbing most of the increased costs, but raising prices of some goods.",
      "Walmart said it has raised prices for some items but kept others unchanged as tariff costs rise.",
      "“We’re keeping our prices as low as we can for as long as we can,” Walmart CEO Doug McMillon said in regard to the impact of tariffs."
    ],
    "image_url": "",
    "titles": [
      "Walmart says tariff costs are rising 'each week' and will continue",
      "Walmart hikes sales and earnings outlook even as it says tariff costs are rising",
      "Walmart says tariffs are raising costs, but it’s trying to avoid price increases — for now"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.995,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary": "Walmart has increased the prices of some items while maintaining the cost of others due to rising tariff expenses. CEO Doug McMillon stated the company aims to keep prices low for as long as possible, acknowledging the challenge tariffs present. This approach reflects Walmart's strategy to absorb most of the increased costs while adjusting prices selectively.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bullet Fired into Andy Reid's Office at Chiefs Facility, Lands Near Desk",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 11:38:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "A bullet penetrated the glass in the practice facility office of Andy Reid while the Chiefs coach was working alone in it last year, The Kansas City Star reported Wednesday night.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNY2NWOGpzVXZQanJjMTRaUm5EZ2E3djBiT2FzOWk0SGRndFNGM0ZKbnlWeUdXR1FQWVZCTEJnaEpDYUVMUzhJTkJNU184eWlWUkVvakRBOFFPNG1EQ2ZuY0FkaTlOMENDdkRCaTkxdE9iczdIQnFraDE5YzZLRWVxdF9xT09EcGVlRXBoN3RtYU5xam1TbEZJOFBQcTA?oc=5\" target=\"_blank\">A Bullet Was Fir",
      "<p>A bullet was fired into Kansas City Chiefs coach Andy Reid&#8217;s office at the team&#8217;s practice facility last spring while he was inside, the Kansas City Star reported Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Report: Bullet fired into Reid's office in May '24",
      "A Bullet Was Fired Into Chiefs Coach Andy Reid's Office in the Spring of 2024 - Sports Illustrated",
      "Report: Bullet fired into Chiefs coach Andy Reid’s office while he was there"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary": "A bullet was fired into the office of Kansas City Chiefs coach Andy Reid at the team's practice facility while he was inside, as reported by The Kansas City Star. The incident occurred last year, and the bullet ended up just 15 feet from Reid's desk. Reid was working alone in the office at the time of the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "49ers' Demarcus Robinson Suspended 3 Games for DUI Charge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 11:38:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "49ers coach Kyle Shanahan said Wednesday on San Francisco's KNBR radio that wide receiver Demarcus Robinson has been suspended three games stemming from a misdemeanor DUI charge.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWnJHMkdabzFfaU9YQ1VtdFdLeDM1NmRvd2tkeDVseF9KemNNQXZZcHJQd1RMb2ZRdzJkbGUwOWRiVndDRmdhZk96TlYxOHRUdkVsQzROSzJ1dWlCdEdOQzU2MWFWZldvSDZudUxHb1RuRHRCdlI3YkxHMlRuQ3dwM2JDNA?oc=5\" target=\"_blank\">49ers Wide Receiver Demarcus Robinson Suspended T",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQclFvMFJjWmk0VzFvdFpWWmt0Q1B0N21ncFM0RU5qNnVGVkRNSlNvb180WUtPenRsRWVUeVhKZGRLSm1HdG1qbEZFZldrSGdFRkRibUZRd3hJdnJyODlhWnVOSnVjanR0TmhSSG05dkppMFp4c0IzbkV6dWZoV2YyaU9pMWVNLWJteHZR?oc=5\" target=\"_blank\">49ers Projected Wide Receiver Depth Cha",
      "<p>San Francisco 49ers coach Kyle Shanahan said receiver Demarcus Robinson is facing a three-game suspension to start the season for violating the league’s substance abuse policy.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers trade for WR Moore as Robinson suspended",
      "49ers Wide Receiver Demarcus Robinson Suspended Three Games - Sports Illustrated",
      "49ers Projected Wide Receiver Depth Chart After Trading for Skyy Moore - Sports Illustrated",
      "49ers WR Demarcus Robinson faces three-game suspension, coach says"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary": "San Francisco 49ers wide receiver Demarcus Robinson has been suspended for three games due to a misdemeanor DUI charge, as announced by 49ers coach Kyle Shanahan on KNBR radio. The suspension comes as a violation of the league's substance abuse policy. Robinson, who played all 17 games last season for the Rams, will miss the start of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Leah Williamson to Miss WSL Start Due to Injury",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 14:48:04 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "England captain Leah Williamson is set to miss the start of the Women's Super League season with a knee injury she suffered in the Euro 2025 final.",
      "<ul><li><p>England defender sustained injury in final of Euro 2025</p></li><li><p>Club captain likely to be sidelined for several weeks</p></li></ul><p>Arsenal have been dealt a blow before the start of the new Women’s Super League season with their captain, Leah Williamson, ruled out for several we",
      "England captain Leah Williamson will miss the start of the new Women's Super League season with a knee injury."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/59e3/live/ad9eb1c0-7e99-11f0-8884-75e02e8a067a.jpg",
    "titles": [
      "Williamson to miss start of WSL season with injury",
      "Leah Williamson to miss start of Arsenal’s WSL season due to knee injury",
      "England captain Williamson to miss start of WSL season with knee injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary": "England captain and Arsenal defender Leah Williamson is set to miss the beginning of the Women's Super League season due to a knee injury sustained during the Euro 2025 final. She is expected to be sidelined for several weeks, impacting her club's start to the season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UK Government Takes Over Liberty Steel in South Yorkshire to Save 1,450 Jobs",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 15:59:10 GMT",
    "source": "BBC",
    "sources": [
      "Financial Post",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "financialpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Hundreds of Liberty Steel workers in Rotherham and Sheffield face an uncertain future.",
      "<p>Court ends Sanjeev Gupta’s control of Speciality Steel UK’s operations in South Yorkshire as ministers seek to save 1,450 jobs</p><p></p><p>The government has taken control of the UK’s third-largest steelworks as ministers try to protect 1,450 jobs after Liberty Steel’s operations in South Yorksh",
      "The UK took control of one of the country’s largest steelworks after a firm owned by the beleaguered tycoon Sanjeev Gupta was forced into liquidation."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7dc4/live/c52bce00-7e93-11f0-bb23-61f665394239.jpg",
    "titles": [
      "UK's third-largest steelworks collapses into government control",
      "Government takes control of UK’s third-largest steelworks after collapse into administration",
      "UK Government Takes Control of Sanjeev Gupta Steel Assets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary": "The UK government has taken control of Liberty Steel's operations in South Yorkshire, specifically in Rotherham and Sheffield, aiming to safeguard 1,450 jobs. This move comes after the company, owned by Sanjeev Gupta, entered liquidation, leading to the termination of Gupta's control over Speciality Steel UK. The future of hundreds of workers at these sites remains uncertain as the government steps in to manage the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Israeli Troops Begin Preliminary Assault on Gaza City Outskirts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 12:37:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Israeli troops have begun advancing on Gaza City as part of the military&#039;s plan to besiege and occupy the area.",
      "The Israeli military says the \"preliminary\" phase of a planned assault has begun on the outskirts of the city. The UN had warned about the effect an attack would have on the already dire humanitarian situation.",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/aug/21/gaza-city-offensive-would-be-death-sentence-for-israeli-hostages-say-relatives\">here</a></p><p>Iran was seeking to reassert an image of strength on Thursday after suffering heavy losses"
    ],
    "image_url": "",
    "titles": [
      "What to know as Israel begins its planned offensive to seize Gaza City",
      "Middle East: Israel begins planned military operation in Gaza City",
      "Israel keeps up military pressure on Gaza City ahead of planned offensive – as it happened"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary": "Israeli troops have started moving towards Gaza City, initiating the \"preliminary\" phase of a military assault aimed at besieging and occupying the area. This action comes amid warnings from the UN about the potential exacerbation of the humanitarian crisis in Gaza. The operation's current phase focuses on the city's outskirts. Further details and implications of this military action are being closely monitored.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israeli flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Bolsonaro Faces Coup Charges, Sought Asylum Amid Probe",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-21T02:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Authorities say they found evidence on the ex-president's cell phone requesting political asylum in Argentina. Bolsonaro is currently under house arrest.",
      "<p>Brazil’s former president is accused of allegedly plotting a military coup, but he denies the charges</p><p>Brazilian police have claimed in court documents that they have found a document on the mobile phone of former president Jair Bolsonaro suggesting he had planned to flee to Argentina ahead ",
      "The police said they found a request for asylum, addressed to Argentina’s leader, on the phone of the Brazilian ex-president, who is accused of plotting a coup."
    ],
    "image_url": "",
    "titles": [
      "Brazil: Police say Bolsonaro wanted Argentina asylum",
      "Brazil police file court documents accusing Bolsonaro of planning to flee to Argentina to seek asylum",
      "Jair Bolsonaro Planned to Seek Asylum in Argentina, Brazil’s Police Say"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.745,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary": "Brazil's former President Jair Bolsonaro, currently under house arrest, faces allegations of attempting a coup and obstructing justice, alongside his son. Authorities have discovered a document on Bolsonaro's cell phone indicating he sought political asylum in Argentina amid the coup probe. The Supreme Court is yet to rule on the case, as Bolsonaro denies the charges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nick Kyrgios Withdraws from US Open for Third Straight Year",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 11:38:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Nick Kyrgios withdrew from the US Open on Thursday, the third straight year the Australian has missed the last Grand Slam tournament of the season.",
      "<p>Nick Kyrgios withdrew from the US Open on Thursday, the third straight year the Australian has missed the last Grand Slam tournament of the season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Kyrgios to miss US Open for third straight year",
      "Nick Kyrgios withdraws from US Open, will miss another major tournament"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary": "Australian tennis player Nick Kyrgios has withdrawn from the US Open for the third consecutive year. This decision marks his absence from the last Grand Slam tournament of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Russian Missile Hits US Plant in Ukraine Amidst Massive Drone, Missile Attack",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 21 Aug 2025 08:37:52 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Volodymyr Zelenskyy says a Russian cruise missile hit a U.S. electronics plant in the far west of Ukraine. The strike was part of an overnight barrage of more than 600 drones and missiles.",
      "If Putin rejects a bilateral summit with Ukraine’s leader, the U.S. should take strong measures, Zelensky said. Russia said much needs to be worked out before a meeting is possible."
    ],
    "image_url": "",
    "titles": [
      "A Russian airstrike hits a U.S. factory in western Ukraine",
      "Russia’s strikes on U.S. factory show it has no interest in peace, Ukraine says"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.68,
    "summary": "A Russian cruise missile struck a U.S. electronics plant in Ukraine, as part of an attack involving over 600 drones and missiles, according to President Volodymyr Zelenskyy. Zelenskyy urged the U.S. to respond strongly if Russia's Putin refuses a summit with Ukraine. Russia has indicated that conditions for such a meeting are not yet met.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Jake Paul to Fight Gervonta Davis in Atlanta on Nov 14",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 10:33:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Andreas Hale explains why Jake Paul is fighting Gervonta Davis, what the fight means, and more.",
      "<p>YouTuber-turned-cruiserweight boxer Jake Paul and undefeated WBA lightweight champion Gervonta “Tank” Davis have agreed to fight on Nov. 14 at Atlanta&#8217;s State Farm Arena.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jake Paul vs. Gervonta Davis: All you need to know about the Nov. 14 fight",
      "Jake Paul and Gervonta Davis announce they will fight on Nov. 14"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary": "Jake Paul, a YouTuber-turned-cruiserweight boxer, is set to fight undefeated WBA lightweight champion Gervonta \"Tank\" Davis on November 14 at the State Farm Arena in Atlanta, Georgia. This match-up features two prominent figures from different weight classes, with Paul competing at 200 pounds and Davis at 135 pounds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sony Raises PlayStation 5 Price in U.S. to $550 Amid Economic Challenges",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 18:02:30 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica",
      "CityNews"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Sony is hiking the price of PlayStation 5 consoles in the U.S. this week, citing a \"challenging economic environment.\"",
      "NEW YORK (AP) — Sony has raised the price of its PlayStation 5 consoles being sold in the United States by $50. “Similar to many global businesses, we continue to navigate a challenging economic environment,” Sony Global Marketing Vice President Isabelle Tomatis wrote in a blog post. “As a result, w",
      "Price hikes go into effect August 21; standard PS5 will now start at $550."
    ],
    "image_url": "",
    "titles": [
      "Sony is increasing the price of the PlayStation 5 as new tariffs take hold",
      "Sony raises the price of the Playstation 5 in the US",
      "Sony makes the “difficult decision” to raise PlayStation 5 prices in the US"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.63,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "Sony announced that PlayStation 5 console prices in the U.S. will increase due to a challenging economic environment. The standard PS5 will now start at $550, up from the previous price. The price hike will be effective starting August 21. The PlayStation 5 is currently the most popular gaming console in America.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "EU Agrees to 15% Tariff on US Exports, Winemakers Unhappy",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-21T15:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "Following threats from Washington, the EU agreed to a 15% tariff on most of its exports to the US, including cars. European winemakers, however, are not happy with the trade deal.",
      "Washington refuses to reduce 27.5% levy until Brussels cuts duties on American goods"
    ],
    "image_url": "",
    "titles": [
      "EU-US deal set to lower car tariffs, no exception for wine",
      "EU races to secure lower US tariffs on car industry"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "The EU has agreed to a 15% tariff on the majority of its exports to the US, including automobiles, after threats from Washington. Despite this agreement, European winemakers are dissatisfied with the trade deal. The US has stated it will not lower its 27.5% levy on European goods until Brussels agrees to reduce duties on American products.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Cubs' Kyle Tucker Battles Slump Post-Injury Recovery",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 13:49:21 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Tucker's injury has since healed, but he remains in an offensive downturn",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1fWC1Sb0J1NTRxZFhKY2hydlliMTZnOE9TbzN4cEpicERaX2c5MDFrREY0anNxU3htQmN1NXM4TU5IVEVEa1FTZEd2azNJZWh5NldJRnplSTlFc3o2QUktQTgwMXBHMGhlUXJtVk9Kbko?oc=5\" target=\"_blank\">SI:AM | Cubs Reveal Slumping Star Kyle Tucker Was Injured Months Ago</a>&nbs",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxORzhfQVNUMHE5dzc5ZUkwSXhIbXBjRlNnMGxHYkNqRC1WVGk3N3dlTXhiSGJwZFRvX21NUlhOWlBBX1JFU3RxdXZhVUxFRmg4MV9VWWJkeEQ5Tm54Sm1PYW05RmFKWjViSnhJZzEzaTgxYVZwUGVHbTFmVU0wVXZIWnYyVGlHLWpQX1FBSkRRVkY?oc=5\" target=\"_blank\">Slumping Cubs Star Kyle Tucker H"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/21/a73f32a7-1c03-407c-9da8-26ddfee72847/kyle-tucker-cubs-g.jpg",
    "titles": [
      "Kyle Tucker injury: Cubs reveal slumping star was diagnosed with fractured hand in June",
      "SI:AM | Cubs Reveal Slumping Star Kyle Tucker Was Injured Months Ago - Sports Illustrated",
      "Slumping Cubs Star Kyle Tucker Has Played Through Hairline Fracture Since June - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Kyle Tucker, a star player for the Cubs, has recovered from an injury reported months ago but is currently experiencing a slump in his offensive performance. The specific details of his injury and the exact timeline of his recovery were not disclosed, but his ongoing struggle to regain his form on the field has been highlighted.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hurricane Erin Causes Evacuations, Coastal Flooding in NC and VA",
    "domain": "science",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 14:38:29 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Phys.org"
    ],
    "domains": [
      "www.theguardian.com",
      "phys.org"
    ],
    "snippets": [
      "<p>Category 2 storm led to evacuation orders and road closures, with rip currents and high surf forecast on Friday</p><p>Hurricane <a href=\"https://www.theguardian.com/us-news/2025/aug/20/hurricane-erin-east-coast-storm-surge\">Erin</a>, a large category 2 storm with winds reaching 105mph, was <a hre",
      "Hurricane Erin brought coastal flooding to parts of North Carolina and Virginia as it made its closest approach to the US mainland early Thursday."
    ],
    "image_url": "https://i.guim.co.uk/img/media/e65c6f06bf3dfc6e4f3662598393582529359b72/765_0_6108_4887/master/6108.jpg?width=140&quality=85&auto=format&fit=max&s=c7a44e95753a98ee9f3893e88a076a61",
    "titles": [
      "Hurricane Erin moves away from North Carolina after battering outer banks",
      "Hurricane Erin brings coastal flooding to N. Carolina, Virginia"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Hurricane Erin, a Category 2 storm with winds of 105mph, led to evacuations and road closures due to its impact. The storm, which forecasted rip currents and high surf for Friday, caused coastal flooding in North Carolina and Virginia as it approached the US mainland early Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Suarez's Double Propels Inter Miami to Semifinals, Messi Sidelined by Injury",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 07:50:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sports Illustrated",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A Luis Suarez brace against the Tigres was enough for Miami to overcome Messi&#039;s injury and progress to semifinal.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1lNDZsQXdaUDFiOW1rU2hZanQwX3VQSGpzT200U2pYNmFlOFB3dnNPYWJCV3FUdF80bW8wQU95VVl5c3lLVHkzNmpqTW1aVTN3enNmRHJoTk1SVUdCLXVyRDJQdzNNRExROXRfTmM5QVdUUk1na1kxV096V2ltVkU?oc=5\" target=\"_blank\">Why Lionel Messi Isn’t Playing for Inter Miami vs. Tigre",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE4zbUZ0RUtTYjU0VkhJUXFiRFc0b3hRb25rd1Z1VTE0M2NUcERzdXpTSU1oSkFuQlNOUzUyWjc2MGx3YnMtTXYwY2s4alcyVzVhY3dudWwwVTUxREZKTHUxdS1UMEN0OC1VdWE4SUVZakxmOWFGc0Q5OEx3?oc=5\" target=\"_blank\">Inter Miami Player Ratings vs. Tigres: Suarez’s Brace Lifts Her"
    ],
    "image_url": "",
    "titles": [
      "Lionel Messi-less Inter Miami defeat Tigres in Leagues Cup quarterfinal",
      "Why Lionel Messi Isn’t Playing for Inter Miami vs. Tigres - Sports Illustrated",
      "Inter Miami Player Ratings vs. Tigres: Suarez’s Brace Lifts Herons to 2–1 Win in Leagues Cup Quarterfinals - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.84,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary": "Luis Suarez scored twice to lead Inter Miami past Tigres, overcoming Lionel Messi's absence due to injury. Miami advanced to the semifinals. Suarez's brace was crucial in securing the victory, with the team receiving positive player ratings for their performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Top 100 College Football Recruits Ranked Before Season Starts",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 11:38:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "www.espn.com"
    ],
    "snippets": [
      "As more of the best recruits commit, here's how the top classes stack up.",
      "Who's the top player in the nation? Our experts rank the top 100 ahead of the season."
    ],
    "image_url": "",
    "titles": [
      "↔️ 2026 college football recruiting class rankings",
      "College Football 2025: Ranking the best players from 1 to 100"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.989,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.491,
    "summary": "The latest rankings reveal the top college football recruits and class standings, with experts evaluating the nation's top 100 players before the season starts. This assessment provides insight into which schools are securing the best talents, shaping the competitive landscape for the upcoming season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "football",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Leading Baseball Team Slows but Stays on Top; NL Contender Declines Further",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 10:25:48 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "www.espn.com"
    ],
    "snippets": [
      "Baseball's top team is still rolling -- though might be slowing down -- while one NL contender continues its fall down our list in Week 21.",
      "Which budding stars have surged up our list now that the draft and trade season are behind us?"
    ],
    "image_url": "",
    "titles": [
      "MLB Power Rankings: Can anyone top this No. 1 team?",
      "Updated top 100 MLB prospect rankings: There's a new No. 1"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.964,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.486,
    "summary": "In Week 21 of the baseball season, the leading team shows signs of slowing down, yet remains on top, while a notable National League contender experiences a further decline in rankings. Following the draft and trade season, several emerging stars have risen in the rankings, indicating shifts in player performance and team strategies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/baseball.svg",
      "thumbnail": "icons/baseball.svg",
      "alt": "baseball",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]