[
  {
    "title": "US President Warns Russia of Severe Tariffs Over Ukraine War Deal",
    "domain": "general",
    "location": "global",
    "published": "2025-07-14T15:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ABC News",
      "Financial Times",
      "Forbes",
      "Deutsche Welle"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The US president said he was \"very unhappy\" with Russia and warned there would be \"very severe tariffs\" if there was no deal to end the war in Ukraine in 50 days. DW has more.",
      "President Trump opened his remarks alongside NATO Secretary-General Mark Rutte in the Oval Office on Monday by threatening \"severe tariffs\" against Russia.",
      "US president seeks to step up pressure on Moscow to reach a peace deal with Ukraine",
      "The president gave Russia 50 days to come to a deal to end the war that began in 2022."
    ],
    "image_url": "",
    "titles": [
      "Ukraine updates: Trump warns Russia of 'very severe tariffs'",
      "Trump admin live updates: Trump threatens 100% tariffs on Russia",
      "Donald Trump threatens 100% secondary tariffs on Russia",
      "Trump Threatens Russia With 100% Tariffs If No Deal With Ukraine Reached"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.989,
      "consensus": 0.985,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary": "The US President expressed dissatisfaction with Russia and issued a warning of \"very severe tariffs\" if a deal to end the Ukraine war is not reached within 50 days. This statement was made during a meeting with NATO Secretary-General Mark Rutte in the Oval Office. The president's remarks aim to increase pressure on Moscow to negotiate a peace agreement with Ukraine, addressing the conflict that started in 2022.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the current geopolitical situation between the US, Russia, and Ukraine. It provides context about the ongoing conflict and the US's strategy to address it. However, it doesn't highlight any specific solutions or progress towards resolving the conflict, nor does it provide in-depth insight into the systems or causes at play."
  },
  {
    "title": "Florida Panthers to Raise Stanley Cup Banner on NHL Opening Night 2025",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 11:37:51 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Florida Panthers will raise their second Stanley Cup banner on Oct. 7 to kick off the 2025-26 NHL season ahead of their opener against the Chicago Blackhawks.",
      "The game - part of an NHL Opening Night triple-header on ESPN - will start at 5 p.m. at Amerant Bank Arena.",
      "<p>The Florida Panthers are set to raise their second consecutive Stanley Cup banner before beginning the NHL season against the Chicago Blackhawks.</p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers to raise 2nd Stanley Cup banner Oct. 7",
      "Florida Panthers raise Stanley Cup championship banner Oct. 7 before playing Chicago Blackhawks",
      "Panthers’ Stanley Cup banner raising set, hosting Blackhawks to start season"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.989,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary": "The Florida Panthers will celebrate their second consecutive Stanley Cup victory by raising a banner on October 7, 2025, during the NHL season opener against the Chicago Blackhawks. This event is part of an NHL Opening Night triple-header and will be broadcast on ESPN, starting at 5 p.m. at Amerant Bank Arena.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story informs readers about an upcoming event in the NHL, it doesn't provide deeper understanding or actionable insights. It could be more constructive if it included more context about the team's journey to the championship or the significance of the event."
  },
  {
    "title": "49ers' Jauan Jennings Seeks New Contract or Trade Amid Dispute",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 11:37:51 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "49ers wide receiver Jauan Jennings, who is scheduled to make $7.5 million in the final year of his deal, wants a new contract or a trade, sources told ESPN.",
      "Jennings, 28, is in the final year of his deal with San Francisco",
      "Wide receiver Jauan Jennings has announced that he wants a pay raise or a trade from the San Francisco 49ers, setting the team up for another receiver-driven contract dispute ahead of training camp.",
      "Jennings, currently with the San Francisco 49ers, could have himself a new deal or a new home come Week 1."
    ],
    "image_url": "",
    "titles": [
      "Sources: 49ers' Jennings wants new deal or trade",
      "49ers' Jauan Jennings wants new contract or trade following breakout 2024 season, per report",
      "49ers' Jennings Seeking New Contract or Trade, Per Report",
      "Former Tennessee Volunteer Jauan Jennings wants trade or new contract: Report"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.989,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary": "Jauan Jennings, a 28-year-old wide receiver for the San Francisco 49ers, is seeking a new contract or a trade. In the final year of his current deal, he is set to earn $7.5 million. This demand puts the 49ers in a position for a potential contract dispute as training camp approaches. Jennings' future with the team could see significant changes by Week 1, depending on the outcome of his request.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a potential contract dispute between Jauan Jennings and the 49ers. However, it doesn't provide any deeper insights or context, such as the implications for the team or the wider NFL, or how common such disputes are."
  },
  {
    "title": "EU Trade Commissioner Seeks Negotiation with US to Avoid 30% Levy",
    "domain": "general",
    "location": "global",
    "published": "Mon, 14 Jul 2025 10:23:07 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Bloc’s trade commissioner Maroš Šefčovič issues caution as ministers meet to consider retaliatory measures against US",
      "<p>EU trade commissioner says ‘we want to use ‘every minute until 1 August to find a negotiated solution’</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jul/14/pound-three-week-low-bank-of-england-rate-cut-jobs-market-trump-trade-war-europe-euro-business-live-news-updates\">Bus",
      "The bloc’s trade commissioner says two sides were close to a deal before the president last week threatened to impose a 30 percent levy."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7b7dbed9-501e-4242-b796-0bbeb3188af1.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "EU warns Trump’s 30% tariffs would eliminate transatlantic trade",
      "Trump’s 30% tariffs would eliminate EU-US trade, says chief negotiator Šefčovič",
      "Trump’s E.U. Tariffs Would Hobble Trade With U.S., Official Says"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.886,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.756,
    "summary": "EU Trade Commissioner Maroš Šefčovič has urged for negotiation until 1 August to avoid retaliatory measures against the US, following the President's threat of a 30% levy. Šefčovič emphasized the desire for a negotiated solution as EU ministers consider their response.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the potential for a trade dispute between the US and EU, and the EU's efforts to negotiate a solution. However, it doesn't provide a deep understanding of the issues at stake or the potential impacts of the proposed levy. It also doesn't report on any specific progress or innovations in trade policy."
  },
  {
    "title": "2025 MLB Home Run Derby Set for July 14, Eight to Compete",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 10:42:05 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Ready to watch stars swing for the fences? We have your one-stop shop for the most power-packed day of the baseball year.",
      "When is the 2025 MLB Home Run Derby? The Home Run Derby 2025 is on Monday, July 14, at 8 p.m. ET",
      "This year, eight sluggers will look to join these MLB players who have won the Home Run Derby since its inception in 1985."
    ],
    "image_url": "",
    "titles": [
      "It's MLB Home Run Derby Day! Predictions and more",
      "Home Run Derby 2025 odds, picks, predictions, participants, start time: Top MLB expert reveals best bet",
      "MLB Home Run Derby winners since 1985"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.97,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary": "The 2025 MLB Home Run Derby is scheduled for Monday, July 14, at 8 p.m. ET. This event will feature eight top sluggers competing to join the ranks of past Home Run Derby winners since the event's inception in 1985. It is highlighted as the most power-packed day of the baseball year.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic information about an upcoming event, but doesn't provide any deeper insights or context. It doesn't give the reader any actionable insights, doesn't report on any progress or innovations, and doesn't increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "TikTok CEO Seeks Urgent Meeting with Canada Over Ban Directive",
    "domain": "business",
    "location": "national",
    "published": "Mon, 14 Jul 2025 15:54:55 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Shou Chew argued the order was made in different circumstances, when it looked like the U.S. was going to ban the app",
      "The CEO of TikTok is asking Industry Minister Mélanie Joly for an urgent meeting about the federal government’s order directing the company to shut down its Canadian operations. Shou Chew wrote to Joly on July 2 asking for an in-person meeting within two weeks, according to a letter obtained by The "
    ],
    "image_url": "",
    "titles": [
      "TikTok CEO asks to meet with Melanie Joly over shutdown order",
      "TikTok CEO asks to meet with industry minister over shutdown order"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.995,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.739,
    "summary": "The CEO of TikTok, Shou Chew, has requested an urgent meeting with Canada's Industry Minister Mélanie Joly, concerning the federal government's directive for TikTok to cease its operations in Canada. In a letter dated July 2, Chew seeks to discuss the order, which he suggests was issued under different circumstances, potentially referencing past concerns of a U.S. ban on the app. Chew aims for an in-person meeting within the next two weeks to address the issue.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing issues between TikTok and the Canadian government. It gives readers a deeper understanding of the situation, but it does not report on any solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Winnipeg Jets Extend Morgan Barron's Contract, Avoid Arbitration",
    "domain": "general",
    "location": "national",
    "published": "Mon, 14 Jul 2025 15:25:45 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "The club announced a contract extension for the 26-year-old forward Monday. The deal has an average annual value in the NHL of $1.85 million.",
      "<p>The Winnipeg Jets have avoided arbitration with forward Morgan Barron. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2023/07/20230717100728-64b5505b95c8f9cf2b23e303jpeg.jpg?quality=85&strip=all",
    "titles": [
      "Winnipeg Jets extend forward Morgan Barron for 2 years",
      "Jets re-sign forward Morgan Barron to two-year, $3.7-million contract"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.985,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.728,
    "summary": "The Winnipeg Jets have extended the contract of 26-year-old forward Morgan Barron, averagely valued at $1.85 million annually in the NHL. This move comes after the team successfully avoided arbitration with Barron.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a contract extension in the NHL, but it doesn't provide much depth or insight. It doesn't explain why the contract extension is significant, what arbitration would have entailed, or how this decision might impact the team or the player. It also doesn't highlight any progress or innovation in the sport or the industry."
  },
  {
    "title": "Clark Leads Fever to Victory, Sets Record Against Wings",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 10:39:33 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Behind 13 assists from Caitlin Clark, the Fever put five players in double figures and scored 64 first-half points.",
      "<p>Caitlin Clark had 14 points, 13 assists and a career-high-tying five steals, Kelsey Mitchell scored 20 points and the Indiana Fever beat rookie Paige Bueckers and the Dallas Wings 102-83 on Sunday in the first matchup between the past two No. 1 overall picks in the WNBA draft.</p>"
    ],
    "image_url": "",
    "titles": [
      "How Clark, Fever dropped 100 points on Paige Bueckers' Wings",
      "Clark posts double-double as Fever beat Bueckers’ Wings"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.969,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.714,
    "summary": "Caitlin Clark led the Indiana Fever to a 102-83 victory over the Dallas Wings with 14 points, 13 assists, and a career-high-tying five steals. The Fever set a franchise record by scoring 64 points in the first half. Kelsey Mitchell contributed 20 points to the win. This game marked the first matchup between the past two No. 1 overall WNBA draft picks, Clark and rookie Paige Bueckers.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the game, including the record set by the Fever and the contributions of individual players. It also offers some context by noting the matchup between the past two No. 1 overall WNBA draft picks. However, it could provide more insight into the implications of this game for the teams involved or the season as a whole."
  },
  {
    "title": "Zelenskyy Appoints Svyrydenko as Ukraine's New Government Head Amid War",
    "domain": "general",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:22:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "President Zelenskyy taps economy minister to lead gov&#039;t in most significant reshuffle since Russian full-scale invasion.",
      "President asks deputy prime minister Yulia Svyrydenko to head his government"
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy nominates Yulia Svyrydenko as new Ukraine PM in cabinet shake-up",
      "Zelenskyy nominates new Ukraine PM in major reshuffle"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.984,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary": "President Zelenskyy appointed Economy Minister Yulia Svyrydenko as the new head of the Ukrainian government, marking the most significant reshuffle since the full-scale invasion by Russia. This decision sees Svyrydenko, also serving as Deputy Prime Minister, stepping up to lead the government amid ongoing conflict.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about a significant political reshuffle in Ukraine amid a critical situation. However, it doesn't offer a deep understanding of the implications of this change or potential solutions to the ongoing conflict."
  },
  {
    "title": "2025 Draft Sees Multiple Canadians Selected by Teams",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 15:32:11 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Follow along for updates on the Detroit Tigers picks on Monday for Day 2 of the 2025 MLB Draft.",
      "<p>As the Blue Jays make their way through the 20-round draft, here is one sentence on each of Toronto&#8217;s picks, starting with first-round pick JoJo Parker.</p>",
      "<p>Here are all the Canadians who heard their name called during the 2025 Draft.</p>"
    ],
    "image_url": "",
    "titles": [
      "Breaking down every Detroit Tigers pick in Rounds 4-20 of 2025 MLB Draft",
      "One sentence on every Blue Jays pick in the 2025 MLB Draft",
      "Every Canadian taken in 2025 MLB Draft"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.987,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary": "The 2025 Draft featured several Canadians being selected by teams. This marks a significant moment for these individuals as they progress in their professional careers. The list of names called during the draft highlights the talent and potential of Canadian athletes in the sport.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the progress of Canadian athletes in their professional careers, which could be empowering for readers interested in the sport or the development of Canadian athletes. However, it could provide more depth or insight into the significance of this event or the potential impact on the sport or the athletes' future careers."
  },
  {
    "title": "Chelsea FC Seeks Premier League Title After World Champion Win",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 09:34:08 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Chelsea have been crowned world champions -- but only when they end their Premier League title drought will the Blues be able to say they are back where they expect to be.",
      "Chelsea have not won the Premier League title since 2016/17, eight years and six permanent managers ago. Can Enzo Maresca end the wait after his shock Club World Cup win?"
    ],
    "image_url": "",
    "titles": [
      "Club World Cup triumph shows Chelsea can win the Premier League",
      "Will Chelsea win Premier League in 2025/26? Assessing Enzo Maresca, Blues' chances after Club World Cup triumph"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.947,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.692,
    "summary": "Chelsea FC was recently named world champions, marking a significant achievement for the team. However, their last Premier League title win was in the 2016/17 season, and they have since changed managers six times. The club's fans and management are eager for Chelsea to win the Premier League again to fully affirm their top status. Enzo Maresca, after leading the team to a Club World Cup victory, faces the challenge of ending Chelsea's Premier League title drought.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about Chelsea FC's recent history and current ambitions. It helps readers understand the club's situation and the challenges it faces. However, it doesn't report on any specific solutions or improvements, and doesn't give the reader any actionable insights."
  },
  {
    "title": "Ex-Man United Defender Sues Club for Negligent Medical Advice",
    "domain": "general",
    "location": "global",
    "published": "Mon, 14 Jul 2025 12:15:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Former Manchester United defender Axel Tuanzebe is suing the club for alleged negligent medical advice.",
      "Axel Tuanzebe has sued his former club Manchester United in a clinical negligence lawsuit."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1763/live/d6c90ab0-60a7-11f0-ba44-5934558aeaa1.jpg",
    "titles": [
      "Defender Tuanzebe sues former club Man Utd",
      "Tuanzebe sues Man Utd for 'clinical negligence'"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.922,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary": "Axel Tuanzebe, a former defender for Manchester United, has filed a lawsuit against the club, alleging negligent medical advice. The legal action specifically accuses Manchester United of clinical negligence. This marks a notable case involving a player legally challenging his former football club over medical guidance received during his tenure.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a notable legal case involving a football club and a player, providing some awareness about the issue of clinical negligence in sports. However, it doesn't offer a deeper understanding of the implications or potential solutions to such issues."
  },
  {
    "title": "Trump Proposes NATO Buy US Arms for Ukraine Ahead of Secretary Meeting",
    "domain": "general",
    "location": "national",
    "published": "Mon, 14 Jul 2025 03:00:22 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE55S3RfUXg2c3dqMkg1VkhxeldyLThQY283V0YwYm5PR094VUltQ2s1cHhhUE1WVDk3WWVWWHhxVEZiQkl2ck1uZkF1UWpkS1NxRlFHMmw3TkhmVTRid2dRVVp3djFQRm9PMHJRc2hNY2pvT2FncFViZlhR?oc=5\" target=\"_blank\">Trump to announce \"aggressive\" Ukraine weapons plan</a>&nbsp;&n",
      "Under the plan, other NATO countries would buy U.S.-made arms, then give them to Ukraine to defend itself against Russia. NATO’s secretary general was set to meet Mr. Trump on Monday."
    ],
    "image_url": "",
    "titles": [
      "Trump to announce \"aggressive\" Ukraine weapons plan - Axios",
      "Trump Is Expected to Announce New Weapons Pipeline for Ukraine"
    ],
    "score_components": {
      "magnitude": 0.68,
      "recency": 0.76,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary": "Former President Trump announced a plan to supply Ukraine with weapons to defend against Russia by having other NATO countries purchase U.S.-made arms and then provide them to Ukraine. This announcement came ahead of a scheduled meeting between Trump and NATO's secretary general on Monday.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is informative and provides useful context about a proposed solution to a geopolitical issue. It could have been more constructive if it included more details about the potential impacts or reactions to the proposal."
  },
  {
    "title": "U.S. Banks Rely on Trading for 75% of Wall Street Revenue",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 04:00:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Big US banks have relied on traders for at least 75% of their Wall Street revenues for more than three years",
      "Big U.S. banks have relied on traders for at least 75% of their Wall Street revenues for more than three years"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9c6ab514-12cb-4892-8fc7-992c0d04f9c8.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Investment banking set to extend worst run in over a decade",
      "Investment banking set to extend worst run in over a decade"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.776,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary": "Big U.S. banks have been dependent on traders for over 75% of their Wall Street revenues for more than three years. This reliance on trading activities has been a significant source of income for these banks.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the financial practices of U.S. banks, giving readers a deeper understanding of the banking industry. However, it does not report on any solutions, improvements, or innovations, and it does not increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Elmo's Social Media Hacked, Posts Profane and Racist Content",
    "domain": "business",
    "location": "global",
    "published": "2025-07-14T11:17:30Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "The Elmo account usually posts wholesome content in character on X. The hacker posted profanity and racism.",
      "A hacker compromised Elmo's X account on Sunday and published abusive posts."
    ],
    "image_url": "https://i.insider.com/6874d9f785e81483682df043?format=jpeg",
    "titles": [
      "Elmo's X account was hacked and shared antisemitic and racist posts",
      "Elmo’s X account hacked to publish racist and antisemitic posts"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.903,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Elmo's X account was hacked on Sunday, resulting in the publication of posts containing profanity and racist content. This incident diverged from the account's typical wholesome content. The current status of the account or actions taken in response has not been specified.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a specific incident of a social media account being hacked. However, it lacks depth or insight, does not provide actionable insights, and does not report on solutions or improvements."
  },
  {
    "title": "Eli Willits Chosen as First Overall Pick by Washington Nationals in 2025 MLB Dra",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 15:22:53 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Nationals made Willits the youngest No. 1 pick in MLB Draft history on Sunday night",
      "<p>The Washington Nationals have tabbed Eli Willits as the first pick in the 2025 MLB Draft.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/14/c7fc8058-9bb1-466f-90c5-2827a670e416/eli-willits-imagn.png",
    "titles": [
      "One hidden reason why Eli Willits, the No. 1 pick in 2025 MLB Draft, could develop into a superstar",
      "Nationals select SS Eli Willits with No. 1 pick in MLB Draft"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.64,
    "summary": "The Washington Nationals selected Eli Willits as the first overall pick in the 2025 MLB Draft. Willits is the top choice in the draft, chosen by the Nationals. The outcome of the draft is that Willits will join the Nationals as their first pick.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  },
  {
    "title": "Trump to Visit UK on Second State Visit, Sept 17-19, Hosted at Windsor Castle",
    "domain": "general",
    "location": "global",
    "published": "Mon, 14 Jul 2025 10:46:19 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Buckingham Palace confirmed that the president has accepted the king’s invitation to visit from Sept. 17 to 19. He and the first lady will be hosted at Windsor Castle.",
      "Buckingham Palace confirmed the dates of President Trump’s trip to Britain, which will be his second state visit."
    ],
    "image_url": "",
    "titles": [
      "King Charles III to host Trump in September for second U.K. state visit",
      "King Charles III Will Host Trump for U.K. State Visit in September"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.894,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "President Trump has accepted an invitation from the King of Britain to visit from Sept. 17 to 19. Buckingham Palace confirmed the dates for his second state visit, during which he and the first lady will be hosted at Windsor Castle.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an upcoming state visit by former President Trump to the UK. However, it lacks depth or insight into the purpose or potential impacts of the visit, making it less constructive."
  },
  {
    "title": "Actor Responds to Trump's Citizenship Revocation Threat; Legal Grounds Questione",
    "domain": "general",
    "location": "global",
    "published": "2025-07-14T14:07:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "In an escalating feud, the US-born actor has fired back at the president's threat to take away her citizenship. But could Trump even legally do it?",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOU3Z5RWlfQzNhVTBhSFJxYVhITXI2VmtQOE0wZkdld0NkcnEwZnl6X3ZMOWNOVGNuMGpETTg2MkJvZ2t4Mkc4d0NHdThSbTFmNjJIU0VEZkYtWVpCbmtCMDQzNDRRTlVSMFZjbHhVSjYwU2l6U2ZJUTh0NE12bVZxSmVR?oc=5\" target=\"_blank\">Why Trump can't revoke native-born U.S. citizenship"
    ],
    "image_url": "",
    "titles": [
      "Can Trump revoke Rosie O'Donnell's US citizenship?",
      "Why Trump can't revoke native-born U.S. citizenship - Axios"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.958,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary": "The US-born actor has responded to President Trump's threat to revoke her citizenship, raising questions about the legality of such an action. Legal experts assert that the president does not have the authority to strip a native-born citizen of their citizenship, indicating that Trump's threat may not be legally enforceable. This controversy highlights the ongoing feud between the actor and the president, with the actor standing firm against the threat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  },
  {
    "title": "Sporting CP to Fine Gyökeres for Preseason Strike",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 14 Jul 2025 09:33:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Sporting CP president Frederico Varandas has insisted that Viktor Gyökeres will face fines after he went on strike Saturday, refusing to report to the club's preseason training."
    ],
    "image_url": "",
    "titles": [
      "Gyökeres warned with fines after going on strike"
    ],
    "score_components": {
      "magnitude": 0.189,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.479,
    "summary": "Sporting CP president Frederico Varandas has stated that Viktor Gyökeres will be fined for going on strike and not attending the club's preseason training. Gyökeres' actions have led to disciplinary measures being taken against him by the club.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the disciplinary action taken by the club against the player. However, it lacks depth and insight into the reasons behind the player's strike, or how such actions might affect the club or the player's career in the long term."
  },
  {
    "title": "How AI can make us better decision-makers, with Cassie Kozyrkov",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hello, and welcome to Decoder! This is Jon Fortt, CNBC journalist, cohost of Closing Bell Overtime, and creator and host of the Fortt Knox podcast. As you just heard Nilay say, I’m stepping in to guest-host a few episodes of Decoder this summer while he’s out on parental leave, and I’m very excited "
    ],
    "image_url": "",
    "titles": [
      "How AI can make us better decision-makers, with Cassie Kozyrkov"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it not only provides insights into how AI can enhance decision-making, but also promotes awareness about the role and impact of AI in our lives. It empowers readers with knowledge about AI's potential in improving decision-making processes."
  },
  {
    "title": "Study Enhances Forensic Analysis with Blood-Cotton Fabric Insights",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 11:36:36 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "New research offers key insights into how blood stains cotton fabrics, allowing investigators to gather additional information from forensic evidence. The paper, \"Dynamics of blood falling on three types of cotton fabrics and resulting bloodstains,\" is published in the journal Forensic Science Inter"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/forensics-study-helps.jpg",
    "titles": [
      "Forensics study helps investigators draw new clues from bloodstains"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary": "New research published in Forensic Science International provides insights into how blood stains cotton fabrics, enhancing forensic evidence analysis. The study, titled \"Dynamics of blood falling on three types of cotton fabrics and resulting bloodstains,\" aims to help investigators gather more detailed information from crime scenes by understanding the interaction between blood and fabric. This could improve the accuracy of forensic investigations.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights progress in the field of forensic science. It provides actionable insights for investigators and contributes to a deeper understanding of forensic evidence analysis. The study is an innovation that aims to solve problems in crime scene investigations."
  },
  {
    "title": "Pebblebee’s AirTag alternative now doubles as a panic alarm",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Pebblebee has announced a new personal safety feature for its Clip location tracker that’s compatible with both Apple’s Find My and Google’s Find Hub network. Alert is being introduced as a free update to the Pebblebee app today, and the company says it will work with current and future versions of "
    ],
    "image_url": "",
    "titles": [
      "Pebblebee’s AirTag alternative now doubles as a panic alarm"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation that could potentially improve personal safety. It provides actionable insights for readers who might be considering purchasing such a device."
  },
  {
    "title": "Rainmaker partners with Atmo to squeeze more rain from clouds",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 14 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Atmo will use its deep learning models to help Rainmaker identify clouds that have potential for seeding."
    ],
    "image_url": "",
    "titles": [
      "Rainmaker partners with Atmo to squeeze more rain from clouds"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive because it highlights a solution to water scarcity issues. It increases awareness about innovative approaches to environmental challenges and provides insights into a potential solution."
  },
  {
    "title": "U.S. Imposes 50% Tariff on Copper Imports Amid China Concerns",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:53:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The 50% tariff on copper imports is just a first step. Here’s what’s needed now to counter China."
    ],
    "image_url": "https://images.mktw.net/im-706382",
    "titles": [
      "Copper tariffs are vital to America’s economy — and Trump doesn’t have room to fail"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary": "The U.S. has imposed a 50% tariff on copper imports as an initial measure to address concerns related to China. Further actions are being considered to counter China's influence in the copper market. The outcome of these actions and their impact on trade relations between the U.S. and China remain to be seen.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant policy change, which could affect a variety of stakeholders. However, it doesn't provide a clear sense of the potential impacts or possible solutions to the trade tensions between the U.S. and China."
  },
  {
    "title": "Charitable Deduction to Yield $74B for Nonprofits in Decade",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:50:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "An above-the-line deduction for charitable giving is expected to generate an estimated $74 billion for nonprofits over a decade."
    ],
    "image_url": "https://images.mktw.net/im-61345181",
    "titles": [
      "How Trump’s big bill makes it easier for all Americans to claim the tax break for charitable donations — not just rich people"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "An above-the-line deduction for charitable giving is projected to provide around $74 billion in funding for nonprofits over the next ten years.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a policy change that could have a significant impact on nonprofits. It increases awareness about the potential benefits of charitable giving and could inform decisions about charitable donations."
  },
  {
    "title": "Microsoft has a new trick to improve laptop battery life on Windows",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T11:50:05-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Microsoft has started testing a new feature in Windows 11 that will improve laptop battery life. A new adaptive energy saver mode will soon automatically enable or disable the main energy saver mode, based on your laptop’s workload rather than just its amount of battery life left. The energy saver m"
    ],
    "image_url": "",
    "titles": [
      "Microsoft has a new trick to improve laptop battery life on Windows"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information to readers about a new innovation from Microsoft that can improve laptop battery life. It can help readers make informed decisions about managing their laptop's battery life."
  },
  {
    "title": "Early Bronze Age Israel: Donkeys Used for Transport, Food, and Sacrifices",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 11:24:32 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Donkeys played an important role in the lives of ancient Mediterranean people, providing both food and a means of carrying goods. New evidence from an early Bronze Age (2900–2600/2550 BCE) archaeological site in modern-day Israel shows that certain donkeys were also used in ritualistic sacrifices. T"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ritualistically-buried.jpg",
    "titles": [
      "Ritualistically buried donkey remains provide insight into trade and culture in ancient Israel"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Archaeological findings in modern-day Israel indicate that during the early Bronze Age (2900–2600/2550 BCE), donkeys were not only vital for transportation and as a food source for ancient Mediterranean societies but were also used in ritualistic sacrifices. This evidence highlights the multifaceted role of donkeys in early human civilizations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of early human civilizations, specifically the multifaceted role of donkeys. It increases awareness about historical trends and impacts, but doesn't offer actionable insights or report on progress or solutions."
  },
  {
    "title": "Virtual Forest Experience in VR Shows Promise for Stress Reduction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 14:41:51 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-virtual-forest-calms-your-brain-no-hiking-required/\" rel=\"nofollow\" title=\"This Virtual Forest Calms Your Brain – No Hiking Required\"><img alt=\"VR Headset Forest Meditation\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com"
    ],
    "image_url": "",
    "titles": [
      "This Virtual Forest Calms Your Brain – No Hiking Required"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Researchers have developed a virtual forest experience that can calm the brain, accessible through VR headsets. This technology aims to provide the mental health benefits of nature without the need for physical outdoor activities. The study, reported by SciTechDaily, indicates that users can achieve a state of relaxation and reduced stress by immersing themselves in this digital environment.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution to stress reduction, providing readers with a deeper understanding of how technology can be used for mental health benefits. It also offers actionable insights for those interested in using VR for stress management."
  },
  {
    "title": "Automaker Sets Record for Most Safety Recalls in Six Months",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:55:53 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Company has issued more safety recalls in the first six months than any automaker ever."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-458813220-e1752508490277.jpg?w=2048",
    "titles": [
      "Ford recalls more than 850,000 vehicles"
    ],
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "A company has set a record for the most safety recalls by an automaker in the first six months of a year. This development marks a significant increase in the number of vehicles being called back for safety-related issues compared to previous records.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an increase in safety recalls, which can inform readers' decisions about which cars to buy. However, it doesn't provide deeper insight into why this is happening or what the automaker is doing to address the issue."
  },
  {
    "title": "Earth Hour Study: Few Lit Buildings Brighten City Skies, Reveals Research",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 12:00:11 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "When millions of people turn off their lights for Earth Hour each year, something remarkable happens in the night sky above cities. New research from Hong Kong published in Scientific Reports shows that just a small number of decorative buildings and advertising boards can dramatically brighten the "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-few-bright-buildings.jpg",
    "titles": [
      "A few bright buildings light up the entire night sky"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "New research from Hong Kong, published in Scientific Reports, reveals that during Earth Hour, when millions turn off their lights, the night sky above cities noticeably brightens due to a small number of decorative buildings and advertising boards remaining lit. This demonstrates the significant impact of urban lighting on night sky brightness.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information on the impact of urban lighting on night sky brightness, increasing awareness about the environmental effects of our daily practices. However, it doesn't offer clear solutions or progress towards mitigating the problem."
  },
  {
    "title": "Hyundai’s Ioniq 6 N offers more sound, more shifts, more smiles",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 14 Jul 2025 14:39:46 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hyundai appears to be nailing the \"make a fun electric car\" brief right now."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/2026-Hyundai-Ioniq-6-N-1-1152x648.jpg",
    "titles": [
      "Hyundai’s Ioniq 6 N offers more sound, more shifts, more smiles"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.433,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new product in the automobile industry. However, without more detail on how this innovation contributes to progress (e.g., environmental benefits, safety features), it does not fully meet the criteria for a higher score."
  },
  {
    "title": "US Tariffs on EU Goods May Trigger Major Market Downturn, Analysts Warn",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:49:19 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Analysts say much sharper sell-off likely if 30% levies on EU come into force"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F68a5594f-acde-481f-9817-b7f8e350ff38.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "European stocks slip after Trump’s tariff threat"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "Analysts predict a significant market downturn if the US imposes 30% tariffs on European Union goods. This move could lead to a more severe sell-off in financial markets.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about potential economic impacts of the US tariffs on EU goods. However, it doesn't offer solutions or progress, and its depth is limited to what analysts predict, which may or may not occur."
  },
  {
    "title": "Study Raises Concerns Over Health of Nuclear-Armed Leaders",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 11:26:23 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Many former leaders of the world's nine nuclear-armed nations were impaired by health conditions while in office, raising concerns over their decision-making abilities while they had access to nuclear weapon launch codes, a study from the University of Otago, New Zealand, has found."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/missile-gallery.jpg",
    "titles": [
      "Health-impaired world leaders raise nuclear war fears, study suggests"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.426,
    "summary": "A study from the University of Otago, New Zealand, found that many former leaders of the world's nine nuclear-armed countries had health issues during their time in office, raising concerns about their capability to make decisions regarding nuclear weapon launch codes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the health issues of nuclear-armed leaders and their potential impact on decision-making. However, it does not offer solutions to the problem or a deeper understanding of the underlying systems or trends."
  },
  {
    "title": "Lemurs at Risk: Climate Change Threatens Forest Renewal Icons",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 12:00:06 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Most people's encounters with lemurs have occurred through their representations in popular children's media, like \"Zoboomafoo\" or \"Madagascar.\" However, most people don't know that lemurs play an important role in forest renewal and that they're currently in grave danger from climate change."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/lemurs-can-help-save-m.jpg",
    "titles": [
      "Lemurs can help save Madagascan forests, but first we need to protect them"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "Lemurs, often known from children's shows like \"Zoboomafoo\" and \"Madagascar,\" are crucial for forest renewal. However, they face serious threats from climate change. Despite their popularity in media, lemurs are endangered due to environmental challenges.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the threats faced by lemurs due to climate change, contributing to a deeper understanding of the environmental challenges. However, it doesn't provide actionable insights or report on solutions to the problem, limiting its constructive value."
  },
  {
    "title": "These are Sony’s new noise-canceling headphones for NFL coaches",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Sony is finally debuting the headset that it developed specifically for NFL coaches, after teasing it almost a year ago as part of a new partnership with the NFL. The headset features technology and engineering borrowed from Sony’s popular consumer-focused wireless headphones, such as the WH-1000XM6"
    ],
    "image_url": "",
    "titles": [
      "These are Sony’s new noise-canceling headphones for NFL coaches"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a new product, but it doesn't provide a deeper understanding of the topic or report on any solutions or improvements."
  },
  {
    "title": "Space Weather Poses Risk to Global Infrastructure",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 11:33:24 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The burgeoning space industry and the technologies society increasingly relies on—electric grids, aviation and telecommunications—are all vulnerable to the same threat: space weather."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/spacecraft-equipped-wi.jpg",
    "titles": [
      "Spacecraft equipped with a solar sail could deliver earlier warnings of space weather threats to Earth's technologies"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "summary": "The expanding space industry, alongside critical infrastructure such as electric grids, aviation, and telecommunications, faces a shared risk from space weather. This phenomenon, including solar flares and geomagnetic storms, poses potential disruptions to these essential systems and services.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful understanding of the risks posed by space weather to various global infrastructures. However, it does not offer any solutions or improvements to mitigate these risks, nor does it delve deeply into the causes or impacts of the problem."
  },
  {
    "title": "Every Best Buy store will have Nintendo Switch 2 consoles on July 17th",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T11:51:32-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It’s been over a month since the Switch 2’s record-breaking launch, and the console is becoming easier to get with each restock. However, if you’ve been waiting for the launch of Donkey Kong Bananza to buy one, Best Buy sneakily announced that its next in-store restock will happen Thursday, July 17t"
    ],
    "image_url": "",
    "titles": [
      "Every Best Buy store will have Nintendo Switch 2 consoles on July 17th"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the availability of a product. However, it doesn't provide any deeper understanding, solutions, or improvements."
  },
  {
    "title": "Space Junk Clutters Orbit, Threatens Satellites",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Jul 2025 11:30:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Space junk is a huge problem. The surge in satellite launches in recent years is leaving low Earth orbit (LEO) cluttered with debris such as discarded rocket bodies, broken parts and defunct satellites. Beyond the risk of debris colliding with working satellites that are vital for navigation, commun"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-paper-planes-could.jpg",
    "titles": [
      "How paper planes could provide sustainable solutions to space debris"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "The increasing number of satellite launches has significantly cluttered low Earth orbit (LEO) with space junk, including discarded rocket bodies, broken parts, and defunct satellites. This debris poses a risk of colliding with operational satellites essential for navigation and communication, highlighting the growing problem of space pollution.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story raises awareness about the issue of space pollution and its potential impacts on satellite operations, it lacks depth and doesn't provide any actionable insights or solutions to the problem."
  },
  {
    "title": "Texas governor says his emails with Elon Musk are too ‘intimate or embarrassing’ to release",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-14T10:31:30-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Texas Gov. Greg Abbott is refusing to release months&#8217; worth of emails sent to Elon Musk and his companies under public records laws, according to a joint report from ProPublica, The Texas Newsroom, and The Texas Tribune. After initially agreeing to an information request, the governor’s office"
    ],
    "image_url": "",
    "titles": [
      "Texas governor says his emails with Elon Musk are too ‘intimate or embarrassing’ to release"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.392,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems more sensational than constructive. It provides basic awareness about a situation but doesn't offer any actionable insights, solutions, or a deeper understanding of the issue."
  },
  {
    "title": "Deutsche Bank Explores Hypothetical Scenarios in \"What if?\" Note",
    "domain": "business",
    "location": "global",
    "published": "Mon, 14 Jul 2025 15:14:12 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Deutsche Bank's explosive scenario in a note titled, “What if    ?”"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2224363901.jpg?w=2048",
    "titles": [
      "If Trump fires the Fed’s Powell ‘both the currency and the bond market can collapse,’ according to Deutsche Bank"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388,
    "summary": "Deutsche Bank released a speculative note titled \"What if?\" exploring potential explosive scenarios and their implications. The content of the note and its specific scenarios were not detailed in the information provided. Therefore, the outcomes or impacts of these scenarios remain unspecified.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about Deutsche Bank's speculative note, but it doesn't provide any details about the scenarios being considered or their potential implications. Therefore, it doesn't offer much depth or insight."
  }
]