[
  {
    "title": "Thousands Defy Ban to March for LGBTQ Rights in Budapest",
    "domain": "general",
    "location": "global",
    "published": "Sat, 28 Jun 2025 14:22:24 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Tens of thousands have gathered for the LGBTQ march in Hungary's capital, despite a police ban and warning from PM Viktor Orban.",
      "Thousands march in Hungary&#039;s capital despite government ban, highlighting EU-wide resistance against anti-LGBTQ laws.",
      "The annual Budapest Pride march this year is expected to go ahead in the face of a police ban and government hostility. Organizers said they expect tens of thousands of people from dozens of nations to attend the event.",
      "<p>Organisers of Budapest Pride said the government was attempting to restrict peaceful protests by targeting them</p><p><strong>Jeff Bezos and Lauren Sánchez are preparing for the last party of their three-day wedding festivities in Venice as demonstrators mobilise for a final protest against the c",
      "<p>Record numbers expected at march despite Hungary’s leader saying those attending will face ‘legal consequences’</p><p><a href=\"https://www.theguardian.com/world/live/2025/jun/28/europe-latest-news-budapest-pride-march-hungary-orban-ukraine-russia-updates\">Record numbers expected at Budapest Pride",
      "Prime Minister Viktor Orban’s party enacted the ban, trying to create a dilemma for the opposition leader. Now it is the government that faces a tough choice."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/56e4/live/56ed0860-5435-11f0-b4be-8f7caf53b80c.png",
    "titles": [
      "Budapest Pride goes ahead, defying Orban threat of 'legal consequences'",
      "Record attendance expected at Budapest Pride march despite Orban warning",
      "Big attendance expected at Budapest Pride despite police ban",
      "Crowds gather for Budapest Pride march despite Orbán’s threat of ‘legal consequences’ – Europe live",
      "Budapest Pride expected to be a rallying cry against Orbán’s rollback of rights",
      "Budapest Pride Parade Will Go On Despite Orban’s Ban. How Will He Respond?"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.963,
      "consensus": 0.988,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.86,
    "summary": "Tens of thousands of people participated in the Budapest Pride march in Hungary's capital, defying a police ban and warnings of legal consequences from Prime Minister Viktor Orban. The event, which drew participants from dozens of nations, highlighted resistance against the government's anti-LGBTQ laws and efforts to restrict peaceful protests. Despite the government's attempt to enforce a ban, the annual march proceeded, showcasing a significant show of support for LGBTQ rights within the EU.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it highlights a significant act of defiance against anti-LGBTQ laws and restrictions on peaceful protests. It provides readers with a deeper understanding of the political situation in Hungary and the resistance movements taking place. It also increases awareness about the state of LGBTQ rights within the EU."
  },
  {
    "title": "Zohran Mamdani Wins NYC Mayor Race, Signaling Shift in Democratic Party",
    "domain": "general",
    "location": "national",
    "published": "Sat, 28 Jun 2025 12:56:11 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE51RWkzZkZXOTlQSENldzViV0xXZk56MGxyN1VIZFh5MzFFQzE5UC0zcHpIcHl1aVZ5WF9XMWp4WnA1Yy14WTE1dkpoVzdkOHEtNXM5bHZ0cC1EU1M5dlNkRFlrZ2F0WlVvVGw5bUxBaExhMmM?oc=5\" target=\"_blank\">10 new precedents Republicans could regret when Democrats are in power</",
      "Republicans are aiming to tie Democrats to 33-year-old Zohran Mamdani, a Democratic socialist and the presumptive Democratic nominee for New York City mayor.",
      "Some New York investors and business leaders are dismayed that democratic socialist Zohram Mamdani will become the next mayor of New York City.",
      "<p>Road to Majority conference attendees expressed skepticism and begrudging respect for the Muslim democratic socialist</p><p>He is the democratic socialist who has been described as <a href=\"https://www.nytimes.com/2025/06/25/us/politics/mamdani-trump-republicans.html\">a gift to the Republican par"
    ],
    "image_url": "",
    "titles": [
      "10 new precedents Republicans could regret when Democrats are in power - Axios",
      "Republicans aim to tie Democrats to Zohran Mamdani after primary upset",
      "Trump calls New York Democratic mayoral candidate Zohran Mamdani 'a communist'",
      "‘It’s very concerning’: conservatives react to Zohran Mamdani’s New York primary showing"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.935,
      "consensus": 0.985,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.853,
    "summary": "Democratic socialist Zohran Mamdani is set to become the next mayor of New York City, drawing mixed reactions. While some New York investors and business leaders express dismay, Senator Schumer has defended him. This development is part of a broader narrative suggesting the Democratic Party is at a crossroads, facing challenges in aligning its actions with the passions of its base. Mamdani's victory in the mayoral race is seen as significant not only for New York City but also for the national political landscape, indicating a shift in voter sentiment and party dynamics.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides a deep understanding of the political landscape in New York City and the Democratic Party. It offers insights into the implications of Zohran Mamdani's victory for the city and the national political landscape. It also highlights the challenges faced by the Democratic Party in aligning its actions with its base, contributing to the reader's understanding of current political trends."
  },
  {
    "title": "Startups Offer Paid Day Off for Extended Canada Day Weekend",
    "domain": "general",
    "location": "national",
    "published": "Sat, 28 Jun 2025 12:53:59 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Some startup companies say they're calling Monday a wash and giving staff a paid day off in order to smooth out the mid-week quirk and create a long weekend.",
      "TORONTO &#8212; Anyone who works Monday to Friday and is keen for a long weekend this Canada Day has likely had to do a bit of calendar juggling to cope with the ill-timed holiday. The stat day falls on a Tuesday this year, forcing many to work an odd Monday squeezed between days off, unless [&#8230",
      "TORONTO — Anyone who works Monday to Friday and is keen for a long weekend this Canada Day has likely had to do a bit of calendar juggling to cope with the ill-timed holiday. The stat day falls on a Tuesday this year, forcing many to work an odd Monday squeezed between days off, unless [&#8230;]"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/fd716cc5884fce96a6c9d5b0efdd56152f6935f3a35346d8e4d80a376d74920e.jpg?quality=85&strip=all",
    "titles": [
      "‘A no-brainer’: Some bosses happily giving staff Monday off along with Canada Day",
      "‘A no-brainer’: Some bosses happily giving staff Monday off along with Canada Day",
      "‘A no-brainer’: Some bosses happily giving staff Monday off along with Canada Day"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.934,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 1.0
    },
    "score": 0.853,
    "summary": "Several startup companies have decided to give their employees a paid day off on Monday to create a long weekend, addressing the awkward scheduling caused by Canada Day falling on a Tuesday this year. This decision aims to alleviate the inconvenience of having an isolated workday between a weekend and a holiday, allowing for a smoother mid-week break.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a solution implemented by startups to address a scheduling issue. It provides actionable insights for other companies that may face similar issues in the future, and it contributes to the reader's understanding of flexible work policies. The story also reports on an innovative approach to employee wellbeing, showing progress in the area of work-life balance."
  },
  {
    "title": "Israeli Airstrikes in Gaza Kill 62 Amid Ceasefire Hopes",
    "domain": "general",
    "location": "global",
    "published": "Sat, 28 Jun 2025 14:55:26 GMT",
    "source": "The Guardian",
    "sources": [
      "Global News",
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Latest deaths come amid worsening humanitarian situation despite renewed hope for ceasefire</p><p>At least 62 people have been killed in Gaza by overnight Israeli strikes, according to health officials, as the humanitarian situation worsens in the besieged strip despite renewed hope for a ceasefi",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/jun/28/israeli-strikes-kill-scores-of-people-in-gaza-health-officials-say\">here</a></p><p><strong>Emirates</strong> extended its cancellation of flights to and from <strong>Iran’s</strong> cap",
      "The strikes began late Friday and continued into Saturday morning and come as U.S. President Donald Trump says there could be a ceasefire agreement within the next week.",
      "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes killed at least 62 people across Gaza overnight and into Saturday, health workers said, as ceasefire prospects were said to be improving. Three children and their parents were killed in an Israeli strike on a tent camp in Muwasi near the southern city"
    ],
    "image_url": "https://i.guim.co.uk/img/media/401df8f77c3867b7128248db84b04ace6fbe739c/465_0_4283_3427/master/4283.jpg?width=140&quality=85&auto=format&fit=max&s=3d565127b58a9deba93f85b5ebe0b305",
    "titles": [
      "Israeli strikes kill more than 60 people in Gaza, health officials say",
      "Israeli strikes kill dozens in Gaza as Qatar calls for peace talks – as it happened",
      "At least 34 people killed in Israeli strikes in Gaza as ceasefire prospects inch closer",
      "Israeli strikes kill at least 62 people in Gaza as ceasefire prospects move closer"
    ],
    "score_components": {
      "magnitude": 0.91,
      "recency": 0.975,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.835,
    "summary": "Israeli airstrikes in Gaza have resulted in at least 62 deaths, including a family of five in a tent camp near Muwasi, amid a deteriorating humanitarian situation. The strikes occurred from late Friday into Saturday, even as there were renewed hopes for a ceasefire, highlighted by President Trump's statement of a possible agreement within a week. This escalation comes despite ongoing discussions for peace.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story is about a negative event, it provides useful context about the ongoing conflict and the hope for a ceasefire. However, it doesn't report on any concrete solutions or improvements, and it doesn't provide a deep understanding of the systems or causes behind the conflict."
  },
  {
    "title": "Norris Takes Pole at Austrian GP, Beats Leclerc by Half a Second",
    "domain": "general",
    "location": "global",
    "published": "Sat, 28 Jun 2025 15:40:30 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Lando Norris takes pole position for the Austrian Grand Prix by more than 0.5 seconds on one of the shortest laps of the year.",
      "Lando Norris takes pole position for the Austrian Grand Prix by more than 0.5 seconds on one of the shortest laps of the year.",
      "<ul><li><p>McLaren driver quickest, with Leclerc second on grid</p></li><li><p>Verstappen says Red Bull is ‘completely undriveable’</p></li></ul><p>Lando Norris claimed pole position for the Austrian Grand Prix by half a second at the Red Bull Ring, beating Ferrari’s Charles Leclerc into second and ",
      "Lando Norris took a dominant pole position at the Austrian Grand Prix as late yellow flag drama left championship leader Oscar Piastri and Max Verstappen frustrated."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c7df/live/024eef20-5436-11f0-bd57-912fd7e4c7e7.jpg",
    "titles": [
      "Norris takes Austria pole with sensational lap",
      "Norris takes Austria pole with sensational lap",
      "Lando Norris storms to pole at Austrian Grand Prix while Verstappen slumps to seventh",
      "Norris takes dominant Austrian GP pole, Verstappen only seventh"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.99,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "Lando Norris secured pole position for the Austrian Grand Prix, outpacing Ferrari's Charles Leclerc by over 0.5 seconds on one of the season's shortest laps. His performance at the Red Bull Ring was notably dominant, despite late yellow flag interruptions that affected other racers, including championship leader Oscar Piastri and Max Verstappen, who criticized his Red Bull car as 'completely undriveable'.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a sporting event, but it doesn't provide much depth or insight beyond the immediate results. It doesn't give the reader actionable insights or deeper understanding of the sport, nor does it report on solutions, improvements, or innovations."
  },
  {
    "title": "Drone Strikes in Odesa Kill 2, Injure 17; Ukraine Hits Targets in Crimea",
    "domain": "general",
    "location": "national",
    "published": "Sat, 28 Jun 2025 07:40:12 -0400",
    "source": "ABC News",
    "sources": [
      "Global News",
      "ABC News",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Ukrainian authorities say two people were killed and some 17 injured after Russian drones attacked the southern Ukrainian port city of Odesa",
      "In Odesa, a drone slammed into a residential tower block in the city, causing damage to three floors and trapping residents, emergency services said.",
      "KYIV, Ukraine (AP) — Russian drones struck the southern Ukrainian port city of Odesa overnight, killing two people and injuring at least 17, Ukrainian authorities said on Saturday. Meanwhile, three attack helicopters and an anti-aircraft missile system were destroyed in the Russian-occupied Crimean "
    ],
    "image_url": "https://s.abcnews.com/images/International/wirestory_600b482ec8ebc1ad75629cd4c0ea178b_4x3_384.jpg",
    "titles": [
      "Russian drone strike on Odesa kills married couple, injures 17 people, Ukraine says",
      "Russian drones kill 2 and injure 17 in Odesa as Ukraine destroys helicopters in Crimea",
      "Russian drones kill 2 and injure 17 in Odesa as Ukraine destroys helicopters in Crimea"
    ],
    "score_components": {
      "magnitude": 0.91,
      "recency": 0.911,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary": "Russian drone attacks on the southern Ukrainian port city of Odesa resulted in two deaths and at least 17 injuries, as confirmed by Ukrainian authorities. The strikes, which occurred overnight, also damaged a residential tower block, affecting three floors and trapping residents inside. Additionally, Ukrainian forces destroyed three attack helicopters and an anti-aircraft missile system in Russian-occupied Crimea.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing conflict between Russia and Ukraine, including specific details about recent attacks. However, it doesn't report on any solutions or progress towards resolving the conflict. It does increase awareness about the severity and impact of the situation, contributing to the reader's understanding of global events."
  },
  {
    "title": "Jeff Bezos Weds Lauren Sanchez in $56M Venice Ceremony Amid Protests",
    "domain": "general",
    "location": "global",
    "published": "Sat, 28 Jun 2025 12:42:47 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Business Insider",
      "Forbes",
      "ABC News",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The festivities are expected to last three days, ending with a large party on Saturday.",
      "Amazon founder Jeff Bezos married his fiancée Lauren Sanchez in a controversial three-day celebration. Estimated to cost up to $56 million, the guest list included Hollywood stars, athletes and even royalty.",
      "ABC News’ Maggie Rulli reports from Italy, sharing the star-studded details on Amazon CEO Jeff Bezos and Lauren Sanchez's wedding as it kicks off in Venice, Italy.",
      "The bride announced the marriage on Friday night in an Instagram post under the name Lauren Sánchez Bezos.",
      "The wedding, hosted in Venice, Italy, reportedly cost millions of dollars as residents protest the upcoming luxury event.",
      "I came to Venice for the wedding of the century &mdash; but mostly, I saw security guards, fences, and a hotel door closing in my face.",
      "In this Saturday edition of Business Insider Today, we're talking about the Bezos wedding, successful men's morning routines, and luxury gyms.",
      "Jeff Bezos' yacht set sail in 2023 and has since hosted a number of Lauren Sánchez and Bezos' A-list friends."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0cec/live/8dfd73a0-5406-11f0-a2ff-17a82c2e8bc4.jpg",
    "titles": [
      "Celebrities descend on Venice Jeff Bezos and Lauren Sanchez's wedding",
      "Jeff Bezos and Lauren Sanchez marry in Venice",
      "WATCH:  Inside look at Jeff Bezos and Lauren Sanchez’s wedding in Venice",
      "Jeff Bezos and Lauren Sánchez Tie the Knot",
      "Jeff Bezos And Lauren Sánchez Bezos Wedding: Who’s Attending,  Performing And More",
      "I went to Venice on the weekend of Jeff Bezos' wedding. 12 photos show why I was disappointed.",
      "Inside Jeff Bezos and Lauren Sánchez's Venetian vows",
      "Inside Koru, Jeff Bezos' yacht that plays host to his and Lauren Sánchez's A-list friends"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.931,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.796,
    "summary": "Jeff Bezos married Lauren Sanchez in a lavish three-day celebration in Venice, Italy, which concluded on Saturday. The event, estimated to cost up to $56 million, drew a mix of Hollywood stars, athletes, and royalty. Despite the opulence, the wedding faced controversy and protests from local residents. Lauren Sanchez announced their marriage on Instagram. The festivities were extensively covered, highlighting the high-profile guest list and security measures.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story primarily focuses on the sensational aspects of Jeff Bezos' wedding, such as the cost, location, and guest list. It offers basic awareness about the event and the controversy it stirred among locals, but it doesn't provide any actionable insights or deeper understanding for the reader."
  },
  {
    "title": "Bulls Trade Lonzo Ball to Cavaliers for Isaac Okoro",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:50:03 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Chicago Bulls are trading Lonzo Ball to the Cleveland Cavaliers for Isaac Okoro, sources told ESPN's Shams Charania.",
      "The Cleveland Cavaliers made a trade on June 28 with the Chicago Bulls, acquiring point guard Lonzo Ball.",
      "Ball played 35 games this past season after missing 2 1/2 seasons due to various knee injuries.",
      "<p>The Chicago Bulls have traded point guard Lonzo Ball to the Cavaliers in a one-for-one swap for wing Isaac Okoro, ESPN&#8217;s Shams Charania reported Saturday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Bulls trading Ball to Cavs for Okoro",
      "Cavaliers trade for Lonzo Ball, sending Isaac Okoro to Bulls",
      "Bulls reportedly dealing Lonzo Ball to Cavaliers for Isaac Okoro",
      "Report: Bulls trade Lonzo Ball to Cavaliers for Isaac Okoro"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.993,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.79,
    "summary": "The Chicago Bulls have traded point guard Lonzo Ball to the Cleveland Cavaliers in exchange for wing Isaac Okoro, as reported by ESPN's Shams Charania. The trade comes after Ball played 35 games in the past season, following a 2 1/2-year hiatus due to knee injuries. This move marks a significant change for both teams, with Ball joining the Cavaliers and Okoro moving to the Bulls.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for basketball fans, offering insights into team strategies and player careers. However, it does not report on any broader solutions, improvements, or innovations, and its relevance is limited to a specific audience."
  },
  {
    "title": "Ottawa Man Charged for Vandalizing Holocaust Monument",
    "domain": "general",
    "location": "national",
    "published": "Sat, 28 Jun 2025 15:59:03 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews",
      "CBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A 46-year-old man has been charged after Canada's National Holocaust Monument was vandalized earlier this month.",
      "<img alt=\"The words &apos;FEED ME&apos; are painted in red on a concrete monument\" height=\"349\" src=\"https://i.cbc.ca/1.7556181.1749486903!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/holocaut-memorial-vandalism-20250609.jpg\" title=\"The words &apos;FEED ME&apos; are seen painted in red on t",
      "An Ottawa man has ben charged following an act of vandalism on the National Holocaust Memorial earlier this month. A press release from the Ottawa Police Service says a 46-year-old man has been charged with mischief to a war memorial, mischief exceeding $5,000 and harassment by threatening conduct. "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/26cb6b529b0a61eda718df522140ff116aa22522f9ddcdfbb6e9b0698314026c.jpg?quality=85&strip=all",
    "titles": [
      "Man charged with vandalism of National Holocaust Monument",
      "Man charged over vandalism of National Holocaust Monument",
      "Man charged following vandalism of National Holocaust Memorial"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.996,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.786,
    "summary": "A 46-year-old man from Ottawa has been charged with multiple offenses, including mischief to a war memorial, mischief exceeding $5,000, and harassment by threatening conduct after he vandalized Canada's National Holocaust Monument. The vandalism involved the phrase \"FEED ME\" being painted in red on the monument.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an act of vandalism but does not offer any deeper insights or useful information. It does not report on any solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "British Tennis Prodigy Shines at Wimbledon After Late Growth Spurt",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:29:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "A look at the tennis players who could define Wimbledon this year.",
      "<p>A scrappy, smart defensive player in his formative years, a late growth spurt and shrewd coaching have honed the 23-year-old Briton into an opponent others now fear</p><p>Towards the end of 2018, a relatively unknown 16-year-old British tennis player took some of his first strides on the professi"
    ],
    "image_url": "",
    "titles": [
      "The favorites to the underdogs: Ranking the Wimbledon contenders",
      "The making of Jack Draper: from teen ‘maniac’ to Wimbledon title contender"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.986,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.723,
    "summary": "A 23-year-old British tennis player, once known for his scrappy, smart defensive play during his formative years, has emerged as a formidable opponent at Wimbledon due to a late growth spurt and effective coaching. Starting his professional journey at 16, his development has positioned him as a key player to watch in this year's tournament.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a tennis player's development and performance, which could be inspiring or instructive for readers interested in tennis or sports development more generally. However, it does not report on any broader solutions or improvements, and its relevance is limited to a specific audience."
  },
  {
    "title": "Cooper Flagg Goes No. 1 in Emotional 2025 NHL Draft; CHL Dominates Selections",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:50:03 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Islanders selected gifted defenseman Matthew Schaefer, 17, with the No. 1 pick in the NHL draft Friday night. Center Michael Misa went second to the Sharks, and the Blackhawks took Swedish forward Anton Frondell third.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQMGkwN2hFV2Q1YUFfQ2IwMnBweVpnUWxlbGJkdGxER0lQSE91S1pRenVuMXh1TkQzM3g3MWhpWUVjZ1JxdU5Lc05KMTJ3N1pKSVhNaTROdWF5QnZSbkM2Q2RyOElhbmNWdFVHSGJWM21GYmZSQVl3c1NGZjBFWWJHQUZR?oc=5\" target=\"_blank\">Schaefer shines on emotional night, goes No. 1 to I",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPTTMzZElUVE9TOVlaWjVNSEdROHJHYkYtLUI3NmMwRjJUQnoyTTF3RVlHUXN1dWtUOW9pY2Nac3YyMnhEbEh3dW5ZYXhCT1hLZVlSckFGR2ljeUhvWTdObzRYclA1bHVQMFM0a05rbThHNGx3OTVuUGtLVDF6S1gwWm5JVkVQdk9nRDlCNzdPWTR1aEVpS2c?oc=5\" target=\"_blank\">Sabres select Mrtka with",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE51Q0d6eWJQSmV3UFhaYUhFemNQbnVNelpybWd3Rno2SjBqSTl6VHFobWNBcUtEVzZWbDdHMzR0TS0zcTM2Sk1XTkxzM0lhNXRQSm5JT2FzYm5aMVhHTlRzeC1HODhkR2pxVXY2M0JCcHNMSlRpVHhJNHhR?oc=5\" target=\"_blank\">Meredith Gaudreau makes Blue Jackets selection at 2025 NHL Draf",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTFBrQzExa0hxa1JTUG9mY1VsRWxSaHh5MUgyMmtXTkt4cC1jeUNyeXVaeTgwcWlSYXFDQzNkTXNDTzNicElaRnRHdGxKT1A2OFFWOVJMN0N0RnJQRGtHakpIWEtIZmNNd3BkLU1nUDJYZw?oc=5\" target=\"_blank\">Utah Picks Desnoyers on First Day of the NHL Draft</a>&nbsp;&nbsp;<font color",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1WUi0xcGdHQjVnbV9qRnFia1V4VU1wV0ItTUdncjMtbUZvY3Axakw5S0V5dGlfTWJma0ctSXE0MGI2VkIzc2t3WWtWdFdPVl9sdm10cUZIZERZek1xMDdmVXhzQzUybWh5NTIzUFo5ZEZabWlya2s2ZURfNXVCQQ?oc=5\" target=\"_blank\">NHL Draft Raw: James Hagens</a>&nbsp;&nbsp;<font color=\"#"
    ],
    "image_url": "",
    "titles": [
      "Schaefer goes No. 1 to Isles; Misa, Frondell follow",
      "Schaefer shines on emotional night, goes No. 1 to Islanders in 2025 NHL Draft - NHL.com",
      "Sabres select Mrtka with 9th pick in NHL Draft - NHL.com",
      "Meredith Gaudreau makes Blue Jackets selection at 2025 NHL Draft - NHL.com",
      "Utah Picks Desnoyers on First Day of the NHL Draft - NHL.com",
      "NHL Draft Raw: James Hagens - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.722,
    "summary": "The 2025 NHL Draft's first round was marked by significant emotion and a strong presence from the Canadian Hockey League. Cooper Flagg was selected as the No. 1 overall pick, anticipated to make an immediate impact with Dallas. The draft saw 32 players achieving their lifelong dream, with discussions and analyses highlighting the outcomes and potential impacts of the selections made, including the winners and losers of the round.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers a good depth of information about the NHL draft, including the selection of Cooper Flagg and the strong presence of the Canadian Hockey League. It provides useful context and analysis of the draft's outcomes, contributing to the reader's understanding of the event and its potential impacts."
  },
  {
    "title": "Panthers Re-sign Conn Smythe Winner Bennett for $64M Ahead of NHL Draft",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:50:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Panthers signed Conn Smythe winner Sam Bennett to an eight-year extension worth $64 million on Friday night, hours before the start of the NHL draft.",
      "<p>Sam Bennett is staying with the Stanley Cup champs.</p>",
      "<p>One of the best bench bigs in the NBA is sticking around in Minnesota. </p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers keep playoff MVP Bennett on 8-year deal",
      "Panthers re-sign Sam Bennett to eight-year, $64M contract",
      "Report: Timberwolves to re-sign C Naz Reid to five-year, $125 million contract"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.722,
    "summary": "The Panthers have secured Conn Smythe winner Sam Bennett with an eight-year contract extension valued at $64 million, announced just before the NHL draft commenced. This move keeps the Stanley Cup champion with the team, reflecting Bennett's commitment to the Panthers. Meanwhile, the NHL's free agency period is set to start on July 1 at noon ET. In a related note, John Tavares opted for a team-friendly deal with the Leafs, prioritizing happiness and team success over exploring free agency, aiming to support the team's financial flexibility for future endeavors.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a good level of useful information about the NHL draft and free agency period. It also highlights the strategic decisions made by teams and players, providing some insight into the workings of the NHL. However, it doesn't fully explore the implications of these decisions or how they might contribute to progress or solutions."
  },
  {
    "title": "Reddit Integrates AI Tools to Boost Experience on 20th Anniversary",
    "domain": "business",
    "location": "national",
    "published": "Sat, 28 Jun 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "After two decades, Reddit faces the emergence of AI chatbots that threaten to inhale its vast swaths of data and siphon its users.",
      "Reddit has become known as the place to go for unfiltered answers from real, human users. But as the site celebrates its 20th anniversary this week, the company is increasingly thinking about how it can augment that human work with AI. The initial rollout of AI tools, like Reddit Answers, is \"going "
    ],
    "image_url": "",
    "titles": [
      "At 20 years old, Reddit is defending its data and fighting AI with AI",
      "Reddit turns 20, and it’s going big on AI"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.917,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary": "Reddit, marking its 20th anniversary, is exploring AI integration to enhance user experience amid concerns of AI chatbots potentially using its extensive data and affecting user base. The company has initiated the rollout of AI tools, such as Reddit Answers, to complement its traditional model of providing unfiltered answers from real users. This move reflects Reddit's strategic response to the evolving digital landscape and the potential challenges posed by AI technology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress and innovation in the digital landscape, with Reddit integrating AI tools to enhance user experience. It provides readers with a deeper understanding of the potential challenges and solutions related to AI technology in social media platforms."
  },
  {
    "title": "Matthew Schaefer Selected No. 1 in NHL Draft by NY Islanders",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 27 Jun 2025 23:16:05 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "NHL",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxObjRldXdXemwxaDV4b1kxMWN6WUZlaUl2MVJzOUhxcTdmeEhVc2RZRWhFUHo0Z0FJMnVwRy1xZzNsTjcxYzhLZFhrc3l0X1JNWkF2UUZPbzRZSkY0Y3lNcmlXLVRsWmU4R2FwbHpNR0VlMzlVU3F2SDhvYjNjeUMySFpBcGJaQk1vSHhqdl90RGVLQQ?oc=5\" target=\"_blank\">Islanders Select Defenseman M",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxNdklFRWk0cXpoaUlNZE8tNWVlVnJEWnRFemM4OGg0dkZWXzhadkY2alpzOUtNSzVXTzFBeXpHWUx5M0F2Y0JtSlk5Qll6S2Q4Y1FZajRTWmFTQlN4ampReEFiQkRGNE1zcmNOcjQxc09tMzVCV2hpMWZCaUZYVndFamU2SXFERGpSdW45d0RhLUxxVnFpbHN4QWRUUDk3eHM?oc=5\" target=\"_blank\">2025 NHL Dra",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQOGpkSU1xbVp4T25CZ2ZpeXdtNGV6UEIxRTNIREc5cHlOQnY4VHdQZmZCRmZKNGdvR2h6NDI2NlpoTG9HV0RiNUNhNGdEbDFURDdGSVBUdTFQWDhxWldCYVpVSnhZTTRRUjFSczI5SVFFY1lEakxpemdMNlpUVGZPN0RyZ056c0dhQnVZ?oc=5\" target=\"_blank\">Dort announces trade at NHL Draft | Mon",
      "<p>The New York Islanders selected defenseman Matthew Schaefer with the No. 1 pick in the NHL draft Friday night.</p>",
      "<p>Sportsnet&#8217;s Ailish Forfar speaks with Matthew Schaefer about the emotions he was feeling after hearing his name called with the first overall pick by the New York Islanders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Islanders Select Defenseman Matthew Schaefer No. 1 at NHL Draft - Sports Illustrated",
      "2025 NHL Draft Press Conference - Matthew Schaefer - NHL.com",
      "Dort announces trade at NHL Draft | Montréal Canadiens - NHL.com",
      "Islanders select defenceman Matthew Schaefer first overall in 2025 NHL Draft",
      "Islanders’ No. 1 pick Schaefer reflects on emotional draft day moment"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.703,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary": "The New York Islanders chose 17-year-old Canadian defenseman Matthew Schaefer as the No. 1 pick in the NHL draft, marking a significant moment in his career following personal challenges. Schaefer, celebrated for his exceptional talent and potential as a future superstar, expressed strong emotions upon his selection. Following Schaefer, the San Jose Sharks selected 18-year-old Canadian forward Michael Misa with the second overall pick.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the NHL draft, highlighting the top picks and their potential impact on the teams. However, it doesn't delve into the systems or trends in the draft process, nor does it provide insights into how these picks could solve problems or improve the teams."
  },
  {
    "title": "Warren Buffett Pledges Majority of Wealth to Charity, Including Gates Foundation",
    "domain": "business",
    "location": "global",
    "published": "2025-06-28T15:23:59Z",
    "source": "Business Insider",
    "sources": [
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Buffett, 94, has pledged to give away the majority of his fortune to philanthropic causes.",
      "About 9.43 million Class B shares will be given to the Bill &#038; Melinda Gates Foundation Trust, and another 2.92 million shares will be donated to his children’s foundations."
    ],
    "image_url": "https://i.insider.com/685fe9783d5881a51c1c5138?format=jpeg",
    "titles": [
      "Warren Buffett is giving away $6 billion in Berkshire shares",
      "Buffett donates $6 billion in Berkshire shares to charities"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "Warren Buffett, aged 94, has committed to donating the majority of his wealth to charitable causes. He will donate approximately 9.43 million Class B shares to the Bill & Melinda Gates Foundation Trust and an additional 2.92 million shares to the foundations established by his children. This move continues Buffett's history of philanthropy and support for various charitable organizations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights the philanthropic efforts of a high-profile figure, Warren Buffett, and his commitment to contribute to solving societal problems through charity. This can inspire readers to consider their own potential for charitable giving or involvement."
  },
  {
    "title": "Senate GOP Revises $4.2T Tax Bill, Targets SALT, Medicaid, Clean Energy",
    "domain": "business",
    "location": "global",
    "published": "Sat, 28 Jun 2025 11:48:10 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The measure has gone through several revisions as Republicans have sparred over provisions ahead of the bill’s July 4 deadline.",
      "Senate Republicans unveiled a new version of their $4.2 trillion tax cut package that adjusts key provisions on the SALT deduction, Medicaid and clean energy as they try to meet a July 4 deadline set by President Donald Trump."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68600e86c68035b8876ecf93/0x0.jpg?width=960&precrop=1584%2C1056%2Cx0%2Cy0",
    "titles": [
      "Senate Plans To Vote On Trump’s Signature Spending Bill Today",
      "Senate Tweaks Trump Tax Bill in Bid to Court Republican Holdouts"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary": "Senate Republicans introduced a revised $4.2 trillion tax cut bill, modifying aspects related to the State and Local Tax (SALT) deduction, Medicaid, and clean energy initiatives. These changes come after internal disagreements within the party. The adjustments aim to align with a July 4 deadline set by President Donald Trump for the bill's passage.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the revised tax bill, its implications on SALT, Medicaid, and clean energy initiatives. It also gives a sense of the political dynamics within the GOP. However, it doesn't provide solutions or progress towards resolving the issues at hand."
  },
  {
    "title": "Pegula Triumphs Over Swiatek to Win Bad Homburg Open",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:50:03 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jessica Pegula contained Iga Swiatek's heavy topspin game on grass to earn a 6-4, 7-5 victory on Saturday and lift the Bad Homburg Open title.",
      "Former world number one Iga Swiatek was playing in her first grass-court final but was overpowered by Jessica Pegula who cruised to a 6-4 7-5 win."
    ],
    "image_url": "",
    "titles": [
      "Pegula handles Swiatek to win Bad Homburg title",
      "'There's hope for me on grass' - Swiatek loses Bad Homburg final"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.692,
    "summary": "Jessica Pegula defeated Iga Swiatek with a score of 6-4, 7-5 on Saturday to win the Bad Homburg Open title. Overcoming Swiatek's topspin game on grass, Pegula showcased a powerful performance. This victory came in Swiatek's first grass-court final, marking a significant win for Pegula against the former world number one.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a sports event and the triumph of a player. However, it does not provide deeper understanding or actionable insights. It does not report on solutions or improvements, and its impact on systems, causes, trends, or impacts that matter is minimal."
  },
  {
    "title": "France Bans Smoking in Public Spaces to Protect Children",
    "domain": "business",
    "location": "national",
    "published": "Sat, 28 Jun 2025 12:27:30 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "PARIS (AP) &#8212; France has struggled to kick its smoking habit. A new public health decree published Saturday aims to change that. In the coming days, smoking will be banned in all French parks and sports venues, at beaches and bus stops, in a perimeter around all schools, and anywhere children c",
      "PARIS (AP) — France has struggled to kick its smoking habit. A new public health decree published Saturday aims to change that. In the coming days, smoking will be banned in all French parks and sports venues, at beaches and bus stops, in a perimeter around all schools, and anywhere children could g"
    ],
    "image_url": "",
    "titles": [
      "France to ban smoking in parks, beaches, and near schools",
      "France to ban smoking in parks, beaches, and near schools"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.926,
      "consensus": 0.682,
      "constructiveness": 1.0,
      "proximity": 0.25
    },
    "score": 0.691,
    "summary": "France has enacted a new public health decree to combat smoking. This regulation, effective immediately, prohibits smoking in parks, sports venues, beaches, bus stops, around schools, and any areas frequented by children. The measure aims to address France's ongoing struggle with smoking by reducing public exposure to secondhand smoke.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a new regulation enacted to solve a public health problem. It increases reader's awareness about the harmful effects of secondhand smoke, particularly on children, and the measures being taken to combat this issue. It may also inspire readers in other locations to advocate for similar regulations."
  },
  {
    "title": "Corporations Join Pride Events, Marking Shift in LGBTQ+ Support Since 1990s",
    "domain": "business",
    "location": "global",
    "published": "2025-06-28T13:35:02Z",
    "source": "Business Insider",
    "sources": [
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "These days, summer vacation is more than sitting by the pool or biking around the neighborhood.",
      "Corporations began getting involved with Pride in the 1990s, about two decades after the first Pride march."
    ],
    "image_url": "https://i.insider.com/685c66bf85e81483682cc709?format=jpeg",
    "titles": [
      "20 photos that show how summer vacation in the US has changed over the last 100 years",
      "Big brands are pulling out of Pride. Here’s how their involvement has changed over the years"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.948,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary": "The involvement of corporations in Pride events began in the 1990s, approximately 20 years following the inaugural Pride march. This marks a shift in how companies engage with and support LGBTQ+ communities, indicating a broader societal change towards inclusivity since the first Pride march.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful historical context and insight into the changing attitudes towards LGBTQ+ communities, particularly in the corporate world. It may lack specific actionable insights for the reader, but it does increase awareness about societal trends and the progress made in inclusivity."
  },
  {
    "title": "China Limits Rare Earth Exports, Global Automakers in Disarray",
    "domain": "business",
    "location": "national",
    "published": "Sat, 28 Jun 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "China dominates the world‘s production and processing of rare earth elements. A sudden export restriction sent the auto industry into panic.",
      "<p>The truce between Israel and Iran, protests in Nairobi, wildfires near Athens and the summer solstice at Stonehenge: the past seven days as captured by the <a href=\"https://www.instagram.com/_twenty_photos_/\">world’s leading photojournalists</a></p><ul><li><p><em><strong>Warning: this gallery con"
    ],
    "image_url": "",
    "titles": [
      "How China could shut down auto factories around the world",
      "The week around the world in 20 pictures"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.917,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary": "China's sudden restriction on the export of rare earth elements, crucial for manufacturing in the auto industry, has caused widespread panic among global automakers. This move underscores China's dominance in the production and processing of these essential materials. Concurrently, significant global events include a truce between Israel and Iran, protests in Nairobi, wildfires near Athens, and the summer solstice celebration at Stonehenge, all highlighted in a gallery by leading photojournalists.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about China's dominance in the production of rare earth elements and its implications on the global auto industry. However, it lacks depth in terms of potential solutions or responses from the affected automakers."
  },
  {
    "title": "Chargers' Jim Harbaugh Implicated in Hacking Lawsuit Involving Ex-Assistant",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 15:05:09 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Chargers head coach Jim Harbaugh was added to a federal lawsuit about hacking allegations against former Michigan assistant Matthew Weiss.",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxQTTFyMU8wQm5mekp1T2pSY2NIVlVnYkJVdC10X1o2OWlFVzlkRlZsLXBOZFl4MlZWNFVDVnBtTmxPb0t1UzVlVmMzeWhqVjdWVWhvRmMyTkxBaWZ5VEtVc1paR1NheVl0N1AzQy1WMnpnOWVhSFNEc2RpV0JBeWpYNVY5dzFOUjVtWGpxbTgwMm9QTzU5NHc?oc=5\" target=\"_blank\">Jim Harbaugh Included in"
    ],
    "image_url": "",
    "titles": [
      "Chargers coach Jim Harbaugh added to federal lawsuit against former Michigan assistant",
      "Jim Harbaugh Included in Lawsuit Against Former Ravens Assistant - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.67,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary": "Jim Harbaugh, the head coach of the Chargers, has been implicated in a federal lawsuit concerning hacking allegations. The lawsuit involves former Michigan assistant Matthew Weiss. Harbaugh's inclusion in the legal action adds a notable dimension to the ongoing investigation into the allegations against Weiss. The current status of the lawsuit or the specific allegations against Harbaugh were not detailed in the provided content.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a lawsuit involving a prominent figure in sports, but it lacks depth and insight. It does not provide any actionable insights or deeper understanding for the reader, nor does it report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Diamondbacks' Marte Moved to Tears by Fan's Remark About Late Mother",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 28 Jun 2025 11:50:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Diamondbacks second baseman Ketel Marte said a fan in Chicago who brought him to tears during a game against the White Sox this week shouted that he messaged his late mother the previous night.",
      "<p>Arizona Diamondbacks second baseman Ketel Marte said a fan in Chicago who brought him to tears during a game against the White Sox this week shouted that he messaged his late mother the previous night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Marte says fan shouted he messaged late mother",
      "Diamondbacks’ Ketel Marte reveals what fan said to him about his late mother"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary": "During a game against the Chicago White Sox, Arizona Diamondbacks second baseman Ketel Marte was brought to tears by a fan's shout. The fan claimed to have messaged Marte's late mother the previous night. Marte's emotional reaction highlights the personal and impactful nature of the remark.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is largely reactive and sensational, focusing on a player's emotional reaction to a fan's remark. It does not provide actionable insights or deeper understanding, nor does it report on solutions or improvements. Its contribution to awareness of systems, causes, trends, or impacts is minimal."
  },
  {
    "title": "The Supreme Court just upended internet law, and I have questions",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-28T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Age verification is perhaps the hottest battleground for online speech, and the Supreme Court just settled a pivotal question: does using it to gate adult content violate the First Amendment in the US? For roughly the past 20 years the answer has been \"yes\" - now, as of Friday, it's an unambiguous \"",
      "5th Circuit ruling reversed; FCC can continue programs that boost Internet access.",
      "Adults have no First Amendment right to avoid age verification, 6–3 ruling says."
    ],
    "image_url": "",
    "titles": [
      "The Supreme Court just upended internet law, and I have questions",
      "Supreme Court overturns 5th Circuit ruling that upended Universal Service Fund",
      "Supreme Court upholds Texas porn law that caused Pornhub to leave the state"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.643,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary, it's difficult to assess the constructiveness of the story. However, the title suggests it might raise awareness about changes in internet law, but doesn't provide any actionable insights or deeper understanding."
  },
  {
    "title": "AI Aids in Preserving Europe's Historical Scents",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 12:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Researchers are merging multidisciplinary expertise with AI tools to document, reconstruct and preserve Europe's historical scents."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/researchers-revive-eur.jpg",
    "titles": [
      "Reviving Europe's historical scents—including 'the smell of hell'"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "Researchers are utilizing artificial intelligence (AI) alongside multidisciplinary expertise to document, reconstruct, and preserve historical scents across Europe. This innovative approach aims to capture and safeguard the olfactory heritage that is part of the continent's cultural and historical landscape.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights an innovative solution (AI) being used to preserve historical scents, contributing to the reader's understanding of how technology can be applied in cultural preservation. It also increases awareness about the importance of olfactory heritage."
  },
  {
    "title": "Jeffrey Bland Advocates Daily Gratitude for Holistic Health",
    "domain": "business",
    "location": "national",
    "published": "Sat, 28 Jun 2025 15:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "\"For me, the first thing is to wake up every morning and just say how grateful you are to be there,\" says Jeffrey Bland, the \"father of functional medicine.\""
    ],
    "image_url": "",
    "titles": [
      "I’m 79 years old and the ‘father of functional medicine’: Here’s my daily routine for a healthy life"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "Jeffrey Bland, recognized as the \"father of functional medicine,\" emphasizes the importance of gratitude in daily life. He advocates for starting each day by acknowledging gratitude for being alive. This practice underscores his holistic approach to health and wellness, reflecting his contributions to functional medicine.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It gives the reader actionable insights on how to improve their health and wellness by practicing daily gratitude. It also highlights the work of Jeffrey Bland in the field of functional medicine, providing an understanding of his holistic approach to health."
  },
  {
    "title": "New 3D Printing Method Uses Light for Complex Structures",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 11:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Lawrence Livermore National Laboratory (LLNL) researchers have developed a novel 3D printing technique that uses light to build complex structures, then cleanly dissolves the support material, expanding possibilities in multi-material additive manufacturing (AM)."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/team-tackles-support-s.jpg",
    "titles": [
      "Team tackles support structure bottlenecks with dual-wavelength 3D printing"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "Researchers at Lawrence Livermore National Laboratory have created a new 3D printing method that enables the construction of complex structures using light. This technique uniquely allows the support material to be dissolved cleanly, thereby broadening the scope for multi-material additive manufacturing.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it reports on a new innovation in 3D printing technology, providing the reader with a deeper understanding of the progress in this field. It also highlights the potential applications of this technology, contributing to decision-making in related industries."
  },
  {
    "title": "Medicaid Funds Healthcare in Red States, Easing Hospital Burdens",
    "domain": "business",
    "location": "global",
    "published": "Sat, 28 Jun 2025 15:31:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Guess who’s paying for the costs of hospitals and nursing homes in red states?"
    ],
    "image_url": "https://images.mktw.net/im-60869077",
    "titles": [
      "Why Republicans are defending this lucrative Medicaid scam"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "In red states, the financial burden of hospitals and nursing homes is largely shouldered by the federal government through Medicaid, a joint federal and state program designed to assist with medical costs for people with limited income and resources. This funding mechanism helps cover the costs of care for many residents in these states, ensuring access to necessary healthcare services.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the role of Medicaid in funding healthcare in red states. It offers an understanding of how the healthcare system is financed and the impact of this on access to healthcare services. However, it does not report on any solutions, improvements, or innovations, which prevents it from scoring higher."
  },
  {
    "title": "Tesla says it delivered its first car autonomously from factory to customer",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-28T09:51:44-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "This might be a bigger deal than the robotaxis. Tesla said it completed its first fully autonomous vehicle delivery from factory to customer. A video posted on X shows the vehicle — a Tesla Model Y — leaving the company’s Austin Gigafactory, driving on the highway, passing through suburban sprawl an"
    ],
    "image_url": "",
    "titles": [
      "Tesla says it delivered its first car autonomously from factory to customer"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in the automobile industry. It provides useful information about advancements in autonomous technology and its practical applications."
  },
  {
    "title": "Ribosome Biogenesis Key to Brain Development, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 07:37:35 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Ribosomes are tiny molecular machines inside all living cells that build proteins, and ribosome biogenesis is the complex, multi-step process by which they are made. During brain development, neural stem cell proliferation relies on active ribosome biogenesis to meet high protein demand. This proces"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/researchers-uncover-no-5.jpg",
    "titles": [
      "Researchers uncover novel mechanism for regulating ribosome biogenesis during brain development"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.91,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "Ribosomes, essential for protein production in living cells, undergo a complex creation process known as ribosome biogenesis. This process is crucial during brain development, as it supports the proliferation of neural stem cells by meeting their high protein demands.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights into the process of ribosome biogenesis and its importance in brain development. It offers deeper understanding of a biological process, but does not necessarily report on solutions, improvements, or innovations."
  },
  {
    "title": "Queen Hatshepsut: Erased by Stepson, Ruled 1,500 Years Before Cleopatra",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 11:40:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "She was one of ancient Egypt's most successful rulers, a rare female pharaoh who preceded Cleopatra by 1,500 years, but Queen Hatshepsut's legacy was systematically erased by her stepson successor after her death."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/reconstructing-the-sha-1.jpg",
    "titles": [
      "Gender not main factor in attacks on Egyptian woman pharaoh: Study"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Queen Hatshepsut, an ancient Egyptian pharaoh and one of the civilization's most successful female rulers, reigned before Cleopatra by about 1,500 years. After her death, her stepson and successor deliberately attempted to erase her legacy from history.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful historical context about Queen Hatshepsut, one of ancient Egypt's most successful female rulers. It increases awareness about her reign and the subsequent erasure of her legacy. However, it does not offer actionable insights or report on solutions, improvements, or innovations, limiting its constructiveness."
  },
  {
    "title": "FBI, cybersecurity firms say a prolific hacking crew is now targeting airlines and the transportation sector",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 28 Jun 2025 13:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The fresh wave of attacks targeting airlines comes soon after the hackers hit the U.K. retail sector and the insurance industry."
    ],
    "image_url": "",
    "titles": [
      "FBI, cybersecurity firms say a prolific hacking crew is now targeting airlines and the transportation sector"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.946,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about an important issue in cybersecurity. It provides useful information about the current threats in the digital world, which can help individuals and organizations to take necessary precautions. However, without details on potential solutions or ways to mitigate these threats, its score is limited."
  },
  {
    "title": "New Cellular Organelle Discovered; Wild Tomatoes De-evolve; Deep Earth Pulses De",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 08:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "This week, biologists discovered a new cellular organelle that's like \"a new recycling center within the cell.\" Wild-growing tomatoes in the Galápagos are de-evolving. And geologists at the University of Southampton detected deep Earth pulses beneath Africa. Plus: Brain network functionality differs"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/saturday-citations-ups.jpg",
    "titles": [
      "Saturday Citations: Upside-down sharks; brain network functioning in psychopaths; IQ associated with better predictions"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary": "This week, biologists found a new cellular organelle, likened to a recycling center within cells. Meanwhile, research revealed wild-growing tomatoes in the Galápagos are undergoing de-evolution. Geologists from the University of Southampton detected pulses deep beneath Africa's surface. Additionally, studies indicated variations in brain network functionality.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it informs the reader about new discoveries in biology and geology, contributing to a deeper understanding of these fields. However, the story lacks specific details on the implications or potential applications of these discoveries, limiting its usefulness."
  },
  {
    "title": "In a wild time for copyright law, the US Copyright Office has no leader",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 28 Jun 2025 13:32:57 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Rudderless Copyright Office has taken on new prominence during the AI boom."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/copyright-1152x648.jpg",
    "titles": [
      "In a wild time for copyright law, the US Copyright Office has no leader"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.411,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is somewhat constructive. While it does not provide a solution or progress, it does increase awareness about the current state of the US Copyright Office and the potential implications for copyright law."
  },
  {
    "title": "Yale Ecologists Find Lizards Survived Dinosaur-Ending Mass Extinction",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 08:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Yale University ecologists reveal a lizard lineage that rode out the dinosaur-killing asteroid event with unexpected evolutionary survival traits. Night lizards (family Xantusiidae) survived the Cretaceous–Paleogene (K-Pg) mass extinction event 66 million years ago (formerly known as the K-T extinct"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-night-lizards-surv.jpg",
    "titles": [
      "How night lizards survived the asteroid that ended the dinosaurs"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.93,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.408,
    "summary": "Yale University ecologists discovered that the night lizard family (Xantusiidae) survived the Cretaceous–Paleogene (K-Pg) mass extinction event 66 million years ago, which wiped out the dinosaurs. This lineage exhibits unique evolutionary survival traits that enabled their endurance through the catastrophic event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about the survival traits of the night lizard family, providing a deeper understanding of evolutionary biology. However, it lacks actionable insights or reports on solutions."
  },
  {
    "title": "Did AI companies win a fight with authors? Technically",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-28T08:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the past week, big AI companies have - in theory - chalked up two big legal wins. But things are not quite as straightforward as they may seem, and copyright law hasn't been this exciting since last month's showdown at the Library of Congress. First, Judge William Alsup ruled it was fair use for "
    ],
    "image_url": "",
    "titles": [
      "Did AI companies win a fight with authors? Technically"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a conflict between AI companies and authors, which could be a significant issue in the context of intellectual property rights and technology. However, without more context or depth, it doesn't offer much in terms of actionable insights or a deeper understanding of the issue."
  },
  {
    "title": "Climate Change Threatens US Agriculture, Global Food Security",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 11:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Even America’s richest farmlands can’t outrun climate collapse. That’s everyone’s problem."
    ],
    "image_url": "",
    "titles": [
      "The World Is Producing More Food than Ever—but Not for Long"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.898,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.401,
    "summary": "America's most fertile agricultural regions are facing significant challenges due to climate change, impacting food production and security. This situation poses a problem not just for the United States but globally, as these areas are crucial for feeding populations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the impact of climate change on US agriculture and global food security. However, it doesn't offer any solutions, improvements, or innovations to address the problem, nor does it provide a deep understanding of the systems, causes, or trends involved."
  },
  {
    "title": "Kobo’s Libra Colour and Elipsa 2E e-readers have dropped to some of their best prices",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-28T09:04:32-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Kobo is discounting two of its best e-readers. The Kobo Elipsa 2E, a competitor to the Kindle Scribe, is available for an all-time low of $349.99 ($50 off) from Rakuten Kobo and Target. Meanwhile, the Kobo Libra Colour is available for $209.99 ($20 off) from Amazon, Target, and Rakuten Kobo. The sal"
    ],
    "image_url": "",
    "titles": [
      "Kobo’s Libra Colour and Elipsa 2E e-readers have dropped to some of their best prices"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.938,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.399,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a price drop for certain e-readers, which could be useful for potential buyers. However, it doesn't provide deeper insights or context about why the prices have dropped or the impacts of this trend."
  },
  {
    "title": "Anthropic’s Claude AI became a terrible business owner in experiment that got ‘weird’",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 28 Jun 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Researchers at Anthropic and AI safety company Andon Labs gave an instance of Claude Sonnet 3.7 an office vending machine to run. And hilarity ensued."
    ],
    "image_url": "",
    "titles": [
      "Anthropic’s Claude AI became a terrible business owner in experiment that got ‘weird’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.398,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary, it's hard to evaluate the story's constructiveness. The title suggests it might provide basic awareness about an AI experiment, but doesn't seem to offer actionable insights, solutions, or a deeper understanding of the topic."
  },
  {
    "title": "Hurricane Helene Alters Southeast U.S. Landscape, Affects Future Risk",
    "domain": "science",
    "location": "global",
    "published": "Sat, 28 Jun 2025 08:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Hurricane Helene lasted only a few days in September 2024, but it altered the landscape of the Southeastern U.S. in profound ways that will affect the hazards local residents face far into the future."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/natural-hazards-dont-d.jpg",
    "titles": [
      "Natural hazards don't disappear when the storm ends or the earthquake stops—they evolve"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.396,
    "summary": "In September 2024, Hurricane Helene, though brief, significantly changed the Southeastern U.S. landscape, impacting future hazard risks for residents.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the impact of Hurricane Helene on the Southeastern U.S. landscape and future hazard risks. However, it does not provide in-depth insights, solutions, or empowering knowledge for the reader."
  },
  {
    "title": "Squid Game&#8217;s uneven season 3 leaves the door wide open",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-28T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The third and final season of the industry-defining Squid Game confidently delivers each new round of the deathly games with spectacularly brutal aplomb - but its attempts at worldbuilding are disappointingly tired and uneven. Some of Squid Game's most interesting dynamics from the first two seasons"
    ],
    "image_url": "",
    "titles": [
      "Squid Game&#8217;s uneven season 3 leaves the door wide open"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.353,
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  }
]