[
  {
    "title": "West Ham Sacks Potter, Appoints Nuno Espirito Santo as Head Coach",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 15:47:43 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "BBC",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "BBC Sport looks at the background to Graham Potter's sacking by West Ham and how they chose his successor.",
      "BBC Sport looks at the background to Graham Potter's sacking by West Ham and how they chose his successor.",
      "Graham Potter has been fired by West Ham after a dismal start to the season, and sources have told ESPN that Nuno Espirito Santo will replace him.",
      "West Ham have confirmed the appointment of Nuno Espirito Santo as their new head coach after sacking Graham Potter.",
      "<p>West Ham fired manager Graham Potter on Saturday, just five games into the new Premier League season and two days before playing Everton in its next match.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f5a/live/f78e0560-9bae-11f0-b7a8-4f368f70612e.jpg",
    "titles": [
      "Chasms to the common-sense option - why Nuno replaced Potter at West Ham",
      "Chasms to the common-sense option - why Nuno replaced Potter at West Ham",
      "West Ham confirms Nuno hire after Potter firing",
      "West Ham appoint Nuno after sacking Potter",
      "West Ham fires Graham Potter after five games, replace him with Nuno Espirito Santo"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.972,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "West Ham United dismissed manager Graham Potter due to a poor start to the Premier League season, after just five games. Following his sacking, the club confirmed the appointment of Nuno Espirito Santo as the new head coach.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 06:36:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The US says it will revoke the visa of Colombian President Gustavo Petro, who urged US soldiers to disobey Trump.",
      "The Colombian leader was filmed joining thousands of pro-Palestinian protesters outside UN headquarters in New York.",
      "The left-wing Colombian president is a critic of Trump and vocally opposes Israel's operation in Gaza. Petro is in New York for the UN General Assembly and had called on US soldiers to disobey Trump.",
      "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for h",
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally."
    ],
    "image_url": "",
    "titles": [
      "US to revoke Colombian President’s visa after Gaza protest speech",
      "US to revoke Colombian President Petro’s visa over call to ‘disobey’ Trump",
      "Gustavo Petro: US to revoke visa of leftist Colombian leader",
      "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "State Department revokes visa for Colombian President Gustavo Petro",
      "U.S. Says It Will Revoke Colombian President’s Visa"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.82,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Deploy Troops to Portland, Threatens \"Full Force\" Use",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:12:33 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Fortune"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "President Trump said Saturday he will send troops to Portland, \"authorizing Full Force, if necessary\" to handle \"domestic terrorists\" as he expands his controversial deployments to more U.S. cities.",
      "<p>President made announcement on social media, but the White House did not immediately provide details</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”.</p><p>Trump made the announcement on social media. The White House did not p",
      "Trump said the decision was necessary to protect U.S. Immigration and Customs Enforcement facilities."
    ],
    "image_url": "",
    "titles": [
      "Trump says he'll send troops to Portland, Ore., to handle 'domestic terrorists'",
      "Donald Trump says he is deploying troops to Portland, Oregon",
      "Trump says he’ll send troops to Portland, Oregon, in latest deployment to US cities"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.981,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump announced on Saturday that he plans to deploy troops to Portland, Oregon, authorizing the use of \"Full Force\" if needed to counteract what he termed \"domestic terrorists.\" This decision aims to protect U.S. Immigration and Customs Enforcement facilities. The announcement was made via social media, with no immediate details provided by the White House.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets QB Justin Fields Cleared for Dolphins Game After Concussion",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:42:37 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.thephinsider.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Jets quarterback Justin Fields has cleared concussion protocol and will start Monday night against the Dolphins after missing last week's game against the Buccaneers.",
      "Justin Fields has recovered from a concussion that sidelined him for one game and will start at quarterback for the New York Jets against the Miami Dolphins on Monday night.  Coach Aaron Glenn said Saturday that Fields, who was a full participant during the team's first two days of practice this wee",
      "The New York Jets updated quarterback Justin Fields’ availability for Monday’s game against the Miami Dolphins.",
      "<p>Justin Fields will start Monday night against the Miami Dolphins, Jets head coach Aaron Glenn told reporters on Saturday, according to ESPN&#8217;s Adam Schefter.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jets get Fields back from concussion to face Fins",
      "Justin Fields to start for Jets against Dolphins after clearing concussion protocol",
      "Jets update Justin Fields injury status ahead of Monday against Dolphins",
      "Jets QB Justin Fields to start vs. Dolphins after clearing concussion protocol"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.765,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Justin Fields, the New York Jets quarterback, has cleared concussion protocol and will return to start the game against the Miami Dolphins on Monday night. Fields missed the previous game due to a concussion but has been a full participant in practice this week. Coach Aaron Glenn confirmed his return.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fugitive Assata Shakur Dies in Cuba at 78",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 18:26:35 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.npr.org",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Assata Shakur, a Black liberation activist who was given political asylum in Cuba after her 1979 escape from a U.S. prison, has died. Officials in New Jersey, where Shakur had been arrested, convicted and imprisoned, said she was 78.",
      "Assata Shakur had lived in exile in Cuba since 1979, after escaping a prison sentence for killing a police officer.",
      "<p>Shakur spent decades exiled after she was convicted of killing a state trooper in 1977 and escaped from prison</p><p>On 25 September, Assata Shakur, a former member of the Black Liberation Army, died aged 78 in Havana, Cuba, according to <a href=\"https://cubaminrex.cu/es/nota-de-prensa-del-minist",
      "Convicted of murdering a New Jersey state trooper, she escaped prison and fled the country. She called herself “a 20th-century escaped slave.”"
    ],
    "image_url": "",
    "titles": [
      "Assata Shakur, a fugitive Black militant sought by the U.S. since 1979, dies in Cuba",
      "Assata Shakur: Fugitive Black activist dies in exile in Cuba",
      "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
      "Assata Shakur, Black Power militant who fled to Cuba, dies at 78"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.691,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Assata Shakur, a fugitive and former member of the Black Liberation Army who was convicted of killing a state trooper in 1977 and escaped from a US jail in 1979, has died at the age of 78 in Havana, Cuba. Shakur, also known by her legal name Chesimard and mentioned in Public Enemy's 1988 song \"Rebel Without a Pause,\" spent decades in exile after fleeing to Cuba.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pickard Shuts Out Jets 4-0, Oilers Shine in Pre-Season Victory",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 04:27:59 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Calvin Pickard had a 21-save shutout as the Edmonton Oilers defeated the Winnipeg Jets 4-0 on Friday night in NHL pre-season action.",
      "Domenic DiVincentiis stopped 16 shots as the Jets dropped their third straight pre-season game.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNUF9mZlB0Z0R5WUpiYTFjY2ZfTEJ1UXQzVkludHVpSHJreFM0U1pGaUloazQyRWRjUmdraXVnWFVqWkdBMTl4V0NESUtyYm9Tbkhzc3JaMVA0M3pCNk9fc2IxYkJCMldmY1huc1RObnJOSVJvSGIzUGdHMlRubUFzOWpYRnJBWEpYa2c?oc=5\" target=\"_blank\">PROJECTED LINEUP: Oilers vs. Jets (Prese",
      "<p>Suddenly, there are only three pre-season games remaining. Noah Philp, David Tomasek and Josh Samanski did their best to make a case to stay with the Oilers in a 4-0 win over the Jets on Friday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/89d362b4acddbb53a44f10d6c4416ab03e0390b2d363dcb9f155d8fd2f5009d2.jpg?quality=65&strip=all",
    "titles": [
      "Oilers blank Jets 4-0 in pre-season action",
      "Winnipeg Jets lose 4-0 in Edmonton in third pre-season game",
      "PROJECTED LINEUP: Oilers vs. Jets (Preseason) - NHL.com",
      "Oilers takeaways: Edmonton hopefuls step up in pre-season win over Jets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.784,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Calvin Pickard led the Edmonton Oilers to a 4-0 victory over the Winnipeg Jets with a 21-save shutout in NHL pre-season action on Friday. Domenic DiVincentiis made 16 saves for the Jets, who suffered their third consecutive pre-season loss. With only three pre-season games left, players Noah Philp, David Tomasek, and Josh Samanski aimed to secure their spots on the Oilers' roster through their performance in the win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 12:11:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Unidentified drones seen at several places, including the biggest army base, after a slew of earlier sightings.",
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "<p>Unidentified drones spotted at the countries’ biggest military bases, Karup in Denmark and Orland in Norway</p><p>Unidentified drones have been spotted over major military bases in Denmark and Norway, the latest in a series of sightings some officials have hinted might be linked to Russia.</p><p>"
    ],
    "image_url": "",
    "titles": [
      "Denmark reports new drone sightings overnight at military sites",
      "Denmark: New drone sightings over military infrastructure",
      "Denmark and Norway report new drone sightings over major military bases"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran Recalls Ambassadors from E3 Over Nuclear Sanctions Move",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 08:31:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The E3 countries triggered the mechanism one month ago to reimpose sanctions, which come into effect on Sunday.",
      "DUBAI, United Arab Emirates (AP) — Iran recalls its ambassadors from France, Germany and the United Kingdom ahead of U.N. nuclear sanctions being reimposed. The Associated Press",
      "As Iran braces for potential sanctions, it has recalled its ambassadors to Germany, France and the UK. Meanwhile, Lebanon's Hezbollah group marks the first anniversary of the killing of its leader Nasrallah. Follow DW."
    ],
    "image_url": "",
    "titles": [
      "Iran recalls envoys to UK, France, Germany as UN sanctions reimposed",
      "Iran recalls its ambassadors from France, Germany and the United Kingdom ahead of U.N. nuclear sanctions being reimposed",
      "Iran summons European envoys ahead of expected sanctions"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.853,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iran has recalled its ambassadors from France, Germany, and the UK in response to the E3 countries triggering a mechanism to reimpose U.N. nuclear sanctions, set to take effect on Sunday. This move comes as Iran prepares for the potential impact of these sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Calls for Firing of Microsoft Exec Lisa Monaco Over Biden Ties",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 23:53:42 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "The Verge"
    ],
    "domains": [
      "news.google.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1RaVR3bjljR29POWhyZ1hONlY1XzB0RktWN1J3d1o1anE3ZHdhbDZXZ1VlbDV3VWFJTUMtdFRteFo4WDlqOHBMYmxoeWdtTzN3VkliRDlBYU91OWhOUGFmMlZzd0dVcE5ZNzlNRg?oc=5\" target=\"_blank\">Trump demands Microsoft oust global affairs chief over Biden-era ties</a>&nbsp;&n",
      "Fox Business anchor Maria Bartiromo brought up Monaco's position at Microsoft during her show. The appointment happened in July.",
      "After successfully manipulating Intel CEO Lip-Bu Tan and eventually failing to cancel Jimmy Kimmel, President Donald Trump has named his next target for retribution: Microsoft head of global affairs Lisa Monaco. He’s calling for her to be fired. On Truth Social, Trump claims that Monaco, who just to"
    ],
    "image_url": "",
    "titles": [
      "Trump demands Microsoft oust global affairs chief over Biden-era ties - Axios",
      "Trump calls for the firing of Lisa Monaco, Microsoft president of global affairs",
      "Trump’s new target: Microsoft head of global affairs Lisa Monaco"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.698,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump called for the firing of Microsoft's President of Global Affairs, Lisa Monaco, on Truth Social. Trump's demand comes after Monaco's appointment in July, citing her ties to the Biden era. This move follows Trump's previous attempts to influence corporate leadership, including Intel CEO Lip-Bu Tan and a failed effort to cancel Jimmy Kimmel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk, Thiel, Bannon Named in Event Document; Musk Declined Invitation",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 03:39:38 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "BBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "More documents related to the late convicted paedophile Jeffrey Epstein have been released by lawmakers in the US.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOWnljQzJ2czNBZjBYNGtWTFdOd0c5N2QtSnpFZzVZNDZ2cDZ3dlhJTVllY3pQbHlCbktVaW43Y1ljQVA2VEhXNExOTVpjVkhtNkk5dU1HOWt1M2Q1WVJCVXBzVDFzM0tEaDNKZ2hkWGRJVEJQWXF0c1lPbFBCTEdCUnpEX3BDSHlG?oc=5\" target=\"_blank\">Elon Musk, Peter Thiel and Steve Bannon nam",
      "In partially redacted files released by House Democrats appeared the names of Elon Musk, Peter Thiel and Steve Bannon."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e42/live/89472f60-9b53-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Elon Musk and Prince Andrew named in new Epstein files",
      "Elon Musk, Peter Thiel and Steve Bannon named in Epstein files released by Democrats - Axios",
      "Musk, Thiel, Bannon named in partially redacted Epstein documents released by Democrats"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.755,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk, along with Peter Thiel and Steve Bannon, were named in a document related to a scheduled event on an island on December 6. However, Musk, the Tesla executive, has previously stated that he declined invitations to such events.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sinclair, Nexstar End Boycott of \"Jimmy Kimmel Live!\", Resume Airing",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 21:53:42 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQcS1vVldJUUsyYmtBTXdWS1FtQllsaWhPMHB1Z0lLc18zMGlvTzVGTVRXQlpGTlBlYmpIX1YyUEpRS01RRFBqbzNSTS1Qb3h2QXVnN2JkcUI3bUxNaTZwdXdHV3V4QTdITV9NUUFoRVJ5YVotQmZQVnR1RlczQzJXdUhRVQ?oc=5\" target=\"_blank\">Jimmy Kimmel to return to Nexstar and Sinclair's ",
      "Broadcast station owners Sinclair and Nexstar will begin airing \"Jimmy Kimmel Live!\" after three days of preempting the program since its return.",
      "Sorry, Brendan Carr: Sinclair and Nexstar stop preempting Kimmel on ABC affiliates."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel to return to Nexstar and Sinclair's ABC affiliates Friday - Axios",
      "Sinclair, Nexstar will bring 'Jimmy Kimmel Live' back to owned ABC stations on Friday",
      "Sinclair gets nothing it asked for, puts Jimmy Kimmel back on anyway"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.67,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sinclair Broadcast Group and Nexstar Media Group have ended their boycott of \"Jimmy Kimmel Live!\", agreeing to resume airing the late-night show on their ABC affiliate stations starting Friday night. This decision comes after a three-day preemption that left approximately 25% of US TV viewers unable to watch the program.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Slams IPC for Lifting Sanctions on Russia, Belarus",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T13:45:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Sportsnet"
    ],
    "domains": [
      "www.dw.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ukraine denounced the International Paralympic Committee's (IPC) decision to lift all sanctions against Russia and Belarus, claiming that those who voted for it had betrayed \"their conscience and the Olympic values.\"",
      "<p>The International Paralympic Committee has lifted the partial suspensions of Russia and Belarus.</p>"
    ],
    "image_url": "",
    "titles": [
      "Paralympic body drops sanctions on Russia and Belarus",
      "International Paralympic Committee lifts partial suspensions of Russia and Belarus"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine criticized the International Paralympic Committee for removing sanctions against Russia and Belarus, accusing those who supported the decision of betraying Olympic values. The IPC has officially lifted the partial suspensions previously imposed on both countries.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Leads U.S. by Three Points After Ryder Cup Day One",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 07:23:26 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Europe has a three-point lead after the first day of the Ryder Cup. Can the U.S. mount a comeback at Bethpage Black?",
      "<p>⛳ Ryder Cup updates from Bethpage Black</p><p>⛳ <a href=\"https://www.theguardian.com/sport/2025/sep/26/tommy-fleetwood-jon-rahm-rory-mcilroy-ryder-cup-europe-usa\">Ewan Murray’s day-one report</a> | <a href=\"https://www.theguardian.com/sport/2025/sep/25/bethpage-black-hole-by-hole-course-guide-202"
    ],
    "image_url": "",
    "titles": [
      "Ryder Cup 2025: Best moments from Day 2",
      "Ryder Cup 2025: day two – live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After the first day of the Ryder Cup at Bethpage Black, Europe leads the U.S. by three points. The outcome of whether the U.S. can stage a comeback remains to be seen in the ongoing tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Orders Troops to Portland to Guard Immigration Sites",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 15:30:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The president says the move is \"necessary\" to protect immigration detention facilities from \"domestic terrorists\".",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0a64/live/b9338580-9bb6-11f0-852e-075d0572b37f.jpg",
    "titles": [
      "Trump authorises 'full force' as Portland becomes latest city to see troops deployed",
      "Trump directs troops to Portland with \"full force\" directive - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The president has directed troops to Portland with a \"full force\" directive, stating it is necessary to protect immigration detention facilities from what he terms \"domestic terrorists.\" This action is part of a broader initiative to address security concerns at these facilities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Sanctions on Iran to Be Reimposed After Russian-Chinese Bid Fails",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 10:41:56 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Tehran fails to meet deadline set by European powers",
      "The unsuccessful bid to put off the sanctions for six months over Iran’s nuclear program means they would go into effect early Sunday in Iran."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F11cfced9-60d7-4128-9070-cb297e62c44e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Iran faces reimposition of sanctions over its nuclear programme",
      "Russia and China Fail to Delay U.N. ‘Snapback’ Sanctions Against Iran Over Nuclear Program"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UN sanctions on Iran, lifted under the 2015 nuclear deal, are set to be reimposed early Sunday after a Russian-Chinese bid to delay them failed. The Security Council voted against the delay, and Iran's last-ditch effort to prevent the sanctions' \"snapback\" was unsuccessful. This development follows the Trump administration's rebuff of Iran's attempts to avoid these sanctions over its nuclear program.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Durham Relegated to Division Two After Final Day Defeat to Yorkshire",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 15:35:23 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p> Updates from the final day of the season’s final round<br /> <a href=\"https://www.theguardian.com/sport/2016/aug/18/sign-up-to-the-spin\">Read the new edition of The Spin</a> | <a href=\"mailto:james.wallace.casual@guardian.co.uk\">Mail James</a> or post BTL</p><p>“Good morning, James; good morning",
      "Durham have been relegated to Division Two of the County Championship after a remarkable collapse saw them slump to defeat to&#160;Yorkshire on the final day of the season."
    ],
    "image_url": "https://i.guim.co.uk/img/media/b303a1119b1d918b2e61da34138723e713c274bd/60_0_5522_4419/master/5522.jpg?width=140&quality=85&auto=format&fit=max&s=494553ab28426cdf637258ed5b8f7c22",
    "titles": [
      "Durham relegated after collapse at Yorkshire, Hampshire survive: county cricket final day – live",
      "Durham relegated as stunning collapse spares Hampshire"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Durham has been relegated to Division Two of the County Championship after a collapse led to a defeat against Yorkshire on the final day of the season. This outcome marks the end of their season in a lower division.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx Coach Reeve Blasts Officiating, Calls It \"Malpractice\" After Ejection",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 02:44:33 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ejected late in Game 3, Lynx coach Cheryl Reeve was critical of the officials, saying it was \"malpractice\" to have them work a semifinal playoff game.",
      "<p>Minnesota Lynx head coach Cheryl Reeve speaks out against the league leadership and playoff officiating after superstar Napheesa Collier sustained an injury in loss to Phoenix Mercury. </p>"
    ],
    "image_url": "",
    "titles": [
      "Lynx's Reeve blasts refs after Collier hurt in loss",
      "Reeve calls out leadership, refs for ‘malpractice’ after Collier injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minnesota Lynx head coach Cheryl Reeve criticized the officiating after being ejected from Game 3 of the semifinals, labeling it \"malpractice.\" Her comments followed a loss to Phoenix Mercury, where Lynx star Napheesa Collier was injured. Reeve's critique targets both the game officials and league leadership for the handling of the playoff game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Strikes in Gaza Kill 44, Including Family of Nine Amid Ceasefire Calls",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 10:20:35 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Health officials say most deaths were in the strip’s largest city, where hundreds of thousands are trapped and starving</p><p>Israeli strikes and shootings have killed at least 44 people in Gaza, according to health officials in the territory, with most of the killings in Gaza City.</p><p>The Isr",
      "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes and gunfire killed at least 44 people across Gaza, health officials said Saturday, as international pressure grows for a ceasefire but Israel&#8217;s leader remains defiant about continuing the war. Among the dead were nine from the same family in a h"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c9dc3806d46c2b8515864034638336c6c8edf15e/679_0_4560_3648/master/4560.jpg?width=140&quality=85&auto=format&fit=max&s=23bc00d41bb73b3967999868a182dc04",
    "titles": [
      "Israeli strikes kill at least 44 people as military continues Gaza City attack",
      "Airstrikes and shooting kill at least 44 people in Gaza as Israel ignores demands for a ceasefire"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.868,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli strikes and gunfire have resulted in at least 44 deaths across Gaza, with a significant number occurring in Gaza City. Health officials report that the casualties include nine members from the same family. Despite increasing international calls for a ceasefire, Israel's leadership is determined to continue the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester United Loses 3-1 to Brentford, Amorim's Streak Halted",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 13:48:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>The holy grail continues to elude Ruben Amorim. Call it progress, consistency, momentum. Or just back-to-back Premier League victories for the first time. The manager had taken encouragement from last Saturday’s <a href=\"https://www.theguardian.com/football/2025/sep/20/manchester-united-chelsea-p",
      "Bruno Fernandes had a penalty saved as Manchester United fell to a 3-1 defeat at Brentford to put the spotlight back on Ruben Amorim as his search for back-to-back league wins continues."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9055f9ecca753cce4df071e0b4dafe49cf0b25f4/1482_529_5188_4151/master/5188.jpg?width=140&quality=85&auto=format&fit=max&s=031b09829d7b976b1cd92194ef34b4b1",
    "titles": [
      "Fernandes blows penalty as Brentford defeat piles pressure on Amorim",
      "Fernandes penalty saved in Man Utd defeat at Brentford as Collins avoids red"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ruben Amorim's quest for consecutive Premier League victories remains unfulfilled as Manchester United suffered a 3-1 loss to Brentford. Highlighting the match, Bruno Fernandes missed a penalty, intensifying scrutiny on Amorim's management. This defeat underscores ongoing challenges in achieving consistency and momentum for the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince William Shares 2024 as Toughest Year on \"The Reluctant Traveler\"",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 08:01:02 -0400",
    "source": "ABC News",
    "sources": [
      "CityNews",
      "ABC News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "abcnews.go.com"
    ],
    "snippets": [
      "Prince William has told &ldquo;Schitt's Creek&rdquo; star Eugene Levy that 2024 was the hardest year of his life",
      "LONDON (AP) — Prince William has told “Schitt&#8217;s Creek” star Eugene Levy that 2024 was the hardest year of his life. The royal made an appearance on Levy&#8217;s show “The Reluctant Traveler” and spoke about last year, which saw his wife Kate, the Princess of Wales, and his father King Charles "
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/wirestory_a352852fc546e7182d2354cf5356a967_4x3_384.jpg",
    "titles": [
      "Prince William says 2024 was the hardest year of his life",
      "Prince William says 2024 was the hardest year of his life"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince William revealed to Eugene Levy on \"The Reluctant Traveler\" show that 2024 was the most challenging year of his life. This disclosure was made during an appearance that highlighted personal difficulties, involving his wife Kate, the Princess of Wales, and his father, King Charles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iraq Resumes Northern Oil Exports After 2-Year Halt, Aiming to Boost Global Supp",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:57:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Control over lucrative exports was a major point of contention between Baghdad and Kurdistan region.",
      "Iraq resumed oil exports from its northern region Saturday after a more than two-year halt, adding supply to a global market that’s widely expected to move into a heavy surplus."
    ],
    "image_url": "",
    "titles": [
      "Iraq resumes Kurdish oil exports to Turkiye after two-and-a-half-year halt",
      "Iraq Resumes Kurdistan Oil Exports After Halt of Two Years"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iraq restarted oil exports from its northern region on Saturday after a stoppage exceeding two years, resolving a dispute over export control with the Kurdistan region. This move aims to increase supply in a global market anticipated to face a significant surplus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Polish Skier First to Descend Everest Without Oxygen",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 11:58:27 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Poland’s PM hails Andrzej Bargiel’s completion of the challenge after two previous failed attempts</p><p>A Polish adventure skier has made history by becoming the first person to climb up and ski down Mount Everest without the use of additional oxygen.</p><p>The ascent was Andrzej Bargiel’s third",
      "Andrzej Bargiel, 37, became the first person to complete the feat."
    ],
    "image_url": "https://i.guim.co.uk/img/media/e213797ba900feac47067055915cc76501d40070/1140_0_2700_2160/master/2700.jpg?width=140&quality=85&auto=format&fit=max&s=f2e9dd0e7627d74a9ef721187d3bb506",
    "titles": [
      "Polish climber makes history skiing down Everest without bottled oxygen",
      "Polish Skier Climbs Everest and Skis Down Without Extra Oxygen"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.898,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Andrzej Bargiel, a 37-year-old Polish adventure skier, became the first person to climb and ski down Mount Everest without using additional oxygen. This achievement, hailed by Poland's Prime Minister, was completed after two previous attempts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Plans 100% Tariff on Certain Drugs Amid Rising Home Renovation Costs",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 23:06:39 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "MarketWatch"
    ],
    "domains": [
      "www.nytimes.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The president said he would impose a tariff of 100 percent on certain brand-name drugs. Here’s what we know so far.",
      "It’s getting increasingly expensive and burdensome for homeowners to undertake renovation projects."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/26/multimedia/26HS-WTK-DRUGPRICES-ckbl/26HS-WTK-DRUGPRICES-ckbl-mediumSquareAt3X.jpg",
    "titles": [
      "How Trump’s Latest Tariffs May Affect Your Medicines",
      "How Trump’s latest tariffs could make your kitchen renovation even more of an expensive headache"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.701,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The president announced plans to impose a 100% tariff on specific brand-name drugs, aiming to address the rising costs. Concurrently, homeowners are facing escalating expenses and challenges in undertaking renovation projects.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Faces Government Shutdown Over Border Wall Funding Dispute",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 03:23:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The government previously shut down during President Donald Trump's first term over disputes about funding his planned U.S.-Mexico border wall.",
      "US government shutdowns have become so common in recent decades that every federal agency has a playbook for how to implement them."
    ],
    "image_url": "",
    "titles": [
      "Here's what to know about a federal government shutdown",
      "Here’s What Happens When the US Government Shuts Down"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.751,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During President Donald Trump's first term, the U.S. government experienced a shutdown due to disagreements over funding for a proposed U.S.-Mexico border wall. Government shutdowns have occurred frequently enough in recent years that all federal agencies now have specific guidelines for operating during such shutdowns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025-2026 DWU Challenges: High School Engineering, Middle School Aviation",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 26 Sep 2025 16:31:42 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "2025-2026 DWU: High School Engineering Challenge Challenge Materials Challenge Materials The 2025 Challenge Materials are coming soon. Register now to get copies as soon as they are released. Overview: What is an Uncrewed Aircraft System?&#160; An uncrewed aircraft system (UAS) can be defined as an ",
      "2025-2026 DWU: Middle School Aviation Challenge Challenge Theme AgAir: Integrating UAS into the Agriculture Industry The agricultural industry is an important part of life in the US and around the world by providing food, fuel, economic development, and more. It has been increasingly important to st"
    ],
    "image_url": "",
    "titles": [
      "2025-2026 DWU: High School Engineering Challenge",
      "2025-2026 DWU: Middle School Aviation Challenge"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.611,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.4,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The 2025-2026 DWU High School and Middle School Challenges focus on engineering and aviation, respectively. The High School Engineering Challenge materials are pending release, urging early registration. The theme for the Middle School Aviation Challenge is \"AgAir: Integrating UAS into the Agriculture Industry,\" highlighting the significance of uncrewed aircraft systems (UAS) in agriculture for food, fuel, and economic development. Participants are encouraged to explore the impact of UAS technology in the agricultural sector.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  }
]