[
  {
    "title": "UK to Recognize Palestinian State Amid Israel Crisis",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:38:17 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "The Guardian",
      "Financial Times",
      "NPR",
      "Fortune",
      "CityNews",
      "Global News",
      "New York Times",
      "Deutsche Welle",
      "Financial Post",
      "Washington Post"
    ],
    "domains": [
      "globalnews.ca",
      "www.dw.com",
      "www.theguardian.com",
      "news.google.com",
      "fortune.com",
      "www.npr.org",
      "www.nytimes.com",
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "financialpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "British Prime Minister Keir Starmer confirmed the U.K. is recognizing a Palestinian state despite opposition from the U.S. and Israel. His announcement follows those from Canada and Australia.",
      "The United Kingdom, Canada and Australia have recognized Palestinian statehood, with Portugal set to do the same. The announcements come ahead of a key week at the UN General Assembly. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBFbkY3Skk2YnFfT1B0eTlIUVFEbm1rWnMyQWZ3bWZkd1p6VjhTaUI2TzRlbmRhRGJDQXBiU1FwTGN5QUxHNHczMmUwanE4VW5OTGpyN2JyUDhOa3NXMHZ3R3k3b3Z6T3lVdGFHMnlMbUd0ang4aUw3dGdB?oc=5\" target=\"_blank\">UK, Canada and Australia formally recognize Palestinian state</",
      "Move comes as Israel intensifies military action in Gaza and expansion of settlements in occupied West Bank",
      "<p>Move comes as Anthony Albanese tries to secure meeting with Donald Trump and amid warnings that recognition could spark ‘punitive measures’ from the US</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.c",
      "<ul><li><p> <a href=\"https://www.theguardian.com/world/2025/sep/21/uk-canada-and-australia-announce-formal-recognition-of-palestine-with-wave-of-israel-allies-to-follow\">UK, Canada and Australia announce formal recognition of Palestine</a></p></li></ul><p><strong>Keir Starmer</strong> has arrived at",
      "<p>Keir Starmer expected to confirm move after concluding the situation has worsened significantly in recent weeks</p><p>The UK is expected to <a href=\"https://www.theguardian.com/world/2025/sep/19/what-uk-recognition-palestine-state-will-mean\">recognise a Palestinian state</a> on Sunday after Israe",
      "The three major U.S. allies reversed decades of unwillingness to accept Palestinians as a sovereign nation until their conflict with Israel was settled.",
      "The announcements came on the eve of the annual gathering of the U.N. General Assembly, ramping up pressure on Israel and putting three allies at odds with the Trump administration.",
      "Other major international allies, including the U.K. and Australia, joined Canada in recognizing an independent Palestinian state.",
      "More than 145 countries already recognize a Palestinian state, including more than a dozen in Europe.",
      "Canada, the UK and Australia have formally recognized a Palestinian state, aligning themselves with European allies and pushing ahead with a policy that has drawn criticism from US President Donald Trump.",
      "LONDON (AP) — The U.K., Australia and Canada formally recognized a Palestinian state on Sunday despite vociferous opposition from the U.S. and Israel. The coordinated initiative from the three Commonwealth nations and long-time allies of Israel reflects growing outrage at Israel&#8217;s conduct of t",
      "Anger over Israel’s war in Gaza has left it increasingly isolated, as Britain, Canada and Australia all announced they were recognizing a Palestinian state."
    ],
    "image_url": "",
    "titles": [
      "Countries including UK and Canada recognize a Palestinian state, despite US and Israeli opposition",
      "UK, Canada and Australia recognize Palestinian state",
      "UK, Canada and Australia formally recognize Palestinian state - Axios",
      "UK, Canada and Australia recognise Palestine as an independent state",
      "Australia joins UK and Canada in formally recognising Palestinian state",
      "UK, Canada and Australia formally recognise Palestinian state - as it happened",
      "UK set to recognise Palestinian state on Sunday",
      "U.K., Canada, Australia recognize Palestine as a state, breaking with U.S.",
      "Britain, Australia and Canada Recognize a Palestinian State",
      "Canada officially recognizes Palestinian state ahead of UNGA",
      "Canada joins Britain and Australia in recognizing a Palestinian state despite opposition from the U.S.",
      "Canada, UK, Australia Formally Recognize Palestinian State",
      "UK, Australia and Canada recognize a Palestinian state despite opposition from US and Israel",
      "Here are countries that recognize a Palestinian state — or may do so soon"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.873,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK is set to recognize a Palestinian state on Sunday, following a worsening situation in Israel. This decision comes as other countries, including France and Canada, plan similar announcements at the upcoming UN General Assembly. The move was hinted at by the Prime Minister, contingent on Israel not taking steps towards peace, such as agreeing to a ceasefire in Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Wins Azerbaijan GP; Piastri Crashes, Norris Closes Gap",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 13:25:55 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Forbes",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Max Verstappen wins the Azerbaijan Grand Prix with Lando Norris seventh after Oscar Piastri crashes out on the first lap.",
      "<ul><li><p>Red Bull driver leads from pole to flag to cut title lead</p></li><li><p>Piastri out on first lap but Norris can finish only seventh</p></li></ul><p>Max Verstappen won the Azerbaijan Grand Prix with a dominant run from pole to flag for Red Bull on Sunday, while behind him Oscar Piastri en",
      "Max Verstappen dominates 2025 Baku GP as Oscar Piastri crashes out. George Russell second, Carlos Sainz earns Williams’ first podium since 2021.",
      "Max Verstappen secured a dominant win in Baku, while championship leader Oscar Piastri endured a race to forget after crashing out on the opening lap. Here's the full result.",
      "Oscar Piastri's first-lap crash allowed Lando Norris to reduce his McLaren team-mate's world championship lead to 25 points as Max Verstappen claimed a dominant victory at the Azerbaijan Grand Prix."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/434a/live/534c3050-96e3-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Verstappen wins in Baku after Piastri crashes out",
      "Verstappen wins F1 Azerbaijan GP while Norris struggles after Piastri crash",
      "Verstappen Dominates Baku, Piastri Crashes Out, Sainz Scores Podium,",
      "2025 F1 Azerbaijan Grand Prix Race Results: Verstappen Wins, Piastri Crashes Out On First Lap",
      "Verstappen wins in Azerbaijan, Norris only seventh after Piastri crash"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.925,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen won the Azerbaijan Grand Prix in a commanding performance from start to finish, while Oscar Piastri crashed out on the first lap. The victory allowed Verstappen to narrow the gap in the championship standings. Lando Norris finished seventh, reducing Piastri's lead in the world championship to 25 points. George Russell secured second place, and Carlos Sainz achieved Williams' first podium since 2021.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyberattack Disrupts Airport Check-ins at Heathrow, Brussels, Berlin",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 10:04:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Global News",
      "New York Times",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "globalnews.ca",
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A cyberattack on check-in software developed by Collins Aerospace has disrupted flights at Heathrow, Brussels and Berlin",
      "Brussels Airport said it expected heavy disruption and flight cancellations into Sunday as a result of the cyberattack.",
      "A disruption to check-in and boarding systems had snarled departures through Saturday at airports in Berlin, Brussels, Dublin and London.",
      "The cyberattack affected software of Collins Aerospace, whose systems help passengers check in, print boarding passes and bag tags, and dispatch their luggage."
    ],
    "image_url": "",
    "titles": [
      "Cyberattack causes travel chaos at European airports",
      "What we know about the cyberattack that hit major European airports",
      "Cyberattack Causes Delays at Heathrow and Other Airports in Europe",
      "Cyberattack disrupts check-in systems at 3 European airports for 2nd day"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.881,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A cyberattack targeting Collins Aerospace's check-in software caused significant disruptions at several airports, including Heathrow, Brussels, and Berlin. The attack led to difficulties in checking in, printing boarding passes and bag tags, and dispatching luggage. Brussels Airport anticipated heavy disruptions and flight cancellations into Sunday. The incident affected departures across multiple airports, including Dublin and London, throughout Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 4 College Football Puts Coaches' Futures in Jeopardy",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 11:59:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Find out which teams our reporters pick for the College Football Playoff after Week 4.",
      "Meanwhile, the Big 12 has an ACC problem.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPMlZwOWVwaDl2SmlLTVV4SmJOTGN4VVI1ZjF5OUxEQW82U2VJbnpTdU5FREpWMGFKYmhRWjduZTJGZVE0ZXhXZ0ctSlg3dHpRZkZaYUZYS3pNV0U3QWJtUHRUVVludE5PQlRRdkREb3d4MUtfckxKcEdSTXpHTFVmVDhVb3BIWk5VWWp4ejVVSUF0N3VNNW9uT1J4X28?oc=5\" target=\"_blank\">B/R's 2025 Colle"
    ],
    "image_url": "",
    "titles": [
      "🏈 College Football Playoff picks after Week 4",
      "College Football Playoff Vibe Check, Week 4: Indiana sure looks like the next ... Indiana",
      "B/R's 2025 College Football Winners and Losers from Week 4 - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.996,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Several coaches on the hot seat faced significant challenges in Week 4 of the college football season. The outcomes of these games have intensified discussions about their future in their respective programs. The specific issues and results for these coaches were highlighted, indicating that their positions may be increasingly precarious.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taliban Rejects Trump's Proposal to Retake Bagram Air Base",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 14:10:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "US President Donald Trump has pushed for regaining Bagram airbase, citing proximity to China&#039;s nuclear facilities.",
      "The Taliban government has rejected U.S. President Donald Trump&rsquo;s call to retake Bagram Air Base in Afghanistan",
      "JALALABAD, Afghanistan (AP) — The Taliban government on Sunday rejected U.S. President Donald Trump’s bid to retake Bagram Air Base, four years after America’s chaotic withdrawal from Afghanistan left the sprawling military facility in the Taliban&#8217;s hands. Trump on Saturday renewed his call to"
    ],
    "image_url": "",
    "titles": [
      "Afghan Taliban rejects Trump threats over taking back Bagram airbase",
      "Taliban reject Trump's bid to retake Bagram Air Base in Afghanistan",
      "The Taliban reject Trump’s bid to retake Bagram Air Base in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Taliban government has officially rejected U.S. President Donald Trump's proposal to retake Bagram Air Base in Afghanistan. This decision comes after Trump highlighted the strategic importance of the base due to its proximity to China's nuclear facilities. The rejection follows four years after the U.S.'s tumultuous withdrawal from Afghanistan, which resulted in the Taliban gaining control of the base.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Speak at Arizona Funeral for Assassinated Christian Nationalist Ally",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:19:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "US President Donald Trump to address Arizona service for assassinated ally.",
      "<p>Funeral expected to start at 11am local time; Erika Kirk, US president and vice-president among the expected speakers</p><p><strong>Christian nationalists in the US are positioning Charlie Kirk as a martyr for their movement, one that has grown in popularity and whose rise was intertwined with Ki",
      "Erika Kirk, the slain activist’s widow who took over as CEO of Turning Point USA, will also address the crowd of mourners at State Farm Stadium."
    ],
    "image_url": "",
    "titles": [
      "Trump to join thousands at memorial for right-wing US activist Charlie Kirk",
      "Charlie Kirk memorial latest updates: Trump and Vance to join tens of thousands of people at service for rightwing activist",
      "Charlie Kirk Memorial: Thousands Line Up Ahead Of Massive Event Where Trump And Vance Will Speak"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump is set to speak at the Arizona service for an assassinated ally, with the funeral scheduled for 11am local time. Erika Kirk, the widow of the deceased and new CEO of Turning Point USA, will also speak. The event will honor the activist, who has become a martyr for Christian nationalists in the US, a movement that has gained popularity and was closely associated with his work.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyber Incident at Collins Aerospace Disrupts European Flights",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:07:38 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "TechCrunch"
    ],
    "domains": [
      "www.theguardian.com",
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The issue affecting check-in and baggage systems caused hundreds of delays and cancellations on Saturday.",
      "<p>Zaventem asks airlines to cancel half of Monday departures, while most of Heathrow flights expected to operate </p><p>Hundreds of thousands of passengers at Heathrow and Berlin airports faced flight delays on Sunday after a <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport",
      "Travelers at major European airports including Heathrow, Brussels, and Berlin faced significant delays this weekend following what Collins Aerospace described as a “cyber-related incident.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5616/live/42744a10-96c0-11f0-90f2-5f87cb020b24.jpg",
    "titles": [
      "Heathrow warns of second day of disruption after cyber-attack",
      "Disruption continues at Heathrow, Brussels and Berlin airports after cyber-attack",
      "Hundreds of flights delayed at Heathrow and other airports after apparent cyberattack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A cyber-related incident by Collins Aerospace led to major disruptions at European airports, including Heathrow, Brussels, and Berlin, causing hundreds of flight delays and cancellations over the weekend. Zaventem Airport requested airlines to cancel half of Monday's departures, though most of Heathrow's flights were expected to operate normally.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gunman Kills 1, Injures 2 at NH Wedding; \"Free Palestine\" Yelled",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 02:35:33 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com",
      "globalnews.ca"
    ],
    "snippets": [
      "A gunman opened fire in a New Hampshire country club on Saturday, killing one person and wounding several others, authorities said.",
      "<p>Witness recounts shooter yelling ‘free Palestine’ while targeting someone as investigators try to determine motive</p><p>A man shot one person to death and wounded two others at a <a href=\"https://www.theguardian.com/us-news/new-hampshire\">New Hampshire</a> country club as a wedding took place th",
      "Authorities identified the suspect as Hunter Nadeau, age 23, and said he had been arrested and charged with one count of second-degree murder."
    ],
    "image_url": "",
    "titles": [
      "Man is arrested and charged in New Hampshire country club shooting",
      "Shooting at New Hampshire country club leaves one dead and two wounded",
      "Suspect arrested, charged after fatal shooting at New Hampshire country club"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.819,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A gunman, identified as 23-year-old Hunter Nadeau, opened fire at a New Hampshire country club during a wedding, killing one person and injuring two others. Witnesses reported the shooter yelled \"free Palestine\" before firing. Nadeau has been arrested and charged with second-degree murder. Authorities are investigating the motive.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Italy Wins Sixth Billie Jean King Cup, Defeats USA 2-0",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 14:05:46 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>Italy claim 2-0 victory against 18-time champions</p></li><li><p>Win takes Italy’s tally to six titles in women’s competition</p></li></ul><p>An inspired Italy successfully defended their Billie Jean King Cup with a 2-0 victory over record 18-time champions the United States on Sunday, ta",
      "Iga Swiatek recovered from a first-set thrashing to complete a comeback victory over Ekaterina Alexandrova and win the Korea Open.",
      "<p>Jasmine Paolini beat Jessica Pegula on the fourth match point as defending champion Italy won the Billie Jean King Cup with a comprehensive victory over the United States on Sunday.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/ca732787f0f0f9f4e06601cc19c65ae8e0cb16d9/241_0_2882_2306/master/2882.jpg?width=140&quality=85&auto=format&fit=max&s=0918eb9f8cfd9a0a1688b3071e365a1d",
    "titles": [
      "Cocciaretto and Paolini help Italy beat United States to retain Billie Jean King Cup",
      "Swiatek recovers to win Korea Open final while Italy retain Billie Jean King Cup",
      "Paolini seals victory as Italy retains the Billie Jean King Cup with win over US"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Italy secured their sixth title in the women's competition by defeating the United States 2-0 in the Billie Jean King Cup final. This victory marks Italy's successful defense of their title. The win was highlighted by Jasmine Paolini's triumph over Jessica Pegula and Iga Swiatek's comeback win at the Korea Open, contributing to Italy's comprehensive victory against the record 18-time champions, the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada, Australia, UK Formally Recognize Palestinian Statehood",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 13:49:06 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "With the president approaching 90 years of age and another possible candidate in jail, finding the right leadership would be a challenge",
      "Recognition of Palestine from Canada and Australia comes in coordination with the UK before UN General Assembly meeting.",
      "Decision announced alongside recognition by Canada and Australia comes as Israel continues deadly destruction in Gaza.",
      "<p>As well as being deeply symbolic, the move is also a major foreign policy shift for the Labour government</p><p>The UK’s formal recognition of Palestinian statehood is deeply symbolic on the world stage, but the major foreign policy shift is also a significant political step for the Labour govern"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f742/live/3fc93320-9553-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Recognising Palestinian statehood opens another question - who would lead it?",
      "Canada, Australia join UK in recognising Palestinian statehood",
      "UK recognises Palestinian statehood 108 years after Balfour Declaration",
      "How will recognition of Palestinian statehood be greeted in the UK?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.932,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada, Australia, and the UK announced the formal recognition of Palestinian statehood, marking a significant foreign policy shift, especially for the UK's Labour government. This decision, announced before a UN General Assembly meeting, is both symbolic and a response to the ongoing situation in Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "A'ja Wilson Wins WNBA MVP Again, First to Claim Title Four Times",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 11:59:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "A'ja Wilson has become the WNBA's first four-time MVP after earning the league's top individual honor for the second straight year.",
      "<p>After yet another year of breaking records in the WNBA, A&#8217;ja Wilson is heading home with some historic hardware.</p>"
    ],
    "image_url": "",
    "titles": [
      "Aces' Wilson crowned as WNBA's first 4-time MVP",
      "Aces’ Aja Wilson named WNBA MVP, becomes first four-time winner"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A'ja Wilson has been named the WNBA's MVP for the second consecutive year, marking her as the league's first four-time MVP. This achievement highlights her continued excellence and record-breaking performance in women's basketball.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Nominate Halligan as Virginia Chief Prosecutor, Urges Legal Action",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 06:06:39 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com"
    ],
    "snippets": [
      "President Donald Trump said Saturday that he would be nominating senior White House aide Lindsey Halligan to serve as the top federal prosecutor for the Virginia office that was thrown into turmoil when its U.S. attorney was pushed out Friday.",
      "The announcement came as Trump pressed Attorney General Pam Bondi to move forward with pursuing cases against some of his political opponents."
    ],
    "image_url": "",
    "titles": [
      "Trump nominates White House aide to be top US prosecutor for office probing Letitia James",
      "Trump nominates White House aide to replace U.S. attorney who was forced out after failing to prosecute president’s adversaries"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump announced his intention to nominate Lindsey Halligan, a senior White House aide, as the chief federal prosecutor for the Virginia office, following the recent ousting of its U.S. attorney. Concurrently, Trump has urged Attorney General Pam Bondi to advance legal actions against his political adversaries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League and Women's Super League Kick Off; Man City Captain Slams Arsenal",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:55:15 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sports Illustrated"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<p>⚽ Premier League updates from the 4.30pm BST kick-off<br />⚽ <a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot\">Top scorers</a> | <a href=\"https://b",
      "<p>⚽ Women’s Super League updates, 2.50pm BST kick-off<br />⚽ <a href=\"https://www.theguardian.com/football/audio/2025/sep/16/high-fives-for-arsenal-and-manchester-united-womens-football-weekly\">Listen to Women’s Football Weekly</a> | And <a href=\"mailto:Emillia.Hawkins@theguardian.com\">mail Emillia",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1uVk00NWZBUUpZb1A3N1NzMG5yUUhFTnlBN2pnSllvVGdHUXZ1Smd3Smk3RUpSQlV5QjBPU1pGSWJhM3hjZkRjRDEwSy1pNGxZRmdMRE5mWW1SdC1zQjdUTDg0ODBUc0xIM2hKcmNqWjk1aXhKNDZ4eA?oc=5\" target=\"_blank\">‘By Far’—Man City Captain Takes Swipe at Arsenal Ahead of Premier"
    ],
    "image_url": "https://i.guim.co.uk/img/media/bdfd21b750999ab6d6f92d4dc311d72781f95591/606_121_3550_2841/master/3550.jpg?width=140&quality=85&auto=format&fit=max&s=6a539ee07476b17f1573ff5b153a5b69",
    "titles": [
      "Arsenal v Manchester City: Premier League – live",
      "Manchester United 0-0 Arsenal: Women’s Super League – live reaction",
      "‘By Far’—Man City Captain Takes Swipe at Arsenal Ahead of Premier League Clash - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the latest football updates, the Premier League featured a 4.30pm BST kick-off, offering live scores and information on top scorers for the season. Concurrently, the Women’s Super League commenced at 2.50pm BST, with resources available for fans to follow the games and listen to related podcasts. In related news, ahead of a Premier League match, Manchester City's captain openly criticized Arsenal, suggesting a significant rivalry between the teams. These events highlight key moments in both men's and women's football leagues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Notes Ellison, Dell in TikTok Deal; US to Dominate Board, Control Algorith",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 15:59:15 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Donald Trump also said that Larry Ellison and Michael Dell are also likely to be involved in the TikTok deal.",
      "The White House press secretary said Americans will hold six of seven board seats in the restructured TikTok, and the video app’s algorithm will be U.S.-controlled."
    ],
    "image_url": "",
    "titles": [
      "Trump says Murdochs are potential TikTok deal partners",
      "White House offers more details about potential TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump mentioned Larry Ellison and Michael Dell's potential involvement in the TikTok deal. The White House press secretary announced that in the restructured TikTok, Americans will occupy six out of seven board seats, and control over the app's algorithm will be in U.S. hands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Formally Recognizes Palestine as State, Draws Israel's Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:24:56 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Prime Minister Starmer says the move will \"revive the hope of peace\" but Israel says it is \"nothing but a reward for jihadist Hamas\".",
      "<p>Keir Starmer’s announcement comes seven decades after end of British mandate in Palestine and creation of state of Israel</p><p>The UK has formally recognised Palestine as an independent state, Keir Starmer has announced.</p><p>The deeply symbolic move comes seven decades after the end of the Bri"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3022/live/08df3c80-96ff-11f0-90f2-5f87cb020b24.jpg",
    "titles": [
      "Watch: Keir Starmer says UK recognises Palestinian state",
      "UK recognises Palestine as an independent state"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK, under Prime Minister Keir Starmer, has formally recognized Palestine as an independent state. This decision, described as symbolic, comes 70 years after the British mandate in Palestine ended and Israel was created. Starmer believes this will \"revive the hope of peace,\" though Israel criticizes it as a \"reward for jihadist Hamas.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Evenepoel Wins Third Time Trial World Title; Reusser Triumphs in Women's",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 15:45:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Remco Evenepoel wins his third consecutive individual time trial world title at the Road World Cycling Championships in Rwanda.",
      "<ul><li><p>Swiss Reusser beats Kigali field by 51.89sec to take gold</p></li><li><p>Belgium’s Evenepoel passes Pogacar on way to victory</p></li></ul><p>Switzerland’s Marlen Reusser overcame illness this year to win the women’s individual time trial at the Cycling Road World Championships in Kigali "
    ],
    "image_url": "",
    "titles": [
      "Evenepoel wins another time trial world title",
      "Marlen Reusser and Remco Evenepoel take world time trial titles in Rwanda"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Remco Evenepoel from Belgium won his third consecutive individual time trial world title at the Road World Cycling Championships in Rwanda, after overtaking Pogacar. Meanwhile, Switzerland's Marlen Reusser, overcoming illness, won the women's individual time trial by a margin of 51.89 seconds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 Fantasy Football Projections: PPR, Superflex Rankings Released",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 15:22:36 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's model reveals its Week 3 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "Click for our latest weekly fantasy football rankings. Read how we rank fantasy players for PPR, superflex, and non-PPR lineup decisions, plus for rest-of-season predictions, dynasty leagues, rookies, and drafts."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2024/12/08/3e2f21fd-be44-4132-bff9-194bc2d109bc/alvin-kamara-saints-usatsi.jpg",
    "titles": [
      "Fantasy Football Rankings, sleepers, streamers, cheat sheets for NFL Week 3, 2025 for PPR, standard leagues",
      "Week 3 Fantasy Rankings: Fantasy football player rankings to set your lineups"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine has released its Week 3 Fantasy football projections, including PPR rankings and start-sit advice applicable to CBS Sports, ESPN, and Yahoo. The latest rankings cover various formats like PPR, superflex, and non-PPR, as well as guidance for rest-of-season predictions, dynasty leagues, rookies, and drafts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Release Week 3 NFL Picks and $10 Parlay for $18,000 Potential Win",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 14:40:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.bleedinggreennation.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's top NFL experts reveal their NFL picks, NFL predictions, NFL betting tips, and NFL best bets for Week 3",
      "SportsLine's computer simulation model has locked in a $10 5-leg NFL Week 3 parlay that pays well over $18,000",
      "﻿﻿﻿Which bets do you like the most?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/06/1af9cdab-9a8d-4a97-b391-42b681ab74f9/tj-hockenson-imagn-viknigs.jpg",
    "titles": [
      "NFL picks this week, odds, lines, bets: Week 3, 2025 expert predictions against the spread, parlay, prop bets",
      "NFL longshot picks, 2025 Week 3 odds, player props: This NFL parlay could bring an $18,000 return on $10 bet",
      "NFL Picks Against the Spread: Week 3 Games"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's top NFL experts and a computer simulation model have released their Week 3 NFL picks, predictions, and betting tips, including a notable $10 5-leg parlay that could yield over $18,000.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aston Villa Draws 1-1 with 10-Man Sunderland, Scoring Season's First Goal",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:09:22 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<p>Aston Villa finally scored their first Premier League goal of the season but, on this quietly concerning evidence, the quest for last season’s mislaid form is far from over.</p><p>In marked contrast Sunderland were a study in resilience and belief after not merely the 33rd minute dismissal of the",
      "Aston Villa broke their goalscoring duck but were pegged back by 10-man Sunderland in a fraught 1-1 draw at the Stadium of Light."
    ],
    "image_url": "https://i.guim.co.uk/img/media/b00c2bb2d250cdaf405f05dc372e6d61b1283770/254_127_1641_1312/master/1641.jpg?width=140&quality=85&auto=format&fit=max&s=3832d864281292202019509e12954a97",
    "titles": [
      "Isidor strikes for 10-man Sunderland to rescue point against Aston Villa",
      "Villa remain winless after 10-man Sunderland rescue draw"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aston Villa scored their first Premier League goal of the season in a 1-1 draw against Sunderland, who played with 10 men from the 33rd minute. Despite the goal, concerns remain about Villa's form, while Sunderland showcased resilience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Raises H-1B Visa Fees; Tech Firms Advise Workers to Stay in US",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-20T16:13:28-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "With new restrictions and fees on work visas in the US set to take effect at midnight tonight, it’s no surprise that many employers are advising workers abroad to return to the US. Leaked memos from Google, Amazon, and Microsoft have been circulating on social media that instruct instruct any H-1B v",
      "Large tech companies have responded to President Donald Trump’s dramatic changes to H-1B visa applications by telling employees with those visas to remain in the United States for now."
    ],
    "image_url": "",
    "titles": [
      "Amazon, Google, and Microsoft warn employees to rush back to the US",
      "Amazon, Google, Microsoft reportedly warn H-1B employees to stay in the US"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.66,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration announced an increase in H-1B visa application fees, prompting companies and lawyers to quickly advise affected workers. In response, large tech firms advised employees holding H-1B visas to stay in the U.S. due to the changes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Imposes $100K Fee on H-1B Visas, Sparks Corporate Concern",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 21:45:46 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The announcement to impose a $100,000 annual fee on H-1B visas sent shockwaves through corporate America.",
      "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers."
    ],
    "image_url": "",
    "titles": [
      "Big Tech companies, foreign governments scramble after Trump slaps $100,000 fee on H-1B visas",
      "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.667,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump signed a proclamation imposing a $100,000 annual fee on H-1B visas, aimed at skilled foreign workers. This move has caused significant concern among corporations in America and has been criticized by immigration hard-liners for allegedly replacing American workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cole Hocker Wins 5K Gold at World Championships After 1500m Disqualification",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 09:45:22 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "After facing disqualification in the 1500 meters, Olympic champion Cole Hocker secured a victory in the 5K.",
      "Six days after a DQ kept him out of the 1,500-meter final, Cole Hocker won his first gold in a World Championship race."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cfec66e53fc87c2716abe1/0x0.jpg?width=960",
    "titles": [
      "Olympic Champion Cole Hocker Wins 5K At The World Championships",
      "Cole Hocker Finds His Slice Of Redemption, Secures Gold In The 5K At World Championships"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.951,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Olympic champion Cole Hocker faced disqualification in the 1500 meters but rebounded to win gold in the 5K at the World Championships, securing his first victory in the event after being kept out of the 1500-meter final.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]