[
  {
    "title": "Amid Zimbabwe’s political crisis, hope and frustration brew",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 08:55:38 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As president Mnangagwa faces pressure to resign, people say they are angry but fear protesting amid calls for change."
    ],
    "image_url": "",
    "summary": "In Zimbabwe, President Mnangagwa is facing increasing pressure to resign due to public dissatisfaction. However, despite the anger among citizens, there is a widespread fear of protesting. This apprehension is rooted in concerns over potential repercussions, hindering calls for change and public demonstrations against his leadership.",
    "titles": [
      "Amid Zimbabwe’s political crisis, hope and frustration brew"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.901,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46525000000000005,
    "normalized_score": 9.43
  },
  {
    "title": "Trump administration seeks criminal prosecution of New York attorney general",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 15:24:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Federal housing officials accused Letitia James, who won a real estate case against Trump in 2023, of mortgage fraud."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7fa6/live/33878d90-1ac0-11f0-8699-af8a0981754f.jpg",
    "summary": "Federal housing officials have accused Letitia James, known for winning a real estate case against Trump in 2023, of committing mortgage fraud. The current status of these accusations or the details of the alleged fraud were not provided in the summary.",
    "titles": [
      "Trump administration seeks criminal prosecution of New York attorney general"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.991,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46375,
    "normalized_score": 9.35
  },
  {
    "title": "US tariffs will make global trade shrink, says WTO",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 15:03:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Geneva-based institution says American tariffs will send international trade into reverse."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d4b/live/efdcdf60-1ac3-11f0-8699-af8a0981754f.jpg",
    "summary": "The Geneva-based institution has reported that American tariffs are expected to negatively impact international trade, potentially causing it to decline. This assessment highlights concerns about the broader implications of these tariffs on global trade dynamics.",
    "titles": [
      "US tariffs will make global trade shrink, says WTO"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.987,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46275,
    "normalized_score": 9.3
  },
  {
    "title": "Ukraine prolongs martial law amid Russian air attacks, heavy ground battles",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 13:13:24 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The measure enables Ukraine to further delay elections, despite pressure for a presidential vote from the US and Russia."
    ],
    "image_url": "",
    "summary": "Ukraine has passed a measure allowing the postponement of elections, amid calls from both the US and Russia for a presidential vote. This move provides Ukraine with the legal framework to delay electoral processes during its ongoing situation, despite international pressure.",
    "titles": [
      "Ukraine prolongs martial law amid Russian air attacks, heavy ground battles"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.961,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46224999999999994,
    "normalized_score": 9.27
  },
  {
    "title": "Detained activist suspected US immigration interview was a trap",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 14:41:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mohsen Mahdawi, a former protest leader, was arrested after showing up to the appointment in Vermont."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d40a/live/92706960-1ac7-11f0-a455-cf1d5f751d2f.jpg",
    "summary": "Mohsen Mahdawi, previously known for his role as a protest leader, was arrested in Vermont upon attending a scheduled appointment. The reasons for his arrest or the nature of the appointment were not disclosed in the provided information.",
    "titles": [
      "Detained activist suspected US immigration interview was a trap"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.982,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4615,
    "normalized_score": 9.23
  },
  {
    "title": "Former FC Cincinnati striker Aaron Boupendza dead after reportedly falling from his apartment building in China",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 15:55:12 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aaron Boupendza played 24 games with FC Cincinnati between 2023 and 2024."
    ],
    "image_url": "",
    "summary": "Aaron Boupendza appeared in 24 games for FC Cincinnati over the course of the 2023 and 2024 seasons.",
    "titles": [
      "Former FC Cincinnati striker Aaron Boupendza dead after reportedly falling from his apartment building in China"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.999,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38575000000000004,
    "normalized_score": 5.3
  },
  {
    "title": "Paige Bueckers talks about her investment stake in Unrivaled league on 'Good Morning America'",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 15:54:53 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers is ready to start not just her WNBA career with the Dallas Wings but her career as a businesswoman as well.  The longtime UConn star, who was picked first overall by the Wings on Monday night, confirmed during an appearance on “Good Morning America” on Wednesday that she is an investor in Unrivaled, which just completed its inaugural season.  Bueckers' deal with the 3-on-3 league is expected to be far more lucrative than her four-year WNBA rookie contract."
    ],
    "image_url": "",
    "summary": "Paige Bueckers, selected first overall by the Dallas Wings in the WNBA draft, announced on \"Good Morning America\" her investment in the 3-on-3 basketball league, Unrivaled. This business venture is anticipated to be more profitable than her four-year rookie contract with the WNBA. Bueckers, a celebrated UConn alum, is embarking on her professional basketball and business careers simultaneously, highlighting her dual focus on sports and entrepreneurship as she joins the Dallas Wings.",
    "titles": [
      "Paige Bueckers talks about her investment stake in Unrivaled league on 'Good Morning America'"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.999,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35575,
    "normalized_score": 3.75
  },
  {
    "title": "ESPN highlights pair of Day 2 DE draft prospects for Indianapolis Colts",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 15:44:38 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "ESPN recently highlighted a pair of Day 2 DE draft prospects for the Indianapolis Colts."
    ],
    "image_url": "",
    "summary": "ESPN highlighted two defensive end (DE) prospects that the Indianapolis Colts could potentially draft on Day 2 of the NFL draft. This analysis suggests these players are viewed as valuable additions to the Colts' defensive lineup, indicating the team's interest in strengthening their defense through the draft.",
    "titles": [
      "ESPN highlights pair of Day 2 DE draft prospects for Indianapolis Colts"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.71
  },
  {
    "title": "Amorim 'can only hope his faith is justified' after backing Onana",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 15:41:24 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In fairness to Ruben Amorim, he didn't shirk it.  The Manchester United head coach could have opted not to answer and leave everyone guessing - or scurrying to find out through other means - until his team for Thursday's game against Lyon is announced 75 minutes before kick-off.  Amorim pointed out that it is not because he likes the Cameroon international - although he does - nor because he feels the goalkeeper's confidence needs a boost."
    ],
    "image_url": "",
    "summary": "Manchester United head coach Ruben Amorim openly discussed his team selection decisions ahead of Thursday's game against Lyon, rather than avoiding questions. He clarified that his choices are not solely based on personal preference or boosting a player's confidence, implicitly referring to the selection of the Cameroon international goalkeeper. This approach comes before the official team announcement, set 75 minutes before the match begins.",
    "titles": [
      "Amorim 'can only hope his faith is justified' after backing Onana"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.995,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35475,
    "normalized_score": 3.7
  },
  {
    "title": "Real Madrid are comeback kings - but history is against them",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 15:36:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On three out of the past four occasions where Real Madrid have trailed after the first leg in the Champions League, they have fought back to reach the next round - against Wolfsburg in 2015-26 and in 2021-22 against both Paris St-Germain and Manchester City.  The last time they faced such a task was against Borussia Dortmund in the 2012-13 semi-final, when Robert Lewandowski netted a hat-trick in a 4-1 win for Jurgen Klopp's side in Germany."
    ],
    "image_url": "",
    "summary": "Real Madrid has a recent history of overcoming first-leg deficits in the Champions League, successfully advancing to the next round on three out of four recent occasions. They achieved comebacks against Wolfsburg in the 2015-16 season and against both Paris St-Germain and Manchester City in the 2021-22 season. Their last failure to overturn a first-leg loss was in the 2012-13 semi-final against Borussia Dortmund, where they were defeated 4-1, with Robert Lewandowski scoring a hat-trick for Dortmund.",
    "titles": [
      "Real Madrid are comeback kings - but history is against them"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 3.68
  },
  {
    "title": "Nvidia to Record $5.5B Charge as US Cracks Down on Chip Exports to China",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 10:18:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "AMD Sees Up to $800M in Charges"
    ],
    "image_url": "https://www.investopedia.com/thmb/b9EPXFql-vP2Mo14V0AQsQgTfow=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2205236105-6b279cafbbb84eb1ac5e55069108090a.jpg",
    "summary": "AMD announced it expects to incur up to $800 million in charges. This financial impact is attributed to restructuring efforts, which include workforce reductions and asset impairments. The company aims to streamline operations and reduce costs amid a challenging economic environment. This move is part of AMD's broader strategy to improve its financial health and operational efficiency.",
    "titles": [
      "Nvidia to Record $5.5B Charge as US Cracks Down on Chip Exports to China"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.921,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47625000000000006,
    "normalized_score": 10.0
  },
  {
    "title": "Truth, lies and the betrayal of Ukraine",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 15:30:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration’s falsehoods over the war are doing profound damage to America’s global standing"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F53d1eecb-740b-47bd-b2b9-e4aaca8bba44.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The Trump administration has been accused of spreading falsehoods regarding the war, which critics argue is significantly harming America's reputation on the global stage. This situation has raised concerns about the credibility and trustworthiness of the United States internationally.",
    "titles": [
      "Truth, lies and the betrayal of Ukraine"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.69
  },
  {
    "title": "Nvidia, AMD, and Other Chip Stocks Fall as Trump Curbs Exports to China",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 14:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"PATRICK T. FALLON / Getty Images Nvidia CEO Jensen Huang delivers a keynote address at CES in Las Vegas on Jan. 6, 2025\" src=\"https://www.investopedia.com/thmb/ilxM1sW2XoF1oqa1eclfVrG_Jxk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2192215566-66ec3c2cead940ca950aef62a4b43619.jpg\" title=\"Nvidia CEO Jensen Huang holds a chip at CES.\" /><figcaption><i><p>PATRICK T. FALLON / Getty Images</p> Nvidia CEO Jensen Huang delivers a keynote address at CES in Las Vegas on Jan. 6, 2025</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Semiconductor stocks sank Wednesday after Nvidia and AMD warned they would take a hit after the Trump administration moved to curb the chipmakers’ exports to China. </li><li>Nvidia's H20, AMD's MI308, and other chip \"equivalents\" will reportedly require an export license in order to be sold to Chinese firms. </li><li>Nvidia is expected to report its latest financial results on May 28. </li></ul><br /><br /><p><a href=\"https://www.investopedia.com/terms/s/semiconductor.asp\">Semiconductor</a> stocks sank Wednesday after Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>) and Advanced Micro Devices (<a class=\"pseudoStyle\" href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AMD\">AMD</a>) warned they would take a hit after the Trump administration moved to curb the chipmakers’ exports to China. </p><p>Nvidia and AMD shares tumbled over 6% in early trading, and Broadcom (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AVGO\">AVGO</a>) shed close to 4%. Other chip stocks were also lower, dragging the PHLX Semiconductor Index (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;sox\">SOX</a>) down 4%. (Read <em>Investopedia's</em> live coverage of <a href=\"https://www.investopedia.com/dow-jones-today-04162025-11716170\">today's market action here</a>.)</p><p>Nvidia said Tuesday it expects to take a <a href=\"https://www.investopedia.com/nvidia-to-record-usd5-5b-charge-as-us-cracks-down-on-chip-exports-to-china-11716119\">$5.5 billion charge</a> in its fiscal 2026 first-quarter results after the Trump administration limited exports of its <a href=\"https://www.investopedia.com/terms/a/artificial-intelligence-ai.asp\">artificial intelligence</a> chips to China. The chipmaker said it was informed on April 9 that it required an export license \"for the indefinite future\" to sell its H20 chips to China. The license is meant to reduce the risk that the H20, which is less powerful than Nvidia’s latest chips and had been tailored to meet U.S. <a href=\"https://www.investopedia.com/semiconductor-impact-on-the-stock-market-7367723\">export restrictions</a>, ends up in a Chinese supercomputer. Nvidia is expected to report its latest financial results on May 28. </p><p>AMD said it expects to face charges of up to $800 million related to the export of its MI308 chip.<span class=\"ql-inline-citation\"></span> The new license requirement will also apply to other chip \"equivalents,\" a spokesman for the U.S. Commerce Department said, according to reports. <br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/ilxM1sW2XoF1oqa1eclfVrG_Jxk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2192215566-66ec3c2cead940ca950aef62a4b43619.jpg",
    "summary": "Semiconductor stocks, including Nvidia and AMD, fell sharply after the Trump administration announced restrictions on chip exports to China, requiring export licenses for certain products. Nvidia anticipates a $5.5 billion charge in Q1 fiscal 2026 due to these limitations, particularly affecting its H20 chips. AMD expects up to $800 million in charges related to its MI308 chip exports. The new regulations aim to prevent advanced technology from enhancing Chinese supercomputing capabilities. Nvidia is set to report its financial outcomes on May 28.",
    "titles": [
      "Nvidia, AMD, and Other Chip Stocks Fall as Trump Curbs Exports to China"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46775,
    "normalized_score": 9.56
  },
  {
    "title": "Tech stocks sink after Nvidia reveals hit from US curbs on sales to China",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 15:48:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chipmaker leads declines as Wall Street sell-off reignites"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F43442058-b3ca-4ac8-8160-0d893fdac444.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "A leading chipmaker was at the forefront of a renewed sell-off on Wall Street, contributing significantly to the market's downturn. This event marks a notable decline in stock values, impacting the broader financial landscape.",
    "titles": [
      "Tech stocks sink after Nvidia reveals hit from US curbs on sales to China"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.997,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46525000000000005,
    "normalized_score": 9.43
  },
  {
    "title": "Gavin Newsom says California to sue over Trump tariffs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 13:44:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "State governor argues duties will lead to job losses and higher prices"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F0d70d0a9-311f-40d8-be87-1c406e650978.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "A state governor has argued that certain duties will result in job losses and an increase in prices. This statement suggests a concern over the economic impact of these duties, highlighting potential negative outcomes for employment and consumer costs.",
    "titles": [
      "Gavin Newsom says California to sue over Trump tariffs"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.968,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46399999999999997,
    "normalized_score": 9.36
  },
  {
    "title": "Growing wildflowers on disused urban land can damage bee health",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 21:12:41 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wildflowers growing on land previously used for buildings and factories can accumulate lead, arsenic and other metal contaminants from the soil, which are consumed by pollinators as they feed, a new study has found."
    ],
    "image_url": "",
    "summary": "A new study reveals that wildflowers on land formerly occupied by buildings and factories can absorb lead, arsenic, and other metal contaminants from the soil. Pollinators feeding on these flowers consequently ingest these harmful substances.",
    "titles": [
      "Growing wildflowers on disused urban land can damage bee health"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.739,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39475000000000005,
    "normalized_score": 5.77
  },
  {
    "title": "First ever confirmed image of a colossal squid in the deep ocean",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 22:00:39 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The colossal squid is the largest invertebrate on the planet, but it is also surprisingly elusive. An image of a 30-centimetre-long juvenile is our first glimpse of the animal in its natural habitat"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15211626/SEI_247676585.jpg",
    "summary": "Scientists have captured the first image of a juvenile colossal squid in its natural habitat. Measuring 30 centimeters long, this sighting is significant as the colossal squid, known as the largest invertebrate on Earth, remains highly elusive. This marks a rare observation of the species in its natural environment.",
    "titles": [
      "First ever confirmed image of a colossal squid in the deep ocean"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.736,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.394,
    "normalized_score": 5.73
  },
  {
    "title": "Gut microbes release cancer-fighting bile acids that block hormone signals",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 18:34:36 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bacteria naturally present in the human intestine (known as the gut microbiota) can transform cholesterol-derived bile acids into powerful metabolites that strengthen anti-cancer immunity by blocking androgen signaling, according to a preclinical study."
    ],
    "image_url": "",
    "summary": "A preclinical study has found that bacteria in the human gut can convert cholesterol-derived bile acids into metabolites that enhance anti-cancer immunity. These metabolites work by inhibiting androgen signaling, which can play a role in blocking cancer growth.",
    "titles": [
      "Gut microbes release cancer-fighting bile acids that block hormone signals"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.702,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38549999999999995,
    "normalized_score": 5.29
  },
  {
    "title": "On Jupiter, it's mushballs all the way down",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 18:34:33 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Observations of Jupiter show that ammonia is unevenly distributed in the upper atmosphere, against expectations of uniform mixing. Scientists found evidence for a complicated but apparently real process associated with fierce lightning storms: strong updrafts generate slushy, ice-coated hailstones of ammonia and water that eventually plunge into the planet and deplete areas of ammonia. This is part of the first 3D picture of the planet's atmosphere, which shows storms are primarily shallow."
    ],
    "image_url": "",
    "summary": "Scientists have discovered that ammonia is not uniformly mixed in Jupiter's upper atmosphere, contrary to what was expected. This uneven distribution is linked to the planet's intense lightning storms, which create updrafts that form slushy, ice-coated hailstones made of ammonia and water. These hailstones then fall into the planet, creating areas with depleted ammonia levels. This finding contributes to the first 3D representation of Jupiter's atmosphere, revealing that its storms are mostly shallow.",
    "titles": [
      "On Jupiter, it's mushballs all the way down"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.702,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38549999999999995,
    "normalized_score": 5.29
  },
  {
    "title": "Drought may have sped the demise of Rapa Nui sculpture culture",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 19:00:02 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A decades-long stretch of extremely low precipitation in the 1500s may have spurred cultural changes among the Rapa Nui people that reduced time spent building statues, but not all archaeologists agree"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15153446/SEI_247623197.jpg",
    "summary": "In the 1500s, a significant drought on Rapa Nui possibly led to cultural shifts, resulting in the local population reducing the time dedicated to constructing their iconic statues. However, this theory is not universally accepted among archaeologists.",
    "titles": [
      "Drought may have sped the demise of Rapa Nui sculpture culture"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.694,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38349999999999995,
    "normalized_score": 5.19
  }
]