[
  {
    "title": "Poland Reports 19 Airspace Breaches, Blames Belarus and Russia; NATO Responds",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-10T13:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Washington Post",
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "ottawa.citynews.ca",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "NATO member Poland said it scrambled defenses in response to 19 airspace breaches. Polish Prime Minister Donald Tusk said many of the drones came from Belarus. DW has the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOUFd1dlpHZ1BCMWNTYU84TVNLOHFnM0I2NjcwN0JJQnExNmxONzJNZldXVnpjX0FmUHhRSHpFdGJWN3BRcTJQa29PMEVQbVpvemNIdWtoMU5Oa1dUY1QwU1JiUGZreXV3OFVIc3BrS3pGNk9UanZucWtVSnkwT0VSejdzMlY?oc=5\" target=\"_blank\">Poland, NATO leaders condemn Russian drones in P",
      "The military called the breach of Poland’s airspace “unprecedented,” and it triggered a request by Warsaw to consult with fellow NATO members.",
      "The incursion was the first time alliance planes had engaged enemy targets in NATO airspace. Poland’s leader called it “a large-scale provocation.”",
      "WOHYN, Poland (AP) — Multiple Russian drones crossed into Poland in what European officials described Wednesday as an deliberate provocation, causing NATO to send fighter jets to shoot them down. A NATO spokesman said it was the first time the alliance confronted a potential threat in its airspace. ",
      "Poland accused Russia of violating its airspace 19 times overnight, during its bombardment of neighboring Ukraine. Moscow denies the drones are Russian.",
      "Article 4 allows member states to start a formal discussion within the alliance about threats to their security. It does not commit the alliance to military action."
    ],
    "image_url": "",
    "titles": [
      "Poland calls NATO meeting after downing Russian drones",
      "Poland, NATO leaders condemn Russian drones in Polish airspace - Axios",
      "NATO says it scrambled fighter jets, shot down Russian drones over Poland",
      "NATO Says It Scrambled Fighter Jets to Shoot Down Russian Drones Over Poland",
      "NATO scrambles jets to shoot down Russian drones in Poland, raising fears of war spillover",
      "What to know as Poland invokes NATO Article 4, citing Russian drone violation",
      "Poland Has Invoked NATO’s Article 4. What Comes Next?"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.941,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.841,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Poland reported 19 airspace breaches, attributing many to drones from Belarus, and accused Russia of involvement. This prompted Poland to scramble defenses and consult with NATO, marking the first time NATO planes engaged targets within its airspace. The incidents led to NATO deploying fighter jets to counter what was described as a deliberate provocation. Moscow denies the drones were Russian. The situation triggered discussions under NATO's Article 4 but does not automatically lead to military action.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Fantasy Football Rankings and Projections Released, Texas A&M Snubbed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 11:21:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "www.usatoday.com",
      "www.nbcsports.com",
      "sports.yahoo.com",
      "aggieswire.usatoday.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine's model reveals its Week 2 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "While many polls and rankings have Texas A&amp;M in the top 25, CBS Sports analyst Brandon Marcello does not.",
      "Lamar Jackson, Christian McCaffrey, Ja'Marr Chase, and Brock Bowers highlight positional rankings for Week 2 of the 2025 NFL season.",
      "The Steelers' Chris Boswell hit a 60-yarder as one of his four field goals in Week 1. Meanwhile, there's some kicker news that'll impact the rankings.",
      "Fantasy football analyst Ray Garvin shares his top rookie risers and fallers coming out of Week 1.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxOU2hTWTM4RG9zQXV6UWpuaXh0ZzljaE9CV0JObjZTN3FSaTFWNDVuenR1VHEzOG1WLXB0aGFYeVRkb1hJSWRQVHpKUHNQMmpuWHJOeDRqY0RkaE9oeW94MVhQNEZZVE1YejhjNFJfSlNlQno3LUFfZkpYdjhVVWt2Q2xNdWFnS3JfWjNxQkVtUmxLZEI4NUhKRVdVLUo5d2c?oc=5\" target=\"_blank\">Defense & Ki"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Updated week 2 rankings",
      "Fantasy Football Rankings, streamers, sleepers, cheat sheets for Week 2, 2025 for PPR, standard leagues",
      "Texas A&amp;M football remains unranked in CBS Sports analyst's Week 3 power rankings",
      "Matthew Berry’s Fantasy Football Rankings for Week 2 of 2025 season",
      "Week 2 fantasy kicker rankings: Best starts at kicker",
      "Fantasy Football Rookie Report entering Week 2: 'Bill' Croskey-Merritt makes a memorable debut",
      "Defense & Kicker Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.98,
      "consensus": 0.968,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Weekly fantasy football rankings for PPR and IDP formats, and superflex ranks by Eric Karabell, have been released. SportsLine's model offers Week 2 projections, PPR rankings, and start-sit advice for various platforms. Despite many polls ranking Texas A&M in the top 25, CBS Sports' Brandon Marcello does not include them. Key players like Lamar Jackson, Christian McCaffrey, Ja'Marr Chase, and Brock Bowers are highlighted in Week 2 positional rankings for the 2025 NFL season. Steelers' Chris Boswell made headlines with a 60-yard field goal among his four in Week 1, affecting kicker rankings. Fa",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal Protests Turn Violent: 19 Dead, 200 Injured Amid Anti-Corruption Outcry",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 11:18:42 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Fierce protests against corruption and nepotism spiralled into arson and violence on Tuesday.",
      "Soldiers have been patrolling the streets of Nepal’s capital to enforce a curfew after days of mass protests.",
      "Nepal&#039;s army has taken control of the streets and is effectively in charge for now, say experts. Here&#039;s what&#039;s next.",
      "Demonstrators have set fire to government buildings. The military has sent in troops to restore order.",
      "Protesters set fire to government buildings and the homes of politicians as unrest over corruption, censorship and economic issues stretched into a second day.",
      "The Nepali army has announced an indefinite curfew in Kathmandu as it tries to bring normalcy to the city after violent protests against corruption.",
      "Anger had been mounting for years against a Nepali political elite viewed as corrupt and out of touch, and it exploded Tuesday with sudden ferocity.",
      "Troops imposed order after at least 30 people were killed during antigovernment demonstrations. Members of the Gen Z protest movement said they wanted a former Supreme Court chief justice to lead a new interim government."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/94fe/live/d4baadb0-8e05-11f0-9f52-518f0cda8f56.jpg",
    "titles": [
      "Nepal protests 'hijacked', Gen Z claim, as army patrols the streets",
      "Video: Army deployed in Nepal after mass ‘Gen Z’ protests",
      "Who’s leading Nepal after Oli resignation, what’s next for Gen Z protests?",
      "Explosive Protests in Nepal",
      "Troops Deployed After Day of Violent Protests in Nepal",
      "Nepal's army patrols streets after deadly protests",
      "Nepal’s prime minister resigns and parliament burns amid deadly protests",
      "Live Updates: Nepal’s Army Takes Back Kathmandu’s Streets After Two Days of Protests"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.883,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.806,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Nepal, protests against corruption, nepotism, and a social media ban escalated into violence, resulting in at least 19 deaths and over 200 injuries. Demonstrations turned deadly when protestors, primarily young people frustrated by longstanding grievances, resorted to arson, attacking government buildings. The military has been deployed to restore order amidst the chaos.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Regrets Attack Location, Qatar Seeks Diplomatic Gaza Solution",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 07:05:10 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "Israel says it carried out an airstrike targeting senior Hamas officials in Qatar's capital of Doha. And, Trump says he wants to fight crime in Illinois. Gov. JB Pritzker sees a power grab.",
      "Hamas says six people killed in air strike but its leadership team survived.",
      "Hamas said that Khalil al-Hayya, who had been leading indirect ceasefire talks with Israel, survived the deadly attacks on his villa in Doha, Qatar.",
      "Qatar’s prime minister said the country would continue to seek a diplomatic resolution to the war in Gaza, despite the strike.",
      "Why did Israel attack? Who was killed? What has been the Qatari response? Here are answers to those and other key questions."
    ],
    "image_url": "",
    "titles": [
      "Israel targets Hamas Qatar strike. And, JB Pritzker on Trump's threats to Chicago",
      "Israel Strikes Hamas In Qatar",
      "Israel threatens ‘enemies everywhere’ after strike against Hamas in Qatar",
      "Israeli strike targeting Hamas in Qatar ‘does not advance Israel or America’s goals,’ Trump says",
      "Israel’s Strike on Hamas in Qatar: What to Know"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.897,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US president expressed regret over the location of an attack, emphasizing Qatar's status as a \"close ally.\" Meanwhile, Qatar's prime minister reaffirmed the country's commitment to pursuing a diplomatic solution to the ongoing war in Gaza, despite recent strikes.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Larry Ellison Tops Musk as World's Richest After Oracle's AI-Driven Surge",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 15:03:15 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Forbes",
      "Financial Times",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.ft.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5neHFhRkxKT3F1Wm5YU1hVcW5NRU1JR2M3MkpxM3JwVFQxYUlvaXE5d0xQMmo3SjJGYzlNT1VlSERydGIzeVgxR0N0QzlGMGN0bF9OeFE5ZW0zaFQ1Z1QzVTFpeVhmdmg3Sjd2R2M2Um52QW02RzBlRA?oc=5\" target=\"_blank\">Oracle's Larry Ellison surpasses Elon Musk as world's richest per",
      "Oracle market value jumps more than $290bn on AI surge after ‘astonishing quarter’",
      "Economists were “blown away” by Oracle’s projections for AI growth: “We’re all kind of in shock, in a very, very good way.”",
      "Musk held the title of world’s richest person for 300 days."
    ],
    "image_url": "",
    "titles": [
      "Oracle's Larry Ellison surpasses Elon Musk as world's richest person - Axios",
      "Larry Ellison overtakes Elon Musk to become world’s richest person",
      "Larry Ellison $110 Billion Richer—Challenges Musk For Richest Title",
      "Larry Ellison surpasses Elon Musk as world’s richest person after Oracle’s stock gives him a $101 billion net worth boost"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.954,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Larry Ellison of Oracle has become the world's richest person, surpassing Elon Musk, following a significant surge in Oracle's market value by over $290 billion due to an impressive quarter driven by AI growth. Economists were extremely impressed by Oracle's AI growth projections. Musk previously held the title for 300 days.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran, IAEA Sign Deal in Cairo to Renew Nuclear Inspections",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 12:53:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Agreement potentially paves way for resumed cooperation after Israel-Iran conflict sparked rift between Tehran and UN.",
      "Iran and the IAEA agreed on a new cooperation framework which could lead to the resumption of nuclear site inspections, largely stalled since Israel then the US attacked Iranian nuclear facilities in June.",
      "<p>Rafael Grossi, IAEA director general, says agreement with Tehran is ‘important step in the right direction’</p><p>Tehran and the UN nuclear inspectorate have reached an agreement that will allow UN inspectors to return to inspect all of Iran’s nuclear sites, including those bombed by Israel and t",
      "Iran has not allowed inspections since its nuclear sites were bombed by Israel and the United States in June, but it hopes to stave off Western economic sanctions."
    ],
    "image_url": "",
    "titles": [
      "Iran and UN appear at odds over nuclear deal",
      "Iran, UN nuclear watchdog progress on nuclear inspections",
      "UN inspectors can resume work at Iran nuclear sites after breakthrough deal",
      "Iran and U.N. Watchdog Reach Agreement to Resume Nuclear Inspections"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.931,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iran and the International Atomic Energy Agency (IAEA) signed an agreement in Cairo, setting a framework for renewed cooperation and the potential resumption of inspections at Iran's nuclear facilities. This move comes after inspections were largely halted following attacks on these sites by Israel and the United States in June. The agreement aims to facilitate inspections and avert Western economic sanctions against Iran.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Appoints Lecornu as PM Amid France's Political Turmoil",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 12:01:20 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "A grassroots movement is encouraging people to protest against the political class and proposed budget cuts.",
      "Police in France made hundreds of arrests as new Prime Minister Sebastien Lecornu's first day in office was greeted with protests. Lecornu faces opposition from left and right as he tackles a financial crisis.",
      "French President Emmanuel Macron has named Defense Minister Sebastien Lecornu as prime minister to replace Francois Bayrou after he was ousted just nine months in office.",
      "Sébastien Lecornu had been defense minister. He is one of President Emmanuel Macron’s most loyal and enduring allies.",
      "President Emmanuel Macron’s appointment of Sébastien Lecornu, the departing defense minister, after the government collapsed reflects the pressure Mr. Macron faces to get a budget passed.",
      "<p>Sébastien Lecornu appointment comes amid protests across France including 1,000 demonstrators trying to enter Gare du Nord station in Paris</p><p><a href=\"https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron\">Emmanuel Macron appoints his third prim"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bcfa/live/007a2930-8e4c-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Protests hit France as new PM takes office",
      "France: Prime Minister Lecornu takes office amid protests",
      "France: Macron taps defense minister Lecornu as new prime minister",
      "Who Is France’s New Prime Minister, Sébastien Lecornu?",
      "Macron Picks Sébastien Lecornu as France’s Next Prime Minister",
      "New French PM takes office as ‘Block Everything’ protests rock country – Europe live"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.896,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron appointed Sébastien Lecornu, the former defense minister and a close ally, as the new prime minister following François Bayrou's removal from office after nine months. Lecornu, 39, faces the immediate challenge of securing parliamentary approval for the government's budget amidst a politically divided France and upcoming protests. His appointment reflects Macron's urgent need to navigate through the country's political divisions and pass a critical budget.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Producer Price Index Rises 0.3% in August, Meets Estimates",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 14:35:41 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The producer price index was expected to increase 0.3% in August, according to the Dow Jones consensus estimate.",
      "Figure comes despite Trump tariffs and keeps Fed on track for rate cut",
      "A report on wholesale prices precedes consumer price data due later this week, as the Federal Reserve debates interest rates."
    ],
    "image_url": "",
    "titles": [
      "Wholesale prices unexpectedly declined 0.1% in August, as Fed rate decision looms",
      "US wholesale prices declined unexpectedly in August",
      "Trump Applauds Rare Positive Economic Report: Wholesale Prices Unexpectedly Fell Last Month"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The producer price index rose by 0.3% in August, aligning with Dow Jones consensus estimates. This increase occurred despite the impact of Trump tariffs and does not alter the Federal Reserve's plans for a rate cut. The report on wholesale prices comes before consumer price data, which is key for the Federal Reserve's interest rate decisions.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Olympian Ben Proud Joins Drug-Allowed Games, Faces Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 14:55:50 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Olympic swimmer Ben Proud becomes the first British athlete to join the controversial Enhanced Games - but says he would never do anything to undermine 'clean' sport.",
      "<ul><li><p>Swimmer won silver for GB in the Paris pool last summer</p></li><li><p>Event allows athletes to take performance-enhancing drugs</p></li></ul><p>The Olympic swimming medallist Ben Proud has become the first British athlete to join <a href=\"https://www.theguardian.com/sport/2023/jun/24/aus",
      "Aquatics GB has condemned Team GB Olympic silver medallist Ben Proud retiring from 'traditional swimming' in order to compete at the controversial Enhanced Games next May.&#160;"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2ccc/live/58ed7a70-8e58-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Olympic medallist becomes first Briton to join Enhanced Games",
      "Olympic medallist Ben Proud becomes first British athlete to join Enhanced Games",
      "Aquatics GB condemns Olympic medallist Proud joining Enhanced Games"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British Olympic swimmer Ben Proud, who won silver in Paris, has joined the Enhanced Games, an event allowing performance-enhancing drugs. Despite controversy, Proud insists on not undermining clean sport. Aquatics GB criticizes his move from traditional swimming to participate in these games next May.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Harris Criticizes Biden's Solo Re-election Decision in New Book",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 12:46:46 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQaWktZE1YVE4xRUQ5QUNlejg3QmpZVDhVSnNQaWRydkFsSXN2SW1sai1VOE1nMnducF9tY2MtdTJvQ3pmNE9pZExiMlloeEtpLVhJT21qT2xVUjh0YmpEcV9yd1pyTGZ6aHhFQTlqbDBaaXNfaUxVTzM1MWd1Uld1TmFJaEhZV1NO?oc=5\" target=\"_blank\">In new book, Harris laments \"recklessness\" ",
      "Former Vice President Kamala Harris says that it was \"recklessness\" to allow Joe Biden to make the decision alone on running for re-election.",
      "Former president’s ‘ego’ behind decision to stay in race against Trump in US election, ex-contender says in book extract"
    ],
    "image_url": "",
    "titles": [
      "In new book, Harris laments \"recklessness\" that led to Biden's 2024 campaign - Axios",
      "'Recklessness': Kamala Harris turns on Joe Biden in new book",
      "Kamala Harris blames Democrats’ ‘recklessness’ for sticking with Biden"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In her new book, former Vice President Kamala Harris criticizes the decision to let Joe Biden alone decide on running for re-election, labeling it as \"recklessness.\" She attributes the former president's choice to stay in the race against Trump to his \"ego,\" according to an extract from the book.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "World Cup 2026: 48 Teams, 18 Qualified Including Argentina, 30 Spots Open",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 13:28:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Full list of teams that are in the World Cup and those who have been knocked out after the latest round of qualifiers.",
      "<p>Forty-eight teams will participate in next summer’s World Cup and 30 places are still up for grabs</p><p>Forty-eight teams will participate in next summer’s World Cup, with the hosts, Canada, Mexico and the United States, granted automatic entry. A further 43 places are determined by qualifying c",
      "World Cup 2026 qualifying is in full swing and several teams - including holders Argentina - have already booked their place at the expanded tournament."
    ],
    "image_url": "",
    "titles": [
      "Which teams have qualified for the FIFA World Cup 2026?",
      "The road to the 2026 World Cup: who has qualified and who is at risk",
      "Who has qualified for 2026 World Cup and when is the draw?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.943,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The World Cup 2026 will feature 48 teams, with Canada, Mexico, and the United States automatically qualifying as hosts. Eighteen teams, including Argentina, have secured their spots through the qualifying rounds, leaving 30 places yet to be filled.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguar Land Rover Halts Production After Cyberattack, Investigates Data Breach",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 13:43:57 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "TechCrunch",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "techcrunch.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The car-maker previously said there was no evidence that customers information had been taken.",
      "<p>Carmaker has informed relevant regulators and ‘will contact anyone as appropriate’ as investigation progresses</p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/sep/10/lner-urges-customers-to-be-vigilant-after-passenger-details-accessed-in-cyber-attack\">LNER urges customers to be v",
      "The cyberattack at Jaguar Land Rover, which began on September 2, has ground vehicle assembly lines to a standstill."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/86f9/live/8bd97d70-8e36-11f0-8bfd-43c7ca883cc7.jpg",
    "titles": [
      "Jaguar Land Rover admits hackers may have taken data",
      "Jaguar Land Rover says cyber-attack has affected ‘some data’",
      "Jaguar Land Rover says data stolen in disruptive cyberattack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jaguar Land Rover experienced a cyberattack on September 2, leading to a halt in vehicle assembly lines. Initially, the carmaker stated there was no evidence of customer information being compromised. However, they are now informing regulators and will contact affected individuals as their investigation continues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Blue Jays Announcer Criticizes New York Yankees",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 15:40:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "news.google.com"
    ],
    "snippets": [
      "The Toronto Blue Jays didn't hold back from criticizing the New York Yankees.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE40OXBIVGswX1MzcmdoclJ2TVp3VzhUT0EtbXVvOFM3Z0dkZ2U2N0lleEtOajFzNHc3WGExbDhscmZNdTlnYV9pRWN2MEU5bW0tVVNic1hVdkRnMHphNVl1NXNKblRrR3JpVzlCT21JRQ?oc=5\" target=\"_blank\">Blue Jays Announcer Tears Into Yankees After Checking Out-of-Town Scoreboard<"
    ],
    "image_url": "",
    "titles": [
      "Blue Jays announcer blasts Yankees, 'they are not a good team'",
      "Blue Jays Announcer Tears Into Yankees After Checking Out-of-Town Scoreboard - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Toronto Blue Jays announcer publicly criticized the New York Yankees after looking at an out-of-town scoreboard. The specific details of the criticism were not mentioned, but the incident highlights tension between the two teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Release WR Gipson After Costly Fumble in Season Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 11:21:31 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Jets are cutting Xavier Gipson after his costly kick return fumble during Sunday's loss to the Steelers, a source confirmed to ESPN.",
      "<p>The New York Jets are releasing wide receiver Xavier Gipson after his costly fumble on a kickoff return in the season-opening loss to Pittsburgh, a person with knowledge of the decision told The Associated Press on Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: Jets cutting Gipson after costly fumble",
      "AP source: Jets cutting Xavier Gipson after costly fumble in opener"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Jets are releasing wide receiver Xavier Gipson following a costly fumble on a kickoff return in their season-opening loss to the Pittsburgh Steelers. This decision was confirmed by sources to both ESPN and The Associated Press.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seattle Storm Clinches Final WNBA Playoff Spot in 74-73 Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 11:21:31 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Storm clinched the 20th postseason appearance in franchise history by holding off the Valkyries in a 74-73 win Tuesday night.",
      "<p>SEATTLE — Erica Wheeler scored 17 points, including a go-ahead shot with 18.5 seconds left, and the Seattle Storm beat the Golden State Valkyries 74-73 on Tuesday night to secure the final WNBA playoff spot.</p>"
    ],
    "image_url": "",
    "titles": [
      "Storm edge Valkyries to snag final playoff spot",
      "Wheeler’s go-ahead jumper gives Storm win over Valkyries to secure last WNBA playoff spot"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Seattle Storm secured the final WNBA playoff spot by defeating the Golden State Valkyries 74-73, marking their 20th postseason appearance. Erica Wheeler led the Storm with 17 points, making a crucial go-ahead shot with 18.5 seconds remaining in the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Attempt to Fire Fed Governor Cook",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 15:03:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The case has ramifications for the Federal Reserve&#039;s ability to set interest rates without regard to political wishes.",
      "The Supreme Court is likely to have the final say on whether President Donald Trump has legal cause to remove Lisa Cook from the Federal Reserve."
    ],
    "image_url": "",
    "titles": [
      "US federal court temporarily blocks Fed Governor Lisa Cook’s firing",
      "Trump blocked from firing Fed Governor Lisa Cook as lawsuit plays out"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge has blocked President Trump's attempt to fire Federal Reserve Governor Lisa Cook, allowing her to retain her position and attend the next rate-setting meeting. The judge ruled that Trump's effort to remove Cook likely violated the Federal Reserve Act's 'for cause' provision. The case, marking a significant challenge to presidential authority over the Federal Reserve, is expected to be ultimately decided by the Supreme Court.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA Women's Champions League Unveils New League Phase with 6 English Clubs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 07:35:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "We're going to take you on a guided tour of the new UEFA Women's Champions League and show you how the draw and the format work.",
      "The Champions League is back with six English clubs involved and the league phase format here to stay &#8211; here&#8217;s everything you need to know..."
    ],
    "image_url": "",
    "titles": [
      "How the new league phase format plays out",
      "Champions League 2025/26: How does league phase work?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UEFA Women's Champions League has introduced a league phase format, involving six English clubs. This guide explains the draw process and the structure of the competition, ensuring fans understand how the tournament operates.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spain Boosts Security for Vuelta Cycling Tour with 400 Extra Guards",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 15:34:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "More than 400 extra Civil Guards will attend final two stages of grand tour after previous pro-Palestine protests.",
      "An &quot;extraordinary&quot; security boost will accompany the final two stages of the Vuelta in the Madrid region, Spanish authorities said on Wednesday, as pro-Palestinian protests have rocked one of cycling's biggest races.The &quot;extraordinary deployment&quot; would be the police's largest sec"
    ],
    "image_url": "",
    "titles": [
      "Pro-Palestine protests bring ‘extraordinary’ security for Spain’s Vuelta",
      "Spain to deploy 'extraordinary' security for Vuelta finale"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spanish authorities announced an \"extraordinary\" security increase, deploying over 400 extra Civil Guards for the final two stages of the Vuelta cycling tour in Madrid, in response to previous pro-Palestinian protests. This marks the police's largest security operation for the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Uber to Launch Helicopter Rides in Partnership with Joby Aviation",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Uber said it will bring helicopter rides as soon as next year through its partnership with Joby",
      "Joby Aviation acquired Blade for $125 million in August."
    ],
    "image_url": "",
    "titles": [
      "Uber will launch Blade helicopter rides next year through expanded Joby partnership",
      "Uber Will Offer Blade Helicopter Rides By Next Year, It Says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Uber announced plans to offer helicopter rides starting next year, in collaboration with Joby Aviation. This move follows Joby Aviation's acquisition of Blade for $125 million in August, marking a significant step in expanding their transportation services.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: collaboration, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland and NATO Allies Shoot Down Russian Drones in Airspace Violation Incident",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 12:58:59 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The incident marks the first time the NATO member has directly engaged Russian assets in its airspace since Russia’s full-scale invasion of Ukraine.",
      "<p>Donald Tusk says Poland closer to military conflict ‘than at any time since second world war’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Follow the latest updates live</a><"
    ],
    "image_url": "",
    "titles": [
      "Poland shoots down Russian drones as Ukraine warns Putin is ‘testing the West’",
      "Poland shoots down drones over its territory amid Russian attack on Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Poland and its NATO allies shot down Russian drones after they violated Polish airspace, an action Poland labeled as an \"act of aggression.\" This incident occurred amid Russian aerial attacks on Ukraine, with the Polish military responding to a significant incursion of drones. The EU suggested the intrusion was intentional. Polish Prime Minister Donald Tusk condemned the violation, highlighting the direct threat to Poland and describing it as a large-scale provocation. The situation marks an unprecedented violation of Polish airspace and has been deemed a serious security concern for Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bending Spoons to Acquire Vimeo for $1.38 Billion",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T11:22:04-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Vimeo is getting bought up by Bending Spoons, a European software company that has amassed a growing portfolio of businesses, including Evernote, WeTransfer, and Meetup. Bending Spoons will pay $1.38 billion to acquire the video hosting platform, and it expects to close the deal later this year. Vim",
      "The announcement comes as Bending Spoons was interested in a potential takeover of Vimeo as far back as March 2024."
    ],
    "image_url": "",
    "titles": [
      "Vimeo to be acquired by Bending Spoons for $1.38 billion",
      "Vimeo to be acquired by Bending Spoons in $1.38B all-cash deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bending Spoons, a European software company, is set to acquire Vimeo for $1.38 billion. The deal, expected to close later this year, adds to Bending Spoons' portfolio which includes Evernote, WeTransfer, and Meetup. The interest in Vimeo began as early as March 2024.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone 17 Series, New Watches; Preorders Start Friday",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T11:21:05-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Apple announced the new Apple Watch Series 11, SE 3, and Ultra 3 smartwatches during its annual iPhone hardware event on Tuesday. The 2025 models are somewhat iterative in terms of their designs. However, there are plenty of new features present in each that could make either one a worthy upgrade ov",
      "At its latest hardware event on Tuesday, Apple officially announced the new 2025 iPhone lineup. That includes the iPhone 17, iPhone 17 Pro, iPhone 17 Pro Max, and the slimmed-down iPhone Air, which looks to be the standout model this year. The devices come equipped with Apple's latest A19 processors",
      "All four of the devices will be available to preorder on Friday and will be available on September 19."
    ],
    "image_url": "",
    "titles": [
      "How the 2025 Apple Watch models compare to previous versions",
      "How all the 2025 iPhone models compare on paper",
      "All of the iPhone 17 models compared"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple unveiled the Apple Watch Series 11, SE 3, and Ultra 3, along with the iPhone 17 lineup, including the iPhone 17, 17 Pro, 17 Pro Max, and iPhone Air, at its annual event. The new devices, featuring iterative design updates and new features, are powered by the A19 processor. Preorders begin on Friday, with availability starting September 19, 2025.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Fantasy Football Week 1: QB Start/Sit Advice; Titans, Chiefs Player Updates\"",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 14:57:18 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Quarterbacks you want in Week 1 lineups, and those you should avoid",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPWEdtUkp2N3hEckJ1S1BtQ2trX0lFZHVFUU9DbW5tdlBEZElmVjJPeVNieDNib2RITGZPdC1mM2xhOXJZQXR3Y0lNa1ZzWkN5TWlmcW5nUDVwcS14LU44NE1LM2ZXMmtITUptQkxYaUxhRnBIRG5JTWRTY1FubkRJOEZ5NmhYUWVIdmRkZmtGbGJ1RGh5aGhYOQ?oc=5\" target=\"_blank\">Tight End Start 'Em, ",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOeGNMVlotREh5QnhtaVVvVjRGQkt4MVc0RFhBb3B3clo2ejNnTENFd2drVGIzdjBKMWJJZjBwUHg4Z3hPUHR3WlpYLW9vdjZHZWJsemIyRFNIZlRFWjlwckxORHJXTXVWY2JaclZ6bXNCVGliTG1iaW5KZGlJZGNTeHdWZUc2ZkxuQVpWa3N0VEh0THZpcjRwOHozN3U?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1wVkpUZzlueTJxM2F6R0lFZDBXR2dLcFhhS25rdndtSThEeUEza1hTcXg4dk9VOVRCcFUyOTZJM3hkeEFiQk9LQUdITUR4dnItcE91NC1xc0EwZDYxeXppYmNGUGI0bXcyQWROZDlaTXdaRFZfaXc3bGtaT3pOdw?oc=5\" target=\"_blank\">Tennessee Titans Unveil Week 2 Uniform</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxOSjAzcE5BNWdpTkRLOHJtd1g3RUkxNVpYMUx1UVlSOE9xQXJtMTZxUmtsNHdHcTdTUmJQUGpISkxVM2tMVElzd3ZMeFlBU3FuNmQ3V3JpZkNnd1otX0U0VThLbEI4RnBRbVlFZHJDSjBTSktGdm94YVZIQjZ1YU90eDhIMHlESVlWUlVDWEY1dXRfYTh1M1Y3dGZrbw?oc=5\" target=\"_blank\">Chiefs Player Eme"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/10/38c4ac41-7fc7-487e-8c64-5531face873b/getty-justin-herbert-chargers.jpg",
    "titles": [
      "Fantasy Football Week 1 Start 'Em & Sit 'Em Quarterbacks: Justin Herbert a must play, plus more QBs to stream",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated",
      "Running Back Start ‘Em, Sit ‘Em For Fantasy Football Week 2 - Sports Illustrated",
      "Tennessee Titans Unveil Week 2 Uniform - Sports Illustrated",
      "Chiefs Player Emerges as Top Fantasy Pickup After Week 1 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This summary focuses on advice for fantasy football Week 1 lineups, specifically highlighting quarterbacks to start or avoid. It also mentions the Tennessee Titans unveiling their Week 2 uniform and a situation involving a Chiefs player. However, the details on the Chiefs player's situation and the specifics about the Titans' uniform are not provided. The main takeaway is guidance for fantasy football participants on quarterback selections for their upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes EU Tariffs on China, India Over Russia Oil Buys",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 08:42:46 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "U.S. President Donald Trump has asked the European Union to hit China and India with tariffs of up to 100% over the countries' Russia oil purchases.",
      "<p>In effort to end Russia’s war in Ukraine, US president reportedly proposes tariffs of up to 100% targeting Putin allies and trade partners</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business liv"
    ],
    "image_url": "",
    "titles": [
      "Trump presses European Union to impose 100% tariffs on India and China to pressure Putin",
      "Trump reportedly asks EU to impose 100% tariffs on India and China"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. President Donald Trump has proposed the European Union impose tariffs of up to 100% on China and India due to their oil purchases from Russia. This measure aims to pressure Russia to end its war in Ukraine by targeting its allies and major trade partners.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zoox Begins Free Robotaxi Rides in Select Las Vegas Locations",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 14:10:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Amazon's Zoox robotaxi unit is offering free rides in Las Vegas from a few locations, with plans to expand in the city.",
      "But it's not quite a commercial service just yet. These rides are free — for now."
    ],
    "image_url": "",
    "titles": [
      "Amazon's Zoox jumps into U.S. robotaxi race with Las Vegas launch",
      "Zoox opens its Las Vegas robotaxi service to the public"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's Zoox robotaxi unit has started offering free rides in Las Vegas at select locations, with intentions to broaden its service in the city. While currently not a commercial operation, these complimentary rides mark the beginning of its service expansion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Novo Nordisk to Cut 9,000 Jobs, Focus on Obesity, Diabetes Meds",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 12:27:57 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Novo Nordisk, which produces Wegovy and Ozempic, said roughly 9,000 roles would be cut, with 5,000 of these reductions expected in Denmark.",
      "<p>Danish manufacturer of weight-loss and diabetes drugs under pressure from US rival Eli Lilly </p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business live – latest news</a></p></li></ul><p>The Danis"
    ],
    "image_url": "",
    "titles": [
      "Wegovy-maker Novo Nordisk to cut around 9,000 jobs",
      "Wegovy maker Novo Nordisk to cut 9,000 jobs amid increased competition"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Novo Nordisk, a Danish pharmaceutical company, announced it will cut 9,000 jobs, with 5,000 of these in Denmark, to focus on growth in obesity and diabetes medications. This move comes as the company faces competition from US rival Eli Lilly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone 17 and AirPods Pro 3 at Event",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T11:10:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Apple announced the iPhone 17 at its \"Awe dropping\" event held yesterday. They won't be available to preorder until Friday, September 12th, but you may already be contemplating an upgrade. It's easier to tell some of what makes the iPhone 17 different (like the larger screen and new colors), but cha",
      "The iPhone Air may have been the star of the show, but Apple also announced a new pair of AirPods at its \"Awe dropping\" event on September 9th. The AirPods Pro 3 arrive three years after the second-generation model, which received a minor update in 2023 with a USB-C charging case and dust resistance"
    ],
    "image_url": "",
    "titles": [
      "How Apple’s new iPhone 17 compares to the last-gen iPhone 16",
      "How the new AirPods Pro compare to the rest of Apple’s AirPods lineup"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.976,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple unveiled the iPhone 17 and AirPods Pro 3 at its \"Awe dropping\" event on September 9th. The iPhone 17, notable for its larger screen and new colors, will be available for preorder on September 12th. Additionally, the AirPods Pro 3, launching three years after their predecessors, were introduced with updates including a USB-C charging case and dust resistance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]