[
  {
    "title": "Federal Judge Resumes EV Charger Program; Trump Admin Embraces Crypto",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 01:12:19 -0400",
    "source": "NPR",
    "sources": [
      "Investopedia",
      "NPR",
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The action lays bare the administration's attempt to exert its will over immigration enforcement, and a growing anger at federal judges who have blocked executive branch actions they see as lawless.",
      "The Trump administration is ordering Fannie Mae and Freddie Mac to formally consider cryptocurrency as an asset in single-family mortgage loan risk assessments.",
      "<figure><img alt=\"Kayla Bartkowski / Getty Images FHFA Director William Pulte directed Fannie Mae and Freddie Mac to draw up suggestions on how lenders could include cryptocurrency holdings when considering a borrowers' assets.\" src=\"https://www.investopedia.com/thmb/fsvwz_6wct98oWq6K_zEJXQvo9s=/fil",
      "Bitcoin's price rose on Wednesday as markets stayed in rally mode, the Fed chair talked stablecoin, and a key housing regulator mortgages may consider crypto.",
      "\"This lawsuit involves yet another regrettable example of the unlawful use of equitable powers to restrain the Executive,\" the lawsuit reads.",
      "Congress designated money for building new EV chargers, but the Trump administration put a freeze on those funds. A federal judge issued a preliminary injunction ordering the program to resume."
    ],
    "image_url": "",
    "titles": [
      "Trump administration sues all of Maryland's federal judges over deportation order",
      "Trump administration moves to count crypto as a federal mortgage asset",
      "Federal Regulator Opens Doors to Considering Crypto in Mortgage Applications",
      "Bitcoin rises, NYSE battles for Trump ETF, and crypto may be coming to mortgage next",
      "DOJ sues entire Maryland federal judiciary over immigration policy",
      "Judge orders Trump administration to resume distributing money for EV chargers"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.94,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.876,
    "summary": "A federal judge ordered the resumption of a program for building new EV chargers, previously frozen by the Trump administration. Additionally, the Trump administration directed Fannie Mae and Freddie Mac to consider cryptocurrency as an asset for mortgage loan assessments, a move reflected in Bitcoin's price increase amid market rallies and discussions on stablecoin by the Fed chair. Meanwhile, the Trump administration accused Maryland federal judges of 'judicial overreach' in immigration orders.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about important developments in the EV charger program and the U.S. government's stance on cryptocurrency. It provides useful context about the potential impacts of these decisions. However, it does not delve into the specifics of the EV charger program or the potential implications of recognizing cryptocurrency as an asset for mortgage loan assessments."
  },
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 23:44:44 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Financial Times",
      "LA Times",
      "Global News",
      "CBC News",
      "Yahoo Sports",
      "CBC",
      "Deutsche Welle",
      "Bloomberg",
      "CBS Sports",
      "Sports Illustrated",
      "New York Times",
      "CNBC",
      "The Guardian",
      "Forbes",
      "Bleacher Report",
      "Axios",
      "Washington Post",
      "Sportsnet",
      "BBC",
      "NHL",
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "business",
      "sports",
      "general"
    ],
    "snippets": [
      "At a Nato summit, President Trump again maintains the raid \"obliterated\" Iran's nuclear facilities.",
      "An earlier U.S. intelligence assessment reportedly found the attacks only set the program back by a few months.",
      "The assertion comes as questions swirl about how effective the U.S. and Israeli strikes were.",
      "<img alt=\"a man in a suit points\" height=\"349\" src=\"https://i.cbc.ca/ais/f00753e0-734f-45f4-9f4e-5730f17e3562,1750895070662/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3BResize%3D%28620%29\" title=\"U.S. President Donald Trump closed the NATO summit by praising his own interventi",
      "Donald Trump said the US and Iran will hold talks next week but he doesn’t care about signing an agreement.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMEtwa0NEa0FhMjRZR3gzaThZWHNpdlBqRTMxNGc1akVWNktab2lEdjl2ODNUOXd2TkhmbFBnY2NYZkM5NjZiMHNJSkpXcjBiOFVBOWlrdzZldmh2SWxlWGVtV0tDSGhCUDhQclVLc1l3TU81RU43UzMtbjF0eXpMeUUzR0FqOUtj?oc=5\" target=\"_blank\">Trump Says US to Meet Iran Next Week, Putin",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxPLUhobmJMajFXaFpTTGV0NjJqZEpCS2d5NnJEdDZNcC00RGRvQlJrMjBVR1hMT3BkTkxwb1NkaTg5OFF6eW03b2k3Ym9ORjU0NHNWLUhxMWFlLTkwMUxqYnBYR2c5YlBLVTA0am1HajQ4RnZjUm1sWmFBdFk4cUJ1TVRQZ0dJSWdacXNRTjRsZi1vdm9ZZ2ZlRFVFUmpQTFk?oc=5\" target=\"_blank\">Oil Climbs a",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9kZ3NhQXdJLVRvWGtLNmZzYkRqTElpY1MwbDZrdkxMeTNfV1pVUUZneXhXcHBNOGRTNFYtSjRLTEJmNEVjWWtSdDJCeWllYW1vNmtyZ3VhZkZpajJEYnhaWGF6b0o4dEw0dE1XUmtJQ1djUDEzVlRrU0N1Zw?oc=5\" target=\"_blank\">Trump claims U.S. and Iran will hold meeting next week</a>&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBEZGV6ZnUydTQwNmpfN2kxbjJEVng0U3BISHRjNkg4MklfTk44SmllNVotTTNzSVB5VmhOVnZ0YmtMcHpsa1J5TjgwTjIyX2lYU1czcjUxcXExT2ZQQjA5bUw1X0RHeG1BMTgtVWw3bGQySDhGMGxkZElPUFA?oc=5\" target=\"_blank\">Trump assails Spain over NATO defense spending target</a>&nb",
      "President Trump has pressed allies to spend more on defense. Leaders agreed that “allies” — but not “all allies” — would meet the objective.",
      "President Trump has long pushed the European allies to be more self-sufficient on defense, relying less on American protection. NATO committed to a major increase over the next decade.",
      "U.S. President Donald Trump has been exercising pressure for NATO allies to increase their defense spending across both of his terms in office.",
      "Many member countries would have to double defense spending by 2035 to meet new targets, charts show.",
      "US President Donald Trump hailed the agreed spending hike as a \"monumental\" victory. NATO member states also expressed \"enduring\" support for Ukraine.",
      "<img alt=\"Prime Minister Mark Carney shown sitting at a long table with other NATO leaders. \" height=\"349\" src=\"https://i.cbc.ca/1.7570193.1750867529!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/carney-europe-20250625.JPG\" title=\"Prime Minister Mark Carney, middle, takes part in a meeting",
      "\"We're negotiating with Spain on a trade deal and we're going to make them pay twice as much,\" Trump said after the country refused to meet the spending target.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPa05mU0Mwek1KdlZJbl9DRkhZMnlreU1fcF8zaHdaWlNjUUN6SDlaajZ0bmFKaEJGaDRkNFRVNFVQNlpjbzg1dDZZMndLNlFBLVNYZFJZVFA0aHRBbHdFcVptRmt3bUhCNk5ndjhCUkh6cTM1d3MtVUE4cjZvZ05ib1FvVzZIYjZ4cHow?oc=5\" target=\"_blank\">Democrats rage as Trump limits classifi",
      "The Trump administration is planning to limit classified information shared with Congress, sources familiar with the matter told ABC News.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE0ydFo4RV9zN2R0Mkc3MjFESnBuTGFNRkdidGtITTRwcERaQ3E2TE1BSVNPelV4dDVsSTVoWEtYdU5jUWpLeU1vSHFhUzBGUFVkUzBPdF9HZkFpTlpjbVU2d0swanVOLXBBNnc4Um9oQmdCa1JuRDNQSG1qNENra28?oc=5\" target=\"_blank\">Scoop: Trump admin cuts contracts with scientific publis",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNTDRaZ0plemU5SXVDWHlRMWNjOG1hWndYR2ZFeWZ6b296c2RIZGlGNXdWY1RFcy04bFhlcE43eGhxZy1zMlNjSVpVdldNaXdlUnF6Y2xUME5BQnJ4REctMWIycFF4TDBjWTBzZW1BN3hIVEhsbzBBWUpNQmFzZklrV2Vn?oc=5\" target=\"_blank\">Scoop: Trump hosting \"everyday Americans\" to squeez",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFB1R0dOOXIwdUJPblFuZHotQVRsNTBaYllFZzB4YURhVVVmV29mSjlPTFB0Y0VGN0NFbG1TS0VrOWFzekh2UzNTNU5vUk93Qm0tMDFCWUlYa09tbkNsU1cwMzQwWWJqQ2piN0NGdWdpUEJrNzdVVVg5RWdpTEZmQQ?oc=5\" target=\"_blank\">Scoop: Trump to limit sharing classified info with Congre",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9CODVHeDhYblhSS004OHFtYWhGTlp3d0c1VW5vOS1yeFFtRjMxcVBHaFdvWFlJcU9zV1NXR1lBWkpNQ1psOEc2ZDZzbUN1NzFabWlOTXkxeXYyVVdIVUw3VUNfMzlZQjdVSE9ZSktUdDdJSTdGM1Nz?oc=5\" target=\"_blank\">Trump slings insults at Mamdani, other Democrats after NYC primary<",
      "<img alt=\"A man with a beard wearing a suit stands behind a podium with right hand over his heart.\" height=\"349\" src=\"https://i.cbc.ca/1.7570154.1750827787!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/election-2025-nyc-mayor.jpg\" title=\"Democratic mayoral candidate Zohran Mamdani takes th",
      "His potential victory could bring what the Street despises the most — tax hikes and tighter regulation that threaten corporate and investment interests.",
      "<p>Too many Democratic party leaders would rather be the captains on a sinking Titanic than change course</p><p>The Democratic party is at a crossroads.</p><p>It can continue to push policies that maintain a broken and rigged economic and political system and ignore the pain of the 60% of Americans ",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOOW1oVnk5MDlXM3MwRWhYN205U3BIWXFudVpNejJWMW5lUlZrRXpPaUE2ekRvLWk2X2ZOM3lJbUFyY0tnc0VwNUlMamFNR29RQmg1R2F5ZkNuaXlnWHRMeWF5WkZUQ0J1X0RPSmFldzV4Y3lILWw3TmRiU0N0OVM1dzU5aGJtbExUakE?oc=5\" target=\"_blank\">Zohran Mamdani's campaign was a perfect ",
      "Zohran Mamdani won New York&#039;s primary race because of his support for Palestine, not in spite of it, progressives say.",
      "Cuomo and other Democrats mocked Mamdani's policies - free public buses and city-run grocery shops - as unrealistic.",
      "<p>This blog has now closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/jun/25/zohran-mamdani-nyc-mayor-election-democrats\">here</a></p><p>As the <strong>Democratic</strong> party fights to rebuild from a devastating election defeat, the abrupt exit of the presidents of ",
      "Financiers plot to back a moderate after leftwing candidate clinches Democratic candidacy",
      "A rent freeze could lower the value of Flagstar's multi-family housing loans, though the extent of the potential impact is unclear.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOdWtpeW8zbURBRjZtWl96UTFtY1N3VHhXSUpOT1ZjMnhXQXFXNVl4UVJOXzF5ME9vV18zNkZoazhHSHo5NGtraVZjaFBkcEZPS3Blb3g4ampuTG9mNDIydXRIdGRyakFWT1hiSkl2OTVhWGNvWUNvQ3lJM3JIUDVtZXJ1cEdaSnJHaEc0RXpza1hZR05RRVpqLQ?oc=5\" target=\"_blank\">Andrew Cuomo concedes",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE14dS1RcjZYR1hfLXV5LXE2elhNSTh2SkNmeEdDdmRhYUdRRzUwVUVNbzJZQnBJUW81YTJ0dDJBZzNZOXBoOXQtNnlqT3E0bUVZSDVOanJmNXZ6QkhqZlhNcnVhWjlRLUl5WUVOYkxua0lGSC1nZHcwTE56M2o?oc=5\" target=\"_blank\">MAGA erupts with Islamophobic attacks on Zohran Mamdani</a>&",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9wRWtFVTA1Mnc5cHFqdUU3c1V3RVJ2Zmw5XzlzNktaWmd3U2l5M3Bhc1VaX3hQWTFyZV8wU213N0gybGdZdTRFcVN3d1dJb0ZjVEFnZXZ5cWdvYzZqTnJfMUNKVDU4RUxWOGVIeHd5Qy1qVGcydWhSV1QtcjZ3SHM?oc=5\" target=\"_blank\">Who is Zohran Mamdani, NYC's Democratic mayoral nominee<",
      "Zohran Mamdani’s win in New York City’s Democratic mayoral primary over ex-Gov. Andrew Cuomo has rocked city politics.",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE00dkhRS1pha3lRb1F4V3FaenpsbDlRN25DZ3JfQ3hCaUE5eTNNZzNtYUZLRWVCN1lEUW04ZUtzc3Z6ZGVDNU9YT3dUaGJpX04xOTJMVEFkR1JrcFNYVHdrUUZWUl95VndzT0w4?oc=5\" target=\"_blank\">Zohran Mamdani has NYC's business community \"terrified\"</a>&nbsp;&nbsp;<font color=",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOdFlTU0NFUFVvVXJBLWQ1aEFGU3pRdkxlenVNMUNfTjRrUUdiRkprZUFGaUxodXFMTmxYeHVPclhlMGVDU3I4VUpoRXV2bHpmTVlSNWpaRXliTFJubVFMdnNCbURxMlN4b3ZjWUIyVFZGT05xU2pLX1RoY245a09EYg?oc=5\" target=\"_blank\">\"There's a lot of anxiety\": Mamdani's win has some De",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQa0ZQWGVQcWFWcmVIVUpVMXRlNUExdUl4U3NiYlJHM2trN05OXzlLUzJZaFQwa1B4c1lpaUNYUG1naGhJc2lNN0hKaHlKaUVxOW5SZGNOTy1GMVpUajY4OTRTVHpZdmpUZVBuaGhZd1RPVEh2dExKdjhWQnpPYTNwYQ?oc=5\" target=\"_blank\">\"Leaks are a problem\": Congress feuds over Trump limi",
      "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQWUxZLUxSLVluaFpOWEdvX0lxak8zS2JPVlpsYkdBeDh6cVN6YURIT1hTRmdPNWxzRTVoMEgxT1FPRFdJR0tRbE16LW80d25WV0gxRFB6REhrbDFZV296d0Zibm0zWEhSZG1LcldVSVV2OXhOdVZ3RG44UlEtQTFkWmhB?oc=5\" target=\"_blank\">Trump wages all-out fight for control of Iran strik",
      "Plus, the importance of baby talk.",
      "Potential talks between the U.S. and Iran.",
      "<p>In today’s newsletter: No 10 was expecting a handful of MPs to rebel against the controversial bill – but the number supporting an amendment to the bill could lead to a decisive defeat</p><p>Good morning. Last week, Downing Street was bracing for a painful rebellion of up to 50 MPs on the welfare",
      "Before the music starts, an indescribable atmosphere descends on Glastonbury. Ros Atkins finds out more.",
      "Satellite images show misfires in Jewish state and damage to Iranian nuclear sites as foes emerge from conflict",
      "Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to turning highly enriched nuclear fuel into a working bomb. He railed against a less optimistic U.S. intelligence report.",
      "President Trump said discussions with Iran would take place next week as top administration officials forcefully pushed back on questions about the effectiveness of U.S. airstrikes.",
      "President Donald Trump attempted to dismiss U.S. intelligence reports on the attack on Iranian nuclear facilities claiming such rhetoric allegedly devalued the military.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQUnA5Ty1ldk1xVmhUdFk3Nk9pcDNjUnU5TFp2aHBsWXNmY0FMUnR2Q1dYNGRNV241UHowandwckZWSHgtaVlGRGREQTY1UTVMMUZoRlN0TnVaUnZDUzEwZzB6OTBTMHE2YkR0cG1GSlNKM2JXZVRpbzNETGVhRXR6TWwyVjdtYmc?oc=5\" target=\"_blank\">Israeli intelligence sees \"significant\" dama",
      "Core components of Iran’s nuclear effort were damaged but not destroyed by U.S. airstrikes on three key facilities, say people familiar with a Defense Intelligence Agency initial assessment.",
      "<p>US administration hits back at leaked intelligence report suggesting strikes on Iran’s nuclear facilities only set programme back by a few months</p><p>In the latest episode of the Guardian’s Today in Focus podcast, published on Thursday, Michael Safi hears how Iranians’ relationship with the reg",
      "<p>Tulsi Gabbard and the CIA director say Iran’s nuclear sites were ‘destroyed’, amid reports of White House efforts to limit sharing of classified information with Congress</p><p>Donald Trump’s administration ratcheted up its defence of the US’s weekend attacks on Iran, citing “new intelligence” to",
      "<p>Want to get this in your inbox every weekday? <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl&amp;CMP=au_sfl\">Sign up for the Afternoon Update here</a>, and start your day with <a href=\"",
      "24/7 coverage of breaking news and live events",
      "The latest buzz ahead of the NBA offseason from our NBA insiders.",
      "<p>The 2025 class of impending restricted free agents offers a little bit of everything enticing. Luke Fox takes a look at the latest buzz surrounding the top names on the list.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPYmE5Ni1yaC1yYjRIWE9LaWh4OWdOVUszYzFzX29Yd0pMZzZaaFAzSHM5VUFhR19ZZ3RwQi15N2M4YlZlbXA0bEdqUHVmX3A3a1ZENUd3Q1A5M0NUbHRLclFJSURlXzhnX3FsZS10bXFMazlYRHE4b3o4a1VsanZBZTVpeFRHcjhLMmdJR3F5OA?oc=5\" target=\"_blank\">NBA Trade Tracker: Latest Deals, ",
      "<p>The newest group of young basketball stars are ready to be ushered into the NBA. Follow every pick made with our NBA Draft tracker. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQb0hQM05HTUt1N1ZYaDExRWpUdE10YVZKMFhrVmJEX1ZWM1B5dVZScXBNQm0yamFTbTN1Zkxsd19FT3c1ZWM4MktsZ3g4OWpkRU9EcTc4UXVLSEJfeU1jUmhDNi1qUXBjSUx0M3pnTVFiMVJ3UG5lZ2RFSWJXUVNlaFg0VGxPUnVTTW40bExB?oc=5\" target=\"_blank\">2025 NBA Draft Grades for Every Rou",
      "A nod to the past for England's home shirt with a vibrant red and blue print across the chest, while the away jersey features a more modern design.  Designer Klaus Haapaniemi collaborated on Finland's new kits, which pay homage to \"national romanticism, nature, and the curved lines of Art Nouveau ar",
      "How did the Phoenix Suns do in the first round of the 2025 NBA Draft?",
      "<p>With the NHL Draft closing in, prospect expert Sam Cosentino shares how he thinks the first round will play out on Friday night.</p>",
      "Our NFL Nation reporters dish out intel on all 32 first-round picks from the 2025 draft.",
      "The Oklahoma City Thunder used the No. 15 overall pick in the 2025 NBA Draft to select Thomas Sorber.",
      "New Orleans bets on the now, Ace Bailey finds a mountain home, Phoenix needed one big man and got two, Brooklyn used all five of its picks, including riser Egor Demin.",
      "Who are the best players still on the board -- and where could they go? We project the draft's next 29 picks.",
      "Pat Riley took a big swing.",
      "&quot;This is a dream come true regardless of the number where I was picked,&quot; McNeeley told ESPN. He's one of four players going in the first round from Florida's Montverde Academy, including Cooper Flagg, Derik Queen, and Asa Newell",
      "Chinese basketball star Yang Hansen turned 20 on Thursday, but the best birthday gift he could ask for arrived a day earlier: putting on the NBA draft cap after being picked in the first round.",
      "How did the Oklahoma City Thunder do in the first round of the 2025 NBA Draft?",
      "How did the Sacramento Kings do in the first round of the 2025 NBA Draft?",
      "With one round down and one to go, we take one final stab at a mock draft with projections for the final 29 picks on Thursday",
      "Duke had three players in the top 10, and the Big Ten had eight players picked on Wednesday night",
      "Duke’s freshman phenom went No. 1 and can earn nearly $14 million next season—not including endorsements. It could be the beginning of a billion-dollar career for the 18-year-old.",
      "The Dallas Mavericks selected Cooper Flagg with the No. 1 pick in Wednesday's NBA draft. Flagg is among the top prospects to enter the league in the past 40 years.",
      "Flagg will go from wearing No. 2 at Duke to No. 32 in Dallas",
      "<p>Cooper Flagg, the consensus No. 1 overall selection, has been drafted first overall by the Mavericks at the 2025 NBA Draft in Brooklyn on Wednesday.</p>",
      "College star Cooper Flagg becomes the second-youngest player to be selected first in NBA draft history - behind only LeBron James.",
      "The Mavs made it official on Wednesday night: Flagg is heading to Dallas",
      "The first round of the 2025 NBA Draft featured some major surprises and some questionable decisions",
      "The Nets were widely expected to make a trade or two but instead made some history",
      "Our ESPN draft insiders break down the twists, turns and trades of Wednesday's first round.",
      "Hawks fans seem to be excited about the team's new draft pick.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1iN3hnNlE5Q3gyc194M25tUFluWWEwUmxQMHozSVR6X09acEJGN0M3dzN3b0U4eEhpTVJ3bHFIR05nMWhjU1RQM1J5LXRnaTR2aFJYVEhqZFExUzgyRGcySzhfTjhpVmZfY3NUNWVMTGFSbm5mZ1E?oc=5\" target=\"_blank\">Kane traded to Canucks by Oilers for draft pick</a>&nbsp;&nbsp;<font",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE0xUjB6cjgwa2daV2JlVjU0LWRmS1NkVzh3VWlYQUxaVWxKMXlXNUFSdHJET1RQWVM0WkdXcEVqZklITENBc1lSVnFmOUYtYnVkejhHQ2cyMFFsRkEtOU5jWDZvbXl1WEZmTWc?oc=5\" target=\"_blank\">Draft Prep: Top Prospects</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL.com</font>",
      "Saskatchewan's top draft-eligible prospects Roger McQueen &#38; Cole Reschny are both expected to be first round picks at the 2025 NHL Draft in Los Angeles.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNdVZuODZVUGNCNVN6bi1lSEVQMzUyT29QZ1JhdzM0ODFGVDRUbkRPRFN4eENBajZBZWlqWjRxNzRVakZveFhSeU95LU9QSWROYXZSRDFvczBMWTB6VkFSZzhIWWpxd1luWTg0R1hORFFNTElaN2ptbkdYRk5RVEVWazdSMnMzYVhSNVZj?oc=5\" target=\"_blank\">CANUCKS ACQUIRE FORWARD EVANDER KANE FR",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVzhZbTFUdTUtUmk0aV9BUmtMVDNBTXhXeF9zeVA3NEFObURuSmR3TnhwTlg3V2dyMU5FWm1LUlhibEstLUJEOFpaajJkd2hQaXNPVmQtTGFPSmJtN2xZMEU0OGtXUHlGV0E0WnhadlNBNXZMMmR5RWVJSXZjTXVlLU1HMjByT2VM?oc=5\" target=\"_blank\">RELEASE: Oilers acquire pick from Canucks f",
      "<p>Vancouver Canucks general manager Patrik Allvin discusses the organization&#8217;s decision to acquire veteran forward Evander Kane and what kind of impact he feels Kane will bring to the team on the ice.</p>",
      "<p>Vancouver Canucks general manager Patrik Allvin discusses Evander Kane&#8217;s potential character issues and remains hopeful that he can positively influence the team&#8217;s culture on and off the ice.</p>",
      "<p>Sportsnet’s Jason Bukala joins Kyper and Bourne to discuss the Vancouver Canucks acquiring Evander Kane from the Edmonton Oilers for a 2025 fourth-round pick, and whether he’ll fit in with his new team.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE90QzhBT3pBdUNNcXZMWGJsMVlSWDRRVnM4bENYR0lSREdia0YyQTUyV2stTVBqS0tROVcxeEo2RW9CQmdSZ3I1LWlGNUVKRHhaT3dHZTRpdWlQS09jWlo3NVpPcF9OTDE3aVBSX3p1d2dXalpYN0loWHR0eTI?oc=5\" target=\"_blank\">Peterka traded to Mammoth by Sabres for Kesselring, Doan</a>",
      "<p>The Utah Mammoth are set to add another young forward to their group as their rebuild continues. </p>",
      "Dylan Harper's mom stole the NBA Draft spotlight.",
      "From the no-brainer to the wild cards to those in between, here are eight prospects who caught Jay Bilas' eye.",
      "The 2025 NBA Draft wraps up Thursday with the final 29 picks",
      "Each team will have plenty of decisions to make when free agency opens on June 30",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNVWI4R0kySUFDUGNwVnc5eUJiT3QxTGE1SkszejVfTWtTR1doNWcyaXd5YmFPdWJfWHUwdU5mVVY1Vnl0MVNsWnloVi1LcnQ5RUwzOFU3c29ibURxSVhhQWxGQ0tzaEFqaXlWUktyaGhSSFBTS29TeWctck1naGRCS2JMQmhHQUw2cHR2aG5aQ1VqVjNlZnc?oc=5\" target=\"_blank\">Pittsburgh Steelers Read",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1BbXp3RGlxTmw1QTlJaWZwSmg5VUdTMXM1UlRSRjZ1SkFXSmF0ZzJSQ0Z2SG42WlJrU1VjRzhiWTdjOUhqaG9zTWpfdXd1ZERqUV9qZlh1ajRjOER6MEVoSlR0Z1NBeWFSOV9hSlhQVG8tUi1SeUJQRkdoQQ?oc=5\" target=\"_blank\">‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chi",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPNnQ1Ym1sMHJ3bWhDZ05ITE1LS1NoRHBEa1BhTEw5dFg1WVNDS3NGRFl4ZEozMmVPVTk4YXpYbkFoaEQwVjB3UVpuWHhMeDFwVnpRZGRieFNFRVVtRjdiNERlN2RlYWsxcWZ3VXFQUEthakpRc09mbWF4cDFwbVRDV2xad0tnSXZHZXNtbQ?oc=5\" target=\"_blank\">‘Final Detail’—Cristiano Ronaldo on V",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1VY3pvYUV2SHpxZ2FlbW11UmhoX0NaaWtoZUZRcXU3VFpMQk5paWtwd1JzZzF0QlBnbnNWNVVnMWxxeFV2bEE2WG5EaE1zVkw1akVJUXdxZWJaVTc5VWdHeG5uQlViamdNaTk0a3ZTTVlibVVuRldB?oc=5\" target=\"_blank\">Jadon Sancho: Two European Clubs ‘Enquire’ About Man Utd Misfit</a>",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9ENFlJdnpPbkpKYkVLMTJaOVVtQjhDSlQ4SXZVTkdGUFhLMnZoRWFjWWdZWm03SUhsV2VJUXFPNVRLelZzblFCUnRtR0hjcUZ1TjVDcFRlcWs0UGtFdGp6RkxHcHdMcTVKTnFpSENFU0dCUQ?oc=5\" target=\"_blank\">Every 2024–25 Premier League VAR Error: Man Utd’s Season Swung on Officia",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1qN2pBcVdaTDJfa2NpdUpObFhpdVVKYV9kZENYSlJtU1RLN3NVRHdSbTRZbVlBNzdFN2tXcHFqM1VvdnFTZ0Nxa2d6alVxTVE4eWhWX0pOVFFCMENlc1FTUUo2OVRLM0lCUlFpVnIwOXB6SjA?oc=5\" target=\"_blank\">Chelsea’s Route to 2025 Club World Cup Final: Major Conflict of Interest",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPd3hLR1AyYk5CcEU5TFNWcjFKdTE4dzRHeUIxTlVTYnpKd2FUcjRXNFBycEp1bG15MVF0MTVuQUxKaWdXLXVtV1NRVzl5N2Q3QXBSdVFkUkFfc1oxRlI3WDdIYzhxaGd0bHNCdmtGdUt0bWpTRVkzU3NEbVVMVXotb19sbGJPTW54a1ZxOEJWcjViS2hXTUQ5dGNn?oc=5\" target=\"_blank\">Alex Caruso Had One",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxQTldmTVRWcWNUZXlKdkxkcTlIMzEzQzJQTlRtUEVRWldKS3BMVnFVN3NGMlVBQWFVYTE4Vnc2NVloVWo3WUViZFRZbWdYcU5zdWRYbW91bks2NXVYckU1d2NPZi1neGRqN25EcXF3MktiNEk0bTlHb0V5dmkzUEh4STh5T3RDQTdjM2JEZHJGUmF4cWF6UG80WmU5Z28?oc=5\" target=\"_blank\">Lee Corso's Son ",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQVzN4NVN1VGxEaHJ0V0ZETUlBbzN5Q0pMMG42SUtHQWxSNUN2OTFKdXVSMzdjcG83UzAxTlpLbjcwZENiUkhEVVoxVkhxbm9yYjdaUC1VVUhuVmdTUHRVYWliTDEwazZDY0VPSnpUT3RDWGZEdmo2dmhXRlRlQjVMbF91bXZNa0IxcjJleVh4X21STU0?oc=5\" target=\"_blank\">NHL Weighing Major Change to",
      "The NHL previously constructed 84-game schedules from 1992-94",
      "An increase over the NHL's current 82-game schedule has been discussed internally by the league, and the topic is part of negotiations with the players' union for the new CBA, sources told ESPN.",
      "Highlights of the day 🔥Women's Friendly3:15pm – Belgium vs Greece – Disney+  Club World Cup4:00pm – Juventus vs Manchester City – Globo, SporTV, YT (CazeTV) and DAZN 4:00pm – Wydad vs Al-...",
      "<p>Fluminense held the Mamelodi Sundowns to a scoreless draw on Wednesday, denying the South African club the win they needed to advance to the knockout round at the Club World Cup.</p>",
      "Here's what you need to know from Wednesday's Club World Cup action.",
      "<ul><li><p>Italian club progress to knockout round with 2-0 win</p></li><li><p>Fluminense complete a full Brazilian contingent in round of 16</p></li></ul><p>Inter Milan scored twice in the last 18 minutes to beat River Plate 2-0 and progress to the knockout stage of the Club World Cup as Group E wi",
      "SportsLine's Brandt Sutton reveals his soccer picks for the 2025 FIFA Club World Cup group stage match between Inter Milan vs. River Plate",
      "Weston McKennie and Juve look to win the group when they face Man City on Thursday",
      "We’ve got two football betting tips for the Group G decider at the Club World Cup in Orlando on Thursday",
      "<ul><li><p>Manager expecting Florida heat to disrupt team’s rhythm</p></li><li><p>Injured Claudio Echeverri out for rest of tournament</p></li></ul><p>Pep Guardiola says that Manchester City “will have to suffer” against Juventus in the heat at Orlando’s Camping World Stadium, with the conditions di",
      "Manchester City boss Pep Guardiola says they \"have to be ready to suffer\" the heat  in Florida when they face Juventus on Thursday.  It is expected to be around 33 degrees Celsius for the game at Camping World Stadium - a stark contrast to the British climate that City are used to experiencing.  \"I'",
      "The USWNT return to the pitch on Thursday night in Colorado",
      "We're heading into the knockout rounds of the 2025 Club World Cup as the field of 32 splits in half this week. With updated odds and projections, here's why every remaining team will or won't win this thing.",
      "The Frenchman was hospitalized early on and has yet to play, and he won't be featuring on Thursday",
      "Both sides are favorites to reach the round of 16 at the Club World Cup",
      "Real Madrid meet Red Bull Salzburg in Philadelphia in the final Group H match at the FIFA Club World Cup.",
      "<p>FIFA has opened a disciplinary case at the Club World Cup after Real Madrid defender Antonio Rüdiger claimed he was racially abused by Pachuca captain Gustavo Cabral.</p>",
      "Inter Milan scored twice in the last 18 minutes to beat River Plate 2-0 on Wednesday and progress to the knockout stage of the Club World Cup as Group E winners and send the Argentines home.",
      "Inter Milan overcame River Plate 2-0 in a heated clash, while Monterrey thumped Urawa Reds 4-0 to enter the knockouts.",
      "<p>Daniel Svensson scored in the 36th minute to lead Borussia Dortmund over Ulsan 1-0 on Wednesday and into the second round of the Club World Cup.</p>",
      "Borussia Dortmund secured their place in the last 16 of the FIFA Club World Cup with a 1-0 win against Ulsan HD on Wednesday night. Speaking after their narrow victory, Sebastian Kehl remains confiden...",
      "After two impressive performances against Real Madrid and Red Bull Salzburg, Al Hilal’s fate at the FIFA Club World Cup 2025 will be decided in their third group clash against Mexico’s CF Pachuca....",
      "Monterrey advanced to the knockout rounds of the Club World Cup with a thumping 4-0 win over Urawa Red Diamonds at the Rose Bowl on Wednesday, setting up a last 16 meeting with Borussia Dortmund.",
      "It's Thursday, and June is heading into its final stretch. Summer is already here, and that means preparing the details for the new season. And at FC Barcelona, all eyes are on a move. Because the Bla...",
      "Manchester City take on Juventus in their final group stage game of the ongoing FIFA Club World Cup, targeting top spot and potentially a more favourable last-16 tie.It was the most dominant performan...",
      "Slow-paced matches, sweltering players and complaints about the heat have been the themes of the Club World Cup in the USA. Organizers FIFA say they take reasonable precautions but many see a major safety concern.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9TSE5XQkNfakxTXzRyRWFRbDNmeThvLUZYQ2picTlrd3BmMlJFeUVjRDlFWTV2UDlQcWptcUNVSDExbnZGbThrVkhZdVZBeHlxaFJRWmxyaTU3OUxoa1dZay0zYkZoeVEwUDV5TTNJbFlkeUFWWDVoQklhc1g?oc=5\" target=\"_blank\">Here's What to Know About Blazers' Surprise First-Round Pick",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQVFlNbmJGRmowSVF3ZlZ4NGowQWlPakkzQVRfeG0xRmJzdUlGVDBGZXBrc3JCeDk5UE1FX2ZaOW54X0ZxLW9VdnFOVHdXNFJhX1hrc0FvZU16S0EydDBpRFNsOUsxdXlGNzh4S1UxNlBPQmJnZHdzTmx3Q1o3R3lCTmxJdw?oc=5\" target=\"_blank\">Giants President Teases Long-Awaited Statue at Or",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPT3JOMVliaFVQbjZSRHJxdWVrNGc2NmhNM1pidk1kS051RnA3cHNWM05pSXF0QzJoRDM0RkpYczlSOTZlZFhlUU5tYjlYakFGTjdVeXNZNk5RbkRaMmtZS3JZS2tKLUo5YXZ6RGVVVEYxVXRTVnhwYTRLUk9rSGtFWDA3ekRLc3FjQ1E1Q0NfWQ?oc=5\" target=\"_blank\">Power Nine: Uncertainty for Jorda",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPMjZKMkxHRHNRWGdIeFYwQXMwMU9UczVOY196QXA4cU80N194SjVyYnJINXVwTXV3MHlnb1BlWG8wTzhIOVUtTWd6LWxXRXlLRjlyZl9IVVZleWVsNkhDdERDSkkydkNFUzNHWVJMaEVVUmpVejV4WEsteEJSTWY1WnhJOWZ1eXZHVXZrbFBWZWZ1dEZo?oc=5\" target=\"_blank\">Pac-12 Expected to Offer Te",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1yYnR3TXpKQXgxV2lseEFTcEtHQkN3OHNNbVQxS2lNanJsUVBrT3diSnFCR3U0WXlkcExGTUhtRURpRTh5SU8teXQ1bm1yamhRZlgxVHQ3eHlNb0NvQlM3Q1JiWmZkNFdQVDVnX2k2TTJMUS1iWi0w?oc=5\" target=\"_blank\">DeWanna Bonner Releases Statement After Rocky Fever Tenure Ends Wit",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNcmk2SlVqa3djZnA1MGJ6ZFh1VFFseW5uV2ZuUzNCOW9iWmZUbkhjN2d4eGNUYV8tSkhYRy15WVN4S2FSa1NOWjlUMV8weGFVdmNXeVBPTENFeWlRRVFSTWlXRFNLQlNxVHJFd3UxMkNESER0dGdpZWY3eHlsN18yRzN4cGNOdzA?oc=5\" target=\"_blank\">What Bob Devaney Saw in Tom Osborne</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBwYXNXVnE0aW1sbkFjOXVSR3hHamI4Q0hPZngtWFE5ZVZVNHBXZjd0anpETTNyc1ZMYmViVGdIQWVENnpsOGpSRVE5bUtoY3BuNnNSNWZkYXYzOUN0WVQ3d1VUOERaQmozZVZYY1RNZnNVbWFZYms4TUdrOA?oc=5\" target=\"_blank\">NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025</",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNejhlaHl5d0xqUGh3ajZnSUh2TUlDYVFtbW9IMXlhM25DVG9RbGMzc0RFSURuaGdGWVpxRjEyVEtRX0ZKVlNET3BBQ2lZbXhDVXNIbjZlOTZNZzhZSkViYkExdl9RUl9EcFE4bzdTSlprUjVDS2FfT0d3WVktekRXdXFfWVk2enhFSEk4SGE4RjNYMmJpeG9haUl1RFI?oc=5\" target=\"_blank\">Ranking the AFC ",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPUF9ZcjZ5QUVzcmppTFZBOE51UnZhREdYTVFfWk90aGFQNkVOU2NqZksxTUIxcGRUUTVQS1dWam9GbndmNVd3Y0E2ZmpOaWM2a09aeTVLb3VQZGxRYnNXMjh1aGJHQnU5bUZlcmhSMS1QVVVrZGwxSW5pbmEya3JsbkpvXzlCT0dMT19V?oc=5\" target=\"_blank\">32 Teams in 32 Days: Seahawks Can Win t",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFA0dDc0UzY1VG4yOS1rQmZNa1VOYUFUNXpMOVEyR2RxUmp3MHA5Ni11VFp0cndPWS1tcGRaQkJ3b19TUm5VUUZVMFRuSFBMc0J0dEF1ZEFoM0s5TklTeEsyNG1RaFlreXBUb1lDVmE4X2pvZ1RPaEFNWWtIMVI?oc=5\" target=\"_blank\">Why Arch Manning's Biggest Quarterback Influences Aren't Unc",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFBDX2dUdk56VGh4clBvQnQ4RDVROG00aUYwSEhxTmg1Q0dqNXdhMFFuNWFsUl9iTmlMSW1BcXFERmpadGNHZEQxWXlGcTNqcWhLVGhpUDFRMXE4d0hMYkRTQVdvR0E2VWdKS3BKaHBJSjBHRUNPc255NlVKdHFsZEU?oc=5\" target=\"_blank\">Spurs, Pacers Agree to Trade Ahead of 2025 NBA Draft</a>",
      "The Indiana Pacers agreed to trade a 2030 second-round pick to the San Antonio Spurs along with cash considerations for the 38th pick in the 2025 NBA Draft.",
      "After the first round of the 2025 NBA draft, Sixers president Daryl Morey revealed why they took Baylor guard VJ Edgecombe at No. 3 instead of Rutgers forward Ace Bailey.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxObktRWTZ5UV9IaDJtclhNUl9YWFdTem1VbGtLMEV5R3VaR2tVQkQwdVd2dlJrTjBFdXRkS3d2RmZhcGh2VU50ZXNYUkd1dDc4a05UNXo2bXd0WnBRcUx4SVFhek9QWXh1T0tsTjNOeExFcTROTkVQVzZoRkVvTk5xTXZXLUhEbTd3YzAwRmtYMlJtTGF0OU56bw?oc=5\" target=\"_blank\">Three Gophers selecte",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQbkdKakNDNDR0VXo2bmVrVFl5YkFINXlvN3ZHcTF1SGpxWFVybllZOHZWREMxRHNUS2M2b3ZhMFNaTTdfam1tVjRxYjB5WEdDVlY0QXV2YnN4c2s5RGxQTWVtSFpGRjFvYWZzS29iMF9fTVRTZVc2ZDBtX1BqMFVQMEpDZXFIcVJyaE4yZQ?oc=5\" target=\"_blank\">Secret Workout Fuels Toronto Raptors ",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTFBOUDc3b1JYZWdSUnZZdFI2UWt4Z2NOLUs3ekw3NTBJQ2tnWTdJR19YX0lNLWJnZ3ZGdDNQS0k5cVBnYzlaLW5CaUx6cVZoUHlVZHF0QmJsTzV2bFg0SXJDQW1qODNlTDhaOXc?oc=5\" target=\"_blank\">DeWanna Bonner Shares Special Message During Fever’s Win Over Storm</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNYkpfRXM2Y1A3WER4clE4SVNoV0Y5M05fNko3cVMyN2FUaV9EMkxocEZMSUUxQnB4SU9HZklYd3hWcW1hT1VzQU50UWQtWDhfS2FDWjZLX2NTWHFZazFFZVZXYm9nT09LU2JMcHVLa2JMQ19mRFJIRUQ2d0NYZWNYRXRyX0JqUFU?oc=5\" target=\"_blank\">Ace Bailey Selected by Jazz at No. 5 Followi",
      "Bailey lands with the Jazz after passing on working out with teams before the draft",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBSVXhTUVFxYUZ6RWd5WEhiN0FJY1d5LUdSM3B1MlRhMEItb1ppbnFSNFFDZWgxdzctdDJOanFxMTFBWXFtdUFNeGVFQzBhZFRlZXBzQi1UemZ3WUpmcDE2VnN1aWhORmNtVGVmczVPYmRtODg?oc=5\" target=\"_blank\">SI:AM | What We’re Watching at the NBA Draft</a>&nbsp;&nbsp;<font color=",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNb3FIaUlvZFNXNUhjeFBJM1NEZkYwQ2VYN2xPSHJrekZZQnRvSjFsVE5qM0d0aEdoNmNERTRheDBrem5wOWN5TmJIR1gwQlVMSF9Cazg1RWVkb0ExYnVjb1R4UmxNLWJ3UDA4ZGFMSWVTRWd2Z09XUmtDdzBjdXhjc1lZYlpQcGp2dms3cENLSQ?oc=5\" target=\"_blank\">Kristaps Porzingis Trade Grades: ",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxObjN0XzBHNnJYLXdFU2RpV3NDQ2VhdVloVmp3azU0YmVua3VqaXQ4SVc0V25Xb1dDN1hjS3c0eTQxQlBxa1BsSzZnVHNCTGNObXVkS1dQUzVNZlBqODVCWWNiUHpzREFrWEx1YVFTVkNQMVNsVFk1WVFNY1VUYUh4S2JOaWhOZFVUcWprU1drTDU?oc=5\" target=\"_blank\">4-Star DL Linked to UCLA Set to ",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxONjRaTHFDbzlaVEtEcmpNRFFaTWVOb1VlWkhtY1Qwc1Bad0NkOTVDREhOd3IwRlJSLUxCSHpMWWhyNGdzQkNoYVo4Q1VXeGJRZTFpUFkzU3BwM0VlOWlwR3VnTTNwMGJxNEVEaWtnaEJxbUZnQVEyMEhOLS1fMDFRR2RrQ0NUVjdscGg4d3ln?oc=5\" target=\"_blank\">Tennis Mailbag: U.S. Open Innovates",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOTjd2OEJfUk1qLS1CVlRqYlB5R0FqUUlYNHNKbkd1MDFVSGpvdTFaQXdzdlVZU1ptdWlkc1c3V3N5U1dXcEs3blNpYlNNVGQ2aXhuOHloTmoyVzRhQjhCWTZDSXJNM3I0VGZjUXVWMGd5MDlxZGtlanowM21QLUFXWlNUQTFrSDl3b2F5d3IyaWpQTHdTa0p1NzlB?oc=5\" target=\"_blank\">Busts, Bad Trades a",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNWXYtb3RlU2w2RXhERlQ2VDU0UUdmMTBhVzN5eUkwM2V3Szd6TlZIYlgzVWx3aDA4OTFUNnA5UG9EQWhGQWF2Rjl6ZldhNmtsQk5McWFCSmREc01nU2JPdGVObFd2dU96ZHc5Vld0Yld6TUkwaG4zOVJlYzhxRG5WWEJLeUVyQm4xb1B3VDctOThQams?oc=5\" target=\"_blank\">Utah Jazz Plan to Keep Ace B",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE85UkRsbjNUM2Q5Y2I2WVJDLVhLWm5ld1o1aTFRUVdtc2N5ak1UenBoc3pWREtsRHo0SWdOZzZuZE5HR3o4bnFhWnF6UnhwWEZ2U1dvN25TLW80ZGZUWWI1d21nbmRXMzRWUzhN?oc=5\" target=\"_blank\">Indiana Fever Make Decision on DeWanna Bonner's Future With Team</a>&nbsp;&nbsp;<fo",
      "<p>The Indiana Fever are moving on from DeWanna Bonner.</p>",
      "Bonner, a big offseason addition for Indiana, had not played since June 10 for personal reasons",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNMXFVV0YtZ1NPRmk4X3hUTks0eGJIeGU3Q2FCYkhKWUZ4TmNmdnB4ZWFnZlAtbHhaVGNPTDZ2dU0tX1g5cW5GMTZYNkgyOUpMOXdnVnhRaHg3QVNIVE5kdlVxaEw2dUp1dzVuT2xHNElXLVFIbXh4TUF4UW1mY3lQR0M1Vm53SmVGelEyT1RIVWM2WUxJX0szV3ROQzk?oc=5\" target=\"_blank\">Walter Clayton J",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPQ2EzY2ZYUGw3MnVaTUhUSndQZzBRNnRrODhaYk9CdGpiblpYb1d1ZkZWSUxncjBEUFhhZ2N6Q0xfZFZPY05senoydEtLenNXU1p1d082UHZIdkduTE5vcTdKMTlLSGxRcGxNTHdKSzBpaDc3VkJWdGY2NjhlWGt1MlpEVUdjV3VGNUE?oc=5\" target=\"_blank\">Hornets Trade Center Mark Williams to Su",
      "Williams, who was nearly traded to the Lakers at the deadline, is heading to Phoenix",
      "The Suns acquired Hornets center Mark Williams for the No. 29 pick and a 2029 first-round pick, and then selected center Khaman Maluach with the No. 10 pick.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPRUQ3Q1NSWlR6anJuNVNzdzV5UFFxNWNXN00xVDZzejdFUXl2QmJ2V3dUME5jZjRCMHhtRXd5eUhGYmpXTGt1STNEOGtmNDlSbHpVdUoycnN3dHl4TzV3Ylp4QWF2cUtXeDhKOWxXbmxuWkgyUElORjBCMzAySHNNUHhib193Z3RJdTBGZ1I0dXA4RFBiaGg5aUpR?oc=5\" target=\"_blank\">NBA Draft First-Rou",
      "The NBA trade market has heated up this week",
      "<img alt=\"A balding man with a beard and mustache wearing glasses and a suit \" height=\"349\" src=\"https://i.cbc.ca/1.7570166.1750838517!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/iran-nuclear-parliament-iaea.JPG\" title=\"FILE PHOTO: Iranian Parliament Speaker Mohammad Baqer Qalibaf looks ",
      "<p>With questions mounting over the impact of the U.S. and Israeli onslaught on Iran's nuclear facilities and military infrastructure, a return to hostilities could be a matter of when, not if.</p>",
      "<p>President calls intelligence ‘inconclusive’, while defence secretary describes harm to facilities as ‘moderate to severe’ </p><p>Donald Trump and the US defence secretary, Pete Hegseth, have admitted to some doubt over the scale of the damage inflicted on Iran’s nuclear sites by <a href=\"https://",
      "Trump ordered U.S. strikes on Iranian nuclear sites as part of its support for Israel, then days later announced a ceasefire agreement between the countries."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/12aa/live/9da047c0-5225-11f0-a2ff-17a82c2e8bc4.jpg",
    "titles": [
      "CIA director says Iran's nuclear sites 'severely damaged'",
      "CIA Says U.S. Strikes ‘Severely Damaged’ Iran Nuclear Sites—Setting Program Back ‘Years’ (Live Updates)",
      "The Israeli atomic energy commission says the war set back Iran’s nuclear program by ‘many years.’",
      "Trump closes NATO summit promising proof Iran’s nuclear program destroyed",
      "Trump says he doesn’t care if US, Iran sign a nuclear agreement",
      "Trump Says US to Meet Iran Next Week, Putin Talks Ahead - Bloomberg",
      "Oil Climbs as Trump Maintains Iran Pressure, Stockpiles Fall - Bloomberg",
      "Trump claims U.S. and Iran will hold meeting next week - Axios",
      "Trump assails Spain over NATO defense spending target - Axios",
      "NATO Agrees to Boost Military Spending as Trump Praises Allies, but Criticizes Spain",
      "In a Win for Trump, NATO Agrees to a Big Increase in Military Spending",
      "NATO allies agree to higher 5% defense spending target",
      "See how much NATO countries spend on defense and how that has changed",
      "NATO summit: Allies agree to spend 5% of GDP on defense",
      "Canada promises to spend 5% of GDP on defence by 2035 in pact with NATO leaders",
      "Trump threatens tough trade deal for Spain after it refuses to meet NATO defense spending target",
      "Democrats rage as Trump limits classified intel sharing with Congress - Axios",
      "White House plans to limit classified info it shares with Congress on Iran attack",
      "Scoop: Trump admin cuts contracts with scientific publishing giant - Axios",
      "Scoop: Trump hosting \"everyday Americans\" to squeeze GOP holdouts - Axios",
      "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage - Axios",
      "Trump slings insults at Mamdani, other Democrats after NYC primary - Axios",
      "Upstart Mamdani declares victory with stunning upset in NYC Democratic mayoral primary",
      "Zohran Mamdani’s victory in NYC mayoral primary leaves Wall Street 'alarmed' and 'depressed'",
      "Will the Democrats learn from Zohran Mamdani’s victory? | Bernie Sanders",
      "Zohran Mamdani's campaign was a perfect storm - Axios",
      "Mamdani’s New York victory boosts pro-Palestine politics in US",
      "How Zohran Mamdani stunned New Yorkers with mayoral primary victory",
      "Trump slams Zohran Mamdani as Republicans go on attack after New York mayoral primary – as it happened",
      "Wall Street reels from Mamdani victory in New York mayoral primary",
      "Primary win by pro-rent freeze Mamdani knocks shares of Flagstar bank on NYC market exposure",
      "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary - Axios",
      "MAGA erupts with Islamophobic attacks on Zohran Mamdani - Axios",
      "Who is Zohran Mamdani, NYC's Democratic mayoral nominee - Axios",
      "Could Zohran Mamdani be NYC’S first Muslim and Indian American mayor?",
      "Zohran Mamdani has NYC's business community \"terrified\" - Axios",
      "\"There's a lot of anxiety\": Mamdani's win has some Dems freaking out about their primaries - Axios",
      "\"Leaks are a problem\": Congress feuds over Trump limits on sharing intel - Axios",
      "NATO members step up spending, but doubts about US remain",
      "Trump wages all-out fight for control of Iran strike narrative - Axios",
      "Thursday Briefing: Trump Says He’ll Meet With Iran",
      "Thursday Briefing",
      "Thursday briefing: Keir Starmer is now ready to make concessions on his welfare reform bill. Will they be enough?",
      "'A kind of magic': Emily Eavis on Glastonbury's Thursday feeling",
      "Military briefing: Israel and Iran size up war damage",
      "Rubio Fleshes Out Trump’s Case That Iran Nuclear Capacity Was Eliminated",
      "Trump Says U.S. and Iran to Meet; White House Disputes Damage Report",
      "Trump slams news coverage of US intel report on Iran attack, says B-2 pilots upset",
      "Israeli intelligence sees \"significant\" damage to Iran's nuclear facilities, officials say - Axios",
      "U.S. initial damage report: Iran nuclear program set back by months, not obliterated",
      "Israel-Iran news live: Donald Trump says strikes on Iran were ‘devastating attack’ amid row over claims of success",
      "Trump officials cite ‘new intelligence’ to back president’s claims of success in strikes on Iran",
      "Afternoon Update: Pesutto pays Deeming debt; Trump officials cite ‘new intelligence’ on Iran strikes; and what it’s like snapping Oasis",
      "LIVE:  ABC News Live",
      "NBA free agency 2025: Latest signings, news, buzz, live reports",
      "NHL’s Top 12 RFAs of 2025: Latest rumours, reports",
      "NBA Trade Tracker: Latest Deals, Draft Moves and Free Agency News - Sports Illustrated",
      "NBA Draft Tracker: Every pick made",
      "2025 NBA Draft Grades for Every Round 1 Pick - Bleacher Report",
      "Every kit for Euro 2025 - pick your favourite",
      "Grading Phoenix Suns' First Round of 2025 NBA Draft",
      "Sam Cosentino’s 2025 NHL Mock Draft: How will the first round unfold?",
      "First-team reps? Big plays? A sneak peek at how the 2025 NFL draft first-rounders look",
      "OKC Thunder Land Promising Center Thomas Sorber In 2025 NBA Draft",
      "5 Takeaways From Night One Of The 2025 NBA Draft",
      "Round 2 mock: What we're hearing before the second night of the NBA draft",
      "Fans Conflicted by Pat Riley's Major Decision During the 2025 NBA Draft",
      "Hornets Take Liam McNeeley With 29th Pick in 2025 NBA Draft",
      "‘Chinese Jokic’ Yang Hansen selected at 16th pick in NBA draft, day before 20th birthday",
      "Grading OKC Thunder's First Round of 2025 NBA Draft",
      "Grading Sacramento Kings' First Round of 2025 NBA Draft",
      "2025 NBA mock draft: Johni Broome, Ryan Kalkbrenner go early in second-round projection",
      "2025 NBA Draft: Which college teams, conferences produced the most first-round picks?",
      "NBA Draft 2025: Projected Contracts For Cooper Flagg And Other First-Round Picks",
      "Where Does Cooper Flagg Rank Among Other NBA No. 1 Picks?",
      "Touching reason why Cooper Flagg chose Mavericks jersey number after going No. 1 overall in 2025 NBA Draft",
      "Mavericks select blue-chip Duke forward Cooper Flagg first overall",
      "Flagg, 18, drafted first by Mavericks",
      "Cooper Flagg drafted No. 1 overall by Mavericks: How Duke star will fit in Dallas' starting lineup",
      "2025 NBA Draft winners and losers: Ace Bailey's plan backfires, Cooper Flagg saves the Mavericks",
      "How the Nets made NBA Draft history with their unconventional first-round haul",
      "Best picks, surprising moves and top trades from the NBA draft: Making sense of Round 1",
      "Fans Are Saying the Same Thing About the Hawks' Latest NBA Draft Pick",
      "Kane traded to Canucks by Oilers for draft pick - NHL.com",
      "Draft Prep: Top Prospects - NHL.com",
      "McQueen, Reschny lead Saskatchewan contingent of prospects ahead of 2025 NHL Draft",
      "CANUCKS ACQUIRE FORWARD EVANDER KANE FROM EDMONTON - NHL.com",
      "RELEASE: Oilers acquire pick from Canucks for Kane - NHL.com",
      "Allvin feels Kane acquisition makes Canucks ‘harder to play against’",
      "Allvin hopeful Kane will positively impact Canucks’ leadership group",
      "Will Kane be a good fit in the Canucks’ dressing room?",
      "Peterka traded to Mammoth by Sabres for Kesselring, Doan - NHL.com",
      "Sabres trade JJ Peterka to Mammoth for Josh Doan, Michael Kesselring",
      "Dylan Harper's Mom Leaves Fans Obsessed During NBA Draft",
      "Bilas: Eight prospects who stand out in this year's NBA draft class",
      "2025 NBA Draft order: Full list of every second-round pick as selection process continues Thursday",
      "2025 NBA free agency guide: Complete list of every team's free agents and contract options for this summer",
      "Pittsburgh Steelers Ready For More: Another Move Ahead - Sports Illustrated",
      "‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chief - Sports Illustrated",
      "‘Final Detail’—Cristiano Ronaldo on Verge of Confirming Future With New Deal - Sports Illustrated",
      "Jadon Sancho: Two European Clubs ‘Enquire’ About Man Utd Misfit - Sports Illustrated",
      "Every 2024–25 Premier League VAR Error: Man Utd’s Season Swung on Official Blunder - Sports Illustrated",
      "Chelsea’s Route to 2025 Club World Cup Final: Major Conflict of Interest on Horizon - Sports Illustrated",
      "Alex Caruso Had One Major Request for NBA After Thunder Win Championship - Sports Illustrated",
      "Lee Corso's Son Admits One 'Disappointing' Aspect of Father's Final 'College GameDay' - Sports Illustrated",
      "NHL Weighing Major Change to Regular Season Schedule at CBA Negotiations - Sports Illustrated",
      "NHL considering 84-game season in CBA negotiations, per report",
      "Sources: 84-game NHL season part of CBA talks",
      "📲 Final round of Club World Cup group stage, check out Thursday's fixtures",
      "Fluminense advances at Club World Cup after draw with Mamelodi Sundowns",
      "Club World Cup Daily: Monterrey advance as River Plate crash out",
      "Club World Cup: Inter send River Plate home as all four Brazilian clubs reach last 16",
      "Inter Milan vs. River Plate prediction, odds, start time: Free 2025 FIFA Club World Cup picks for June 25",
      "Juventus vs. Manchester City live stream, how to watch Club World Cup: Odds, pick, prediction",
      "Juventus vs Manchester City Betting Tips: City can pass Juve test",
      "Pep Guardiola warns Manchester City ‘will have to suffer’ against Juventus",
      "City 'have to be ready to suffer' Florida heat - Guardiola",
      "USWNT vs. Ireland prediction, where to watch, live stream: Predicted lineups, pick, odds, how to watch",
      "From Man City to Flamengo, why every last-16 team will, won't win Club World Cup",
      "Real Madrid vs. RB Salzburg odds, live stream: Will Kylian Mbappe play, how to watch Club World Cup, pick",
      "RB Salzburg vs. Real Madrid predicted starting lineups: No Kylian Mbappe as Los Blancos look to win group",
      "Real Madrid vs RB Salzburg: FIFA Club World Cup – team news, start, lineups",
      "FIFA investigates if Real Madrid’s Rüdiger was racially abused by opponent at Club World Cup",
      "Inter knock out River, advance as group winners",
      "Monterrey, Inter Milan, Dortmund and Fluminense in Club World Cup last 16",
      "Borussia Dortmund beats Ulsan, earns second-round berth at Club World cup",
      "Borussia Dortmund ‘confident’ they can keep Carney Chukwuemeka",
      "Goals, giant Bono, Neves-SMS axis: Keys to Al Hilal making Club World Cup last 16",
      "Monterrey into CWC last 16 after Urawa thumping",
      "🗞️ Barça shake-up, Club World Cup... a Thursday packed with headlines",
      "Predicted Starting Line-Up: Juventus vs Manchester City (FIFA Club World Cup Group Stage)",
      "Club World Cup: Extreme heat poses questions for FIFA",
      "Here's What to Know About Blazers' Surprise First-Round Pick Hansen Yang - Sports Illustrated",
      "Giants President Teases Long-Awaited Statue at Oracle Park for Franchise Legend - Sports Illustrated",
      "Power Nine: Uncertainty for Jordan Spieth and Keegan Bradley's Major Move - Sports Illustrated",
      "Pac-12 Expected to Offer Texas School Spot in Revamped League - Sports Illustrated",
      "DeWanna Bonner Releases Statement After Rocky Fever Tenure Ends With Release - Sports Illustrated",
      "What Bob Devaney Saw in Tom Osborne - Sports Illustrated",
      "NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025 - Sports Illustrated",
      "Ranking the AFC East Offensive Line Situations - Sports Illustrated",
      "32 Teams in 32 Days: Seahawks Can Win the NFC West If Sam Darnold Delivers - Sports Illustrated",
      "Why Arch Manning's Biggest Quarterback Influences Aren't Uncles Peyton, Eli - Sports Illustrated",
      "Spurs, Pacers Agree to Trade Ahead of 2025 NBA Draft - Sports Illustrated",
      "Pacers Agree To Trade Future Second Rounder To Spurs For 2025 Pick 38",
      "Sixers Reveal Why They Preferred VJ Edgecombe To Ace Bailey In 2025 NBA Draft",
      "Three Gophers selected in 2025 PWHL Draft - Sports Illustrated",
      "Secret Workout Fuels Toronto Raptors Draft Speculation Around Noa Essengue - Sports Illustrated",
      "DeWanna Bonner Shares Special Message During Fever’s Win Over Storm - Sports Illustrated",
      "Ace Bailey Selected by Jazz at No. 5 Following Bizarre Draft Process - Sports Illustrated",
      "PR failure? Ace Bailey loses game of chicken to be taken by Jazz at No. 5 in NBA Draft",
      "SI:AM | What We’re Watching at the NBA Draft - Sports Illustrated",
      "Kristaps Porzingis Trade Grades: How Did Celtics, Hawks, Nets Fare? - Sports Illustrated",
      "4-Star DL Linked to UCLA Set to Make Choice - Sports Illustrated",
      "Tennis Mailbag: U.S. Open Innovates With Mixed Doubles Format - Sports Illustrated",
      "Busts, Bad Trades and Regrets: Each NBA Team's Biggest Draft Mistake Since 2000 - Sports Illustrated",
      "Utah Jazz Plan to Keep Ace Bailey After Bold Decision to Draft Rutgers Star - Sports Illustrated",
      "Indiana Fever Make Decision on DeWanna Bonner's Future With Team - Sports Illustrated",
      "Indiana Fever waive six-time all-star DeWanna Bonner",
      "DeWanna Bonner waived by Fever: What to know as veteran all-star looks for new team after stint with Indiana",
      "Walter Clayton Jr. Joins Ace Bailey on Jazz After Draft Trade From Wizards - Sports Illustrated",
      "Hornets Trade Center Mark Williams to Suns During NBA Draft - Sports Illustrated",
      "Mark Williams trade grades: Suns revamp frontcourt on draft night, Hornets move on after failed Lakers deal",
      "Suns acquire Hornets' Williams, draft Maluach",
      "NBA Draft First-Round Grades: Every Selection From Cooper Flagg to No. 30 - Sports Illustrated",
      "2025 NBA Draft trade tracker: Latest deals, news as Suns acquire Mark Williams from Hornets",
      "Nuclear facilities 'badly damaged,' Iran's foreign ministry says",
      "Will the ceasefire stick? And is Iran's nuclear program really destroyed?",
      "Trump and Hegseth admit doubts about level of damage to Iranian nuclear sites",
      "Trump CIA chief says Iran nuclear program was 'severely damaged,' countering reports of U.S. intel assessment"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.839,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.874,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T21:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "ESPN",
      "Washington Post",
      "Deutsche Welle",
      "New York Times",
      "CBC News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Security forces fortified Kenya's government buildings with razor wire ahead of a march marking one year since anti-Ruto protesters stormed the parliament. Reports suggest at least eight have died during the protests.",
      "Demonstrators joined antigovernment marches across the country a year after huge rallies against a contentious tax plan left more than 60 people dead.",
      "<img alt=\"A man with toothpaste on his face and a kerchief around his neck holds both hands over his head and forms an X with his arms\" height=\"349\" src=\"https://i.cbc.ca/1.7570926.1750885508!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/kenya-security-protests-anniversary.JPG\" title=\"A pr",
      "<p>Police clashed with people marching in Nairobi and other areas to honour those killed in protests last year</p><p>At least 16 people have been killed and 400 injured in <a href=\"https://www.theguardian.com/world/kenya\">Kenya</a> as a nationwide demonstration to honour those <a href=\"https://www.t",
      "At least eight people were killed as protests against police brutality in Kenya spread across the country, according to rights and medical groups.",
      "Thousands demonstrated on Wednesday to express their anger over government corruption and police brutality.",
      "Formula 1 heads into round 11 in Spielberg as McLaren's Oscar Piastri remains championship leader - will the Austrian Grand Prix provide any upsets?"
    ],
    "image_url": "",
    "titles": [
      "Kenya: Several killed in rally on deadly protest anniversary",
      "At Least 8 Killed as Protesters Battle Police in Kenya",
      "Police crack down on Kenyan protesters with deadly force a year after anti-tax uprising",
      "At least 16 people killed and 400 injured in Kenyan protests",
      "At least 8 killed as anti-government protests rock Kenya",
      "What to Know About the Antigovernment Protests in Kenya",
      "What to know ahead of the Austrian Grand Prix"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.794,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "Meta Wins Copyright Lawsuit; Getty Drops Claims Against Stability AI",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 00:13:24 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "Business Insider",
      "The Verge",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "technology",
      "general",
      "business"
    ],
    "snippets": [
      "Meta prevailed in a copyright case involving its AI model, but the federal judge left the door open for others to bring forward similar lawsuits.",
      "Getty Images dropped its primary claims of copyright infringement against Stability AI on Wednesday at London’s High Court, narrowing one of the most closely watched legal fights over how AI companies use copyrighted content to train their models.",
      "A federal judge sided with Meta on Wednesday in a lawsuit brought against the company by 13 book authors, including Sarah Silverman, that alleged the company had illegally trained its AI models on their copyrighted works.",
      "The judge said that one \"potentially winning argument\" &mdash; that AI tools could harm the market for human-created content &mdash; was barely mentioned.",
      "<p>Writers accused Facebook owner of breach over using books without permission to train its AI system</p><p>Mark Zuckerberg’s Meta has won the backing of a judge in a copyright lawsuit brought by a group of authors, in the second legal victory for the US artificial intelligence industry this week.<",
      "Meta won a major legal ruling in an AI copyright lawsuit brought by 13 authors alleging that the company illegally trained its AI systems on their work without permission. On Wednesday, Judge Vince Chhabria ruled in Meta’s favor, saying it is “entitled to summary judgment on its fair use defense to "
    ],
    "image_url": "",
    "titles": [
      "Meta wins AI copyright case, but judge says others could bring lawsuits",
      "Getty drops key copyright claims against Stability AI, but UK lawsuit continues",
      "Federal judge sides with Meta in lawsuit over training AI models on copyrighted books",
      "A judge just handed Meta a big AI copyright victory. He said lawyers for the other side fumbled the case.",
      "Meta wins AI copyright lawsuit as US judge rules against authors",
      "Meta&#8217;s AI copyright win comes with a warning about fair use"
    ],
    "score_components": {
      "magnitude": 0.89,
      "recency": 0.848,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.861,
    "summary": "Meta won a significant legal victory in a copyright lawsuit filed by 13 authors, including Sarah Silverman, who claimed the company unlawfully trained its AI models using their copyrighted works. Federal Judge Vince Chhabria ruled in favor of Meta, emphasizing the company's fair use defense. Concurrently, Getty Images withdrew its primary copyright infringement claims against Stability AI in London, marking a notable week for the AI industry in copyright litigation. However, the judge noted that the potential market harm AI tools could cause to human-created content was not adequately addresse",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the legal landscape of AI and copyright infringement, which can inform readers, particularly those interested in technology, law, or AI. However, it does not clearly highlight solutions or progress, and while it mentions potential market harm, it does not delve deeply into the implications or causes."
  },
  {
    "title": "Dan Sheehan to Captain Lions vs Western Force, 9 Debutants Selected",
    "domain": "general",
    "location": "global",
    "published": "Thu, 26 Jun 2025 06:33:45 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Ireland's Dan Sheehan will captain the British and Irish Lions in their opening game on Australian soil against the Western Force on Saturday.",
      "Dan Sheehan will captain the British and Irish Lions on his debut for the side as head coach Andy Farrell makes 13 changes to the starting XV for Saturday's clash vs Western Force in Perth.",
      "<ul><li><p>Irish hooker joins eight other first-timers in matchday 23</p></li><li><p>Jamison Gibson-Park and James Ryan left out with injuries</p></li></ul><p>Eight Ireland players have been selected in the British &amp; Irish Lions starting XV to face Western Force in the first fixture of the squad",
      "Ireland's Dan Sheehan will captain the British and Irish Lions in their opening game on Australian soil against the Western Force on Saturday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6540/live/ae0cf5d0-5258-11f0-b724-053c7095a18e.jpg",
    "titles": [
      "Sheehan to captain British & Irish Lions against Western Force",
      "Sheehan captains Lions as Farrell rings changes for Force clash",
      "Debutant Dan Sheehan will lead Lions in first tour fixture against Western Force",
      "Sheehan captains Lions against Force in Australia"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.967,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary": "Dan Sheehan, an Irish hooker, will captain the British and Irish Lions in their first game on Australian soil against the Western Force on Saturday. Making his debut as captain, Sheehan is part of a significant team change, with head coach Andy Farrell making 13 alterations to the starting XV. The matchday squad includes nine players making their debut for the Lions. Additionally, Jamison Gibson-Park and James Ryan were excluded due to injuries. Eight Irish players in total have been selected for the starting lineup against Western Force.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the team lineup and changes for an upcoming game, which could inform readers' expectations or decisions around watching. However, it does not report on progress, solutions, or improvements, nor does it offer a deeper understanding of broader systems or trends in the sport."
  },
  {
    "title": "U.S. Cuts Gavi Funding, Urges Focus on Vaccine Safety Amid Measles Outbreak",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 19:39:14 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "Ars Technica",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "technology",
      "general"
    ],
    "snippets": [
      "The secretary of health and human services said that funding will be curtailed until Gavi, the Vaccine Alliance, takes into account the science of vaccine safety in its campaigns.",
      "Robert F. Kennedy Jr. claimed that the agency, Gavi, had “ignored the science” in immunizing children around the world.",
      "The advisory committee makes recommendations to the Centers for Disease Control and Prevention on the nation's vaccine schedule. Any changes could affect vaccinations for millions of children.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5qay01NE1aUGpfVlZTU2pocHpld2hGb2Y1UXFxUnBZMnJhUjNWbkVURGg1MW9XWkZfV2dmOFhlWGNpdTNaaUJJcDNraHFIRDl5QXRaaTljNWJ1bGlqbUI2amhOa3haUWVQdVZYWkdoeDZJQzBMZThXbzk0UTA?oc=5\" target=\"_blank\">RFK Jr.'s vaccine advisors to re-examine childhood vax sched",
      "Overall, the meeting was packed with anti-vaccine talking points and arguments.",
      "<p>Health secretary unilaterally appointed ACIP’s eight new members, several of whom are critical of immunizations</p><p>The first meeting of a critical federal vaccine panel was a high-profile display of how the US health secretary and vaccine skeptic Robert F Kennedy Jr has injected chaos into vac"
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. says U.S. will stop funding global vaccine group over 'vaccine safety' issues",
      "RFK Jr. Accuses Gavi, Global Vaccine Agency, of Ignoring Science",
      "Panel picked by RFK Jr. will scrutinize the vaccine schedule for kids",
      "RFK Jr.'s vaccine advisors to re-examine childhood vax schedule - Axios",
      "All childhood vaccines in question after first meeting of RFK Jr.’s vaccine panel",
      "First meeting of new CDC vaccine panel reveals policy chaos sown by RFK Jr"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.838,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.833,
    "summary": "The U.S. Secretary of Health and Human Services announced a reduction in funding for Gavi, the Vaccine Alliance, urging it to better consider vaccine safety science. This follows claims by Robert F. Kennedy Jr. that Gavi has disregarded vaccine safety in global immunization efforts. Kennedy's controversial vaccine panel, which includes members skeptical of vaccinations, held its first meeting amidst criticism. This occurs as the U.S. faces significant measles outbreaks, with over 1,000 cases reported. The panel's recommendations could impact the vaccination schedule for millions of children.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the U.S. government's stance on global immunization efforts and the potential implications of this stance. However, it does not offer insights into the validity of the concerns raised about vaccine safety, nor does it report on potential solutions or improvements to the situation."
  },
  {
    "title": "Bezos Moves Venice Wedding Party Amid Protests and Local Backlash",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 19:04:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Al Jazeera",
      "New York Times",
      "CBC News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Amazon tycoon set to marry Lauren Sanchez in lavish Venice wedding as activists protest &#039;growing disparity&#039;.",
      "<img alt=\"Woman with long dark hair and bald man with sunglasses, both smiling, as they walk out of curtained area\" height=\"349\" src=\"https://i.cbc.ca/1.7570860.1750882410!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/people-bezos-wedding.JPG\" title=\"Amazon founder Jeff Bezos and Lauren Sa",
      "<p>People power forced a change of venue, proving that a man worth £223bn can still fall foul of ordinary folk with pool floats</p><p>There are so many questions swirling around the forthcoming wedding of Jeff Bezos to Lauren Sánchez this weekend – for instance, who in their right mind books Venice ",
      "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence.",
      "In Venice, a romantic backdrop of weddings for centuries, the marriage of Jeff Bezos and Lauren Sánchez is providing an economic windfall and stirring protest."
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos arrives in Venice for wedding amid protests over inequality",
      "Celebrities arrive in Venice amid protests against Bezos-Sanchez wedding",
      "Congrats to Jeff Bezos and Lauren Sánchez on the wedding – and to Venice for running them out of town | Emma Brockes",
      "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
      "Venice, prime wedding spot, braces for a Bezos marital extravaganza"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.761,
      "consensus": 0.988,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary": "Jeff Bezos and Lauren Sánchez moved their Venice wedding party venue from the city center due to protests. Critics argue the event exemplifies the exploitation of Venice. The wedding, attracting high-profile guests like Ivanka Trump and Diane von Furstenberg, has sparked debate between its economic benefits and the backlash from locals. Despite the controversy, preparations continue, highlighting the impact of public opinion on the plans of even the wealthiest individuals.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the event and its impact on the local community, but it doesn't offer deep insights or actionable information. The story doesn't report on solutions, improvements, or attempts to solve the problem of exploitation of Venice."
  },
  {
    "title": "Shell Denies Merger Talks with BP, Refutes Takeover Speculation",
    "domain": "business",
    "location": "global",
    "published": "Thu, 26 Jun 2025 08:00:00 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Oil major says no talks have taken place between the companies over a tie-up",
      "Shell Plc said it has no intention of making a takeover offer for BP Plc, refuting an earlier report that two of Europe’s biggest companies were in active merger talks.",
      "<p>Shell doubles down on denials after media reports of early talks with rival BP to create £200bn UK oil company</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jun/26/uk-businesses-tax-rises-keir-starmer-rachel-reeves-shell-bp-no-bid-business-live\">Business live – latest upda",
      "<p>Shell doubles down on denials after media reports of early talks with rival BP to create £200bn UK oil company</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jun/26/uk-businesses-tax-rises-keir-starmer-rachel-reeves-shell-bp-no-bid-business-live\">Business live – latest upda"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1e211c70-04dc-4b9d-b95e-9ecf479b8006.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Shell says it has ‘no intention’ of making offer for BP",
      "Shell Says It Has No Intention of Making an Offer for BP",
      "Shell has ‘no intention’ of making offer to buy BP after £60bn takeover rumours",
      "Shell ‘no intention’ of making offer to buy BP after £60bn takeover rumours"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.997,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary": "Shell Plc has officially denied reports of being in merger talks with BP Plc, stating it has no plans to make a takeover offer. This clarification comes after media speculation suggested the two major European oil companies were considering joining forces to form a £200 billion entity. Shell's response firmly refutes these claims, emphasizing that no discussions have taken place regarding such a tie-up.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current state of affairs between two major oil companies, potentially impacting investment decisions. However, it does not report on any solutions or improvements, nor does it provide a deeper understanding of the systems or trends at play in the oil industry."
  },
  {
    "title": "Raptors Draft Murray-Boyles at No. 9, Player's Mixed Reaction Clarified",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 03:12:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Global News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Murray-Boyles was selected by Toronto with the No. 9 overall pick in the first round",
      "<p>Toronto Raptors ninth-overall selection Collin Murray-Boyles explains his initial reaction that was caught on camera at the 2025 NBA Draft, saying he did not intend for his reaction to come across as a &#8220;bad thing&#8221; as he is excited to join the team.</p>",
      "Collin Murray-Boyles shook his head when his name was called at the NBA Draft, appearing to let out a curse word.",
      "The Toronto Raptors have selected forward Collin Murray-Boyles with the No. 9 pick in the NBA Draft.",
      "<p>The Raptors beefed up their frontcourt by selecting Collin Murray-Boyles ninth overall. </p>\n<p>Kai Gammage takes a look at how the South Carolina product could slot into Toronto&#8217;s new style of basketball.</p>",
      "<p>The NBA Draft unfolded as most expected, at least until the Toronto Raptors got involved. The selection of Collin Murray-Boyles at the No. 9 spot certainly raised eyebrows, but the Raptors believe they landed an elite defender.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/26/2c273944-d605-4f3c-8f83-1b0c4926f672/cmb.jpg",
    "titles": [
      "Collin Murray-Boyles addresses viral reaction to being picked by Raptors in NBA Draft 2025",
      "Murray-Boyles explains his initial reaction to Raptors pick: ‘Not a bad thing’",
      "Raptors select Murray-Boyles ninth overall",
      "NewsAlert: Raptors select Murray-Boyles at No. 9",
      "Prospect of Interest: How does Collin Murray-Boyles fit with Raptors?",
      "Why Raptors surprised NBA by picking Collin Murray-Boyles at NBA Draft"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.902,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary": "The Toronto Raptors selected forward Collin Murray-Boyles with the No. 9 overall pick in the first round of the NBA Draft, aiming to strengthen their frontcourt. Murray-Boyles' initial reaction, which included shaking his head and uttering a curse word, was caught on camera, but he clarified that he did not intend for his reaction to be perceived negatively and is excited to join the team. The Raptors' choice was seen as a surprise by some, but the team views Murray-Boyles as an elite defender who fits into their new style of basketball.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a team's draft decision and the player's response, which can help readers understand the dynamics of the team and the player's attitude. However, it doesn't report on broader trends in the sport or the draft, nor does it offer solutions or improvements. The story does increase clarity around the player's reaction, which is a relevant impact."
  },
  {
    "title": "Maple Leafs Announce Six-Game Pre-Season; Senators to Play in Quebec City",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:39:11 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL",
      "Ottawa Citizen"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNNDdCOWlGdFU0MU5rSFNNX1ZKTXVMUzN1dVl3dEo4WUhpbnNOWW9BcU1TblJYS0pMQTdwaEo3TUFNa1JlZlRkV0ZxLWxhYnY3a2x3RnJBUWw1OFNGMnRWYm1pVzhxVGhxbEJQbG16RDJxQXAzVnRPOVZPM1pjcFJqREdROTMtSnBIck1iVA?oc=5\" target=\"_blank\">Maple Leafs Announce 2025 NHL Preseas",
      "The Ottawa Senators will only play one preseason game at the Canadian Tire Centre. Two games will be in Quebec City.",
      "<p>For the Toronto Maple Leafs, the hunt for a Stanley Cup will begin with a six-game pre-season schedule, starting on Sept. 21 against the Ottawa Senators.</p>",
      "<p>If we learned anything from free agency in 2024, it&#8217;s that a lot of the players who signed bigger contracts fell flat, while value was found elsewhere. Using that knowledge, Justin Bourne explores four steps to how the Toronto Maple Leafs should proceed this summer.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOMGZGU1Y0bGdibFBZeW5RakpvVW5fVFVtOXA0SHE0emV0dGlPeGhkZXJ1MDNwS2VZSnZLTExweU92czZLbGtmcmt4aGs0UV9seVp0Rl9lcmRjSWZHalZpcDlqOVhMbm9xRjNUN0VnMDI1cTdfRVBqaHV5TkZXc3pwTHI1ZzByZ1NXZ3Q5eF9Fcw?oc=5\" target=\"_blank\">Utica Announces 2025-26 Coaching "
    ],
    "image_url": "",
    "titles": [
      "Maple Leafs Announce 2025 NHL Preseason Schedule - NHL.com",
      "Ottawa Senators announce six-game exhibiton schedule",
      "Maple Leafs announce 2025 pre-season schedule",
      "Four steps to how the Maple Leafs should approach the off-season",
      "Utica Announces 2025-26 Coaching Staff | RELEASE - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.755,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary": "The Toronto Maple Leafs have scheduled a six-game pre-season starting September 21 against the Ottawa Senators, as part of their preparation for the 2025 NHL season. Meanwhile, the Ottawa Senators will play only one preseason game at the Canadian Tire Centre, with two additional games in Quebec City. This announcement follows observations from the 2024 free agency, suggesting that teams found value in unexpected places. The Maple Leafs' approach to the upcoming season will be informed by these insights, aiming to optimize their strategy for a successful Stanley Cup run.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about upcoming games and strategies for the Toronto Maple Leafs and Ottawa Senators. It offers insights into the teams' preparations for the season and the potential impact of the 2024 free agency on their strategies. However, it does not highlight any significant progress, solutions, or innovations in the sport."
  },
  {
    "title": "Salvadoran Immigrant in Maryland Ordered Released, Faces Potential ICE Custody",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 19:31:45 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A federal judge in Tennessee ordered Kilmar Abrego Garcia — the man the government mistakenly deported to a prison in El Salvador — to be released from prison until his trial on federal charges.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBGRTVXMWVJQk4zVGdTQ0pLMW12WDBYU3NQcTlUUDNnUjNIMlFmQ0hLTU5NWXpWR2ZUdTdZLVZnMnhOVllUX2JHTF9qUlZnMW83MVpXREZlT3Nfejlqck1ySmlCUnozZmJPYTdVY1NaRk9GUE9kdHdQUHUzdVA?oc=5\" target=\"_blank\">Abrego Garcia ordered released from prison but still faces d",
      "Lawyers for the Maryland father, a Salvadoran immigrant, fear he could face a second deportation if released.",
      "Despite the court order, if released from prison, Kilmar Abrego Garcia is likely to be immediately taken into custody by U.S. Immigration and Customs Enforcement."
    ],
    "image_url": "",
    "titles": [
      "Judge orders Abrego Garcia released from jail, but his future remains uncertain",
      "Abrego Garcia ordered released from prison but still faces deportation - Axios",
      "Mistakenly deported man Kilmar Abrego Garcia to remain in jail for now",
      "A judge ordered Abrego Garcia released. His future remains uncertain"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.835,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary": "Kilmar Abrego Garcia, a Salvadoran immigrant and Maryland father, has been ordered released from prison. However, upon release, he is likely to be taken into custody by U.S. Immigration and Customs Enforcement (ICE). His lawyers express concerns that he could face deportation again.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the challenges faced by immigrants in the U.S., particularly those who have been ordered released from prison. However, it does not provide deeper insight into the broader immigration system or potential solutions to the issues it highlights."
  },
  {
    "title": "Micron Earnings Beat Expectations, AI Chip Demand Fuels Stock Surge",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 22:04:08 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Micron reported earnings and revenue on Wednesday that exceeded analysts' estimates.",
      "Micron Technology Inc.’s earnings results for the May quarter came in above Wall Street’s expectations Wednesday, as demand for artificial-intelligence chips boosts sales for its high-bandwidth memory chips.",
      "<figure><img alt=\"Bloomberg / Getty Images Micron Technology stock has gained over 50% in 2025 through Wednesday’s close\" src=\"https://www.investopedia.com/thmb/79GyCaq0zwrgOAFh8n7pWhDXLi8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2189904387-9426426a3d6c498c99836ba"
    ],
    "image_url": "",
    "titles": [
      "Micron reports earnings, revenue beat and issues strong forecast",
      "Micron delivers record quarterly revenue, supporting investors’ ‘super-bullish’ outlook",
      "Micron Reports Record Revenue as Data Center Sales Surge on AI Demand"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.81,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary": "Micron Technology Inc. reported earnings and revenue for the May quarter that surpassed analysts' expectations, driven by a surge in demand for artificial-intelligence chips, which increased sales of its high-bandwidth memory chips. This performance contributed to Micron's stock gaining over 50% in 2025 up to Wednesday's close.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about Micron's performance and the factors contributing to it, such as the demand for AI chips. However, it does not report on solutions, improvements, or attempts to solve problems, nor does it significantly increase awareness around systems, causes, or trends."
  },
  {
    "title": "Trump Defends Netanyahu, Calls Trial a \"Witch Hunt\"",
    "domain": "general",
    "location": "global",
    "published": "Thu, 26 Jun 2025 02:28:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Trump extolls Israeli leader as a &#039;warrior&#039;, says the US will be the one that &#039;saves Bibi Netanyahu&#039; from trial.",
      "<p>US president calls Israeli prime minister a ‘great hero’ and that the charges against him constitute a ‘witch hunt’</p><p>Donald Trump has weighed in on ally Benjamin Netanyahu’s long-running corruption trial, saying in a social media post that the trial was a “witch hunt” and should be cancelled",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE0tSENFQjNGX0dvT0YzbE5yTnZaV3JZZlc3THprdGJEd3pXejUtS3VDUU02Q0NqdTFNRHdWUVkxSEVrQTJFeWE3TDZBZWJfc29oS0gwcVdQbWNzSjhwU24zSEtWeG14bVk4R0JLX0ticWw3MnZzeFZxck53cTc?oc=5\" target=\"_blank\">In an unusual intervention, Trump calls for canceling Netany"
    ],
    "image_url": "",
    "titles": [
      "‘Witch-hunt’: Trump calls for cancellation of Netanyahu’s corruption trial",
      "Trump calls for Netanyahu corruption trial to be cancelled",
      "In an unusual intervention, Trump calls for canceling Netanyahu's corruption trial - Axios"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.888,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Former US President Donald Trump publicly defended Israeli Prime Minister Benjamin Netanyahu, describing him as a 'warrior' and a 'great hero' amidst Netanyahu's ongoing corruption trial. Trump criticized the trial as a \"witch hunt\" and argued for its cancellation in a social media post. This marks a notable instance of Trump intervening in foreign legal matters, particularly in support of an ally.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of a former US president's opinion on a foreign leader's legal situation. However, it lacks depth or insight into the trial itself, the reasons for Trump's support, or the potential impacts of his intervention. It doesn't provide actionable insights or deeper understanding for the reader."
  },
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:50:08 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Oil prices sold off on Monday and Tuesday after Iran held back from targeting regional crude supplies, and Trump pushed Jerusalem and Tehran into a truce.",
      "In public, Qatar was insisting on the right to defend itself after Iran attacked a U.S. military site in the emirate. Behind the scenes, it was already mediating a truce between Israel and Iran."
    ],
    "image_url": "",
    "titles": [
      "U.S. crude oil rises after steep selloff following Israel-Iran ceasefire",
      "How Qatar Helped Broker the Israel-Iran Cease-Fire"
    ],
    "score_components": {
      "magnitude": 0.79,
      "recency": 0.758,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "BBC Sport Covers National League Updates; Global News Hour at 6 BC Online",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 07:34:44 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Global News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "BBC Sport tracks the latest news stories from the National League, including managerial announcements, new signings and contract extensions.",
      "Watch the online edition of Global News Hour at 6 BC."
    ],
    "image_url": "",
    "titles": [
      "National League news - June 2025",
      "WATCH: Global News Hour at 6 BC: June 25"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.988,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary": "BBC Sport provides updates on the National League, covering managerial changes, player signings, and contract renewals. Additionally, viewers can catch the Global News Hour at 6 BC online, offering a broader news perspective.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for sports fans, particularly those interested in the National League. However, it does not offer any insights into solutions, improvements, or innovations, nor does it increase clarity around systems or impacts."
  },
  {
    "title": "Sony Plans \"The Social Network\" Sequel on Facebook's Social Impact",
    "domain": "business",
    "location": "global",
    "published": "2025-06-26T01:36:07Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "The Verge"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "The sequel to \"The Social Network\" will examine Facebook's impact on youth mental health, misinformation, and more.",
      "The Social Network is finally getting a sequel courtesy of Sony. Deadline reports that Sony is moving forward with The Social Network Part II, a &#8220;follow-up&#8221; to David Fincher&#8217;s 2010 feature about how TheFacebook went on to become one of the most singularly influential websites in in"
    ],
    "image_url": "https://i.insider.com/685c9319f748d8c055f46135?format=jpeg",
    "titles": [
      "Aaron Sorkin will direct a sequel to 'The Social Network' inspired by The Facebook Files",
      "Aaron Sorkin is making a sequel to The Social Network"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.872,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary": "Sony is developing a sequel to \"The Social Network,\" focusing on Facebook's effects on youth mental health and the spread of misinformation. The project, reported by Deadline, serves as a continuation of David Fincher's 2010 film, which chronicled the rise of Facebook. This sequel aims to explore the platform's broader social impacts in recent years.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the sequel to 'The Social Network' and its focus on Facebook's impact on society, specifically youth mental health and misinformation. However, it does not provide actionable insights or report on solutions to these issues."
  },
  {
    "title": "Senators' Staios Faces Key Decisions Ahead of NHL Draft, Free Agency",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:20:20 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "Ottawa Citizen"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "<p>In Ottawa, where “Steady’ Steve Staios holds the reins for a Senators’ organization that seems poised to blossom if the team is managed well this summer, the question is how aggressive will he be? </p>",
      "Steve Staios is keeping his options open as one of the busiest weeks on the National Hockey League schedule kicks into high gear. The Ottawa Senators president of hockey operations and general manager plays his cards close to his vest, but with Round 1 of the NHL draft set for Friday and free agency"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/05/staios.jpg",
    "titles": [
      "Senators Notebook: How aggressive will Staios be during draft, free agency?",
      "Ottawa Senators GM Steve Staios studying roster changes as draft week heats up"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.782,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "Steve Staios, the Ottawa Senators' president of hockey operations and general manager, is navigating a critical period for the team with the NHL draft and free agency approaching. Known as \"Steady\" Steve for his management style, Staios's decisions in the coming week are highly anticipated, as they could significantly impact the Senators' future. The organization is at a potential turning point, with the possibility to advance if managed effectively during this busy time.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides awareness about the critical period the Ottawa Senators are facing, and the potential impact of the upcoming decisions on the team's future. However, it does not provide actionable insights for the reader or report on any specific strategies or solutions."
  },
  {
    "title": "NASA's Perseverance Rover Analyzes Martian Rock \"Kenmore\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:08:38 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "On June 3, NASA's Perseverance Mars rover ground down a portion of a rock surface, blew away the resulting debris, and then went to work studying its pristine interior with a suite of instruments designed to determine its mineralogic makeup and geologic origin. \"Kenmore,\" as nicknamed by the rover s",
      "In addition to drilling rock core samples, the science team has been grinding its way into rocks to make sense of the scientific evidence hiding just below the surface. On June 3, NASA’s Perseverance Mars rover ground down a portion of a rock surface, blew away the resulting debris, and then went to"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-perseverance-rov.jpg",
    "titles": [
      "NASA's Perseverance rover scours Martian rock for details",
      "NASA’s Perseverance Rover Scours Mars for Science"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.779,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "On June 3, NASA's Perseverance Mars rover performed a detailed examination of a Martian rock named \"Kenmore.\" The rover ground down part of the rock's surface, cleared the debris, and analyzed the rock's interior with its instruments to determine its mineral composition and geologic origin. This operation is part of the rover's broader mission to study the Martian surface by drilling and grinding into rocks to uncover scientific evidence hidden beneath.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides a deeper understanding of NASA's ongoing mission on Mars, specifically the Perseverance rover's analysis of Martian rocks. The story highlights progress in space exploration and gives insights into the methods used to study the Martian surface."
  },
  {
    "title": "Akaunu to Join Bournemouth, Rangers Loan Max Aarons from Club",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 06:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Instagram page LFC.academy posted on their account about Cornelius Akaunu, who they claim has agreed a move to Bournemouth.This agreement was confirmed by the player's own Instagram profile, which...",
      "Rangers have signed defender Max Aarons on a season-long loan from Bournemouth."
    ],
    "image_url": "",
    "titles": [
      "Liverpool forward agrees Bournemouth move",
      "Rangers sign Aarons on loan from Bournemouth"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.966,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Cornelius Akaunu is set to join Bournemouth, as confirmed by both the Instagram page LFC.academy and Akaunu's personal account. In a related move, Rangers have secured a season-long loan for defender Max Aarons from Bournemouth.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about player transfers but doesn't offer much depth or insight. There's no mention of how these changes will affect the teams or the players' careers, and no context is provided to help readers understand the significance of these moves."
  },
  {
    "title": "Asian Chip Stocks Surge as Nvidia Hits Record High, Leads Market Value",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 02:46:28 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Asian chip related stocks rise after artificial intelligence darling Nvidia's shares hit a record close to reclaim the title of the world's most valuable company.",
      "How the stock reached a new all-time closing high and reclaimed its spot as the largest company by market capitalization."
    ],
    "image_url": "",
    "titles": [
      "Nvidia’s comeback sparks a rally in Asian chip stocks",
      "Nvidia’s $1.4 trillion comeback is now complete. The stock just closed at a record."
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.894,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Asian chip-related stocks surged following Nvidia's achievement of a record closing high, which also marked its reinstatement as the world's most valuable company by market capitalization. This milestone for Nvidia, a prominent figure in the artificial intelligence sector, influenced the positive trend in the stock market for related industries across Asia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the surge in Asian chip-related stocks and Nvidia's achievement, which is useful for investors and those interested in the tech industry. However, it does not provide deeper insights into the causes or implications of this trend, nor does it highlight any innovative solutions or progress."
  },
  {
    "title": "Ronald Acuña Jr. to Compete in Home Run Derby at Truist Park",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 22:23:38 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Acuña previously lost to division rival Pete Alonso twice",
      "<p>Atlanta&#8217;s hometown hero will be taking part in this year&#8217;s Home Run Derby.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/25/39c5bb40-f8de-4348-a187-7afbdfb01083/acuna-getty.png",
    "titles": [
      "2025 MLB Home Run Derby: Braves' Ronald Acuña Jr. to represent host team in third career derby",
      "Braves’ Ronald Acuna Jr. to participate in Home Run Derby"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.816,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Ronald Acuña Jr., a key player for the Atlanta Braves, will participate in the Home Run Derby at Truist Park on July 14. This marks his return to the event, having previously competed and lost to Pete Alonso twice. Acuña's participation was confirmed on Wednesday, making him the first of eight hitters announced for this year's competition. His entry comes after a strong comeback from a torn left ACL injury earlier in the season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information for sports fans, detailing Ronald Acuña Jr.'s return to the Home Run Derby after an injury. It provides context about his previous performances and the nature of his comeback, but doesn't delve into broader implications or trends in the sport."
  },
  {
    "title": "Canucks Acquire Evander Kane from Oilers in Strategic Trade",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 18:17:04 GMT",
    "source": "Investopedia",
    "sources": [
      "Sportsnet",
      "Investopedia"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Antonio Perez / Chicago Tribune / Tribune News Service via Getty Images Rising grocery prices weigh heavily on American consumers.\" src=\"https://www.investopedia.com/thmb/bUZHJHk_dV8vKXhrY5OuCTxkhwM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-221466",
      "<p>Sportsnet’s Dan Murphy and Elliotte Friedman discuss the Vancouver Canucks’ trade for Evander Kane, how the final year of his contract could motivate him, and what’s next for the Edmonton Oilers.</p>",
      "<p>NHL insider Elliotte Friedman joins FAN Hockey Show to weigh in on the Evander Kane deal from Edmonton to Vancouver, and why he thinks it&#8217;s a case of the Canucks betting on an incredibly motivated Kane looking to have a huge contract year.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/bUZHJHk_dV8vKXhrY5OuCTxkhwM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214667180-6a2aef4b66ac4c48840fbc84d8f3aacd.jpg",
    "titles": [
      "What To Expect From Friday's Inflation Report",
      "What the Canucks can expect from Kane in his contract year",
      "Canucks betting on an incredibly motivated Kane looking to have a big year"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.749,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary": "The Vancouver Canucks have traded for Evander Kane from the Edmonton Oilers, as discussed by Sportsnet's Dan Murphy, Elliotte Friedman, and the FAN Hockey Show. Kane's motivation, driven by the final year of his contract, is highlighted as a significant factor in the deal. Analysts view this move as the Canucks betting on Kane's desire for a standout contract year to benefit their team.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a strategic trade in the hockey world and the motivations behind it. However, it does not report on solutions, improvements, or attempts to solve problems, nor does it significantly increase awareness around systems, causes, or trends."
  },
  {
    "title": "Shell and BP in Talks for Historic Energy Merger",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:22:21 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia",
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Artur Widak / NurPhoto via Getty Images A deal between Shell and BP would combine two massive UK oil companies.\" src=\"https://www.investopedia.com/thmb/qmayuFRfDT-C5St7CwhqlbL2Zf8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206612037-2657c710addd4b",
      "A Shell-BP deal would represent the biggest energy deal of the century—if not ever."
    ],
    "image_url": "https://www.investopedia.com/thmb/qmayuFRfDT-C5St7CwhqlbL2Zf8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206612037-2657c710addd4b9db36f7bbc06586317.jpg",
    "titles": [
      "BP Stock Rises After Report That It's in Merger Talks With Shell",
      "Shell denies reports of BP megamerger of Big Oil rivals"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.72,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary": "Shell and BP, two of the UK's largest oil companies, are reportedly discussing a deal that could become the biggest energy merger of the century. This potential agreement aims to combine the strengths of both companies, potentially reshaping the global energy market. The outcome or current status of these discussions has not been disclosed, indicating that negotiations are possibly ongoing or details are yet to be finalized.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a potential merger between Shell and BP, which could reshape the global energy market. However, it lacks details about the progress of the negotiations or the potential solutions or innovations that this merger could bring about. It also does not provide actionable insights for the reader."
  },
  {
    "title": "WhatsApp rolls out AI-generated summaries for private messages",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T18:02:07-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "WhatsApp can now call on Meta AI to summarize your personal chats. As shown in a GIF, you can access it by tapping the button to unfurl all of your unread messages in a chat. But instead of showing your messages, WhatsApp uses Meta AI to generate a bulleted summary of what you missed. The [&#8230;]",
      "The optional new feature uses Meta AI to summarize unread messages in a chat. This summary would only be visible to you, not others in your chat, the company notes."
    ],
    "image_url": "",
    "titles": [
      "WhatsApp rolls out AI-generated summaries for private messages",
      "Meta is adding AI-powered summaries to WhatsApp"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.81,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.617,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary or more context, it's difficult to evaluate this story. Based on the title alone, it seems to offer basic awareness about a new feature on WhatsApp, but doesn't provide depth or insight into its implications or usefulness."
  },
  {
    "title": "New Maze-Like Material Developed to Block Bacterial Infections",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 03:52:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/revolutionary-material-maze-could-prevent-bacterial-infections/\" rel=\"nofollow\" title=\"Revolutionary “Material Maze” Could Prevent Bacterial Infections\"><img alt=\"Bacteria Petri Dishes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"517\" src=\"https://scitechda"
    ],
    "image_url": "",
    "titles": [
      "Revolutionary “Material Maze” Could Prevent Bacterial Infections"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.915,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "Researchers have developed a new material designed like a maze to prevent bacterial infections. This innovative approach aims to reduce the risk of infections without relying on antibiotics, addressing concerns over antibiotic resistance. The material's structure physically blocks bacteria, potentially revolutionizing how medical devices are manufactured to be infection-resistant.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovative solution to a significant problem - antibiotic resistance. It provides useful insights into a new approach to prevent bacterial infections, thus contributing to the reader's understanding and awareness of advancements in this field."
  },
  {
    "title": "Wigan Athletic Signs Dara Costelloe, Third Forward This Summer",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 07:54:06 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Wigan make Dara Costelloe their third forward signing of the summer."
    ],
    "image_url": "",
    "titles": [
      "Wigan sign Burnley striker Costelloe"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "Wigan Athletic has confirmed the signing of Dara Costelloe, marking him as their third forward acquisition during the summer transfer window. This move is part of the club's efforts to strengthen their attacking options for the upcoming season. Costelloe's arrival follows the signings of two other forwards, indicating a strategic focus on bolstering the team's offensive capabilities.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is slightly more constructive as it provides useful information about Wigan Athletic's strategy for the upcoming season. It also gives readers some insight into the club's decision-making process. However, it could be more constructive if it included more information about the impact of these signings on the team's performance or the league as a whole."
  },
  {
    "title": "Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 02:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The startup aims to boost its R&#038;D and local production capabilities amid growing demand for drones in battlefields and for border surveillance."
    ],
    "image_url": "",
    "titles": [
      "Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.88,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.425,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the funding and growth of a drone startup, which can help readers understand the current trends in the drone industry. It does not, however, provide a solution or innovation, nor does it increase clarity around systems, causes, or impacts."
  },
  {
    "title": "Anthropic now lets you make apps right from its Claude AI chatbot",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T18:33:29-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Anthropic is adding a new feature to its Claude AI chatbot that lets you build AI-powered apps right inside the app. The upgrade, launching in beta, builds upon Anthropic’s Artifacts feature introduced last year that lets you see and interact with what you ask Claude to make. “Start building in the "
    ],
    "image_url": "",
    "titles": [
      "Anthropic now lets you make apps right from its Claude AI chatbot"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.819,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.423,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a new solution for app development. It provides useful information for app developers and increases awareness about the possibilities of AI in app development."
  },
  {
    "title": "Caffeine Linked to Health Benefits via AMPK Activation",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:29:51 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Caffeine appears to do more than perk you up—it activates AMPK, a key cellular fuel sensor that helps cells cope with stress and energy shortages. This could explain why coffee is linked to better health and longer life."
    ],
    "image_url": "",
    "titles": [
      "Scientists reveal your morning coffee flips an ancient longevity switch"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Caffeine activates AMPK, a crucial cellular sensor involved in managing stress and energy deficits. This mechanism may underlie coffee's association with improved health and increased lifespan, offering a scientific explanation for its beneficial effects.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides a deeper understanding of the potential health benefits of caffeine, offering a scientific explanation for its effects. It is useful and informative, even though it does not report on a specific solution or progress."
  },
  {
    "title": "Utah Jazz Surprises by Selecting Ace Bailey as No. 5 Pick",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 03:02:56 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Rutgers forward Ace Bailey said he had \"no idea\" the Jazz had interest in taking him with the No. 5 pick, and a source told ESPN that Utah was not among his preferred destinations."
    ],
    "image_url": "",
    "titles": [
      "Bailey surprised by Jazz: 'No idea' they'd pick me"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.419,
    "summary": "Rutgers forward Ace Bailey was unexpectedly selected by the Utah Jazz with the No. 5 pick, despite Bailey expressing surprise at the choice, as he was unaware of the Jazz's interest in him. Additionally, a source revealed to ESPN that Utah was not on Bailey's list of preferred destinations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a surprising selection in a sports draft but does not provide deeper insights or understanding. It does not report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Brad Feld on “Give First” and the art of mentorship (at any age)",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 23:31:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Brad Feld has spent decades operating by a simple principle: Give without expecting anything in return."
    ],
    "image_url": "",
    "titles": [
      "Brad Feld on “Give First” and the art of mentorship (at any age)"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.835,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.419,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights on mentorship and the concept of 'Give First'. It empowers readers with knowledge that can be applied in their personal and professional lives."
  },
  {
    "title": "Texas A&M AgriLife Boosts Dairy Farms with Automation Tech",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:56:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As the dairy industry increasingly adopts automation with the use of sensors and robotics, researchers at Texas A&amp;M AgriLife are helping producers harness this evolving technology to help optimize production and improve the health and well-being of dairy cattle."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/research-advances-prec.jpg",
    "titles": [
      "Research advances precision dairy care with AI-powered tools"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.792,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417,
    "summary": "Researchers at Texas A&M AgriLife are aiding dairy producers in integrating advanced automation technologies, such as sensors and robotics, into their operations. This initiative aims to enhance production efficiency and promote the health and well-being of dairy cattle. The adoption of these technologies represents a significant shift towards modernizing dairy farming practices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on improvements and innovations in the dairy farming industry. It provides actionable insights to dairy producers about the benefits of integrating advanced automation technologies into their operations. It also promotes a deeper understanding of how these technologies can enhance production efficiency and animal welfare."
  },
  {
    "title": "Research Suggests Sustainable Pub Crawls Can Boost Community and Business",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:58:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Pubs could safeguard their future by creating more collaborative and sustainable pub crawls, according to research by the University of York."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/pub.jpg",
    "titles": [
      "A creative, collaborative and sustainable approach to pub crawls could safeguard the British tradition"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.792,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.407,
    "summary": "Research from the University of York suggests that pubs can secure their future by organizing more collaborative and sustainable pub crawls. This approach aims to foster community engagement and promote responsible drinking, offering a strategic method for pubs to attract customers while contributing positively to their local areas.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it offers actionable insights for pubs looking to attract customers and contribute positively to their communities. It increases awareness of a potentially beneficial strategy (sustainable pub crawls), but doesn't go into great detail about how to implement such a strategy or its potential impacts."
  },
  {
    "title": "75% of Global Glaciers Risk Disappearing, Study Warns",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:30:09 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/glacier-countdown-begins-75-could-vanish-even-if-warming-stops/\" rel=\"nofollow\" title=\"Glacier Countdown Begins: 75% Could Vanish Even If Warming Stops\"><img alt=\"Shallap glacier in Peru\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"499\" src=\"https://scitech"
    ],
    "image_url": "",
    "titles": [
      "Glacier Countdown Begins: 75% Could Vanish Even If Warming Stops"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.818,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary": "A study reported by SciTechDaily finds that 75% of the world's glaciers could disappear, even if global warming halts immediately. The research highlights the urgent need for climate action to preserve the remaining glaciers, which are crucial for the water supply of billions of people. This conclusion underscores the long-term impact of current warming trends on global ice masses.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the potential loss of global glaciers due to climate change. It increases awareness about the urgent need for climate action and the long-term impacts of current warming trends on global ice masses. However, it doesn't provide specific solutions or progress towards mitigating these effects."
  },
  {
    "title": "Volcanoes May Release Gold from Earth's Core, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:05:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/volcanoes-may-be-spewing-gold-from-earths-molten-heart/\" rel=\"nofollow\" title=\"Volcanoes May Be Spewing Gold From Earth’s Molten Heart\"><img alt=\"North Vent Lava Fountain\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images"
    ],
    "image_url": "",
    "titles": [
      "Volcanoes May Be Spewing Gold From Earth’s Molten Heart"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.404,
    "summary": "Recent research suggests that volcanoes could be releasing gold from the Earth's core. This process involves the melting and movement of the Earth's mantle, where gold and other precious metals are carried to the surface by volcanic activity. The findings offer insights into the distribution of gold and its accessibility on the planet's surface.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful scientific information about how gold and other precious metals are distributed on Earth, enhancing our understanding of natural processes. However, it doesn't explicitly report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "After a week, Trump Mobile drops claim that Trump phone is “made in the USA”",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:39:33 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Trump T1 phone isn't \"made in the USA\" but is \"designed with American values.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/trump-mobile-1152x648-1750889842.jpg",
    "titles": [
      "After a week, Trump Mobile drops claim that Trump phone is “made in the USA”"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.82,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.4,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers some insight into the operations of Trump Mobile and its marketing strategies, which could be useful for readers interested in the tech industry or in business ethics. However, it does not report on any progress, improvements, or solutions, and it does not significantly increase awareness of broader trends or systems."
  },
  {
    "title": "Meta’s recruiting blitz claims three OpenAI researchers",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 04:50:12 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the fight for top AI talent, Meta just reportedly snagged a win, poaching three OpenAI researchers despite rival Sam Altman&#8217;s public mockery of Mark Zuckerberg&#8217;s lavish hiring tactics. The latest victory in Zuckerberg&#8217;s widely-reported recruiting blitz: Lucas Beyer, Alexander Ko"
    ],
    "image_url": "",
    "titles": [
      "Meta’s recruiting blitz claims three OpenAI researchers"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.933,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.386,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary or further context, this story offers basic awareness about Meta's recruitment activities but lacks depth or insight. It doesn't provide useful information or report on solutions, improvements, or significant trends."
  },
  {
    "title": "Is DOGE doomed to fail? Some experts are ready to call it.",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 20:40:12 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Trump wants $45M to continue DOGE’s work. Critics warn costs already too high."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/GettyImages-2200068751-1152x648-1750879720.jpg",
    "titles": [
      "Is DOGE doomed to fail? Some experts are ready to call it."
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.787,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.386,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the potential future of DOGE, contributing to readers' understanding and decision-making about cryptocurrency investments. However, it doesn't seem to offer solutions or progress, hence the score."
  },
  {
    "title": "Here are 14 of our favorite deals from Amazon’s early Prime Day sale",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T20:15:33-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon’s next Prime Day event hasn’t officially kicked off yet, but in classic Amazon fashion, the retailer has already dropped a selection of early deals ahead of its four-day sale. While steeper discounts are not likely to arrive until next month, many of the current offers are already worth consi"
    ],
    "image_url": "",
    "titles": [
      "Here are 14 of our favorite deals from Amazon’s early Prime Day sale"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.848,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.381,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about deals available during Amazon's early Prime Day sale, which could be useful for readers planning to shop during the sale. However, it doesn't provide deeper insights or understanding, doesn't report on progress or solutions, and doesn't increase clarity around systems, causes, or impacts."
  },
  {
    "title": "New Bat Viruses Similar to Nipah Found, Pose Human Risk",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:47:25 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Two newly discovered viruses lurking in bats are dangerously similar to Nipah and Hendra, both of which have caused deadly outbreaks in humans. Found in fruit bats near villages, these viruses may spread through urine-contaminated fruit, raising serious concerns. And that’s just the start—scientists"
    ],
    "image_url": "",
    "titles": [
      "New viruses discovered in bats in China could be the next pandemic threat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.696,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.361,
    "summary": "Scientists have identified two new viruses in fruit bats that closely resemble the deadly Nipah and Hendra viruses, which have previously caused fatal outbreaks in humans. These viruses, discovered near human villages, pose a risk of spreading to humans through fruit contaminated with bat urine. This finding raises significant health concerns regarding potential future outbreaks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about potential health risks from newly discovered bat viruses. It provides useful information about the potential for future outbreaks. However, it does not offer actionable insights or discuss any solutions to the problem, making it less constructive."
  }
]