[
  {
    "title": "UFC 319: Du Plessis vs Chimaev Headlines at United Center, Full Coverage Availab",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 06:42:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Yahoo Sports",
      "Al Jazeera",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.aljazeera.com",
      "www.cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Khamzat Chimaev overpowers title holder Dricus Du Plessis in a lopsided UFC title bout in the Octagon.",
      "A look back at everything that went down at the United Center in Chicago",
      "All the information you need to watch UFC 319 live in Chicago",
      "Five key takeaways from UFC 319, including Khamzat Chimaev's dominance but also Dricus du Plessis' incredible heart.",
      "UFC 319 Results: Everything to know about tonight's Dricus du Plessis vs. Khamzat Chimaev fight card - full fight card results, winners, losers, bonuses, scorecards, more",
      "<p>Khamzat Chimaev would simply not be denied. He can now call himself a champion after defeating Dricus Du Plessis to win the middleweight title at UFC 319. </p>"
    ],
    "image_url": "",
    "titles": [
      "UFC 319: Chimaev dominates Du Plessis to win middleweight championship",
      "UFC 319 -- Khamzat Chimaev vs. Dricus du Plessis: Results, winners, highlights, fight card, complete guide",
      "UFC 319 start time -- Dricus du Plessis vs. Khamzat Chimaev: Where to watch, live stream, PPV price, undercard",
      "UFC 319 takeaways: Khamzat Chimaev flings Dricus du Plessis around with the greatest of ease",
      "UFC 319 Results: Winners And Losers Du Plessis Vs. Chimaev Fight Card",
      "Chimaev dethrones Du Plessis for middleweight title at UFC 319"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.972,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.816,
    "summary": "UFC 319 took place at the United Center in Chicago, featuring the main event between Dricus du Plessis and Khamzat Chimaev. The event was covered live with round-by-round updates and included a full fight card with results, winners, losers, bonuses, and scorecards. Daniel Vithlani from SportsLine provided picks for the fights. The preliminary card highlighted fighters such as Baisangur Susurkaev and former champion Jessica Andrade, with live broadcasts available on Sportsnet 360 and Sportsnet+. The event started at 7:50 p.m. ET / 4:50 p.m. PT.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 90 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canada Orders Air Canada Strike to Arbitration, Ends Travel Chaos",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:48:06 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "Al Jazeera",
      "Financial Post",
      "Deutsche Welle",
      "NPR",
      "Washington Post",
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "fortune.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.npr.org",
      "financialpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Canada's government forced Air Canada and its striking flight attendants back to work and into arbitration Saturday after a work stoppage stranded more than 100,000 travelers around the world.",
      "Jobs minister says full resumption of services could take days, arbitration means 10,000 cabin crew will return to work.",
      "More than 100,000 passengers were left stranded after Air Canada's flight attendants went on strike. Canada's government says it is stepping in to avoid lasting economic damage.",
      "Canada&rsquo;s government has forced Air Canada and the union representing flight attendants into arbitration after a work stoppage stranded more than 100,000 travelers around the world during the peak summer travel season",
      "Jobs Minister Patty Hajdu ordered the sides to arbitration. The decision ended an hours-long strike that led the flag carrier to cancel hundreds of flights.",
      "Ahead of the work stoppage, the airline said it had canceled most of the 700 flights that it directly operates, which carry about 130,000 people each day.",
      "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
      "The federal government ordered Air Canada and its flight attendants into binding arbitration on Saturday, putting an abrupt end to a strike and lockout that began less than 12 hours earlier with grounded planes and thousands of Canadians struggling to find alternate ways home. Jobs Minister Patty Ha",
      "CALGARY, Alberta &#8212; CUPE 4095 President Tyler McBain, CUPE Alberta President Raj Uppal, and AFL President Gil McGowan will address striking Air Canada flight attendants. Following this, members of the CUPE 4095 Strike Committee will be available for comment on the current Air Canada strike and "
    ],
    "image_url": "",
    "titles": [
      "Government forces Air Canada flight attendants back to work, into arbitration",
      "Government forces Air Canada into arbitration in bid to end strike",
      "Air Canada: Gov't forces striking cabin crew back to work",
      "Government forces Air Canada and flight attendants back to work and into arbitration",
      "Canada orders Air Canada flight attendants back to work, ending strike",
      "Air Canada’s Flight Attendants Begin Strike, Crippling the Airline",
      "Government forces Air Canada and flight attendants back to work and into arbitration, after strike strands over 100,000 travelers",
      "Ottawa imposes binding arbitration, forcing Air Canada flight attendants back to work",
      "Media Advisory for CUPE Air Canada Flight Attendants"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.669,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.788,
    "summary": "The Canadian government intervened in the Air Canada flight attendants' strike, ordering the airline and its striking employees back to work and into arbitration. This move came after the strike stranded over 100,000 travelers globally. Jobs Minister Patty Hajdu's decision aims to resolve the dispute and has led to the cancellation of hundreds of flights, affecting around 130,000 daily passengers. The full resumption of services is expected to take days, but the arbitration means that 10,000 cabin crew members will return to work, ending the work stoppage that significantly disrupted travel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 95 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Phillies' Zack Wheeler on 15-Day IL for Shoulder Blood Clot, Return Uncertain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 23:30:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Forbes",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "There is currently no timetable for Wheeler's return",
      "Wheeler pitched Friday against Washington and then later that night a clot was discovered in his arm.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNTGtpdWVmcEhOMS1PbTZ1QU81REk5RmZrSnRCZ0tCbGxiWTZDclZVQm4tVC1QYnZXZktVSEdVc2hraEFjZTgxOHJHSlROYlg4RC1wV3ZmaTVuZmNzQmlnVnVwTjdHdGlOQ2dvNW43anUzSnh4c1NXdURGdXdkTnhIeA?oc=5\" target=\"_blank\">Phillies to Put Zack Wheeler on Injured List With Blo",
      "<p>The Philadelphia Phillies placed ace Zack Wheeler on the 15-day injured list Saturday with a blood clot in his right arm.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/16/fa27dc48-eb03-4673-a999-25a9aa61d39e/081625-zachwheeler.jpg",
    "titles": [
      "Zack Wheeler injury update: Phillies place ace on IL due to blood clot near right shoulder",
      "Phillies Ace Zack Wheeler Goes On IL With Blood Clot In Throwing Arm",
      "Phillies to Put Zack Wheeler on Injured List With Blood Clot - Sports Illustrated",
      "Phillies ace Zack Wheeler diagnosed with blood clot in right arm, placed on 15-day IL"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.836,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary": "Philadelphia Phillies pitcher Zack Wheeler has been put on the 15-day injured list due to a blood clot near his right shoulder. There is no set timeline for his return.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "States Deploy National Guard to D.C. Amid Crime Concerns, Sparking Protests",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 17 Aug 2025 03:34:37 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "West Virginia said it was deploying 300 to 400 Guard troops, while South Carolina pledged 200 and Ohio says it will send 150 in the coming days, marking a significant escalation of the federal intervention.",
      "Three Republican-led states are sending their National Guard troops to aid President Donald Trump's effort to combat an \"out of control\" crime wave in the US capital.",
      "<p>South Carolina and Ohio join West Virginia in pledging troops, fueling protests that<strong> </strong>national guard should not be used for ‘a political policing mission’</p><p>Three states have moved to deploy hundreds of members of their national guard to the nation’s capital as part of the <a "
    ],
    "image_url": "",
    "titles": [
      "Three Republican-led states to send hundreds of National Guard troops to Washington",
      "US states to deploy National Guard troops to Washington, DC",
      "Three states to deploy hundreds of national guard troops to Washington DC"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.989,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary": "Three Republican-led states, West Virginia, South Carolina, and Ohio, are deploying a total of 650 to 750 National Guard troops to Washington, D.C., in response to President Donald Trump's call to address what he describes as an \"out of control\" crime wave. This move has sparked protests and criticism regarding the use of the National Guard for what some see as a political policing mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hurricane Erin Downgrades, Lowers Threat to Bahamas, U.S. East Coast",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:34:53 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "The Guardian",
      "Deutsche Welle",
      "NPR",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.forbes.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "Hurricane Erin exploded in strength to a Category 5 storm in the Caribbean before weakening on Saturday, the National Hurricane Center said.",
      "Erin is the Atlantic season's first hurricane and is set to escalate over the weekend though the threat of direct impacts in the Bahamas and along the east coast of the US appears to be receding.",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE5KSHlwaFhpSmdvS1lpdnpEdFR0ZWQ0MzdpRTZSYU8yYnpqU25zY0NkWVZ6eGNPc0NLam43U1VJTWZvVmlfclh2S0taUUlSa0VfZ0c4SEhLUTV0V3dPVVZLQ2lEaGU1NU56V1VrbGFCaENfdw?oc=5\" target=\"_blank\">Hurricane Erin strengthens to Category 5</a>&nbsp;&nbsp;<font color=\"#6f6",
      "Erin has become the first hurricane of the Atlantic season with strong waves and rip currents possible along the East Coast of the United States as early as next week.",
      "<p>Erin not expected to make landfall, though nearby islands, including Puerto Rico, brace for flooding</p><p><a href=\"https://www.theguardian.com/world/hurricanes\">Hurricane</a> Erin has intensified into a category 5 storm as it churns its way over the Atlantic, brushing past islands in the north-e",
      "The Atlantic’s first hurricane of the season had maximum sustained winds of 160 miles per hour, forecasters said."
    ],
    "image_url": "",
    "titles": [
      "Category 4 Hurricane Erin moves past northern Caribbean islands",
      "Hurricane Erin intensifies into a Category 5 storm",
      "Hurricane Erin strengthens to Category 5 - Axios",
      "Hurricane Erin tracker: Storm weakens to Category 4 but remains powerful",
      "Hurricane Erin intensifies to category 5, moving through north-east Caribbean",
      "Hurricane Erin Strengthens To Category 5 Storm—Here’s What To Expect"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.666,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.773,
    "summary": "Hurricane Erin escalated to a Category 5 storm, marking the first hurricane of the Atlantic season, before weakening on Saturday. Although it initially posed a threat to the Bahamas and the U.S. East Coast, the risk of direct impacts is now decreasing. Despite not being expected to make landfall, Erin could still cause strong waves, rip currents, and potential flooding in nearby islands, including Puerto Rico. The hurricane had reached maximum sustained winds of 160 miles per hour.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Israel Plans Military Offensive in Northern Gaza, to Relocate Palestinians",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 18:40:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Deutsche Welle",
      "Global News",
      "Al Jazeera"
    ],
    "domains": [
      "globalnews.ca",
      "www.aljazeera.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Plans move ahead for a military offensive in some of the territory&#039;s most populated areas, amid move to seize Gaza City.",
      "The announcement comes days after Israel said it would launch an offensive to take control of northern Gaza City.",
      "Israel plans to relocate Palestinians in Gaza ahead of new offensives in dense areas. Families of hostages call for national protests; airstrikes, malnutrition toll rise.",
      "NAHARIYA, Israel (AP) — Israel announced Saturday that it is preparing to move Palestinians from combat zones to southern Gaza as plans move ahead for a military offensive in some of the territory&#8217;s most populated areas. The Israeli military body in charge of humanitarian aid to Gaza, COGAT, s"
    ],
    "image_url": "",
    "titles": [
      "Israel preparing to forcibly displace Palestinians to southern Gaza",
      "Israel announces plan to move Palestinians to southern Gaza",
      "Israel prepares to move Palestinians to southern Gaza as Israelis urge mass protest over conflict",
      "Israel prepares to move Palestinians to southern Gaza as Israelis urge mass protest over war"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.756,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.769,
    "summary": "Israel has announced plans for a military offensive in northern Gaza City, aiming to take control of the area. As part of the preparation, Israel intends to relocate Palestinians from combat zones to southern Gaza, focusing on densely populated regions. This announcement follows concerns over rising airstrikes and malnutrition tolls. Additionally, families of hostages are calling for national protests in response to the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "State Department Suspends Medical Visa Program for Palestinians After Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:55:38 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The State Department announcement came after a right-wing activist criticised the programme.",
      "The move comes after far-right activist Laura Loomer drew attention to a video posted by the nonprofit HEAL Palestine and called the visas a “national security threat.”",
      "The move blocked a pathway for those seeking medical care in the United States, including young children, who have arrived in recent weeks with serious conditions."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/06ba/live/dda25b30-7af0-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "US halts visitor visas used for medical trips from Gaza",
      "U.S. halts visitor visas for Gazans, including humanitarian medical visas",
      "U.S. Pauses Visitor Visas for Gazans After Laura Loomer Posts"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.826,
      "consensus": 0.897,
      "constructiveness": 0.056,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary": "Following criticism from far-right activist Laura Loomer, who labeled a visa program for Palestinians seeking medical care in the U.S. a \"national security threat,\" the State Department has halted the initiative. This decision affects individuals, including young children with serious health conditions, who have sought medical treatment in the United States in recent weeks. The program's suspension was announced after Loomer highlighted a video by the nonprofit HEAL Palestine.",
    "constructiveness_score": 0.056,
    "constructiveness_reason": "1 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Itauma Knocks Out Whyte in First Round, Maintains Undefeated Record",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 22:22:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "The Guardian",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Itauma dispatched of his hardest test to date in incredible fashion on Saturday night",
      "<ul><li><p>Winner extends perfect record and closer to world title shot</p></li><li><p>Veteran sent crashing to canvas within two minutes</p></li></ul><p>Moses Itauma blew away Dillian Whyte with a devastating first-round knockout in their all-British heavyweight clash in Riyadh. The 20-year-old ext",
      "Live results from Riyadh: Moses Itauma vs. Dillian Whyte headlines a stacked card featuring Nick Ball, Sam Goodman, Filip Hrgovic, and more."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/16/c492e12f-f092-43a2-9255-0efb69e3bfd6/moses-itauma-whyte-action.jpg",
    "titles": [
      "Moses Itauma, rising heavyweight prospect at just 20, thrills with first-round knockout of Dillian Whyte",
      "Moses Itauma stuns Dillian Whyte with devastating first-round knockout",
      "Moses Itauma Vs. Dillian Whyte Full Card Results And Highlights"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.817,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary": "Moses Itauma achieved a significant victory by knocking out Dillian Whyte in the first round of their heavyweight fight in Riyadh. This win maintains Itauma's unbeaten record and moves him closer to a world title opportunity. The match ended within two minutes, marking an impressive performance against the veteran Whyte.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Government Mandates Arbitration for Air Canada Strike, Aims to End Disruptions",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 02:53:00 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Air travellers across the country continued dealing with hundreds of grounded planes on Saturday as the federal government announced it was ordering a binding arbitration in a labour strife between Air Canada and its 10,000 flight attendants on strike. In Ontario, passengers who had received notice ",
      "Air travellers across the country continued dealing with hundreds of grounded planes on Saturday as the federal government announced it was ordering a binding arbitration in a labour strife between Air Canada and its 10,000 flight attendants on strike. In Ontario, passengers who had received notice "
    ],
    "image_url": "",
    "titles": [
      "Travellers stranded despite federal intervention into Air Canada labour strife",
      "Travellers stranded despite federal intervention into Air Canada labour strife"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.897,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.709,
    "summary": "The federal government has mandated binding arbitration to address the labor dispute between Air Canada and its 10,000 striking flight attendants, leading to hundreds of flight cancellations nationwide. This decision aims to resolve the ongoing issue and mitigate further travel disruptions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump-Putin Meeting Ends Without Ukraine Ceasefire Deal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 09:00:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The anticipated meeting between Donald Trump and Vladimir Putin ended without a ceasefire deal in Ukraine.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQbW12V1lYcm5IcFhnbmpxUFVZUGlQdXdnbFdaQmZPZ2dWdDRCYmx2TFVUTVdyeEJqQVg1M2V0T1BCZUFjSEhBeUxGUHZ0UFV6WE12UnZEMUtKUk53UkE5ajZrZUp3YXhRcmc3N1BfaTNkWVFaV0Z4SHdvbHN4U29ZcVE1WQ?oc=5\" target=\"_blank\">Trump-Putin summit starts on red carpet, ends in ",
      "President Trump dropped his demand for an immediate ceasefire in Ukraine after meeting with Russian President Vladimir Putin. Here are five takeaways from Alaska."
    ],
    "image_url": "",
    "titles": [
      "Trump-Putin summit ends with no ceasefire deal",
      "Trump-Putin summit starts on red carpet, ends in confusion - Axios",
      "Key takeaways from Trump-Putin summit and dramatic ceasefire reversal"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.618,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary": "The anticipated meeting between Donald Trump and Vladimir Putin concluded without reaching a ceasefire agreement in Ukraine. Despite initial demands, President Trump dropped the call for an immediate ceasefire after their discussions. The summit, which began on a note of formality, ended without a resolution to the conflict in Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Monasterio's 11th-Inning Homer Secures Record 14th Win for Brewers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 03:00:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Andruw Monasterio hit a three-run home run in the 11th inning, and the Milwaukee Brewers won their franchise-record 14th game.",
      "Andruw Monasterio played hero with a three-run home run in the 11th inning"
    ],
    "image_url": "",
    "titles": [
      "Brewers rally again to win record 14th straight",
      "Brewers set franchise record with 14th straight win after crucial Reds error leads to extra innings"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.978,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary": "Andruw Monasterio's three-run home run in the 11th inning led the Milwaukee Brewers to their franchise-record 14th win. Monasterio's heroics secured the victory for the team, showcasing his impactful performance in the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Chargers' Quentin Johnston Suffers Concussion in Preseason Game Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 03:00:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chargers WR Quentin Johnston exited Saturday's preseason game on a cart after taking a big hit that left him motionless for several minutes, and head coach Jim Harbaugh said he has a concussion.",
      "Johnston remained down for several minutes after taking a hard hit on a deep ball attempt"
    ],
    "image_url": "",
    "titles": [
      "Chargers' Johnston has concussion after hard hit",
      "Quentin Johnston injury update: Chargers wide receiver carted off after big hit, diagnosed with concussion"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.978,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary": "Chargers wide receiver Quentin Johnston was carted off the field during a preseason game after a severe hit left him motionless for several minutes. Coach Jim Harbaugh confirmed Johnston suffered a concussion. His condition was monitored following the incident, emphasizing the impact of the collision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Myles Straw Powers Blue Jays to Win; Brewers Set Record with 14th Straight Victo",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 16 Aug 2025 22:24:43 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Myles Straw followed an early three-run homer with a two-run shot for his first career multihomer game as the Toronto Blue Jays throttled the Texas Rangers 14-2 on Saturday.",
      "<p>Myles Straw hit two home runs and added five RBIs to his season tally, Davis Schneider hit a three-run shot, and the Toronto Blue Jays crushed the Texas Rangers 14-2.</p>",
      "<p>Ben Rice belted one of the game’s six home runs and matched his career high of 7 RBIs as the New York Yankees outlasted the St. Louis Cardinals in a 12-8 slugfest. Aaron Judge picked up his 39th home run in the win. </p>",
      "<p>Andruw Monasterio hit a three-run home run in the 11th inning and the Milwaukee Brewers won their franchise-record 14th straight game, 6-5 over the Cincinnati Reds.</p>",
      "<p>Nolan McLean struck out eight over 5.1 scoreless innings in his MLB debut, and Pete Alonso and Francisco Lindor supplied the offence with a pair of RBI doubles as the New York Mets defeated the Seattle Mariners 3-1.</p>",
      "<p>A pair of hits in the eighth from Chicago Cubs’ Seiya Suzuki and Nico Hoerner solidified a 3-1 win over the Pittsburgh Pirates. Chicago’s Shota Imanaga tossed seven dominant innings on the mound, conceding just three hits while striking out six.</p>",
      "<p>Cade Cavalli earned his first career MLB victory after pitching a seven-inning gem with five strikeouts, as the Washington Nationals blanked the Philadelphia Phillies 2-0.</p>",
      "<p>Kerry Carpenter hit a solo home run, Casey Mize struck out 10 batters and pitched into the seventh inning, and the Detroit Tigers took an 8-5 win over the Minnesota Twins.</p>",
      "<p>Michael Harris II went two-for-five with three RBIs and home run while Joey Wentz pitched six solid innings for the Atlanta Braves as they blow past the Cleveland Guardians 10-1. </p>",
      "<p>Ramon Urias beat Jackson Holliday’s throw to first, allowing Carlos Correa to score from third as the Houston Astros outlasted the Baltimore Orioles 5-4 in 12 innings.</p>",
      "<p>Teoscar Hernandez recorded his 20th home run of the season while Michael Conforto tallied two hits and two RBIs as the Los Angeles Dodgers shut out the San Diego Padres 6-0. Blake Snell tossed six scoreless innings to earn the win.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/4f36095058689892e1a7d5c8f6b2eaa6f1ff8d4993775f25defd11751d5109d7.jpg?quality=65&strip=all",
    "titles": [
      "Straw stirs Blue Jays to 14-2 rout of Rangers",
      "MLB Highlights: Blue Jays 14, Rangers 2",
      "MLB Highlights: Yankees 12, Cardinals 8",
      "MLB Highlights: Brewers 6, Reds 5 (F/11)",
      "MLB Highlights: Mets 3, Mariners 1",
      "MLB Highlights: Cubs 3, Pirates 1",
      "MLB Highlights: Nationals 2, Phillies 0",
      "MLB Highlights: Tigers 8, Twins 5",
      "MLB Highlights: Braves 10, Guardians 1",
      "MLB Highlights: Astros 5, Orioles 4 (F/12)",
      "MLB Highlights: Dodgers 6, Padres 0"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.817,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.686,
    "summary": "Myles Straw led the Toronto Blue Jays to a 14-2 victory over the Texas Rangers with his first career multihomer game, contributing five RBIs. In other MLB action, the New York Yankees defeated the St. Louis Cardinals 12-8, with Ben Rice tying his career high of 7 RBIs. The Milwaukee Brewers set a franchise record with their 14th consecutive win, beating the Cincinnati Reds 6-5. Nolan McLean had a standout MLB debut in the New York Mets' 3-1 win against the Seattle Mariners. The Washington Nationals, Detroit Tigers, Atlanta Braves, Houston Astros, and Los Angeles Dodgers also secured wins in th",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 105 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Crystal Palace to Open 2025/26 Season Against Chelsea at Stamford Bridge",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 06:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "onefootball.com"
    ],
    "snippets": [
      "Crystal Palace begin their 2025/26 Premier League campaign with a challenging London derby away to Chelsea, but they do so as a club brimming with confidence. The Eagles head to Stamford Bridge as the...",
      "Enzo Maresca’s Chelsea kick off their 2025-/26 Premier League campaign at home to Crystal Palace on Sunday with expectations significantly raised. After guiding the Blues to a top-four finish in his...",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNUUxoMVlJUzlrWDZxRXZMOWR4ZHYxYnlla09lNDV2VWtHMzlxeXpqb2ZyNnQ0ZmdfSFpfVDV1LWVrb2JZVFI3Tm1INlItcXZPREFUNGFJb1EzbkZyd1JzTE1FaW9URlRCbUhUWnpxdXVxSzFUNFlwQkI3Y0VrSl9JbmhR?oc=5\" target=\"_blank\">Chelsea Predicted Lineup vs. Crystal Palace: Maresc"
    ],
    "image_url": "",
    "titles": [
      "Crystal Palace XI vs Chelsea – Predicted lineup and team news",
      "Chelsea vs Crystal Palace – Predicted lineup and team news",
      "Chelsea Predicted Lineup vs. Crystal Palace: Maresca Hands Gittens, Hato Premier League Debuts - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.974,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "Crystal Palace is set to face Chelsea in their opening match of the 2025/26 Premier League season. The game, a London derby at Stamford Bridge, sees Palace entering with high confidence, while Chelsea, under Enzo Maresca, begins the season with heightened expectations following a top-four finish previously.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Colombian Scores in Bayern's German Supercup Win; Miss on Woltemade Signing",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 04:34:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Colombian winger scores on his competitive debut for Bayern Munich in a victory over Stuttgart in the German Supercup.",
      "Bayern Munich has won the Franz-Beckenbauer-Supercup but has lost out on signing Nick Woltemade."
    ],
    "image_url": "",
    "titles": [
      "Luis Diaz scores for Bayern Munich to win German Supercup on debut",
      "Bayern Munich Win Franz-Beckenbauer-Supercup But Lose Out On Woltemade"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.929,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Colombian winger scores in Bayern Munich's win over Stuttgart in the German Supercup. Bayern Munich clinches the Franz-Beckenbauer-Supercup title. However, the team misses out on signing Nick Woltemade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/germany.svg",
      "thumbnail": "icons/germany.svg",
      "alt": "german flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Shifts Strategy, Adds Pressure on Ukraine Ahead of White House Visit",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 21:40:53 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Trump’s swerve increases pressure on the Ukrainian leader as he heads to the White House on Monday to make his case.",
      "President Trump’s break from a strategy agreed to with European allies could give President Vladimir V. Putin of Russia an edge as talks to end the fighting continue."
    ],
    "image_url": "",
    "titles": [
      "Trump drops ceasefire demand for Ukraine war, tells allies Putin wants land",
      "Trump Backs Off Cease-Fire Demand in Ukraine War, Aligning With Putin"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.805,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "President Trump's deviation from a previously agreed strategy with European allies has intensified pressure on the Ukrainian leader ahead of his White House visit on Monday. This shift could potentially benefit Russian President Vladimir V. Putin amid ongoing negotiations to cease hostilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "UFC 319: Murphy KOs Pico, Chimaev Wins Middleweight Belt",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 06:48:03 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Lerone Murphy stakes his claim for a title shot with a sensational knockout of Aaron Pico, while Khamzat Chimaev dominates Dricus du Plessus to win the middleweight belt at UFC 319.",
      "Lerone Murphy stakes his claim for a title shot with a sensational knockout of Aaron Pico, while Khamzat Chimaev dominates Dricus du Plessus to win the middleweight belt at UFC 319."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e365/live/a67fd540-7b24-11f0-b89e-b9cbd0c3f8d4.jpg",
    "titles": [
      "Britain's Murphy stakes title claim with sensational knockout",
      "Britain's Murphy stakes title claim with sensational knockout"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.953,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary": "At UFC 319, Lerone Murphy impressed with a knockout victory over Aaron Pico, positioning himself for a title shot. Meanwhile, Khamzat Chimaev secured the middleweight belt by dominating Dricus du Plessus. Both fighters showcased their skills and potential for future success in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Putin Proposes Freeze on Ukraine Frontline, Challenges NATO Expansion",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:11:05 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Russian president reiterated ‘core demands’ that would undermine Ukraine’s statehood and roll back Nato expansion",
      "<p>Putin told Trump he would halt further advances and freeze Ukrainian frontline where Russian forces occupy significant areas, sources say</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/aug/16/zelenskyy-to-meet-trump-on-monday-putin-alaska-summit-briefing\">Zelenskyy to meet Trump on"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fdc7c83e9-e44e-4278-b3c8-810a474a1605.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Putin demanded Ukraine cede Donetsk and Luhansk in exchange for freezing rest of front line",
      "Putin demands full control of Donetsk and Luhansk as condition for ending Ukraine war – live"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.749,
      "consensus": 0.682,
      "constructiveness": 0.075,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary": "Russian President Putin has reiterated demands that challenge Ukraine's sovereignty and seek to reverse NATO expansion. He has proposed halting Russian advances and maintaining the current frontline in Ukraine, where Russian forces control significant territories. This development comes as Ukrainian President Zelenskyy is scheduled to meet with former U.S. President Trump.",
    "constructiveness_score": 0.075,
    "constructiveness_reason": "1 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Air Canada Strike Ends, Normal Operations to Resume After Arbitration",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 20:10:13 +0000",
    "source": "New York Times",
    "sources": [
      "Global News",
      "New York Times"
    ],
    "domains": [
      "globalnews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "A walkout by flight attendants ended after about 12 hours with the imposition of binding arbitration. But getting travel back to normal will take days.",
      "Over 10K Air Canada flight attendants locked out as strike grounds flights; union cites pay dispute as tensions with airline escalate."
    ],
    "image_url": "https://static01.nyt.com/images/2025/08/16/multimedia/16int-canada-air-zqgv/16int-canada-air-zqgv-mediumSquareAt3X.jpg",
    "titles": [
      "Government Shuts Down Air Canada Strike That Grounded Hundreds of Flights",
      "Air Canada passengers left scrambling as strikes keep flights grounded"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.78,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary": "A 12-hour walkout by over 10,000 Air Canada flight attendants, due to a pay dispute, ended with binding arbitration being imposed. Although the strike has ceased, restoring normal travel operations is expected to take several days. The strike initially grounded flights, highlighting escalating tensions between the union and the airline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "US President Shifts Stance to Favor Ukraine Peace Deal; Meeting Planned",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 14:21:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US president changes position on Ukraine, saying he prefers direct peace accord instead of ceasefire after Alaska talks.",
      "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\""
    ],
    "image_url": "",
    "titles": [
      "Trump to meet Ukraine’s Zelenskyy after ‘successful’ talks with Putin",
      "Zelenskyy to meet with Trump after Putin talks end without a ceasefire"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.691,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "The US President has shifted his stance on Ukraine, now favoring a direct peace agreement over a ceasefire following discussions in Alaska. Ukrainian President Zelenskyy announced plans to meet with Trump on Monday to explore options for ending the conflict and the associated violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Ex-Air Canada Lawyer Faces Conflict Claims in Flight Attendant Strike Case",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 02:23:18 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "TORONTO &#8212; In an almost unthinkable display of conflict-of-interest, a former Air Canada legal counsel, Maryse Tremblay, will rule on whether to end job action by striking Air Canada flight attendants at the Canada Industrial Relations Board. CUPE requested Tremblay recuse herself from chairing"
    ],
    "image_url": "",
    "titles": [
      "CUPE: Former Air Canada Counsel to Decide Whether to End CUPE-Air Canada Dispute in Clear Conflict-of-interest"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.888,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.53,
    "summary": "Former Air Canada legal counsel, Maryse Tremblay, now at the Canada Industrial Relations Board, is set to decide on ending a strike by Air Canada flight attendants. CUPE, representing the attendants, has requested Tremblay to step down from this role due to a potential conflict of interest, given her previous employment with Air Canada. The current status of her involvement and the decision on the job action remains pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Canada Gov Faces Critique for Airline Dispute Intervention",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 02:49:53 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "OTTAWA &#8212; The federal Liberal government is defending its decision to intervene to resolve a labour dispute at Canada&#8217;s largest airline amid criticism from unions and opposition parties that the move sides with big business. Jobs Minister Patty Hajdu said Saturday that she directed the Ca"
    ],
    "image_url": "",
    "titles": [
      "Liberals defend stepping in to end dispute between Air Canada and flight attendants"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.896,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.524,
    "summary": "The Canadian federal government, led by the Liberal party, is facing criticism for intervening in a labor dispute at the country's largest airline. Critics, including unions and opposition parties, argue that the government's intervention favors big business. Jobs Minister Patty Hajdu defended the decision, stating it was necessary to protect jobs and maintain stability.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Gen Z Adapts to Tough Tech Job Market with AI, Networking, and Résumé Revamps",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-08-17T07:51:01Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Gen Zers said they're using AI, building a network, and polishing their résumés in a tough tech job market. Others are considering career pivots."
    ],
    "image_url": "https://i.insider.com/689f8bafa17a8c5b4052fae8?format=jpeg",
    "titles": [
      "How Gen Zers are landing roles in tech &mdash; or pivoting away"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.078,
      "proximity": 0.5
    },
    "score": 0.502,
    "summary": "In response to a challenging tech job market, members of Generation Z are adopting various strategies to improve their employment prospects. These strategies include utilizing artificial intelligence tools, expanding their professional networks, and refining their résumés. Additionally, some are contemplating changing their career paths to adapt to the current market conditions.",
    "constructiveness_score": 0.078,
    "constructiveness_reason": "1 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/chart-up.svg",
      "thumbnail": "icons/chart-up.svg",
      "alt": "market",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "OpenAI Launches ChatGPT Study Mode, Explores Mental Health Uses",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 03:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "OpenAI announced the ChatGPT Study Mode, a boon to learners. It seems to be based on custom instructions. Can we do the same for mental health? Here's the inside scoop."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/688c0c96c090026c35819b51/0x0.jpg?width=960",
    "titles": [
      "Psychologists And Mental Health Experts Spurred To Use Custom Instructions And Make AI Into A Therapist Adjunct"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "OpenAI introduced ChatGPT Study Mode, designed to aid learners with personalized instructions. The tool's potential for mental health applications is being considered. The outcome of this exploration is currently unknown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Magnetic State \"Vortion\" Discovered, Could Impact Future Tech",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 04:51:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-create-new-magnetic-state-the-magneto-ionic-vortex-vortion/\" rel=\"nofollow\" title=\"Scientists Create New Magnetic State: The Magneto-Ionic Vortex (“Vortion”)\"><img alt=\"Physics Spiral Electric Magnetism Art Concept\" class=\"webfeedsFeaturedVisual wp-post-i"
    ],
    "image_url": "",
    "titles": [
      "Scientists Create New Magnetic State: The Magneto-Ionic Vortex (“Vortion”)"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.935,
      "consensus": 0.393,
      "constructiveness": 0.143,
      "proximity": 0.5
    },
    "score": 0.49,
    "summary": "Scientists have developed a new magnetic state called the Magneto-Ionic Vortex, or \"Vortion.\" This state combines electric and magnetic properties in a unique way. The discovery could have implications for future technologies. The research sheds light on the complex behavior of magnetic materials and opens up new possibilities for innovation in the field of magnetics.",
    "constructiveness_score": 0.143,
    "constructiveness_reason": "2 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Quantum Material Developed to Boost Quantum Computer Stability",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:50:10 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Researchers have unveiled a new quantum material that could make quantum computers much more stable by using magnetism to protect delicate qubits from environmental disturbances. Unlike traditional approaches that rely on rare spin-orbit interactions, this method uses magnetic interactions—common in"
    ],
    "image_url": "",
    "titles": [
      "This simple magnetic trick could change quantum computing forever"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.915,
      "consensus": 0.393,
      "constructiveness": 0.071,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary": "Researchers have developed a new quantum material designed to enhance the stability of quantum computers. This material utilizes magnetic interactions to shield qubits, the fundamental units of quantum computers, from environmental disturbances. This approach differs from traditional methods that depend on rare spin-orbit interactions, offering a potentially more robust and widespread solution for protecting qubits.",
    "constructiveness_score": 0.071,
    "constructiveness_reason": "1 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/atom.svg",
      "thumbnail": "icons/atom.svg",
      "alt": "quantum",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Finland Scientists Discover Heaviest Nucleus with Proton Emission",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:57:12 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists in Finland have measured the heaviest known nucleus to undergo proton emission, discovering the rare isotope 188-astatine. It exhibits a unique shape and may reveal a new kind of nuclear interaction."
    ],
    "image_url": "",
    "titles": [
      "Scientists stunned by record-breaking, watermelon-shaped nucleus"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "Scientists in Finland have discovered the heaviest nucleus known to undergo proton emission, identifying it as the rare isotope 188-astatine. This finding is significant as it not only highlights a unique shaped nucleus but also suggests the possibility of a new type of nuclear interaction.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Black Metal Device Boosts Solar Power Efficiency by 15 Times",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 04:01:16 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/solar-power-reimagined-new-black-metal-device-generates-15x-more-electricity/\" rel=\"nofollow\" title=\"Solar Power Reimagined: New “Black Metal” Device Generates 15x More Electricity\"><img alt=\"Close Up of the High Efficiency STEG\" class=\"webfeedsFeaturedVisual wp-pos"
    ],
    "image_url": "",
    "titles": [
      "Solar Power Reimagined: New “Black Metal” Device Generates 15x More Electricity"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.919,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "Researchers have developed a new \"black metal\" device that significantly enhances solar power efficiency, generating 15 times more electricity than current models. This breakthrough in solar technology could lead to more effective and sustainable energy solutions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Perseverance Rover Sends Back Sharpest Mars Photos Yet",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:39:25 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/stunning-new-nasa-perseverance-rover-images-show-mars-clearer-than-ever-before/\" rel=\"nofollow\" title=\"Stunning New NASA Perseverance Rover Images Show Mars Clearer Than Ever Before\"><img alt=\"NASA Mars Falbreen Mosaic Enhanced Color\" class=\"webfeedsFeaturedVisual w"
    ],
    "image_url": "",
    "titles": [
      "Stunning New NASA Perseverance Rover Images Show Mars Clearer Than Ever Before"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.839,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.463,
    "summary": "NASA's Perseverance Rover has captured new images of Mars, providing clearer views of the planet's surface than ever before. These high-resolution photos offer detailed insights into Mars' geological features, aiding scientists in their research on the planet's environment and history. The images have been shared publicly, allowing for widespread access to the latest visual data from Mars.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Big Tech Promotes Generative AI as Future-Changing Technology",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sat, 16 Aug 2025 18:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Big tech company hype sells generative artificial intelligence (AI) as intelligent, creative, desirable, inevitable, and about to radically reshape the future in many ways."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/australiana-images-mad.jpg",
    "titles": [
      "'Australiana' images made by AI are racist and full of tired cliches, researchers say"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.816,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "Big tech companies are promoting generative artificial intelligence (AI) as a transformative technology, highlighting its intelligence, creativity, desirability, and inevitability. They claim it will significantly alter the future across various sectors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Black Holes Studied as Cosmic Supercolliders in Dark Matter Hunt",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:14:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-eye-black-holes-as-cosmic-supercolliders-in-the-hunt-for-dark-matter/\" rel=\"nofollow\" title=\"Scientists Eye Black Holes as Cosmic Supercolliders in the Hunt for Dark Matter\"><img alt=\"Supermassive Black Hole\" class=\"webfeedsFeaturedVisual wp-post-image\" h"
    ],
    "image_url": "",
    "titles": [
      "Scientists Eye Black Holes as Cosmic Supercolliders in the Hunt for Dark Matter"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.832,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary": "Scientists are investigating black holes as potential cosmic supercolliders to detect dark matter, the elusive substance that makes up a significant portion of the universe's mass. This approach is based on the hypothesis that interactions around black holes might reveal dark matter particles, offering a new method to understand this mysterious component of the cosmos.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Mysterious Radio Signals Unveil Hidden Matter Between Galaxies",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 22:49:59 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/mysterious-radio-signals-reveal-whats-hiding-between-galaxies/\" rel=\"nofollow\" title=\"Mysterious Radio Signals Reveal What’s Hiding Between Galaxies\"><img alt=\"Visualizing a Fast Radio Burst\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://sci"
    ],
    "image_url": "",
    "titles": [
      "Mysterious Radio Signals Reveal What’s Hiding Between Galaxies"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.825,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary": "Astronomers have detected mysterious radio signals, known as Fast Radio Bursts (FRBs), which have helped reveal previously undetected matter located in the spaces between galaxies. This discovery could provide insights into the composition and structure of the universe beyond our galaxy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI-powered stuffed animals are coming for your kids",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:39:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Do A.I. chatbots packaged inside cute-looking plushies offer a viable alternative to screen time for kids? Maybe not."
    ],
    "image_url": "",
    "titles": [
      "AI-powered stuffed animals are coming for your kids"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.772,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.45,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Judge says FTC investigation into Media Matters ‘should alarm all Americans’",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 20:32:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "A federal judge has blocked the FTC's investigation into Media Matters research around advertising and antisemitic content on X."
    ],
    "image_url": "",
    "titles": [
      "Judge says FTC investigation into Media Matters ‘should alarm all Americans’"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.786,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.445,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Celebrating 50 years of The Rocky Horror Picture Show",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:26:22 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "\"It's had a profound impact on our culture, especially on people who've felt different and marginalized.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/horrorTOP-1152x648-1754745307.jpg",
    "titles": [
      "Celebrating 50 years of The Rocky Horror Picture Show"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.768,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.442,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 17:50:31 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "The good news is that, for now, Erin appears unlikely to directly strike land."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1-1152x648.jpg",
    "titles": [
      "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.743,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.437,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 15:50:05 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Anthropic says new capabilities allow its latest AI models to protect themselves by ending abusive conversations."
    ],
    "image_url": "",
    "titles": [
      "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.713,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.431,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T10:23:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Some people like to stay on the cutting edge of technology. If that’s you, you already know that Google is going to officially unveil its Pixel 10 phones (including a new Fold) during its August 20th event. But if you’re someone who prefers to use these opportunities to save on last-gen tech, you’ve"
    ],
    "image_url": "",
    "titles": [
      "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.692,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.427,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "A brazen attack on air safety is underway — here’s what’s at stake",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "At the end of July, the National Transportation Safety Board (NTSB) convened a three-day public hearing to investigate January's mid-air collision over Washington, DC that killed 67 people. After the hearing, two conclusions were inescapable. First, the disaster should have been prevented by existin"
    ],
    "image_url": "",
    "titles": [
      "A brazen attack on air safety is underway — here’s what’s at stake"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.658,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.427,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "How a mysterious particle could explain the Universe’s missing antimatter",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 11:15:17 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "New experiments focused on understanding the enigmatic neutrino may offer insights."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/cube1CROP-1152x648.jpg",
    "titles": [
      "How a mysterious particle could explain the Universe’s missing antimatter"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.648,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.425,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]