[
  {
    "title": "Afghanistan Earthquake Kills 600, Injures 1,300 Near Pakistan Border",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 02:52:38 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Global News",
      "ABC News",
      "Deutsche Welle",
      "New York Times",
      "Axios",
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "news.google.com",
      "www.dw.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The 6.0 magnitude quake late Sunday hit a series of towns in the province of Kunar, near the city of Jalalabad in neighboring Nangahar province, causing extensive damage.",
      "More than 600 people have been killed after a magnitude 6 earthquake struck just before midnight in Afghanistan.",
      "Toll likely to rise, with significant damage reported across mountainous provinces of Kunar and Nangahar, sources say.",
      "The shallow earthquake in eastern Afghanistan has destroyed several of villages, causing widespread damage.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQc05iRnZ2aGFBbVQ2aTJPZ05wNkd2U2VVbTUtV1Q2QWZYZ09xVkNncXhMWVIwNzRlWklZaUVWcEFuSDA0a2Y0aTdJX2xJaFpYbUFlSlpwSnFnR2UxRmQzYmJIUVg5Wnh1blFrVF9lN1V2VVZteHczVExCdnVoZDJ4OGdn?oc=5\" target=\"_blank\">Hundreds killed after 6.0-magnitude earthquake stri",
      "The strong earthquake struck about 17 miles east of Jalalabad, near the border with Pakistan, according to preliminary data from the U.S. Geological Survey.",
      "The 6.0-magnitude earthquake that hit Jalalabad injured 1,500 others, the Taliban-run Interior Ministry said. The quake was felt as far as neighboring Pakistan.",
      "The quake, near the border with Pakistan, injured more than 1,300 people, the authorities said. The death toll was expected to rise further.",
      "A magnitude 6.0 earthquake shook eastern Afghanistan near the Pakistan border late Sunday, according to the U.S. Geological Survey."
    ],
    "image_url": "",
    "titles": [
      "Earthquake devastates eastern Afghanistan, killing hundreds and destroying villages",
      "Hundreds feared dead after earthquake in Afghanistan",
      "At least 600 killed as powerful earthquake rocks eastern Afghanistan",
      "Afghanistan: Hundreds killed after strong earthquake",
      "Hundreds killed after 6.0-magnitude earthquake strikes Afghanistan - Axios",
      "Hundreds killed as 6.0 magnitude earthquake strikes Afghanistan, officials say",
      "More than 600 dead after earthquake hits eastern Afghanistan",
      "Hundreds Dead After 6.0-Magnitude Earthquake Hits Afghanistan",
      "A 6.0 magnitude earthquake shakes eastern Afghanistan near the Pakistan border"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.974,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.88,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Afghanistan near Jalalabad and the Pakistan border late Sunday, killing over 600 people and injuring more than 1,300, as reported by the Taliban-run Interior Ministry. The quake caused extensive damage across the mountainous provinces of Kunar and Nangahar, destroying several villages. The death toll is expected to rise as rescue efforts continue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rudy Giuliani Hospitalized After Car Accident in New Hampshire",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 16:32:47 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "The Guardian",
      "Deutsche Welle",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org",
      "www.dw.com",
      "globalnews.ca",
      "www.cnbc.com"
    ],
    "snippets": [
      "Former New York City Mayor Rudy Giuliani has been hospitalized with a broken vertebra after a car accident in New Hampshire, according to his spokesperson.",
      "Former New York Mayor Rudy Giuliani's vehicle was \"struck from behind at high speed,\" his team said. The ex-Trump lawyer is reportedly in good spirits but will remain hospitalized.",
      "The former New York City mayor was taken to a trauma center with a fractured thoracic vertebrae, as well as lacerations and contusions, from a car accident.",
      "<p>New York City’s ex-mayor, 81, in ‘good spirits’ after being treated for fractured thoracic vertebrae, cuts and bruises</p><p>New York City’s former mayor <a href=\"https://www.theguardian.com/us-news/rudygiuliani\">Rudy Giuliani</a> has been hospitalized after getting injured in a car wreck in <a h",
      "Rudy Giuliani is recovering from a fractured vertebra and other injuries following a car crash in New Hampshire, a spokesperson for the former New York City mayor said Sunday."
    ],
    "image_url": "",
    "titles": [
      "Rudy Giuliani hospitalized with broken vertebra after car accident, spokesperson says",
      "Rudy Giuliani seriously injured in car accident",
      "Rudy Giuliani hospitalized with serious injuries after New Hampshire car accident",
      "Rudy Giuliani hospitalized after car accident in New Hampshire",
      "Rudy Giuliani injured in New Hampshire car crash, his spokesperson says"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.786,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former New York City Mayor Rudy Giuliani, 81, was hospitalized after his car was struck from behind in a high-speed accident in New Hampshire. He suffered a fractured thoracic vertebra, along with lacerations and contusions. Giuliani, who was assisting a domestic violence victim at the time, is in good spirits but will remain hospitalized for his injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Deportation of Guatemalan Children by U.S. Government",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 21:20:53 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "As a U.S. federal judge blocked the deportation of unaccompanied Guatemalan children, the government of Guatemala says in a statement it suggested the U.S. return its children to their home country.",
      "A federal district judge issued a temporary restraining order after the U.S. attempted to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings.",
      "District Judge Sparkle Sooknanan&#039;s emergency order follows a legal complaint brought on behalf of 10 children.",
      "<p>Washington judge says unaccompanied children cannot be deported for at least 14 days as legal process unfolds</p><p>A US judge on Sunday ordered an emergency halt to a plan by the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> to deport a group of near",
      "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
    ],
    "image_url": "",
    "titles": [
      "Guatemala says it suggested that U.S. send its unaccompanied migrant children home",
      "Hundreds of unaccompanied Guatemalan children can stay in the U.S. for now, judge says",
      "US judge blocks government from deporting unaccompanied Guatemalan minors",
      "Judge orders US to halt deportation of hundreds of Guatemalan children",
      "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.868,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge issued a temporary restraining order, halting the U.S. government's attempt to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings. This decision, made by District Judge Sparkle Sooknanan, comes after a legal complaint on behalf of 10 children, temporarily preventing these deportations for at least 14 days as the legal process continues. This move interrupts the Trump administration's broader immigration crackdown efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested After Crashing Through Gates in Sydney, Officer Injured",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 02:05:42 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Police say an officer injured their hand but no other injuries were reported.",
      "Police say a 39-year-old man has been taken into custody over the incident in Sydney&#039;s Woollahra suburb.",
      "A 39-year-old man has been arrested following the incident, New South Wales police said in a statement.",
      "<p>Police called to Woollahra following reports of ‘unauthorised vehicle’ parked in driveway, with 39-year-old then crashing through gates, police allege</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.co"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/638f/live/5f498000-86f4-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Man arrested after crashing car into Russian consulate in Australia",
      "Car crashes into Russian consulate in Australia’s Sydney",
      "Car plows into Russian consulate gate in Sydney",
      "Man arrested after allegedly ramming car through front gates of Russian consulate in Sydney"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.864,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Sydney's Woollahra suburb, a 39-year-old man was arrested after crashing an unauthorized vehicle through gates, according to New South Wales police. During the incident, an officer sustained a hand injury, but no other injuries were reported. The man is currently in custody.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Kills Hamas Spokesperson in Gaza Airstrike; Tensions Escalate",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 20:32:56 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The military spokesman was killed in strikes on Saturday, Israel says - Hamas has not confirmed the death.",
      "Israel announced that prominent Hamas spokesperson Abu Obeida was killed by an Israeli strike. It comes as Israel's major Gaza City offensive is underway. DW has more.",
      "For nearly two decades, Abu Obaida was the face of Hamas’s military operations. Israel says it killed him in a strike Saturday in Gaza City.",
      "Hamas did not immediately comment on the Israeli military’s claim that Abu Obeida, one of the armed group’s best-known officials in the Arab world, had been killed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7a00/live/a20c7f00-867c-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Hamas spokesman Abu Obeida killed in Gaza, Israel says",
      "Israel says Hamas spokesman killed in Gaza airstrike",
      "Israel says it killed longtime spokesman of Hamas’s military wing",
      "Israel Says It Killed Abu Obeida, Spokesman for Hamas’s Armed Wing"
    ],
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.769,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.764,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel announced the death of Hamas spokesperson Abu Obeida in an airstrike in Gaza City, amid a significant offensive. This action coincides with a weekend that saw at least 43 Palestinian fatalities, escalating hunger, and widespread displacement. The Israeli military has warned of further strikes against Hamas if operations in the region continue as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Woods Scores Hole in One at Junior Players Championship",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 23:29:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Charlie Woods made an ace on the third hole at TPC Sawgrass in the final round of the Junior Players Championship.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE5UbUE3T1JiczI3VE9ia18zc29udGIwbEVoWE10eS1LM1hjX3hRUDFoME1aV0V3N3FpR2F0NEFVVVE3QjlJazloa3l1aVh4clFJMlBPYnN5d2tRTlVReGo4NkcwbVlLTnFSaW1LMFpOTQ?oc=5\" target=\"_blank\">Charlie Woods Gets Hole in One in Junior Players Championship at TPC Sawgrass",
      "<p>Charlie Woods has authored a moment to remember at an iconic golf course.</p>"
    ],
    "image_url": "",
    "titles": [
      "Charlie Woods makes ace during Junior Players",
      "Charlie Woods Gets Hole in One in Junior Players Championship at TPC Sawgrass - Sports Illustrated",
      "Charlie Woods fires hole-in-one at TPC Sawgrass"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.908,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.743,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Woods achieved a hole in one on the third hole at TPC Sawgrass during the final round of the Junior Players Championship. This notable accomplishment highlighted his performance in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aston Villa Eyes Deadline Day Deal for Man Utd's Jadon Sancho",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 07:43:55 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Aston Villa are exploring a move for Manchester United's out-of-favour winger Jadon Sancho.",
      "Aston Villa are exploring a move for Manchester United's out-of-favour winger Jadon Sancho.",
      "Aston Villa are exploring a Deadline Day deal for Manchester United forward Jadon Sancho."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3da3/live/aa838b30-8701-11f0-b357-dba5095f4b72.jpg",
    "titles": [
      "Villa exploring move for Man Utd winger Sancho",
      "Villa exploring move for Man Utd winger Sancho",
      "Villa exploring deal to sign Man Utd's Sancho on loan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.971,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aston Villa is considering signing Manchester United's winger Jadon Sancho, who is currently out of favor at his club. They are looking into securing a deal for him on Deadline Day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sounders Beat Inter Miami 3-0; Suarez Faces Possible Suspension for Spitting",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 05:28:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBS Sports",
      "Al Jazeera",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.aljazeera.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Seattle record an emphatic win in a match where Miami&#039;s Luis Suarez appeared to spit on a Sounders staffer post-game.",
      "Suarez lost his cool big time, and a long suspension could be coming",
      "<p>Osaze De Rosario scored in the 26th minute, and the Seattle Sounders blanked Lionel Messi and Inter Miami 3-0 on Sunday night to win the Leagues Cup.</p>"
    ],
    "image_url": "",
    "titles": [
      "Suarez, Messi, Inter Miami lose to Seattle Sounders in Leagues Cup final",
      "Inter Miami's Luis Suarez spits on Seattle Sounders staff member as Leagues Cup final ends in a fight",
      "Osaze De Rosario helps Sounders blank Messi, Inter Miami in Leagues Cup final"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seattle Sounders defeated Inter Miami 3-0 in the Leagues Cup, with Osaze De Rosario scoring in the 26th minute. Post-game, Luis Suarez of Miami was seen spitting on a Sounders staffer, an action that might lead to a significant suspension for him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "6.0 Earthquake Hits Eastern Afghanistan, Over 250 Dead",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 05:18:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US Geological Survey says magnitude 6 quake struck just before midnight in eastern Afghanistan.",
      "<p>Several villages in Kunar province ‘completely destroyed’, says ministry for public health, as rescue operations take place</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">At least 250 dead after 6.0 mag",
      "The epicenter of the 6.0 magnitude temblor struck near the Afghan-Pakistan border, and the death toll is expected to rise."
    ],
    "image_url": "",
    "titles": [
      "Afghanistan earthquake live: More than 600 people killed, 1,500 injured",
      "Afghanistan earthquake live: more than 600 dead after shallow quake strikes country’s east, state media reports",
      "Powerful Earthquake In Afghanistan Kills At Least 610 People—Thousands Injured"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.943,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Afghanistan just before midnight, with its epicenter near the Afghan-Pakistan border. The quake led to the complete destruction of several villages in Kunar province. According to the ministry for public health, at least 250 people have died, and rescue operations are ongoing. The death toll is expected to rise.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool, Newcastle Agree on Record British Transfer for Isak",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 00:04:11 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Liverpool agree British transfer record fee of £125m to sign striker Alexander Isak from Newcastle United.",
      "Liverpool&#160;and&#160;Newcastle&#160;have agreed a British-record transfer for Alexander Isak.",
      "<p>One of the more dramatic and long-winded transfer sagas in recent memory appears to have finally come to an end. </p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d1e7/live/8d30fb80-8701-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Liverpool agree British record £125m fee for Isak",
      "Liverpool agree British-record deal with Newcastle to sign Isak",
      "Reports: Liverpool land Alexander Isak after Newcastle accept record fee"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.828,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alexander Isak's transfer saga concludes as Liverpool and Newcastle United reach a British-record agreement for his move. This deal, finalizing before the transfer deadline, marks the end of Isak's recent efforts to leave Newcastle.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Buffalo Bills' DeWayne Carter Out for Season with Torn Achilles",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 22:30:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Carter, 24, appeared in 11 games as a rookie",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQdEc3bjFjZjViRm1XVVV1QURtbUxOQVNHdmoyVjBuQ1FuaXdYVTZsZkg0alpLbDdhdmlBVW5OdkFNMENjNzFXUFQ2OVp4MElLYU83bHNrem9yMmVBeWMtR2pRZ09JUDJTYWNfSWJnV2p3cnE3NzVrUm9HR2pNVWNVZHlkQ3VCUQ?oc=5\" target=\"_blank\">Bills Lose Key Defensive Lineman to Season-En",
      "<p>Buffalo Bills backup defensive tackle DeWayne Carter will miss the season after tearing his Achilles tendon, two people with knowledge of the injury confirmed to The Associated Press on Sunday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/31/d11e99d2-1e16-4d0e-bdf9-2fc49d012b34/carter.jpg",
    "titles": [
      "DeWayne Carter injury: Bills lose key defensive lineman for season due to torn Achilles, per report",
      "Bills Lose Key Defensive Lineman to Season-Ending Injury Ahead of Week 1 - Sports Illustrated",
      "AP Source: Bills defensive tackle Carter to miss season after tearing Achilles tendon"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.818,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "DeWayne Carter, a 24-year-old defensive tackle for the Buffalo Bills, will miss the rest of the season due to a torn Achilles tendon. This was confirmed by two sources to The Associated Press. Carter appeared in 11 games during his rookie year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Plans Troop Deployment to Ukraine for Post-Conflict Security",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-01T03:53:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "Europe is drawing up \"precise plans\" to send troops to Ukraine once fighting there ends, EU chief Ursula von der Leyen has said. Meanwhile, Putin has again blamed Ukraine and the West for starting the war. DW has more.",
      "Post-conflict security guarantees will be fully backed by US commitments, commission president tells FT"
    ],
    "image_url": "",
    "titles": [
      "Ukraine live: Europe drafting 'precise' plans to send troops",
      "Europe has ‘pretty precise’ plan to send troops to Ukraine, von der Leyen says"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The EU, led by Ursula von der Leyen, is preparing detailed plans to deploy troops to Ukraine after hostilities cease, aiming to ensure post-conflict security. This initiative is supported by US commitments. Concurrently, Russian President Putin continues to attribute the initiation of the conflict to Ukraine and Western countries.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: initiative, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League Transfer Window Closes; Liverpool Signs Isak for £125M",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 03:41:35 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The summer transfer window closes today and all the big Premier League clubs will be busy in some way. Transfer Talk has the latest news, gossip and rumors.",
      "<ul><li><p>All the latest news and moves | <a href=\"https://www.theguardian.com/football/2025/sep/01/liverpool-agree-125m-deal-to-sign-alexander-isak-from-newcastle-on-deadline-day\">Liverpool agree Isak fee</a></p></li><li><p><a href=\"mailto:niall.mcveigh@theguardian.com\">Mail Niall</a> | <a href=\"h"
    ],
    "image_url": "",
    "titles": [
      "LIVE Transfer deadline day news, updates: Isak to Liverpool agreed",
      "Transfer deadline day: Isak deal agreed, Guéhi, Wissa, Ederson latest and more – live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The summer transfer window for the Premier League closes today, with significant activity expected from major clubs. Notably, Liverpool has agreed to a £125 million deal to sign Alexander Isak from Newcastle, highlighting the day's major moves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Atwood Pens Satire in Response to Alberta's Book Ban Policy",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 31 Aug 2025 22:18:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Margaret Atwood is taking aim at Alberta's controversial ban on school library books containing sexual content with a new, satirical short story.",
      "EDMONTON — Margaret Atwood is taking aim at Alberta&#8217;s controversial ban on school library books containing sexual content with a new, satirical short story after the famed author&#8217;s novel &#8220;The Handmaid&#8217;s Tale&#8221; was yanked from some shelves due to the province&#8217;s swee"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/8beeff529abe9e38ba214e0ddfb261f08a0ea1469a4fcd1df3c00df4ddc3a6c7.jpg?quality=65&strip=all",
    "titles": [
      "Margaret Atwood takes aim at Alberta’s school library books ban with satirical story",
      "Margaret Atwood takes aim at Alberta’s school library books ban with satirical story"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Margaret Atwood has written a satirical short story in response to Alberta's ban on school library books with sexual content. This action comes after her novel \"The Handmaid's Tale\" was removed from some school shelves in the province due to the controversial policy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin Defends Ukraine Actions, Xi Criticizes West at SCO Summit",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 07:37:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia’s president defends the military campaign in Ukraine, blaming NATO and Western policies for the conflict.",
      "<p>China’s leader urges attendees to oppose ‘cold war mentality’ while Russian president claims Ukraine war was ‘provoked by the west’</p><p>Xi Jinping has criticised the “bullying behaviour” of other countries while Vladimir Putin has blamed the west for his war on Ukraine, on the second day of a m",
      "<p>Russian president and his Chinese counterpart shake hands as more than 20 world leaders attend Shanghai Cooperation Organisation summit in Tianjin</p><p>Following a meeting with Ukraine’s top general, <strong>Oleksandr Syrsky</strong>, Ukrainian President <strong>Volodymyr Zelenskyy</strong> said"
    ],
    "image_url": "",
    "titles": [
      "Putin blames West for Ukraine war at China-led SCO summit",
      "Xi Jinping criticises ‘bullying behaviour’ and Putin blames west for Ukraine war at Shanghai summit",
      "Vladimir Putin meets Xi Jinping arrives in China for security summit – Ukraine war live"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the Shanghai Cooperation Organisation summit in Tianjin, Russian President Vladimir Putin defended the military campaign in Ukraine, attributing its cause to NATO and Western policies. Concurrently, China's President Xi Jinping criticized the \"cold war mentality\" and \"bullying behavior\" of some countries, aligning with Putin's stance that the West provoked the conflict. The summit saw the attendance of over 20 world leaders, highlighting international divisions on the issue. Ukrainian President Volodymyr Zelenskyy, following a meeting with Ukraine's top general, Oleksandr Syrsky, also made ",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Pledges $280M in Aid to SCO Members at Tianjin Summit",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 04:37:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Chinese leader pledges $280m in aid to members of the Shanghai Cooperation Organisation at summit in Tianjin.",
      "It is unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, though Beijing has sought to cast itself as a global peacemaker."
    ],
    "image_url": "",
    "titles": [
      "China’s Xi urges regional leaders to oppose ‘Cold War mentality’ at summit",
      "China's Xi urges AI cooperation, rejects ‘Cold War mentality’ at SCO summit"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a summit in Tianjin, the Chinese leader pledged $280 million in aid to members of the Shanghai Cooperation Organisation (SCO). The contribution aims to support the SCO, but it remains uncertain if this will lead to significant breakthroughs in reducing tensions among member states. Beijing is positioning itself as a global peacemaker through this gesture.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 1 College Football: Projections for Top Teams",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 00:03:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "We assess how the committee could stack the top teams in the country after Week 1.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPUmRRWnZzcDgzX001cnA4VksyV09WQUlaQWNmSHVMV21HQjU4bS1vbWxUak1jMXRXSWhZN1JpeVc0NkJWT1lja1k4UG13MnBDR09wOWVGbWhMVUgyZk82LU5DeGRKc0toeUVOeHlaMUl1SnJlbXBTeWZNOXZMZDhyempSeFFtZHc2TWljYnRid3JUUQ?oc=5\" target=\"_blank\">Projecting the College Footba"
    ],
    "image_url": "",
    "titles": [
      "Projecting the CFP top 12 after Week 1",
      "Projecting the College Football AP Top 25 for Week 2 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The article discusses projections for the top college football teams after Week 1. It assesses how the committee might rank these teams based on their performances. The current status or outcome of these projections was not provided in the content shared.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Briscoe Wins Southern 500, Advances in NASCAR Playoffs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 23:29:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Chase Briscoe held off Tyler Reddick at Darlington Raceway on Sunday night and advanced to the second round of the NACAR Cup Series playoffs.",
      "<p>Chase Briscoe held off Tyler Reddick at Darlington Raceway on Sunday night to win the Southern 500 for the second straight year and advance to the second round of the NACAR Cup Series playoffs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Briscoe captures second straight Southern 500",
      "Briscoe wins 2nd straight Southern 500, advance to 2nd round of playoffs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chase Briscoe won the Southern 500 at Darlington Raceway, defeating Tyler Reddick. This victory marks his second consecutive win at this event and secures his advancement to the second round of the NASCAR Cup Series playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Spotlights Worker Contributions Amid Immigration Policy Concerns",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 01:27:36 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Financial Post"
    ],
    "domains": [
      "abcnews.go.com",
      "financialpost.com"
    ],
    "snippets": [
      "As parades and other events celebrating the contributions of workers in the U.S. are being held for the Labor Day holiday, experts say President Donald Trump&rsquo;s stepped-up immigration policies are impacting the nation&rsquo;s labor force",
      "It&#8217;s tomato season and Lidia is harvesting on farms in California&#8217;s Central Valley. She is also anxious. Attention from U.S. Immigration Control and Enforcement could upend her life more than 23 years after she illegally crossed the U.S.-Mexico border as a teenager. &#8220;The worry is t"
    ],
    "image_url": "https://s.abcnews.com/images/US/wirestory_9a40f9e371209cc1d145e4a7f157a499_4x3_384.jpg",
    "titles": [
      "1.2M immigrants are gone from the US labor force under Trump, preliminary data shows",
      "1.2M immigrants are gone from the US labor force under Trump, preliminary data shows"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Labor Day celebrations across the U.S. highlight the contributions of workers, amidst concerns over President Donald Trump's immigration policies affecting the labor force. In California's Central Valley, workers like Lidia, who crossed the U.S.-Mexico border illegally over 23 years ago, face increased anxiety due to potential attention from U.S. Immigration Control and Enforcement during peak seasons like tomato harvest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rudy Giuliani Unharmed in Highway Car Accident After Assisting Victim",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 00:34:30 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZkFVX3lxTFBTZW42TmFmY3pfcFp5T1dRUW1wUmt2QzZLZ0liaDdqZmphclhoSWYtSVRBbHNFSERCTjZvRTRFS05OY3NCUTVDMlpJWHZJQVNHS0FjeExNbUJDMGhtY2Vsb2hwcHo4dw?oc=5\" target=\"_blank\">Giuliani hurt in crash after helping domestic violence victim, spokesperson says</a>&nbsp",
      "His vehicle was hit shortly after pulling onto the highway in a crash that was “entirely unrelated” to the domestic violence incident, Giuliani’s head of security said."
    ],
    "image_url": "",
    "titles": [
      "Giuliani hurt in crash after helping domestic violence victim, spokesperson says - Axios",
      "Rudy Giuliani suffers fractured vertebra in car crash after being ‘flagged down’ by domestic violence victim"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rudy Giuliani was involved in a car accident shortly after assisting a domestic violence victim. According to his security head, the crash occurred as Giuliani's vehicle entered the highway and was unrelated to the earlier incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xi and Modi Strengthen Ties with Putin at SCO Summit in Tianjin",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 15:18:31 GMT",
    "source": "The Guardian",
    "sources": [
      "Financial Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "<p>Chinese president hosts bilateral meetings on sidelines of Shanghai Cooperation Organisation summit in Tianjin</p><p>Xi Jinping and Vladimir Putin have met on the sidelines of a showpiece summit in China that seeks to challenge US-led, western-dominated blocs and is being attended by the leaders ",
      "Indian Prime Minister Narendra Modi embraced Russian President Vladimir Putin at a regional summit in China before riding with him to their bilateral meeting, underscoring their deep ties even as Washington criticizes New Delhi over oil purchases."
    ],
    "image_url": "https://i.guim.co.uk/img/media/19e906af07f6662bacc1afaee9b204a6e7d1538a/215_0_1814_1452/master/1814.jpg?width=140&quality=85&auto=format&fit=max&s=20cca57f8b60258c3748ebb02af76c63",
    "titles": [
      "Putin, Modi and Erdoğan among leaders in China for talks with Xi",
      "Putin and Modi Showcase Bond With Hug, Car Ride in China"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.69,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the Shanghai Cooperation Organisation summit in Tianjin, China, Chinese President Xi Jinping held bilateral meetings, including with Russian President Vladimir Putin. The summit aimed to present an alternative to US-led Western blocs. Indian Prime Minister Narendra Modi also showcased strong relations with Putin, emphasizing the deep ties between India and Russia, despite US criticism of India's oil purchases from Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]