[
  {
    "title": "Israeli drone strikes kill four people in southern Lebanon",
    "summary": "State news agency says four killed in two separate attacks in the south as Israel says it targeted Hezbollah operatives.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:08:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.44
  },
  {
    "title": "A cleaner future for tires: Scientists pioneer chemical process to repurpose rubber waste",
    "summary": "Every year, millions of tires end up in landfills, creating an environmental crisis with far-reaching consequences. In the United States alone, over 274 million tires were scrapped in 2021, with nearly a fifth of them being discarded into landfills. A study has now pioneered a technique for breaking down this rubber waste and transforming it into valuable precursors for epoxy resins. This technique offers an innovative and sustainable alternative to traditional recycling methods while significantly reducing rubber waste in landfills.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:44:25 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.415
  },
  {
    "title": "Earliest days of Earth's formation",
    "summary": "New research sheds light on the earliest days of the earth's formation and potentially calls into question some earlier assumptions in planetary science about the early years of rocky planets. Establishing a direct link between the Earth's interior dynamics occurring within the first 100 million years of its history and its present-day structure, the work is one of the first in the field to combine fluid mechanics with chemistry to better understand the Earth's early evolution.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:44:30 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.408
  },
  {
    "title": "As Bangladesh gears up for election, a new political player emerges",
    "summary": "Last year, Gen-Z uprising in Bangladesh helped bring down Prime Minister Sheikh Hasina. Student activists continue to be central figures in shaping the future of Bangladesh's political landscape.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 02:21:12 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Turkey's opposition leader vows protests will continue 'in every city'",
    "summary": "Ozgur Ozel tells the BBC's Orla Guerin protests will continue until the jailed Istanbul mayor is freed.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 18:36:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Hundreds join Gaza's largest anti-Hamas protest since war began",
    "summary": "Masked Hamas militants dispersed protesters who gathered in northern Gaza to rally against the group.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 17:40:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Three sensitive messages from Yemen strike Signal chat unpacked and explained",
    "summary": "We unpick excerpts from a group chat by high-ranking US security officials about an air strike on Yemen.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 17:23:39 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Robinhood is launching bank accounts that will deliver physical cash ‘to your doorstep’",
    "summary": "Robinhood is getting closer to becoming a full-fledged financial service. On Wednesday, the company announced a wholly online banking platform that will offer checking and savings accounts to Robinhood Gold subscribers when it launches this fall. The platform, called Robinhood Banking, will let users access their accounts, as well as send and receive money through [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T21:30:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "South Korea says wildfires worst in its history, death toll rises to 26",
    "summary": "Firefighters are struggling to contain the wildfires, which continue to grow rapidly in size, fuelled by strong winds.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:41:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Australia’s PM Anthony Albanese set to call election ‘imminently’",
    "summary": "Prime Minister Albanese&#039;s Labor Party has introduced new tax cuts in advance of general election due before May 17.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:06:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Mavs' Irving has successful surgery on torn ACL",
    "summary": "Mavericks All-Star Kyrie Irving underwent successful surgery to repair his torn left ACL on Wednesday at Hospital for Special Surgery in New York City, the team announced.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Books set historically low win total for White Sox",
    "summary": "The White Sox open the season with a consensus over/under of 53.5 wins, the lowest betting total for sportsbooks in over 35 years.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,127",
    "summary": "These are the key developments on day 1,127 of Russia’s war on Ukraine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 01:35:55 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "'I feel like I have everything in front of me': Inside the $765 million marriage of Juan Soto and the Mets",
    "summary": "After a free agent megadeal that rocked the offseason, a new era begins for the Mets, New York and all of MLB.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 06:45:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Cuttlefish 'mesmerize' their prey with a moving skin pattern, study finds",
    "summary": "While sneaking up on prey, cuttlefish employ a dynamic skin display to avoid detection in last moments of approach, researchers have found.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:43:03 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "Research finds potential 'molecular mimics' behind COVID-induced autoimmune disease",
    "summary": "Scientists used advanced data analysis and machine learning to identify the viral proteins that may trigger autoimmune disorders such as type 1 diabetes and rheumatoid arthritis.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:42:49 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "Blurring the line between rain and snow: Limits of meteorological classification",
    "summary": "A new study uncovers a critical challenge in accurately classifying precipitation as rain or snow using surface weather data. Accurately identifying precipitation phase is critical for weather forecasting, hydrologic modeling, and climate research, with significant implications for transportation. At temperatures near freezing, however, all traditional methods struggle to accurately predict rain and snow due to the meteorological similarity of the two phases. Leveraging multi-source data integration rather than relying on surface weather data alone may offer improvements.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:32:49 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "New study shines a light on the mechanics of bioluminescence in the rare fish Vinciguerria mabahiss",
    "summary": "Evolving roughly 27 different times in the long history of fish, bioluminescence -- the biological production of light -- is one of the flashier survival tools used for luring prey, communication, and recognizing potential mates among various species. In a new study a team of researchers studied the organs that produce light in Vinciguerria mabahiss, a rare species of fish from the Red Sea. This paper marks the first-ever close examination of these organs, providing key information on their structure and how V. mabahiss uses bioluminescence to make its way through the water -- and laying the...",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "How cells respond to stress is more nuanced than previously believed",
    "summary": "The body's cells respond to stress -- toxins, mutations, starvation or other assaults -- by pausing normal functions to focus on conserving energy, repairing damaged components and boosting defenses. If the stress is manageable, cells resume normal activity; if not, they self-destruct. Scientists have believed for decades this response happens as a linear chain of events: sensors in the cell 'sound an alarm' and modify a key protein, which then changes a second protein that slows or shuts down the cell's normal function. But researchers have now discovered a cell's response is more nuanced...",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "Children of moms who smoked or were obese are more likely to become obese adults",
    "summary": "A study finds that factors beyond a person's control, like socioeconomic status and whether their mom smoked or was obese, can influence whether they are overweight or obese as teenagers or adults.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:43:11 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "A safe nuclear battery that could last a lifetime",
    "summary": "Lithium-ion batteries, used in consumer devices and electric vehicles, typically last hours or days between charges. However, with repeated use, they degrade and need to be charged more frequently. Now, researchers are considering radiocarbon as a source for safe, small and affordable nuclear batteries that could last decades or longer without charging.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:37:40 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "How elephants plan their journeys: New study reveals energy-saving strategies",
    "summary": "A new study has revealed that African Elephants have an extraordinary ability to meet their colossal food requirements as efficiently as possible. Data from over 150 elephants demonstrated that these giants plan their journeys based on energy costs and resource availability.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:35:31 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "mRNA-based COVID-19 vaccines train the 'long-term memory' of the immune system",
    "summary": "Researchers have discovered that mRNA-based COVID-19 vaccines have a persistent effect on the innate immune system. These mechanisms may help the human body to better protect itself against potential future infections.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:33:20 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Adulting is hard on the heart: Teen to young adulthood is a critical time to address risk",
    "summary": "Many youth have heart disease risk factors by their late teens, and preventing or addressing these risks early may reduce the risk of developing cardiovascular disease in the future, according to a new scientific statement.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:33:10 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Scientists discovered chemical oscillations in palladium nanoparticles, paving the way for recycling precious metal catalysts",
    "summary": "Scientists have for the first time filmed the real-time growth and contraction of Palladium nanoparticles, opening new avenues for utilising and recycling precious metal catalysts.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:33:05 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cleverly designed carbon nanohoop enables controlled release of iron",
    "summary": "Researchers have developed a molecular system for controlled release of iron. They integrated ferrocene, a molecular sandwich that encloses an iron atom, with a carbon 'nanohoop'. As a result, the system allows for the release of Fe2+ ions upon activation with benign green light.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:32:58 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Getting hit by lightning is good for some tropical trees",
    "summary": "Getting zapped with millions of volts of electricity may not sound like a healthy activity, but for some trees, it is. A new study reports that some tropical tree species are not only able to tolerate lightning strikes, but benefit from them. The trees may have even evolved to act as lightning rods.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:30:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Smart insoles that could change the game for sports and health",
    "summary": "Scientists have created a smart insoles prototype that can accurately measure the body's interaction with the ground, which has the potential to help athletes avoid injuries, or even assist doctors in monitoring recovery.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:29:35 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "How changing L.A.'s tree rules could cool more neighborhoods",
    "summary": "Los Angeles has some of the strictest tree planting rules in the nation. These policies limit tree growth, worsen shade disparities and don't improve safety, researchers found. When researchers modeled looser planting restrictions in a lower-income neighborhood, potential tree space increased by nearly 26%. But narrow sidewalks and dense infrastructure still limited where larger, shade trees could thrive. Many of L.A.'s strict tree-spacing rules are internal guidelines -- not laws -- meaning they could be updated more easily to allow for more trees. Closing L.A.'s shade gap, however, will...",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:29:30 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Repetitive behaviors and special interests are more indicative of an autism diagnosis than a lack of social skills",
    "summary": "People with autism are typically diagnosed by clinical observation and assessment. To deconstruct the clinical decision process, which is often subjective and difficult to describe, researchers used a large language model (LLM) to synthesize the behaviors and observations that are most indicative of an autism diagnosis. Their results show that repetitive behaviors, special interests, and perception-based behaviors are most associated with an autism diagnosis. These findings have potential to improve diagnostic guidelines for autism by decreasing the focus on social factors -- which the...",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:29:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Scientists discover why obesity takes away the pleasure of eating",
    "summary": "Many obese people report losing pleasure in eating rich foods -- something also seen in obese mice. Scientists have now discovered the reason. Long-term high-fat diets lower levels of neurotensin in the brain, disrupting the dopamine pleasure network and decreasing the desire to eat high-fat foods. Raising neurotensin levels in mice brings back the pleasure and aids weight loss. Bringing back the pleasure could help people break the habit of overeating.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:52 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "A new method to recycle fluoride from long-lived PFAS chemicals",
    "summary": "Researchers have developed a method to destroy fluorine-containing PFAS (sometimes labelled 'forever chemicals') while recovering their fluorine content for future use.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cleaning microplastics",
    "summary": "Proof-of-concept work uses unique, safe particles to remove microplastics in a single cycle.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:42:42 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Five minutes a day eccentric exercise can improve your life",
    "summary": "As little as five minutes a day of eccentric exercise could offer significant health benefits to those living a stagnant lifestyle.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:35:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Entangled in self-discovery: Quantum computers analyze their own entanglement",
    "summary": "Quantum computers are able to solve complex calculations that would take traditional computers thousands of years in just a few minutes. What if that analytical power is turned inwards towards the computer itself?",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:35:36 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Is your job making you happy? Insights from job satisfaction data",
    "summary": "New research has found that employers and policymakers might want to start paying attention to how workers are feeling, because employee happiness contains critical economic information.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:29:38 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Target to repair injured muscles discovered",
    "summary": "A team has discovered a possible therapeutic approach to repair injured muscles either from aging or degenerative muscle disorders.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:29:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "The devastating human impact on biodiversity",
    "summary": "Humans are having a highly detrimental impact on biodiversity worldwide. Not only is the number of species declining, but the composition of species communities is also changing. This is one of the largest studies ever conducted on this topic.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:41 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Lasso-shaped antibiotic evades standard drug resistance",
    "summary": "A small molecule shaped like a lasso may be a powerful tool in the fight against infectious diseases.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:26:33 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "summary": "Strong wind, dry land and pine trees are a dangerous combination for wildfires, experts say.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "India: Why are private firms not investing despite record profits?",
    "summary": "Weak domestic consumption and muted export demand are restricting expansion plans, according to a report.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:29:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Trump says he will impose a 25 percent tariff on imported vehicles",
    "summary": "During a briefing on Wednesday, President Donald Trump announced plans to put a 25 percent tariff on cars and trucks imported into the US. Trump said the taxes would go into effect on April 2nd — the same time he’s expected to introduce a round of reciprocal tariffs, according to The New York Times. The [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T18:32:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Pete Hegseth says Signal chat had no ‘war plans’. He’s wrong, say experts",
    "summary": "Signal app messages revealed Yemen bombing timelines, prompting debate about their classification and implications.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 08:41:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Police: UGA's Tuggle driving 107 mph upon arrest",
    "summary": "Georgia wide receiver Nitro Tuggle was driving 107 mph before he was stopped and arrested by police on March 19, according to an Athens-Clarke County Police Department incident report.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "summary": "Can the Dodgers repeat? Who will win MVP? Our experts make their predictions for the 2025 season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:16:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Ukrainians in front line regions reel from losses, but say hope dies last for them",
    "summary": "Into their fourth year of war, Ukrainians living in or near front line regions of their country grapple with their losses and contemplate an uncertain future.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:34:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump's new tariffs could raise car prices. And, Dems demand answers after Signal leak",
    "summary": "Trump announced he'll impose 25% tariffs on imported cars starting next week. The decision received mixed reactions. And, Democrats are demanding answers after bombing plans were discussed on Signal.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 06:55:53 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump officials downplay the Signal leak. Some military members see a double standard",
    "summary": "The news of the leak of life-and-death operational details to a reporter lands differently with veterans and active-duty troops, who can be prosecuted for much less significant \"spillage\" incidents.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 05:00:00 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Déjà vu all over again? Dodgers are favorites as 2025 MLB season begins",
    "summary": "Major League Baseball's 2025 season gets fully underway Thursday. The scary news for the league: the defending champion Los Angeles Dodgers, favorites to repeat, may be even better this season.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 05:00:00 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "A new Utah law is Republicans' latest effort to limit mail ballot return",
    "summary": "Utah's new law is part of a larger effort by Republicans to limit the window in which mail ballots can be counted during an election.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 03:50:47 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Climate change and overfishing threaten Vietnam's tradition of making fish sauce",
    "summary": "Climate change and overfishing are making it harder to catch the anchovies essential to the condiment that underlies so much of Vietnam and southeast Asia's food.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:09:23 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Exhibit takes visitors inside the annex where Anne Frank lived",
    "summary": "For the first time, a re-creation of the annex where Anne Frank and her family hid is available outside of Amsterdam. Visitors in New York said its themes reverberated in today's political climate.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 00:01:00 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "As U.S. foreign aid grants get slashed, Greenland gets money for a dog race",
    "summary": "Second lady Usha Vance has scrapped a plan to attend Greenland's national dog sled race this week. But American tax dollars will help support the race anyway.",
    "domain": "General",
    "location": "National",
    "published": "Wed, 26 Mar 2025 20:00:53 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'They invited me - now they're attacking me': Signal chat journalist speaks to BBC",
    "summary": "Jeffrey Goldberg was mistakenly added to a chat of senior Trump officials. Now he's a political target.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:17:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Zelensky hopes US will 'stand strong' in face of Russian demands",
    "summary": "The Ukrainian president was answering questions from a panel of European journalists in Paris.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:36:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump announces 25% tariffs on car imports to US",
    "summary": "The US President says the tariffs on cars will come into effect on 2 April and car parts a month later.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 08:56:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "China's dream of becoming a football superpower lies in tatters",
    "summary": "China has failed to qualify for the last five World Cups - and once again, their chances look unlikely.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 22:47:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French film star Depardieu denies sexual assault allegations at trial",
    "summary": "The two legal teams have clashed repeatedly in court as the French film star's lawyer has questioned the credibility of the two plaintiffs.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 20:28:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Brazil's Bolsonaro to stand trial on coup charges, court rules",
    "summary": "Brazil's top court has ruled that there is enough evidence to warrant that Jair Bolsonaro be put on trial.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 19:16:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "summary": "The law will allow Polish authorities to temporarily spend asylum rights at the border with Belarus.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "summary": "Riek Machar and his wife are detained after a convoy of 20 armed vehicles entered his home, his party says.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:42:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "JD Vance will join wife in Greenland but trip scaled back",
    "summary": "Greenland's leaders have criticised planned visits by US officials after Trump's threats to annex the island.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 14:48:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French-Algerian writer jailed over Morocco comments",
    "summary": "Boualem Sansal, 80, told a far-right news outlet that colonial France gave too much land to Algeria.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:45:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Four US soldiers missing for two days in Lithuania",
    "summary": "Lithuanian forces say search is ongoing after US Army finds vehicle submerged during drills near Belarus border.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 21:14:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Niger coup leader sworn in as president for five years",
    "summary": "Gen Abdourahamane Tchiani is promoted to the highest rank in the army, and dissolves all political parties.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 18:46:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Army in full control of Khartoum, Sudan military leader says",
    "summary": "\"Khartoum is free,\" says army chief Abdel Fattah al-Burhan after almost two years of occupation by the RSF.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 20:29:25 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump names conservative media critic as US ambassador to South Africa",
    "summary": "Brent Bozell's nomination comes at a time when relations between South Africa and the United States are at a low point.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:32:38 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "DR Congo conflict tests China's diplomatic balancing act",
    "summary": "Fighting in a mineral-rich region of central Africa proves a quandary for Chinese business interests.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 23:20:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "At secret test-flight facility, Ukraine's drone makers fear energy ceasefire won't hold",
    "summary": "Ukraine long-range drone makers are worried Russia will use the ceasefire to gather strength and attack again.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 14:38:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The row that rocked K-pop: NewJeans tell BBC why they spoke out",
    "summary": "NewJeans talk to the BBC in their first interview since a court blocked their attempt to leave their record label.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 12:33:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Garmin adds AI and a subscription tier to its app",
    "summary": "It was only a matter of time. Garmin announced today it’s launching Garmin Connect Plus, a premium tier to its app that adds AI-powered insights and a few other expanded features. Existing and new Garmin users will be able to opt in to a free 30-day trial and then choose between a $6.99 monthly or [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T07:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Vivaldi bundles Proton VPN into its web browser",
    "summary": "Vivaldi and Proton have teamed up to make it easier for Vivaldi browser users to privately explore the web without downloading a virtual private network (VPN). Starting today, the free version of Proton VPN is now integrated directly into Vivaldi’s browser, and can be accessed by logging into a Vivaldi account. The feature is currently [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T06:44:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Uber Shuttle will get you to JFK airport for $10",
    "summary": "Uber is expanding its airport shuttle service to include one of the busiest hubs in the world, New York City’s John F. Kennedy International Airport. For a limited time, customers can grab a ride from specific stops in Manhattan or Brooklyn to JFK for just $10. After April 30th, the fare increases to $25, including [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T06:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poco’s F7 Ultra is a midrange phone with a flagship chip",
    "summary": "Poco is releasing its first phone with “Ultra” branding, and on paper it lives up to the name. The F7 Ultra runs on the flagship Snapdragon 8 Elite chipset, and combines it with a triple rear camera setup, 120W wired charging, and IP68 protection from dust and water. Despite those specs, it’s going on sale [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T05:25:27-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 85 best deals",
    "summary": "Just as flower buds are beginning to bloom to mark the seasonal shift toward warmer months, Amazon is hosting its first big sales event of 2025. The Big Spring Sale, as it is known, is live, and runs through Monday, March 31st, bringing with it a slew of discounts on gardening supplies, bedding, and other [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T21:34:09-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Republicans are still pushing for child safety laws, while Democrats wonder if a weakened FTC can enforce them",
    "summary": "Members of a House Energy and Commerce subcommittee met Wednesday to discuss what’s typically a highly bipartisan topic: protecting kids online. But in a far-from-typical political climate, the mood was tense and confrontational. Republican lawmakers are eager to revive a handful of bipartisan bills like the Kids Online Safety Act, which House Republican leadership blocked [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T20:02:27-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nothing’s colorful, entry-level earbuds have fallen to their best price to date",
    "summary": "From the AirPods Pro to the Shokz OpenRun Pro 2, Amazon’s Big Spring Sale has ushered in a number of surprisingly good deals on wireless earbuds. Neither of the aforementioned picks is probably the best option if you’re working with a tight budget, though, fortunately, there are cheaper alternatives. Right now for example, the already [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T18:48:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Microsoft revamps its Windows Game Bar",
    "summary": "Microsoft is sharing several new Xbox gaming updates for March that include a new look for Game Bar on PC, a new Cloud Gaming feature, and fresh benefits for playing some free-to-play games through Game Pass. Game Bar on PC, which gives you the ability to quickly launch games, control audio mixes, and monitor game [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-26T18:18:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Prosecutors want 15 years for ex-Spanish football president Villar",
    "summary": "Angel Maria Villar was replaced by Luis Rubiales in 2017 but now faces corruption and embezzlement charges.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:36:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sudan: At starvation’s edge",
    "summary": "Life for displaced Sudanese families is precarious.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:33:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The American dream is officially over",
    "summary": "All because the rich must always steal from the poor.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:19:31 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tottenham captain Son sparks South Korea pitch reviews as World Cup bid hit",
    "summary": "Captain Son Heung-min says poor pitches for home matches have hurt South Korea&#039;s 2026 World Cup qualifying campaign.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:37:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tsunoda-Lawson: F1 Red Bull Racing swap drivers ahead of Japan GP",
    "summary": "Yuki Tsunoda becomes the latest driver elevated to the famous F1 Red Bull team to drive alongside Max Verstappen.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:19:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Why is Pakistan’s new canal project sparking water shortage fears?",
    "summary": "Protesters fear than a plan to modernise agriculture could leave the lower riparian province of Sindh without water.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:54:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israeli air attack targets charity kitchen in Gaza",
    "summary": "An Israeli attack in central Gaza hit Palestinians who were waiting at a charity kitchen for a meal.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:51:07 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump calls Signal chat fallout a ‘witch hunt’ amid calls for probe",
    "summary": "Speaking to reporters from the Oval Office, Donald Trump focused on air strikes in Yemen rather than Signal chat leaks.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:12:03 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump says he may cut China tariffs to secure TikTok deal",
    "summary": "Trump says he will be willing to extend TikTok sale deadline in exchange for trade concessions.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 08:16:04 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump’s reactions to cyber breaches",
    "summary": "We compare and contrast Donald Trump criticising Hillary Clinton for risking sensitive data with a private email server",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 07:51:47 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "‘Columbia let me down’: How Indian scholar expelled by Trump fled the US",
    "summary": "A visa revocation and agents at her door upended life of Ranjani Srinivasan, spooking her into leaving her home and cat.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 07:40:55 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "‘Cat and mouse game’: Zimbabwe gov’t workers moonlight as street vendors",
    "summary": "With high inflation and a struggling economy, civil servants say they need secret side hustles to make ends meet.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 07:38:09 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Gaza Palestinians speak about Israel’s plan to force them out",
    "summary": "Israel&#039;s call for Palestinians to leave Gaza has been called ethnic cleansing.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 07:09:56 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "LeBron James, Lakers beat Pacers at the buzzer",
    "summary": "LeBron James helped the LA Lakers avoid a fourth straight loss with a dramatic last-second putback against Indiana.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 05:46:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump reiterates US must ‘have’ Greenland ahead of JD Vance visit",
    "summary": "US president said &#039;we have to have that land&#039;, as he claimed taking Greenland was essential for US national security.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 04:35:32 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "North Korea’s Kim Jong Un oversees tests of new AI-equipped suicide drones",
    "summary": "North Korea&#039;s leader oversaw tests of his country&#039;s latest military innovations which use artificial intelligence.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 04:22:09 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israeli military kills Hamas spokesman as Gaza assault continues",
    "summary": "Hamas spokesperson Abdel-Latif al-Qanoua was killed when Israeli fighters jets bombed his tent shelter in Jabalia.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:16:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump announces 25 percent tariffs on cars, ramping up trade war",
    "summary": "US president&#039;s announcement prompts swift backlash from trading partners, including the EU, Canada and Japan.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 02:49:58 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump administration arrests Turkish student Rumeysa Ozturk at Tufts",
    "summary": "A doctoral student at Tufts University has been detained by federal agents without explanation, her lawyer said.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 21:39:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "LeBron saves day as putback at buzzer lifts L.A.",
    "summary": "LeBron James tipped in a missed floater by Luka Doncic with 0.2 seconds remaining for his eighth career game-winning buzzer-beater, lifting the Lakers past the Pacers 120-119.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "New Giants QB Wilson: 'I expect to be the starter'",
    "summary": "Russell Wilson said he expects to be the starting quarterback of a Giants team that also signed Jameis Winston as a free agent and could be in the market for a quarterback in this year's draft.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "LeBron opens up on relationship with idol Jordan",
    "summary": "LeBron James opened up about the current relationship between him and Michael Jordan as part of a wide-ranging interview that aired Wednesday on \"The Pat McAfee Show.\"",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Hurley: Regret remarks, but not changing as coach",
    "summary": "UConn coach Dan Hurley acknowledged there are things that \"I wish I didn't do\" as he expressed regret over making profane comments about the officiating after the Huskies' NCAA tournament loss to Florida on Sunday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NFL expects more returns if kickoff pitch passes",
    "summary": "The NFL competition committee is recommending making the dynamic kickoff rule permanent and moving touchbacks to the 35-yard line in hopes of generating even more returns.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 01:04:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "MLB Opening Day is here! What we're watching, lineups and live updates from every game",
    "summary": "Baseball is back! Here's your one-stop shop for all of the season-opening action.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:16:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "summary": "Mike Tannenbaum puts his GM hat on and makes his own first-round selections.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:28:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Inside Brandon Graham's final, turbulent, triumphant season as an Eagle",
    "summary": "Graham, and family, recall the 15-year vet's final season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:43:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NHL playoff watch: Are the Minnesota Wild in trouble?",
    "summary": "A once-solid hold on playoff position now seems tenuous. Plus, projections for the entire postseason bracket.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:20:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How Calipari's departure led to Kentucky, Arkansas and BYU in the Sweet 16",
    "summary": "The coaching carousel dominoes have culminated in all three teams dancing to the second weekend.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:50:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "summary": "Hannah Hidalgo, Olivia Miles and Sonia Citron had their ups and downs. But now Notre Dame is in the Sweet 16, and the dynamic guard trio is driving toward a title.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 06:44:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Women's Sweet 16 rankings: UConn is No. 1, USC holds tight at No. 4",
    "summary": "The Sweet 16 is set, and there's a new No. 1. But all eyes are on USC and injured JuJu Watkins.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:39:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Already 2-0, Dodgers are the center of the spectacle on Opening Day",
    "summary": "Baseball hasn't seen anything like this superteam and its roster filled with All-Stars and phenoms.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 14:28:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "If Aaron Rodgers balks, what are Pittsburgh's prospects at quarterback?",
    "summary": "If the four-time MVP is out, the Steelers could sign a bridge QB, get someone in the draft or both.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:29:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Drake Maye gets No. 1 WR: Stefon Diggs immediately improves Patriots' offense",
    "summary": "Diggs returns to the AFC East and figures to make an impact with the young Patriots' quarterback.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:30:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "World Cup Onside/Offside: Will Argentina repeat? Will Spain win? USA has work to do",
    "summary": "With the international break done and dusted with all the major World Cup contenders in action, who's looking sharp right now and who needs work in the next 14 months? LME breaks it down.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 23:52:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The divergent fortunes of U.S.'s Pochettino, Mexico's Aguirre",
    "summary": "While Mauricio Pochettino's team has yet to lift off, Javier Aguirre's Mexico squad has already lifted silverware.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 23:52:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Scaloni: Stop pressuring Messi over '26 World Cup",
    "summary": "Argentina coach Lionel Scaloni said Lionel Messi will decide whenever he wants if he plays at the 2026 World Cup.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Davies' agent slams Canada staff over ACL tear",
    "summary": "Alphonso Davies' agent hit out at the player's treatment by Canada staff after it was announced that he has suffered a torn ACL against the United States, saying that the Bayern Munich star was \"pressured\" to play despite not being fully fit.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sources: Brazil set to decide Dorival's future",
    "summary": "The Brazilian Football Confederation (CBF) will discuss the future of Brazil coach Dorival Junior at a meeting on Friday, sources told ESPN Brasil.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Boston's NWSL team reveals new name -- again",
    "summary": "In a move to recover from a disastrous branding rollout five months ago, the expansion NWSL team has announced Boston Legacy Football Club as its new franchise name, superseding BOS Nation FC.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Slegers hails Arsenal comeback against Madrid",
    "summary": "Arsenal manager Renee Slegers praised her side's stirring comeback in their 3-0 win over Real Madrid in the Women's Champions League on Wednesday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: Onana wants Utd stay, plans to rebuff SPL",
    "summary": "André Onana intends to stay at Manchester United even if he receives an offer from Saudi Arabia, a source has told ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Chelsea fans call for Boehly ticket site probe",
    "summary": "Chelsea fans have asked the Premier League to investigate co-owner Todd Boehly's links to a ticket resale site.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:00:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Vini: Brazil must 'rethink everything' after loss",
    "summary": "Vinícius Júnior has called for Brazil to push the reset button following their alarming 4-1 defeat at Argentina in Tuesday's World Cup qualifier.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 00:36:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who wins LaLiga: Atlético, Barcelona or Real Madrid? Title race talking points",
    "summary": "LaLiga returns with Atleti, Barça and Madrid all after the title. ESPN's Alex Kirkland, Sam Marsden, Sid Lowe, Graham Hunter answer the key questions.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 23:52:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Paige Bueckers' pursuit: The national championship that keeps getting away",
    "summary": "Will Paige Bueckers win an elusive NCAA title or become the greatest UConn player to graduate without one?",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 15:00:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Top seed Boston College plays with Gaudreaus, Voce close to hearts",
    "summary": "Three former Eagles died this past summer. The current team hopes to win a national title in their memory.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 21:46:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Watkins' devastating injury shakes up women's NCAA tournament landscape",
    "summary": "JuJu Watkins' torn ACL changes the 2025 women's title race, and the effects could linger into next season.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 14:25:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NBA betting: Why you should fade the Celtics in these two markets",
    "summary": "The Celtics lead two key futures markets entering Wednesday night's game but here's why bettors should be cautious.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 14:22:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sources: Tsunoda to replace Lawson for Red Bull in Japan",
    "summary": "Yuki Tsunoda will replace Red Bull's Liam Lawson at the Japanese Grand Prix, sources have confirmed to ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 08:14:17 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "EA Sports F1 25 release date, details, cover revealed",
    "summary": "EA Sports' latest racing game is set to be released on May 30, 2025, for PC, PS5, and Xbox Series X|S.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 13:51:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "MLB The Show 25 Review: Small but worthwhile upgrades",
    "summary": "MLB The Show 25 doesn't revolutionize the genre, but it's the best game in the series with some fun ideas.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 13:51:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mikaela Mayer-Sandy Ryan rivalry explained: All you need to know",
    "summary": "Ahead of their rematch on Saturday, we look at the Mayer vs. Ryan feud, the paint incident, and more.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 08:08:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Transfer rumors, news: Arsenal eye Ekitike as Isak alternative",
    "summary": "Arsenal have identified Eintracht Frankfurt striker Hugo Ekitike as an alternative to Newcastle's Alexander Isak. Transfer Talk has the latest news, gossip and rumors.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 20:28:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UFL threads: Breaking down the uniforms for each team",
    "summary": "The UFL returns on Saturday. Here's a look at the uniforms each team will feature.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 09:30:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "2025 guide: Logos, coaches, key players and more",
    "summary": "Here are the teams, coaches and key players who will take the field as the UFL begins Season 2.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 09:30:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "March Madness and babies: Are the sounds of the game too big for little ears?",
    "summary": "What's the right age to take kids to a loud sporting event? A Johns Hopkins noise expert on protecting babies' ears and when game day noise might be too much for them.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 05:00:00 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "UN warns of conflict in South Sudan amid reports of VP Riek Machar’s arrest",
    "summary": "First Vice President Riek Machar reportedly arrested after armed convoy entered his residence in the capital, Juba.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 02:17:14 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "Predicting the women's Sweet 16: The case for and against every team to reach the regional final",
    "summary": "Why might every Sweet 16 team win its regional semifinal matchup in Birmingham and Spokane? We predict the winners.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:39:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "summary": "The allegations have left much of college athletics concerned about what other athletes might be victims.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "You can't stop Cooper Flagg: 'He wants to win every possession'",
    "summary": "Arizona's best chance of defending Duke's star is by limiting him. Here's how -- and why it might not be enough.",
    "domain": "Sports",
    "location": "National",
    "published": "Wed, 26 Mar 2025 09:58:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  }
]