[
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 19:45:26 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Two Jewish people died in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue on the holiest day in the Jewish religious calendar.",
      "Keir Starmer says Britain must defeat rising antisemitic hatred.",
      "Authorities in the UK are investigating what they described as a terrorist incident outside a synagogue in Manchester.",
      "A car was rammed into pedestrians and at one person stabbed as worshippers arrived to celebrate Yom Kippur.",
      "Police in the UK have declared a major incident outside a synagogue in Manchester. Two people died of their injuries, and the attacker was confirmed to be dead after police opened fire.",
      "UK authorities step up security at Jewish sites after what Starmer denounces as a terrorist incident",
      "<p>Police say they believe they know identity of man behind car and knife attack that left four people seriously injured</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live\">Manchester synagogue stabbing – latest updat",
      "Two people were killed and at least four others were in serious condition after the vehicle ramming and stabbing attack on Yom Kippur. Police said the suspect was dead.",
      "<p>Witnesses screamed ‘he’s got a bomb’ and ‘shoot him’ before suspect was killed by armed police</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live\">Manchester synagogue stabbing – latest updates</a></p></li></ul><p>",
      "<p>North of England editor Josh Halliday reports from the scene of the attack on Heaton Park Hebrew Congregation synagogue, in which two people were killed and three others seriously injured, in what appears to be the worst antisemitic incident in the UK in living memory</p><p>On Thursday morning at"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dafd/live/b8da6150-9f8d-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Worshippers helped stop suspect from entering synagogue - what we know about attack",
      "Manchester Synagogue Attack: What We Know So Far",
      "What we know about deadly UK synagogue attack",
      "Deadly Manchester synagogue attack: What we know about victims and attacker",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Two killed in attack at Manchester synagogue",
      "Manchester synagogue terror attack: two killed and suspect shot dead",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
      "Six minutes of terror: how Manchester synagogue attack unfolded",
      "The Manchester synagogue terror attack – Today in Focus Extra"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.97,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.839,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Hikes Lease Prices Amid Record Q3 Deliveries, Tax Credit Expiry",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:32:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Fortune",
      "Al Jazeera",
      "Financial Times",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "www.cnbc.com",
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "Analysts expect sales by the electric automaker to slump in the months ahead.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1kanBtZU5jREtadjBQYm1GUG9PZG9JOUFiVkhDM2N5Tk9yOURCOTgtYlRaektiU05Gc0t4TUtpZklaWWlhUHJRVEFZc2RTRGZiZzlaNktmaVAxVTFXWFhycmVwZGpHaS1SRl9IcHZvYw?oc=5\" target=\"_blank\">Tesla hikes lease prices as EV tax credit expires</a>&nbsp;&nbsp;<font color=",
      "Tesla's third-quarter deliveries got a boost as some consumers rush to buy electric vehicles before a federal tax credit expired.",
      "Q3 deliveries increased for first time in three quarters",
      "Tesla Inc. reported a surprise record quarter of vehicle sales as US consumers accelerated electric-car purchases before federal tax credits expired."
    ],
    "image_url": "",
    "titles": [
      "Tesla sales jump as buyers scramble before EV tax credit expires",
      "Tesla hikes lease prices as EV tax credit expires - Axios",
      "Tesla deliveries rise 7% before EV tax credits expire",
      "Tesla sales hit record as US buyers rush to beat end of tax credits",
      "Tesla sales surge to record on rush to snag U.S. tax credit"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.926,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla increased its lease prices following a surge in third-quarter deliveries, with 497,000 vehicles delivered as consumers rushed to purchase electric vehicles before the expiration of a $7,500 federal tax credit on September 30. This expiration motivated buyers and contributed to Tesla's sales growth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Perplexity's Comet Browser Now Free, Aims to Elevate Content Quality",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:56:13 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "TechCrunch",
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Perplexity initially launched Comet in July to Perplexity Max subscribers for $200 a month",
      "Perplexity's Comet browser is now free as the AI startup fights low-quality content and partners with publishers like CNN and The Washington Post.",
      "After launching to subscribers willing to fork out hundreds of dollars a month this summer, Perplexity’s agentic AI browser Comet is now available to everyone for free. “The internet is better on Comet,” the company says, promising to remain free forever as it styles the browser as a serious challen",
      "AI search startup Perplexity is making its new Comet browser available to everyone in the world for free as it works to position the product against big browsers and search engines. For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via "
    ],
    "image_url": "",
    "titles": [
      "Perplexity AI rolls out Comet browser for free worldwide",
      "No more slop: Perplexity makes its $200 AI browser free",
      "Perplexity’s Comet browser is now available to everyone for free",
      "Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.974,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Perplexity launched its Comet browser in July for $200 a month to Perplexity Max subscribers. Now, the AI startup has made Comet free for all users, aiming to combat low-quality content and collaborating with publishers like CNN and The Washington Post. This move positions Comet as a competitor to major browsers and includes a 'background assistant' feature for certain paid subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caitlin Clark Backs Collier's Critique of WNBA Commissioner as Historic",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 15:55:40 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Fever star Caitlin Clark said Napheesa Collier \"made a lot of very valid points\" this week when the Minnesota Lynx star ripped WNBA commissioner Cathy Engelbert.",
      "Clark added that this is 'the biggest moment in WNBA history'",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE4xWkpLTXg2OHRzNENWTk9fT0pTMzQ5aEt3dDR1cnRpQXRJS01qRWpTbTFiV250blMtbWhodnI3bTNnQkN4T3FBN2RTemdQZnNOVlJEYS1kMEQ3VUpoZlpSOHdJd2VFUmF0b0pJX09tSlpnb2R2?oc=5\" target=\"_blank\">Caitlin Clark Thinks Napheesa Collier Made 'Very Valid Points' In Criti"
    ],
    "image_url": "",
    "titles": [
      "Clark: Collier made 'valid points' about Engelbert",
      "Caitlin Clark says Napheesa Collier made 'a lot of very valid points' about WNBA commissioner Cathy Engelbert",
      "Caitlin Clark Thinks Napheesa Collier Made 'Very Valid Points' In Criticism of WNBA Head - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.994,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.778,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caitlin Clark of the Fever supported Napheesa Collier's criticisms of WNBA commissioner Cathy Engelbert, calling them \"very valid points.\" Clark emphasized the significance of this controversy, labeling it \"the biggest moment in WNBA history.\" This reflects ongoing discussions and possibly disputes within the WNBA community.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Faces Government Shutdown Amid Failed Party Negotiations",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:58:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The US presidents meets with the White House budget director as the shutdown continues into a second day, amid impasse.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTh3VTFKSEYxa3hFRVpxN2xuang0cHJGNHVmSkVfaWtKU3F5Y2MtUFVGWndNRGN1d2o4VzdmVFBQTjd5azNYRU1fV2dIeTNKNWp1MWVRWjZleVB4cWFNdWNuamg4U3VpLXlsd253ZERBT2p3R19fNlR0SHducTFCcElKalFOcUtrZDExY3pyZkplSkk?oc=5\" target=\"_blank\">Trump admin uses government ",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPc2FrNE5HdEtPQXE1VmkwSHJMWU5ySzFMLVZrclluZkFTd1FLX04tQlhWMlJlRWVBclpVeC04cHBONHR4NjJTZHJmYlA4T0duNWdfOE9ZMkZGc0wyV0IxNmxud01SOTJDcmc0V2cxazhiRDZTSlFpUDlyS2ZrMEdhVA?oc=5\" target=\"_blank\">House Democrat rages against his own party on the gov",
      "Democrats accuse White House of using closure as cover for project to shrink government"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens to cut ‘Democratic agencies’ amid government shutdown",
      "Trump admin uses government sites to blame Democrats for shutdown - Axios",
      "House Democrat rages against his own party on the government shutdown - Axios",
      "Trump threatens permanent spending cuts as US shutdown continues"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US is experiencing another government shutdown after negotiations between parties failed. Public pressure and political dynamics suggest one side may eventually yield to end the deadlock. This shutdown is marked by the threat of mass layoffs, with potential \"reductions in force\" starting imminently. The situation remains unresolved, impacting various sectors and government functions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:14:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "South Africa and Turkey have criticised the incident in international waters. Israel says those on board are safe.",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war.",
      "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0952/live/0af28640-9f7d-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Israel intercepts Gaza flotilla and detains activists including Greta Thunberg",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
      "Israel Detains Activists After Intercepting Flotilla Headed to Gaza: What to Know"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.94,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Discuss Agency Cuts with Budget Director Vought",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 13:46:49 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQLURNREVuNHRwS0tzX2ZsSzZjOE1TN2FjR2MyMzBZUkEwRHhrVFBkRlJhM0lTalNPa3R4dHk4eGY0cEZqN3ZGYzlxOE9GWHNIQW00cXFfQVJFT0ZQNmVWemx2M0RscXN0cHpxNUxvQmI2eEhFQm5tT0hVYnpOVGlQS29HRmtUZw?oc=5\" target=\"_blank\">\"Unprecedented opportunity\": Trump, Vought to",
      "Trump in a Truth Social post said he will meet with Office of Management and Budget Director Russell Vought to discuss cutting agencies.",
      "<p>Republicans and Democrats engage in war of words as White House also uses impasse to cut government spending</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates\">US government shutdown – latest updates</a></p></li></ul><p>"
    ],
    "image_url": "",
    "titles": [
      "\"Unprecedented opportunity\": Trump, Vought to decide which \"Democrat\" agencies to cut - Axios",
      "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities",
      "Trump sees ‘unprecedented opportunity’ to punish Democrats as shutdown enters day two"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.856,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Trump announced on Truth Social that he plans to meet with Office of Management and Budget Director Russell Vought to discuss reducing government agencies. The outcome of the meeting and any subsequent actions are yet to be determined.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Morocco Protests Turn Violent: 2 Dead, Hundreds Injured; Unrest in Madagascar",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:39:45 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Police say they shot dead two people who were part of a crowd trying to storm a police station.",
      "After almost a week of regular demonstrations, protests in Morocco turned violent, resulting in hundreds injured and two deaths. Who's behind the protests, what are they demanding, and where might this end?",
      "A youth-led movement against the president of Madagascar is sustaining protests across the country. John Eligon, the Johannesburg bureau chief for The New York Times, explains what’s happened."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/56aa/live/c7c27130-9f7e-11f0-8978-23dd7eb26e73.jpg",
    "titles": [
      "First killings in Morocco since Gen Z protests erupted",
      "Morocco's Gen Z protests: What you need to know",
      "What We Know About the Protests in Madagascar"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Morocco, protests demanding unspecified changes turned violent, leading to two deaths and hundreds injured as police shot two individuals storming a station. Meanwhile, in Madagascar, a youth-led movement protests against the president, as reported by John Eligon. Both countries are experiencing significant unrest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Found Stabbed to Death on Ottawa's St. Laurent Boulevard",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 17:29:58 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Ottawa police say a man is dead after an alleged stabbing that occurred on St. Laurent Boulevard in the city's east end Thursday morning.",
      "Police found the victim with numerous stab wounds at about 7 a.m. on St Laurent Boulevard."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/adcb20a1eaa7d2a4d1e5571ea01aa144ef7c84b3e3d9f17101108487183ce08f.jpg?quality=65&strip=all",
    "titles": [
      "Man dead after stabbing in Ottawa’s east end: police",
      "Homicide squad investigating stabbing death of man in east end"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A man was found dead with multiple stab wounds on St. Laurent Boulevard in Ottawa's east end early Thursday morning, according to police. The incident, reported at about 7 a.m., is being investigated as a stabbing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Green Project Funding Canceled in 16 States by OMB Director",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 12:37:09 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "Office of Management and Budget Director Russ Vought said the funding was for projects in 16 states, all of which voted for former Vice President Kamala Harris.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE50WFZmekNjdXM5dE41VEVka2xMM04tYVpkOXBoZ05YYm5OUkRKa2d2cnFFYVJGcTZNT0tLbVhvTWVLMHB3bnM1M201M3hHX3hCOTM5UDVQYXdLdUpMWkVjTC1weTBHQTFRT2loUFFn?oc=5\" target=\"_blank\">Energy Department ends billions in green awards after Vought post</a>&nbsp;&nbs"
    ],
    "image_url": "",
    "titles": [
      "The Energy Department canceled billions in funding. Democrats say it's retribution",
      "Energy Department ends billions in green awards after Vought post - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Office of Management and Budget Director, Russ Vought, announced the cancellation of funding for green projects in 16 states, all of which had voted for Kamala Harris. Following Vought's statement, the Energy Department terminated the awards program. This decision affects billions in green energy funding previously allocated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "technology",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:38:10 +0000",
    "source": "New York Times",
    "sources": [
      "TechCrunch",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/02/multimedia/02cli-clean-energy-cuts-fjkz/02cli-clean-energy-cuts-fjkz-mediumSquareAt3X.jpg",
    "titles": [
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL to Launch Men's and Women's Flag Football Leagues",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 19:47:23 +0000",
    "source": "Fortune",
    "sources": [
      "Sportsnet",
      "Fortune"
    ],
    "domains": [
      "www.sportsnet.ca",
      "fortune.com"
    ],
    "snippets": [
      "“We’re committed to creating a women’s professional league, and a men’s professional flag league,\" Goodell said at an event in London.",
      "<p>The NFL plans to launch women&#8217;s and men&#8217;s professional flag football leagues “in the next couple of years,” commissioner Roger Goodell said Thursday.</p>"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/10/GettyImages-2236683822-e1759433781820.jpg?w=2048",
    "titles": [
      "The NFL is launching professional flag football leagues for both men and women, Commissioner Roger Goodell says",
      "NFL plans to launch professional flag football leagues ahead of Los Angeles Olympics"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL Commissioner Roger Goodell announced plans to launch women's and men's professional flag football leagues within the next few years. This statement was made during an event in London, emphasizing the NFL's commitment to expanding its reach and inclusivity in sports.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "L.A. vs. Philadelphia in National League Division Series Showdown",
    "domain": "business",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 11:10:30 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "The first division series is set! Here's how L.A. and Philly stack up for a clash of National League titans.",
      "It’s street tacos vs. cheese steaks. It’s West-Coast glitz vs. East-Coast grit. And it’s Shohei vs. Schwarbombs."
    ],
    "image_url": "",
    "titles": [
      "A Dodgers  vs. Phillies NLDS?! Here's how each team can win it",
      "How The Phillies and Dodgers Match Up In The NLDS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The first division series in the National League is confirmed, featuring a match-up between Los Angeles and Philadelphia. This series is highlighted by the cultural and stylistic contrasts between the two cities, as well as a key player showdown: Shohei Ohtani of L.A. against Kyle Schwarber of Philadelphia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attack Outside Manchester Synagogue on Yom Kippur; Assailant Shot by Police",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 09:03:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Prime Minister Keir Starmer called the attack outside a synagogue in Manchester, England, \"all the more horrific\" for taking place on Yom Kippur, Judaism's holiest day.",
      "The police said a man drove a car into people in front of the synagogue in Manchester, England, and stabbed others. The assailant was shot dead by the police."
    ],
    "image_url": "",
    "titles": [
      "U.K. police investigate Manchester's deadly synagogue attack as a terrorist incident",
      "Deadly Car Ramming and Stabbing at U.K. Synagogue Is Declared Terrorist Attack"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.861,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A man attacked individuals outside a synagogue in Manchester, England, by driving a car into them and then stabbing others. The incident, occurring on Yom Kippur, Judaism's holiest day, was condemned by Prime Minister Keir Starmer as \"all the more horrific.\" The assailant was shot dead by police.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Labels Caribbean Cartels \"Unlawful Combatants,\" Orders Strikes",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:22:21 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>President also said the US is now in a ‘non-international conflict’, according to a White House memo</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has declared that drug cartels operating in the Caribbean are “unlawful combatants” and says the United States is n",
      "The U.S. military has carried out multiple strikes targeting alleged drug smuggling boats in the region in recent weeks."
    ],
    "image_url": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=140&quality=85&auto=format&fit=max&s=90dcff67bc88d491bbace822388cfa86",
    "titles": [
      "Trump declares that drug cartels operating in the Caribbean are ‘unlawful combatants’",
      "Trump Says U.S. Engaged In ‘Armed Conflict’ With Caribbean Drug Cartels, Declaring Them ‘Unlawful Combatants’"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump declared drug cartels in the Caribbean as \"unlawful combatants,\" indicating the U.S. is in a \"non-international conflict\" with them, per a White House memo. Following this declaration, the U.S. military executed several strikes against boats suspected of drug smuggling in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Guardians, Tigers to Battle in Decisive Game 3 of AL Wild Card Series",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 18:41:09 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Wild Card Series wraps up with a winner-take-all Game 3 on Thursday",
      "<p>The Cleveland Guardians and the Detroit Tigers play in Game 3 of the AL Wild Card Series. The series is tied 1-1, and the winner advances to the ALDS.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/01/8c3c2167-0b1e-4250-8208-922561167309/rocchio-getty.png",
    "titles": [
      "Tigers vs. Guardians 2025 Wild Card Series schedule, scores: Where to watch MLB playoff games, TV coverage",
      "AL Wild Card Series on Sportsnet: Tigers vs. Guardians, Game 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cleveland Guardians and the Detroit Tigers are set to compete in Game 3 of the AL Wild Card Series on Thursday, with the series currently tied at 1-1. The victor of this decisive game will advance to the ALDS.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:18:55 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said.",
      "The police said a man drove a car into people in front of the synagogue in Manchester, England, and stabbed others. The assailant was shot dead by the police."
    ],
    "image_url": "",
    "titles": [
      "Two killed in attack at synagogue on Yom Kippur in England",
      "Live Updates: 2 Killed in Attack at British Synagogue on Yom Kippur"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Michelle Mone Accuses Chancellor of Inflammatory Language Over Covid Contract",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:36:40 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Her comments come after a firm linked to the peer was ordered to pay £122m over a Covid-19 contract.",
      "<p>Peer writes to PM over chancellor’s ‘vendetta’ comment after company ordered to repay £122m of Covid contract</p><p>Michelle Mone has accused the chancellor of using “dangerous and inflammatory” language about her, after a company linked to the peer was ordered to repay millions of pounds for bre"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9197/live/5c8dfd50-9fbd-11f0-b73e-e715acbd6a10.jpg",
    "titles": [
      "Baroness Mone accuses chancellor of 'inflammatory' language",
      "Michelle Mone accuses Rachel Reeves of inflammatory remarks over PPE ruling"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Michelle Mone wrote to the Prime Minister accusing the Chancellor of using \"dangerous and inflammatory\" language following a court order for a company associated with her to repay £122m from a Covid-19 contract.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Primatologist Jane Goodall Dies, Leaves Conservation Legacy",
    "domain": "science",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 14:50:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Phys.org",
      "Al Jazeera"
    ],
    "domains": [
      "phys.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Jane Goodall, the conservationist and primatologist renowned for her groundbreaking research on chimpanzees, has died.",
      "Famed primatologist Jane Goodall was renowned for her groundbreaking work with chimpanzees but dedicated her life to helping all wild animals—a passion that lasted until her death this week while on a U.S. speaking tour."
    ],
    "image_url": "",
    "titles": [
      "Renowned chimpanzee researcher Jane Goodall dies at 91",
      "What to know about the life and legacy of chimpanzee researcher and wildlife advocate Jane Goodall"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Renowned conservationist and primatologist Jane Goodall, known for her pioneering research on chimpanzees, has passed away. Goodall, who was on a speaking tour in the U.S., dedicated her life to the protection of wild animals. Her contributions to science and conservation have left a lasting legacy.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches \"Add to Delivery\" Feature for Prime Members in the US",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-02T13:36:32-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Amazon has announced a new shopping feature for US Prime members called Add to Delivery that lets you add additional items to completed orders that have yet to be delivered, instead of having to create an entirely new order. The feature is only available on Amazon’s app and on Amazon.com when access",
      "Amazon's new \"Add to today's delivery\" button makes it easier for Prime members to buy more and tack on items to existing orders."
    ],
    "image_url": "",
    "titles": [
      "Amazon now lets Prime members add items to completed orders",
      "Amazon now lets Prime members add items to upcoming orders with one tap"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon launched a feature for US Prime members called \"Add to Delivery,\" allowing them to add items to orders already in progress. This aims to streamline shopping by eliminating the need for separate orders for additional items. The feature is accessible exclusively through the Amazon app and website.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Prime Minister, King Condemn Manchester Synagogue Stabbing as Antisemitism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:15:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The prime minister said Britain must defeat antisemitic hate, as the King, religious leaders and politicians issue statements.",
      "<p>PM calls attack in Manchester an act of antisemitism and says country will stand up to hatred behind it </p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live\"><strong>Manchester synagogue stabbing – latest updates</s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b55f/live/89acb720-9fb5-11f0-8410-854cfa733f11.jpg",
    "titles": [
      "Starmer vows to protect Jewish communities",
      "Starmer promises to increase police presence in Jewish communities after terror attack"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Prime Minister of Britain has labeled a stabbing at a Manchester synagogue as an act of antisemitism and declared the nation's commitment to combating the hatred behind it. This statement was made alongside remarks from the King, religious leaders, and politicians, all condemning the attack and emphasizing the need to fight antisemitic hate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta's Threads Introduces Communities Feature for Interest-Based Engagement",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-02T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Threads is testing a new feature called communities globally on its web platform and mobile apps, which will serve as dedicated spaces where you can find content or posts about your favorite topics. Starting today, you can explore different communities surrounding things like professional basketball",
      "The idea, explains Meta, is to give users dedicated spaces within the app where they can delve deeper into conversations on topics that matter to them."
    ],
    "image_url": "",
    "titles": [
      "Threads adds communities to put your interests front and center",
      "Threads takes on X with new communities feature"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Threads, a platform by Meta, is rolling out a new feature named communities on its web and mobile applications worldwide. Communities are designed as specific areas for users to discover and engage with content related to their interests, such as professional basketball. This update aims to enhance user experience by facilitating deeper discussions on preferred topics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PGA CEO to Apologize for Ryder Cup Abuse, Says No Place in Golf",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 13:12:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "There is \"no place in golf\" for the abuse suffered by Rory McIlroy and Team Europe at the Ryder Cup, says PGA of America CEO Derek Sprague.",
      "PGA of America chief executive Derek Sprague says the abuse Rory McIlroy and his family suffered at the Ryder Cup \"crossed the line\" and he plans on apologising to them."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg",
    "titles": [
      "PGA chief to apologise to McIlroy family over Ryder Cup abuse",
      "PGA chief to apologise to McIlroy and his family for Ryder Cup abuse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.846,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "PGA of America CEO Derek Sprague stated that the abuse directed at Rory McIlroy and Team Europe during the Ryder Cup was unacceptable and crossed the line. He plans to apologize to McIlroy and his family, emphasizing there is \"no place in golf\" for such behavior.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers Extend Niko Mikkola for 8 Years, Securing Top Defensemen",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 14:15:00 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNM012M2tWcG9IVE5zTUtVVEZ1RnJCV3lYYkYtWTU5aWtrRjJNMmxmMHpSaExJQjE3VTVkOWtqNkZVZHdvdnRFclNUbDlBYmhROVJ6eTFUeGZnZGNhN19oQ0tNOEJoZzgyYUUwY3RvTjJLeW8yV2k2SUJxT1RNOHpzRVNhSk1UUVBE?oc=5\" target=\"_blank\">Mikkola signs 8-year contract with Panthers",
      "<p>The defenceman signed an eight-year contract extension with the Panthers, the team announced on Thursday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Mikkola signs 8-year contract with Panthers - NHL.com",
      "Panthers sign Niko Mikkola to eight-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.865,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Florida Panthers have signed defenseman Niko Mikkola to an eight-year contract extension, ensuring their top four defensemen are secured until at least 2030. The team announced this agreement on Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Roma Suffers First Europa League Defeat, Misses Three Penalties Against Lille",
    "domain": "sports",
    "source_domain": "www.getfootballnewsitaly.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:44:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "romapress.net",
      "www.getfootballnewsitaly.com"
    ],
    "snippets": [
      "Serie A side Roma lost 1-0 to Lille in their second game of the UEFA Europa League.The result came about in unique circumstances, as Roma missed as many as three penalties in the tie. Artem Dovbyk mis...",
      "Roma failed to replicate the result in Nice and suffered their first Europa League defeat. Lille won 1-0 at the Olimpico. After the final whistle, Gian Piero Gasperini commented on his team’s perfor..."
    ],
    "image_url": "",
    "titles": [
      "Gian Piero Gasperini after Roma&#8217;s 3 missed penalties v Lille: &#8220;I&#8217;ve never seen that before&#8221;",
      "Gasperini after loss to Lille: &#8220;I never saw 3 missed penalties.&#8221;"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.99,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Roma lost 1-0 to Lille in their UEFA Europa League match, marking their first defeat in the competition. The game was notable for Roma missing three penalties, a rare occurrence that significantly impacted the outcome. This loss came despite their previous performances, with coach Gian Piero Gasperini commenting on the team's performance after the match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jimmie Kaylor Shares NFL DFS Picks for Rams vs. 49ers Game on Oct. 2, 2025",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 18:31:22 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "Jimmie Kaylor shares his top NFL DFS picks, daily fantasy optimal lineups, and NFL DFS stacks for Rams vs. 49ers on 'Thursday Night Football'",
      "The SportsLine projection model has revealed its Los Angeles vs. San Francisco picks for the 2025 NFL Week 5 'Thursday Night Football' game",
      "Here's everything you need to know about the NFL for Oct. 2"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/13/0a73090a-ac49-4603-8bbd-9b76bc4cdef9/christian-mccaffrey-49ers.jpg",
    "titles": [
      "NFL DFS picks, Thursday Night Football: 49ers vs. Rams daily fantasy lineups, advice on DraftKings, FanDuel",
      "Rams vs. 49ers predictions, odds, time: 2025 NFL Week 5 Thursday Night Football picks by proven model",
      "NFL Week 5 picks, nine coaches on the hot seat and expert picks for 49ers at Rams on 'Thursday Night Football'"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.965,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jimmie Kaylor disclosed his leading NFL DFS selections, optimal lineups, and stacks for the Rams vs. 49ers 'Thursday Night Football' game. Additionally, the SportsLine projection model released its picks for the Los Angeles vs. San Francisco Week 5 NFL game scheduled for Oct. 2, 2025. This information aims to guide fans and bettors for the upcoming match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Experts Release College Football Picks for Week 6",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 18:25:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Emory Hunt has revealed his New Mexico State vs. Sam Houston picks for Thursday's Conference USA matchup",
      "SportsLine expert Jimmie Kaylor has revealed his SJSU Spartans vs. New Mexico Lobos picks, predictions, and best bets for Friday's game",
      "The SportsLine Projection Model has revealed its West Virginia vs. BYU picks for Friday's Big 12 matchup",
      "The SportsLine Projection Model has made its South Florida vs. Charlotte picks for Friday's American Conference matchup",
      "Thomas Casale has locked in his top three college football picks for Week 6 and his CFB parlay could pay out around +600"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/10/af5acbea-c3da-4fc2-ad6b-26e244160188/imagn-logan-fife-new-mexico-state.jpg",
    "titles": [
      "Sam Houston vs. New Mexico State prediction, odds, time: 2025 college football Week 6 picks by top expert",
      "New Mexico vs. San Jose State prediction, odds: 2025 college football Week 6 picks by expert who's up 99 units",
      "BYU vs. West Virginia prediction, odds, line, start time: 2025 college football Week 6 picks by proven model",
      "Charlotte vs. South Florida prediction, odds, line, start time: 2025 college football Week 6 picks by model",
      "2025 college football picks, Week 6 odds, predictions by proven expert: This parlay returns +600"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.963,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine experts and the Projection Model have released their picks for upcoming college football games. Emory Hunt has chosen for the New Mexico State vs. Sam Houston, and Jimmie Kaylor for the SJSU Spartans vs. New Mexico Lobos matchups. The Projection Model has made its selections for West Virginia vs. BYU and South Florida vs. Charlotte. Additionally, Thomas Casale has shared his top three college football picks for Week 6, offering a parlay with a potential payout of around +600.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Matthew Jordan Ties for Lead at Alfred Dunhill Links with 10-Under 63",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 19:27:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com"
    ],
    "snippets": [
      "Englishman Matthew Jordan shared the lead after the first round of the Alfred Dunhill Links Championship thanks to an opening 63 (10-under) on the Old Course at St Andrews.",
      "Highlights from day one of the Alfred Dunhill Links Championship at the Old Course St Andrews, Carnoustie and Kingsbarns in Scotland."
    ],
    "image_url": "https://e1.365dm.com/25/10/1920x1080/skysports-matthew-jordan-golf_7039455.jpg?20251002190624",
    "titles": [
      "Jordan shares lead with Johnson in mix at Alfred Dunhill Links Championship",
      "Ryder Cup stars back in action at Alfred Dunhill Links Championship"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.964,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Matthew Jordan, an Englishman, tied for the lead in the Alfred Dunhill Links Championship with a 10-under 63 in the first round at St Andrews. The tournament took place at St Andrews, Carnoustie, and Kingsbarns in Scotland.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]