[
  {
    "title": "\"ABC Suspends 'Jimmy Kimmel Live' After Host's Controversial Remarks\"",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 17 Sep 2025 23:40:58 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "Forbes",
      "Financial Times",
      "The Guardian",
      "NPR",
      "Deutsche Welle",
      "Fortune",
      "MarketWatch",
      "Axios",
      "Business Insider",
      "CityNews",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "fortune.com",
      "www.theguardian.com",
      "www.marketwatch.com",
      "www.cnbc.com",
      "www.ft.com",
      "news.google.com",
      "www.npr.org",
      "www.businessinsider.com",
      "www.dw.com",
      "ottawa.citynews.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "The move follows an appearance by the FCC commissioner, who criticized Kimmel's recent monologue.",
      "The late-night host said on Monday that Trump's allies were \"doing everything they can to score political points from\" Kirk's death.",
      "Kimmel accused President Trump&#039;s MAGA movement of trying to politically capitalise on the murder of Charlie Kirk.",
      "Kimmel&#039;s cancellation is the latest in a spate of firings related to comments made about Charlie Kirk&#039;s assassination.",
      "ABC network is taking \"Jimmy Kimmel Live\" off the air indefinitely in response to comments the late-night host made about the killing of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQZXNjSFVmMWhZaGxKOEJBU0xRbXFGdElMdGxUOGxsenY0ZmstTkNray0yMkUzbU5acDVDYnZ6aG92dFhjY1BjQjBldmhwUFZSUldFTUhOd3piWlA1QjRqMHNESXF2ZmE4UWdmV3hYVUZJeTI2TUFnNnZZQmg2ZHJEa1VR?oc=5\" target=\"_blank\">What Jimmy Kimmel said about Charlie Kirk's killing",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1UUENQRkYxZGt6M1MyX1YxaVVHVGlvUEtEYWJ5RjNaMXVDV2I4dVJUbllIOHBSX0FreHhMa2NybTQ1U1pjdFRNN0kxVnFnaE1GZDdETkhCZ09NeDFCMm1ubVBrSWN4aTdpUFUwTnVHZw?oc=5\" target=\"_blank\">ABC pulls Jimmy Kimmel after Charlie Kirk comments</a>&nbsp;&nbsp;<font color",
      "Jimmy Kimmel suggested that Tyler Robinson, the man accused of killing Charlie Kirk, was aligned with President Donald Trump's MAGA movement.",
      "Late-night TV host’s remarks about the man accused of killing the conservative activist provoked criticism",
      "<p>ABC says late-night show will not air for foreseeable future after Kimmel accused Republicans of ‘doing everything they can to score political points’ from Kirk’s killing</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-k",
      "The talk show will be replaced immediately by another ABC program.",
      "ABC pulled Jimmy Kimmel off the air indefinitely after his comments about Charlie Kirk's killing and his alleged shooter Tyler Robinson.",
      "Kimmel, among other things, said that “many in MAGA land are working very hard to capitalize on the murder of Charlie Kirk.”",
      "ABC said Wednesday that it was pulling late-night host Jimmy Kimmel’s show indefinitely following remarks he made about the shooting of conservative activist Charlie Kirk that had drawn a rebuke from the Trump administration.",
      "ABC suspended Jimmy Kimmel’s late-night show indefinitely beginning Wednesday after comments that he made about Charlie Kirk’s killing led a group of ABC-affiliated stations to say it would not air the show. Kimmel, the veteran late-night comic, made several comments about the reaction to Kirk’s ass"
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel show is pulled by ABC after comments about the Charlie Kirk killing",
      "US TV host Jimmy Kimmel taken off air over Charlie Kirk comments",
      "What did Jimmy Kimmel say about Charlie Kirk before ABC pulled his show?",
      "ABC to indefinitely halt Jimmy Kimmel Live! after Charlie Kirk remarks",
      "'Jimmy Kimmel Live' pulled off air over Charlie Kirk comment",
      "What Jimmy Kimmel said about Charlie Kirk's killing - Axios",
      "ABC pulls Jimmy Kimmel after Charlie Kirk comments - Axios",
      "ABC pulls Jimmy Kimmel show off air 'indefinitely' over Charlie Kirk comments",
      "Disney’s ABC pulls Jimmy Kimmel’s show over Charlie Kirk comments",
      "Jimmy Kimmel Live! suspended indefinitely after host’s Charlie Kirk comments",
      "ABC Pulls Jimmy Kimmel ‘Indefinitely’ After Charlie Kirk Comments: Here’s What He Said",
      "ABC suspends Jimmy Kimmel's show 'indefinitely' over his Charlie Kirk comments after FCC chair's threats",
      "Jimmy Kimmel suspended indefinitely by ABC after affiliates revolt over series of Charlie Kirk comments",
      "ABC pulls Jimmy Kimmel  following government pushback over Charlie Kirk comments",
      "ABC suspends Jimmy Kimmel’s late-night show indefinitely over his remarks about Charlie Kirk’s death"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.909,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.857,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "ABC has indefinitely suspended \"Jimmy Kimmel Live\" following remarks made by the host regarding the killing of conservative activist Charlie Kirk. Jimmy Kimmel suggested that Kirk's alleged killer was aligned with Trump's MAGA movement, leading to backlash. The decision came after Nexstar, an affiliate owner, announced it would pre-empt the show indefinitely, influenced by FCC chairman Brendan Carr's warning about pulling broadcast licenses over the comments. The show will be replaced by another ABC program for the foreseeable future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Designate Antifa as \"Major Terrorist Organization\"",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 01:00:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Trump describes group as a &#039;dangerous, radical left disaster&#039; as well as a &#039;major terrorist organisation&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1XZXhqRmtraGVfVlVPVFJ1bVFmRmQwV2dCVzhhUm9Fb2ktVWJTWEFsYnMxSno2Nmpqdjc0eXhQUzBjamM1VUt3VlN6MWFXM3JGR2xJNUhRNkc5SVVUYkZ1R1lpeUxZeTRQVDNRZjdrNlk2SkpNSmc?oc=5\" target=\"_blank\">Trump says he's designating antifa as \"a major terrorist organizatio",
      "<p>It is unclear how anti-fascists, an umbrella term for far-left-leaning groups rather than a single entity, will be labeled</p><p>Donald Trump said early on Thursday that he plans to designate antifa as a “major terrorist organization”.<br /><br />\n Antifa, short for “anti-fascists”, is an umbrell",
      "The president’s announcement comes just days after he vowed to crack down on what he describes as the “radical left” after Charlie Kirk’s assassination."
    ],
    "image_url": "",
    "titles": [
      "Trump plans to designate anti-fascist Antifa movement a ‘terrorist’ group",
      "Trump says he's designating antifa as \"a major terrorist organization\" - Axios",
      "Trump says he plans to designate antifa as ‘major terrorist organization’",
      "Trump Says He Is Designating Antifa As A ‘Major Terrorist Organization’"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.86,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Trump announced plans to designate antifa, a term for far-left-leaning groups, as a \"major terrorist organization,\" describing them as a \"dangerous, radical left disaster.\" This follows his pledge to address what he calls the \"radical left\" after Charlie Kirk's assassination. The practical implications of this designation for antifa, which is not a single entity but rather an umbrella term for various groups, remain unclear.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "King Charles Hosts Trump; Challenging Talks Await with Starmer",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 21:53:29 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "And the row over free speech after Charlie Kirk’s assassination",
      "But after spending time with the King, the US president may face a tricky final day as he holds talks with Sir Keir Starmer",
      "When encountering a British royal, a bow or curtsy is okay, a hug generally is not, and “Your Majesty” or “Your Royal Highness,” is much preferred over saying “Chuck” or “Kate.”",
      "<p>Other nations including France, Australia and Canada plan to take the same step at next week’s UN summit </p><p>Keir Starmer will reportedly recognise a Palestinian state over the weekend after Donald Trump concludes his state visit to the UK.</p><p>The prime minister has previously said he plans"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8a01/live/40ea5b70-945f-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Watch: Pomp and protests on day one of Trump state visit",
      "What does Donald Trump want from his UK state visit?",
      "Donald Trump soaks up the glory of his second UK state visit",
      "What Trump needs to know about royal etiquette on his U.K. state visit",
      "Starmer to recognise Palestinian state ‘after Trump state visit’"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.789,
      "consensus": 0.928,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "King Charles hosted US President Donald Trump at Windsor Castle during Trump's first full day of his UK state visit. The visit comes amid discussions on free speech following Charlie Kirk's assassination. Trump is expected to have challenging talks with Sir Keir Starmer following his time with the King. Additionally, other nations like France, Australia, and Canada plan to recognize a Palestinian state at the upcoming UN summit, a move Starmer will reportedly also make after Trump's visit. Visitors to British royals are reminded to use formal titles and avoid physical contact beyond a bow or c",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx Overcome 17-Point Deficit to Beat Valkyries, Advance in WNBA Playoffs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 00:20:00 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The 2025 WNBA postseason is underway, with the first round continuing Thursday.",
      "Minnesota advances, while Phoenix and New York head to a decisive Game 3",
      "<p>Napheesa Collier made a go-ahead 18-footer with 1:24 left on the way to 24 points, and the top-seeded Minnesota Lynx rallied from a 17-point, third-quarter deficit to beat the Golden State Valkyries 75-74 on Wednesday night and move on in the WNBA playoffs.</p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Mercury force Game 3, Lynx rally to sweep Valkyries",
      "Where to watch WNBA playoffs: Schedule, scores, TV channel as Lynx eliminate Valkyries, Mercury stays alive",
      "Lynx rally from down 17 to complete sweep of Valkyries in WNBA playoffs"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.922,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.746,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2025 WNBA playoffs are in progress, with Minnesota Lynx advancing after a comeback victory over the Golden State Valkyries, 75-74, overcoming a 17-point deficit. Napheesa Collier led the Lynx with 24 points, including a crucial go-ahead 18-footer. Meanwhile, Phoenix and New York will proceed to a decisive Game 3 in their series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Orders Deportation of Activist to Algeria or Syria",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 04:50:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US immigration judge said prominent pro-Palestine activist withheld information on green card application.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOTHYyVlVKUG1iWTZ0N3h1NTRmZUJUSkc0cWVHOTY5allwSWl4X3Q4bDJNRXlPaFlFUHBtaTlVajF3WnBXNVE0T1owMkJjMFAxVmhoa08tWWxvUzNuVFhLcnRyeEczUFFUV1JzT2tlenBuRkFqNW5LajBFX3Q0XzNVV281MFZjME1FaUlVc1RMVQ?oc=5\" target=\"_blank\">Immigration judge says Mahmoud Kh",
      "<p>Lawyers say pro-Palestinian activist remains protected from immigration enforcement while separate federal court case proceeds</p><p>An immigration judge in the US state of Louisiana has ordered the deportation of pro-Palestinian protest leader Mahmoud Khalil to Algeria or Syria, ruling that he f"
    ],
    "image_url": "",
    "titles": [
      "US judge orders deportation of activist Mahmoud Khalil to Syria, Algeria",
      "Immigration judge says Mahmoud Khalil must be deported to Syria or Algeria - Axios",
      "US judge orders Mahmoud Khalil deported citing ‘misrepresented facts’ on green card form"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.932,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A US immigration judge in Louisiana ruled that Mahmoud Khalil, a pro-Palestine activist, should be deported to Algeria or Syria for withholding information on his green card application. However, Khalil remains protected from immigration enforcement while his separate federal court case is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three Officers Killed, Two Injured in Pennsylvania Shooting Incident",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 17 Sep 2025 17:35:32 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Authorities say the five officers were following up on an investigation that was \"domestic related.\"",
      "State authorities confirmed the shooter had been killed but offered few details of the incident in rural York County.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE9tU0RHc2QyVmYyVk85YWpXdXhrdWY2Q3pEQXNFZFVZTVc2dkliZ3dSVHV0c1hDcndQRkpwWmhOcTVOSU9KbmJPOHJhQ29LOEd6NWJ0bUhiTlFiYzZvTjUzbjM3Ul9hTTRqMi1sS3JOUXZzVjBq?oc=5\" target=\"_blank\">3 officers fatally shot, 2 critically injured in rural Pennsylvania</a>"
    ],
    "image_url": "",
    "titles": [
      "A shooting in Pennsylvania has left 3 officers dead and 2 injured",
      "Three US police officers killed, two injured, in Pennsylvania shooting",
      "3 officers fatally shot, 2 critically injured in rural Pennsylvania - Axios"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.801,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In rural York County, Pennsylvania, an incident occurred where three officers were fatally shot and two critically injured while following up on a domestic-related investigation. The shooter has been confirmed killed by state authorities, who have yet to release further details on the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ben & Jerry's Co-Founder Resigns Over Advocacy Restrictions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 17 Sep 2025 17:19:28 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "Greenfield said the Vermont ice cream maker \"has been silenced, sidelined for fear of upsetting those in power\" by Unilever, the multinational corporation that bought Ben & Jerry's in 2000.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE93TVpES1FKdDRRSGJHSjgyV3hZWFFEa1JhdjdhNWhQakRBUDVhLUdNeXBJcG9hR0dhc2EwdEFZamNXb2p3YmhuaHM0dlBfSWMtLUpkQlc3ZnQta181MmxRZFVfWFNYX2QxcmlYUFg4akRGY0owUEtnVFVMTlRsYTA?oc=5\" target=\"_blank\">Ben & Jerry's co-founder resigns, says parent company \"s",
      "Greenfield dubbed the decision \"painful\" but said that the Unilever had silenced the company's ability to speak up on global issues."
    ],
    "image_url": "",
    "titles": [
      "Ben & Jerry's co-founder Jerry Greenfield resigns over dispute with owner Unilever",
      "Ben & Jerry's co-founder resigns, says parent company \"silenced\" activism - Axios",
      "Ben & Jerry's co-founder Jerry Greenfield quits over social activism row with Unilever"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.797,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ben & Jerry's co-founder, Jerry Greenfield, resigned after 47 years, citing Unilever's restriction on the company's advocacy on global issues as the reason for his departure. Greenfield described the decision as \"painful\" but necessary due to a conflict of conscience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Messi Nears Multi-Year Contract to Stay with Inter Miami, Sources Say",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 04:16:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.aljazeera.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Argentinian superstar is reportedly close to securing a multi-year deal to remain with MLS club Inter Miami.",
      "Lionel Messi and Inter Miami are nearing a final agreement on a new multiyear contract with the deal expected to be completed soon, sources told ESPN.",
      "The World Cup winner is set to remain stateside ahead of the 2026 World Cup"
    ],
    "image_url": "",
    "titles": [
      "Lionel Messi nears contract extension with Inter Miami: Report",
      "Sources: Messi, Miami near multiyear extension",
      "Lionel Messi nearing multiyear contract extension with MLS side Inter Miami, per report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lionel Messi is reportedly close to finalizing a multi-year contract to stay with MLS club Inter Miami. Sources told ESPN that an agreement is expected soon, ensuring the World Cup winner remains in the U.S. ahead of the 2026 World Cup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Drama 'The Sea' Wins at Ophir Awards, Sparks Funding Controversy\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 01:52:56 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The Sea follows a boy from the occupied West Bank who wants to visit Tel Aviv to see the sea for the first time.",
      "<p>Miki Zohar says he will cancel funding for the Ophir awards after The Sea, about a 12-year-old Palestinian boy who is denied entry to Tel Aviv, wins best picture</p><p>Israel’s culture minister, Miki Zohar, has announced that funding for the Ophirs, the country’s national film awards, would be ca",
      "A drama about a Palestinian boy who sneaks into Israel won the top prize at Israel’s version of the Oscars. The country’s culture minister called the ceremony “shameful.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b7a6/live/727fff90-9424-11f0-97eb-335ff0a3a143.jpg",
    "titles": [
      "Israel threatens national film awards after Palestinian story wins top prize",
      "Israel’s culture minister threatens national film awards after Palestinian story takes top prize",
      "Israel Says It Will Defund Film Awards After Palestinian Win"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.858,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A drama titled \"The Sea,\" depicting a 12-year-old Palestinian boy's attempt to visit Tel Aviv to see the sea, won best picture at Israel's Ophir Awards. Following the win, Israel's Culture Minister Miki Zohar announced plans to cancel funding for the awards, labeling the ceremony \"shameful.\" The film's victory and the minister's response have sparked controversy.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Unveils $799 Ray-Ban Smart Glasses with Display at Connect 2025",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 01:02:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Mark Zuckerberg on Wednesday unveiled the $799 Meta Ray-Ban Display glasses, the company's first consumer-ready glasses with a built-in display.",
      "Mark Zuckerberg mostly uses the new Meta Ray-Ban Display glasses to send text messages. Lots of them. He has been wearing the glasses around the office, firing off WhatsApp pings to his execs throughout the day. \"I run the company through text messages,\" he tells me recently. \"Mark is our number one",
      "Meta showed off its newest AI-powered smart glasses, which have a display and are controlled by a wristband, at Meta Connect 2025."
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg unveils $799 Meta Ray-Ban Display glasses",
      "I sat down with Mark Zuckerberg to try Meta’s impressive new Ray-Ban Display glasses",
      "Meta unveils new smart glasses with a display and wristband controller"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mark Zuckerberg introduced the $799 Meta Ray-Ban Display glasses, Meta's first consumer-ready smart glasses with a built-in display, at Meta Connect 2025. Zuckerberg, who frequently uses these glasses for sending text messages, especially through WhatsApp to his executives, described managing the company predominantly via text. The glasses are part of Meta's latest AI-powered technology and are controlled using a wristband.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Van Dijk's Late Header Secures 3-2 Liverpool Win Over Atletico Madrid",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 21:17:29 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Virgil Van Dijk's header in stoppage time helps Liverpool deliver another dramatic late twist as they open their Champions League campaign with victory over Atletico Madrid at Anfield.",
      "Liverpool edge Atletico Madrid at Anfield in the UEFA Champions League with a late header from captain Virgil van Dijk.",
      "Virgil van Dijk scored a stoppage-time winner as Liverpool overcame an Atletico Madrid comeback to win 3-2 at Anfield."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6ce/live/5d94a860-940b-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Van Dijk header snatches victory for Liverpool against Atletico",
      "Liverpool beat Atletico Madrid with van Dijk injury-time winner",
      "Van Dijk heads in as Liverpool win late again against Atletico"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.78,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Virgil Van Dijk scored a decisive stoppage-time header, leading Liverpool to a 3-2 victory over Atletico Madrid in their Champions League opener at Anfield. This late win, celebrated with a roar in the 92nd minute, highlighted Liverpool's resilience and expectation for dramatic finishes this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Reserve Cuts Interest Rates to 4-4.25%, Aims to Boost Economy",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-17T18:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CNBC",
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The widely expected cut of a quarter percentage point comes amid economic pressures ranging inflation and tariffs to sluggish job growth. Two more cuts are expected before the end of the year.",
      "The U.S. labor market is producing relatively few jobs. In response, the Federal Reserve is lowering short-term interest rates to stimulate economic growth.",
      "Central bank’s first reduction in borrowing costs this year comes amid growing worries about the labour market"
    ],
    "image_url": "",
    "titles": [
      "US Federal Reserve cuts interest rate for first time in 2025",
      "As U.S. jobs disappear, the Federal Reserve returns to rate cuts",
      "Federal Reserve cuts rates by quarter point and signals more to come"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.744,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. Federal Reserve cut interest rates by 0.25%, setting them between 4 and 4.25%. This decision, the first reduction this year, responds to a cooling labor market and slow economic growth. Influenced by factors like inflation, tariffs, and sluggish job growth, the cut aims to stimulate the economy. Two more rate cuts are expected before year-end.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NCAA Ends Spring Transfer Window for College Football Players",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 00:56:36 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The NCAA voted to eliminate the spring transfer portal window but did not sign off on establishing Jan. 2-11 as the lone window for FBS and FCS players.",
      "Beginning this year, players will no longer be able to transfer during the spring."
    ],
    "image_url": "",
    "titles": [
      "NCAA removes spring transfer window for football",
      "NCAA approves single transfer portal window: How the new rule will impact college football"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The NCAA has voted to eliminate the spring transfer portal window for college football players, meaning they can no longer transfer during the spring. However, the proposal to establish a single transfer window from Jan. 2-11 for FBS and FCS players was not approved. This change is effective starting this year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fred Kerley to Compete in First Enhanced Games Amid Ban",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 07:08:57 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Olympic bronze medallist Fred Kerley becomes the first track athlete and American male to join the controversial event.",
      "<ul><li><p>World champion from 2022 is first American man to join</p></li><li><p>Kerley provisionally banned by Athletics Integrity Unit</p></li></ul><p>The Olympic 100m silver and bronze medallist Fred Kerley will compete in the inaugural Enhanced Games, the event’s organisers revealed on Wednesday"
    ],
    "image_url": "",
    "titles": [
      "US sprinter Kerley joins Enhanced Games",
      "Olympic 100m medallist Fred Kerley joins Enhanced Games weeks after ban"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Olympic medalist Fred Kerley is set to compete in the inaugural Enhanced Games, making him the first track athlete and American male to participate. Kerley, a world champion in 2022 and Olympic 100m silver and bronze medalist, has been provisionally banned by the Athletics Integrity Unit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chelsea Targets Champions League Success, Faces Setback Against Bayern",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 06:08:52 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.espn.com"
    ],
    "snippets": [
      "Cole Palmer says Chelsea do not see this season's Champions League campaign as a \"learning curve\" - because they want to be competitive in it straight away.",
      "Bayern Munich gave a lesson in the Champions League to the returning Chelsea."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d6b2/live/248f85f0-9422-11f0-8e7a-a3bd0ab049e5.jpg",
    "titles": [
      "Champions League not a learning curve for Chelsea - Palmer",
      "Chelsea are back in the Champions League, but Bayern prove too much to handle"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cole Palmer stated Chelsea aims to be competitive in the Champions League this season, not just see it as a learning curve. However, Chelsea faced a significant challenge as Bayern Munich defeated them in a recent match, showcasing the competitive level of the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cracker Barrel Shares Drop Over 9% Amid Traffic Decline Forecast",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 04:23:07 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE54RjFVeTk0ajZLOVRnMUxsTUdTc3l2bVpEaWFySnVpY05GY2RNQjZzYy1pZkxfa2h2TVhmWnJHT3lTaGw2aHY4TVotblUzbFVHLXhiU1BKbzZUbFBSdUlqdjcwYXNudGo5WU5kd2EteTFYelox?oc=5\" target=\"_blank\">Cracker Barrel sales are plunging</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">",
      "Shares of Cracker Barrel Old Country Store Inc. slid more than 9% after hours on Wednesday after the Americana-themed restaurant chain forecast falling traffic in the months ahead, in the wake of a logo change and remodeling plans that turned off consumers."
    ],
    "image_url": "",
    "titles": [
      "Cracker Barrel sales are plunging - Axios",
      "Cracker Barrel now expects fewer diners in the months ahead, and the stock is plunging"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cracker Barrel Old Country Store Inc. saw a more than 9% drop in shares due to a forecast of declining traffic. The Americana-themed restaurant chain's logo change and remodeling plans have deterred consumers.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 Fantasy Football: Start/Sit Advice, Including Jared Goff Highlight",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 02:52:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Dig into the players who might be tough start/sit calls in your lineup based on game film notes, stats, more",
      "Goff is set to bounce right back in week 3",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOSjdNTEQ1WFY1bnA0eTRoWjNhb0c4WDEwbmV6WU10S3l5SlR4RUZCdVdUdktnNWdFanIzMEpsU3B4aTZBZ0dEVWdCbVo5emJ6c1pMMnRWWUFqMncwWGJFelFMNmlXUHBrZ1BocENuaHhhbE5aVUpoU0ZKeHdaaEpOVXpBX0JoeFY3VXlYckMwaXNIQ096ekRSLW10UzU?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQcVlrbkt4MDFmcXhGSGZYeGZXbm5BQzBnLWNBQk1pM29aakluSHFDa3dwbG1xcmE3NW50RVcwSTV1Mmwxei03dkVNM3JuNEZPRnI1ekcwUjZwZUhGb2hWUWFvZm1kSDUzOGQ3bGp5QXZuMG5TV3Jkekc0dVNzTlJSOHg3OVZwb1ktbmhXYXRMTHpBOS1tazRfNg?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/17/edc96354-a16d-4293-a93d-f624fe1d86ee/james-cook-buffalo-bills-imagn-images.jpg",
    "titles": [
      "Fantasy Football Week 3 lineup decisions: Who to start, who to sit, must-start plays, flex plays and more",
      "Fantasy Football Week 3 Start 'Em & Sit 'Em: Jordan Mason in a dream spot, plus sleepers at every position",
      "Running Back Start ‘Em, Sit ‘Em For Fantasy Football Week 3 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 3 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This week's fantasy football advice focuses on players with challenging start/sit decisions based on game film, stats, and more. Specifically, it's suggested that quarterback Jared Goff is expected to perform well in week 3. For more detailed insights, links to articles on running backs and tight ends to start or sit are provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eubank Jr. Faces Legal Threat from Hearn, Names New Trainer for Benn Rematch",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 01:55:08 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Eubank Jr makes allegations against Matchroom at press conference</p></li><li><p>Hearn rejects claims and threatens legal action unless boxer apologises</p></li></ul><p>Eddie Hearn has threatened to sue Chris Eubank Jr, after the boxer fired the first shots during a press conference ahead",
      "Chris Eubank Jr revealed he will have a new coach for his rematch with Conor Benn, bringing Terence Crawford&#8217;s trainer Brian McIntyre back into his corner for the November 15 fight."
    ],
    "image_url": "https://i.guim.co.uk/img/media/946078368e147bf71f0bf3623b8651402547e28c/179_0_4427_3541/master/4427.jpg?width=140&quality=85&auto=format&fit=max&s=1cacb21806fb7f33890552b5922cb4c1",
    "titles": [
      "Eddie Hearn threatens to sue Chris Eubank Jr over ‘sabotage’ claim before Conor Benn rematch",
      "Eubank Jr brings in Crawford's trainer for Benn rematch"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.858,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chris Eubank Jr accused Matchroom at a press conference, which led Eddie Hearn to threaten legal action unless Eubank Jr apologizes. Amidst this controversy, Eubank Jr announced he will have Brian McIntyre, Terence Crawford’s trainer, in his corner for his rematch with Conor Benn on November 15.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ABC Suspends Jimmy Kimmel Indefinitely After FCC Criticism",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-18T02:37:16Z",
    "source": "Business Insider",
    "sources": [
      "The Verge",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.theverge.com"
    ],
    "snippets": [
      "ABC said it pulled Jimmy Kimmel off the air \"indefinitely\" over his comments about Charlie Kirk's killing.",
      "Disney gave in to threats from FCC chairman and occasional speech regulator Brendan Carr this evening, announcing that Jimmy Kimmel Live! would be pulled off the air “indefinitely.” Carr was unhappy that Kimmel characterized the alleged shooter of Charlie Kirk as “anything other than” a member of th"
    ],
    "image_url": "https://i.insider.com/68cb5fe657d362d375e86190?format=jpeg",
    "titles": [
      "Here's what Jimmy Kimmel said on his late-night show that got him pulled off the air",
      "Here&#8217;s the Jimmy Kimmel clip that got him pulled off the air"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC has indefinitely suspended Jimmy Kimmel from his show following his comments about Charlie Kirk's alleged shooter, in response to pressure from FCC chairman Brendan Carr. Carr criticized Kimmel's characterization of the shooter, leading to Disney's decision to pull the show off the air.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches $799 Ray-Ban Smart Glasses for Athletes",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-17T21:00:11-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "At its Connect keynote on Wednesday, Meta officially introduced the $799.99 Meta Ray-Ban Display, also known as Hypernova. The brand's new, high-end smart glasses feature an in-lens display you can control with wrist-based gestures via the new Meta Neural Band that's included. The display pairs with",
      "The new smart glasses are geared toward runners, cyclists, and other athletes."
    ],
    "image_url": "",
    "titles": [
      "Meta&#8217;s Ray-Ban Gen 2 and Oakley Vanguard glasses are available to preorder",
      "Meta unveils its new Oakley Meta Vanguard smart glasses for athletes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At its Connect keynote, Meta unveiled the Meta Ray-Ban Display, also known as Hypernova, priced at $799.99. These high-end smart glasses come with an in-lens display controlled by wrist-based gestures through the included Meta Neural Band. Designed for runners, cyclists, and athletes, the glasses aim to enhance the sporting experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Hyperscape for Real-World VR Replicas",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-17T20:38:36-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Meta is rolling out tech that lets you capture a real-world space with a Quest VR headset so you can create a digital, photorealistic VR replica. The company calls the tech “Hyperscape,” and as part of a gradual rollout beginning today, users will be able to use the beta Hyperscape Capture app with ",
      "Meta launches Hyperscape into beta, allowing users to turn real world spaces into digital spaces for VR."
    ],
    "image_url": "",
    "titles": [
      "Meta will let you use a Quest VR headset to turn your real-world space into a virtual world",
      "Meta launches Hyperscape, technology to turn real-world spaces into VR"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta introduced Hyperscape, a new technology enabling users to convert real-world spaces into digital, photorealistic VR replicas using a Quest VR headset. The beta version of the Hyperscape Capture app is rolling out, marking the beginning of its availability to users.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company to Add Manual Door Releases After Trapping Incidents",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 20:23:42 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Chief designer Franz von Holzhausen said Wednesday that the company is \"working on\" combining the electronic and manual door releases after owners have reported getting trapped.",
      "Cars have lost 12 V power, trapping children and dogs in hot cars."
    ],
    "image_url": "",
    "titles": [
      "Tesla is redesigning its door handles following safety probe, Bloomberg investigation",
      "Tesla Model Y door handles now under federal safety scrutiny"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.781,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Chief designer Franz von Holzhausen announced that the company plans to integrate electronic and manual door releases in response to reports of owners, including children and dogs, being trapped inside cars due to loss of 12 V power.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prime Video Announces Film to Conclude \"The Summer I Turned Pretty\" Series",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 23:59:22 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The hit young-adult series will conclude with what author and showrunner Han says is \"another big milestone\" in Belly's journey.",
      "“The Summer I Turned Pretty” isn't over yet! Prime Video just greenlit a feature film that will follow the next \"milestone\" in Belly's life. Here’s everything we know so far."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/29af/live/ceeb28a0-9414-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "The Summer I Turned Pretty to conclude with feature film",
      "‘The Summer I Turned Pretty’ Movie Announced After Season 3 Finale—Here’s What To Know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.825,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Video has greenlit a feature film to conclude the \"The Summer I Turned Pretty\" series, focusing on a significant milestone in the protagonist Belly's journey, as announced by the author and showrunner Han.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Seek Trade for Formenton, Won't Return After Acquittal",
    "domain": "sports",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Wed, 17 Sep 2025 20:18:13 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Alex Formenton&#8217;s days with the Ottawa Senators are over. Steve Staios, the club&#8217;s president of hockey operations and general manager, confirmed on the first day of training camp at the Canadian Tire Centre that the Senators are trying to trade the rights of the restricted free agent forw",
      "Ottawa&#160;Senators general manager Steve Staios says Alex Formenton won&#8217;t return to the team when the winger becomes eligible to return to the NHL. Formenton was one of five players acquitted in July of sexual assault charges stemming from an incident in London, Ont., in 2018 when they were "
    ],
    "image_url": "",
    "titles": [
      "Steve Staios confirms Alex Formenton won’t return as Senators explore trade options",
      "Ottawa GM Staios says Formenton won’t return to Senators after acquittal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.78,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alex Formenton will not be returning to the Ottawa Senators, as confirmed by the team's general manager, Steve Staios. The Senators are seeking to trade the rights of Formenton, a restricted free agent forward. This decision comes after Formenton was acquitted of sexual assault charges from an incident in 2018.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lithuania Uncovers Network Planning Arson Attacks in Europe Linked to Russia",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-17T17:53:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Post",
      "Deutsche Welle"
    ],
    "domains": [
      "financialpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "A Lithuanian investigation has determined Russia-linked suspects packed explosive devices in packages shipped by land and air to the UK, Poland and Germany. Authorities say more attacks were in the works.",
      "VILNIUS, Lithuania (AP) &#8212; Lithuanian prosecutors said they uncovered a Russia-linked network of suspects who are alleged to have planned and organized arson attacks in various European countries. The prosecutor general&#8217;s office in Vilnius said in a statement Wednesday, the suspects are s"
    ],
    "image_url": "",
    "titles": [
      "Russia-linked group planned parcel bomb attacks in Europe",
      "Lithuanian prosecutors allege Russia-linked network planned arson attacks in Europe"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.741,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lithuanian authorities have discovered a network with links to Russia, accused of planning and executing arson attacks across Europe, including packing explosive devices in shipments to the UK, Poland, and Germany. The investigation revealed ongoing plans for further attacks.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Confirms Discovery of 6,000th Exoplanet",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 17 Sep 2025 16:57:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "The official number of exoplanets—planets outside our solar system—tracked by NASA has reached 6,000. Confirmed planets are added to the count on a rolling basis by scientists from around the world, so no single planet is considered the 6,000th entry. The number is monitored by NASA's Exoplanet Scie",
      "The milestone highlights the accelerating rate of discoveries, just over three decades since the first exoplanets were found. The official number of exoplanets — planets outside our solar system — tracked by NASA has reached 6,000. Confirmed planets are added to the count on a rolling basis by scien"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-tally-of-planets.jpg",
    "titles": [
      "NASA's tally of planets outside our solar system reaches 6,000",
      "NASA’s Tally of Planets Outside Our Solar System Reaches 6,000"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.79,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA's Exoplanet Science Institute has confirmed that the number of exoplanets—planets outside our solar system—has reached 6,000. This milestone, achieved over three decades since the first discoveries, underscores the accelerating pace of exoplanet identification. Scientists worldwide contribute to this rolling count, with no single planet designated as the 6,000th.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Susan Monarez Testifies RFK Jr. Pressured Her on Vaccine Stance, Staff Firings",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 18:15:23 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Wired"
    ],
    "domains": [
      "news.google.com",
      "www.wired.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE80VTBScC0yZ3ZrVkcwU3l2QWI2LVdiaWgwaW8tYW1xTGhQU09TVGFhU2tqSWd3Vk1vMFNtRUpFbEp0Y2xuSlFNS001c1JGTW5yMDZGRWZJa25IdlM2TFAxYnF4NzVoQ0tCUkJ0Q0QwcExtZw?oc=5\" target=\"_blank\">Ex-CDC official says RFK Jr. pressured her to stay silent</a>&nbsp;&nbsp;",
      "Susan Monarez told a Senate committee that Robert F. Kennedy Jr. demanded she dismiss career officials without cause—and accept vaccine recommendations regardless of whether science backed them up."
    ],
    "image_url": "",
    "titles": [
      "Ex-CDC official says RFK Jr. pressured her to stay silent - Axios",
      "Fired CDC Director Says RFK Jr. Pressured Her to Blindly Approve Vaccine Changes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.732,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susan Monarez testified before a Senate committee that Robert F. Kennedy Jr. pressured her to fire career officials without cause and to accept vaccine recommendations without scientific support.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chimpanzees Consume Alcohol Naturally Through Ripe Fruit, Study Finds",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 20:00:18 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "www.newscientist.com",
      "phys.org"
    ],
    "snippets": [
      "Chimpanzees are consuming significant levels of alcohol from their diet of ripe fruit and the finding may help explain the origins of humans’ taste for alcohol",
      "The first-ever measurements of the ethanol content of fruits available to chimpanzees in their native African habitat show that the animals could easily consume the equivalent of more than two standard alcoholic drinks each day, according to researchers at the University of California, Berkeley."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/09/17120504/SEI_266487197.jpg",
    "titles": [
      "Wild chimpanzees may get mildly intoxicated from alcoholic fruit",
      "In the wild, chimpanzees likely ingest the equivalent of several alcoholic drinks every day"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.759,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers at the University of California, Berkeley, have discovered that chimpanzees in Africa consume significant amounts of alcohol by eating ripe fruit. Their study, the first to measure the ethanol content in fruits eaten by chimpanzees, suggests these animals can ingest the equivalent of over two standard alcoholic drinks daily. This finding might help explain the origins of the human preference for alcohol.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Beijing Seeks Chip Independence, Bans Nvidia AI Chips Amid US Tech Rivalry",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 15:38:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Nvidia CEO Jensen Huang commented after a report that China has banned the use of the company's AI chips.",
      "China steps up efforts to boost semiconductor independence, compete with US."
    ],
    "image_url": "",
    "titles": [
      "Nvidia CEO says he's 'disappointed' after report China has banned its AI chips",
      "China blocks sale of Nvidia AI chips"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.693,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Beijing is intensifying its push for semiconductor independence to compete with the US, following a ban by the Cyberspace Administration of China on Alibaba, ByteDance, and other tech companies from purchasing or testing Nvidia's RTX Pro 6000D AI chips, specifically designed for the Chinese market. This move underscores the escalating tech rivalry between China and the US.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Ray-Ban Gen 2 Smart Glasses with 3K Video Recording",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-17T20:20:38-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "I want to preface this hands-on by saying that I've been a smart glasses skeptic for many years. In 2019, I even made a two-part mini documentary with a thesis that consumer smart glasses couldn't happen without massive societal and technological shifts. Well, color me pink and let me find a shoe to",
      "Meta has announced a new generation of its Ray-Ban smart glasses, featuring significantly improved battery life and the ability to record 3K video, which brings them up to par with the Oakley HSTN smart glasses. The new glasses, technically called the Ray-Ban Meta Gen 2, are available to order today"
    ],
    "image_url": "",
    "titles": [
      "I regret to inform you Meta’s new smart glasses are the best I’ve ever tried",
      "Meta’s new Ray-Ban smart glasses have twice the battery life"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.848,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta has launched the Ray-Ban Meta Gen 2 smart glasses, offering enhanced battery life and 3K video recording capabilities, matching the Oakley HSTN smart glasses' standards. These upgraded smart glasses are now available for order, marking a significant advancement in the smart glasses market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]