[
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, which runs until March 31, 2025. The sale offers discounts on gardening supplies, bedding, and other items to celebrate the start of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8401812064930556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4200453016232639,
    "summary": "Amazon has initiated its Big Spring Sale, lasting until March 31, 2025. The event features discounts on various products including gardening supplies and bedding, in celebration of the onset of spring."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, offering a rewarding experience for players who master its precise demands. This installment is highlighted for enhancing the franchise's core gameplay elements."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7889659283796296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4072414820949074,
    "summary": "Assassin's Creed Shadows enhances the series by introducing advanced stealth and assassination mechanics, focusing on rewarding players who master its precise gameplay. This installment is noted for improving the franchise's fundamental elements."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 has been designed as a gaming-focused alternative to the MacBook Pro, emphasizing a return to a thinner and lighter chassis compared to its previous generation. This design aims to offer the performance desired by gamers while maintaining the appearance of a more traditional laptop."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7472992614814815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3968248153703704,
    "summary": "The Razer Blade 16 is a new gaming laptop that offers a slimmer and lighter design compared to its predecessors, targeting gamers who prefer a device that combines high performance with the look of a traditional laptop, positioning it as an alternative to the MacBook Pro."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, serves as a versatile, multifunctional work lamp with three adjustable LED panels directing 3000 lumens. It's rechargeable, compact, and can illuminate various spaces including campsites, workspaces, and engine blocks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4633640760648149,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32584101901620377,
    "summary": "BougeRV has released an LED lantern designed for outdoor camping, featuring three adjustable panels that emit a total of 3000 lumens. This versatile, multifunctional work lamp is rechargeable and compact, making it suitable for lighting up campsites, workspaces, and engine blocks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction to prevent the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of an ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.12960250177083343,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24240062544270835,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction to halt the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while a court case on the matter is ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has updated its Windows 11 Insider Preview, removing a bypass script that previously allowed users to set up the operating system without an internet connection and logging in. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged into an account during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.1256094459837963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24140236149594907,
    "summary": "Microsoft has updated its Windows 11 Insider Preview, now requiring all devices to be connected to the internet and logged into an account during setup. This update removes a bypass script that allowed users to install the operating system without an internet connection."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway, ending on Monday, March 31st. The sale features numerous deals on a variety of products, and these discounts are available to all customers, not just Amazon Prime members. The main roundup includes over 100 deals on popular gear, and there's also a focus on offering low-cost alternatives for shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.11733398280092588,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.23933349570023146,
    "summary": "Amazon's Big Spring Sale, open to all customers, is happening now and concludes on March 31st. The sale offers over 100 deals on a wide range of products, including popular gear and budget-friendly options."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, acquired the social media platform X (previously Twitter) in an all-stock deal. Musk bought Twitter for $44 billion a few years ago. The acquisition values xAI at $80 billion and X at $33 billion, which includes $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.11137333444444453,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.23784333361111112,
    "summary": "Elon Musk's AI firm, xAI, has acquired the social media platform X (formerly Twitter) in an all-stock transaction. The deal values xAI at $80 billion and X at $33 billion, incorporating $12 billion of debt. This follows Musk's purchase of Twitter for $44 billion a few years prior."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature, announced last year, enables IT professionals to remotely recover devices that won't boot, aiming to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.10398907496527787,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.23599726874131946,
    "summary": "Microsoft has introduced Quick Machine Recovery in its newest Windows Insider Preview build (6120.3653) for Windows 11, designed to let IT professionals remotely fix devices that fail to boot. This development, first announced last year, aims to mitigate issues like those seen in the Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, following the completion of its acquisition of Fitbit in early 2021. Initially, users were required to make the switch by 2025, but a recent email to Fitbit users announced the extension."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.08787796363425915,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.23196949090856478,
    "summary": "Google has postponed the deadline for Fitbit users to transition their accounts to Google accounts until next year, after acquiring Fitbit in 2021. Originally set for 2025, the new deadline was communicated to users via email."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with the BBC, describing it as \"incredible\" that bombs were being dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur criticized the military in a BBC interview for dropping bombs during rescue operations, describing the actions as \"incredible.\""
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, prompting rescue operations to save individuals trapped in the debris. Rescuers are actively working to retrieve people from the ruins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to ongoing rescue operations aimed at saving those trapped under the debris. Rescuers are currently focused on retrieving individuals from the rubble."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of individuals who have disappeared in Antigua have expressed their distress in interviews with the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have conveyed their distress over their loved ones' disappearances in interviews with the BBC."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire has broken out in a city, injuring 21 people and causing a restaurant and several other buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city resulted in 21 people being injured and led to a restaurant along with multiple buildings catching fire, local officials reported."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Andrew Harding reports from Nuuk, indicating that numerous individuals in the Danish territory feel pressured or bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Andrew Harding reports from Nuuk, revealing that many people in the Danish territory feel pressured or bullied by the United States."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase are not under Somalia's jurisdiction to be offered to any other party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that Somalia does not have the authority to offer the Berbera port and airbase to any other entity, as these facilities are not under Somalia's jurisdiction."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence at the time of the pardon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year sentence, has been pardoned for health reasons."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, faced criticism for wearing a disguise to promote his own book on television."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced backlash for disguising himself to promote his book on a TV show."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The investigation is part of a broader effort by the Trump administration to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration is conducting an investigation into diversity and inclusion programs as part of a wider evaluation of such initiatives."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed alleging that a controversial influencer assaulted and threatened an individual in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a controversial influencer of assault and making threats against someone in Beverly Hills. The influencer has denied the allegations."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is actively working to improve a website known for hosting poor-quality photos of celebrities. The initiative aims to replace or enhance these images to improve the site's overall content quality."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer project is focused on enhancing a website notorious for low-quality celebrity photos by upgrading or replacing these images to boost the site's content quality."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's significant impact was due to its magnitude and the extensive length of the fault line where it occurred."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake caused major damage due to its high magnitude and the long fault line where it took place."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in widespread destruction across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing extensive damage throughout the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further rises, according to a car seller interviewed by the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, with further increases expected, reports the BBC based on an interview with a car seller."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York last week, marking an unprecedented sale price for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York, setting a new record for the sale price of the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their conduct while carrying out an evacuation mission at a military base in South Sudan, where they were subjected to gunfire."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any location worldwide. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere in the world. Some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers in Myanmar received applause for successfully carrying 30-year-old Phyu Lay Khaing to safety on a stretcher."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, rescuers successfully brought 30-year-old Phyu Lay Khaing to safety on a stretcher, an action that was met with applause."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed following a powerful earthquake in Myanmar. Dozens of people are reported missing in the aftermath of the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction in Myanmar collapsed due to a powerful earthquake, resulting in dozens of people reported missing."
  },
  {
    "title": "Huge Istanbul protests over Imamoglu’s arrest and imprisonment in Turkiye",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 18:26:33 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leader of the CHP has demanded the release of a former mayor and criticized the detention of protesters amid escalating tensions regarding Turkish democracy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The leader of the CHP has called for the release of a former mayor and criticized the detention of protesters, highlighting concerns over Turkish democracy and escalating tensions."
  },
  {
    "title": "How stable is Lebanon’s peace – after Israel attack on Beirut?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:39:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tensions rise in Israel as Prime Minister Benjamin Netanyahu alerts the nation to the potential for further attacks, putting the country on high alert."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Tensions in Israel escalate as Prime Minister Benjamin Netanyahu warns of possible future attacks, placing the country on high alert."
  },
  {
    "title": "Tufts University student can’t be deported  to Turkiye without court order",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:27:04 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rumeysa Ozturk, a student advocating for Palestine, was arrested by US immigration officials in Massachusetts on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rumeysa Ozturk, a student and advocate for Palestine, was arrested by US immigration officials in Massachusetts on Tuesday."
  },
  {
    "title": "Skygazers marvel at Saturday’s partial solar eclipse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:38:56 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A partial eclipse was visible across Europe, Africa, and Newfoundland, showcasing a celestial event where the moon partially covered the sun."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A partial solar eclipse was observed in Europe, Africa, and Newfoundland, with the moon partially obscuring the sun during the event."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators have discovered that mutations in VPS35, a crucial component in the pathway using reactive oxygen species (ROS) to kill cancer cells, can lead to resistance against chemotherapies. This finding may aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that mutations in VPS35, a key part of the process that uses reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy treatments. This discovery could help in identifying tumors that will not respond to current therapies."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study revealed that over 50% of US adults have faced discrimination, with those highly exposed being over five times more likely to show signs of depression and anxiety. Compared to those not experiencing discrimination, affected individuals have almost nine times higher odds of screening positive for both mental health conditions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that over half of US adults have experienced discrimination, leading to a significantly higher risk of depression and anxiety. Those highly exposed to discrimination are over five times more likely to exhibit symptoms of these mental health conditions, and nearly nine times more likely to test positive for both compared to individuals who have not faced discrimination."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new customizable 3D printed hydrogel has shown promising results in preclinical trials for treating various types of meniscal tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new 3D printed hydrogel that can be customized to treat different types of meniscal tears. This innovation has shown promising outcomes in preclinical trials, indicating potential for future medical applications in treating knee injuries."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A seven-day cold water immersion study shows it can significantly boost cellular resilience and autophagy, aiding in stress management at a cellular level. This adaptation may improve health, potentially prevent diseases, and slow aging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that immersing in cold water for seven days can enhance cellular resilience and autophagy, which helps cells manage stress better. This adaptation could lead to improved health, disease prevention, and slower aging."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Approximately one-third of women aged 14-49 in the U.S. experience bacterial vaginosis (BV), marked by discomfort and possible health risks. Over half of those treated with the first-line antibiotic, metronidazole, face recurrence. Researchers have now introduced a DNA PCR-based lab test aimed at improving treatment by analyzing the bacteria causing BV, enabling personalized medication prescriptions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Around one-third of U.S. women aged 14-49 suffer from bacterial vaginosis (BV), with over half experiencing recurrence after initial treatment with metronidazole. Researchers have developed a DNA PCR-based lab test to identify the specific bacteria causing BV, allowing for personalized treatment plans."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that red meat, enhanced with scent oils, is the most effective bait for camera traps in studying weasels. This finding is significant for conservationists who face challenges in monitoring weasel populations due to their elusive nature."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that red meat infused with scent oils is the best bait for camera traps aimed at studying elusive weasel populations. This discovery offers conservationists a new method for effectively monitoring these animals."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that mimic biological ones more closely, capable of independent learning. These neurons form artificial neural networks that self-organize and extract information from their surroundings, enhancing their learning process."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created advanced artificial neurons that closely resemble their biological counterparts, with the ability to learn independently. These neurons can form networks that self-organize and improve their learning by extracting information from their environment."
  },
  {
    "title": "Yankees slug 7 HRs, 4 in 1st inning off Cortes",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Saturday's game, the Yankees hit a total of seven home runs against the Brewers, with four of those homers being hit off pitcher Nestor Cortes in the first inning."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In Saturday's baseball game, the Yankees scored seven home runs against the Brewers, four of which were hit in the first inning off pitcher Nestor Cortes."
  },
  {
    "title": "Grizz GM: No player input on call to fire Jenkins",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Zach Kleiman, the general manager of the Grizzlies, confirmed that he did not consult any players on the team prior to dismissing Taylor Jenkins from his position as coach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Zach Kleiman, the general manager of the Memphis Grizzlies, confirmed that he made the decision to dismiss Taylor Jenkins as the team's coach without consulting any of the players."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is entering the NBA draft and the transfer portal, according to his agent's statement to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, has decided to enter the NBA draft and the transfer portal, as confirmed by his agent to ESPN."
  },
  {
    "title": "Paopao: South Carolina should be 'punching first'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "South Carolina guard Te-Hina Paopao emphasized the importance of her team avoiding slow starts and taking a more proactive approach in their Elite Eight game against Duke, advocating for \"punching first\" to gain an early advantage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "South Carolina guard Te-Hina Paopao stressed the need for her team to avoid slow starts and take the initiative early in their Elite Eight game against Duke, advocating for a strategy of \"punching first\" to secure an early lead."
  },
  {
    "title": "Kim wins halfpipe gold at snowboard worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "American snowboarder Chloe Kim and Australian Scotty James won gold medals in the halfpipe event at the world championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "American snowboarder Chloe Kim and Australian Scotty James secured gold medals in the halfpipe event at the world championships on Saturday."
  },
  {
    "title": "Bills, CB Benford agree to 4-year, $76M extension",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Buffalo Bills have finalized a four-year contract extension with cornerback Christian Benford, valued at $76 million, as confirmed by his agents to ESPN's Adam Schefter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Buffalo Bills have secured a four-year contract extension with cornerback Christian Benford, worth $76 million, according to his agents via ESPN's Adam Schefter."
  },
  {
    "title": "2-time WNBA MVP Stewart re-signs with Liberty",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Breanna Stewart has re-signed with the New York Liberty, following a season where she played a pivotal role in securing the team's first ever WNBA championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Breanna Stewart has re-signed with the New York Liberty after playing a key role in winning the team's first WNBA championship last season."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A well-executed inbounds play led No. 1 Houston to secure a 62-60 victory against Purdue, advancing them to the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston defeated Purdue 62-60, advancing to the Elite Eight after a successful inbounds play."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:17:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston secured victories in their respective games. The event featured detailed analysis of both teams' performances, highlighting key moments and strategies that led to their wins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday, Auburn and Houston both won their games. The coverage included in-depth analysis of their performances, focusing on critical plays and strategies contributing to their victories."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:27:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament's Sweet 16 commenced with its first four games, marking a significant phase in the competition. This stage showcases the advancing teams as they compete for a spot in the Elite Eight, moving closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament progressed to the Sweet 16 stage, featuring the first four games. This phase highlights teams competing to advance to the Elite Eight, edging closer to the championship."
  },
  {
    "title": "Follow live: Yankees having home run party",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:39:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm ready to help you summarize news content. Please provide the details of the news you'd like summarized."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Please provide the details of the news content you would like summarized."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an overview of what is on the line in upcoming sports matchups, including predictions for playoff outcomes, positions in the draft lottery, and additional relevant information."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article discusses the implications of upcoming sports matchups, focusing on playoff predictions, draft lottery positions, and other important details related to the outcomes of these games."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The panel has cast their votes on the playoff field, providing a detailed account of each team's performance and schedule up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The panel has completed its evaluation of the playoff field, delivering a comprehensive review of each team's performance and schedule through April 17."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:39:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State has been eliminated from their current competition. Looking ahead to next season, the focus shifts to addressing portal priorities and integrating incoming recruits into the Wolfpack team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State has been knocked out of their current competition. The team is now turning its attention to next season, with plans to focus on portal priorities and the integration of new recruits into the Wolfpack lineup."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark within a span of four days. This rapid conversion involved extensive logistical and operational efforts to accommodate a Major League Baseball game, highlighting the flexibility and adaptability of the facility."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly turned into the Tampa Bay Rays' Opening Day ballpark in just four days, showcasing significant logistical and operational efforts to host a Major League Baseball game. This demonstrates the facility's adaptability and flexibility."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Women's tournament features detailed betting information, including lines, spreads, totals, and Basketball Power Index (BPI) ratings for every game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Women's tournament now includes comprehensive betting details for each game, covering lines, spreads, totals, and Basketball Power Index (BPI) ratings, providing fans and bettors with in-depth information to guide their decisions."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL are aiming to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are competing to surpass Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze led Crystal Palace to a 3-0 victory over Fulham on Saturday, scoring a goal and providing an assist, securing their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze played a pivotal role in Crystal Palace's 3-0 win against Fulham on Saturday, contributing with a goal and an assist. This victory ensured Crystal Palace's advancement to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving over $20 million from a jury verdict."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, following a jury verdict."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, Bayern Munich, the Bundesliga leaders, secured the win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to lead Bayern Munich to a 3-2 win over St Pauli on Saturday. The victory solidified Bayern Munich's position as the Bundesliga leaders."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In a LaLiga match on Saturday, Espanyol, facing relegation, secured a 1-1 draw against third-placed Atletico Madrid. Cesar Azpilicueta scored for Atletico Madrid in the first half, but Espanyol's captain, Javi Puado, equalized with a penalty."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol, threatened with relegation, drew 1-1 against Atletico Madrid in a LaLiga match on Saturday. Cesar Azpilicueta scored for Atletico in the first half, with Espanyol's captain, Javi Puado, equalizing through a penalty."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle celebrated their first major domestic trophy in 70 years with an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle marked their first significant domestic trophy win in 70 years with a celebratory open-top bus parade throughout the city."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat by Argentina on Tuesday, as announced on Friday."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 14:10:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to play for Crystal Palace in their Saturday game, marking his first appearance since his ear was severely injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played for Crystal Palace on Saturday, making his first game appearance since he suffered a serious ear injury."
  }
]