[
  {
    "title": "Trump heads to Saudi Arabia eyeing more investment in US",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:44:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d0c6/live/34153be0-2c09-11f0-8da1-ad2bbee6cda5.jpg",
    "titles": [
      "Trump heads to Saudi Arabia eyeing more investment in US"
    ],
    "summary": "The President is visiting Saudi Arabia, Qatar, and the UAE with the objective of encouraging these nations to increase their purchases of goods and services from the United States.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the President's intentions and the potential economic implications of his visit to these countries. However, it lacks depth and does not provide any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.884,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.529,
    "normalized_score": 6.74
  },
  {
    "title": "The rare disease in a remote town where 'almost everyone is a cousin'",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:05:45 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Many children in a Brazil town lost the ability to walk, so one scientist set about discovering why."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fac6/live/0a621d00-f45e-11ef-896e-d7e7fb1719a4.png",
    "titles": [
      "The rare disease in a remote town where 'almost everyone is a cousin'"
    ],
    "summary": "In a town in Brazil, numerous children suddenly lost their ability to walk, prompting a scientist to investigate the cause. The investigation aimed to understand the sudden onset of this condition and provide insights into potential treatments or preventive measures to assist the affected children in regaining mobility.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it increases awareness about a rare disease, provides insights into the investigation process, and mentions potential treatments or preventive measures. It contributes to the reader's understanding and could potentially influence decision-making related to health issues.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.875,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.548,
    "normalized_score": 8.88
  },
  {
    "title": "Why Burkina Faso's junta leader has captured hearts and minds around the world",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:05:24 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Capt Ibrahim Traoré, 37, is portraying himself as a champion of pan-Africanism."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/616c/live/ccdf1ec0-2c47-11f0-8ff1-59f5dcf8e9f5.jpg",
    "titles": [
      "Why Burkina Faso's junta leader has captured hearts and minds around the world"
    ],
    "summary": "Capt. Ibrahim Traoré, 37, is actively positioning himself as a proponent of pan-Africanism, advocating for unity and solidarity among African nations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about the junta leader's views and his advocacy for unity among African nations. It provides useful context about the political landscape in Burkina Faso, but does not report on concrete solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.875,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.538,
    "normalized_score": 7.75
  },
  {
    "title": "Less than 1% of UK biosecurity budget goes on tackling invasive species, figures show",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:01:36 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Conservationists call for more funding and warn of danger to ‘cherished’ native species, from water voles to ladybirds</p><p>Less than 1% of the government’s biosecurity budget goes on tackling invasive species, despite the danger they pose to British wildlife, figures suggest.</p><p>Conservationists warned the funding to address non-native plants and animals was failing to match the risk they posed to “cherished” native species, from water voles to ladybirds, as well as to waterways, homes, businesses and local green spaces.</p> <a href=\"https://www.theguardian.com/environment/2025/may/12/less-than-1-of-uk-biosecurity-budget-goes-on-tackling-invasive-species-figures-show\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f8329a8ab8d560bb76384aee03f3b80316a1325c/267_221_1433_1146/master/1433.jpg?width=140&quality=85&auto=format&fit=max&s=440f785bf36dc4f62d0c6b85260afafb",
    "titles": [
      "Less than 1% of UK biosecurity budget goes on tackling invasive species, figures show"
    ],
    "summary": "Conservationists have raised concerns that less than 1% of the UK's biosecurity budget is allocated to combat invasive species, posing significant risks to native wildlife such as water voles and ladybirds, and to the environment including waterways and green spaces. They argue that the current funding is insufficient to address the threats these non-native plants and animals present to biodiversity, homes, and businesses.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the allocation of the UK's biosecurity budget and its potential impacts on native wildlife and the environment. However, it does not offer any solutions or discuss any efforts to address the issue, and thus does not score higher.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.874,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.518,
    "normalized_score": 5.51
  },
  {
    "title": "Eighty percent of England’s peatlands are dry and degraded, mapping shows",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:01:35 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Healthy peatlands can help tackle the climate crisis but degraded peat emits carbon and contributes to global heating</p><p>New mapping of England’s peatlands has revealed that 80% of the habitats are dry and degraded.</p><p>Scientists mapped England’s peatlands and peaty soils for the first time using satellite imagery, artificial intelligence and in-depth data analysis to create the most complete map to date, the Department for Environment, Food and Rural Affairs (Defra) said.</p> <a href=\"https://www.theguardian.com/environment/2025/may/12/eighty-percent-of-englands-peatlands-are-dry-and-degraded-mapping-shows\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7032c8f102ad47c628e15e3cd6b61d5fe5e1077a/473_120_3028_2423/master/3028.jpg?width=140&quality=85&auto=format&fit=max&s=9825bbd15a1318acd37a3b3477e4691b",
    "titles": [
      "Eighty percent of England’s peatlands are dry and degraded, mapping shows"
    ],
    "summary": "A new comprehensive mapping of England's peatlands, utilizing satellite imagery, artificial intelligence, and detailed data analysis, has revealed that 80% of these habitats are in a dry and degraded state, according to the Department for Environment, Food and Rural Affairs (Defra). This first-time mapping effort highlights the condition of England's peatlands, which, when healthy, can significantly contribute to tackling the climate crisis but when degraded, emit carbon and exacerbate global heating.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides a deeper understanding of the state of England's peatlands and their role in the climate crisis. It increases awareness about the condition of these habitats and their impact on global heating. However, it does not highlight any specific solutions or progress in addressing the issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.874,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.538,
    "normalized_score": 7.75
  },
  {
    "title": "Where to watch Pacers vs. Cavaliers: TV channel, live stream NBA playoffs, Game 4 prediction, time, odds",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 23:56:20 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "The Pacers are at home with a 2-1 series lead on Sunday night",
      "The top-seeded Thunder are trailing again in the series against the fourth-seeded Nuggets"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/11/897e16dd-daf8-4990-b521-eb8f2415caa6/cavs-pacers-getty.png",
    "titles": [
      "Where to watch Pacers vs. Cavaliers: TV channel, live stream NBA playoffs, Game 4 prediction, time, odds",
      "Where to watch Nuggets vs. Thunder: TV channel, NBA playoffs live stream, Game 4 time, odds, prediction"
    ],
    "summary": "The Pacers currently hold a 2-1 series lead and will be playing at home on Sunday night. Meanwhile, the top-seeded Thunder are trailing in their series against the fourth-seeded Nuggets, indicating a competitive playoff scenario in the basketball league.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about an upcoming basketball game, which may be useful for fans. However, it does not provide any deeper insights, discuss any broader trends or issues in the sport, or empower the reader in any significant way.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.887,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.472,
    "normalized_score": 0.34
  },
  {
    "title": "LA Galaxy off to worst start by reigning MLS champions with zero wins through 12 games",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 23:45:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "The Galaxy have conceded a league-high 28 goals"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/11/9be1911f-0611-4899-b5f3-61cd7a2e0f93/galaxy.jpg",
    "titles": [
      "LA Galaxy off to worst start by reigning MLS champions with zero wins through 12 games"
    ],
    "summary": "The Galaxy soccer team has allowed the highest number of goals in the league, totaling 28. This places them at the top of the league for the most goals conceded.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the current performance of the LA Galaxy team, but it lacks depth or insight. It does not offer any analysis on why the team is performing poorly or potential solutions to improve their performance.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.885,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.22
  },
  {
    "title": "NASCAR 2025 race schedule, results: Complete list of Cup Series race dates, winners, tracks, locations",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 23:37:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "The 2025 NASCAR Cup Series will feature both an international and grassroots flair"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/11/1963312f-463c-4a80-a465-f3ed95da66a1/gettyimages-2214587289.jpg",
    "titles": [
      "NASCAR 2025 race schedule, results: Complete list of Cup Series race dates, winners, tracks, locations"
    ],
    "summary": "The 2025 NASCAR Cup Series is set to incorporate elements from both international racing and grassroots levels. This approach aims to diversify the competition's appeal and showcase a wide range of racing talents and styles.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story offers empowering knowledge about the 2025 NASCAR Cup Series. It not only provides the race schedule and results but also informs about the series' attempt to diversify its appeal by incorporating elements from international racing and grassroots levels, which is a clear sign of progress and innovation.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.53,
    "normalized_score": 6.85
  },
  {
    "title": "Fantasy Baseball Week 8 Preview: Top 10 sleeper hitters include Jonathan Aranda, TJ Friedl",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 23:36:42 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Best matchups this week include the Braves, Cubs and Reds"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/09/87883bb8-6624-44f7-b770-812100cf4170/tj-friedl.jpg",
    "titles": [
      "Fantasy Baseball Week 8 Preview: Top 10 sleeper hitters include Jonathan Aranda, TJ Friedl"
    ],
    "summary": "This week's highlighted sports matchups feature games between the Braves, Cubs, and Reds. These matchups are noted for their competitive nature or significance within their respective leagues. The outcome or scores of these games were not provided, indicating the focus is on the anticipation of the games themselves rather than results.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for fantasy baseball players by highlighting potential sleeper hitters. However, it could be more constructive if it provided more context or analysis on why these players are considered sleepers and how they could impact upcoming games.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.5,
    "normalized_score": 3.48
  },
  {
    "title": "NASCAR at Kansas results: Kyle Larson dominates on his way to winning the AdventHealth 400",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 23:19:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Larson had the field covered all race long, leading 221 of 256 laps and crossing 10,000 laps led in his career"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/11/487e453c-a913-41b6-b38d-46e2a966304c/gettyimages-2214590504.jpg",
    "titles": [
      "NASCAR at Kansas results: Kyle Larson dominates on his way to winning the AdventHealth 400"
    ],
    "summary": "Kyle Larson dominated the race, leading for 221 out of 256 laps. This performance allowed him to surpass a career milestone of leading 10,000 laps. Larson's command of the race was evident as he maintained the lead for the majority of the laps.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of the race results but doesn't offer deeper insights or understanding. It doesn't report on any improvements, solutions, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.879,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.469,
    "normalized_score": 0.0
  },
  {
    "title": "China, US Officials Say Progress Was Made in Trade Talks Over the Weekend",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:32:46 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Valentin Flauraud / AFP via Getty Images Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer speak to the media after talks with Chinese officials on tariffs in Geneva on May 11.\" src=\"https://www.investopedia.com/thmb/RvXVX5lYrGr2dPTMHdOEcHzzDOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213984182-6b2364055df741d48df08842826cafc1.jpg\" title=\"Scott Bessent and Jamieson Greer stand in front of the doorway at  the residence of the permanent Swiss ambassador to the United Nations. Microphones are pointed toward them as they address reporters.\" /><figcaption><i><p>Valentin Flauraud / AFP via Getty Images</p> Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer speak to the media after talks with Chinese officials on tariffs in Geneva on May 11.</i></figcaption></figure><p>Both U.S. and Chinese officials described the weekend's trade talks as productive, providing hope that the world's largest economies could end the trade spat spurred in recent weeks.</p><p>U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer spoke with reporters Sunday after trade discussions with Chinese officials ended in Switzerland. Bessent said “substantial progress” was made during the talks and that more details would be released Monday.<span class=\"ql-inline-citation\"></span></p><p>On the Chinese side, Vice Premier He Lifeng said the weekend's discussions were “an important first step” in negotiations.<span class=\"ql-inline-citation\"></span></p><p>Going into the weekend, traders hoped the talks <a href=\"https://www.investopedia.com/us-and-china-are-meeting-to-talk-trade-tariffs-this-weekend-heres-what-we-know-update-11731774\">would be a turning point</a> for the two largest economies, which have recently engaged in tit-for-tat tariffs. The ratcheting of import duties resulted in 145% tariffs on Chinese goods coming into the U.S. China has levied tariffs of 125% on U.S. goods.</p><p>S&amp;P 500, Dow and Nasdaq futures all rose more than 1% after the positive talk from government officials.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/RvXVX5lYrGr2dPTMHdOEcHzzDOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213984182-6b2364055df741d48df08842826cafc1.jpg",
    "titles": [
      "China, US Officials Say Progress Was Made in Trade Talks Over the Weekend"
    ],
    "summary": "U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer reported \"substantial progress\" in trade talks with Chinese officials in Geneva on May 11, signaling a hopeful turn in the recent trade tensions between the world's two largest economies. Both sides described the discussions as productive, with China's Vice Premier He Lifeng calling it \"an important first step\" towards resolving the dispute characterized by reciprocal high tariffs on each other's goods. The positive outcomes from the talks led to a rise in S&P 500, Dow, and Nasdaq futures by more than 1%. Further det",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress in resolving a major international trade dispute. It provides useful insights into the ongoing trade talks between the US and China, and highlights a solution-oriented approach. It also contextualizes the impact of these talks on the global economy, as seen by the rise in S&P 500, Dow, and Nasdaq futures.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.882,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.558,
    "normalized_score": 10.0
  },
  {
    "title": "Dow futures and the dollar surge as Wall Street cheers U.S.-China tariff talks",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:18:01 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The U.S.-China tariff negotiations appeared to yield \"a broad framework under which the two nations can conduct further talks,\" an analyst said."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2213149279_cbc284-e1746997532530.jpg?w=2048",
    "titles": [
      "Dow futures and the dollar surge as Wall Street cheers U.S.-China tariff talks"
    ],
    "summary": "The U.S. and China have reached a broad framework for continuing tariff negotiations, according to an analyst. This framework sets the stage for further discussions between the two nations on trade issues.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the impact of US-China trade talks on the stock market and the dollar. It informs readers about the progress in tariff negotiations, but it doesn't provide as much detail or context as the previous story. However, it does increase awareness about the relationship between international trade talks and financial markets.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.878,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 9.66
  },
  {
    "title": "Trump Seeks to Lower Pharmaceutical Costs",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:06:34 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Getty Images\" src=\"https://www.investopedia.com/thmb/_OFkHlav0_VpQ4dPupAnMHHu6Lw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214075981-77d9f69347be4797b6b4619f6e2b0f82.jpg\" title=\"President Donald Trump  address reporters in the Oval Office at the White House.\" /><figcaption><i><p>Anna Moneymaker / Getty Images</p></i></figcaption></figure><p>President Donald Trump says he is looking to reduce the price of prescription drugs this week.</p><p>In a post on Truth Social Sunday evening, Trump said he would sign an executive order Monday morning to ensure the U.S. pays the same price as the lowest costs paid by any other nation.<span class=\"ql-inline-citation\"></span> He said he expects the order will reduce the cost of pharmaceuticals by 30% to 80%.</p><p>\"Our Country will finally be treated fairly, and our citizens [sic] Healthcare Costs will be reduced by numbers never even thought of before,\" he wrote in the post. \"Additionally, on top of everything else, the United States will save TRILLIONS OF DOLLARS.\"</p><p>It is unclear if the executive order is a tariff on pharmaceuticals that Trump has <a href=\"https://www.investopedia.com/trump-suggests-25-tariffs-on-auto-chip-pharma-imports-reports-say-11682149\">suggested since February</a>. The president did not provide further details about how the order would be executed.</p><p>Trump is expected to sign the order at 9 a.m. Eastern Time.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/_OFkHlav0_VpQ4dPupAnMHHu6Lw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214075981-77d9f69347be4797b6b4619f6e2b0f82.jpg",
    "titles": [
      "Trump Seeks to Lower Pharmaceutical Costs"
    ],
    "summary": "President Donald Trump announced his intention to sign an executive order aimed at reducing prescription drug prices in the United States. According to a statement he made on Truth Social, the order will align U.S. drug prices with the lowest prices paid by any other nation, potentially cutting costs by 30% to 80%. Trump claims this action will lead to unprecedented savings in healthcare costs for Americans and save the country trillions of dollars. The specifics of how the order will be implemented remain unclear, including whether it involves tariffs on pharmaceuticals. The signing is schedu",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a potential change in policy that could affect the cost of prescription drugs in the United States. However, it lacks specifics on how this change will be implemented, and does not offer any analysis of the potential impacts of this policy, limiting its usefulness and depth.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.876,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.526,
    "normalized_score": 6.4
  },
  {
    "title": "Trump seeks to match US drug costs with cheaper ones abroad",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:03:42 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "He said in a social media post that pharmaceutical prices could drop 30% to 80%."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2213423625_554465-e1747004169127.jpg?w=2048",
    "titles": [
      "Trump seeks to match US drug costs with cheaper ones abroad"
    ],
    "summary": "A social media post by an individual claimed that pharmaceutical prices could see a reduction ranging from 30% to 80%. This statement suggests a significant potential decrease in the cost of medications.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story merely repeats a claim made on social media without providing any additional context or analysis. It offers basic awareness of a potential change in drug prices, but does not provide any additional insight or depth.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.875,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.496,
    "normalized_score": 3.03
  },
  {
    "title": "Time spent in Europe gave me perspective on the U.S. and our stocks",
    "domain": "business",
    "location": "national",
    "published": "Sun, 11 May 2025 22:45:53 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "It's almost as if you can see why these European markets are roaring, and we are way behind."
    ],
    "image_url": "",
    "titles": [
      "Time spent in Europe gave me perspective on the U.S. and our stocks"
    ],
    "summary": "European markets are experiencing significant growth, outpacing other regions. The reasons for this growth are not specified in the provided content.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides a basic awareness of growth in European markets, but does not provide any details on why this growth is occurring or what it might mean for U.S. stocks. It lacks depth and actionable insights.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.871,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.487,
    "normalized_score": 2.02
  },
  {
    "title": "Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 21:04:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/natural-mushroom-compound-shows-promise-in-treating-parkinsons-symptoms/\" rel=\"nofollow\" title=\"Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms\"><img alt=\"Parkinson&#039;s Hand Tremors\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Parkinsons-Hand-Tremors-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A pilot study by UCSF reveals unexpected results, with psilocybin therapy leading to significant improvements in mood, cognitive function, and motor symptoms. Psilocybin, a naturally occurring compound found in certain mushrooms, has shown potential in treating depression and anxiety. Researchers at UC San Francisco set out to explore whether psilocybin could also benefit individuals with [...]"
    ],
    "image_url": "",
    "titles": [
      "Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms"
    ],
    "summary": "A pilot study by the University of California, San Francisco (UCSF) has found that psilocybin therapy, involving a compound found in certain mushrooms, can lead to significant improvements in mood, cognitive function, and motor symptoms in patients. This research suggests psilocybin's potential benefits extend beyond treating depression and anxiety, indicating it could also aid individuals with Parkinson’s disease.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress in medical research, providing readers with new understanding about potential benefits of psilocybin therapy. It offers actionable insights for those interested in alternative treatments for Parkinson’s disease.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.847,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.54,
    "normalized_score": 7.98
  },
  {
    "title": "Scientists Have Found a Drug That Slashes Blood Pressure in Weeks",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 20:35:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-have-found-a-drug-that-slashes-blood-pressure-in-weeks/\" rel=\"nofollow\" title=\"Scientists Have Found a Drug That Slashes Blood Pressure in Weeks\"><img alt=\"Measuring Blood Pressure\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Measuring-Blood-Pressure-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have discovered a promising new therapy for resistant high blood pressure, leading to a 15-point drop in systolic levels. Researchers at the University of California, San Diego School of Medicine have identified a potential new treatment for individuals with uncontrolled or treatment-resistant hypertension, a condition commonly referred to as high blood pressure. The investigational [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Have Found a Drug That Slashes Blood Pressure in Weeks"
    ],
    "summary": "Scientists at the University of California, San Diego School of Medicine have discovered a new drug that significantly reduces systolic blood pressure by 15 points in individuals with resistant high blood pressure. This promising therapy offers hope for those with treatment-resistant hypertension, providing a potential new treatment option.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it highlights a significant innovation in medical science. It informs readers about a potential new treatment for resistant high blood pressure, providing useful information for those affected by this condition.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.84,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.538,
    "normalized_score": 7.75
  },
  {
    "title": "Rewriting History: Study Challenges Long-Held Assumptions About Phoenician Civilization",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 15:41:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/rewriting-history-study-challenges-long-held-assumptions-about-phoenician-civilization/\" rel=\"nofollow\" title=\"Rewriting History: Study Challenges Long-Held Assumptions About Phoenician Civilization\"><img alt=\"Punic Necropolis of Puig Des Molins, Ibiza\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Punic-Necropolis-of-Puig-Des-Molins-Ibiza-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Study challenges long-standing beliefs about the Mediterranean Phoenician-Punic civilization, a culture recognized as one of the most influential maritime powers in history. The Phoenician culture originated in the Bronze Age city-states of the Levant and introduced major innovations, including the first alphabet, an ancestor to many modern writing systems. By the early first millennium BCE, [...]"
    ],
    "image_url": "",
    "titles": [
      "Rewriting History: Study Challenges Long-Held Assumptions About Phoenician Civilization"
    ],
    "summary": "A recent study has challenged prevailing beliefs about the Phoenician-Punic civilization, known for being a dominant maritime power in the Mediterranean and originating in the Levant during the Bronze Age. This civilization, credited with creating the first alphabet, which influenced many modern writing systems, has been re-examined, leading to new insights into its historical impact and development.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive because it increases awareness and understanding about the Phoenician-Punic civilization. Although it doesn't offer actionable insights or solutions, it provides valuable knowledge, challenging long-held assumptions and contributing to a deeper understanding of history.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.773,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.508,
    "normalized_score": 4.38
  },
  {
    "title": "Old drains and railways are full of life. Here's how to make the most of these overlooked green spaces",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 15:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Across Australian cities, leftover and overlooked green spaces are everywhere. Just think of all the land along stormwater drains, railway lines and vacant lots. While often dismissed as useless or unsightly, there's a growing understanding of the value these spaces bring to cities."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/old-train-tracks.jpg",
    "titles": [
      "Old drains and railways are full of life. Here's how to make the most of these overlooked green spaces"
    ],
    "summary": "In Australian cities, unused and neglected green spaces such as those along stormwater drains, railway lines, and vacant lots are being reevaluated for their potential benefits. These areas, previously considered unattractive or worthless, are now recognized for their possible contribution to urban environments.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides awareness about the potential benefits of neglected green spaces in urban environments. It offers actionable insights on how these spaces can be utilized, contributing to the reader's understanding and decision-making regarding urban planning and environmental conservation.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.77,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.525,
    "normalized_score": 6.29
  },
  {
    "title": "Who Are the Japanese? Shocking DNA Study Reveals the Truth",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 15:08:13 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/who-are-the-japanese-shocking-dna-study-reveals-the-truth/\" rel=\"nofollow\" title=\"Who Are the Japanese? Shocking DNA Study Reveals the Truth\"><img alt=\"Aterui &#039;Lord of Tamo&#039; Mask\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Aterui-Lord-of-Tamo-Mask-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A Massive DNA Study Just Rewrote Japan’s Ancestry — And It Could Help Future Medicine Scientists have just made a fascinating discovery about the roots of the Japanese people. By analyzing the complete genomes of over 3,200 individuals from all across Japan, researchers found that the population isn’t shaped by just two ancestral groups, as [...]"
    ],
    "image_url": "",
    "titles": [
      "Who Are the Japanese? Shocking DNA Study Reveals the Truth"
    ],
    "summary": "A comprehensive DNA study involving over 3,200 Japanese individuals has revealed new insights into the ancestry of Japan's population, challenging the previous belief that it was formed from just two ancestral groups. This groundbreaking research could have significant implications for the future of medicine in the country.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the ancestry of Japan's population, which can be useful in various fields, including medicine and genetics. However, it does not clearly report on solutions, improvements, or attempts to solve problems, hence it does not score the highest.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.765,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.505,
    "normalized_score": 4.04
  }
]