[
  {
    "title": "Trump Administration Deploys 300 National Guard to Illinois After Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 11:32:25 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "The Guardian",
      "BBC",
      "Fortune",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "news.google.com",
      "www.dw.com",
      "www.aljazeera.com",
      "fortune.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The controversial move follows protests over ramped-up immigration enforcement and the shooting of a woman during unrest on Saturday.",
      "Trump deploys 300 National Guard troops to Chicago amid protests and criticism from local leaders.",
      "Trump is deploying 300 troops to Chicago as part of his immigration and crime crackdown. But a similar order for Portland has been temporarily blocked.",
      "<p>Illinois governor JB Pritzker says administration is escalating ‘aggression against Illinois citizens and residents’</p><p>Donald Trump has moved to deploy the national guard in another city by authorizing 300 troops to protect federal officers and assets in Chicago, where the government said bor",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5vVXdjLTR4TDhmQlpXaWJXWk9JR3dGRElKLUloTDdFVTZmdGlfNDJuQzA1UktmdzA5LVFHVmxzYkwxSXRDN3lQVF8zWTliSFZVTlAwWnR4N0lYcEIyT1ZOWEZPSVFpQ0ZHMjQyMElFSGJOYlJlZEVOLURjVXFDQQ?oc=5\" target=\"_blank\">Trump calls up 300 National Guard members after feud with",
      "“This morning, the Trump Administration’s Department of War gave me an ultimatum: call up your troops, or we will,” Pritzker said in a statement."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c0dd/live/4ac49720-a187-11f0-b1c5-b56e9bf8a857.jpg",
    "titles": [
      "Trump authorises deployment of 300 National Guard troops to Chicago",
      "Trump authorises National Guard deployment to Chicago despite objections",
      "US: Trump plans to deploy National Guard to Chicago",
      "Trump authorizes national guard deployment to Chicago, White House says, as border patrol there shoots woman",
      "Trump calls up 300 National Guard members after feud with Illinois governor - Axios",
      "Trump to federalize 300 members of the Illinois National Guard ahead of expected deployment to Democratic state"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.967,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.843,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After a dispute, the Trump Administration authorized 300 National Guard members to be deployed. This decision followed an ultimatum to Illinois Governor Pritzker from the Department of War, stating he must call up troops or the federal government would intervene.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kirk Powers Blue Jays to 10-1 Win Over Yankees in ALDS Opener",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 02:59:11 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "CityNews",
      "Global News",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Vladimir Guerrero Jr. said goodbye to a slump in his opening at-bat Saturday. Alejandro Kirk used his first swing to show that his bat remained as hot as ever.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQYVpvT0FtNE03Z3lmNmwzdHNYWlVLN3RONndyc29jUjZQUGxlQUFPMzZ2aUlfcm95dWltRUFwMEVNaU9JTFdXUll0dWhHSnh1dEtaZHNSYVdzaFVmTVBNbnFta1B2b0pUSWN6TDhpS1hyNXYtcEhmZDlsQWl6a2JNNHZnLUZqeERJVWc?oc=5\" target=\"_blank\">Blue Jays Make Decision on Bo Bichette f",
      "<p>Between Vladimir Guerrero Jr. delivering a major moment, erasing a playoff losing streak and forcing the Yankees to burn through five relievers, the Blue Jays nearly checked every box in Saturday&#8217;s win.</p>",
      "<p>The Toronto Blue Jays will have to wait a little longer for Bo Bichette to make his return to the lineup. </p>",
      "The Blue Jays have won 10-1 in Game 1 of the American League Division Series against the New York Yankees. The two teams were playing at Rogers Centre on Saturday for the first game between Toronto and New York in the MLB playoffs. The Yankees and Jays go back to the Rogers Centre in Game [&#8230;]"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/334e65d64bf3f421c632c8b0dfeaa08b391088ae42297e108dd7474e3649b3b6_83b187.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays open ALDS with blowout win over Yankees",
      "Blue Jays Make Decision on Bo Bichette for ALDS Matchup vs. Yankees - Sports Illustrated",
      "Blue Jays overpower Yankees to open ALDS with statement win",
      "Blue Jays’ Bo Bichette ruled out of ALDS against Yankees",
      "Blue Jays win 10-1 in Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.826,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 10-1 victory over the New York Yankees in Game 1 of their American League Division Series with his second consecutive two-homer game. This win marks the Blue Jays' first post-season victory in nine years, highlighted by a strong performance from Vladimir Guerrero Jr. and effective strategy that exhausted the Yankees' bullpen, utilizing five relievers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Collier Cancels Meeting with WNBA Commissioner Amid Dispute",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 07:47:05 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Minnesota Lynx forward Napheesa Collier has canceled her meeting with WNBA commissioner Cathy Engelbert next week, sources told ESPN.",
      "Engelbert claimed there were inaccuracies in Collier's fiery tirade against WNBA leadership",
      "<p>Minnesota forward Napheesa Collier canceled a meeting with WNBA Commissioner Cathy Engelbert expected to take place next week, a person familiar with the situation told The Associated Press on Saturday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Collier cancels meeting with Engelbert",
      "Napheesa Collier cancels meeting with WNBA commissioner Cathy Engelbert amid public spat, per report",
      "AP Source: Napheesa Collier cancels meeting with WNBA Commissioner amid tensions"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minnesota Lynx forward Napheesa Collier has canceled a planned meeting with WNBA Commissioner Cathy Engelbert, according to sources. This decision follows Engelbert's claims of inaccuracies in Collier's critical comments about WNBA leadership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCLA Upsets Penn State, Week 6 Sees Top Teams Fall",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 07:47:05 EST",
    "source": "ESPN",
    "sources": [
      "Bleacher Report",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "UCLA delivered a statement upset of Penn State on Saturday, and then brought the troll game to back it up afterward.",
      "No. 7 Penn State and No. 9 Texas fall in shocking collapses to unranked teams",
      "Projecting the new AP Top 25 poll after the Week 6 action in college football",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOdllhc2RJUjZJZGExUkx0NkhRVVJ0RVFBeUNIVkZXaGxUYVU3UWNwU1NKMjNnWV9KTVBLOGljSVBfc0NpQ0hQVVY0cF9XNS1OWG14enM5amU0RUVpeUxDWFR0TVYtbG1mUEtLRHZHS2I5OEpGVDBtZ2ZOczJWTnVkaEtsaVQ4UEQxZlh3V1g4M1NaWWVuakk3b1lVa0Y?oc=5\" target=\"_blank\">B/R's 2025 Colle"
    ],
    "image_url": "",
    "titles": [
      "😆 Top trolls from college football Week 6",
      "College football winners, losers in Week 6: UCLA rises from the ashes, preseason No. 1 Texas full of flaws",
      "Tomorrow's Top 25 Today: Penn State, Texas flirting with exit from college football rankings",
      "B/R's 2025 College Football Winners and Losers from Week 6 - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UCLA achieved a notable upset victory over Penn State on Saturday, surprising many. Following the game, UCLA engaged in celebratory trolling. Additionally, both No. 7 Penn State and No. 9 Texas experienced unexpected defeats to unranked teams during Week 6 of college football. These upsets are anticipated to significantly impact the upcoming AP Top 25 poll rankings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Security Fears Exclude Three Provinces from Election, Sparking Debate",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 04:20:44 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Syria is holding parliamentary elections on Sunday for the first time since the fall of the country's longtime autocratic leader, Bashar Assad, who was unseated in a rebel offensive in December.",
      "Three provinces will not be included \"for security reasons\", amid concerns over how representative the polls will be.",
      "Syrians are voting indirectly, and President Ahmed al-Shara is appointing a third of the lawmakers. Still, some see this as a step forward after decades of dictatorship."
    ],
    "image_url": "",
    "titles": [
      "What to expect as Syria holds first parliamentary elections since Assad's ouster",
      "Syria holds first elections since Assad, but not in all provinces",
      "Syria Chooses Its First Parliament Since End of Civil War"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Three provinces are excluded from upcoming polls in an unnamed country due to security concerns, raising doubts about the election's representativeness. While supporters see the vote as a potential milestone, critics view it as President Ahmed al-Shara's attempt to strengthen his power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Dead in Attack at Manchester Synagogue; Six Arrested for Terrorism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 11:14:27 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "And Kemi Badenoch arrives in Manchester for Conservative conference.",
      "A congregant in Manchester, England, described how fellow worshipers, including the rabbi, used their bodies to barricade the entrance as the assailant tried to force his way in.",
      "<p>Six people have been arrested on suspicion of commission, preparation and instigation of acts of terrorism after attack that left three dead</p><p>Counter-terrorism police have been given permission to hold four suspects in custody until Wednesday after this week’s attack at a Manchester synagogu"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e75f/live/9e76f8a0-a109-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about Manchester synagogue attack",
      "Manchester Synagogue Attack: PM Tells Protesters To ‘Respect Grief Of British Jews’",
      "How an Attack on a Synagogue in Manchester Unfolded",
      "Police given permission to hold Manchester synagogue attack suspects until Wednesday"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.961,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two Jewish individuals were killed in an attack involving a car and stabbing at Heaton Park Hebrew Congregation Synagogue in Manchester, England, during the holiest day of the Jewish calendar. In response, congregants, including the rabbi, barricaded the entrance to prevent the assailant from entering further. Following the incident, six people have been arrested on suspicion of terrorism-related offenses. Counter-terrorism police have been authorized to detain four of the suspects until Wednesday. Concurrently, Kemi Badenoch arrived in Manchester for the Conservative conference.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 F1 Season: Qualifying Sets Grid for Singapore Grand Prix",
    "domain": "business",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Sun, 05 Oct 2025 11:33:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "F1 heads to Singapore and the Marina Bay Street Circuit for round 18 of the 2025 season",
      "<p>️ Updates from Marina Bay (due to start 1pm BST)<br />️ Qualifying report | <a href=\"mailto:dominic.booth.casual@theguardian.com\">Email Dom</a> with your thoughts</p><p><strong>Let’s get this thing under way, then.</strong> Formula One’s original night race. The cars are out on the track and we’l",
      "Here's the starting grid for the 2025 F1 Singapore Grand Prix at Marina Bay Street Circuit."
    ],
    "image_url": "",
    "titles": [
      "F1 grid: Starting positions for Singapore Grand Prix",
      "Singapore Grand Prix 2025: F1 – live",
      "2025 F1 Singapore Grand Prix Grid: Who Starts Where In Marina Bay"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2025 Formula 1 season has reached its 18th round at the Marina Bay Street Circuit in Singapore, known for being the original night race. Qualifying has concluded, setting the starting grid for the Singapore Grand Prix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pereira Wins UFC Light Heavyweight Title in 80 Seconds at UFC 320",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 05:51:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sky Sports",
      "Al Jazeera",
      "ESPN"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Alex Pereira won back the light heavyweight title with a technical knockout of Magomed Ankalaev at UFC 320 in Las Vegas.",
      "Alex Pereira is the champion of the light heavyweights again after crushing Magomed Ankalaev in 80 seconds of Round 1 on Saturday at UFC 320.",
      "Brazilian Alex Pereira scored a stunning first-round knockout win over Magomed Ankalaev to reclaim the UFC light heavyweight title at UFC 320 on Saturday night, with Merab Dvalishvili retaining his bantamweight crown in the co-main event."
    ],
    "image_url": "",
    "titles": [
      "UFC 320: Pereira stuns Ankalaev with TKO to regain light heavyweight title",
      "Pereira reclaims title in 80-second TKO of Ankalaev",
      "Pereira dethrones Ankalaev to reclaim light heavyweight belt at UFC 320"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.877,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alex Pereira reclaimed the UFC light heavyweight title with a first-round technical knockout victory over Magomed Ankalaev at UFC 320 in Las Vegas. The fight concluded in just 80 seconds, marking a significant win for the Brazilian fighter. In the same event, Merab Dvalishvili retained his bantamweight title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Optimistic on Hostage Release by Oct. 13 Amid Gaza Ceasefire Talks",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:14:11 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu said on Saturday that he hopes Hamas will have returned all remaining hostages by Oct. 13.",
      "Hamas said it would release all Israeli hostages but wants to negotiate elements of President Trump’s peace plan for Gaza. Adam Rasgon, a reporter for The New York Times in Jerusalem, explains where negotiations stand.",
      "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to reach a diplomatic breakthrough.",
      "Israel and Hamas announced they’ve agreed to parts of Trump’s plan to end the war."
    ],
    "image_url": "",
    "titles": [
      "Trump urges Hamas to 'move quickly' on Gaza peace plan",
      "Hamas Partially Accepts Trump’s Peace Plan",
      "Trump’s Gaza Peace Plan: What to Know",
      "Trump Warns Hamas ‘Must Move Quickly’ To Release Hostages As Part Of His Peace Plan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.703,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu expressed hope for the release of all hostages by Hamas by Oct. 13, following partial agreement to President Trump's 20-point Gaza ceasefire plan. While Hamas has agreed to release hostages and discuss governing Gaza with Palestinian technocrats, negotiations on several aspects of the plan remain. Both Israel and Hamas have shown willingness to work towards ending the conflict, but unresolved issues could impede a diplomatic breakthrough. The US President has cautioned Hamas about the limited time available to finalize the deal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows Quick Hostage Return, Sends Team to Egypt for Gaza Plan Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:38:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Hamas will disarm \"the easy way or the hard way\", Israel's PM says after the group gave its response to a peace plan.",
      "Israeli Prime Minister Netanyahu said he wants to see hostages returned in the coming days. He also said a team has been sent to Egypt \"to finalize technical details\" of Trump's plan for the future of Gaza.",
      "Both sides have reacted positively to a United States proposal for a cease-fire, but many details remain to be ironed out, including whether Hamas will disarm."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1ec7/live/17f63870-a160-11f0-8480-e139cd7c3f3c.jpg",
    "titles": [
      "Netanyahu says he hopes to announce hostage release in the 'coming days'",
      "Netanyahu hopes Gaza hostages return home in coming days",
      "Netanyahu Says Israel and Hamas Are on the Brink of a Hostage Deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.724,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu announced intentions to secure the return of hostages within days and has dispatched a team to Egypt to conclude technical aspects of Trump's Gaza plan. The hostages' families express cautious optimism, urging the government to seize this chance for resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC 320: 'Poatan', 'The Machine' Win; Pereira Reclaims Light Heavyweight Title",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 07:48:11 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The main and co-main events of UFC 320 delivered masterful performances.",
      "'Poatan' and 'The Machine' each added another name to a growing hit list on Saturday night"
    ],
    "image_url": "",
    "titles": [
      "UFC 320 takeaways: Pereira, Merab among the best fighters in the world",
      "UFC 320 results, takeaways: Alex Pereira, Merab Dvalishvili continue to build historically strong resumes"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At UFC 320, 'Poatan' and 'The Machine' secured victories in their respective main and co-main events, showcasing impressive performances. Additionally, Pereira won against Ankalaev, reclaiming the UFC light heavyweight title. The event highlighted the fighters' growing prowess and discussed potential future matchups following their wins.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers' Chourio Exits NLDS Game 1 with Hamstring Issue",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 17:50:15 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After getting three hits in two innings, Brewers star Jackson Chourio had to leave the first game of the National League Division Series with an apparent re-injury of his hamstring.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1lQjYzUG03QTlKcmRFSVJvT1ZhUUNCMEFCQmduNHFENlZhVUtRc3BlQk9nWVNrMDAycDlwR1pOU0hfUWdXMW1iUnNEX0JVQXo1dGFHeVlKcFk5aktFUmNVMmtnWHUwT1Utb3ZvVFJISjJTT2doS215VFFESUVtQQ?oc=5\" target=\"_blank\">Brewers Pull Jackson Chourio From Game 1 vs. Cubs With Ap",
      "<p>After becoming the first player to collect three hits in the first two innings of a postseason game, Jackson Chourio left Saturday&#8217;s 9-3 NL Division Series victory over the Chicago Cubs with tightness in his right hamstring.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e195acb3f3ec2646e41854/0x0.jpg?width=960",
    "titles": [
      "Milwaukee Brewers’ Jackson Chourio Exits Game 1 With Hamstring Issue",
      "Brewers Pull Jackson Chourio From Game 1 vs. Cubs With Apparent Injury - Sports Illustrated",
      "Brewers star Jackson Chourio undergoes MRI after early exit vs. Cubs"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.742,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jackson Chourio, a star player for the Brewers, exited the first game of the National League Division Series due to an apparent hamstring re-injury. This occurred after he secured three hits in two innings and ran hard through first base on an infield hit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Panthers Crush Lightning 7-0; NHL Preseason Highlights Penalties and Overtime Wi",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 07:47:05 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "In a wild end to the NHL preseason schedule for a pair of bitter rivals, the Florida Panthers defeated the Tampa Bay Lightning 7-0 in a memorable matchup Saturday night in which 65 penalties were called, totaling 312 minutes on the final stat sheet.",
      "<p>Evan Rodrigues scored a hat trick and added an assist, Mackie Samoskevich had a three-point game and Sergei Bobrovsky earned a shutout as the Florida Panthers blanked the Tampa Bay Lightning 7-0.</p>",
      "<p>Dylan Larkin and Michael Brandsegg-Nygard scored two goals each, while Patrick Kane tallied three points as the Detroit Red Wings edged the Toronto Maple Leafs 6-5 in overtime. Both Michael Pezzetta and Cedric Pare recorded two points in the loss.</p>",
      "<p>Shane Pinto found the back of the net, Linus Ullmark made 20 saves and David Perron scored the game-winning goal to help the Ottawa Senators beat the Montreal Canadiens 3-1.</p>",
      "<p>Nikita Zadorov opened the scoring in the first period and ended it in the third with an empty netter as the Boston Bruins down the New York Rangers 4-1.</p>",
      "<p>Travis Konecny tied the game late in the third period with his second goal before finishing the comeback with the shootout winner as the Philadelphia Flyers beat the New Jersey Devils 4-3.</p>",
      "<p>Phillip Danault scored twice and picked up an assist while Brandt Clarke dished out two assists of his own to lead the Los Angeles Kings to a 5-4 victory in overtime over the Anaheim Ducks.</p>",
      "<p>Jonathan Marchessault scored his first of the pre-season before rookie Joakim Kemell put home the overtime winner as the Nashville Predators beat the Carolina Hurricanes 3-2.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lightning, Panthers net 312 PIM in preseason tilt",
      "NHL Pre-Season Highlights: Panthers 7, Lightning 0",
      "NHL Pre-Season Highlights: Red Wings 6, Maple Leafs 5 (OT)",
      "NHL Pre-Season Highlights: Senators 3, Canadiens 1",
      "NHL Pre-Season Highlights: Bruins 4, Rangers 1",
      "NHL Pre-Season Highlights: Flyers 4, Devils 3 (SO)",
      "NHL Pre-Season Highlights: Kings 5, Ducks 4 (OT)",
      "NHL Pre-Season Highlights: Predators 3, Hurricanes 2 (OT)"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In a series of NHL preseason games, the Florida Panthers dominated the Tampa Bay Lightning with a 7-0 victory, highlighted by Evan Rodrigues' hat trick and Sergei Bobrovsky's shutout. The game was notable for a total of 65 penalties amounting to 312 minutes. Other matches saw the Detroit Red Wings narrowly defeat the Toronto Maple Leafs 6-5 in overtime, the Ottawa Senators win against the Montreal Canadiens 3-1, the Boston Bruins overcome the New York Rangers 4-1, the Philadelphia Flyers edge out the New Jersey Devils 4-3 in a shootout, the Los Angeles Kings beat the Anaheim Ducks 5-4 in overt",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Police Use Force on Protesters at Georgian Presidential Palace",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 19:34:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Opposition protests turned violent as riot police used tear gas and water cannon after disputed local elections.",
      "Demonstrators were trying to enter the presidential palace in Tbilisi. A former president had called on Georgians to protest for what he called the \"last chance\" to save the country.",
      "TBILISI, Georgia (AP) &#8212; Police in Georgia used water cannons and pepper spray on Saturday to push back protesters who tried to storm the presidential palace, as the South Caucasus country held a municipal election boycotted by the main opposition blocs amid a sweeping crackdown on dissent. Ten"
    ],
    "image_url": "",
    "titles": [
      "Police fire water cannon at Georgia protesters near presidential palace",
      "Georgia: Police fire tear gas at anti-government protesters",
      "Georgia’s police use water cannons to push back protesters trying to storm presidential palace"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.708,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Tbilisi, Georgia, police deployed water cannons and pepper spray to repel protesters attempting to storm the presidential palace following a municipal election. The demonstrations, which turned violent, were part of opposition protests against the election results, viewed as the \"last chance\" to save the country according to a former president. The main opposition blocs had boycotted the election, citing a crackdown on dissent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eventful Saturday for B.C. Lions and Nathan Rourke",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 03:40:39 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Things got way more exciting for the B.C. Lions on Saturday than Nathan Rourke wanted them to be.",
      "<p>Things got way more exciting for the B.C. Lions on Saturday than Nathan Rourke wanted them to be.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lions clinch playoff berth with win over Stamps",
      "Surging Lions clinch playoff berth with win over Stampeders"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "B.C. Lions experienced an eventful Saturday, with Nathan Rourke facing unexpected excitement. The team's situation intensified, but specific details or outcomes are not provided in the sources.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Launches Pre-Dawn Airstrikes in Ukraine, Kills Five",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 11:28:32 +0000",
    "source": "New York Times",
    "sources": [
      "Financial Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "financialpost.com"
    ],
    "snippets": [
      "At least five people were killed before dawn in another large-scale and wide-ranging assault.",
      "Russia launched a massive airstrike at targets across Ukraine overnight, including at energy facilities, killing at least five people and wounding several others."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/05/multimedia/05int-ukraine-strikes-kzjb/05int-ukraine-strikes-kzjb-mediumSquareAt3X.jpg",
    "titles": [
      "Russia Targets Ukraine’s Energy Infrastructure With Deadly Bombardment",
      "Russian Air Barrage Targets Ukraine, Damaging Gas Infrastructure"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia conducted a large airstrike on various targets across Ukraine, including energy facilities, resulting in at least five deaths and multiple injuries. This attack occurred before dawn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heavy Rains in Himalayas: 18 Dead, 7 Missing, Rescue Efforts Hindered",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 08:34:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Heavy rains continue to disrupt rescue operations in Himalayan nation as authorities struggle to respond to the crisis.",
      "Eighteen people died and seven remain missing after multiple villages were swept away in eastern Ilam district bordering India. The weather department warned that rain is likely to continue until Monday."
    ],
    "image_url": "",
    "titles": [
      "At least 47 killed in Nepal as heavy rains trigger landslides, flash floods",
      "Nepal: Deadly landslides, flash floods kill many"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Heavy rains in the Himalayan nation have hampered rescue efforts, resulting in 18 deaths and 7 missing after villages in eastern Ilam district were destroyed. The weather department predicts continued rainfall until Monday, complicating the crisis response.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Grants Police New Powers After Pro-Palestinian Protest Arrests",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 11:59:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The move is not a ban on protests but \"about restrictions and conditions\", Shabana Mahmood tells the BBC.",
      "<p>Move follows arrest of almost 500 people at latest pro-Palestinian demonstration in London on Saturday</p><p>Ministers are to give police new powers to target repeated protests, aimed particularly at cracking down on demonstrations connected to Gaza, the Home Office has said.</p><p>The announceme"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c914/live/2fffa270-a1cf-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Home secretary wants police to get more powers to restrict repeated protests",
      "Police to get new powers to crack down on repeated protests, says Home Office"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK Home Office announced new police powers to move demonstrations that cause \"repeated disorder,\" following the arrest of nearly 500 people at a pro-Palestinian protest in London. These measures specifically aim to address protests related to Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Masked Figures Spotted at Mosque Before Fire Amid Manchester Tensions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 10:21:31 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Video appears to show two people in balaclavas at the mosque before a large blaze spreads.",
      "The attack came at a time of heightened anxiety after a deadly terrorist attack at a synagogue in Manchester."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7c39/live/eb4a9b10-a1d0-11f0-9dc7-95987a999c5f.jpg",
    "titles": [
      "Mosque fire being treated as arson and hate crime",
      "Fire at Peacehaven Mosque Is Being Treated as Hate Crime, UK Police Say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A video shows two individuals wearing balaclavas at a mosque before a significant fire erupts. This incident occurred amidst increased tension following a fatal terrorist attack at a Manchester synagogue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Order to Deploy National Guard in Portland",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 20:15:30 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "A federal judge has temporarily blocked the Trump administration from deploying the National Guard to Portland, Ore., which the president had ordered over the objections of local leaders.",
      "A federal judge has temporarily blocked President Donald Trump’s attempt to federalize and deploy the Oregon National Guard to Portland."
    ],
    "image_url": "",
    "titles": [
      "Federal judge temporarily blocks Trump's National Guard deployment to Portland",
      "Judge temporarily blocks Trump's attempt to deploy Oregon National Guard to Portland"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.781,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge has temporarily halted President Trump's order to deploy the National Guard to Portland, Oregon, against local leaders' wishes. This decision stops the federalization and deployment of the Oregon National Guard to address unrest in Portland.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Workers' Union Slams Latest Contract Offers",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:05:36 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba",
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba"
    ],
    "image_url": "",
    "titles": [
      "Canada Post union says latest contract offer is a ‘major step backwards’",
      "Canada Post union says latest contract offer is a ‘major step backwards’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.687,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The union for Canada Post workers criticized the corporation's latest contract offers as a \"mockery of the collective bargaining process\" and a \"major step back.\" They expressed disappointment in a statement released Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three States Ban Coldrif Syrup After Deaths, Toxic Solvent Found",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 06:25:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Three states ban the cough syrup after children die allegedly after consuming the product.",
      "The Indian Health Ministry said in a statement that test samples of Coldrif cough syrup found a highly toxic industrial solvent. At least nine children died allegedly after consuming it."
    ],
    "image_url": "",
    "titles": [
      "India probes possible cough syrup link to deaths of at least nine children",
      "India: 3 states ban cough syrup after several children die"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Three states have banned Coldrif cough syrup after the Indian Health Ministry found a toxic industrial solvent in test samples. Nine children have reportedly died after consuming the product.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]