[
  {
    "title": "Ceasefire in Gaza: Hostages Released, Israeli Troops to Withdraw",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 04:01:01 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "The Guardian",
      "CNBC",
      "CityNews",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.forbes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Trump announced that Israel and Hamas had agreed on the first phase of a peace plan which could put an end to the two-year war and free hostages.",
      "<p>In today’s newsletter: A ceasefire between Israel and Hamas will see the release of hostages and the withdrawal of most of Israel’s troops</p><p>Good morning. After more than two years of devastating war, a ceasefire has finally been announced in Gaza.</p><p>US president Donald Trump said Israel ",
      "President Trump’s plan contains elements that Hamas has resisted in the past, and which may yet prove to be sticking points.",
      "Prime Minister Benjamin Netanyahu of Israel said he would convene his government on Thursday to sign off on the agreement. Hamas said that the agreement would lead to the end of the war, but many of the details were unclear.",
      "President Donald Trump suggested he may travel to Gaza.",
      "U.S. President Donald Trump has announced that Israel and Hamas have agreed to the “first phase” of his peace plan to pause fighting and release at least some hostages and prisoners. “This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed u"
    ],
    "image_url": "",
    "titles": [
      "Israel, Hamas agree to first phase of Gaza peace plan, allowing release of hostages and prisoners",
      "Thursday briefing: What the first phase of a Gaza peace plan will bring",
      "What Trump’s 20-Point Gaza Peace Plan Envisions",
      "President Trump Says Israel and Hamas Agree to First Phase of Peace Plan",
      "Trump Says Israel And Hamas Have Agreed To First Phase Of Peace Deal—IDF Readies Partial Troop Withdrawal",
      "Israel and Hamas agree to ‘first phase’ of plan to end fighting and release hostages, Trump says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.825,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A ceasefire agreement in Gaza, announced today, will result in the release of hostages and the withdrawal of most Israeli troops after over two years of conflict. The plan, supported by US President Donald Trump, includes elements previously resisted by Hamas, which could pose future challenges.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "László Krasznahorkai Wins 2025 Nobel Prize in Literature",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 11:45:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "He was recognised “for his compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”.",
      "Krasznahorkai, 71, was recognised for his &quot;compelling and visionary oeuvre&quot;.",
      "Krasznahorkai became the 122nd recipient of the prize, which has been given out with few exceptions since 1901. Celebrated both at home and abroad, he is famous for his dystopian novels depicting life in rural Hungary.",
      "<p>The ‘compelling and visionary’ Hungarian novelist was announced as winner at a ceremony in Stockholm<br />• <a href=\"https://www.theguardian.com/books/live/2025/oct/09/nobel-prize-in-literature-2025-live\">Nobel prize in literature 2025 live: László Krasznahorkai wins ‘for his compelling and visio"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/194a/live/f91c69d0-a4ff-11f0-9156-136a18fa2a3c.jpg",
    "titles": [
      "Hungarian author László Krasznahorkai wins Nobel Literature Prize",
      "Nobel Prize for Literature awarded to Hungarian writer László Krasznahorkai",
      "Nobel Prize in literature goes to Laszlo Krasznahorkai of Hungary",
      "László Krasznahorkai wins the Nobel prize in literature 2025"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.97,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.79,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hungarian novelist László Krasznahorkai, aged 71, was awarded the Nobel Prize in Literature 2025 for his \"compelling and visionary oeuvre\" that explores apocalyptic themes while affirming the power of art. Known for his dystopian novels set in rural Hungary, Krasznahorkai became the 122nd recipient of the prestigious award, announced in Stockholm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 09 Oct 2025 07:04:53 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "Israel and Hamas have agreed to the \"first phase\" of a ceasefire deal. And, hundreds of National Guard troops were deployed to the greater Chicago area at President Trump's request.",
      "Israel and Hamas have agreed to the \"first phase\" of a ceasefire deal intended to end the devastating Gaza war that unleashed the deadliest fighting ever between Israelis and Palestinians.",
      "Video from inside a negotiating room in Egypt shows Qatari, Turkish and Egyptian officials along with Hamas officials.",
      "Emotional scenes unfolded as Palestinians in Gaza celebrated the announcement of a Gaza ceasefire deal.",
      "Leaders and groups around the world celebrate negotiators signing off on first phase of the Gaza ceasefire agreement.",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”"
    ],
    "image_url": "",
    "titles": [
      "Israel and Hamas reach initial ceasefire deal. And, National Guard arrive near Chicago",
      "Israel and Hamas agree on the 'first phase' of Gaza ceasefire deal",
      "Video shows negotiators ahead of Gaza ceasefire deal",
      "Palestinians in Gaza celebrate news of ceasefire deal",
      "World reacts to Gaza ceasefire deal announced by Trump",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.976,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.774,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel-Hamas Ceasefire Announced Amid Hopes and Fears in Gaza",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 10:32:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Palestinians in Gaza voiced their hopes and fears after a ceasefire agreement between Israel and Hamas was annouced.",
      "Smoke from Israeli attacks were seen rising over Gaza hours after Israel and Hamas agreed to the first phase ceasefire",
      "Negotiators for Israel and Hamas have agreed to pause fighting in Gaza to release the remaining hostages in exchange for Palestinian prisoners, adopting parts of a plan backed by US President Trump. Follow DW for more.",
      "The ceasefire deal’s first phase, if successful, would halt fighting in Gaza to release hostages in exchange for Israel’s release of Palestinian prisoners."
    ],
    "image_url": "",
    "titles": [
      "Video: Palestinians in Gaza speak of cautious optimism on ceasefire deal",
      "Video: Israel strikes Gaza after agreeing Trump ceasefire plan",
      "Israel, Hamas sign off on 'phase 1' of Gaza peace plan, Trump says",
      "Live updates: Israelis and Palestinians laud ceasefire deal as step toward ending war in Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.966,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A ceasefire agreement between Israel and Hamas aimed at pausing fighting in Gaza has been announced, with hopes and fears expressed by Palestinians. Despite the agreement, smoke was observed in Gaza post-announcement. The ceasefire's first phase involves exchanging hostages for Palestinian prisoners, a plan partially backed by US President Trump. The outcome seeks to halt conflict in the region, with further details and developments followed by DW.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Military Deployments Under Legal Scrutiny, Experts Worry About Impact",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 09 Oct 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "ABC News"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "Military experts say they also worry how these new deployments will affect recruitment and public trust.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPa1FDbFlIbzFIWHRGeHJlR3RGTVB3ZExfa21ldDFCOFExcUZoM04yZXJQUHVJVWtJOFZBWW5yVV9WMEVpQTlPeUdkbVRRT0FyVXhKVEljbUJoUTlxX1JvZExrTzk3RGtBdkxJbUNnS2FhRzlyU296TlQzVXBoV0NTaWdKZnF1MjRuX3c?oc=5\" target=\"_blank\">Trump's use of National Guard in U.S. ci",
      "In two courthouses on opposite sides of the country, Donald Trump’s attempt to send troops into Democratic-led cities will face a critical legal test on Thursday."
    ],
    "image_url": "",
    "titles": [
      "Trump's use of National Guard strays from role as 'minutemen,' military experts say",
      "Trump's use of National Guard in U.S. cities unpopular with Americans, polls show - Axios",
      "Trump's use of the National Guard faces critical legal tests"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.935,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Military experts express concerns about how new military deployments, including Trump's use of the National Guard in U.S. cities, may impact recruitment and public trust. These actions are undergoing a critical legal examination in two separate courthouses across the country, with proceedings set for Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguars Trade for Browns' Newsome, Campbell Moves to Cleveland",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 02:55:06 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "jaguarswire.usatoday.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Jaguars and Browns agreed to a trade of cornerbacks Wednesday night, with Greg Newsome heading to Jacksonville and Tyson Campbell going to Cleveland, sources told ESPN's Adam Schefter.",
      "The Browns have made a second trade in two days",
      "One NFL analyst handed out grades for the Tyson Campbell-Greg Newsome trade between the Jaguars and Browns."
    ],
    "image_url": "",
    "titles": [
      "Sources: Jags get Newsome, Campbell to Browns",
      "Browns trade CB Greg Newsome II to Jaguars for CB Tyson Campbell, per reports",
      "NFL analyst grades Tyson Campbell - Greg Newsome trade"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.895,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Jaguars and Browns have completed a cornerback trade, with Greg Newsome moving to Jacksonville and Tyson Campbell heading to Cleveland, as reported by ESPN's Adam Schefter. This marks the Browns' second trade in two days, indicating active roster adjustments by both teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 09:13:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The White House calls the allegation \"baseless\" as the US Senate rejected a measure to bar Trump from using force against the boats.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9fb/live/fcd1f390-a506-11f0-b748-37792a239250.png",
    "titles": [
      "Colombia's president says boat struck by US was carrying Colombians",
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Togo Footballer Asamoah Injured in Freak Accident in China Match",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 11:49:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Asamoah broke his neck in a freak accident as he collided with an advertising board during a club game in China.",
      "Asamoah broke his neck in a freak accident as he collided with an advertising board during a club game in China.",
      "<ul><li><p>Asamoah broke neck after hitting LED panel</p></li><li><p>Midfielder plays for Guangxi Pingguo in China</p></li></ul><p>The Togo international footballer Samuel Asamoah broke his neck after colliding with a pitch-side advertising board during a domestic fixture in China, with fears he may"
    ],
    "image_url": "",
    "titles": [
      "Togo footballer Samuel Asamoah at risk of paralysis after breaking neck",
      "Togo footballer Samuel Asamoah at risk of paralysis after breaking neck",
      "Togo’s Samuel Asamoah ‘at risk of paraplegia’ after colliding with advertising board"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Togo international footballer Samuel Asamoah suffered a neck injury after colliding with an advertising board during a game for Guangxi Pingguo in China. The incident, described as a freak accident, occurred during a domestic club match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Take 2-0 Series Lead as Wilson Shines, Sabally Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 00:47:54 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Everything that happened in Game 3, including A'ja Wilson's historic night and Satou Sabally's injury.",
      "The Aces have taken a commanding 2-0 lead, but now the series will shift to Phoenix for Game 3",
      "<p>Though the Phoenix Mercury fought admirably, A&#8217;ja Wilson&#8217;s inevitability prevailed in the final seconds. Now the WNBA great and her Las Vegas Aces are one win away from history. </p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals Game 3 takeaways: How Aces beat Mercury to go up 3-0",
      "2025 WNBA Finals: Aces vs. Mercury schedule, Game 3 prediction, odds, pick, where to watch",
      "WNBA Finals Game 3 Takeaways: Aces on brink of dynasty after last-second win"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.857,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Game 3 of the series, A'ja Wilson had a historic night, contributing significantly to the team's performance. However, the game was also marked by Satou Sabally's injury. Despite these events, the Aces secured a 2-0 lead in the series. The next game is set to take place in Phoenix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Reach AL Championship Series for 8th Time Since 2016",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 09 Oct 2025 08:02:49 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays are heading to their eighth American League Championship Series — and their first since 2016.",
      "<p>Shi Davidi joins Sportsnet Central to look ahead to the American League Championship Series, discussing whether the Toronto Blue Jays should have a preference between playing the Seattle Mariners or the Detroit Tigers.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f50aa9e04a851cef1deb6bafc50ef0c8dc8b64d91f2775f3fea95a3543717a4f.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays set for ALCS against Tigers or Mariners",
      "Should Blue Jays have a preference between Tigers, Mariners for ALCS?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have advanced to the American League Championship Series for the eighth time, marking their first appearance since 2016. Shi Davidi discussed on Sportsnet Central the team's potential preferences for their opponent, debating between the Seattle Mariners and the Detroit Tigers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Gaza Ceasefire Plan, Plans Trip to Support Talks",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 08:00:55 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "U.S. President Donald Trump's last month proposed a 20-point plan for for a ceasefire in the Gaza Strip ahead of this week's negotiations in Egypt.",
      "An exchange of hostages and prisoners was expected this weekend. Prime Minister Benjamin Netanyahu of Israel said he would convene his cabinet to sign off on the agreement, and President Trump said he might travel to the region."
    ],
    "image_url": "https://s.abcnews.com/images/International/Trump-DB-251009_1759993217265_hpMain_2_4x3t_384.jpg",
    "titles": [
      "What to know about the proposed Israel-Hamas Gaza ceasefire and next steps",
      "Live Updates: Israel-Hamas Deal Paves Way for Gaza Cease-Fire"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. President Donald Trump proposed a 20-point ceasefire plan for the Gaza Strip before negotiations in Egypt. This plan includes an expected exchange of hostages and prisoners. Israeli Prime Minister Benjamin Netanyahu plans to convene his cabinet to approve the agreement, and President Trump is considering a trip to the region to support the process.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Announces First Phase of Gaza Peace Plan; Hostages to be Released",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 10:47:19 GMT",
    "source": "Financial Times",
    "sources": [
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Deal would be foreign-policy success but ending war will require president to keep pushing for tough negotiations between Israel and Hamas",
      "Israel and Hamas have reached an agreement to release hostages and prisoners. Our colleague Jodi Rudoren explains this critical moment."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1ee38164-455b-4519-a6f7-e874fec81cca.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump’s Gaza breakthrough is just the start",
      "A Gaza Breakthrough"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US, under President Donald Trump, announced the first phase of a peace plan for Gaza, marking a significant development. Israel and Hamas have agreed to release hostages and prisoners, as explained by Jodi Rudoren. This agreement is a critical step towards peace in the region.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ceasefire Agreement Reached in Two-Year Conflict, Trump Support Noted",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 07:56:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The families of Israeli captives held in Gaza are celebrating news of a ceasefire agreement.",
      "Trump-backed deal marks milestone in efforts to bring two-year conflict to an end"
    ],
    "image_url": "",
    "titles": [
      "Families of Israeli captives welcome Gaza ceasefire agreement",
      "Israeli cabinet to vote on hostage release agreement"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A ceasefire agreement, supported by Trump, has been reached, marking a significant step towards ending a two-year conflict. This development is celebrated by the families of Israeli captives held in Gaza.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attack on Manchester Synagogue on Holy Day Kills Two; Assailant Claims IS Ties",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 11:39:44 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The man called police and declared his Islamic State allegiance but officials said there was no evidence that he was affiliated with any organized group.",
      "Jihad al-Shamie, who attacked a Manchester synagogue on the holiest day of the Jewish calendar, called the emergency services during the attack to claim responsibility."
    ],
    "image_url": "",
    "titles": [
      "Man who attacked synagogue on Yom Kippur proclaimed allegiance to ISIS",
      "Manchester Synagogue Attacker Pledged Allegiance to ISIS, Police Say"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad al-Shamie attacked a Manchester synagogue on the Jewish calendar's holiest day, killing two worshippers. During the attack, he crashed his car into a brick wall, then called emergency services to claim responsibility and pledge allegiance to the Islamic State, according to police.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giannis Affirms Commitment to Bucks, Open to Future Changes",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 07:00:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "Giannis Antetokounmpo and the Milwaukee Bucks seem to be stuck in a game of trade-request chicken, and neither wants to blink first.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOQ1BTcThHYmM1TFdIX2otczVQQlBvcjlTdjNrSkJzUWo1X00wR1g2d3FIZ2tTTEJnOGZIUUxlemU3SU9ESkRDc0dBYnRZdkZjemJlOWRuWFI5SGxveDRjRmszbVc0M0Zlam5mS2dZUmZHVTh3cTF3Q19xLWFhWUtjVjR4OFlTUQ?oc=5\" target=\"_blank\">Giannis Antetokounmpo Responds to Latest Buck"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e7314be90b2bb5805f0725/0x0.jpg?width=960",
    "titles": [
      "Giannis Antetokounmpo, Milwaukee Bucks Are Playing A Game Of Chicken",
      "Giannis Antetokounmpo Responds to Latest Bucks Trade Rumors - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Giannis Antetokounmpo, the two-time MVP, has stated he remains committed to the Milwaukee Bucks amid rumors of a potential trade to the Knicks. He expressed his belief in the team's potential but did not rule out changing his stance in the future based on the team's development.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Yankees 5-2, Advance to ALCS for First Time Since 2016",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 02:55:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Blue Jays advanced to the club's first ALCS since 2016 after defeating the Yankees 5-2.",
      "The Blue Jays have won 5-2 in Game 4 of the American League Division Series against the New York Yankees. After two wins in Toronto, one loss in New York on Tuesday, the team made a comeback Wednesday after defeating the Yankees. The Jays are now advancing to the the American League Championship Ser"
    ],
    "image_url": "",
    "titles": [
      "Jays knock out Yankees, reach 1st ALCS since '16",
      "Blue Jays beat Yankees 5-2, advance to the ALCS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays advanced to the American League Championship Series (ALCS) for the first time since 2016 by defeating the New York Yankees 5-2 in Game 4 of the ALDS. Key contributions came from Vladimir Guerrero Jr. and George Springer, with eight pitchers collectively shutting down the Yankees. This victory follows a regular season where the Blue Jays won eight of thirteen games against their AL East rivals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Expands $5 ChatGPT Go Plan to 16 More Asian Countries",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 08:26:50 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "OpenAI has expanded its budget-friendly ChatGPT Go plan to 16 more countries across Asia, after launching it in India and Indonesia earlier this year.",
      "OpenAI is expanding its $5 per month ChatGPT Go plan to 16 more countries."
    ],
    "image_url": "",
    "titles": [
      "OpenAI expands budget-friendly ChatGPT Go to 16 more countries in Asia",
      "OpenAI’s affordable ChatGPT Go plan expands to 16 new countries in Asia"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI has extended its affordable ChatGPT Go plan to 16 additional Asian countries, following its initial launch in India and Indonesia. The $5 per month plan is now available in a total of 18 countries, aiming to provide accessible AI chat services to a wider audience.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Upholds Trump's Military Authority Without Congress Approval",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 07:08:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Democrats say President Donald Trump does not have the power to use force without the approval of Congress.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE50LVBHQ1dYZTZfWDVkWmNFYkN6eWJYcFJ5RHlQV0x3UDZVUEhQVGJISUVwQjNYVXk0QVpYSjZOUDV5VURERmRsdlBiamtHTHk4Y0dDSGFqbWVTVHlfeEtRMDl1emwwell1QTR6dTFNNTdiN2NvRUZ1cA?oc=5\" target=\"_blank\">Senate rejects effort to curb Trump's power to target alleged dru"
    ],
    "image_url": "",
    "titles": [
      "US Senate fails to curb Trump’s power to strike drug cartels",
      "Senate rejects effort to curb Trump's power to target alleged drug boats - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.899,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Senate rejected an effort to limit President Donald Trump's authority to use military force without Congressional approval. This decision upholds the president's power to act in matters of military engagement without needing prior consent from Congress.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Luxury Car Maker's 2030 Targets Disappoint, Stock Prices Fall",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 11:55:58 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Analysts said the targets, which were announced as part of the firm’s Capital Markets Day event, fell short of expectations.",
      "Shares in luxury-car maker slide as financial targets for 2030 underwhelm investors"
    ],
    "image_url": "",
    "titles": [
      "Ferrari shares fall 16% as guidance disappoints, on track for worst trading day ever",
      "Ferrari halves EV targets as profit guidance disappoints"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the firm's Capital Markets Day event, luxury car manufacturer announced financial targets for 2030 that analysts deemed below expectations, leading to a decline in the company's stock prices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rielly Shines in Leafs' 5-2 Win Over Canadiens, Nylander Leads Offense",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 04:18:45 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNelZBSGs0V1hzZGFIM3RXLVpUZFZxN2llbTRZdFQ2YWRpWldGa2NKV3o0WjdYUndjR3BreG5STGJhbkJqeTc5XzJoamJuX2NpWmlGOEVycjFRcTVVR2tBWU5ITEtNZGhONXpHM3RvLUlVa1A4Y1FaLUVxcjRnaTdtWW0zUEZ1TmhFaVJGdXdZWlhBSXM?oc=5\" target=\"_blank\">Rielly sparks Maple Leafs pa",
      "<p>Before the home side found life late and managed to pull a season-opening victory out of the muck, netminder Anthony Stolarz did his best to keep his club in it.</p>",
      "<p>William Nylander led the offensive charge for the Toronto Maple Leafs, tallying a goal and two assists in his team&#8217;s 5-2 victory over the Montreal Canadiens. Morgan Rielly added a goal and an assist of his own in the win.</p>"
    ],
    "image_url": "",
    "titles": [
      "Rielly sparks Maple Leafs past Canadiens in season opener - NHL.com",
      "Stolarz bails out messy Maple Leafs in uneven season opener",
      "NHL Highlights: Maple Leafs 5, Canadiens 2"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.831,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Morgan Rielly, after an off-season of reflection, contributed to the Toronto Maple Leafs' 5-2 victory over the Montreal Canadiens by scoring a goal and assisting another. William Nylander spearheaded the team's offensive efforts with a goal and two assists.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Peptide Blocks Alpha-Synuclein Misfolding, Aids Parkinson’s Research",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:24:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain dis",
      "<a href=\"https://scitechdaily.com/scientists-discover-food-molecules-that-trick-cells-into-staying-young/\" rel=\"nofollow\" title=\"Scientists Discover Food Molecules That Trick Cells Into Staying Young\"><img alt=\"Energy Vitality Human Health Lifespan\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a molecule that could stop Parkinson’s in its tracks",
      "Scientists Discover Food Molecules That Trick Cells Into Staying Young"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.832,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers have developed a peptide that inhibits the harmful misfolding of alpha-synuclein, a protein associated with Parkinson’s disease and some forms of dementia. In laboratory and animal studies, this peptide stabilized the protein and enhanced motor functions, showcasing the potential of rational drug design in addressing neurodegenerative disorders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Draisaitl Scores 400th NHL Goal in Game Against Flames",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 03:49:46 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPaHZjWlFnZU1EazdvRGVBR0h4ZC0yX3BhUUNRRklpSGxOb2NqOE9oYjgzMWwwbm5GYVlkMXdrLUJLbjQ3VV92YXg4UnJUZU9PdzEwdFlRN1B6Q0FXRW1BLUpSbUJXNkctdkxBZno0QUNnTjlERXNsMGJQOHNreFhUdjE0OUtmb25Y?oc=5\" target=\"_blank\">Draisaitl scores 400th NHL goal for Oilers<",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNUW1CaHE4S2VucHFqc0wydDVidHpxOGt1TDdhY2Jfdm1aT0oxOW1Dd0ZwNkYweG5ndmtCdC0zQ0stSTN0S3Q5V0FqR09QRlhMc0VFWGJLYkcyQV94Qy03VlE4T01UYVRhX0RhWGU2cllLUkRDenZvRGJkRlNJcjFyNWc0ZXNNdzlHQVk1Q3hCTFp3RkQ1YjVqckdn?oc=5\" target=\"_blank\">Draisaitl buries 40",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQNmEtWGJPTFczeUktRXI1Sm54UzREano2eFB5elpSTUFlU19GeDRQWHFuRWh2SjIyeU5Ca0E3RFJGVVJMdm41WVhjWUtKV3g0Vi1WY3cyLUZYVnZ6ZW82b3VwMmpzdFhxTXd1NGVubVN0MTlJdmc0RG1pWXFiVGVsWUpNRk9zT2JTV0ZhT2wtb1NJNS1F?oc=5\" target=\"_blank\">Kapanen's first NHL goal</a",
      "<p>Watch as Edmonton Oilers star Leon Draisaitl sneaks past the Calgary Flames defenders and taps in a beautiful no-look feed from David Tomasek on the power play to for the 400th goal of his NHL career.</p>"
    ],
    "image_url": "",
    "titles": [
      "Draisaitl scores 400th NHL goal for Oilers - NHL.com",
      "Draisaitl buries 400th career goal - NHL.com",
      "Kapanen's first NHL goal - NHL.com",
      "Oilers’ Draisaitl taps in 400th career goal on power play vs. Flames"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Leon Draisaitl of the Edmonton Oilers scored his 400th NHL goal against the Calgary Flames, assisted by David Tomasek. This milestone was achieved during a power play with a no-look feed from Tomasek.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oilers Sign Ekholm for $12M, Acquire Roslovic in Roster Boost",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 03:56:48 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNendYUFdKdEJRbTZxdEVlZHpLdGFySi10RUtlazZKTTNuRURKSnRLZlhzSFBpTVM4OVY0NWY1VUx4VXpUZlVZanZCbk5PWVJWT2tPOTBEUlE1V05yem5WWEd6czM3cHdnLUUzWmxPVWIyT1JGWlBqWjdBYlZ1U0dELXRDVDlvalE?oc=5\" target=\"_blank\">RELEASE: Oilers agree to terms with Jack Ros",
      "<p>The Edmonton Oilers are adding an experienced depth centre to the mix.</p>"
    ],
    "image_url": "",
    "titles": [
      "RELEASE: Oilers agree to terms with Jack Roslovic - NHL.com",
      "Oilers set sign centre Jack Roslovic to one-year deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.824,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Edmonton Oilers have signed defenceman Mattias Ekholm to a three-year, $12 million contract extension and acquired free agent forward Jack Roslovic on a one-year, $1.5 million deal to bolster their roster.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shutdown Begins Amid Funding Deal Stalemate",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 23:50:06 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1IR0s3dmdnRTJjb1ZzelM5d2lSaC0zSHJDaWdYMzBCamhKVU5seHBCRXNZUUFTYUNxbmktTUstWURTODVidXZmNjRzdUI0XzRTWlJJcjZjdVNHbGppT0pVcTNuZlBQaWlaT2hKejZocVFBUW16Z2c?oc=5\" target=\"_blank\">The retiring Senate Democrat leading quiet government shutdown talks",
      "President Donald Trump and Republicans accuse Democrats, who want any funding bill to include health-care protections, of holding the government hostage."
    ],
    "image_url": "",
    "titles": [
      "The retiring Senate Democrat leading quiet government shutdown talks - Axios",
      "Senate again rejects funding bills as government shutdown enters second week"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.757,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government shutdown began at midnight on October 1, following a failure to reach a funding deal, with Democrats demanding health-care protections in any bill and Republicans, led by President Donald Trump, accusing them of holding the government hostage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Researchers Reveal How Easter Island Statues Were Moved Upright",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 09:43:41 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Researchers confirmed that Rapa Nui’s moai statues could “walk” upright using a rocking motion, aided by rope and just a few people. Experiments with replicas and 3D models revealed design features like a forward lean and curved bases that made movement possible. Concave roads across the island furt",
      "<a href=\"https://scitechdaily.com/scientists-just-solved-a-black-hole-mystery-100-years-in-the-making/\" rel=\"nofollow\" title=\"Scientists Just Solved a Black Hole Mystery 100 Years in the Making\"><img alt=\"Black Hole Plasmoids\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"389\" src=\"https://sc"
    ],
    "image_url": "",
    "titles": [
      "Scientists just proved the moai could walk, solving a 500-year mystery",
      "Scientists Just Solved a Black Hole Mystery 100 Years in the Making"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.626,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.59,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Researchers have demonstrated that the moai statues of Rapa Nui (Easter Island) were designed to be moved upright using a rocking motion facilitated by ropes and a few people. This finding is supported by experiments with replicas and 3D models, which highlight design features such as a forward lean and curved bases. Additionally, the presence of concave roads on the island further suggests that this method was used to transport the statues.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Policy Shifts Raise Concerns Amid Global Energy Transition",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 02:58:47 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Policy reversals in the U.S. have created a barrage of headlines which might create the impression that the global energy transition is reversing - this is not the case.",
      "Energy-related exports exhibit a two-way race between U.S. and China. The discrepancy may have geopolitical repercussions that disadvantage the U.S."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e759a13ae7e90b6c145a87/0x0.jpg?width=960",
    "titles": [
      "The Global Energy Transition Rolls On—Even As The U.S. Hits Reverse",
      "Is The Energy Transition Unraveling—Part 1"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.896,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Recent U.S. policy reversals have led to concerns about the global energy transition's direction, but the transition continues. The U.S. and China are competing in energy-related exports, a rivalry with potential geopolitical consequences that could disadvantage the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Prime Big Deal Days End; Walmart Continues Matching Sales",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-09T00:25:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Editor’s note:&#160;That’s a wrap, folks! As Prime Big Deal Days draws to a close, we’ll no longer be updating this article with additional deals and insights. Plenty of great deals remain, however, so be sure to check out&#160;all of our Prime Day 2.0 coverage&#160;for anything you may have missed.",
      "Walmart has proven to be a great place to shop during Amazon’s October Prime Day event, matching the prices on several discounts and marking down many other tech products that we think you’ll like. While Amazon’s event is ending soon, Walmart’s sale event, simply called “Walmart Deals,” runs through"
    ],
    "image_url": "",
    "titles": [
      "October’s Prime Day event is almost over, but our favorite deals are still live",
      "Prime Day ends soon, but these deals are still going at Walmart"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.85,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days has ended, with no further updates to deals being posted. However, many deals are still available for those interested. Concurrently, Walmart has matched several of Amazon's discounts and offered additional markdowns on tech products during the event. Walmart's sale, named \"Walmart Deals,\" will continue beyond the conclusion of Amazon's event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]