[
  {
    "title": "Helldivers 2 is locking out players who use older CPUs",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:55:50-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Players of Helldivers 2 with older CPUs have encountered issues running the game due to a requirement for AVX2 (Advanced Vector Extensions) support, a feature present in CPUs since 2013. This requirement comes from the game's developer, Arrowhead Game Studios, and publisher, Sony."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9934003359490741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4583500839872685,
    "summary": "Players of the video game Helldivers 2, developed by Arrowhead Game Studios and published by Sony, are experiencing issues if they have older CPUs lacking AVX2 support. AVX2, a feature in CPUs since 2013, is necessary to run the game."
  },
  {
    "title": "Musk threatens to sic the government on people ‘pushing’ Tesla ‘propaganda’",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:52:36-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk, during a 38-minute interview on Fox News, threatened to take action against individuals spreading negative information about Tesla, labeling it as \"propaganda.\" This statement comes amid growing protests against the company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9911389977314815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4577847494328704,
    "summary": "Elon Musk, in a 38-minute Fox News interview, threatened to take action against those spreading what he considers negative \"propaganda\" about Tesla. This follows increasing protests against the company."
  },
  {
    "title": "First Alert’s new smart smoke alarm is meant to be a Google Nest Protect replacement",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:34:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "First Alert has released a new series of smart smoke and carbon monoxide alarms compatible with Google Home, following Google's discontinuation of its Nest Protect smart smoke alarm. Google is now partnering with First Alert on this new product line."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.978334900462963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45458372511574074,
    "summary": "First Alert has launched a new line of smart smoke and carbon monoxide alarms that work with Google Home. This comes after Google ended its Nest Protect smart smoke alarm and has now partnered with First Alert for these products."
  },
  {
    "title": "Here are the best streaming service deals available right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:32:40-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In 2025, there has been a notable increase in must-see TV shows and movies available on subscription services. However, managing multiple subscriptions has become costly for many viewers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9772646838078703,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45431617095196764,
    "summary": "In 2025, there's a rise in popular TV shows and movies on subscription platforms, leading to higher costs for viewers due to multiple subscriptions."
  },
  {
    "title": "Madison Square Garden&#8217;s surveillance system banned this fan over his T-shirt design",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:10:41-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Frank Miller was banned for life from New York's Radio City Music Hall and all associated venues, preventing him from attending a concert there on his parents' wedding anniversary. He was informed of the ban before passing security."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.961980982662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45049524566550925,
    "summary": "Frank Miller was permanently banned from New York's Radio City Music Hall and its associated venues, preventing him from attending a concert on his parents' wedding anniversary. He learned of the ban before he could pass through security."
  },
  {
    "title": "A beginner’s guide to using Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Signal, a messaging app, gained significant attention after The Atlantic's editor-in-chief, Jeffrey Goldberg, was accidentally added to a group chat with top military officials discussing an airstrike. This incident occurred on Monday and has since brought the app into widespread public discourse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.954545721875,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44863643046875,
    "summary": "Signal, a messaging app, became widely discussed after The Atlantic's editor-in-chief, Jeffrey Goldberg, was mistakenly added to a group chat where top military officials were talking about an airstrike. This event took place on Monday and has since elevated the app's profile in public conversations."
  },
  {
    "title": "Here’s what military planning usually looks like — and why it doesn’t include Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T12:53:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration officials, including Secretary of Defense Pete Hegseth and Vice President JD Vance, used a Signal group chat to plan a military strike on Houthi targets in Yemen, as reported by The Atlantic."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9498778928587963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4474694732146991,
    "summary": "Officials from the Trump administration, such as Secretary of Defense Pete Hegseth and Vice President JD Vance, utilized a Signal group chat to coordinate a military strike on Houthi targets in Yemen, according to The Atlantic."
  },
  {
    "title": "King Arthur wants to automate your sourdough starter",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:51:06-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Sourdough Sidekick is a new countertop appliance designed to automatically feed sourdough starters, ensuring they are ready for baking when needed. It is a product of a collaboration by FirstBuild."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9066678238657407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43666695596643523,
    "summary": "The Sourdough Sidekick, a collaborative creation by FirstBuild, is a new kitchen appliance designed to automatically maintain sourdough starters, keeping them fed and ready for use in baking."
  },
  {
    "title": "Trump pardons ex-Nikola CEO Trevor Milton",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:39:55-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trevor Milton, the founder of Nikola Motors, was pardoned by President Donald Trump after being convicted of defrauding investors by lying about the capabilities of his zero-emission truck company, including claims about building its own electric truck, the Nikola One."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8988856279861112,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43472140699652784,
    "summary": "Trevor Milton, the founder of Nikola Motors, was pardoned by President Donald Trump. He had been convicted of defrauding investors by making false claims about his company's zero-emission trucks, specifically the Nikola One, which he said they were building."
  },
  {
    "title": "Google’s Pixel 9A will launch on April 10th",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:35:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has announced the launch of the Pixel 9A in the US, Canada, and the UK on April 10th, following a delay due to a “component quality issue.” Initially expected shortly after its March 19th reveal, the budget-friendly device will also be released in the rest of Europe at a later date."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.895793735775463,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43394843394386573,
    "summary": "Google has announced the release of the Pixel 9A in the US, Canada, and the UK on April 10th, following a delay caused by a \"component quality issue.\" Originally planned for release shortly after its March 19th reveal, the budget-friendly smartphone will also launch in the rest of Europe at a later date."
  },
  {
    "title": "Trump and Carney hold first call amid ongoing trade war",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:28:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting between the two leaders after Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and revealed intentions for a leadership meeting following Canada's forthcoming elections."
  },
  {
    "title": "Over 140 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:00:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake struck central Myanmar, causing tremors that were felt in neighboring south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, with its tremors reaching into south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Bangkok, Thailand, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising concerns about the possibility of workers being trapped within the debris."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. The events unfolded within hours of each other."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah location after two rockets were fired from southern Lebanon into northern Israel. The incidents occurred in close succession."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey following their coverage of mass protests happening in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was expelled from Turkey after reporting on widespread protests occurring across the nation."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco song \"Wiggle and Giggle All Night,\" sparking controversy over potential plagiarism."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco hit \"Wiggle and Giggle All Night,\" leading to a controversy surrounding the originality of their work."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend a recent event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is being interpreted as an effort to question the validity of the existing government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent move is seen as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans has planned protests calling for the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has organized protests demanding the resignation of Zimbabwe's President, Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has signed an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order instructing his vice-president to prioritize the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, although further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were among those who died in a recent incident, but additional information about the victims has not been made available."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she has not received any information regarding her son, who was transferred from the US to a prison in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she lacks any information about her son since his transfer from the US to a Salvadoran prison."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The music icon was murdered by the founder of her fan club. The perpetrator's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's first parole request in Texas was denied."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer was convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer has been found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's development was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The technology was developed with assistance from Russia, as reported by analysts."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested following police intervention, aided by a local resident who helped overpower the individual."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was apprehended after a local resident assisted police in subduing the individual during a police operation."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a speech in the Arctic, the President of Russia commented on Donald Trump's plans, describing them as \"serious.\" However, he clarified that these plans have no connection to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In an Arctic speech, the President of Russia referred to Donald Trump's plans as \"serious\" but emphasized they have no links to Moscow."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck amid challenges of civil war, food shortages, and a deteriorating economy, adding to the existing hardships."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has hit a region already facing civil war, food shortages, and economic decline, worsening the ongoing difficulties."
  },
  {
    "title": "'Like a ruined city': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:47:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake hit Mandalay, described by a local resident as a \"scene of a tragedy,\" according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake struck near Mandalay, causing significant damage. Local residents describe the situation as tragic, with the BBC reporting on the event."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her boldness in the music industry, crediting inspiration from artists Charli XCX and Sabrina Carpenter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer credited her bold approach in the music industry to the inspiration she received from artists Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A combination of international and national factors is challenging the government's efforts to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government's bid for re-election is facing obstacles due to a mix of global and domestic issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban Indians increasingly spending on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is growing as more urban and affluent Indians are spending more on their pets, particularly dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments from across Africa and beyond. The selection highlights the continent's rich cultural, social, and natural landscapes through powerful imagery."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's collection of photographs highlights diverse moments across Africa, showcasing the continent's rich cultural, social, and natural landscapes through powerful imagery."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that allows individuals to view their family tree in a dynamic movie format, showcasing the global movements of their ancestors over time. This innovative approach can also be applied to track the spread of diseases and analyze animal migration patterns across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that transforms family trees into dynamic movies, illustrating the global movements of ancestors over time. This method can also track disease spread and analyze animal migration patterns across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between predicted and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rain."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rain account for 60% of the unexpected difference in predicted versus actual ocean temperatures around Antarctica over many years."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and a lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that people with Long COVID often feel ignored, doubted, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from various body regions originate from different precursor cells and have distinct gene regulation. This discovery could explain vertebrates' evolutionary success by showing how skeletal diversity is genetically programmed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that vertebrates' skeletal cells come from various precursor cells and have unique gene regulation, depending on their body region. This finding suggests that genetic programming for skeletal diversity may contribute to vertebrates' evolutionary success."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a non-invasive method using terahertz (THz) imaging to visualize the cochlear structures in mice, enabling high-resolution diagnostics. This technology allows for 3D reconstructions of the inner ear, potentially improving the diagnosis of hearing loss and other conditions. The advancement could lead to the creation of miniaturized THz imaging devices, enhancing diagnostic speed, accuracy, and patient outcomes in various medical fields, including hearing loss and cancer."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a non-invasive technique using terahertz imaging to visualize mouse cochlear structures, offering high-resolution diagnostics. This method enables 3D inner ear reconstructions, potentially improving hearing loss diagnosis. The technology may lead to smaller THz imaging devices, increasing diagnostic speed and accuracy in medical fields like hearing loss and cancer."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Biology professor Mark Peifer from the University of North Carolina at Chapel Hill advocates for the inclusion of eugenics in college genetics curriculums. He believes this will help scientists counteract the misuse of science for political purposes by encouraging them to speak up."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends adding eugenics to college genetics courses. He argues this will prepare scientists to address and oppose the political misuse of scientific concepts."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from twelve parks in Dublin, Ireland, showed that the entrances of these parks contain higher levels of infective roundworm eggs than other areas inside the parks."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:53:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his position as the coach of the Memphis Grizzlies, who are presently ranked fifth in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies, who currently hold the fifth spot in the Western Conference standings."
  },
  {
    "title": "Source: Patriots planning to release LB Bentley",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The New England Patriots intend to release Ja'Whaun Bentley, a veteran linebacker and three-time team captain, on Friday, according to a source reported by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The New England Patriots plan to release Ja'Whaun Bentley, a veteran linebacker who has served as a team captain three times, this Friday. This information comes from a source cited by ESPN."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:38:41 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain has overturned the conviction of Brazilian soccer player Dani Alves for sexual assault."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging that it colluded with the university to unfairly blame him for violations, effectively making him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He accuses the NCAA and the university of collusion, claiming they unfairly made him the scapegoat for violations."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win over the Los Angeles Lakers. This dramatic shot is being hailed as one of the season's most exciting finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers. This event is celebrated as one of the most thrilling endings of the NBA season."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alex Ovechkin led the Washington Capitals in a postgame handshake with retiring Minnesota Wild goalie Marc-Andre Fleury, following their game on Thursday. This gesture was to honor Fleury's retirement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following their game on Thursday, Alex Ovechkin of the Washington Capitals led a postgame handshake to honor the retirement of Minnesota Wild goalie Marc-Andre Fleury."
  },
  {
    "title": "Lady Vols' Caldwell: Goal was to make Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kim Caldwell, who was hired as a coach at Tennessee nearly a year ago, set an immediate goal for the team to reach the Sweet 16."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kim Caldwell, appointed as a coach at Tennessee almost a year ago, aimed for the team to make it to the Sweet 16 shortly after starting."
  },
  {
    "title": "Ex-Tulane wing Williams commits to Kentucky",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kam Williams, a highly regarded shooter and former Tulane wing, has committed to transferring to Kentucky, as confirmed to ESPN. Mark Pope, Kentucky's coach, will welcome Williams to the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kam Williams, a former Tulane wing known for his shooting skills, has committed to transferring to the University of Kentucky. This move was confirmed to ESPN. He will be joining the team coached by Mark Pope."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:34:28 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, which was especially meaningful as he had been a topic of trade discussions during the offseason. His performance earned him a curtain call from Cardinals fans, acknowledging his contribution to the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amidst offseason trade discussions about him. His performance was celebrated with a curtain call from Cardinals fans, recognizing his significant contribution to the game."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:41:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The latest Sweet 16 player rankings have sparked interest in whether Paige Bueckers, Lauren Betts, or Hannah Hidalgo will claim the top spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The latest Sweet 16 player rankings have generated excitement around who will be ranked number one among Paige Bueckers, Lauren Betts, and Hannah Hidalgo."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:41:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's basketball team in their pursuit of a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team in their quest for a championship title."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup in the basketball tournament was partially decided after Thursday's games. Four teams secured their spots, advancing closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Four teams advanced to the Elite Eight in the basketball tournament after Thursday's games, moving closer to competing for the championship."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in just four days. This rapid conversion involved significant logistical and operational efforts to accommodate a major league game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' Opening Day ballpark was quickly set up at the Yankees' spring training facility in Tampa, completed in just four days. This swift transformation required extensive logistical and operational planning to host a major league baseball game."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 13:23:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, the league has experienced a record number of 3-point shot attempts, raising questions about whether there should be measures to limit the use of 3-pointers in games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record-breaking number of 3-point shot attempts, leading to discussions on whether there should be rules to restrict 3-pointers in basketball games."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a game against Travis Hunter, showcasing his potential for an NFL future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, highlighting his NFL prospects."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder who previously battled depression is now aiming to qualify for the 2026 Olympics. Her journey towards qualification will continue at the World Championships on Saturday, where she seeks to secure her spot, having rediscovered her passion for the sport."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, who overcame depression, is working towards qualifying for the 2026 Olympics. She will compete in the World Championships on Saturday, aiming to secure her spot. Her journey reflects a renewed passion for snowboarding."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are focusing on whether there is a trend towards cleaner gameplay in sports or if referees are becoming more lenient in their officiating. Various perspectives are being shared to understand these observations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Discussions among players, executives, and analysts are exploring whether sports are experiencing cleaner gameplay or if referees are showing more leniency in their officiating. Different viewpoints are being considered to comprehend these trends."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as teams' performances through April 17 have been evaluated by a panel. Votes from this panel have contributed to solidifying the standings, providing a clearer picture of the teams' positions as the playoffs approach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "As of April 17, a panel has reviewed teams' performances, influencing the playoff standings through their votes. This evaluation has clarified which teams are in a stronger position for the upcoming playoffs."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, playing for Fulham, has had an exceptional season, establishing himself as one of the top left backs globally. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has had an outstanding season, earning recognition as one of the top left backs in the world. He aims to achieve notable successes with the U.S. national team."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue involved an unexpected series of events. Since his arrival, he has fully embraced his experience at the university, with no regrets about the path that led him there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue was marked by unforeseen events. Despite this, he has fully embraced his time at the university and has no regrets about how he arrived there."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears, a team that used to dominate their sport, have overcome significant challenges and a period of hardship, including a tragic event, to once again be considered contenders for a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears, a team with a history of success, faced a series of challenges and a tragic event, leading to a difficult period. They have now overcome these obstacles and are once again seen as potential champions in their sport."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has expressed that the speculation surrounding his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States and Real Betis midfielder Johnny Cardoso stated that rumors about a possible move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:12:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources reported by ESPN. This decision comes despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:12:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating legal action against the Canadian Soccer Federation due to a significant knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering taking legal action against the Canadian Soccer Federation following a severe knee injury suffered by their player, Alphonso Davies."
  }
]