[
  {
    "title": "Samsung’s latest stick vac can alert you to calls and text messages",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T22:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Samsung has released the Bespoke AI Jet Ultra, a new cordless stick vacuum priced at $1,099, featuring an LCD display control panel. This innovation aims to ensure users don't miss notifications on their phone or smartwatch while vacuuming."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9978958999421297,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45947397498553244,
    "summary": "Samsung launched the Bespoke AI Jet Ultra, a cordless stick vacuum with an LCD display control panel, priced at $1,099. The device is designed to display notifications from a user's phone or smartwatch, ensuring they don't miss important alerts while vacuuming."
  },
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff members share their experiences with various products, ranging from recent purchases to items they've owned for years or even decades. The discussion includes a wide array of smart technology, office equipment, and kitchen gadgets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7289028438310186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3922257109577546,
    "summary": "Verge staff members discussed their experiences with a variety of products they've recently bought or have owned for years, covering smart technology, office equipment, and kitchen gadgets."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. The sale, which includes discounts on gardening supplies and bedding, is ongoing and will conclude on Monday, March 31, 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.549111176701389,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3472777941753472,
    "summary": "Amazon's Big Spring Sale, featuring discounts on gardening supplies and bedding, has begun and will end on Monday, March 31, 2025. This sale marks the arrival of the warmer months."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a challenging yet rewarding experience. The game has been recognized for its precision in gameplay, marking a significant achievement in the franchise's evolution."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4978958985069444,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3344739746267361,
    "summary": "Assassin's Creed Shadows has introduced new advanced stealth and assassination mechanics, enhancing the gameplay experience. It has been praised for its precision, marking a significant development in the franchise."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is a gaming laptop aimed to rival the MacBook Pro, featuring a return to a slimmer and lighter design compared to its previous generation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.45622923137731475,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32405730784432873,
    "summary": "The Razer Blade 16 is a new gaming laptop designed to compete with the MacBook Pro, offering a lighter and slimmer build than its predecessors."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, doubles as a versatile work lamp suitable for various settings needing additional light. It features a rechargeable, compact design with three adjustable LED panels that emit up to 3000 lumens, ideal for illuminating areas like campsites, workspaces, or engine blocks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.1722940457407408,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2530735114351852,
    "summary": "BougeRV has released a new LED lantern designed for outdoor camping and versatile enough for use as a work lamp. It has a rechargeable, compact design and includes three adjustable LED panels that can emit up to 3000 lumens, making it suitable for lighting up campsites, workspaces, or engine blocks."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Efforts to find survivors are being hindered by a severe shortage of necessary equipment, inconsistent communication capabilities, and extensive damage to roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescue operations are facing challenges due to a lack of essential equipment, poor communication infrastructure, and significant road damage, making it difficult to locate and assist survivors."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military for bombing areas during rescue operations, describing the action as \"incredible\" in a negative sense during an interview with the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur criticized the military in a BBC interview for bombing areas during rescue operations, describing these actions as negatively \"incredible.\""
  },
  {
    "title": "Kink and LGBT dating apps exposed 1.5m private user images online",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:10:16 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Explicit images are being stored in an unprotected manner, lacking password security, which makes them susceptible to potential hacking incidents."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Explicit images are stored without password protection, making them vulnerable to hacking."
  },
  {
    "title": "Israel-Hamas ceasefire back on table in new negotiations",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 01:02:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hamas has reportedly accepted proposals from mediators aimed at addressing ongoing issues, while Israel has responded by presenting its own counter-proposal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Hamas has agreed to proposals from mediators to address ongoing conflicts. In response, Israel has submitted a counter-proposal."
  },
  {
    "title": "Protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pro-democracy demonstrators rallied in support of Ekrem Imamoglu, a detained opposition leader."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Pro-democracy demonstrators gathered to support Ekrem Imamoglu, an opposition leader who has been detained."
  },
  {
    "title": "The US firms backing Trump's fight over trade",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:03:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Many businesses agree with President Trump that there are issues with unfair trade practices. However, there is debate about whether his strategy of implementing reciprocal tariffs is the most effective solution."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Businesses acknowledge concerns over unfair trade practices highlighted by President Trump, but opinions are divided on the efficacy of his reciprocal tariffs strategy as a solution."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya has temporarily closed its doors following reports from customers who discovered an insect and a rat in their meals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a dining establishment, has temporarily shut down after customers reported finding an insect and a rat in their food."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul announced that Ms. Hall is currently under the protection of Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul stated that Ms. Hall is now under the protection of Qatari officials and is anticipated to return home in the near future."
  },
  {
    "title": "No survivors after plane crashes into house in Minnesota",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 22:44:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A plane crash occurred, and officials have not confirmed the number of passengers. The local fire chief reported that there were no survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A plane crash was reported with officials yet to confirm the number of passengers on board. The local fire chief stated that there were no survivors."
  },
  {
    "title": "US marine park investigated over animal-welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year, according to reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have died at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 21 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase do not belong to Somalia and therefore cannot be offered by it to others."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that the Berbera port and airbase, which it claims do not belong to Somalia, cannot be offered by Somalia to any other parties."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have expressed their distress in interviews with the BBC, sharing their experiences and the emotional impact of their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have shared their distress and the emotional toll of their loved ones' disappearances in interviews with the BBC."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He had served less than a year of his sentence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, previously sentenced to 20 years in prison, has been pardoned for health reasons after serving less than a year of his sentence."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation into diversity and inclusion initiatives as part of a wider examination of such programs."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk in the Danish territory, Andrew Harding discovered that many locals feel pressured or bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During his visit to Nuuk in Greenland, a Danish territory, Andrew Harding found that numerous locals report feeling pressured or bullied by the United States."
  },
  {
    "title": "Why British boarding schools are so eager to open in Nigeria",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 01:24:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rising school fees in the UK have led Nigeria's elite to opt for British education for their children domestically, avoiding the need to send them abroad for schooling."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Due to increasing school fees in the UK, Nigeria's elite are increasingly choosing British-style education for their children within Nigeria, rather than sending them abroad."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, leading to ongoing rescue efforts to extract individuals trapped in the debris."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, triggering rescue operations to save people trapped in the rubble."
  },
  {
    "title": "Snow White, Rachel Zegler and a toxic debate that's not going away",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:40:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 23-year-old lead actor of Disney's latest remake has sparked significant debate and controversy on social media platforms."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The 23-year-old lead actor of Disney's recent remake has become the center of widespread debate and controversy on various social media platforms."
  },
  {
    "title": "Bringing the forgotten weavers back into the rich tapestry of Indian textiles",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 23:55:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Curators are innovating to showcase India's diverse textile heritage, highlighting the country's rich traditions in the field."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Curators are introducing new methods to display India's rich textile heritage, emphasizing the country's long-standing traditions in textiles."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An earthquake caused significant destruction due to its magnitude and the extent of the fault line it occurred along."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An earthquake resulted in considerable damage due to its large magnitude and the length of the fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A massive earthquake struck central Myanmar, causing extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A powerful earthquake hit central Myanmar, resulting in widespread damage throughout the area."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An upcoming eclipse will not be total anywhere globally, but certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An upcoming eclipse will be nearly total in some parts of Canada, though it will not reach totality anywhere in the world."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers received applause as they successfully carried 30-year-old Phyu Lay Khaing on a stretcher to safety."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was rescued and carried to safety on a stretcher, receiving applause from onlookers."
  },
  {
    "title": "Clayton's late flurry sends Florida into Final Four",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Florida All-American guard Walter Clayton Jr. played a pivotal role in leading a late comeback against Texas Tech, securing the Gators a spot in the Final Four."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Florida All-American guard Walter Clayton Jr. was instrumental in a late comeback victory over Texas Tech, ensuring the Gators advanced to the Final Four."
  },
  {
    "title": "Bueckers takes over, drops 40 as UConn rolls on",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers made history as the first UConn player to score 40 points in an NCAA tournament game, leading the Huskies to an 82-59 victory over Oklahoma in the Sweet 16."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers set a record by becoming the first UConn player to score 40 points in an NCAA tournament game, helping lead the Huskies to an 82-59 win over Oklahoma in the Sweet 16."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st in 'crazy' 20-9 win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit nine home runs in a 20-9 victory over the Brewers, with four homers off Nestor Cortes in the first inning alone, during Saturday's game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees secured a 20-9 win against the Brewers, setting a notable performance with nine home runs, including four in the first inning off pitcher Nestor Cortes, in Saturday's game."
  },
  {
    "title": "Messi scores 2 minutes into return in Miami win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lionel Messi scored a goal just two minutes after entering the game as a substitute, leading Inter Miami to a 2-1 victory over the Philadelphia Union at Chase Stadium on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lionel Messi scored a goal two minutes after coming on as a substitute, securing a 2-1 win for Inter Miami against the Philadelphia Union at Chase Stadium on Saturday."
  },
  {
    "title": "TCU wins as Van Lith into Elite Eight for 5th time",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hailey Van Lith scored 26 points, leading TCU to a 71-62 victory against Notre Dame in the Sweet 16 round of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith scored 26 points, leading TCU to a 71-62 win over Notre Dame in the Sweet 16 of the women's NCAA tournament."
  },
  {
    "title": "Auburn's Pearl not buying Izzo, MSU as underdogs",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Auburn coach Bruce Pearl stated he will not view Michigan State as an underdog in the NCAA tournament, highlighting the program's historical success in the competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Auburn coach Bruce Pearl emphasized that he does not consider Michigan State an underdog in the NCAA tournament, citing the program's strong historical performance in the event."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USWNT player Trinity Rodman has stated that she believes her back problems will not fully heal, indicating ongoing health concerns."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USWNT player Trinity Rodman has reported that her back problems are expected to persist, highlighting ongoing health issues."
  },
  {
    "title": "Ohtani tosses bullpen, but pitching 'a ways away'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:53:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Shohei Ohtani resumed throwing from a mound on his first occasion since February 25, as confirmed by manager Dave Roberts. However, Roberts noted that Ohtani's return to pitching in games is not expected soon, indicating a significant waiting period before his pitching debut."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Shohei Ohtani has started throwing from a mound for the first time since February 25, as stated by manager Dave Roberts. Despite this progress, Roberts emphasized that Ohtani's return to pitching in games will not happen quickly, suggesting a considerable delay before he can make his pitching debut."
  },
  {
    "title": "Follow live: Duke in control vs. Alabama with Final Four spot on the line",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:52:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This summary covers the events from Saturday night's games, providing updates on the action as it unfolds."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This summary reports on the outcomes of Saturday night's games, detailing the key events and results as they happened."
  },
  {
    "title": "What this historic day of home runs says about Aaron Judge, Yankees",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:59:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aaron Judge hit three home runs in a single game, contributing to a record-setting performance for the New York team. This achievement highlighted Judge's exceptional talent as a baseball player."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aaron Judge hit three home runs in a single game, leading the New York team to a record-setting performance. This feat showcased his exceptional talent in baseball."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an analysis of the implications of various matchups in sports, including their potential impact on playoff projections and draft lottery standings. It offers updated information on the playoff race and draft positions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article examines the effects of different sports matchups on playoff predictions and draft lottery rankings. It updates readers on the current standings in the playoff race and draft positions, highlighting how these matchups could influence team outcomes."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As the playoff field becomes clearer, a panel has voted on team rankings. The summary includes each team's schedule up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A panel has ranked teams as the playoff field becomes clearer, with the rankings based on each team's schedule up to April 17."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's team has been eliminated from their current competition. The focus is now shifting towards their future, specifically on enhancing the team through the transfer portal and integrating new recruits. The aim is to strengthen the Wolfpack for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's team has been eliminated from their current competition. The team is now concentrating on preparing for the next season by focusing on acquiring new talent through the transfer portal and integrating new recruits, aiming to enhance the Wolfpack's performance."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This quick conversion highlights the flexibility and adaptability of sports venues to accommodate different teams and events efficiently."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' ballpark for Opening Day, taking just four days. This demonstrates the capability of sports venues to efficiently adapt and host various teams and events."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze led Crystal Palace to a 3-0 victory over Fulham, scoring a goal and providing an assist, securing their spot in the FA Cup semifinals. The match took place on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze played a pivotal role in Crystal Palace's 3-0 win against Fulham on Saturday, scoring a goal and providing an assist. This victory secured their place in the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 21:11:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving an award of over $20 million from a jury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, the win helped the Bundesliga leaders maintain their position."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to secure a 3-2 win for Bayern Munich against St Pauli on Saturday, ensuring the Bundesliga leaders kept their top spot."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:32:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Espanyol, facing relegation, secured a 1-1 draw against third-placed Atletico Madrid in LaLiga, with Javi Puado equalizing through a penalty after Cesar Azpilicueta's first-half goal for Atletico."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol, threatened by relegation, managed a 1-1 draw against Atletico Madrid, who are third in LaLiga. Javi Puado scored a penalty for Espanyol, equalizing after Cesar Azpilicueta's goal for Atletico in the first half."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle celebrated their first major domestic trophy in 70 years with an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle marked their first major domestic trophy win in 70 years by holding an open-top bus parade through the city."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazilian Football Confederation (CBF) has fired head coach Dorival Júnior following Brazil's defeat to Argentina on Tuesday."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to Crystal Palace's starting lineup for the first time since his ear was severely injured. He played in the match on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta made his return to Crystal Palace's starting lineup in Saturday's match, marking his first game back since suffering a severe ear injury."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo appealed to FIFA on Friday, requesting the organization to reconsider its decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have formally requested FIFA to reevaluate its decision to disqualify the Mexican team from participating in the Club World Cup. This appeal was made on Friday."
  },
  {
    "title": "Transfer rumors, news: Madrid plan shocking move for Fernandes",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:29:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Transfer Talk reports on discussions about Manchester United captain Bruno Fernandes potentially replacing Luka Modric in Real Madrid's midfield, covering the latest news, gossip, and rumors surrounding the possible move."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Transfer Talk has reported on discussions regarding Manchester United captain Bruno Fernandes potentially moving to Real Madrid to replace Luka Modric in the midfield. This coverage includes the latest news, gossip, and rumors about the possible transfer."
  }
]