[
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "summary": "Mark Lowen, a journalist working for the BBC, was arrested in Istanbul during coverage of protests. Following his arrest, he was deported back to the UK.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "summary": "The current government is at risk of being the first in almost 100 years to not win re-election for a second term.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:40:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care",
    "summary": "The Trump administration plans to save $11.4 billion by stopping and retracting COVID-era grants. Addiction experts caution that this move may risk patient health by limiting access to essential treatments.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:22:09 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.388
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "summary": "Ubisoft is forming a subsidiary focused on Assassin’s Creed, Far Cry, and Rainbow Six, with Tencent acquiring a 25% stake for €1.16 billion. The subsidiary is valued at around €4 billion.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "RFK to slash 10,000 jobs in major overhaul of US health agencies",
    "summary": "The U.S. Department of Health and Human Services (HHS) has unveiled a restructuring plan after a period of turmoil and rumors about possible layoffs within the agency.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:06:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "summary": "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million. He claims the NCAA worked with the university to unfairly target him, labeling him a \"sacrificial lamb.\"",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "NWSL: Denver details plans for temporary stadium",
    "summary": "Denver's new National Women's Soccer League (NWSL) expansion team announced on Thursday their plans to build a training center and a temporary stadium, which will seat 12,000, in Centennial, Colorado.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:10:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "One room, 300 clubs, 80 agencies, 3,500 meetings: Inside soccer's secret transfer space",
    "summary": "TransferRoom, an event compared to \"speed dating\" for soccer, involves participants in brief meetings, as reported by Rob Dawson.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "'I feel like I have everything in front of me': Inside the $765 million marriage of Juan Soto and the Mets",
    "summary": "The New York Mets have signed a high-profile free agent, sparking significant attention and marking a new era for both the team and Major League Baseball (MLB) during the offseason.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:10:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Betting buzz: Gator fan's $5 parlay worth $168K ... if Duke wins",
    "summary": "A Florida Gator fan could win $168,000 if Duke wins their next game, due to a parlay bet they placed.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "summary": "Researchers have created a new statistical method that turns family trees into animated movies, showing how ancestors have moved around the world over time. This technique not only visualizes genealogical data but can also be used to model disease spread and track animal migrations globally.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "summary": "Researchers found that increased meltwater and rain around Antarctica account for 60% of the observed difference between expected and actual ocean temperatures in the region over recent decades.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "summary": "A recent study shows that people with Long COVID frequently feel ignored and doubted by their healthcare providers, reporting a lack of support in their treatment.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "summary": "Researchers discovered that in vertebrates, skeletal cells from different body regions come from various precursor cells and have unique gene regulation. This finding may explain a key aspect of vertebrates' evolutionary success.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends including eugenics in college genetics curriculums. He argues this approach will help scientists confront cases where science is misused for political reasons.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "summary": "Soil samples from 12 parks in Dublin, Ireland, revealed that park entrances contain higher levels of infective roundworm eggs than other areas within the parks.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Trump executive order seeks to 'restore' American history through Smithsonian overhaul",
    "summary": "The \"Restoring Truth and Sanity to American History\" order seeks to remove what it describes as \"divisive, race-centered ideology\" from Smithsonian museums, its educational and research centers, and the National Zoo.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:45:55 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Syria's transitional leader is a former jihadist. Can he help stabilize the region?",
    "summary": "Ahmed al-Sharaa, the founder of the Syrian branch of Al-Qaeda, is advocating for unity, according to Robert Worth of The Atlantic. Worth's report also highlights a group chat on the messaging app Signal that was utilized by the Trump administration.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:12:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "summary": "Experts caution that strong winds, dry conditions, and the presence of pine trees greatly elevate the risk of wildfires.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "summary": "The Federal Trade Commission's Bureau of Consumer Protection Director, Christopher Mufarrige, has instructed staff to cease referring to the agency as \"independent\" in complaints, according to The Verge.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "summary": "Experts predict the outcomes of the 2025 baseball season, focusing on the potential for the Dodgers to secure another victory and speculating on possible MVP candidates.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is nearing the completion of its acquisition of the Spanish football club Malaga, according to a source cited by ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "We answered the biggest college softball questions: POY, WCWS picks and sleepers",
    "summary": "Midseason analyses of college softball have led experts to spotlight teams with critical areas to improve as the season continues.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:19:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "First bets: Early picks for 2025 NFL season win totals",
    "summary": "Experts predict the opening season win totals for various sports, offering insights on early betting opportunities.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "The woman who killed Tejano music icon Selena in 1995 has been denied parole",
    "summary": "Yolanda Saldívar, who was convicted of murdering singer Selena Quintanilla-Perez in 1995, has had her parole request denied. She remains in a Texas prison.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:37:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump's new tariffs on imported cars could have a clear winner: Tesla",
    "summary": "President Trump has implemented a 25% import tariff on foreign cars, expected to increase vehicle prices. Tesla is anticipated to be less impacted than other car manufacturers by this change.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:36:20 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge accuses Trump administration of trying to undermine judiciary",
    "summary": "The Justice Department has accused Howell of displaying consistent hostility toward President Trump by halting the enforcement of one of his executive orders.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:49:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "GOP leaders accused of making threats to block bill to let new moms vote remotely",
    "summary": "Bipartisan lawmakers are advocating for a House vote on a proposal that would allow new parents to vote by proxy for 12 weeks. House Speaker Mike Johnson has opposed the proposal, raising Constitutional concerns.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:23:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "China Tries to Reboot Its Economy as Competitors Circle",
    "summary": "China's economy faces hurdles such as falling demand for its products, surplus industrial capacity, and high debt, exacerbated by a tariff conflict with the U.S. In response, the Chinese government is seeking to increase business investment, despite past tensions with entrepreneurs. Concurrently, Vietnam is capitalizing on China's economic difficulties to strengthen its manufacturing industry.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 16:43:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump pulls Stefanik nomination for U.N. ambassador because of thin GOP House majority",
    "summary": "The anticipated smooth Senate confirmation of a Republican congresswoman has hit a snag due to concerns among Republicans about preserving their narrow majority in the House of Representatives.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:33:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Food is running out in Gaza nearly a month into Israeli blockade",
    "summary": "The World Food Programme has reported that its food stock in Gaza is nearing depletion, with just five days' worth of flour left and enough of other food supplies to last for two more weeks.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:40:14 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "summary": "In the Arctic, Russia's President described Trump's plans as \"serious,\" but clarified that they have no connection to Moscow.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "summary": "The Canadian leader announced that tariffs introduced by Trump have changed the Canada-US relationship, potentially affecting future cooperation between the two countries.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "summary": "Greenland has declined proposals from JD Vance and his wife, following a promise by Donald Trump to purchase the island.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Six dead after tourist submarine sinks in Red Sea",
    "summary": "A tourist vessel sank in the Red Sea near Hurghada's tourist promenade on Thursday morning. Local authorities have reported that 39 people were rescued following the incident.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:42:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son since he was moved from the US to a detention center in El Salvador.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "summary": "Donald Trump has directed the vice president to concentrate on the Smithsonian Institution's museums.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "summary": "Several major economies, with China among them, have committed to implementing retaliatory measures against the United States. They accuse Washington of violating international trade rules.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:50:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "summary": "A new technology has been developed with the help of Russian expertise, analysts report.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "summary": "A film starring Robert Downey Jr as Doctor Doom is set to be released in May 2026.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "summary": "A suspect was arrested after being overpowered by police with the help of a local resident.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed after the child reported seeing what they thought was a \"monster.\"",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'They invited me - now they're attacking me': Signal chat journalist speaks to BBC",
    "summary": "Jeffrey Goldberg, a journalist, was mistakenly added to a chat with senior Trump administration officials. This incident has led to him becoming a focal point in political debates.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:17:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "summary": "Poland has enacted a law that allows the government to temporarily suspend the right to seek asylum at its border with Belarus.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as reported by his party.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "summary": "Boualem Sansal, an 80-year-old, in an interview with a far-right news outlet, claimed that colonial France gave too much land to Algeria.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "summary": "Six people died after a submarine sank near Hurghada, a popular tourist destination.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "summary": "Ukrainian President Volodymyr Zelensky spoke about Europe's backing for Ukraine, emphasizing the nation's resilience amid challenges.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "summary": "The pet care industry in India is expanding as wealthier, city-dwelling Indians increasingly invest in products and services for their pets, particularly dogs and cats.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "summary": "A South East Asian country is ranked third for having the largest trade surplus with the United States, with only China and Mexico ahead of it.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How will Australia choose its next prime minister?",
    "summary": "The nation will hold elections on 3 May, where voters will participate in choosing their representatives. This guide offers an overview of the electoral process and highlights important aspects for voters to consider as they prepare to vote.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:44:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "India: Why are private firms not investing despite record profits?",
    "summary": "A report has found that plans for economic growth are being affected by two main factors: limited domestic consumption and low demand for exports.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:29:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ros Atkins on... Trump's plan for Greenland",
    "summary": "US Vice-President JD Vance is set to visit Greenland on Friday, highlighting the United States' increasing focus on the territory. The details behind this interest were not specified.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:35:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Satellite images reveal how South Korea wildfires spread",
    "summary": "BBC Verify reported on the rapid spread of wildfires in Korea, highlighting the role of environmental and climatic factors in accelerating their expansion.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:03:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Watch: How the South Korea wildfires became so deadly",
    "summary": "Rachel Lee of the BBC conducted an investigation into the rapid spread of wildfires, identifying and analyzing the various factors that contribute to their expansion.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:01:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "summary": "Technology advancements have led to the creation of intelligent machines like self-driving cars and robot vacuums. Although fully autonomous humanoid robots are still expensive, robot vacuums have become a widely accessible solution for automating home cleaning tasks.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "summary": "Amazon's Big Spring Sale, the first major sales event of 2025, is happening now through March 31st. It features significant discounts on a wide range of products, such as gardening supplies and bedding.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "summary": "Nintendo has announced \"Switch 2 Edition\" games after its Nintendo Direct stream. The details were shared on its website, focusing on the new Virtual Game Card lending system.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "summary": "On Thursday, the White House initiated Podcast Row, an event designed to connect conservative podcasters with senior officials from the Trump Administration. This move, aimed at incorporating alternative media into its communication strategy, signifies the administration's plan to make such interactions a regular feature.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "summary": "Amazon's Big Spring Sale features discounts on e-readers, including the first color model. The Kindle Scribe, notable for its note-taking feature, is available at its lowest price for the 16GB version.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "summary": "Canadian company Ploopy has released the Classic 2, an updated version of its open-source trackball mouse. The new model maintains the original's design and ergonomics but includes improved connectivity, a more precise scroll wheel, and a design that simplifies 3D printing.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "summary": "Amazon is holding its Big Spring Sale until March 31st, featuring over 90 deals on a variety of products. The sale is open to all customers, not exclusively Amazon Prime members.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The best deals on MacBooks right now",
    "summary": "Amazon's Big Spring Sale is offering major discounts on numerous gadgets, including various models of Apple's MacBooks with M-series chips. Notably, the M1 MacBook Air is no longer available.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Panama approves embattled ex-President Martinelli’s passage to Nicaragua",
    "summary": "Ricardo Martinelli, an ex-president of Panama, was convicted of money laundering and sentenced to 10 years in jail.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:01:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "‘We won’t back down’: Global leaders threaten backlash to Trump auto tariff",
    "summary": "Canadian Prime Minister Mark Carney announced that Canada is considering a wide array of retaliatory actions in response to the imposition of 25-percent tariffs.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:33 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barcelona beat Osasuna to move three points clear in LaLiga",
    "summary": "The LaLiga leaders increased their lead to three points at the top of the standings after defeating Osasuna 3-0.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:39:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge orders Trump administration to preserve Signal texts on Houthi attack",
    "summary": "Judge James Boasberg issued a temporary restraining order to preserve all messages in a controversial chat, preventing their deletion.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:52:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "German civil servant fired for Pro-Palestinian comment",
    "summary": "An individual was terminated from their employment following comments they expressed in favor of Palestine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:10:59 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Will Donald Trump take Greenland by force?",
    "summary": "The US President has shown interest in purchasing a territory from Denmark, aiming to improve global safety and security.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:05:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Iran responds to Trump letter on nuclear talks, state media reports",
    "summary": "Iran's foreign minister has indicated through Oman that Iran is willing to proceed with indirect negotiations, maintaining its commitment to diplomatic engagement.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:59:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Russia’s Putin eyes Arctic cooperation despite geopolitical tensions",
    "summary": "Russian President Vladimir Putin stated that US President Donald Trump was serious about wanting to buy Greenland.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:39:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Pro-Palestinian student awaits court ruling on deportation from the US",
    "summary": "Momodou Taal, a PhD student at Cornell University, faces deportation from the United States.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:31:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Families say loved ones wrongly deported from US based on tattoos",
    "summary": "In Venezuela, there is controversy over tattoos being mistakenly associated with gang activity. This misinterpretation has resulted in individuals facing accusations and, in some cases, deportations, despite tattoos often being harmless and not indicative of criminal affiliations.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:09:43 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French-Algerian author Boualem Sansal sentenced to five years in prison",
    "summary": "Algeria has jailed a writer for remarks on the Morocco border, heightening tensions with France.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:21:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israel’s parliament passes law to expand control over judge appointments",
    "summary": "Israel's government has enacted changes to its judiciary system, sparking a new series of protests and raising concerns about the potential effects on the country's democratic framework.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:20:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Colombia and the US agree to collect and share biometric data for migrants",
    "summary": "Homeland Security Secretary Kristi Noem announced a memorandum focused on decreasing undocumented migration. This action is part of efforts to enhance immigration enforcement.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:17:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mbappe, Vinicius among four Real Madrid players being investigated by UEFA",
    "summary": "UEFA is investigating four Real Madrid players for alleged 'indecent conduct' after a match with Atletico Madrid.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:03:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five wounded in Amsterdam stabbing attack, police say",
    "summary": "Dutch police have arrested a suspect after an attack occurred near Dam Square in Amsterdam.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:10:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who’s winning the global race for critical minerals?",
    "summary": "US President Donald Trump has invoked wartime powers to boost the production of essential minerals.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "France’s Macron says not all European countries agree on force for Ukraine",
    "summary": "French President Macron has proposed the establishment of a 'reassurance force' aimed at addressing global security challenges. In a related context, the UK's opposition leader, Starmer, has accused Russia of undermining international stability through disruptive actions.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:05:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who are the students Trump wants to deport?",
    "summary": "Former President Donald Trump targeted several students, including Rumeysa Ozturk, Mahmoud Khalil, and Badar Khan Suri.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "South Sudan opposition says vice president’s arrest ends peace deal",
    "summary": "A power-sharing deal between South Sudan's leaders, Kiir and Machar, has failed, leading to concerns about the potential return of civil war in the country.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:56:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "US immigration officials detain Turkish student over pro-Palestine views",
    "summary": "A video has emerged displaying US federal agents, including both masked and plainclothes individuals, apprehending a Turkish PhD student from Tufts University.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:35:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Kids Under Fire",
    "summary": "American doctors volunteering in Gaza have reported a concerning trend of children being shot by the Israeli military.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:30:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
    "summary": "Over the past year, Europe has increased its imports of Russian gas, as reported by the energy think tank Ember. This surge in imports has resulted in billions of dollars flowing to Russia, which may be aiding its military activities in Ukraine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:25:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What’s happened in Sudan’s civil war after new Khartoum battles?",
    "summary": "The Sudanese army is targeting major successes in the capital as a key point in its conflict with the RSF paramilitary group.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:07:48 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Men's Sweet 16 live tracker: Highlights, updates and more",
    "summary": "The NCAA basketball tournament has narrowed down from 68 teams to 16. Four games are set to take place on Thursday as the competition advances.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:22:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in an East Region semifinal. Mark Sears was the leading scorer in this achievement, surpassing a record that had stood for 35 years.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "summary": "In his first game with the Mets, Juan Soto struck out with two outs in the ninth inning, failing to tie the game. This led to a 3-1 win for the Astros.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UF reaches Elite Eight after rolling past Maryland",
    "summary": "Top-seeded Florida defeated No. 4 seed Maryland 87-71 in the NCAA tournament's West Region semifinal, led by Will Richard and Alijah Martin. Richard scored 15 points and Martin added 14 points and seven rebounds. Florida's victory was highlighted by a strong second-half performance, advancing them to the West Region final.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "summary": "Nolan Arenado hit a significant home run in the eighth inning on Thursday, sparking celebration among Cardinals fans, who gave him a curtain call. This moment comes after offseason trade speculation involving Arenado.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Harper's HR silences boos in Phillies' win vs. Nats",
    "summary": "On Opening Day, Bryce Harper of the Phillies was booed by Nationals fans. Despite this, he hit a solo home run, helping his team secure a 7-3 win against his former club.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "summary": "Former NFL player LeShon Johnson has been charged with federal offenses linked to dogfighting, after 190 dogs were confiscated from his property last year.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Crosby breaks Gretzky's point-per-game record",
    "summary": "Sidney Crosby has broken the NHL record for maintaining a point-per-game average over his career, surpassing Wayne Gretzky's record.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:43:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The Calipari divorce worked out not only for Kentucky, but for Arkansas and BYU, too",
    "summary": "Recent coaching changes in three sports teams have resulted in all of them advancing to the second weekend of their respective competitions.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "From a famed Russian basketball academy to Provo, Egor Demin is dialed in",
    "summary": "Demin, after traveling globally to pursue his dream, is on the verge of guiding Brigham Young University (BYU) to a notable accomplishment.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "summary": "NBA insiders are examining important questions regarding the league's top awards, with a particular focus on the MVP competition between Nikola Jokic and Shai Gilgeous-Alexander.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "summary": "This basketball season has seen a record number of 3-point shot attempts, leading to debates about potentially limiting 3-point shots in the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "summary": "The news highlights the ambition of various teams to significantly impact their respective fields by 2025. It focuses on teams across different standings and expectations, emphasizing their goals for improvement and success within the next two years.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "summary": "The latest Sweet 16 player rankings are centered on the competition among Paige Bueckers, Lauren Betts, and Hannah Hidalgo for the top spot.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players for the Notre Dame basketball team, driving the team's success this season with their standout performances. They are leading the team towards a potential championship.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "summary": "Mike Tannenbaum, in a hypothetical scenario, made first-round selections for an unspecified sports-related event while symbolically acting as a General Manager.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "summary": "Recent allegations have sparked concerns in college sports about the possibility of more athletes being affected.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "summary": "The top goal scorers in Europe's major football leagues—Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1—have been identified, showcasing the players with the highest number of goals in their respective competitions to date.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, is not currently receiving offers from other clubs, suggesting he is likely to remain with the team for the foreseeable future.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "summary": "Barcelona's women's team reached the Women's Champions League semi-finals by winning 6-1 against VfL Wolfsburg in the quarter-final second leg at home, securing a 10-2 win on aggregate.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "summary": "Premier League clubs will benefit from a 10-day early transfer window in June aimed at preparations for the FIFA Club World Cup. The transfer window will then reopen on June 16, as confirmed by the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "summary": "Manchester City has decided to postpone any decisions regarding Claudio Echeverri's future at the club until the summer, as reported by ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Davies' agent slams Canada staff over ACL tear",
    "summary": "Alphonso Davies' agent has criticized Canada's soccer staff, claiming they pressured Davies to play against the United States before he was fully recovered, resulting in a torn ACL injury for the player.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Transfer rumors, news: Griezmann plans to stay at Atletico, eyes MLS for 2026",
    "summary": "Antoine Griezmann has chosen to stay with Atletico Madrid, delaying a potential move to the MLS until 2026, as reported by Transfer Talk's recent updates on football transfers and rumors.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "For Notre Dame and Marcus Freeman, writing a different ending is the final step",
    "summary": "The Fighting Irish team, after reaching the national title game last season, is concentrating on their preparation and strategy for the upcoming season. Their goal is to improve upon their previous success.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:37:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "A pair of Queens: Maryland star Derik Queen signs NIL deal with Dairy Queen",
    "summary": "The Terrapins moved on to the Sweet 16 following a win against Colorado State in the round of 32, thanks to a buzzer-beater shot by their star center.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'Richie's Tater Shots': BYU's Saunders signs NIL deal with company founded by great-grandfather",
    "summary": "Saunders' great-grandfather was one of the founders of Ore-Ida, the company known for creating the Tater Tot.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "summary": "An MMA coach and a betting insider have provided their predictions for this week's UFC Fight Night, detailing their opinions on which fighters have the upper hand in the scheduled matches.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:02:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What the numbers tell us about Mayer vs. Ryan and Zepeda vs. Farmer",
    "summary": "On Saturday, there will be two major rematch fights taking place, one in Las Vegas and the other in Mexico. These matchups have been analyzed in detail, focusing on various statistics relevant to the fighters and their previous encounters.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mikaela Mayer-Sandy Ryan rivalry explained: All you need to know",
    "summary": "The upcoming rematch between Mayer and Ryan on Saturday is marked by heightened tension due to a past incident involving paint, adding a personal edge to their competition.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "summary": "The UFL season starts on Friday night, with all participating teams set to challenge Birmingham's top spot in the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Logos, coaches, key players and more",
    "summary": "The UFL is kicking off its second season, showcasing various teams along with their respective coaches and standout players. This event signifies the ongoing efforts of the league to unite and display talent from across the sport.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  }
]