[
  {
    "title": "Trump Begins Second UK State Visit, Hosted by King Charles and Queen Camilla",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 07:05:53 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Financial Times",
      "Al Jazeera",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.ft.com",
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US President Donald Trump and his wife Melania are in the UK for an unprecedented second state visit.",
      "The visit comes as the UK and US prepare to sign a landmark technology agreement.",
      "The US president is due to meet both King Charles III and British Prime Minister Keir Starmer. Demonstrations are planned in Windsor and central London to protest against the two-day visit of Donald Trump.",
      "Jeffrey Epstein affair will hang heavily over trip after Sir Keir Starmer’s sacking of Lord Peter Mandelson",
      "The president and first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also meet the prime minister at his country residence, Chequers.",
      "The president and the first lady will be hosted at Windsor Castle by King Charles III and Queen Camilla.",
      "<p>US president arrives on Tuesday ahead of a lavish programme, as Sadiq Khan calls for UK leaders not to shy away from ‘being critical’</p><p>Donald Trump has landed in the UK ahead of an unprecedented second state visit.</p><p>The US president and the first lady, Melania Trump, touched down on Tue"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9d3a/live/1ad58ef0-51b1-11f0-b52c-c776a241c026.jpg",
    "titles": [
      "What is the President doing on his visit to the UK?",
      "US President Donald Trump arrives in UK for second state visit",
      "Trump lands in UK for second state visit",
      "Pomp and protest: Donald Trump starts second UK state visit",
      "President Trump’s State Visit to the UK: What to Know",
      "President Trump’s 2nd U.K. State Visit: What’s on the Agenda",
      "Donald Trump lands in UK for second state visit as protesters gather in Windsor"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.956,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.841,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump arrived in the UK for a historic second state visit, during a sensitive time for the UK government. He and the First Lady are hosted by King Charles III and Queen Camilla at Windsor Castle, and will also visit the Prime Minister's residence, Chequers. The visit features displays of royal and military pageantry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Report Accuses Israel of Genocide in Gaza, Calls for Action",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 10:26:15 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Washington Post",
      "New York Times",
      "Al Jazeera",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.bbc.co.uk",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The report issued Tuesday by experts commissioned by the United Nations' Human Rights Council calls on the international community to end the genocide and take steps to punish those responsible.",
      "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "Israel has dehumanised Palestinians for decades, eventually leading to the current Gaza genocide, say analysts.",
      "<p>Report cites scale of killings and aid blockages, and calls on member countries to punish those responsible</p><p>A UN commission has found that Israel is committing genocide in Gaza, citing tens of thousands of civilian deaths and massive destruction, and has called on member countries to punish",
      "Israel rejected the conclusions, which echo those of a growing group of governments and human rights organizations.",
      "In earlier reports, the commission found that Israel had committed war crimes and crimes against humanity in its conflict with Hamas, but stopped short of calling it genocide. Israel denounced the accusation as “fake.”"
    ],
    "image_url": "",
    "titles": [
      "A U.N. inquiry accuses Israel of genocide in Gaza, joining a rising chorus",
      "Israel Committing Genocide in Gaza Says UN Commission",
      "Dehumanisation: How Israel is able to commit its genocide in Gaza",
      "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "U.N. commission finds that Israel committed genocide in Gaza",
      "Israel Is Committing Genocide in Gaza, U.N. Inquiry Says"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.69,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.813,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A UN Human Rights Council-commissioned report has accused Israel of committing genocide against Palestinians in Gaza, finding that four out of five genocidal acts defined under international law have occurred. The report, which Israel has denounced as \"false and fabricated,\" calls for international action to punish those responsible. This marks an escalation from previous findings that identified war crimes and crimes against humanity but did not label the actions as genocide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Charged in Killing of Activist Charlie Kirk, Death Penalty Sought",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 03:15:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Axios",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com",
      "www.dw.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Utah prosecutors said they will seek the death penalty for Robinson.",
      "The charge of aggravated murder means the suspected shooter could face the death penalty if convicted of killing right-wing activist Charlie Kirk at an event last week.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5PdmdWVDBvSzVIRDNxeE1EZ1ZIbWd2MW5EU3VNNTJaa2paZlVvQ3hOdFY1Ujl6NjNuZmJvamxNSVdISmZMd2dxUE11Skl3RW1xdWtjM3BSVGNfX3BQU3huM2ZJd2NUSWZIOVJXRm5rbFQ1dGhqQmNIWW5zSU9FWm8?oc=5\" target=\"_blank\">Prosecutors to seek death penalty for suspect in Charlie",
      "Robinson's roommate told police he left a note saying \"I had the opportunity to take out Charlie Kirk, and I'm going to take it,\" the Utah County attorney said.",
      "<p>This blog is now closed.</p><ul><li><p>Full report: <a href=\"https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shooter-charged\">Kirk suspect charged with aggravated murder by Utah prosecutors</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shoot"
    ],
    "image_url": "",
    "titles": [
      "Charlie Kirk shooting: Tyler Robinson’s messages and charges against him",
      "Charlie Kirk shooting suspect faces death penalty",
      "Prosecutors to seek death penalty for suspect in Charlie Kirk killing - Axios",
      "Charlie Kirk shooting suspect Tyler Robinson charged with murder, faces possible death penalty",
      "Charlie Kirk murder suspect told he faces death penalty if convicted in first appearance – as it happened"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.901,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tyler Robinson has been charged with aggravated murder and felony discharge of a firearm in Utah for the fatal shooting of conservative activist Charlie Kirk. Prosecutors are seeking the death penalty, citing the severity of the crime. Robinson, accused of killing Kirk due to his far-right views, made his first court appearance this week. President Donald Trump has also called for Robinson to face the death penalty. Evidence suggests Robinson was motivated by a desire to stop Kirk's \"hatred.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madeleine McCann Suspect Released from Prison on Unrelated Charges",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 07:22:33 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Christian Brückner has never been charged with any crime in relation to the McCann case.",
      "A German suspect in the case of Maddie McCann's disappearance has been released from prison after serving a sentence in a separate case. German lawmakers gather to debate the 2025 budget and the country's foreign policy.",
      "<p>Authorities say they no longer have legal justification to hold Christian Brückner in jail after serving rape sentence</p><p>The main suspect in the disappearance of Madeleine McCann was freed on Wednesday as German authorities admit they no longer have legal justification to hold him in jail.</p",
      "Eighteen years after Madeleine McCann, a 3-year-old British girl, disappeared in Portugal, the man considered a suspect by Britain and Germany is being released after serving a sentence in a separate case."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b062/live/199eed10-84dd-11f0-bdc5-0bac48b207b6.png",
    "titles": [
      "Madeleine McCann suspect freed from German prison",
      "Germany updates: Madeleine McCann suspected released",
      "Main suspect in Madeleine McCann case released from German prison",
      "German Suspected in Madeleine McCann Disappearance Is Set for Prison Release"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.962,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.792,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian Brückner, the main suspect in the disappearance of Madeleine McCann, was released from prison after serving a sentence for an unrelated rape case. German authorities stated they have no legal grounds to keep him detained as he has never been charged in relation to the McCann case. This development comes eighteen years after the disappearance of 3-year-old Madeleine McCann in Portugal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Images of Trump, Prince Andrew with Epstein Projected on Windsor Castle",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 07:05:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Axios",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Images of US President Donald Trump and the UK’s Prince Andrew with Jeffrey Epstein were projected onto Windsor Castle.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxNM1RCTVg2WUtuUzlBejl6cGI1Ty1seDU1RXY3V2NEUXdfUk80MjFGR2JvbmF5M2JNYjhMbmxFTUJyMHowVGVmZVhjbzFUQ3lSRjZBOUVwN1pUNnlfVWJuWUdvZG9QbnRtcUpac3V5S01NSF9sd2ZmS0NMR1ZOOVhOM2ptUGQ5OEFTa3lzWWhUUjI?oc=5\" target=\"_blank\">Photos: Activists beam Trump, Ep",
      "President Donald Trump for months has faced criticism over a decision by the Justice Department not to release law enforcement files about Jeffrey Epstein.",
      "The president arrived in the U.K. for his second state visit, where he is scheduled to meet King Charles at his Windsor residence."
    ],
    "image_url": "",
    "titles": [
      "Trump and Epstein images projected onto UK’s Windsor Castle",
      "Photos: Activists beam Trump, Epstein images onto U.K. castle during president's visit - Axios",
      "Images of Trump and Jeffrey Epstein projected on Windsor Castle as U.S. president visits the UK",
      "Four Arrested For Projecting Trump-Epstein Images On Windsor Castle Ahead Of President’s UK Visit"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.976,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Activists projected images of US President Donald Trump and the UK's Prince Andrew with Jeffrey Epstein onto Windsor Castle amid Trump's UK visit for a meeting with King Charles. This act highlights ongoing criticism of Trump's administration's decision not to release Jeffrey Epstein's law enforcement files.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Launches Ground Offensive in Gaza, Evacuations Underway Amid Criticism",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-16T14:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Washington Post",
      "LA Times",
      "CityNews",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.latimes.com",
      "www.dw.com",
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Israeli forces have labeled Gaza City a \"dangerous combat zone.\" A UN commission's probe has concluded that Israel is committing genocide in the Palestinian enclave, a finding Israel has rejected.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPNHBLcm1aT2xqWjh0Yi1Tay1GbGg2WU05bHhoS0VUU0pvYnB4elB4N01pUFNONUdwZHZ2NHJJQng4Tm5EWVFkVExOeXpacEppZXdTRTAwM2Q4RU1lVjl4X2R3YmNiYnJwa256UThlcW9WaVBiU1pkdHFQWGUzZ1c5RmR5QQ?oc=5\" target=\"_blank\">Israel launches ground offensive to occupy Gaza C",
      "<p>The Israeli military said the route via Salah al-Din street ‘will be open for 48 hours only’</p><p>The <strong>United Nations</strong> estimated at the end of August that around one million people lived in <strong>Gaza</strong> <strong>City</strong> and its surroundings.</p><p>Agence France-Press",
      "<p>IDF says advance aims to ‘dismantle Hamas’s grip’ as UN report says Israel has committed genocide in territory</p><p>Israel unleashed its long-threatened ground offensive in Gaza City on Tuesday, sending tanks and remote-controlled armoured cars packed with explosives into its streets, in defianc",
      "Palestinians in Gaza City reported a night of heavy bombardment. A U.N. commission said Israel was committing genocide in Gaza; Israel rejected the claim as “falsehoods.”",
      "<p>Weeks of intense bombardment that all but leveled the Gaza Strip's largest urban center made way for what Israeli military officials said was the ground maneuver phase of the operation to occupy the city.</p>",
      "JERUSALEM (AP) — Israel launched its offensive in Gaza City on Tuesday, vowing to overwhelm a city already in ruins from nearly two years of war as thousands of Palestinians fled in vehicles strapped with mattresses and other belongings that clogged a coastal road. The operation into the largest Pal"
    ],
    "image_url": "",
    "titles": [
      "Israel says 'Gaza is burning' as it starts ground offensive",
      "Israel launches ground offensive to occupy Gaza City - Axios",
      "Israel says it has opened ‘temporary’ route for residents to flee Gaza City after launching ground offensive – Middle East crisis live",
      "Israel launches ground offensive deep inside Gaza City",
      "Israeli military begins ground invasion of Gaza City",
      "Israel begins ground offensive in Gaza City with thousands of troops",
      "Israeli military begins its ground offensive in Gaza City as thousands of Palestinians flee"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.693,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel has initiated a ground offensive to occupy Gaza City, declaring it a \"dangerous combat zone\" and prompting the evacuation of thousands. This action follows a UN commission's conclusion that Israel is committing genocide in Gaza, a claim Israel disputes. The offensive has led to international criticism and warnings of a worsening humanitarian crisis. Reports indicate heavy bombardment in Gaza City and at least 38 Palestinian casualties, including women and children. The operation, aimed at dismantling Hamas's control, has significantly escalated the conflict, with further troop advanceme",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Charged in Killing of Activist Charlie Kirk, Death Penalty Sought",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 22:34:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "LA Times",
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.latimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Authorities charge Tyler Robinson with aggravated murder and felony discharge of a firearm.",
      "Tyler Robinson, the suspect accused of assassinating conservative influencer Charlie Kirk, made his first court appearance before a Utah judge on Tuesday.",
      "Tyler Robinson, the suspect accused of assassinating Charlie Kirk, has been formally charged with a slew of offenses as prosecutors announced their intent to seek the death penalty.",
      "<p>Tyler Robinson is quoted talking to his partner about having enough of the far-right activist’s ‘hatred’ in texts</p><p>Evidence put forth by Utah prosecutors Tuesday offered the clearest indication yet of what they suspect motivated Tyler Robinson to kill far-right provocateur <a href=\"https://w",
      "<p>Prosecutors will seek the death penalty for Tyler Robinson, the 22-year-old man accused of killing conservative activist Charlie Kirk, officials announced Tuesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Prosecutors to seek death penalty for alleged Charlie Kirk shooter",
      "WATCH:  Alleged Charlie Kirk shooter makes 1st court appearance",
      "WATCH:  Utah prosecutors to seek death penalty against alleged Charlie Kirk shooter",
      "Utah prosecutors’ evidence indicates suspected motives of Charlie Kirk’s alleged shooter",
      "Prosecutors will seek death penalty for suspect in killing of Charlie Kirk"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.817,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tyler Robinson has been charged with aggravated murder and felony discharge of a firearm in Utah for the fatal shooting of conservative activist Charlie Kirk. Prosecutors are seeking the death penalty, citing the severity of the crime. Robinson, accused of killing Kirk due to his far-right views, made his first court appearance this week. President Donald Trump has also called for Robinson to face the death penalty. Evidence suggests Robinson was motivated by a desire to stop Kirk's \"hatred.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Delays TikTok Ban, Aims for US Version in Bytedance Deal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 04:55:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Ars Technica",
      "Al Jazeera"
    ],
    "domains": [
      "arstechnica.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "US president says a &#039;group of very big companies&#039; wants to buy the popular video-sharing platform.",
      "US President Donald Trump has once again postponed a deadline to ban TikTok to US users, suggesting he has reached a deal with the video platform's Chinese parent company, Bytedance. DW explains what you need to know.",
      "Trump’s TikTok deal requires US to make its own version of the app."
    ],
    "image_url": "",
    "titles": [
      "Trump announces deal with China to allow TikTok to continue operating in US",
      "Trump's deal with China, Bytedance over TikTok: What to know",
      "“China keeps the algorithm”: Critics attack Trump’s TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump has delayed the TikTok ban for US users, indicating a deal with its Chinese parent company, Bytedance. Trump and Chinese President Xi Jinping are set to discuss finalizing this deal on Friday. The agreement necessitates the creation of a US version of the app.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Extends Deadline for TikTok Sale, Averting Ban",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 16:10:09 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.npr.org",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE52VmFSaG5TRlhXcW9wdUZfUXppRlRNbHpTTzRKcldQVFNSWVZOc2VZTGYwY2FINUhUeWRCbUtZWklYOE5PUXYyQjN2cUxXaEtfRzRFZGNGc3lZQjFpRU9Xbm9rdw?oc=5\" target=\"_blank\">Trump extends TikTok deadline again as promised deal with China looms</a>&nbsp;&nbsp;<font co",
      "President Donald Trump extended a deadline on Tuesday that would require China's ByteDance to divest TikTok's U.S. business or face an effective ban in America."
    ],
    "image_url": "",
    "titles": [
      "Trump extends TikTok reprieve as deal nears",
      "Trump extends TikTok deadline again as promised deal with China looms - Axios",
      "Oracle and Silver Lake part of TikTok investor group as Trump extends deal deadline"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.777,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.724,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump has extended the deadline for China's ByteDance to sell its U.S. TikTok operations, amid indications of a potential deal regarding the app's future in the U.S. This extension delays the enforcement of a ban that would affect TikTok in America.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WWE to Host First PPV Event on ESPN with Cena, Rollins",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 17:58:20 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Check out how to watch John Cena, Seth Rollins and other WWE stars.",
      "WWE is set for its first PPV event on ESPN later this month",
      "WWE Wrestlepalooza 2025 takes place September 20 in Indianapolis with CM Punk, Seth Rollins, AJ Lee, Becky Lynch, John Cena, Brock Lesnar, and more."
    ],
    "image_url": "",
    "titles": [
      "Wrestlepalooza 2025: Date, time, channel, card, how to watch",
      "WWE Wrestlepalooza 2025: Card, date, matches, start time, rumors, location as John Cena headlines debut event",
      "WWE Wrestlepalooza Full Card, Date, Time And How To Watch"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.807,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "WWE is scheduled to host its first Pay-Per-View (PPV) event on ESPN later this month, featuring stars like John Cena and Seth Rollins. Fans interested in watching can tune into ESPN for the live broadcast.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Gets Permit for Robotaxi Tests at San Francisco Airport",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 20:43:16 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Alphabet's Waymo has obtained a permit to test its robotaxis at San Francisco International Airport.",
      "Waymo is now permitted to test its robotaxi service at San Francisco International Airport (SFO), a big win for the company as it seeks to expand its service area and tackle more popular, revenue-generating destinations. After years of back-and-forth negotiations, Waymo signed “Testing and Operation",
      "Waymo has spent years locked in back-and-forth negotiations with SFO, the biggest airport serving its home base of Silicon Valley."
    ],
    "image_url": "",
    "titles": [
      "Waymo obtains permit to test robotaxis at San Francisco International Airport",
      "Waymo gets green light for airport service in San Francisco",
      "Waymo approved to start testing autonomous vehicles at San Francisco International Airport"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.77,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alphabet's Waymo has secured a permit to test its robotaxi service at San Francisco International Airport (SFO), marking a significant expansion for the company. This development follows extensive negotiations between Waymo and SFO, reflecting Waymo's ambition to extend its service to high-traffic, revenue-generating locations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays' Bichette Out for Season with Knee Injury, Not Worst-Case Scenario",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 23:19:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Bichette, who leads the majors in hits and doubles, has a sprained PCL in his left knee",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQT3pfZmV3Y0NqaW8wdVg4SFpBdXVVVk1NRGZfaS14blhhaEZqcjBleGFEdUY3aklaT2paem5pcU9WM21YaVU4RUh1T2hsUGtGSVJtTWJybml2ZlkzTHE5WG9wZVhYdzctZm9rbXpUQS1GRk5Oc2xrTndZdGZyYUVUZTk5SDFpZw?oc=5\" target=\"_blank\">Blue Jays Get Key Injury Update on Bo Bichett",
      "<p>The Toronto Blue Jays won&#8217;t see their star shortstop back in the regular season, but they can still breathe a sigh of relief knowing they escaped the worst-case scenario.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/54089c71-8133-46bb-b810-28aa95fbb04d/bichette-getty.png",
    "titles": [
      "Bo Bichette injury update: Blue Jays shortstop out for rest of regular season, eyes return for playoffs",
      "Blue Jays Get Key Injury Update on Bo Bichette Ahead of MLB Postseason - Sports Illustrated",
      "Blue Jays’ Bo Bichette out for regular season, could return for playoffs"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.83,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bo Bichette, the major's leading hitter in hits and doubles, has a sprained PCL in his left knee, sidelining him for the remainder of the regular season. Despite this setback, the Toronto Blue Jays view the situation positively, as it is not the worst-case scenario for their star shortstop.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Jones on Injured Reserve, Jordan Mason to Lead Carries",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 22:57:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jordan Mason is expected to receive the bulk of the carries with Jones out",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSDl2d1dxQVg0TE1PWlNDcExuLTdfMEo3M1U5T3ZpaEhOY2tRYVBpWkczSkxxNU5LSnJlUGtMVXpORnRtaDJvSGptVGQwLWExajdkcUFveHliQVBDdzBWRE9wNWdGVnowbkxpZlNfaVM1NUZ5ZklnMlJPdjBNQWNrWGpQZ19nbEo0?oc=5\" target=\"_blank\">Aaron Jones Injury Update: Vikings Make Dec",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE02ZHF6SVZoaFpUb3l5TXl5THZ3eUhCVmxUNTEyM3FqYmxIYUVjSkRLT0tHeEtkVjZVVE5MT1NsTTdGMWdfOFFhZ2t2NHQxelA0ekJZWDRjbE1oWldRZHQ5blJiRFJRbGZKYk1DRmdBdmN5UQ?oc=5\" target=\"_blank\">Joe Burrow Injury: Bengals Officially Place Star QB on Injured Reserve</a",
      "<p>Top running back Aaron Jones is set to be placed on injured reserve because of a hamstring injury, according to multiple reports Tuesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/aecd0bf4-874f-497d-b6fc-3ee329836c73/a-jones-getty.png",
    "titles": [
      "Aaron Jones injury update: Vikings RB heading to injured reserve, out at least four weeks, per reports",
      "Aaron Jones Injury Update: Vikings Make Decision on Injured Reserve for Veteran RB - Sports Illustrated",
      "Joe Burrow Injury: Bengals Officially Place Star QB on Injured Reserve - Sports Illustrated",
      "Reports: Vikings to place RB Aaron Jones on injured reserve"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aaron Jones, the top running back for his team, is being placed on injured reserve due to a hamstring injury. With Jones out, Jordan Mason is expected to take over the majority of carries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PGA Tour Cancels Opener at Kapalua Due to Drought Conditions",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 18:25:46 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated",
      "Sky Sports"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.skysports.com"
    ],
    "snippets": [
      "PGA Tour cancels its season opening Sentry Tournament of Champions at Kapalua Resort Plantation Course due to course conditions.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE44UTBrbXBFQl93SVJtbnZNaURENEtoWnA2VTRSbEp1ZVg0TjVzUDBreDhHMWVsVzBfbnhGeVlKRjZiUmdOZ3BJOHdrck5lSE94MjNpdTlveUpVZ254R203ZVVfcFBMNW1lRVZZYVNZUndzaDcwNDhKUw?oc=5\" target=\"_blank\">PGA Tour Forced to Move 2026 Season Opener From Kapalua</a>&nbsp;",
      "The PGA Tour has revealed the 2026 season-opening Sentry tournament will not be contested at The Plantation Course due to an ongoing drought on the island of Maui."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c9dd0a2aa670f90bb9c1ea/0x0.jpg?width=960",
    "titles": [
      "PGA Tour Cancels 2026 Season Opening Event At Kapalua.",
      "PGA Tour Forced to Move 2026 Season Opener From Kapalua - Sports Illustrated",
      "PGA Tour season opener forced to move due to Maui drought"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.815,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The PGA Tour announced the cancellation of its season-opening Sentry Tournament of Champions at Kapalua Resort's Plantation Course due to poor course conditions. This decision is linked to an ongoing drought on the island of Maui, which has also forced the relocation of the 2026 season opener from the same venue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Clears Tom Brady in Headset Incident at Raiders Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 03:03:01 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Tom Brady did not violate any NFL rules by wearing a headset in the Raiders' coaching booth during Monday night's game, the NFL announced.",
      "<p>The NFL said Tuesday that Tom Brady did not violate any rules when he was spotted in the Las Vegas Raiders&#8217; coaching booth wearing a headset during the team&#8217;s Monday game against the Los Angeles Chargers.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL: Brady didn't violate rules in Raiders booth",
      "Tom Brady did not violate rules in Raiders’ coaching booth, NFL says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The NFL confirmed that Tom Brady did not break any rules by wearing a headset in the Las Vegas Raiders' coaching booth during their game against the Los Angeles Chargers on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indiana Fever Wins Game 2 Against Atlanta Dream, Forces Game 3",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 03:03:01 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Fever proved their resilience yet again, proving they aren't done yet after a 77-60 throttling of the Dream on Tuesday to force a winner-take-all Game 3.",
      "<p>Kelsey Mitchell scored 19 points and made four 3-pointers while Aliyah Boston added 15 points to lead the Indiana Fever past third-seeded Atlanta Dream 77-60 on Tuesday night to extend their best-of-three series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Fever leap another hurdle, stay alive in G2 rout",
      "Mitchell,  Boston help Fever stay alive with Game 2 rout over Dream"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Indiana Fever defeated the Atlanta Dream 77-60 in a crucial game, forcing a decisive Game 3 in their best-of-three series. Kelsey Mitchell led the Fever with 19 points, including four 3-pointers, and Aliyah Boston contributed 15 points to the victory. This win demonstrates the Fever's resilience and keeps their playoff hopes alive.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles' Mailata Critiques Media Focus on \"Tush Push\" After Super Bowl Rematch",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 03:03:01 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Eagles left tackle Jordan Mailata has had enough of the media narrative that his team won Sunday's Super Bowl rematch against the Chiefs because of the tush push.",
      "The Eagles ran the play seven times in Week 2 vs. Kansas City"
    ],
    "image_url": "",
    "titles": [
      "Eagles LT: Tush push chatter makes 'blood boil'",
      "Eagles OL Jordan Mailata sounds off on 'Tush Push' criticism after win over Chiefs: 'It makes my blood boil'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eagles left tackle Jordan Mailata criticized the media's focus on the \"tush push\" strategy, a play his team used seven times in their Week 2 Super Bowl rematch victory against the Kansas City Chiefs. He expressed dissatisfaction with the narrative overshadowing their win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manny Malhotra Receives Contract Extension from Vancouver Canucks",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 17 Sep 2025 01:44:15 +0000",
    "source": "Global News",
    "sources": [
      "NHL",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The Vancouver Canucks have extended Manny Malhotra, head coach of their Calder Cup-winning American Hockey League team, the Abbotsford Canucks.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPcm9iZmFjb1hxcHV5SFh1SjRLTUIxTE5hNkMxby1qVG40bGVXeG9BdElYSFRYVU5kVGJ6SG03amwwcmxVZDI2YWkzdzNRc3BVanp1T09WNFVZcmlLaWh6NF80ZnpGVWI5MUs1ei05cWozbG5xYlpoVnN3YUdyYm10Nmh0WVN0Qm54ZHE0Tw?oc=5\" target=\"_blank\">CANUCKS EXTEND ABBOTSFORD HEAD COACH "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/eb43cf95667f0938e0c847e06555c8150a50f277ff65b3f049965d46b93590ce.jpg?quality=65&strip=all",
    "titles": [
      "Canucks extend AHL head coach Malhotra",
      "CANUCKS EXTEND ABBOTSFORD HEAD COACH MANNY MALHOTRA - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.68,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Vancouver Canucks have extended Manny Malhotra, head coach of the Abbotsford Canucks, their AHL team that won the Calder Cup. Malhotra's contract extension signifies the team's commitment to his leadership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bank of England May Keep Interest Rate at 4% Amid Steady Inflation",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 06:58:55 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Figure strengthens case for Bank of England to leave interest rates unchanged on Thursday",
      "<p>Annual August rate released as Bank of England considers holding interest rate at 4% to tackle rising prices</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-busines"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1909ba41-9f3d-4b1e-afcb-4396f976c2a7.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK inflation holds steady at 3.8% in August",
      "UK inflation holds steady at 3.8% as fuel prices offset falling air fares"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Bank of England is considering maintaining the interest rate at 4% as new figures show annual inflation remained steady at 3.8% in July. This development strengthens the case for the Bank to leave interest rates unchanged during their upcoming meeting on Thursday.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Atlético Madrid to Open Champions League at Liverpool",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 02:57:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The Champions League gives Atlético Madrid a challenging opening fixture as they face Premier League winners Liverpool at Anfield in their first game of the season.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPMXhmeXVZd0x4TnpjOFVoblpFYi1LeUdxTWNtaUhyZzhNRmstN05pandWWUNGNHJKYlZRQzhhMVZicDVJQlFEUGtSNXdMTVhCNlFDcjJ2U2JTQ1JCQlFsSFZDR2x2bmgzd2tjY0hGNElfMl91X1VLVUpycGpOOEdrdjJPZzhGZw?oc=5\" target=\"_blank\">Liverpool Predicted Lineup vs. Atletico Madri"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c93a5492290c611b8eb11f/0x0.jpg?width=960",
    "titles": [
      "Atlético Madrid Expected Lineup And Team News Vs. Liverpool, Champions League",
      "Liverpool Predicted Lineup vs. Atletico Madrid: Changes Expected for European Opener - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Atlético Madrid is set to face Liverpool at Anfield in their first game of the Champions League season, challenging the Spanish club with an opening fixture against the Premier League winners.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Asian Stocks Fall as Investors Eye U.S. Rate Cut Decision",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 07:27:45 GMT",
    "source": "CNBC",
    "sources": [
      "Bloomberg",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Investors expect the U.S. Federal Reserve to cut interest rates at the end of its two-day meeting Wednesday stateside.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPZmp4elNqMmlrZG5WV09wUTdVbF93LV82SVBLMEQzOFQxdFZuS1pFSjN5bmVVZFpmRVdLSDdGeWRhYlJDOGZfMnJMQVZsM19aWDVtdXJuUFpLQURCMVA2Yl9hM1h2eklRS2JsSzk1ZGlQa1dOZHJxbklvamFpRHRFTDlHSHV6dHcyS195WUtPX2YzbGxO?oc=5\" target=\"_blank\">Asian Stocks Slip as Invest"
    ],
    "image_url": "",
    "titles": [
      "Asia markets trade mixed after Wall Street declines as investors await Fed decision",
      "Asian Stocks Slip as Investors Await Fed Decision: Markets Wrap - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Investors anticipate the U.S. Federal Reserve will lower interest rates following its two-day meeting, concluding on Wednesday. This expectation has led to a decline in Asian stock markets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Heating Causes 2/3 of Europe's Summer Heat Deaths: Study",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 04:00:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "www.theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "<p>Researchers from Imperial College London say 16,500 deaths caused by hot weather brought on by greenhouse gases</p><p>Human-made global heating caused two in every three heat deaths in Europe during this year’s scorching summer, an early <a href=\"https://www.imperial.ac.uk/grantham/publications/a",
      "A new study tracked the effects of higher temperatures in hundreds of European cities."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9fb0a8814a17bbad33faff8c67ba530f1b7dd4a9/1156_0_5760_4610/master/5760.jpg?width=140&quality=85&auto=format&fit=max&s=9761415dcf0fa9727d7b055bd6b7be35",
    "titles": [
      "Human-made global warming ‘caused two in three heat deaths in Europe this summer’",
      "Climate Change Led to At Least 16,500 Heat Deaths in Europe This Summer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A study by Imperial College London found that human-made global heating was responsible for two-thirds of the heat deaths in Europe during the summer, totaling 16,500 fatalities. This research highlights the impact of greenhouse gases on increasing temperatures in European cities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft to Invest £22bn in UK AI Infrastructure, Including Supercomputer",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 04:04:41 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "CNBC"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Microsoft is ramping up its AI investments in the U.K. as President Donald Trump embarks on his state visit this week.",
      "Microsoft is announcing that it’s investing £22 billion (around $30 billion) in the UK to help support AI infrastructure and ongoing operations from 2025 through 2028. The investment includes $15 billion in capital expenditures to build a supercomputer to support AI demand and adoption. “This will a"
    ],
    "image_url": "",
    "titles": [
      "Microsoft, Nvidia, other tech giants plan over $40 billion of new AI investments in UK",
      "Microsoft trumps Google with $30 billion investment in the UK"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.898,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Microsoft announced a £22 billion investment in the UK to enhance AI infrastructure and operations from 2025 to 2028. This includes $15 billion for a supercomputer to meet AI demand. The investment coincides with President Trump's state visit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Telescope to Probe Milky Way's Interstellar Medium",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 15:41:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "NASA's Nancy Grace Roman Space Telescope will help scientists better understand our Milky Way galaxy's less sparkly components—gas and dust strewn between stars, known as the interstellar medium.",
      "NASA’s Nancy Grace Roman Space Telescope will help scientists better understand our Milky Way galaxy’s less sparkly components — gas and dust strewn between stars, known as the interstellar medium. One of Roman’s major observing programs, called the Galactic Plane Survey, will peer through our galax"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-nasas-roman-missio.jpg",
    "titles": [
      "How NASA's Roman mission will unveil our home galaxy using cosmic dust",
      "How NASA’s Roman Mission Will Unveil Our Home Galaxy Using Cosmic Dust"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.77,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA's Nancy Grace Roman Space Telescope is set to enhance understanding of the Milky Way's interstellar medium—gas and dust between stars. Its Galactic Plane Survey will specifically focus on examining these components, aiming to provide deeper insights into our galaxy's structure and composition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta to Unveil AI Smart Glasses and Wristband at Connect Event",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 11:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Analysts and investors will be watching how the public responds to Meta's big bet on smart glasses during its Connect event.",
      "Meta is expected to unveil new versions of its AI-powered smart glasses, as well as a gesture-indicating wristband."
    ],
    "image_url": "",
    "titles": [
      "Meta Connect 2025: AI-powered smart glasses take center stage",
      "Meta Connect 2025: What to expect and how to watch"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.629,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At its Connect event, Meta plans to reveal new AI-powered smart glasses and a gesture-indicating wristband. Analysts and investors are keen to see the public's reaction to these innovations, marking a significant moment for the company's investment in wearable technology.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: innovation, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Unveils Image of Largest Star Cluster Near Earth",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 14:45:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "Westerlund 1, the biggest and closest \"super\" star cluster to Earth, dazzles in this image released on July 23, 2025. This view combines X-ray data from NASA's Chandra X-ray Observatory (in pink, blue, purple, and orange), infrared data from NASA's James Webb Space Telescope (in yellow, gold, and bl",
      "Westerlund 1, the biggest and closest “super” star cluster to Earth, dazzles in this image released on July 23, 2025. This view combines x-ray data from NASA’s Chandra X-ray Observatory (in pink, blue, purple, and orange), infrared data from NASA’s James Webb Space Telescope (in yellow, gold, and bl"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/eye-catching-star-clus.jpg",
    "titles": [
      "Image: Westerlund 1, an eye-catching star cluster",
      "An Eye-catching Star Cluster"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On July 23, 2025, NASA released an image of Westerlund 1, the largest and nearest \"super\" star cluster to Earth. The image features a combination of X-ray data from Chandra X-ray Observatory and infrared data from James Webb Space Telescope, showcasing the cluster in vibrant colors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Tests New Alt+Space Search App for Windows",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-16T12:32:10-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Google is testing a new search app for Windows. A&#160;blog post on Tuesday said the app, currently available on personal accounts via Google’s Search Labs, will allow you to use an Alt + Space shortcut to search for information from the files on your computer, in your Drive, and on the web. The app",
      "The app will allow people to use an Alt + Space shortcut to instantly search for information from their computer files, installed apps, Google Drive files, and the web."
    ],
    "image_url": "",
    "titles": [
      "Google&#8217;s new Windows desktop app brings a Spotlight-like search bar to PC",
      "Google rolls out new Windows desktop app with Spotlight-like search tool"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.721,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Google is testing a new search app for Windows that enables users to quickly search their computer files, installed apps, Google Drive, and the web using an Alt + Space shortcut. This feature is currently accessible to personal accounts through Google's Search Labs, as announced in a recent blog post.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caltech AI Speeds Up Quantum Calculations for Better Catalysts",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 16:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Catalysts play an indispensable role in modern manufacturing. More than 80% of all manufactured products, from pharmaceuticals to plastics, rely on catalytic processes at some stage of production. Transition metals, in particular, stand out as highly effective catalysts because their partially fille",
      "Caltech scientists have developed an artificial intelligence (AI)–based method that dramatically speeds up calculations of the quantum interactions that take place in materials. In new work, the group focuses on interactions among atomic vibrations, or phonons—interactions that govern a wide range o"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-method-improves-th.jpg",
    "titles": [
      "Machine learning and quantum chemistry unite to simulate catalyst dynamics",
      "Machine learning unravels quantum atomic vibrations in materials"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.783,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.432,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Caltech scientists have developed an AI-based method to significantly accelerate calculations of quantum interactions in materials, focusing on atomic vibrations or phonons. This advancement could enhance the efficiency of catalysts, which are crucial in manufacturing over 80% of all products, including pharmaceuticals and plastics, by leveraging the properties of transition metals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]