[
  {
    "title": "G20 Leaders Call for Revisions to US Ukraine Peace Plan at Johannesburg Summit",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 15:29:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Reuters",
      "Al Arabiya",
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "ABC News",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com",
      "theguardian.com",
      "dw.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Officials from the US, EU and Ukraine meet in Geneva to discuss Donald Trump's plan to end Russia's war with Ukraine.",
      "U.S. to hold talks in Geneva with Ukraine and EU countries on Trump's peace plan Axios",
      "Trump accuses Ukraine of ingratitude as officials meet in Geneva on US peace plan Reuters",
      "US, Ukraine and European officials to hold talks in Geneva on Trump’s plan to end war Al Arabiya English",
      "President Trump lashed out at Ukraine even as the talks on his peace proposal were still take place on, accusing the country’s leadership of being ungrateful for American support.",
      "In a joint statement, the leaders reaffirmed their commitment to Ukraine, which faces the prospect of losing American support if it rejects the latest proposal.",
      "Full text of European counter-proposal to US Ukraine peace plan Reuters",
      "Rubio says the Ukraine peace proposal was authored by the US Reuters",
      "Document omits some of Washington’s pro-Russia points and calls for Kyiv’s sovereignty to be respected European countries proposed a radical alternative Ukraine peace plan on Sunday that omits some of the pro-Russia points made in the original US-backed document and calls for Kyiv’s sovereignty to b",
      "Kyiv's allies are working on revisions to Washington's peace plan as US and European officials meet in Geneva. US Secretary of State Marco Rubio has hailed the talks as \"the best so far.\" DW has the latest.",
      "U.S., Ukraine make progress on Trump's peace plan, Rubio says Axios",
      "U.S., Ukrainian and European officials gathered in Switzerland on Sunday for talks on the contentious American-Russian peace plan put to Kyiv this week.",
      "US senators say Rubio told them Trump’s Ukraine peace plan is Russia’s ‘wish list’ AP News"
    ],
    "image_url": "",
    "titles": [
      "US-Ukraine talks: Why are European leaders opposing Trump’s peace plan?",
      "U.S. to hold talks in Geneva with Ukraine and EU countries on Trump's peace plan - Axios",
      "Trump accuses Ukraine of ingratitude as officials meet in Geneva on US peace plan - Reuters",
      "US, Ukraine and European officials to hold talks in Geneva on Trump’s plan to end war - Al Arabiya English",
      "Ukraine, U.S. Will Meet About Trump’s Peace Plan to End War With Russia",
      "G20 Leaders Push Back on Trump’s Ukraine Peace Plan",
      "Full text of European counter-proposal to US Ukraine peace plan - Reuters",
      "Rubio says the Ukraine peace proposal was authored by the US - Reuters",
      "European countries propose radically different Ukraine peace plan to US",
      "Ukraine: Europeans push back on US plan during Geneva talks",
      "U.S., Ukraine make progress on Trump's peace plan, Rubio says - Axios",
      "Ukraine peace talks in Geneva 'productive and meaningful,' Rubio says",
      "US senators say Rubio told them Trump’s Ukraine peace plan is Russia’s ‘wish list’ - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/23/us-ukraine-talks-why-are-european-leaders-opposing-trumps-peace-plan?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE1YR09wVktrRjdPYjFyTmhTckF4dWxzaUdPLXFFYU5KZFZTUTZyeE5BOFlRWHpkS1BiODNyeGZTc1JvR25jeG54dW9UX0g1X0ZrYm82TDdJVG9PUWs3SW5FdlNNa3pwVmRLUi1PMXJsYU9HSkYwTHRqT3dyQQ?oc=5",
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNzlLeE5xM2h6ZzR4Nm1PcUw3LWpFR3dRcDlWMVo5UzNmSmpLRl9zNERuU2o2M3NiZzZpcmRjUmNRSjNkYXdlUnVGSldZRWl5al9BbDVzT2I3UlZUZWdRWnZvZ05iWU4zcWlvZlpjd3duYl8tQWhiY2F6UFdnN3RaZFpIdlhFRS1CUWlfWEhudGxTYUU3VGFZS2N4Q0FEeE8zSm9jcF9MNTgteXduT3BPOUhERm15bzg?oc=5",
      "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPMkJ0VHZNRDVIa3hsN0tlOVdkYTVVampETjgzeG5Ha3dIME1HY1JYMk9QR3BnRXptNzYxa2VqaldDZDFNTEgyelB4V2tYTHI0bmM3TFRuSGtCQkhRbld1SlkzTGdXb0FVQVN4RzhzV1F6VnFhRGFyd0FZWFVKM01qdUNTeHBlekZNNng4OEJScW9wRjFQY0Fwc3dhSzI0Z1RIQWYzVjcxZU9IQ3d0ZE1qSlpYSzZQTzd4OFI2ME45NDFJNTRRaHU5RndIalNERHJlNEHSAdcBQVVfeXFMT2t5YVVJaFJYeXdHM1RFUTZOeTF1eGJnOVlVb1NpdnJ2eHd4d2JjQ0I1aGxRUUhCZk1IRm5iblhsWUhMcXFfN1NfUjBOYVlWR255bHB1V2c4WE1hNlZEUlBSTTJCRFRpWldqa3dOUjZQcWJKbG53N192QkdzVkxiYm1CYmtLQ3V4UHBkOGplU3B4VGN2ZExTdTY0dnU3enZFOTF0aE0yeXpZT1RVNUxuZjlEbGtIcmdaRkhSekZpX2E1X3FFeHotdEJoZVZwM29iaEtfaC1CNnc?oc=5",
      "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
      "https://www.nytimes.com/2025/11/22/world/africa/g20-south-africa-ukraine-russia-united-states.html",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxOb042TVF2UXBJTHUtdXBhNXRvRThZX3Z5ZG00ZmhkTGxOcFJvYS1adk44TkUyWTdtN2x0X3VzM3Jac0JfaUxXYjcwNzE0OVRuN3loWExxSDFPLWxFTktUaHBtTTc5ZEhQVjZ1MTBkeVJXTlk4ampjU05tNWhwS21Rbmh3aXcwbTFhV3MwWkdHT3ZoTzdxeE1BdTVEQm5qY2QwTlgzRlJxVVVjWjh3Y2ww?oc=5",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxNaWJtZTc5MU94WHB6UmRFNWVXQS1BVWw3YkdGYk11OGdqNm9uMWtsc25NOGh6RjJad2xNNHVOU2hJajFJVXpDX2c0Zlo1NFdYTlFLNWJvTV9hX19MT2xBMDhWdFhXajlTbDJFYmY1ekxRWWxhbkZWdHJtd2g4aGZTMXlsNWhlbS1XcWlPV0FSeUttRDdNWUM3UV9pdTVNQm1JQXNF?oc=5",
      "https://www.theguardian.com/world/2025/nov/23/trump-ukraine-zero-gratitude-peace-plan-international-talks",
      "https://www.dw.com/en/ukraine-europeans-push-back-on-us-plan-during-geneva-talks/live-74850575?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMieEFVX3lxTE1rdFdvTzNOa0k3bzMyYkJ1OENjSDdadXdHaDdWb2hhVVFhV2k4aHlXdnhUOGhlbE90cmNjcDFhcktiREZvZDkyZFdicFg5TWZuaVhQUGpjSzBidzBEOU9SV0hZdjNGYVR5dVUtWVlNTnYybjM3aTBJOA?oc=5",
      "https://abcnews.go.com/International/officials-arrive-switzerland-talks-zelenskyy-laments-ongoing-russian/story?id=127796632",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOMTk0Y216ODR3VWdkeXhnYU0ySW0yT1M1OG5KZDBudXMyajJsMXhWS2dtcVZieGJOT1V3aEk0a0hFSnVOLVZva1FMUHBCVDJvUUtJb2l2YWVsTVdkTkhXQ0VGQUhsTnhfS1pUZVRfMFNpV0trR05ZMHo3RVozdFVCY1M3UmV4TWs4cGYxQzNoNGpRaUJHUVpQeWNqSExPYnc4VDZ5Vzl2OENuTVNUeEZvZVhLclpwdw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/23/us-ukraine-talks-why-are-european-leaders-opposing-trumps-peace-plan?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.907,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.921,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the G20 summit in Johannesburg, Western and European leaders stated that the US peace plan for Ukraine requires significant revisions. French President Macron cautioned that the G20 risks losing relevance. Leaders reaffirmed their support for Ukraine, which may risk losing US backing if it rejects the current proposal. Former President Trump signaled openness to changes but did not attend the summit.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the call for revisions to the US peace plan for Ukraine by G20 leaders. It provides a deeper understanding of the international dynamics and the potential implications for Ukraine. It also empowers readers with knowledge about the ongoing efforts to bring peace to Ukraine.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Israeli Airstrike in Beirut Kills Hezbollah Chief of Staff, Escalates Tensions",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 13:11:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "NPR",
      "CBC News",
      "Deutsche Welle",
      "Axios",
      "Reuters",
      "Financial Times",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "npr.org",
      "cbc.ca",
      "dw.com",
      "news.google.com",
      "ft.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Netanyahu's office says Hezbollah's chief of staff was the target in the latest violation of a year-old ceasefire.",
      "Israel has escalated its campaign on targets it says are linked to Hezbollah, raising fears of a resumption of hostilities.",
      "An Israeli airstrike has struck Beirut for the first time since June.",
      "Israel carried out an airstrike on a southern Beirut suburb on Sunday, saying it killed Hezbollah’s chief of staff Haytham Tabtabai and warning the Iran-backed militant group not to rearm and rebuild a year after their latest war.",
      "Israel says it killed Hezbollah's chief of staff in an airstrike on Lebanon's capital. At least 5 people were killed in the attack, which is the first Israeli strike on Beirut in months.",
      "Israel tries to assassinate Hezbollah's top military commander in Beirut Axios",
      "Hezbollah chief of staff killed in Israeli strike on Beirut, Israeli media says Reuters",
      "Israel kills Hezbollah military leader in Beirut strike Reuters",
      "Raid is first on Lebanese capital since June and puts further strain on the yearlong ceasefire",
      "Escalating its attacks on the armed group in Lebanon, Israel said it killed Hezbollah’s chief of staff in an airstrike on an apartment building.",
      "Militant group confirms Haytham Ali Tabatabai was killed in attack that dramatically escalates tensions in the region Israel targeted one of Hezbollah’s most senior military commanders in an airstrike in Beirut’s southern suburbs on Sunday, dramatically escalating tensions with the group almost exac"
    ],
    "image_url": "",
    "titles": [
      "Israel attacks Lebanon’s capital, says top Hezbollah official ‘eliminated’",
      "Israel kills top Hezbollah official in first attack on Beirut in months",
      "Israel says it killed a senior Hezbollah official in first strike on Beirut in months",
      "Israel says Hezbollah commander targeted in Beirut strike",
      "Israel tries to assassinate Hezbollah's top military commander in Beirut - Axios",
      "Hezbollah chief of staff killed in Israeli strike on Beirut, Israeli media says - Reuters",
      "Israel kills Hezbollah military leader in Beirut strike - Reuters",
      "Israel targets top Hizbollah commander in Beirut strike",
      "Israel Says It Assassinated Top Hezbollah Commander in Lebanon",
      "Hezbollah chief of staff killed in Beirut airstrike, Israeli military says"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/23/israel-bombs-southern-suburbs-of-beirut?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cn81j54xjx1o?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/11/23/nx-s1-5618206/israel-hezbollah-militant-attack",
      "https://www.cbc.ca/news/world/israel-strike-hezbollah-beirut-9.6989505?cmp=rss",
      "https://www.dw.com/en/israel-says-hezbollah-commander-targeted-in-beirut-strike/a-74853555?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMidEFVX3lxTE5idXFnSWkxQjVWVzMtbWFWRU5wa1ZERUkxM01QV0xrWEU1c0NlZzNJeXRDX210RXFKdlB3UDJRMjd4ZlJ1REx1akEtQ0JiOWt1RDItRUxCMVpmNVg3eXlSeXlpTDJRbHBoV0ZGZnZfS2V2MkxJ?oc=5",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQYmxTNmttQVhMNkRfZkFXbDdtVW1OU0d3T3FlcVhvX1BZMUM5MzJWM1lWT24yNzhXR1dTQmZpNVBYWG05NUtJZnRST0NsRERUaHI3Y0JWQ0wyRWxyY2xRamNjX2FxaHZDUUxYOXBYZkJIYkd1c2hCeXltNWFGdXNSdEdidDNzb09HM0x4QXQtaWxkSThPMlhhY1laTVNhbmw2bnN1OHdxWjJ6RFUzUDV1ZjJ4TEF4eElvb0xKTmFKaTA?oc=5",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNNnREUkVrQV9OcWs3RkNLaU4tbmU0TDNvZDc4TXgyc3VKdGpuMkJUY01ybXhSaVZFSl91eUhBb0FkWXZLeDVsUm5YZXB4UDlVbzhuQlowejNwdW1sNk1TUXZUdEk5TlY1Tnd5cW5tUFd6eV9qNVg1T3FDMkVKVzQ5cjZFV1AxcnMtcjhfMGQ1bXZVY1VIQW41dUNZc3h4NjdGZ0hUNGkya1VSN1hucE1aZS1oeVlFQXQ4RWo2aA?oc=5",
      "https://www.ft.com/content/c1367e64-731d-48ef-a335-4732dbf18570",
      "https://www.nytimes.com/2025/11/23/world/middleeast/israel-hezbollah-dahiya-airstrike.html",
      "https://www.theguardian.com/world/2025/nov/23/israel-targets-hezbollah-chief-of-staff-in-strike-on-beirut"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/23/israel-bombs-southern-suburbs-of-beirut?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.864,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.883,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike on a southern suburb of Beirut, killing Hezbollah’s chief of staff, Haytham Tabtabai, along with at least four others. This marks the first Israeli strike on Beirut since June and follows a year-old ceasefire. The attack significantly escalates tensions between Israel and Hezbollah, raising concerns about renewed hostilities in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant event and its potential implications. It provides context about the ongoing conflict and tension between Israel and Hezbollah. However, it does not offer solutions or ways to deescalate the situation.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Italy Clinches Third Straight Davis Cup Title With 2-0 Win Over Spain",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 14:41:42 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Italy remains the king of the Davis Cup -- and didn't even need Jannik Sinner this time.",
      "Italy were crowned Davis Cup champions for a third successive year with victory over Spain.",
      "BOLOGNA, Italy — Italy remains the king of the Davis Cup — and didn’t even need Jannik Sinner this time. Matteo Berrettini and Flavio Cobolli were the stars for the Italians without the absent Sinner, both winning their singles matches to earn an unassailable 2-0 lead over Spain in the final on Sunday. It’s a fourth Davis Cup title for Italy, and a third in a row. The last nation to win three straight titles was the United States, which won five on the bounce from 1968-72. The second-ranked Sinner, who led Italy to men’s tennis biggest team trophy the past two years, opted out of playing this...",
      "Flavio Cobolli and Matteo Berrettini lead Italy to a historic third straight Davis Cup title in Bologna."
    ],
    "image_url": "",
    "titles": [
      "Italy sweeps Spain, reigns again as Davis champs",
      "Italy beat Spain to complete Davis Cup treble",
      "Italy sweeps Spain to retain Davis Cup",
      "Italy win historic third straight Davis Cup title"
    ],
    "url": "https://www.espn.com/tennis/story/_/id/47074165/italy-retains-davis-cup-2-0-win-spain",
    "alternate_urls": [
      "https://www.skysports.com/tennis/news/12040/13474632/davis-cup-italy-overcome-spain-in-bologna-final-to-become-champions-for-third-successive-year",
      "https://sports.yahoo.com/article/italy-win-historic-third-straight-195300004.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/tennis/story/_/id/47074165/italy-retains-davis-cup-2-0-win-spain",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.99,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.869,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Italy won its third consecutive Davis Cup title by defeating Spain in the final in Bologna. With Jannik Sinner absent, Matteo Berrettini and Flavio Cobolli secured singles victories, giving Italy an unassailable 2-0 lead. This marks Italy’s fourth Davis Cup title overall and the first nation to win three in a row since the United States in the early 1970s.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Italy's victory in the Davis Cup but doesn't offer much depth or insight beyond the scoreline and the players involved. It doesn't provide any actionable insights, solutions, or deeper understanding of the sport.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "McLaren Drivers Disqualified from Las Vegas GP for Technical Infringements",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 10:53:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Reuters",
      "The Guardian",
      "Sky Sports",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "news.google.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "Lando Norris and Oscar Piastri disqualified for technical infringements, reigniting title battle with Max Verstappen.",
      "Lando Norris and McLaren team-mate Oscar Piastri are disqualified from the Las Vegas Grand Prix for technical infringements.",
      "Norris and Piastri at risk of Las Vegas disqualification Reuters",
      "Cars failed to meet minimum skid wear measurements Loss of points places title within reach of Max Verstappen McLaren have held their hands up and issued an apology to their drivers after their breach of Formula One regulations led to the disqualification of Lando Norris and Oscar Piastri, the two l",
      "Championship leader Lando Norris and McLaren team-mate Oscar Piastri have been disqualified from the Las Vegas Grand Prix after their respective cars failed post-race technical checks.",
      "McLaren have apologised to Lando Norris and Oscar Piastri for their exclusions from the Las Vegas Grand Prix and revealed both cars sustained \"accidental damage\".",
      "Verstappen has 5th F1 title in reach after Norris, Piastri disqualified in Las Vegas AP News"
    ],
    "image_url": "",
    "titles": [
      "Norris, Piastri disqualified from Las Vegas GP, sparking F1 title race",
      "Norris and Piastri disqualified from Las Vegas GP",
      "Norris and Piastri at risk of Las Vegas disqualification - Reuters",
      "McLaren apologise to Norris, Piastri and fans for Las Vegas Grand Prix disqualification",
      "McLaren apologise to Norris, Piastri for Vegas exclusions",
      "Verstappen has 5th F1 title in reach after Norris, Piastri disqualified in Las Vegas - AP News"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/23/norris-piastri-disqualified-from-las-vegas-gp-sparking-f1-title-race?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/formula1/articles/cr7l5v2exv0o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxQSDFiaG16LWVCRVIzRW9uUElqQ2VoVUlvS0E2UUVHVEU1VUZzRVZ1ak1qQ0VvdXBnbW5JUzJhVHJaM0lUYVR4Mm1qSVh0MFg4VldDci1BSHBJVEx2bjExTmxSLUluX3NMZndTcHhMSmRNSkgyRDhqRFRPWWlpUmY4eGs2YmREX1JCZlhDUmZOZXI5d1FoT0NoN3pOUDd3S1E?oc=5",
      "https://www.theguardian.com/sport/2025/nov/23/mclarens-lando-norris-and-oscar-piastri-disqualified-from-las-vegas-gp",
      "https://www.skysports.com/f1/news/12040/13474307/las-vegas-gp-mclarens-lando-norris-and-oscar-piastri-disqualified-in-big-moment-in-f1-title-race",
      "https://www.skysports.com/f1/news/12040/13474443/las-vegas-gp-mclaren-apologise-to-lando-norris-oscar-piastri-for-disqualifications-and-reveal-cars-were-damaged",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPZmJsMm5ScGVBTm9ScmdFZE5rYktfeTdmMDFoNllrSHM5RTFUWU5Xa3pabGdfall1NENSLWVyS1hzYXFLVWdKTklBZmd3Qnl6czR3RVJjcVNBQ2lJWmJFSVA3bEVfNEgxbi1YX1pScEUyd29nZkdVTlRRSTNUZlI5SGxkbUpmbXFleE5OQV94MFRZakhrbHNMTjlWVnlWMEZ6dk9ydHd6Q2hXQTg?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/23/norris-piastri-disqualified-from-las-vegas-gp-sparking-f1-title-race?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.824,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.86,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lando Norris and Oscar Piastri of McLaren have been disqualified from the Las Vegas Grand Prix due to technical infringements. The decision removes their results from the race and impacts McLaren's standing in the ongoing championship. The team has not yet announced if it will appeal the ruling.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about the disqualification of McLaren drivers from the Las Vegas Grand Prix due to technical infringements. However, it lacks depth and does not offer insights into what these technical infringements were or how they could be avoided in the future.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fifty Abducted Nigerian Schoolchildren Escape, Over 250 Still Held Captive",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 23 Nov 2025 09:47:34 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Global News",
      "CBC News"
    ],
    "domains": [
      "npr.org",
      "theguardian.com",
      "globalnews.ca",
      "cbc.ca"
    ],
    "snippets": [
      "Fifty of the 303 schoolchildren abducted from a Catholic school in Nigeria's Niger state have escaped and are now with their families.",
      "Christian group revises up number of students and teachers missing after one of country’s largest mass abduction Gunmen have kidnapped more than 300 students and teachers in one of the largest mass kidnappings in Nigeria, a Christian group said on Saturday, as security fears mounted in Africa’s most",
      "Fifty of the 303 schoolchildren who were abducted from a Catholic school in north-Central Nigeria's Niger state have escaped, but 253 students and 12 teachers remain held captive.",
      "Fifty of the 303 schoolchildren abducted from a Catholic school in north-central Nigeria’s Niger state have escaped captivity and are now with their families, the school authority said Sunday, bringing relief to some distraught families after one of the largest school abductions in Nigeria’s history"
    ],
    "image_url": "",
    "titles": [
      "50 schoolchildren escape captivity in Nigeria, more than 200 still held",
      "Security fears rise in Nigeria after more than 300 schoolchildren kidnapped",
      "50 schoolchildren escape Nigerian abduction, but more remain captive",
      "50 schoolchildren escape captivity in Nigeria, 253 students and 12 teachers still being held"
    ],
    "url": "https://www.npr.org/2025/11/23/nx-s1-5618213/50-schoolchildren-escape-captivity-nigeria",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/22/security-fears-rise-in-nigeria-after-more-than-300-taken-mass-school-kidnapping",
      "https://globalnews.ca/news/11539600/nigeria-abduction-50-schoolchildren-escape/",
      "https://www.cbc.ca/news/world/50-children-escape-captivity-nigeria-9.6989567?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/23/nx-s1-5618213/50-schoolchildren-escape-captivity-nigeria",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.894,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.843,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fifty of the 303 schoolchildren abducted from a Catholic school in Niger state, Nigeria, have escaped and are now with their families. According to school authorities, 253 students and 12 teachers remain in captivity. The mass abduction is one of the largest in Nigeria’s history, and security concerns remain high.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the situation in Nigeria, but it doesn't offer any in-depth insights or actionable information for the reader. It also doesn't report on any solutions or attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Nuggets' Aaron Gordon out 4-6 weeks with Grade 2 hamstring strain",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 14:41:42 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Nuggets starting forward Aaron Gordon has a Grade 2 strain of his right hamstring, sources told ESPN's Shams Charania. Gordon will be re-evaluated in four to six weeks.",
      "Gordon is averaging a career-high 18.8 points per game",
      "The Denver Nuggets will have to maintain their strong start to the season with forward Aaron Gordon now sidelined with a hamstring injury, ESPN’s Shams Charania reported."
    ],
    "image_url": "",
    "titles": [
      "Nuggets' Gordon (hamstring) to miss 4-6 weeks",
      "Aaron Gordon injury: Nuggets' standout out with hamstring strain, to be re-evaluated in 4-6 weeks per report",
      "Nuggets’ Aaron Gordon out weeks with hamstring strain"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47073208/nuggets-aaron-gordon-hamstring-4-6-weeks-sources-say",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/aaron-gordon-injury-nuggets-hamstring-strain/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47073208/nuggets-aaron-gordon-hamstring-4-6-weeks-sources-say",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.827,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Denver Nuggets forward Aaron Gordon has suffered a Grade 2 strain of his right hamstring and will be re-evaluated in four to six weeks, according to ESPN. Gordon is averaging a career-high 18.8 points per game this season. The Nuggets will play without him as he recovers from the injury.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about Aaron Gordon's injury and the projected timeline for his recovery. This information could be useful for fans or those involved in fantasy sports. However, it doesn't report on any solutions or improvements, nor does it increase clarity around systems, causes, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Eze Hat-Trick Leads Arsenal to 4-1 Derby Win Over Spurs, Extends League Lead",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 14:09:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "After nearly joining Spurs in the summer, Eberechi Eze savored his first North London derby with Arsenal by netting a hat trick against their rivals.",
      "It was an unguarded comment from an Arsenal official and it came shortly after Eberechi Eze’s mural outside the Emirates Stadium had been defaced with white paint – presumably by a Tottenham fan. It summed up the snark between the clubs and Arsenal’s delight at pipping their rivals to Eze’s signatur",
      "Eberechi Eze scored a sensational hat-trick as Arsenal moved six points clear at the top of the Premier League with a 4-1 thrashing of north London rivals Spurs at the Emirates Stadium."
    ],
    "image_url": "",
    "titles": [
      "Eze haunts Spurs as Arsenal make statement of title intent",
      "Brilliant Eze hits hat-trick as Arsenal thump Spurs to extend lead in title race",
      "Eze's brilliant hat-trick sinks Spurs as Arsenal go six clear"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47073943/eberechi-eze-haunts-tottenham-hotspur-arsenal-make-statement-premier-league-title-intent-north-london-derby",
    "alternate_urls": [
      "https://www.theguardian.com/football/2025/nov/23/arsenal-tottenham-premier-league-match-report",
      "https://www.skysports.com/football/arsenal-vs-tottenham-hotspur/report/531239"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47073943/eberechi-eze-haunts-tottenham-hotspur-arsenal-make-statement-premier-league-title-intent-north-london-derby",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.979,
      "consensus": 0.789,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.827,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eberechi Eze scored a hat-trick in Arsenal’s 4-1 victory over Tottenham Hotspur in the North London derby, helping Arsenal move six points clear at the top of the Premier League. The match followed recent tensions, including the defacing of Eze’s mural outside the Emirates Stadium. Eze had been close to joining Spurs in the summer before signing with Arsenal.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the game, including the scoreline, the key player, and the implications for the league standings. It also adds some context about Eze's move to Arsenal. However, it doesn't provide a deeper understanding of the sport or report on any solutions or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "G20 Adopts Climate and Debt Declaration Despite US Boycott at South Africa Summi",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 17:07:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "NPR",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "South African President Cyril Ramaphosa says there is a \"renewed commitment to multilateral co-operation\".",
      "The G20 closed in Johannesburg without a ceremonial hand over to the U.S., its next chair, after Washington boycotted the summit.",
      "South Africa judges G20 summit a triumph of multilateralism despite US no-show Reuters",
      "G20 summit in South Africa adopts declaration despite US boycott, opposition Reuters",
      "South Africa sees US trade negotiations continuing despite G20 differences Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0b96/live/2b78e5a0-c88e-11f0-ad71-a78644c7fe2c.jpg",
    "titles": [
      "G20 summit boycotted by US closes in South Africa",
      "G20 summit closes in South Africa after U.S. absence",
      "South Africa judges G20 summit a triumph of multilateralism despite US no-show - Reuters",
      "G20 summit in South Africa adopts declaration despite US boycott, opposition - Reuters",
      "South Africa sees US trade negotiations continuing despite G20 differences - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/cvg130704zro?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/11/23/nx-s1-5616430/g20-summit-ends-south-africa-trump-ramaphosa",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOenhQdTVBNFhLZm93RjFFT28ycVk3ZHhEYVM3dXhJYkdGYTZreEdQZjdBbGJCQ3RFY1c2UnEyWHB5UkVnYVpXNXRiS2VieDZMZW1UNG83ODRaS1pVelZBUmlwS0k1c0kySm5oWWJKMDVUU2NEQnFTZUdsWVZWaTBBbzgtQnpadDFaUnZmTmxCOU5QcHV2cEJ3MS1iNF82Nlp1Rld4Q0lDTmE0YzZJTHBqNHJqZy00S3ZZWVZj?oc=5",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxPb3hRNU9yVldsQ1ZyLWVOWmhjSk4yZUZfcmhjUWlraHRlQWlUVzNUMjVhQ0hxQTAzbms4TTFDbFNHRTdBSjlGWDJhaW5qSUJ1RkVtaWR4QnFPQVZIVElRaW5JcWJXS2tpTHRNUVJFQ2pISWs2VnpDY3Ywc1pLcG5vaHpuNV9zV1BzU0ZtbHdKRjEwd2J0YUZNclZsUHZ3R3pDZVktTzlTX2tlRHIzejl1OTVLcHAyM2lKTnRLSzMxbU9iSkh2aXlOV0tabzM?oc=5",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQcy0wejJKYmJVUzNpR19wQ0FtN0RHWXEydEdJZGUzSFhMaVJhQi1Td2QwQ05KTS1INW5lMVl2Wm05alVNY2NzYzMxc1doQllxY2huYWVUc1VRa1pXeDlYMzNRazl1UVdOM1EyLXU5NWpiS2VlQmxlQ2ptdG9OWW5vQ3YtbmVqY1VyU1V5WkhQeWMxNHY2RHkwZUxmUzBXSF9nNEFHX2RVR2F4dmxzbTNaVmhWODQ2blF5Sms5UTBnejU?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvg130704zro?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the G20 summit in South Africa, world leaders swiftly adopted a new declaration at the start of the meeting, despite opposition and a boycott from the United States. The declaration calls for increased international support to address the climate crisis and urges efforts to reduce the debt burden on poorer countries. The agreement was reached more quickly than in previous years.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the international response to the climate crisis and debt issues. It increases awareness about the positions of different countries, particularly the US, and the progress being made at the G20 summit. However, it doesn't provide specific solutions or actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "BHP Makes New Takeover Approach to Anglo American Amid Industry Talks",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 13:09:08 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "BHP has made renewed bid approach to Anglo American, source says Reuters",
      "BHP Makes New Takeover Approach to Anglo American Bloomberg.com",
      "BHP Group has made a fresh takeover approach to Anglo American Plc in a move to disrupt the London-listed miner’s combination with Canada’s Teck Resources Ltd., the latest twist in a wave of consolidation sweeping the industry."
    ],
    "image_url": "",
    "titles": [
      "BHP has made renewed bid approach to Anglo American, source says - Reuters",
      "BHP Makes New Takeover Approach to Anglo American - Bloomberg.com",
      "BHP Makes New Takeover Approach to Anglo American"
    ],
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPWnZESjJtaTlzeGtRSVk1ZE40N3pZeldFYk9yNmxFbmxTMUU4WjE2c2d1czVoUVl3VTkxd2JCTHN1UGRyV0Y3c3U3ejMwS2VCV3hvclpUakd1N244UUl1V2RGR1paNXZ6QjRrbnJDa2xKU19ndEQyVVRPSjJHR2FxNndzRWFOTGoxTkpGYXp5TUtRZEptNkw4Z19YTXRaQTltd3UyWmx1b1lWTFVkWEdodmlCc0J2Mkk?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRTZGS2FCYVE2R1ktb2RSR3l6MF90VDdnTEhCREdFUmlSOVZmaHp6OUdMUVVaN1l6NU83cTladEpUN3I1czRjazljbjdZWFkxT29RXy16UnBwUjVKa0dXM2lVVjB4ZHZocm5nSXNKZ25wRVMzbm5wbkltVjh6ZzVBVUJLUlFWUG9qNTlCSFphdXM3eEtybVpWNnp6MFR4ckxpTzFtRHlOZ1FqeHJBYkE3em93?oc=5",
      "https://financialpost.com/pmn/business-pmn/bhp-group-is-said-to-make-takeover-approach-to-anglo-american"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPWnZESjJtaTlzeGtRSVk1ZE40N3pZeldFYk9yNmxFbmxTMUU4WjE2c2d1czVoUVl3VTkxd2JCTHN1UGRyV0Y3c3U3ejMwS2VCV3hvclpUakd1N244UUl1V2RGR1paNXZ6QjRrbnJDa2xKU19ndEQyVVRPSjJHR2FxNndzRWFOTGoxTkpGYXp5TUtRZEptNkw4Z19YTXRaQTltd3UyWmx1b1lWTFVkWEdodmlCc0J2Mkk?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.864,
      "consensus": 0.769,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "BHP Group has made a new takeover approach to Anglo American Plc, according to multiple sources. The move comes as Anglo American is in talks to combine with Canada’s Teck Resources Ltd. This renewed bid is part of ongoing consolidation efforts in the mining industry. No final agreement has been reached between BHP and Anglo American.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the ongoing consolidation efforts in the mining industry and the potential impact of BHP's takeover approach to Anglo American. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the industry dynamics.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canada Shifts from Feminist Foreign Policy to Broader Values, Says Carney",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 23 Nov 2025 17:47:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Globe and Mail"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Prime Minister Mark Carney says he wants Canada to uphold values on the world stage including combatting violence against women, but says it doesn't have a feminist foreign policy.",
      "No more feminist foreign policy, Carney says The Globe and Mail"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/6b14cf14af9d8694ac36785433df6a95a87eb0629a55634896cf84b4e901ce15.jpg?quality=65&strip=all",
    "titles": [
      "Carney says Canada drops talk of ‘feminist foreign policy’ but upholds values",
      "No more feminist foreign policy, Carney says - The Globe and Mail"
    ],
    "url": "https://globalnews.ca/news/11539673/canada-carney-feminist-foreign-policy/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOUm1fdlo3dWN0X0NZN3pXaDdQd2tfSDlNbHhNYmtyY3pFUGdNMGZPRTVtemlaRnNDWW5Jbm1BcXk5UEwtMG5WVFBaRHNzWWNzeWxMVzdPUEtoS1d0N1ljNGdDMGVySkhwSzYwMlZaVl9lRGdYaUx4X3AzZkJ0bERWUEdxdDExVkVMRVFVMmVVVUJnMFNQVDFYamptdFJpVDItdjBNVkNJQlczb0NLZFJqQXVTWFQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11539673/canada-carney-feminist-foreign-policy/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.765,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Minister Mark Carney stated that while Canada will continue to promote values such as combatting violence against women internationally, the country will no longer pursue a feminist foreign policy. Carney clarified that the government’s approach will focus on broader Canadian values rather than a specific feminist framework.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about Canada's shift in foreign policy. It informs readers about the government's new approach, which could influence their understanding of Canada's international relations. However, it doesn't highlight any specific progress or solutions.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Notre Dame, Miami Remain Apart in AP Poll; Top Teams Hold Steady",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 19:05:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Meanwhile, Notre Dame and Miami remain separated by several spots despite the early-season head-to-head result",
      "Oregon, Ole Miss and Texas Tech played the shuffle game, but the rest of the top of the AP Poll remained unchanged following the weekend."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/23/f07c639c-11a7-4043-8ecf-437e147715a9/oregon-football-dan-lanning.jpg",
    "titles": [
      "Oregon, Oklahoma solidify positioning in AP Top 25 rankings amid changes to Week 14 poll",
      "AP Poll sees minor changes near top after Week 11"
    ],
    "url": "https://www.cbssports.com/college-football/news/ap-top-25-poll-college-football-rankings-oregon-oklahoma-week-14/",
    "alternate_urls": [
      "https://sports.yahoo.com/article/ap-poll-sees-minor-changes-194530165.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/college-football/news/ap-top-25-poll-college-football-rankings-oregon-oklahoma-week-14/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Notre Dame and Miami are still ranked several spots apart in the latest AP Poll, despite Miami's earlier win over Notre Dame. Oregon, Ole Miss, and Texas Tech shifted positions in the rankings, while the top teams in the poll stayed the same after the weekend's games.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the latest AP Poll rankings and the performance of various teams. However, it doesn't provide a deep understanding or actionable insights, nor does it report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Chiefs Trail Colts 0-7, Reach First-and-Goal in First Quarter",
    "domain": "sports",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 19:59:21 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "theguardian.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Minute-by-minute updates on the 1pm UK time kick-offs Any questions or comments? You can email Graham Chiefs 0-7 Colts 1:00, 1st quarter The Chiefs pick up a nice chunk of 10 yards with a pass to Worthy then hand it to Hunt who moves the stick again. Chiefs are 1st & goal. Continue reading...",
      "The Indianapolis Colts look to make a statement against the Kansas City Chiefs, who are vying to remain in the playoff picture. Follow the action at 1 p.m. ET / 10 a.mm. PT using Sportsnet’s live tracker."
    ],
    "image_url": "https://i.guim.co.uk/img/media/0238f0ff137ba0e5ae335839a82556840b8f1f74/525_132_2762_2209/master/2762.jpg?width=140&quality=85&auto=format&fit=max&s=7118a2b9462d4e598dd441aec0451f40",
    "titles": [
      "NFL week 12: Chiefs v Colts, Packers v Vikings and Bears v Steelers – live",
      "NFL Live Tracker: Colts vs. Chiefs"
    ],
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/nfl-week-12-chiefs-v-colts-packers-v-vikings-and-bears-v-steelers-live",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.theguardian.com/sport/live/2025/nov/23/nfl-week-12-chiefs-v-colts-packers-v-vikings-and-bears-v-steelers-live",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Indianapolis Colts are playing the Kansas City Chiefs, with the Chiefs currently trailing 0-7 in the first quarter. The Chiefs have advanced to a first-and-goal situation after successful plays by Worthy and Hunt. The game is ongoing, with both teams aiming to improve their playoff standings.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing sports event, but it doesn't provide deep insights or actionable information. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Fifty Kidnapped Nigerian Catholic School Students Escape Amid Ongoing Abductions",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 17:53:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The raid on a Christian school came amid a surge of attacks by armed groups in the African nation.",
      "Fifty kidnapped Catholic school students in Nigeria escape Reuters",
      "Pope Leo appeals for release of 315 kidnapped from Nigeria school Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/86ec/live/f9992680-c883-11f0-bd12-71741f879d80.jpg",
    "titles": [
      "Fifty children escape after mass school abduction in Nigeria",
      "Fifty kidnapped Catholic school students in Nigeria escape - Reuters",
      "Pope Leo appeals for release of 315 kidnapped from Nigeria school - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/cpwk5qzzppzo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQTnFubEl6M2owbHk3Nm9zVFp3ajhMVFJza0pQZkNUU0R1dHRQZDJKRWZBR0NYU29xeU5mT09aZzZsbHpCMUZlclBIbDBsMnJrdmc1THkwMGJLVmJNZEN6Y0UxMmZ3SXRwaHp3S2dOb1A2UzVoOFc4S2YwWFp5QVh1Q3czS2syVXZHVVpzUDUyWUJDVUdDWHJQMGdRUjhmSjFBSWNCVlhfZ0pES245YmN6Y004MEpxRFRW?oc=5",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxQSkpuR2lPMkhXcEROZWd4cGw5a1lER0kza3ltNFVMNWxVMjd0Z1p2RWJtVjVNLTBkaEJ5SThNSmJqcEp3VFZOVjdSaFF4dU0xWEp0dFBibFdmZzMyeHN5T25jMVJ6VF9CZ2xNNzVaUDhxMUpSTzMzSFhwdWJKYVVGaTB6dGVod0p5eXpHX3FnXzFNWFFUZGVRSVhTR2QzbEtMTmpyYw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cpwk5qzzppzo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fifty Catholic school students who were kidnapped in Nigeria have escaped, according to Reuters. The incident occurred amid a rise in attacks by armed groups targeting schools in the country. Meanwhile, Pope Leo has called for the release of 315 other students who remain abducted. The situation highlights ongoing security challenges in Nigeria.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing security challenges in Nigeria, specifically the rise in attacks by armed groups targeting schools. However, it does not offer solutions or improvements to the situation, nor does it provide a deep understanding of the underlying causes or systems at play.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Ukraine, Allies Discuss U.S. Peace Proposal for Russia Conflict in Geneva",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 23 Nov 2025 15:26:18 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Bloomberg"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Ukraine and some of its Western allies met in Geneva to discuss the U.S. proposal for peace between Kyiv and Russia, which includes concessions to Moscow.",
      "US Is Pressuring Ukraine to Move Forward With Peace Proposal Bloomberg.com"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/ukraine-flag-geneva-mission.jpg?quality=65&strip=all",
    "titles": [
      "Ukraine, Western allies meet to discuss U.S. peace proposal",
      "US Is Pressuring Ukraine to Move Forward With Peace Proposal - Bloomberg.com"
    ],
    "url": "https://globalnews.ca/news/11539590/ukraine-western-allies-meeting-us-peace-proposal/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNTS1kd0tsRjZtdkdGek1iZ0pkaExYRzZDUmZjcXhiRkpfZFJBOWdzbHAtQWlJRkNjelQ1THdMU05QNnR2SHVRWF8ySWZiWmpNeFRfSFd2LUlab3JCdE9XR3BPMEU0LTUzNjJab2tyUlJkckM5Uy02RzFUcUFCX0lucjhBRTVSOFhfYUFKLV9uV0dVZ1BtVkdKREJ1OGxNcTVxNHMyTlFvTnR4Q1lGVVJDbQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11539590/ukraine-western-allies-meeting-us-peace-proposal/",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 1.0
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine and several Western allies met in Geneva to discuss a U.S. peace proposal aimed at ending the conflict with Russia. The proposal includes making certain concessions to Moscow. The U.S. is urging Ukraine to consider moving forward with the plan. No final agreement has been reached, and discussions are ongoing.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.03, neg_sim=0.12",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "England Beat Argentina to Complete Unbeaten Autumn Nations Series at Twickenham",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 18:25:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "England ride out a second-half comeback from Argentina as an eye-catching Twickenham debut from Max Ojomoh helps extend their winning streak to 11 successive Tests.",
      "Max Ojomoh starred in his first home start as England just held off an Argentina fightback to clinch an Autumn Nations Series clean sweep via a 27-23 victory."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c1f/live/bddcdab0-c897-11f0-b3b1-a1146566cc79.jpg",
    "titles": [
      "England hold off Argentina fightback to earn 11th straight win",
      "Ojomoh stars as England just hold off Argentina for Autumn clean sweep"
    ],
    "url": "https://www.bbc.com/sport/rugby-union/articles/cm289ldgvgmo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/rugby-union/england-vs-argentina/report/110180"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/rugby-union/articles/cm289ldgvgmo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England defeated Argentina 27-23 at Twickenham, securing their 11th consecutive Test win and completing an unbeaten Autumn Nations Series. Max Ojomoh impressed in his first home start, contributing to England's strong first half. Despite a second-half comeback from Argentina, England maintained their lead to claim victory.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the outcome of a sports event, but it does not offer deep insights or actionable information. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Bosnian Serb Region Holds Snap Election to Choose New President",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-23T12:19:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "The snap vote pits Sinisa Karan against Branko Blanusa after long-term President Milorad Dodik's removal from office in the Bosnian Serb entity.",
      "Bosnia's Serb region votes for new president after Dodik's removal Reuters"
    ],
    "image_url": "",
    "titles": [
      "Bosnia's autonomous Republika Srpska votes for new president",
      "Bosnia's Serb region votes for new president after Dodik's removal - Reuters"
    ],
    "url": "https://www.dw.com/en/bosnia-s-autonomous-republika-srpska-votes-for-new-president/a-74852088?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxPNHRDZFVwV1B2cVNFZ3lEVldjQ1Yxb25mVUFQXzQwbHRBeGxGM2c2cnljczdCQ0JGUWo4SXRqdm5BLTdvRjQzRXcwQjl2bmhtX1ZmWkZzQ2ZfZUN0VGtmbldyNjVkNjB0b1VkMnhCdmVtcURXMFdPTUg0T0g4ZDlOWWtINE9HZTU5OXExUVFIOGdNVEl0MzNaU3l3b2lYeWpGakR4NE9GbXFMWXBGT3c?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/bosnia-s-autonomous-republika-srpska-votes-for-new-president/a-74852088?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.849,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bosnia's Serb region held a snap election to choose a new president following the removal of long-term leader Milorad Dodik. The main candidates are Sinisa Karan and Branko Blanusa. Voting took place amid heightened political tensions. The outcome will determine the new leadership for the Bosnian Serb entity. Results have not yet been announced.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the political situation in Bosnia's Serb region, specifically the snap election to choose a new president. It helps readers understand the current political dynamics in the region, but it doesn't offer a detailed analysis of the underlying causes of the political tensions, nor does it highlight any potential solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Elche Faces Real Madrid in First Match After International Break",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 18:07:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Xabi Alonso's team are back after the international break on Sunday",
      "How to Watch Elche vs. Real Madrid on TV, Live Stream Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/23/3579f310-04f8-4323-b434-f51b7d711bd2/mbappe-3.jpg",
    "titles": [
      "Elche vs. Real Madrid live stream: Where to watch LaLiga, odds, prediction lineups and more",
      "How to Watch Elche vs. Real Madrid on TV, Live Stream - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/soccer/news/elche-vs-real-madrid-preview-live-stream-where-to-watch-odds/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOLWFVMmhReTQtT081Umd5bk9yNGg0SVpGWHFoUlVTZ2FTZzluMk4yUXJ2NjRQTmFZOGwweko3RUlDNl9SVXZFdmp3Xy1jZjBVSHI5cTZ6YzhMUC01TjNsOEo5TWpLWVgtS05OQ0htR0FEYnJmU0xpQTIzajJyZTZRNzRuY2k5OWRvT084?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/soccer/news/elche-vs-real-madrid-preview-live-stream-where-to-watch-odds/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Xabi Alonso's team returns to action on Sunday following the international break. Elche will face Real Madrid in their upcoming match. Fans can watch the game live on TV or via online streaming platforms, as detailed by Sports Illustrated. The match marks both teams' first fixture after the break.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about an upcoming football match. However, it lacks depth or insight into the teams' strategies, players' conditions, or potential implications of the match result.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bolsonaro Admits Damaging Ankle Monitor During Psychotic Episode",
    "domain": "general",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 17:56:45 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "Brazil’s former president says he took a soldering iron to electronic tag as he was hallucinating that it was bugged Brazil’s far-right former president Jair Bolsonaro has claimed he took a soldering iron to his electronic ankle monitor after having a substance-induced “psychotic attack” that caused",
      "Brazilian ex-president says he used soldering iron on device and is now in custody over fears he was going to abscond Brazil’s former far-right president Jair Bolsonaro has claimed he tried to damage his electronic ankle monitor “out of curiosity” after he was arrested at his villa owing to suspicio",
      "On his first full day in jail, former Brazilian president Jair Bolsonaro told a judge on Sunday he had violated his ankle monitoring the day before while under house arrest because of a nervous breakdown and hallucinations caused by a change in his medication."
    ],
    "image_url": "https://i.guim.co.uk/img/media/b3aa23f84421102f481df14e8f97990cb72f0558/1423_199_2458_1968/master/2458.jpg?width=140&quality=85&auto=format&fit=max&s=c6e8f59bab4d74686826a04d0cef635a",
    "titles": [
      "Jair Bolsonaro claims ‘psychotic attack’ made him tamper with ankle monitor",
      "Jair Bolsonaro arrested after tampering with ankle tag ‘out of curiosity’",
      "Bolsonaro claims 'hallucinations' led the ex-Brazil president to tamper with ankle monitor"
    ],
    "url": "https://www.theguardian.com/world/2025/nov/23/jair-bolsonaro-claims-psychotic-attack-made-him-tamper-with-ankle-monitor",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/22/far-right-former-president-jair-bolsonaro-arrested-in-brazil",
      "https://www.cbc.ca/news/world/bolsonaro-brazil-ankle-monitor-9.6989668?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2025/nov/23/jair-bolsonaro-claims-psychotic-attack-made-him-tamper-with-ankle-monitor",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Brazilian president Jair Bolsonaro admitted to damaging his electronic ankle monitor with a soldering iron while under house arrest, citing a psychotic episode triggered by medication changes. He is currently in custody amid concerns he might attempt to flee. Bolsonaro told a judge he acted during a nervous breakdown and hallucinations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story does provide some awareness of Bolsonaro's situation, it lacks depth and doesn't offer any actionable insights or solutions. It also doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "FBI and DHS Officials Attend 2025 Las Vegas GP; McLaren Drivers Disqualified",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 03:57:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "FBI's Patel, Homeland Security's Noem attend Las Vegas Grand Prix Reuters",
      "See the updated F1 standings after round 22 of the season in Las Vegas, Nevada.",
      "Updated F1 Standings After The 2025 Las Vegas Grand Prix Following Double McLaren DSQ Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "FBI's Patel, Homeland Security's Noem attend Las Vegas Grand Prix - Reuters",
      "F1 Standings After The 2025 Las Vegas Grand Prix",
      "Updated F1 Standings After The 2025 Las Vegas Grand Prix Following Double McLaren DSQ - Sports Illustrated"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNRV94WE1SNk1vUjRXVG1lNVljcVNIUG9CR3lwX29BelNKVTBBR2RES2FfLWRLZ2V3dlNZNGVEMGFON1k3UEFxUnJWRG93QjlpVEx0YU9PUnR0UG9JVGZlbFBUa3U4dVpYOEVrVkhyWlFoRjdrQmxzeGlxUkxLblV4T2FMM01ZX01vZUpxYXJwT0FWT2VPbXE5bVBfOUZGdWExUFV6UklwMzVzdkV4bi1hQ2V6cjM?oc=5",
    "alternate_urls": [
      "https://www.forbes.com/sites/yaraelshebiny/2025/11/23/f1-standings-after-the-2025-las-vegas-grand-prix/",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPZWJ5YXRkMURrNW1xd0lUQVNneVduVDlZby1nWXZpMjZGbmhqb0UtZkxYSnB0bXRMc0RoRk1wNmRXdzY3VG1yM0RrVWFQV1FfV2FMcGU2Y252SnV0NERtVENhTVJidTFhZlN5dW1OelJxUVVhaTlLWHZTdTBVT0o0alEtMVM1M3B1MzQtQkhRa1luV01xcDU0SFpSV1FUNFFxZFZWSWtockdlTF9NaWdaM0ZR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNRV94WE1SNk1vUjRXVG1lNVljcVNIUG9CR3lwX29BelNKVTBBR2RES2FfLWRLZ2V3dlNZNGVEMGFON1k3UEFxUnJWRG93QjlpVEx0YU9PUnR0UG9JVGZlbFBUa3U4dVpYOEVrVkhyWlFoRjdrQmxzeGlxUkxLblV4T2FMM01ZX01vZUpxYXJwT0FWT2VPbXE5bVBfOUZGdWExUFV6UklwMzVzdkV4bi1hQ2V6cjM?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.713,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "FBI official Patel and Homeland Security's Noem attended the Las Vegas Grand Prix, which was round 22 of the Formula 1 season. The event saw both McLaren drivers disqualified, affecting the updated F1 standings. The current standings reflect these changes following the 2025 Las Vegas Grand Prix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UCLA Stars Lead WNBA Draft Projections; Cardi B Tops Charts with \"Errtime\" Remix",
    "domain": "business",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 12:04:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "espn.com",
      "forbes.com"
    ],
    "snippets": [
      "Four UCLA players, including Lauren Betts, are now projected first-round picks. But Spain's Awa Fam is No. 1.",
      "Cardi B's “Errtime” reappears on multiple Billboard charts as remixes with Jeezy and Latto become bestsellers, and the rapper scores several new No. 1s."
    ],
    "image_url": "",
    "titles": [
      "WNBA mock draft: There's a new No. 1 replacing Lauren Betts at the top",
      "Cardi B Scores A New No. 1 — By Replacing Michael Jackson In The Top Spot"
    ],
    "url": "https://www.espn.com/wnba/story/_/id/47038300/wnba-mock-draft-2026-awa-fam-betts-miles-latson-johnson-fudd",
    "alternate_urls": [
      "https://www.forbes.com/sites/hughmcintyre/2025/11/23/cardi-b-scores-a-new-no-1---by-replacing-michael-jackson-in-the-top-spot/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/wnba/story/_/id/47038300/wnba-mock-draft-2026-awa-fam-betts-miles-latson-johnson-fudd",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Four UCLA women's basketball players, including Lauren Betts, are projected as first-round picks in the upcoming draft, while Spain's Awa Fam is ranked No. 1 overall. Separately, Cardi B's song “Errtime” has returned to multiple Billboard charts after new remixes with Jeezy and Latto became bestsellers, earning Cardi B several new No. 1 positions.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Finnish, Italian Leaders Discuss US Ukraine Peace Plan With Trump",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 13:29:38 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Finland’s Stubb and Italy’s Meloni Spoke to Trump on Ukraine Bloomberg.com",
      "Finnish President Alexander Stubb said that together with Italian leader Giorgia Meloni he has spoken to US President Donald Trump about the US 28-point peace plan for Russia’s war on Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Finland’s Stubb and Italy’s Meloni Spoke to Trump on Ukraine - Bloomberg.com",
      "Finland’s Stubb and Italy’s Meloni Spoke to Trump on Ukraine"
    ],
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOd08xYXJ6QnJBeTVtUXIzaVpNZDhlTkNfNm5LQm5YUmdhOTFFQmc2Qk5XX2VScV9uazhrWTJ6UHp0a3RoWGc4QnRsVDR6NEVxdko0MkYzLWhlVXhxNEtMTEhnV2taWFhfai05bUVfQWpySmh1aV81TGZvUzM1aktubXpIdUQyQ0liNkJCWXJreVhydGFjX0FVNWJyaVJVOGdOLXdVVmh4U1hEMlRjVlhkWg?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/finlands-stubb-and-italys-meloni-spoke-to-trump-on-ukraine"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOd08xYXJ6QnJBeTVtUXIzaVpNZDhlTkNfNm5LQm5YUmdhOTFFQmc2Qk5XX2VScV9uazhrWTJ6UHp0a3RoWGc4QnRsVDR6NEVxdko0MkYzLWhlVXhxNEtMTEhnV2taWFhfai05bUVfQWpySmh1aV81TGZvUzM1aktubXpIdUQyQ0liNkJCWXJreVhydGFjX0FVNWJyaVJVOGdOLXdVVmh4U1hEMlRjVlhkWg?oc=5",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.105,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Finnish President Alexander Stubb and Italian Prime Minister Giorgia Meloni have discussed the US 28-point peace plan for Russia’s war on Ukraine with former US President Donald Trump. The talks focused on efforts to address the conflict in Ukraine. No further details or outcomes from the conversation have been reported.",
    "constructiveness_score": 0.105,
    "constructiveness_reason": "keywords (2): effort, plan; semantic: pos_sim=0.07, neg_sim=0.04; semantic_boost=0.01",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Titanic Victim Isidor Straus’s Gold Watch Sells for £1 Million at Auction",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 12:55:51 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "The watch belonged to Isidor Straus, a co-owner of Macy’s who was traveling first class on the Titanic with his wife when it sank in April 1912.",
      "The 18-carat Jules Jurgensen gold watch belonged to Isidor Straus, who along with his wife lost his life when ship sank A gold pocket watch that belonged to a man who died onboard the Titanic when it sank has sold for a record sum. The watch, which belonged to 67-year-old Isidor Straus, went for £1."
    ],
    "image_url": "",
    "titles": [
      "Titanic Passenger’s Pocket Watch Sells for $2.3 Million",
      "Titanic passenger’s pocket watch sold for record £1.78m at auction"
    ],
    "url": "https://www.nytimes.com/2025/11/23/world/asia/titanic-watch-auction.html",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2025/nov/23/titanic-passenger-pocket-watch-sold-record-auction"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/11/23/world/asia/titanic-watch-auction.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An 18-carat gold pocket watch that belonged to Isidor Straus, co-owner of Macy’s who died with his wife in the 1912 Titanic sinking, has been sold at auction. The watch fetched a record sum, selling for £1 million. Straus was traveling in first class when the ship sank.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a historical event and a recent auction, but it doesn't provide any deep insights, actionable knowledge, or a broader understanding of related systems or trends.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "\"Wicked: For Good\" Opens with $150M, Second-Biggest Debut of 2025",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 18:39:24 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "cnbc.com",
      "forbes.com"
    ],
    "snippets": [
      "Universal's \"Wicked: For Good\" tallied an estimated $150 million domestic opening during its first three days in theaters.",
      "'Wicked: For Good' kicks off the holiday movie season ahead of Thanksgiving weekend with a massive first weekend that could put it on course for a $1 billion finish.",
      "“Wicked: For Good” is second only to “A Minecraft Movie” for 2025’s biggest opening weekend."
    ],
    "image_url": "",
    "titles": [
      "'Wicked: For Good' soars to $150 million domestic opening",
      "Wicked: For Good Shatters Records With Magical $225 Million Box Office",
      "‘Wicked: For Good’ Dominates Box Office With $150 Million Opening—Beating Last Year’s First Installment"
    ],
    "url": "https://www.cnbc.com/2025/11/23/universals-wicked-for-good-soars-to-150-million-domestic-opening.html",
    "alternate_urls": [
      "https://www.forbes.com/sites/markhughes/2025/11/23/wicked-for-good-shatters-records-with-magical-225-million-box-office/",
      "https://www.forbes.com/sites/zacharyfolk/2025/11/23/wicked-for-good-dominates-box-office-with-150-million-opening-beating-last-years-first-installment/"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/11/23/universals-wicked-for-good-soars-to-150-million-domestic-opening.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Universal's \"Wicked: For Good\" earned an estimated $150 million at the domestic box office in its first three days, marking a strong start to the holiday movie season. This opening is the second largest for 2025 so far, behind \"A Minecraft Movie.\" The film's performance positions it as a major box office contender.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Ukraine, Allies Seek Ceasefire Before Talks on Territorial Changes with Russia",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 12:15:08 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Ukraine Seeks NATO-like Shield From US, Counter-Plan Says Bloomberg.com",
      "Ukraine and its European allies will insist that discussions with Russia on any territorial swaps can only take place once the war ceases along the current line of contact, according to people familiar with a counter-proposal that will be presented to the US later today in Switzerland."
    ],
    "image_url": "",
    "titles": [
      "Ukraine Seeks NATO-like Shield From US, Counter-Plan Says - Bloomberg.com",
      "Ukraine Seeks NATO-like Shield From US, Counter-Plan Says"
    ],
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNbi1DeDhQVWVXeFE3a01HWTJtbUl3VkpOeVFOTE5mSEN4cHJoSnJTd1MwLXpmT1VBWFF4M01FX3g3LVVnVHh4YVVYdFFaLW52c3F6OEFBUUtOYi05YWt0MU1GWXJuRXpBVmFocFRscjRmUXUzNHR2eWlKSXVPeFR2T01Mb3NVYV8tVDhuM3dlM1RzR1pCYVdDenVIWVFtVHI1LUNJSWVfb0l6ME90NTE4ZQ?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/ukraine-seeks-nato-like-shield-from-us-counter-proposal-says"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNbi1DeDhQVWVXeFE3a01HWTJtbUl3VkpOeVFOTE5mSEN4cHJoSnJTd1MwLXpmT1VBWFF4M01FX3g3LVVnVHh4YVVYdFFaLW52c3F6OEFBUUtOYi05YWt0MU1GWXJuRXpBVmFocFRscjRmUXUzNHR2eWlKSXVPeFR2T01Mb3NVYV8tVDhuM3dlM1RzR1pCYVdDenVIWVFtVHI1LUNJSWVfb0l6ME90NTE4ZQ?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.848,
      "consensus": 0.591,
      "constructiveness": 0.056,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine and its European allies plan to propose that any talks with Russia about territorial changes should only begin after fighting stops along the current front lines. This counter-proposal, to be presented to the US in Switzerland, also seeks security guarantees similar to NATO protection. The proposal outlines Ukraine's conditions for future negotiations with Russia.",
    "constructiveness_score": 0.056,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.10, neg_sim=0.06; semantic_boost=0.01",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  }
]