[
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) during ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7502324055439815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39755810138599534,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and its Department of Government Efficiency from breaking down the Consumer Financial Protection Bureau (CFPB) while legal actions are still happening."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has updated its Windows 11 Insider Preview, removing a bypass script that previously allowed users to set up the operating system without an internet connection and logging in. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged in during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7462291534490741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39655728836226856,
    "summary": "Microsoft updated its Windows 11 Insider Preview, eliminating a script that let users install the OS without an internet connection and without logging in. Now, all Windows 11 devices must be connected to the internet and logged in during setup."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until Monday, March 31st, offering a wide range of deals accessible without an Amazon Prime membership. The sale features over 100 deals on popular products, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7379421416435186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3944855354108796,
    "summary": "Amazon's Big Spring Sale, ending on March 31st, features over 100 deals on popular products, accessible to all shoppers without requiring an Amazon Prime membership. The sale also includes a variety of low-cost alternatives."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has purchased the social media platform X, previously Twitter, in an all-stock deal. Musk valued xAI at $80 billion and X at $33 billion, which includes $12 billion of debt. This acquisition comes years after Musk originally bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7319708383564815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39299270958912036,
    "summary": "Elon Musk's AI firm, xAI, has acquired the social media platform X (formerly Twitter) in an all-stock transaction, valuing xAI at $80 billion and X at $33 billion, including $12 billion in debt. This follows Musk's initial purchase of Twitter for $44 billion years earlier."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature aims to enable IT professionals to remotely recover devices that won't boot, a response to prevent incidents similar to the previous year's Crowdstrike catastrophe. The initiative was first announced by Microsoft last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7245685175578704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3911421293894676,
    "summary": "Microsoft has started testing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This tool is designed to help IT professionals remotely fix devices that fail to boot, aiming to avoid situations like last year's Crowdstrike incident. The feature was first announced by Microsoft in the previous year."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year. This decision follows Google's acquisition of Fitbit in early 2021 and their efforts to integrate Fitbit services with Google's. Initially, users were required to make this migration by 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7084462875578703,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38711157188946754,
    "summary": "Google has postponed the requirement for Fitbit users to switch their accounts to Google accounts until next year, following its acquisition of Fitbit in 2021. The initial deadline for account migration was set for 2025."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer ties with the Trump administration following obstacles in international discussions. Initially sponsored by Nauru, TMC's efforts in 2021 accelerated efforts to establish regulatory frameworks for deep-sea mining."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6979965928587963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3844991482146991,
    "summary": "The Metals Company (TMC), pursuing deep-sea mining, sought to strengthen connections with the Trump administration after facing challenges in global talks. Sponsored by Nauru in 2021, TMC aimed to speed up the creation of regulations for deep-sea mining."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its first major sale event of 2025, called the Big Spring Sale, which coincides with the start of the warmer months. Running until Monday, March 31st, the sale offers discounts on a variety of items including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6889468056365741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38223670140914356,
    "summary": "Amazon has initiated its first major sale of 2025, named the Big Spring Sale, aligning with the onset of spring. The sale, which concludes on March 31st, features discounts on a range of products such as gardening supplies and bedding."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Popular YouTuber MrBeast and author James Patterson are collaborating on a thriller novel with similarities to \"Squid Game\". The untitled book, which involves players surviving deadly tests, has attracted eight-figure bids for its publishing rights, as reported by Deadline."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.678625991076389,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37965649776909727,
    "summary": "Popular YouTuber MrBeast and author James Patterson are collaborating on a thriller novel reminiscent of \"Squid Game,\" involving players in deadly tests. The untitled book has received eight-figure bids for its publishing rights, according to Deadline."
  },
  {
    "title": "Lenovo’s upcoming SteamOS handheld will cost $50 more than expected",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:16:01-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lenovo introduced its Legion Go S handheld gaming PC at CES 2025, powered by SteamOS, priced at $499.99. This positions it as a competitor to Valve's Steam Deck, fitting between their $399 LCD and $549 OLED models."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.670594823761574,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37764870594039346,
    "summary": "Lenovo unveiled the Legion Go S, a handheld gaming PC, at CES 2025. Running on SteamOS, it is priced at $499.99, placing it between Valve's Steam Deck models in terms of cost."
  },
  {
    "title": "Over 150 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:18:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, causing tremors that were felt in neighboring south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, with its tremors reaching neighboring south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Bangkok, Thailand, leading to concerns that workers might be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising concerns about the potential entrapment of workers within the structure."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:08:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit of the US Vice President and other high-ranking officials, describing it as showing a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards the visit of the US Vice President and other senior officials, labeling it as a display of \"lack of respect.\""
  },
  {
    "title": "Alex Warren was homeless and sleeping in friends' cars - now he's number one",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:37:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An influencer who transitioned into a music career is achieving chart success by creating music that addresses and aims to heal from personal trauma."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An influencer who moved into music is gaining chart recognition with songs that focus on overcoming personal trauma."
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada's leader as \"extremely productive.\" They plan to meet again following Canadian elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US President described talks with Canada's leader as \"extremely productive\" and announced plans for another meeting after the Canadian elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, expressing their pain and suffering due to the disappearance of their loved ones."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have expressed their anguish to the BBC over the disappearance of their loved ones, sharing their pain and suffering."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, a public figure, has been mocked for disguising himself during a TV appearance years ago to promote his own book."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki, a public figure, faced ridicule for wearing a disguise during a television appearance several years ago, where he promoted his own book."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event due to the presence of far-right European politicians."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests occurring in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the country."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. The event took place hours after the rocket attack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah location in response to two rockets fired from southern Lebanon into northern Israel. This military action occurred hours after the initial rocket attack."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced allegations of copying the 1979 disco song \"Wiggle and Giggle All Night,\" leading to plagiarism claims."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarism for allegedly copying elements from the 1979 disco track \"Wiggle and Giggle All Night.\" The claims suggest similarities between the two songs."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The action is viewed as an effort to question the legitimacy of the current leadership in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The action is aimed at casting doubt on the legitimacy of Kyiv's current leadership."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests demanding the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to stage protests calling for the resignation of Zimbabwe's President Emmerson Mnangagwa."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children are among those who died in a recent incident. Further details about the victims have not been released."
  },
  {
    "title": "A rediscovered painting that just made Indian art history",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York, establishing a new record for the highest price achieved by the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan. The crew successfully completed the evacuation despite coming under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for successfully completing an evacuation mission at a South Sudan military base, despite being under attack."
  },
  {
    "title": "'It's going to get worse': American car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices for cars have significantly increased, with expectations of further rises, according to a car seller's statement to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, with further increases anticipated, a car seller told the BBC."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck amid a backdrop of civil war, food shortages, and a worsening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has occurred in a region already facing challenges from a civil war, food shortages, and a declining economy."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescue efforts in Mandalay. One rescuer reported digging through the rubble by hand to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage in Mandalay. Rescue teams, including individuals digging through rubble manually, are searching for survivors."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her lack of fear in her career, citing Charli XCX and Sabrina Carpenter as major inspirations for her boldness and artistic direction."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed that she is not afraid to take risks in her career, attributing her courage and artistic direction to the influence of Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments from across Africa and beyond. The selection highlights significant events, cultural expressions, and daily life scenes, capturing the continent's dynamic essence and the varied experiences of its people."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's standout photographs feature diverse moments from Africa and beyond, highlighting significant events, cultural expressions, and daily life, showcasing the continent's dynamic essence and the varied experiences of its people."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Shwe Sar Yan Pagoda, located south-east of Mandalay in Myanmar, experienced a collapse at its top due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Shwe Sar Yan Pagoda, situated southeast of Mandalay in Myanmar, suffered a collapse at its top following an earthquake."
  },
  {
    "title": "Bridge collapses into river in Mandalay, Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:49:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake struck central Myanmar, causing significant damage to the Ava Bridge near Mandalay, as shown in a video."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake hit central Myanmar, significantly damaging the Ava Bridge near Mandalay, as evidenced by video footage."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a growth factor cocktail that successfully reversed potentially fatal cell damage in mice infected with anthrax. This finding suggests the treatment could potentially be adapted for use in humans."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a treatment that reversed severe cell damage in mice with anthrax, indicating potential for human application."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created an advanced model that better predicts chemotherapy outcomes for muscle-invasive bladder cancer patients by combining whole-slide tumor imaging with gene expression analyses. This approach, utilizing AI and machine learning, surpasses older models that relied on just one type of data."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new model that improves predictions of chemotherapy success in muscle-invasive bladder cancer by integrating whole-slide tumor imaging with gene expression data. This method, employing AI and machine learning, outperforms previous models that only used one data type."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a link between dopamine and cognitive flexibility, finding that increased dopamine production in the brain improves efficiency in completing complex tasks. This discovery, made through PET imaging, could lead to better treatment methods for neurological and psychiatric disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that higher dopamine production in the brain is linked to improved cognitive flexibility, making it easier to complete complex tasks. This discovery, achieved using PET imaging, has the potential to enhance treatments for neurological and psychiatric disorders."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of the Toxoplasma gondii parasite. This insight could help understand how to control latency in other nervous system infections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can detect and control the inactive stage of the Toxoplasma gondii parasite. This discovery may aid in understanding how to manage dormant infections in the nervous system."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study examining nearly 270,000 seed plant species globally has identified how environmental conditions and dispersal barriers affect plant distributions. This research sheds light on why certain plants flourish in specific regions but not in others, by exploring how these patterns have evolved over millions of years."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species has explored why certain plants are found in specific regions but not others. The research focused on the impact of environmental conditions and dispersal barriers on plant distributions, offering insights into the evolution of these patterns over millions of years."
  },
  {
    "title": "Men's live tracker: 1-seeds Auburn, Houston being challenged with Elite Eight on the line",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:00:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm ready to help you summarize news content. Please provide the specific content from multiple news sources that you'd like summarized."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Please provide the specific news content you'd like summarized."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and grabbed 19 rebounds, leading LSU to an 80-73 victory over NC State. This win marks LSU's third consecutive Elite Eight appearance in the tournament, despite a challenging performance from Flau'Jae Johnson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow scored 30 points and had 19 rebounds, helping LSU win against NC State with a score of 80-73. This victory secured LSU's third straight Elite Eight appearance in the tournament, even with a strong performance from Flau'Jae Johnson."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:59 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater from online bullying, stating the ACL injury of JuJu Watkins was not caused by a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater against online bullying, clarifying that JuJu Watkins' ACL injury wasn't the result of a dirty play."
  },
  {
    "title": "Dodgers keep party going, get World Series rings",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Following their championship celebration, the Dodgers unveiled their World Series rings, which are made of 14-karat yellow gold and adorned with diamonds and sapphires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Dodgers celebrated their World Series victory by revealing their championship rings. These rings are crafted from 14-karat yellow gold and are embellished with diamonds and sapphires."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the women's NCAA tournament's two-host regional system, stating it has negatively impacted the game. He expressed strong disapproval of the decision-makers behind this format."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma criticized the women's NCAA tournament's two-host regional system, stating it negatively affects the game. He voiced disapproval of the decision-makers for this format."
  },
  {
    "title": "Vols stifle UK, one step from first Final Four trip",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tennessee defeated Kentucky 78-65, advancing to the Elite Eight of the NCAA tournament for the second consecutive year. The Volunteers excelled in both offense and defense during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tennessee won against Kentucky with a score of 78-65, moving to the Elite Eight in the NCAA tournament for the second year in a row. The Volunteers performed well in offense and defense."
  },
  {
    "title": "Ravens, Harbaugh reach extension through '28",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "John Harbaugh, the coach with the most wins in Ravens history, has signed a three-year extension, keeping him with the team until the 2028 season. This agreement comes as he was about to enter the last year of his current contract."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "John Harbaugh, the most successful coach in Ravens history, has signed a three-year contract extension, ensuring he stays with the team until the 2028 season. This new agreement was reached as he was entering the final year of his existing contract."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:59 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu won the women's figure skating world championship, becoming the first American to do so since 2006 by defeating three-time defending champion Kaori Sakamoto."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu won the women's figure skating world championship, marking the first victory for an American in the event since 2006. She triumphed over three-time defending champion Kaori Sakamoto to achieve this milestone."
  },
  {
    "title": "UCLA lands MWC player of year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:02:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season for New Mexico, has committed to UCLA following his entry into the transfer portal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard with an average of 20.4 points and 6.5 assists per game this season for New Mexico, has decided to transfer to UCLA."
  },
  {
    "title": "Women's March Madness Sweet 16: Live analysis, scores and analysis",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 22:56:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 phase, where the first four games have been played. This stage of the tournament is a key part of determining the teams that will advance further in the competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has advanced to the Sweet 16 stage, with the first four games completed. This phase is crucial in deciding which teams will move forward in the competition."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unusual series of events. Since his arrival, he has fully embraced his experience at the university, showing no regrets about his decision."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue involved a unique sequence of events. Since joining the university, he has fully embraced his time there and expresses no regrets about his choice."
  },
  {
    "title": "Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup for the basketball tournament was determined after Thursday's four games. These matches decided the first half of the teams advancing to the next stage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight teams in the basketball tournament were finalized following Thursday's games, determining the first half of the squads moving forward to the next round."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day within a four-day period."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' ballpark was quickly set up at the Yankees' spring training facility for Opening Day, with the transformation completed in just four days."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are ongoing regarding whether there has been a change in the style of play to be cleaner or if referees have become less inclined to call fouls."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Debate is ongoing among players, executives, and analysts about whether there has been a shift towards a cleaner style of play in the game, or if referees are now less likely to call fouls."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as our panel has cast their votes. The summary of each team's performance and schedule up until April 17 has been provided, offering insight into how the teams are positioned as the playoffs approach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is taking shape based on panel votes and team performance summaries up until April 17. This provides a clear view of team standings and their readiness as the playoffs near."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-breaking performance in a game against Travis Hunter, showcasing his potential for the NFL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a new record in a game facing Travis Hunter, highlighting his NFL prospects."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, who previously faced challenges with depression, has regained her passion for the sport. She is now aiming to qualify for the 2026 Olympics during the upcoming Saturday event at the World Championships."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, overcoming past struggles with depression, is now focused on qualifying for the 2026 Olympics. Her next opportunity to advance her goal comes this Saturday at the World Championships."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, playing for Fulham, has had an exceptional season, establishing himself as one of the top left backs globally. He aspires to achieve significant accomplishments with the U.S. team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has had an outstanding season, earning recognition as one of the leading left backs worldwide. He aims to reach major achievements with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 20:37:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL are striving to overcome Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Every team in the UFL is working hard to surpass Birmingham, the current top team in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Helen Hu, who had retired from gymnastics and was working at a hostel in Ecuador a year ago, won the SEC beam title this past weekend."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, a former gymnast who had retired and was working at a hostel in Ecuador last year, achieved a significant comeback by winning the SEC beam title this past weekend."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 22:51:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday, the top court in Catalonia, Spain, reversed the sexual assault conviction of Brazilian soccer player Dani Alves."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has expressed that the speculation surrounding his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Johnny Cardoso, a midfielder for Real Betis and the United States national team, stated that rumors of a possible move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain with Atlético Madrid for the next season, according to ESPN sources, despite his interest in moving to Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, ESPN sources report, despite his expressed interest in transferring to Major League Soccer (MLS)."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 22:51:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal steps against the Canadian soccer federation due to a severe knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation following a significant knee injury to Alphonso Davies."
  }
]