[
  {
    "title": "Masked Figures Spotted at Mosque Before Fire Amid Manchester Tensions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:56:15 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The images are of two people in balaclavas seen outside the mosque before the large blaze spread.",
      "The attack in East Sussex comes as Britain sees a wave of protests demonising Muslims and asylum seekers.",
      "The attack came at a time of heightened anxiety after a deadly terrorist attack at a synagogue in Manchester.",
      "<p>Fire at mosque in Peacehaven on Saturday night left front entrance damaged and a car burnt out</p><p>A suspected arson attack on a mosque in an English seaside town is being investigated by police as a hate crime.</p><p>The front entrance to the mosque in Peacehaven, East Sussex, was damaged and "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab75/live/689ba000-a1fe-11f0-947b-6b8b23372a50.jpg",
    "titles": [
      "Police release photos of mosque arson suspects",
      "UK police probe suspected arson attack on mosque as ‘hate crime’",
      "Fire at Peacehaven Mosque Is Being Treated as Hate Crime, UK Police Say",
      "Suspected arson attack at East Sussex mosque investigated as hate crime"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.916,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A video shows two individuals wearing balaclavas at a mosque before a significant fire erupts. This incident occurred amidst increased tension following a fatal terrorist attack at a Manchester synagogue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "George Russell Wins Singapore GP; McLaren Clinches 10th F1 Title",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 15:52:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ESPN",
      "The Guardian",
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.espn.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Red Bull&#039;s Verstappen finished second - and McLaren&#039;s Norris, in third, has a 22-point lead in the drivers&#039; standings.",
      "McLaren secured its second successive Formula 1 constructors' championship at the Singapore Grand Prix.",
      "<ul><li><p>Mercedes driver triumphs as McLaren take team title</p></li><li><p>Verstappen second, Norris third, Piastri fourth</p></li></ul><p>The champagne was popping in abundance for McLaren as the team secured their 10th Formula One constructors’ championship at the Singapore Grand Prix, but ther",
      "<p>George Russell won the Singapore Grand Prix in dominant style Sunday as McLaren secured the Formula 1 constructors’ championship with six races to go.</p>"
    ],
    "image_url": "",
    "titles": [
      "Russell wins Singapore GP for Mercedes; McLaren secure constructors’ title",
      "McLaren wins back-to-back F1 constructors' title",
      "George Russell wins F1 Singapore GP as Norris nibbles at angry Piastri’s lead",
      "George Russell wins F1’s Singapore GP as McLaren secures constructors’ title"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.914,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "George Russell won the Singapore Grand Prix, leading ahead of Max Verstappen, Lando Norris, and Oscar Piastri. With this victory, McLaren has mathematically clinched their tenth Formula 1 constructors' championship title, achieving the feat with six races remaining in the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syria Holds First Parliamentary Elections Post-Assad Era",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 04:20:44 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "CityNews",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.npr.org",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Syria is holding parliamentary elections on Sunday for the first time since the fall of the country's longtime autocratic leader, Bashar Assad, who was unseated in a rebel offensive in December.",
      "<p>After more than a decade of civil war, committee members will choose transitional parliament</p><p>Syria is holding its first parliamentary elections since the fall of its longtime ruler Bashar al-Assad, in a tentative step towards democratic polls that have been criticised as biased in favour of",
      "Syrians are voting indirectly, and President Ahmed al-Shara is appointing a third of the lawmakers. Still, some see this as a step forward after decades of dictatorship.",
      "DAMASCUS, Syria (AP) — Syria on Sunday held its first parliamentary elections, nearly a year after a rebel-led offensive unseated longtime autocratic leader Bashar Assad. The People’s Assembly will be tasked with passing a new elections law and constitution as the country moves through its post-Assa"
    ],
    "image_url": "",
    "titles": [
      "What to expect as Syria holds first parliamentary elections since Assad's ouster",
      "Syria holds first elections since fall of Bashar al-Assad",
      "Syria Chooses Its First Parliament Since End of Civil War",
      "Syria holds first elections since Assad’s ouster, marking a cautious step in political transition"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.782,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Syria conducted its first parliamentary elections since the ousting of Bashar Assad in December. President Ahmed al-Shara is appointing one-third of the lawmakers in these indirect elections. Despite the unconventional voting process, some view it as progress following years of autocratic rule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel, Hamas to Hold Indirect Cairo Talks Amid Gaza War Optimism",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 18:08:39 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Negotiators to meet in Egypt after partial acceptance of Donald Trump’s plan for Gaza",
      "<p>Secretary of state says ‘we’ll know very quickly whether Hamas is serious or not’ about release of hostages from Gaza</p><p>The US secretary of state, Marco Rubio, said on Sunday that the war in Gaza has not ended, despite Israel and Hamas both agreeing to aspects of Donald Trump’s plan for an en",
      "CAIRO (AP) — Israel and Hamas prepared for indirect negotiations in Egypt on Monday, as hopes for a possible ceasefire in Gaza grew after Prime Minister Benjamin Netanyahu said a hostage release could be announced this week. Tuesday marks two years since the Hamas attack that sparked the war. Presid"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F97060528-c83c-47c5-8430-bcd042344622.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Israel and Hamas prepare for crunch ceasefire talks",
      "Marco Rubio says Gaza war not yet over as Israel and Hamas prepare for talks",
      "Israel and Hamas prepare for negotiations in Egypt ahead of possible Gaza ceasefire"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.939,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Negotiators from Israel and Hamas are set to meet in Cairo for indirect talks after partially accepting Donald Trump's Gaza plan. U.S. Secretary of State Marco Rubio stated that the war in Gaza continues, but there is optimism for a ceasefire, especially with potential hostage releases. Both sides have shown some agreement to Trump's proposal, signaling a move towards negotiations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rangers Fans Block Team Bus After 1-1 Draw, Protest Against Manager",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 18:16:46 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Angry Rangers fans try to prevent the team bus leaving the Falkirk Stadium following the 1-1 draw on Sunday, with a large police presence required to allow players and staff to exit.",
      "<ul><li><p>Chants target Russell Martin before sit-down protest</p></li><li><p>Under-fire manager escorted by security out of stadium</p></li></ul><p>Russell Martin accepted full responsibility after another dismal Rangers performance ended with a 1-1 draw at Falkirk after which enraged fans tried t",
      "Highlights of the Scottish Premiership match between Falkirk and Rangers."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/33ff/live/57609e70-a218-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Martin given police escort as Rangers fans block team bus",
      "Rangers fans angry at Russell Martin blockade team bus after Falkirk draw",
      "Falkirk 1-1 Rangers"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following a 1-1 draw between Falkirk and Rangers at the Falkirk Stadium, angry Rangers fans attempted to block the team bus, leading to a significant police response to ensure the departure of players and staff. The fans expressed their frustration through chants targeting manager Russell Martin and staged a sit-down protest. Martin, under intense scrutiny, was escorted by security from the stadium and later accepted full responsibility for the team's disappointing performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tampa Bay's Irving Out for Seahawks Game, Future Uncertain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:44:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The latest availability information on Tampa Bay's starting running back",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOLWg1aUFMSnl3aXBVb29xNFBlSzFwcDNLYTlHQjBfbTZrZVR3LVd3Qk1XLXZMenFXMjhkZGR4SmNpQzE5TkZKOGxsTzdza3ZqY1JxUEZCaC1DTnM3SWU2MUR3OEF6dzEyZGU3aFpUS1JtZVUxWk03aHgwdTYxa3BUMkNPS01EaVk?oc=5\" target=\"_blank\">Lamar Jackson Injury Update: Ravens QB Could",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxOUC1pSUh5ZW1yWFZabkY3NkVDTWlQOGNfQ0lhV25pSlNVVnFjdFB2YVNhVDFQd2RZbnpJRUdIQU5Ic3RMdFR1SmRFNDlXU0FOZC04eVZuYmFPaTZQWVpMeWVsWGEyTkI1YVh0VkctUlNjQ0xIRmc3MG1la2ZTVVdLZmNxYmpmMkYzS2lpMGJmWDVzS01PVUgtbkNzNA?oc=5\" target=\"_blank\">Ravens' Lamar Jac",
      "<p>Already slated to miss Sunday&#8217;s matchup against the Seattle Seahawks, Bucky Irving may have an extended stint on the sidelines. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/2e24ba36-48af-4ee7-9336-88fd55c79fec/bucky.png",
    "titles": [
      "Bucky Irving injury update: Bucs star RB dealing with multiple injuries, could miss multiple weeks, per report",
      "Lamar Jackson Injury Update: Ravens QB Could Miss Multiple Weeks - Sports Illustrated",
      "Ravens' Lamar Jackson Gets Official Status Update vs. Texans - Sports Illustrated",
      "Report: Buccaneers RB Bucky Irving expected to miss at least two weeks"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.912,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tampa Bay's starting running back, Bucky Irving, will miss the upcoming game against the Seattle Seahawks and might have a prolonged absence. The team is facing uncertainty regarding Irving's availability for future games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Advisor Hopes for Deal to End Shutdown Amid Tax Credit Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:17:50 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNU0pXd1FFQ2xva1lRY3Y5WGNlbjkyekVyY184TGdRZjNiMmxEajk2ZFdUcFRqYmtpQ1gxb1QxYVd4akVnMUluUC1GWDBuckdpQ2ZLQ016eGJxOExQSnJBVThjUHAwdGdHcnhiWVduc0xuV3hnSEd0SG54QzV3bEI4VlA5ZTFiZ00?oc=5\" target=\"_blank\">Trump adviser: Layoffs will start if shutdow",
      "Democrats are holding firm on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in funding legislation.",
      "Top White House economic advisor Kevin Hassett said he's hopeful lawmakers can reach an agreement to end the government shutdown before layoffs begin."
    ],
    "image_url": "",
    "titles": [
      "Trump adviser: Layoffs will start if shutdown negotiations are \"going nowhere\" - Axios",
      "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
      "Kevin Hassett says 'there will be layoffs' if Trump decides shutdown talks are not progressing"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.885,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Top White House economic advisor Kevin Hassett expressed hope for an agreement to end the government shutdown and prevent layoffs. The deadlock persists as Democrats demand a permanent extension of enhanced premium tax credits in the funding legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Canadians Detained in Israel After Joining Pro-Palestinian Flotilla",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 16:15:21 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Global Affairs Canada did not identify the detained Canadians or disclose if there are others involved, stating no further information can be shared due to privacy laws.",
      "Global Affairs Canada says it is aware that two Canadian citizens have been detained in Israel following their involvement in a flotilla to Gaza. The Global Sumud Flotilla is a pro-Palestinian fleet of boats aiming to bring humanitarian aid to Gaza. Global Affairs Canada did not identify the detaine"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/Canadians-Gaza-flotilla.jpg?quality=65&strip=all",
    "titles": [
      "Israel detained two Canadians over Gaza flotilla, Ottawa says",
      "Two Canadians detained in Israel over flotilla to Gaza: Global Affairs Canada"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.713,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two Canadian citizens have been detained in Israel after participating in the Global Sumud Flotilla, a pro-Palestinian initiative aiming to deliver humanitarian aid to Gaza. Global Affairs Canada, respecting privacy laws, has not disclosed the identities of the detained Canadians or if others are involved.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Winnipeg Jets Extend Nikita Chibrikov's Contract for Two Years",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 18:29:01 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Winnipeg Jets have signed forward Nikita Chibrikov to a two-year contract extension, the club announced Sunday.",
      "<p>The Winnipeg Jets have signed forward Nikita Chibrikov to a two-year contract extension, the club announced Sunday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/cbe070ec9fb90f7f0de67ebbf8e1acab2ab761886c0acbb0d5fd1861f4dafdc9.jpg?quality=65&strip=all",
    "titles": [
      "Jets sign Chibrikov to two-year extension",
      "Jets sign forward Nikita Chibrikov to two-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.698,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The Winnipeg Jets have signed forward Nikita Chibrikov to a two-year contract extension, the club announced Sunday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester United Eyes Barcelona's Ter Stegen: Transfer Talk Report",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 15:42:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Manchester United are among the Premier League clubs eyeing Barcelona goalkeeper Marc-André ter Stegen. Transfer Talk has the latest news and rumors.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE1xdlpiVFBRTW5ycHlnMjhFMUdSR2Q4OVdNWUI4NXpFbWkzbVVCV0w2N1NURFlaRlN2aDN5NHlfNXZ4QWpUdmxqUGgxczhzcEtmM1VCUkhYd3M0OFc3b3BacmtoNWh2WkVNcjBUT0FaY3BDV0xBakpwQjhoUHE?oc=5\" target=\"_blank\">Transfer Rumors: Mainoo Issues Man Utd Ultimatum; Yamal Unse"
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Man United eye Barcelona keeper Ter Stegen",
      "Transfer Rumors: Mainoo Issues Man Utd Ultimatum; Yamal Unsettled at Barcelona - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Manchester United is reportedly interested in Barcelona goalkeeper Marc-André ter Stegen, according to Transfer Talk. This development is part of the latest news and rumors circulating in the football world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny Hosts SNL Season 51 Premiere, Addresses Super Bowl Criticism",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 14:38:49 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Bad Bunny returned to <em>SNL </em>as a host for the second time, and the musician addressed criticism over his upcoming Super Bowl performance.",
      "Saturday Night Live kicked off its 51st season with host Bad Bunny and musical guest Doja Cat."
    ],
    "image_url": "",
    "titles": [
      "SNL roasts Trump in season premiere, as Bad Bunny addresses Super Bowl criticism",
      "Bad Bunny Hosts ‘SNL’ Season 51 Premiere With Doja Cat And Jon Hamm"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bad Bunny hosted \"Saturday Night Live\" (SNL) for the second time as it launched its 51st season, with Doja Cat as the musical guest. During the episode, Bad Bunny addressed criticism regarding his upcoming Super Bowl performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Georgia PM Vows Crackdown on Protesters, Accuses EU Envoy of Coup Support",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-05T19:34:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Prime Minister Kobakhidze vowed \"no one will go unpunished\" after Saturday's clashes between police and anti-government protesters. The EU has rejected claims it backed overthrowing him as \"disinformation.\"",
      "<p>Irakli Kobakhidze accused EU ambassador of supporting ‘attempt to overthrow constitutional order’ </p><p>Georgia’s prime minister, Irakli Kobakhidze, has announced a sweeping crackdown on dissent, accusing demonstrators who tried to storm the presidential palace of aiming to topple his government"
    ],
    "image_url": "",
    "titles": [
      "Georgia's prime minister promises crackdown on dissent",
      "Georgia’s prime minister announces crackdown on dissent after Tbilisi protests"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Georgia's Prime Minister Irakli Kobakhidze has pledged a strict crackdown following clashes between police and anti-government protesters, accusing them of trying to overthrow the government. He also accused the EU ambassador of supporting this alleged coup, a claim the EU has labeled as disinformation. Kobakhidze emphasized that \"no one will go unpunished\" in response to the Saturday protests.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Teams Deployed on Everest, Hundreds Safe After Blizzard",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 19:28:48 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Rescue teams have been deployed to clear the snow on the world's highest mountain, Chinese state media reports.",
      "<p>Hundreds of trekkers stranded by blizzard on eastern face of mountain in Tibet already guided to safety by rescuers</p><p>Rescue efforts are under way on Mount Everest after a snowstorm trapped nearly 1,000 people in campsites on the eastern side of the mountain, according to Chinese state media."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3a26/live/bb0f5800-a225-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Rescue efforts under way after 1,000 people trapped on Mount Everest slopes",
      "Mount Everest rescue under way after snowstorm traps nearly 1,000 people"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rescue teams were deployed on Mount Everest to clear snow after a blizzard trapped nearly 1,000 people. Chinese state media reports that hundreds of trekkers on the mountain's eastern face in Tibet have been guided to safety. The rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Derrick Henry Ties With Walter Payton for 5th in Career Rushing TDs",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 19:25:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportingnews.com",
      "ravenswire.usatoday.com"
    ],
    "snippets": [
      "Henry and Payton are tied for fifth all-time in career rushing touchdowns",
      "The future Hall of Famer continues to climb up leaderboards.",
      "It was about the only thing to go right for Baltimore.",
      "Derrick Henry scored his 110th rushing touchdown on Sunday, tying him with Hall of Famer Walter Payton for fifth all-time."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/0d13ca40-fb30-4df3-a25a-ef1c5a8e6b40/henry25.jpg",
    "titles": [
      "Ravens' Derrick Henry ties NFL legend Walter Payton with 110th career rushing touchdown",
      "Ravens RB Derrick Henry climbs up all-time NFL touchdown leaderboard with latest score",
      "Ravens' Derrick Henry ties Walter Payton on NFL history TD record list",
      "Ravens RB Derrick Henry ties Walter Payton for fifth all-time with 110 rushing touchdowns"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Derrick Henry scored his 110th rushing touchdown, tying with Walter Payton for fifth all-time in career rushing touchdowns. This achievement was a highlight for Baltimore, despite other challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Detain and Deport Gaza-Bound Activists; Allegations of Mistreatme",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:26:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Activists deported from Israel following their arrest in the aid flotilla to Gaza say they were treated &#039;like monkeys&#039;.",
      "Activists from the Global Sumud Flotilla who hoped to reach Gaza have been deported after being intercepted and detained",
      "ROME (AP) — Some of the activists detained while trying to reach Gaza by sea have returned to their home countries to describe mistreatment at the hands of Israeli guards, claims that Israel denies. Some 450 activists were arrested as Israeli forces intercepted the Global Sumud Flotilla, a fleet of "
    ],
    "image_url": "",
    "titles": [
      "More Gaza flotilla activists allege mistreatment in Israeli detention",
      "Freed flotilla activists describe mistreatment in Israeli detention",
      "Gaza flotilla activists allege mistreatment while being detained in Israel"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Activists from the Global Sumud Flotilla, attempting to reach Gaza, were intercepted, detained, and deported by Israeli forces. Upon returning, Italian journalist Saverio Tommasi and others claimed they were mistreated and deprived of medicines by Israeli soldiers, allegations that Israel denies. Some 450 activists were involved in the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Candles Lit for Manchester Attack Victims; Hamas Leadership Weakened",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 19:50:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Candles were also lit for those affected by a deadly attack outside a Manchester synagogue on Thursday.",
      "The military leadership of Hamas has been decimated, and it is unclear how many fighters the group still has. Still, it remains able to conduct guerrilla attacks."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e22f/live/65e7d860-a203-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Thousands gather in London to mark two years since 7 October attacks",
      "How strong is Hamas two years after October 7 attacks?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Candles were lit in memory of victims of a fatal attack outside a Manchester synagogue on Thursday. Meanwhile, Hamas's military leadership has suffered significant losses, diminishing its numbers. Despite this, the group retains the capability to carry out guerrilla attacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Football Highlights: Key Matches and Women's Transfer Records Shattered",
    "domain": "sports",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Sun, 05 Oct 2025 20:00:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Week 5 highlights, including Manchester United v Chelsea and Manchester City v Arsenal.",
      "The women's football transfer record was broken four times in two months this year and has risen almost 600% since 2019. It reflects a growing commercial relevance but poses issues for some, including the Bundesliga."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0m55249.jpg",
    "titles": [
      "The Women's Football Show",
      "Women's football: What escalating transfer records mean"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 5 of the football season featured key matches, with Manchester United facing Chelsea and Manchester City playing against Arsenal. Additionally, the women's football transfer record was broken four times in two months, marking a nearly 600% increase since 2019. This trend highlights the sport's rising commercial importance but also brings challenges, particularly for the Bundesliga.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Guardiola Credits Haaland, Donnarumma for 250th Premier League Win",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 19:35:28 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>‘I have an incredible striker and keeper’ says manager</p></li><li><p>Pep ‘honoured’ to gain 250th Premier League win</p></li></ul><p>Pep Guardiola was thankful his Manchester City team has Erling Haaland scoring goals and Gianluigi Donnarumma stopping them after victory at Brentford came",
      "FREE TO WATCH: Highlights from Brentford&#8217;s match against Manchester City in the Premier League."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ecf5ee0d2722bf2e7aee067fbc768074684d6ce5/2629_324_1930_1544/master/1930.jpg?width=140&quality=85&auto=format&fit=max&s=e9c01abf931d037fcb4611a6fdcf6392",
    "titles": [
      "Guardiola hails ‘incredible’ Haaland and Donnarumma after City’s win at Brentford",
      "Unstoppable Haaland at his best as Man City win against Brentford!"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pep Guardiola expressed gratitude for having Erling Haaland as a striker and Gianluigi Donnarumma as a goalkeeper following Manchester City's victory over Brentford. This win marked Guardiola's 250th Premier League victory. He highlighted the importance of both players in achieving this milestone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moscow Escalates Attacks on Ukraine's Energy Infrastructure",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 13:58:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Moscow has stepped up its attacks in recent weeks, particularly on Ukraine&#039;s energy grid and gas production sites.",
      "The drone and missile assault hit nine regions and left tens of thousands without electricity as Russia ramps up its energy war ahead of winter in Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Five killed across Ukraine in overnight Russian attacks",
      "Russian air attack across Ukraine damages energy networks, kills five"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moscow increased its attacks on Ukraine, targeting the country's energy grid and gas production sites, affecting nine regions. The drone and missile strikes have left tens of thousands without electricity, intensifying Russia's energy war on Ukraine as winter approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown May Impact Wall Street, NHL Season Begins with Key Storyline",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 16:11:13 GMT",
    "source": "CNBC",
    "sources": [
      "Sportsnet",
      "CNBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cnbc.com"
    ],
    "snippets": [
      "The longer the shutdown drags on, the more impact it may have on Wall Street.",
      "<p>A fresh NHL season is set to begin — and with it comes plenty of questions. Sportsnet&#8217;s Emily Sadler breaks down nine storylines worth keeping an eye on.</p>"
    ],
    "image_url": "",
    "titles": [
      "Here are the 3 big things we're watching in the stock market this week",
      "Nine NHL storylines we’re watching this season"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The ongoing government shutdown is expected to increasingly affect Wall Street the longer it continues. Meanwhile, a new NHL season is starting, with Sportsnet's Emily Sadler highlighting nine key storylines to watch.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's Album Movie Earns $33M in U.S. Opening",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:17:22 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Taylor Swift's \"The Life of a Showgirl\" album movie generated an estimated $33 million domestically.",
      "The film, tied to Swift’s newly released “The Life of a Showgirl” album, grossed $15.8 million Friday alone."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift's 'The Life of a Showgirl' album release party snares $33 million domestically",
      "Taylor Swift’s ‘Official Release Party Of A Showgirl’ Hits No. 1 And Dominates Box Office During Single Weekend Run"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.885,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Taylor Swift's \"The Life of a Showgirl\" album movie earned around $33 million in the U.S., with $15.8 million coming in on its opening day. The film is linked to Swift's latest album release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OPEC+ Agrees to Increase Oil Production in November Amidst Member Disagreement",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 12:36:00 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "OPEC+ agreed to a modest increase in its November oil production as group leaders Saudi Arabia and Russia overcame a difference in position.",
      "OPEC+ is close to an agreement in principle to make another modest supply increase for November, overcoming a difference in position between group leaders Saudi Arabia and Russia.",
      "NEW YORK (AP) — A group of countries that are part of the OPEC+ alliance of oil-exporting countries has agreed to a small boost in oil production, citing a steady global economic outlook. The group said after a virtual meeting on Sunday that it will raise oil production by 137,000 barrels per day in"
    ],
    "image_url": "",
    "titles": [
      "OPEC+ Agrees to Modest Oil Production Increase for November",
      "OPEC+ Nears Agreement for Modest November Production Hike",
      "OPEC+ to raise oil production by 137,000 barrels per day in November"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OPEC+ has agreed to a modest increase in oil production for November, resolving a disagreement between Saudi Arabia and Russia, the group's leading members. This decision aims to adjust supply in response to global demand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Order to Deploy National Guard in Portland",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 20:15:30 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "A federal judge has temporarily blocked the Trump administration from deploying the National Guard to Portland, Ore., which the president had ordered over the objections of local leaders.",
      "A federal judge already temporarily blocked the Trump administration from deploying the Oregon National Guard."
    ],
    "image_url": "",
    "titles": [
      "Federal judge temporarily blocks Trump's National Guard deployment to Portland",
      "Trump Sending California National Guard To Portland After Judge Blocked Oregon Guard Deployment, Newsom Says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.66,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge has temporarily halted President Trump's order to deploy the National Guard to Portland, Oregon, against local leaders' wishes. This decision stops the federalization and deployment of the Oregon National Guard to address unrest in Portland.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Jony Ive to Launch Palm-Sized AI Assistant Next Year",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 04:00:15 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "TechCrunch"
    ],
    "domains": [
      "www.ft.com",
      "techcrunch.com"
    ],
    "snippets": [
      "ChatGPT maker is working with former Apple design boss to launch a palm-sized personal assistant next year",
      "OpenAI and Jony Ive reportedly face significant technical challenges as they work to develop a screen-less, AI-powered device."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7f28c179-376b-4d9a-aab4-014223a55dea.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "OpenAI and Jony Ive grapple with technical issues on secretive AI device",
      "OpenAI and Jony Ive may be struggling to figure out their AI device"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.699,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI, the creator of ChatGPT, is collaborating with Jony Ive, former Apple design chief, to release a small, palm-sized personal assistant in the upcoming year. Despite facing substantial technical hurdles, they aim to develop this AI-powered, screen-less device.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]