[
  {
    "title": "Drag Race and Pose star Jiggly Caliente dies aged 44",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:52:41 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The drag performer had part of her leg amputated on Thursday after a \"severe infection\", her family says."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e692/live/6687c9a0-2356-11f0-9c65-a5c3dc449bf3.jpg",
    "titles": [
      "Drag Race and Pose star Jiggly Caliente dies aged 44"
    ],
    "summary": "A drag performer underwent amputation of part of her leg due to a severe infection, according to her family's statement on Thursday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the personal life of a celebrity, but it does not provide any deeper understanding or actionable insights for the reader. It does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.998,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.445,
    "normalized_score": 7.37
  },
  {
    "title": "‘A tree is worth more’: The civilians who fled Zamzam as the RSF attacked",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:51:08 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hundreds have been killed, injured, assaulted, kidnapped. Here are some stories of survivors living with painful loss."
    ],
    "image_url": "",
    "titles": [
      "‘A tree is worth more’: The civilians who fled Zamzam as the RSF attacked"
    ],
    "summary": "Hundreds of individuals have experienced violence, resulting in deaths, injuries, assaults, and kidnappings. Survivors are coping with the aftermath of these traumatic events, facing significant emotional and physical pain due to their losses.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about the violent events in Zamzam and the aftermath experienced by the survivors. However, it lacks depth or insight into the causes, systems, or trends that led to these events, and does not provide information on any attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.997,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.464,
    "normalized_score": 8.48
  },
  {
    "title": "Greenland not a piece of property, says PM after Trump threats",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:46:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jens-Frederick Nielsen says the island must \"stand together\" with Denmark during a highly symbolic visit to Copenhagen."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5b74/live/216d0650-237e-11f0-9a20-734d54da1b3c.jpg",
    "titles": [
      "Greenland not a piece of property, says PM after Trump threats"
    ],
    "summary": "During a significant visit to Copenhagen, Jens-Frederick Nielsen emphasized the importance of unity between the island he represents and Denmark. He urged for a collective stand with Denmark, highlighting the symbolic nature of his trip and the need for cooperation and solidarity between the two.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story offers a useful context for understanding the political relationship between Greenland and Denmark. It highlights the importance of unity and cooperation, providing a sense of agency for the reader. However, it does not clearly highlight progress or solutions.",
    "score_components": {
      "magnitude": 0.07,
      "recency": 0.996,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.49,
    "normalized_score": 10.0
  },
  {
    "title": "Iran’s President Pezeshkian visits injured, site of deadly port explosion",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:28:48 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The fiery blast at the Shahid Rajaee port in southern Iran has killed at least 28 people and wounded some 1,000 others."
    ],
    "image_url": "",
    "titles": [
      "Iran’s President Pezeshkian visits injured, site of deadly port explosion"
    ],
    "summary": "A deadly explosion at Shahid Rajaee port in southern Iran resulted in at least 28 fatalities and approximately 1,000 injuries.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of an incident, but it doesn't provide any deeper understanding or actionable insights. It doesn't report on any solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.992,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.463,
    "normalized_score": 8.42
  },
  {
    "title": "At least nine killed after car driven through Vancouver street festival",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:14:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police say the suspect drove into pedestrians at Lapu Lapu celebrations in the western Canadian city."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8f07/live/a4ac6810-2330-11f0-9540-bb15794d6274.jpg",
    "titles": [
      "At least nine killed after car driven through Vancouver street festival"
    ],
    "summary": "A suspect drove into pedestrians during the Lapu Lapu celebrations in a western Canadian city, according to police reports. The current status of the incident, including the condition of the pedestrians or the motive of the suspect, has not been disclosed. Authorities are investigating.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story only provides basic awareness of an incident. It lacks deeper understanding, actionable insights, and doesn't report on any solutions or attempts to solve the problem. It doesn't increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.989,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.442,
    "normalized_score": 7.19
  },
  {
    "title": "Chelsea ripped apart as Barcelona reach Champions League final",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:53:41 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This was supposed to be the season Chelsea finally found a way to beat Barcelona."
    ],
    "image_url": "",
    "titles": [
      "Chelsea ripped apart as Barcelona reach Champions League final"
    ],
    "summary": "Chelsea faced Barcelona with high expectations of overcoming their rivals this season. However, the outcome did not meet these expectations, indicating that Chelsea was unable to secure a victory against Barcelona as hoped.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a sports event but doesn't contribute meaningfully to the reader’s understanding, decision-making, or sense of agency. It doesn't report on any solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.35,
    "normalized_score": 1.81
  },
  {
    "title": "Højlund rescues point for United at Bournemouth as fans miss glories past",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:53:21 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rasmus Højlund equalised for Manchester United in stoppage time after Antoine Semenyo scored the opener for Bournemouth in the 23rd minute to finish the score at 1-1"
    ],
    "image_url": "",
    "titles": [
      "Højlund rescues point for United at Bournemouth as fans miss glories past"
    ],
    "summary": "Rasmus Højlund scored for Manchester United in stoppage time, securing a 1-1 draw against Bournemouth. Antoine Semenyo had earlier put Bournemouth ahead in the 23rd minute. The match concluded with both teams sharing points.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the outcome of a football match but does not provide depth or insight into the strategies used, the performance of the players, or the implications for the teams' standings.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.35,
    "normalized_score": 1.81
  },
  {
    "title": "Hojlund spares Man Utd blushes at 10-man Bournemouth",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:53:19 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On the day Liverpool look likely to equal their record of 20 top flight titles Manchester United could only manage a draw with Bournemouth, despite playing against 10 men for the final quarter of the game. This was another late rescue act, although Rasmus Hojlund’s equaliser was more of a face-saving exercise than the heroics against Lyon two weeks ago. There was no outpouring of emotion to match the mood of Old Trafford then, just a sense that things could have been a lot worse."
    ],
    "image_url": "",
    "titles": [
      "Hojlund spares Man Utd blushes at 10-man Bournemouth"
    ],
    "summary": "On the day Liverpool was poised to match their record of 20 top-flight titles, Manchester United ended in a draw against Bournemouth, even with a one-man advantage for the last 25 minutes of the match. Rasmus Hojlund scored an equalizing goal, which served more as a damage control effort than a triumphant moment, unlike their previous match against Lyon. The reaction at Old Trafford was subdued, reflecting relief rather than celebration, indicating a missed opportunity for Manchester United.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a more in-depth analysis of the match, including the context of Liverpool's potential title match and Manchester United's performance. It provides useful information about the state of the team and the reaction of the fans, contributing to a deeper understanding of the team's current situation.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.38,
    "normalized_score": 3.57
  },
  {
    "title": "UDFA tracker: Every undrafted rookie Patriots signed after 2025 NFL Draft",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:51:26 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 2025 NFL Draft is over, but the Patriots aren't done adding rookies. Here's every undrafted player Mike Vrabel's team is bringing in:"
    ],
    "image_url": "",
    "titles": [
      "UDFA tracker: Every undrafted rookie Patriots signed after 2025 NFL Draft"
    ],
    "summary": "The 2025 NFL Draft has concluded, and the Patriots, coached by Mike Vrabel, are actively signing undrafted rookies to their team. This move indicates the team's ongoing efforts to strengthen and diversify its roster beyond the draft selections.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about the Patriots' strategy following the NFL Draft. It informs readers about the team's approach to building its roster and provides insight into the importance of undrafted rookies in the team's plans. However, it does not highlight any specific solutions or innovations, nor does it provide details about the rookies signed.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.399,
    "normalized_score": 4.68
  },
  {
    "title": "Boston Red Sox’ Jarren Duran steals home",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:51:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "It marked the first time a Red Sox has had a straight steal of home plate since Jacoby Ellsbury did it in April 2009."
    ],
    "image_url": "",
    "titles": [
      "Boston Red Sox’ Jarren Duran steals home"
    ],
    "summary": "A Boston Red Sox player successfully performed a straight steal of home plate for the first time since Jacoby Ellsbury accomplished the feat in April 2009. This event marks a significant moment for the team, highlighting a rare baseball achievement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.319,
    "normalized_score": 0.0
  },
  {
    "title": "Beijing’s flag-planting in South China Sea revives tensions with Manila",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:45:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Philippines sends forces to Sandy Cay in response to latest Chinese moves in Spratly Islands"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc6232011-558d-40fd-ba5a-6318dee22fa7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Beijing’s flag-planting in South China Sea revives tensions with Manila"
    ],
    "summary": "The Philippines has deployed forces to Sandy Cay following recent actions by China in the Spratly Islands, escalating tensions in the disputed South China Sea region. This move is a direct response to China's latest maneuvers, aiming to assert the Philippines' territorial claims.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the escalating tensions in the South China Sea region, providing useful context about the territorial disputes between China and the Philippines. However, it does not highlight any solutions or improvements, and its depth of insight is limited.",
    "score_components": {
      "magnitude": 0.07,
      "recency": 0.996,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.48,
    "normalized_score": 9.42
  },
  {
    "title": "Rubio says the coming week is 'very critical' in Russia-Ukraine war negotiations",
    "domain": "business",
    "location": "national",
    "published": "Sun, 27 Apr 2025 15:28:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Secretary of State's comments came after President Donald Trump questioned whether Russian President Vladimir Putin wants to \"stop the war\" against Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Rubio says the coming week is 'very critical' in Russia-Ukraine war negotiations"
    ],
    "summary": "Following President Donald Trump's inquiry about whether Russian President Vladimir Putin desires to end the conflict with Ukraine, the Secretary of State has commented on the situation. The current status or outcome of these discussions or the Secretary's specific remarks were not detailed in the provided content.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the ongoing negotiations between Russia and Ukraine, but it lacks depth and insight. It does not provide specific details about the discussions or the Secretary's remarks, and it does not highlight any progress or solutions.",
    "score_components": {
      "magnitude": 0.09,
      "recency": 0.992,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.375,
    "normalized_score": 3.27
  },
  {
    "title": "What makes ‘Reform-curious’ Labour voters so hard to woo back",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 15:00:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Downing Street fears Starmer will lose support to Farage but imitating him will alienate other groups it needs on side"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fcc7e2dd4-ffb8-4252-9fb4-2f45410ccdad.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What makes ‘Reform-curious’ Labour voters so hard to woo back"
    ],
    "summary": "Downing Street is concerned that Keir Starmer might lose support to Nigel Farage if he tries to imitate Farage's approach. However, they also believe that adopting similar tactics could alienate other important groups they need to maintain support from.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This article provides some insight into the political dynamics and strategies of the Labour party, which could be useful to readers interested in politics. However, it doesn't provide much depth or actionable insights, nor does it report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.986,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.471,
    "normalized_score": 8.89
  },
  {
    "title": "AI data center boom isn't going bust but the 'pause' is trending at big tech companies",
    "domain": "business",
    "location": "national",
    "published": "Sun, 27 Apr 2025 14:47:42 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Fears of an AI data center bust were stoked by Microsoft and Amazon headlines, but if anything, massive spending remains the bottom line."
    ],
    "image_url": "",
    "titles": [
      "AI data center boom isn't going bust but the 'pause' is trending at big tech companies"
    ],
    "summary": "Despite concerns that Microsoft and Amazon's recent headlines might indicate a downturn in AI data center investments, the reality is that both companies continue to heavily invest in this area. The situation underscores a significant ongoing expenditure in AI data centers rather than a reduction, dispelling fears of a bust.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story provides useful insights into the state of AI data center investments, dispelling fears of a downturn and highlighting the continued commitment of big tech companies. It empowers readers with knowledge about the industry's trends, which could influence their decision-making regarding investments or career choices.",
    "score_components": {
      "magnitude": 0.07,
      "recency": 0.983,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.427,
    "normalized_score": 6.32
  },
  {
    "title": "'Repowering' era for America's aging wind energy industry begins, despite Trump's effort to kill it",
    "domain": "business",
    "location": "national",
    "published": "Sun, 27 Apr 2025 14:45:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Onshore wind turbines cover many parts of the U.S. and Trump's attacks on renewable energy won't stop that, but aging wind energy infrastructure does need work."
    ],
    "image_url": "",
    "titles": [
      "'Repowering' era for America's aging wind energy industry begins, despite Trump's effort to kill it"
    ],
    "summary": "Despite former President Trump's criticisms of renewable energy, onshore wind turbines are widespread across the United States. However, there is a recognized need for maintenance and upgrades to the aging wind energy infrastructure to ensure its continued operation and efficiency.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This article increases awareness about the state of the wind energy industry in the US, highlighting the need for maintenance and upgrades. However, it doesn't provide specific solutions or details about the progress being made towards 'repowering' the infrastructure.",
    "score_components": {
      "magnitude": 0.07,
      "recency": 0.982,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.417,
    "normalized_score": 5.73
  }
]