[
  {
    "title": "Mexico's Judiciary Overhaul: Ruling Party Allies Win Supreme Court Seats",
    "domain": "general",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:38:26 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Judicial candidates closely linked to Mexico's ruling party have swept every position on the nation's newly transformed Supreme Court, according to final results released Wednesday from the controversial judicial vote.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mexican Supreme Court remake: Ruling-party loyalists dominate the new bench"
    ],
    "summary": "In Mexico, candidates with close ties to the ruling party have won all the positions in the recent Supreme Court elections, as confirmed by the final results announced on Wednesday. This development is part of a controversial overhaul of the nation's judiciary.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the political landscape in Mexico and potential implications of the judiciary overhaul. However, it doesn't provide solutions or progress on the issue, nor does it delve deeply into the causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.922,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.49,
    "normalized_score": 6.67
  },
  {
    "title": "Ex-Rams Player McQuaide Escorted From Church After Questioning Official",
    "domain": "general",
    "location": "national",
    "published": "Wed, 4 Jun 2025 18:20:19 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Police escorted ex-Rams Pro Bowl long snapper Jake McQuaide from an Ohio church after he questioned an official about computer porn rumors.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ex-Rams long snapper Jake McQuaide disrupts church by demanding answers in porn scandal"
    ],
    "summary": "Former Rams Pro Bowl long snapper Jake McQuaide was escorted out of an Ohio church by police following an incident where he questioned an official regarding rumors about computer pornography.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a specific incident involving a former Rams player. However, it lacks depth, doesn't provide actionable insights, and doesn't report on solutions or progress.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.861,
      "consensus": 0.283,
      "constructiveness": 0.3
    },
    "score": 0.457,
    "normalized_score": 3.98
  },
  {
    "title": "Man Arrested at JFK for Supplying Bomb Materials to Clinic Attacker",
    "domain": "general",
    "location": "national",
    "published": "Wed, 4 Jun 2025 14:58:19 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Federal authorities have arrested a man at JFK airport in New York who allegedly provided bomb ingredients to the suspect responsible for last month's attack on a fertility clinic in Palm Springs.</p>"
    ],
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/1451f99/2147483647/strip/false/crop/3600x2400+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2Fc4%2F7086ca3d405aafd3a0b410a5f9ee%2F1507438-me-palm-springs-bombing-update-10-ajs.jpg",
    "titles": [
      "Palm Springs accomplice fled to Europe after supplying ingredient for bomb, feds say"
    ],
    "summary": "Federal authorities arrested a man at JFK airport in New York for allegedly supplying bomb ingredients to the perpetrator of a bombing at a Palm Springs fertility clinic last month.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about a security incident and the arrest of a suspect. However, it doesn't provide deeper understanding or actionable insights, nor does it report on solutions or progress to prevent such incidents in the future.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.802,
      "consensus": 0.283,
      "constructiveness": 0.5
    },
    "score": 0.456,
    "normalized_score": 3.9
  },
  {
    "title": "Yucca Valley Man, 73, Denies Threatening Trump on Facebook",
    "domain": "general",
    "location": "national",
    "published": "Wed, 4 Jun 2025 02:23:11 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Yucca Valley resident Thomas Eugene Streavel, 73, pleaded not guilty Tuesday to three felony counts of making threats on Facebook against Donald Trump.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Dead man walking': SoCal man charged with threatening to assassinate Trump"
    ],
    "summary": "Thomas Eugene Streavel, 73, from Yucca Valley, has pleaded not guilty to three felony counts related to making threats against Donald Trump on Facebook.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a legal case involving threats against a public figure. However, it does not provide deeper insights or useful information beyond the immediate facts of the case.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.617,
      "consensus": 0.283,
      "constructiveness": 0.3
    },
    "score": 0.408,
    "normalized_score": 0.0
  },
  {
    "title": "Court: Removal of Soliman's Family Without Due Process May Cause Irreparable Har",
    "domain": "general",
    "location": "global",
    "published": "Wed, 04 Jun 2025 23:45:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "snippets": [
      "Federal court says removing the wife and children of Mohamed Soliman without due process could cause &#039;irreparable harm&#039;."
    ],
    "image_url": "",
    "titles": [
      "US judge halts deportation of family of suspect in pro-Israel rally attack"
    ],
    "summary": "A federal court ruled that the removal of Mohamed Soliman's wife and children without due process may result in 'irreparable harm'. This decision emphasizes the importance of following legal procedures in such cases to prevent potential lasting damage to the individuals involved.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the importance of due process in legal matters, especially those involving family separation. It emphasizes the potential harm of not following legal procedures, which can be useful for readers to understand the implications of such actions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.964,
      "consensus": 0.283,
      "constructiveness": 0.8
    },
    "score": 0.519,
    "normalized_score": 9.02
  },
  {
    "title": "Zack Steffen Out of US Gold Cup Camp Due to Knee Injury",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:13:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Zack Steffen injured a knee and became the second goalkeeper dropped from the United States' training camp ahead of the Concacaf Gold Cup."
    ],
    "image_url": "",
    "titles": [
      "USMNT's Steffen (knee) set to miss Gold Cup"
    ],
    "summary": "Zack Steffen, a goalkeeper, sustained a knee injury and was subsequently removed from the United States' training camp for the Concacaf Gold Cup. This makes him the second goalkeeper to be dropped from the team ahead of the tournament.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a change in a sports team due to an injury. However, it does not provide deeper insights or useful information beyond the immediate facts of the incident.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.914,
      "consensus": 0.283,
      "constructiveness": 0.5
    },
    "score": 0.456,
    "normalized_score": 3.9
  },
  {
    "title": "Chelsea FC Signs Striker Liam Delap from Ipswich Town",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:13:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Chelsea have bolstered their forward line with the signing of 22-year-old striker Liam Delap from Ipswich Town."
    ],
    "image_url": "",
    "titles": [
      "Delap joins Chelsea from Ipswich in $40.6m deal"
    ],
    "summary": "Chelsea Football Club has strengthened its attacking options by signing 22-year-old striker Liam Delap from Ipswich Town. This move is part of the club's efforts to enhance their forward line.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness about a recent development in the football world, but it doesn't offer any deep insights or actionable information for the reader. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.509,
      "recency": 0.914,
      "consensus": 0.283,
      "constructiveness": 0.4
    },
    "score": 0.523,
    "normalized_score": 9.35
  },
  {
    "title": "Finland Women's Team Mistakenly Calls Up Retired Player, Manager Apologizes",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:13:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Finland women's national team manager has apologised for mistakenly calling up a long-retired 51-year-old for this week's game against Serbia."
    ],
    "image_url": "",
    "titles": [
      "Finland mistakenly call up retired 51-year-old"
    ],
    "summary": "The manager of Finland's women's national football team issued an apology for erroneously summoning a 51-year-old retired player for a match against Serbia. This mistake was recognized and corrected, highlighting an unusual oversight in the team's selection process.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about an unusual incident in the selection process of a national football team. While it doesn't provide actionable insights, it does increase awareness about the importance of accurate player selection and the potential for human error in this process.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.914,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.466,
    "normalized_score": 4.72
  },
  {
    "title": "Dodgers Manager Gifts Pink Porsche to Ohtani's Daughter",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:12:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Dodgers manager Dave Roberts and his wife bought Shohei Ohtani's daughter a pink remote-controlled Porsche."
    ],
    "image_url": "",
    "titles": [
      "Dave Roberts jokingly gives Shohei Ohtani remote-controlled car for his daughter"
    ],
    "summary": "Dodgers manager Dave Roberts and his wife purchased a pink remote-controlled Porsche as a gift for Shohei Ohtani's daughter. This gesture highlights a personal connection between the families outside of their professional baseball affiliations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides an interesting anecdote about the personal lives of well-known sports figures, it offers minimal depth or insight into a broader issue or trend. It does not provide actionable insights or a deeper understanding of a particular topic.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.914,
      "consensus": 0.283,
      "constructiveness": 0.3
    },
    "score": 0.436,
    "normalized_score": 2.28
  },
  {
    "title": "NBA Finals Preview: Iconic Playoff Moments Captured in Images",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 4 Jun 2025 21:12:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "As we prepare for Game 1 of the NBA Finals, we take a look back at the iconic images that defined these playoffs."
    ],
    "image_url": "",
    "titles": [
      "From wild dunks to improbable comebacks: The top photos of the 2025 NBA playoffs"
    ],
    "summary": "As the NBA Finals approach, a review of the playoffs highlights iconic images that have marked this season's journey. These images capture pivotal moments and key players that have defined the path to the championship series. The focus is on preparing for Game 1, reflecting on the memorable visuals that have accompanied the teams' progress through the playoffs.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful context for the upcoming NBA Finals by highlighting key moments from the playoffs. While it doesn't necessarily offer actionable insights, it does contribute to a deeper understanding of the teams' journey to the championship series.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.914,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.466,
    "normalized_score": 4.72
  },
  {
    "title": "Bombing Suspect Used AI Chat to Research Explosives",
    "domain": "business",
    "location": "national",
    "published": "Wed, 04 Jun 2025 23:38:50 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The primary bombing suspect used an unnamed AI chat program to research information about \"explosives, diesel, gasoline mixtures and detonation velocity.\""
    ],
    "image_url": "",
    "titles": [
      "FBI says Palm Springs bombing suspects used AI chat program to help plan attack"
    ],
    "summary": "The primary suspect in a bombing case utilized an AI chat program to gather information on explosives, including diesel and gasoline mixtures, and their detonation velocity. This detail highlights the suspect's research activities related to the creation or use of explosive devices.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story does increase awareness about the potential misuse of AI technology, it doesn't provide a deeper understanding or suggest any solutions to this issue. The information is somewhat useful, but it lacks depth and insight.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.961,
      "consensus": 0.283,
      "constructiveness": 0.5
    },
    "score": 0.497,
    "normalized_score": 7.24
  },
  {
    "title": "Circle IPO Priced at $31/Share, Valuing Company at $6.8 Billion",
    "domain": "business",
    "location": "national",
    "published": "Wed, 04 Jun 2025 23:13:16 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Circle, the issuer of one of the biggest stablecoins, priced its IPO at $31per share, above its expected range and giving it a market value of $6.8 billion."
    ],
    "image_url": "",
    "titles": [
      "Stablecoin issuer Circle prices IPO at $31 per share, above expected range, ahead of NYSE debut"
    ],
    "summary": "Circle, the company behind one of the largest stablecoins, has set its initial public offering (IPO) price at $31 per share, surpassing the anticipated range. This pricing values the company at $6.8 billion.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information for investors or those interested in the financial market. It does not report on solutions or improvements, but it does provide a deeper understanding of the company's valuation and its initial public offering.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.953,
      "consensus": 0.283,
      "constructiveness": 0.8
    },
    "score": 0.516,
    "normalized_score": 8.78
  },
  {
    "title": "Jared Isaacman Steps Down as Shift4 CEO, Eyes NASA Role",
    "domain": "business",
    "location": "national",
    "published": "Wed, 04 Jun 2025 23:04:21 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Shift4 founder Jared Isaacman, who had been President Trump's pick to run NASA, told investors in a letter on Wednesday that he's giving up his CEO role."
    ],
    "image_url": "",
    "titles": [
      "After Trump pulled NASA nomination, Musk ally Jared Isaacman says stint in politics was 'thrilling'"
    ],
    "summary": "Jared Isaacman, the founder of Shift4 and President Trump's nominee for NASA leadership, announced in a letter to investors on Wednesday that he is stepping down from his role as CEO of Shift4.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about leadership changes in a significant company and potential changes in NASA's leadership. However, it doesn't provide in-depth insights or discuss potential impacts or solutions related to this leadership change.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.95,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.496,
    "normalized_score": 7.15
  },
  {
    "title": "Circle Raises IPO Size Again, Valuation Hits $8.06 Billion",
    "domain": "business",
    "location": "global",
    "published": "Wed, 04 Jun 2025 23:03:25 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Circle valued at $8.06 billion after stablecoin giant increases IPO deal size for second time."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/circle.jpg?w=2048",
    "titles": [
      "Circle raises $1.05 billion in long-awaited IPO, shares price at $31"
    ],
    "summary": "Circle, the company behind a major stablecoin, has raised its initial public offering (IPO) deal size for the second time, now valuing the company at $8.06 billion. This adjustment reflects the company's growing prominence in the cryptocurrency market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the company's growing prominence in the cryptocurrency market, which is useful for investors and those interested in the field. However, it does not delve into the implications of this growth or potential future trends.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.949,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.505,
    "normalized_score": 7.89
  },
  {
    "title": "'Mad Money' Host Tips China's Interest in U.S. Gas, Planes, Turbines, Nvidia",
    "domain": "business",
    "location": "national",
    "published": "Wed, 04 Jun 2025 23:02:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The 'Mad Money' host laid out a few U.S. exports China may want — natural gas, Boeing planes, turbines for power plants and Nvidia products."
    ],
    "image_url": "",
    "titles": [
      "Jim Cramer says Nvidia chips could give the U.S. leverage in the trade war with China"
    ],
    "summary": "The host of 'Mad Money' suggested that China might be interested in importing several U.S. products, including natural gas, Boeing airplanes, turbines for power plants, and Nvidia products. This selection highlights potential areas for increased trade between the U.S. and China.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into potential areas for increased trade between the U.S. and China, which can help readers understand the dynamics of international trade. However, it doesn't highlight specific solutions or progress in the trade relationship.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.949,
      "consensus": 0.283,
      "constructiveness": 0.8
    },
    "score": 0.525,
    "normalized_score": 9.51
  },
  {
    "title": "\"Discovery: Crystal Structures Morph to Boost Catalysis Efficiency at BESSY II\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 04 Jun 2025 22:13:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-surprised-as-crystal-structures-morph-into-super-catalysts/\" rel=\"nofollow\" title=\"Scientists Surprised as Crystal Structures Morph Into Super Catalysts\"><img alt=\"Chemistry Catalyst Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Chemistry-Catalyst-Concept-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Experiments at BESSY II show that during electrolysis, the structure breaks down into ultrathin nickel sheets, exposing the active catalytic centers to..."
    ],
    "image_url": "",
    "titles": [
      "Scientists Surprised as Crystal Structures Morph Into Super Catalysts"
    ],
    "summary": "Scientists conducting experiments at BESSY II discovered that crystal structures can transform into ultrathin nickel sheets during electrolysis, significantly enhancing their catalytic efficiency. This unexpected morphing exposes active catalytic centers more effectively, potentially leading to advancements in catalysis technology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports a significant scientific discovery that could lead to advancements in catalysis technology. It provides useful insights into the potential impact of this discovery and increases awareness about the role of crystal structures in catalysis.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.933,
      "consensus": 0.283,
      "constructiveness": 0.9
    },
    "score": 0.522,
    "normalized_score": 9.27
  },
  {
    "title": "MIT Develops Membrane to Cut Oil Refining Energy Use by Up to 90%",
    "domain": "science",
    "location": "global",
    "published": "Wed, 04 Jun 2025 21:48:44 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-mit-tech-could-cut-oil-refining-energy-by-90/\" rel=\"nofollow\" title=\"New MIT Tech Could Cut Oil Refining Energy by 90%\"><img alt=\"Crude Oil Refinery\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Crude-Oil-Refinery-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>MIT researchers have developed a new membrane that separates various types of fuel by molecular size, potentially eliminating the need for the energy-intensive process of crude oil distillation. Turning crude..."
    ],
    "image_url": "",
    "titles": [
      "New MIT Tech Could Cut Oil Refining Energy by 90%"
    ],
    "summary": "MIT researchers have created a novel membrane that can separate fuels by molecular size, potentially reducing the energy required for crude oil refining by up to 90%. This breakthrough could significantly decrease the energy consumption involved in the distillation process, which is a major component of refining crude oil.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "The story is very constructive. It not only reports on an innovative solution developed by MIT researchers that could potentially reduce the energy consumption in oil refining, but also provides actionable insights into how this technology could be applied in the industry. It also raises awareness about the energy-intensive nature of oil refining.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.925,
      "consensus": 0.283,
      "constructiveness": 1.0
    },
    "score": 0.531,
    "normalized_score": 10.0
  },
  {
    "title": "Unique \"Alien\" Chemistry Found in Earth's Largest Lithium Deposits",
    "domain": "science",
    "location": "global",
    "published": "Wed, 04 Jun 2025 21:23:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-uncover-alien-chemistry-under-earths-largest-lithium-deposits/\" rel=\"nofollow\" title=\"Scientists Uncover “Alien” Chemistry Under Earth’s Largest Lithium Deposits\"><img alt=\"Salar de Uyuni Salt Mound\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Salar-de-Uyuni-Salt-Mound-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New research reveals that lithium-rich brines have a chemistry dominated by boron, fundamentally different from typical saline waters. A new..."
    ],
    "image_url": "",
    "titles": [
      "Scientists Uncover “Alien” Chemistry Under Earth’s Largest Lithium Deposits"
    ],
    "summary": "New research has discovered that the lithium-rich brines found under Earth's largest lithium deposits possess a unique chemistry, significantly dominated by boron. This composition is fundamentally different from that of typical saline waters, indicating a distinctive \"alien\" chemical makeup in these areas.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it offers a deeper understanding of the unique chemistry of lithium-rich brines, which could have implications for lithium extraction processes. However, it doesn't provide clear actionable insights or report on specific solutions or improvements related to this discovery.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.917,
      "consensus": 0.283,
      "constructiveness": 0.7
    },
    "score": 0.499,
    "normalized_score": 7.4
  },
  {
    "title": "Study Finds Both Male and Female Earwigs Exhibit Large Forceps Growth",
    "domain": "science",
    "location": "global",
    "published": "Wed, 04 Jun 2025 20:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "A new study from Toho University reveals that female earwigs exhibit a similar pattern of exaggerated forceps growth as males, suggesting that both sexes may have evolved these traits through sexual selection."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/have-female-earwigs-ev.jpg",
    "titles": [
      "Female earwigs may also use their forceps as weapons in battles for mates"
    ],
    "summary": "A study by Toho University found that both male and female earwigs show exaggerated growth in their forceps. This suggests that the trait may have evolved in both sexes through sexual selection, challenging previous beliefs that only males exhibited this feature.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information and contributes to a deeper understanding of the evolution of earwigs. However, it doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter on a broader scale.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.894,
      "consensus": 0.283,
      "constructiveness": 0.6
    },
    "score": 0.485,
    "normalized_score": 6.26
  },
  {
    "title": "Researchers Urge Moving Beyond Halting Extinction to Restoring Ecosystems",
    "domain": "science",
    "location": "global",
    "published": "Wed, 04 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Putting an end to a mass extinction sounds like an impossible task, but some researchers argue that doing so would be setting our ambitions too low"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/03152102/SEI_254054418.jpg",
    "titles": [
      "Why avoiding a sixth mass extinction is easier than it sounds"
    ],
    "summary": "Researchers argue that merely aiming to halt mass extinction is setting our ambitions too low. They suggest that efforts should not only focus on preventing further loss of biodiversity but also on significantly reversing the damage already done to the planet's ecosystems. This perspective shifts the goal from mere conservation to active restoration and improvement of natural habitats.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It provides actionable insights by suggesting a shift in focus from conservation to restoration. It reports on a potential solution to a global problem, thus offering a sense of progress. It also increases awareness about the state of the planet's ecosystems and the need for more ambitious environmental goals.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.854,
      "consensus": 0.283,
      "constructiveness": 1.0
    },
    "score": 0.517,
    "normalized_score": 8.86
  }
]