[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Verge staff shared insights on a variety of items they use, ranging from recent purchases to products they've owned for decades. This includes smart tech, office tools, and kitchen gadgets, highlighting the diverse and long-term utility of these items in their daily lives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7704473681018519,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.40261184202546296,
    "summary": "The Verge staff discussed various products they utilize, covering recent buys to items owned for years. The selection spans smart technology, office essentials, and kitchen gadgets, showcasing the broad and enduring value these items offer in everyday use."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, running until March 31, 2025. The event features discounts on gardening supplies, bedding, and more to coincide with the start of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.590655701099537,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3576639252748842,
    "summary": "Amazon has initiated its Big Spring Sale, which will last until March 31, 2025. This sale offers discounts on a variety of items including gardening supplies and bedding, aligning with the arrival of spring."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a standout in the franchise. Players find the game challenging yet rewarding due to its demand for precision. This version brings a fresh experience by focusing on the life of a shinobi."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5394404230671297,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3448601057667824,
    "summary": "Assassin's Creed Shadows introduces new stealth and assassination mechanics, offering a challenging and rewarding experience. The game, focusing on the life of a shinobi, provides a fresh experience within the franchise."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is positioned as a gaming-centric counterpart to the MacBook Pro, featuring a return to a thinner and lighter chassis design after its predecessor increased in size. This laptop aims to offer high gaming performance while maintaining a conventional laptop appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4977737561458333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33444343903645835,
    "summary": "The Razer Blade 16 is designed as a gaming-oriented alternative to the MacBook Pro, focusing on a slimmer and lighter design compared to its previous version. It targets delivering strong gaming performance while keeping the look of a traditional laptop."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, doubles as a versatile work lamp suitable for various settings needing additional light. It features a rechargeable, compact design with three adjustable LED panels capable of emitting 3000 lumens, making it ideal for use at campsites, workspaces, or for mechanical tasks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.21383857070601853,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2634596426765046,
    "summary": "BougeRV has released an LED lantern designed for outdoor camping that can also serve as a work lamp for different environments requiring extra illumination. This rechargeable lantern has a compact design with three LED panels that can be adjusted to emit up to 3000 lumens, making it suitable for campsites, workspaces, and mechanical tasks."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The search for survivors is being hindered by a severe shortage of equipment, inconsistent communication, and destroyed roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Efforts to find survivors are facing challenges due to a lack of necessary equipment, problems with communication, and extensive damage to roads."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur described to the BBC as \"incredible\" the military's actions of dropping bombs during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur told the BBC that the military's actions of dropping bombs during rescue operations were \"incredible.\""
  },
  {
    "title": "Kink and LGBT dating apps exposed 1.5m private user images online",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:10:16 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Explicit images are being stored without password protection, making them susceptible to potential hacking."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Explicit images are being stored in an insecure manner without password protection, leaving them vulnerable to unauthorized access through hacking."
  },
  {
    "title": "Israel-Hamas ceasefire back on table in new negotiations",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 23:05:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hamas has reportedly agreed to a deal that involves releasing five hostages in exchange for a 50-day truce."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Hamas has agreed to release five hostages as part of a deal that includes a 50-day truce."
  },
  {
    "title": "Protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pro-democracy demonstrators rallied in support of imprisoned opposition leader Ekrem Imamoglu."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Pro-democracy demonstrators gathered to support Ekrem Imamoglu, an imprisoned opposition leader."
  },
  {
    "title": "US marine park investigated over animal-welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at the Gulf World Marine Park in Florida over the past year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida within the last year."
  },
  {
    "title": "The US firms backing Trump's fight over trade",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:03:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Businesses agree with President Trump on the issue of unfair trade practices. However, there is debate on whether his strategy of implementing reciprocal tariffs is the correct solution."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Businesses align with President Trump on identifying unfair trade practices as an issue but are divided over his approach of using reciprocal tariffs as a solution."
  },
  {
    "title": "No survivors after plane crashes into house in Minnesota",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 22:44:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A plane crash occurred, and according to officials, the exact number of passengers is unknown. The local fire chief confirmed that there were no survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A plane crashed, and officials have not confirmed the number of passengers. The local fire chief reported that there were no survivors."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul announced that Ms. Hall, previously under unspecified circumstances, is now with Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul reported that Ms. Hall, who was previously in an unspecified situation, is now in the care of Qatari officials and is anticipated to return home shortly."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya, a food chain, has temporarily shut down after incidents where a customer discovered an insect and another found a rat in their meals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a food chain, has temporarily closed its doors following two incidents involving unsanitary discoveries by customers: one found an insect in their meal, and another found a rat."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 21 people being injured, with a restaurant and several other buildings catching fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and damaged a restaurant along with multiple other buildings, as reported by local officials."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki is being criticized for wearing a disguise to promote his own book during a TV appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise to promote his own book on a TV show."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase do not belong to Somalia, challenging the notion that Somalia has the authority to make decisions regarding these facilities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic disputes Somalia's claim over the Berbera port and airbase, asserting that Somalia does not have the right to make decisions about these facilities."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing persons in Antigua have shared their distress with the BBC, expressing deep anguish over their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of individuals who have gone missing in Antigua have expressed their deep distress and anguish to the BBC about their loved ones' disappearances."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He had served less than a year of his sentence before being released."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, previously sentenced to 20 years in prison, has been pardoned and released before serving a full year of his sentence, due to health concerns."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation into diversity and inclusion initiatives as part of a wider examination of these practices."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Andrew Harding reports from Nuuk, revealing that numerous residents in the Danish territory feel intimidated by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Andrew Harding, reporting from Nuuk, has found that many locals in the Danish territory are feeling pressured by the United States."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, prompting rescue operations to save individuals trapped in the debris. Rescuers are currently focused on extracting survivors from the wreckage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to ongoing rescue efforts to save people trapped under the debris. Rescuers are actively working to extract survivors from the rubble."
  },
  {
    "title": "Snow White, Rachel Zegler and a toxic debate that's not going away",
    "domain": "General",
    "location": "Global",
    "published": "Sun, 30 Mar 2025 00:40:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 23-year-old lead actor in Disney's recent remake has sparked significant debate and discussion on various social media platforms."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The 23-year-old lead actor in Disney's latest remake has become a topic of widespread discussion and debate across social media platforms."
  },
  {
    "title": "Bringing the forgotten weavers back into the rich tapestry of Indian textiles",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 23:55:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Curators are innovating methods to highlight India's extensive textile traditions, showcasing them through various unique approaches."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Curators are adopting innovative methods to showcase India's rich textile traditions, employing diverse and unique approaches to highlight the country's extensive fabric heritage."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. The initiative aims to improve the visual content by replacing or enhancing these images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to improve the quality of photos, particularly those of celebrities, on a specific website. The project focuses on replacing or enhancing poor-quality images to improve visual content."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's impact was significantly increased by its magnitude and the extent of the fault line involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake's severity was heightened by its large magnitude and the wide area of the fault line affected."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing widespread damage throughout the area."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world, although some regions in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere globally. However, certain areas in Canada will witness a near-total eclipse."
  },
  {
    "title": "Bueckers takes over, drops 40 as UConn rolls on",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers set a record for UConn by scoring 40 points in an NCAA tournament game, leading her team to an 82-59 victory against Oklahoma in the Sweet 16."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers set a UConn record by scoring 40 points in an NCAA tournament game, leading her team to an 82-59 win over Oklahoma in the Sweet 16."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st in 'crazy' 20-9 win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit nine home runs in a game against the Brewers, with four homers off Nestor Cortes in the first inning, leading to a 20-9 victory on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees achieved a victory over the Brewers with a score of 20-9 on Saturday, hitting a total of nine home runs during the game. Four of these homers were off Nestor Cortes in the first inning."
  },
  {
    "title": "TCU wins as Van Lith into Elite Eight for 5th time",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "TCU's Hailey Van Lith scored 26 points, leading the Horned Frogs to a 71-62 victory against Notre Dame in the Sweet 16 round of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith scored 26 points for TCU, leading the team to a 71-62 win over Notre Dame in the Sweet 16 of the women's NCAA tournament."
  },
  {
    "title": "Auburn's Pearl not buying Izzo, MSU as underdogs",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Auburn coach Bruce Pearl stated he will not consider Michigan State an underdog in the NCAA tournament due to their historically successful track record in the event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Auburn coach Bruce Pearl has declared he will not view Michigan State as an underdog in the NCAA tournament, citing their historically successful performance in the competition."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trinity Rodman, a player for the US Women's National Soccer Team, has stated that she believes her back problems will not fully heal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Trinity Rodman, a member of the US Women's National Soccer Team, has reported that her back issues are expected to persist without full recovery."
  },
  {
    "title": "Scherzer (lat) leaves Jays debut after 3 innings",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut game for the Toronto Blue Jays, 40-year-old pitcher Max Scherzer, who joined the team in January and has won two World Series championships, exited the game after three innings due to right lat soreness. This occurred during the team's 9-5 defeat to the Baltimore Orioles."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Toronto Blue Jays, 40-year-old pitcher Max Scherzer left the game after three innings because of right lat soreness. This happened during the team's 9-5 loss to the Baltimore Orioles. Scherzer, who joined the Blue Jays in January, has previously won two World Series championships."
  },
  {
    "title": "Sabalenka, 'best player in the world,' wins Miami",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aryna Sabalenka, a three-time Grand Slam champion from Belarus, won the Miami Open title by defeating Jessica Pegula with a score of 7-5, 6-2 on Saturday. This victory comes after a rematch of the 2024 US Open final, where Sabalenka, the No. 1 seed, showcased her dominance once again."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aryna Sabalenka from Belarus won the Miami Open by defeating Jessica Pegula 7-5, 6-2. This victory follows their 2024 US Open final, with Sabalenka confirming her dominance as the No. 1 seed."
  },
  {
    "title": "No. 2 WNBA prospect Miles still deciding future",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:01:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Notre Dame basketball player Olivia Miles, anticipated to be the second pick in the upcoming WNBA draft, has stated she is considering entering the draft but has not made a final decision."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Notre Dame basketball player Olivia Miles, expected to be the second pick in the WNBA draft, is contemplating entering the draft but has yet to decide."
  },
  {
    "title": "What this historic day of home runs says about Aaron Judge, Yankees",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:59:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aaron Judge hit three home runs in a single game, leading New York to set a new record in long ball history. This performance highlighted Judge's exceptional skill as a slugger."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aaron Judge hit three home runs in a single game, setting a new record for New York in long ball history. This achievement underscores his exceptional ability as a slugger."
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:48:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's UFC Fight Night predictions have been shared by an MMA coach and a betting insider, offering their insights on who has the advantage in the upcoming matches."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This week, predictions for the upcoming UFC Fight Night have been made public by an MMA coach and a betting insider, providing their analysis on which fighters may have the upper hand in the matches."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an overview of what is at stake in various sports matchups, including updated projections for playoffs, standings in the draft lottery, and additional related information."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article discusses the implications of upcoming sports matchups, focusing on playoff projections, draft lottery standings, and other relevant details. It aims to provide an understanding of what's at stake for the teams involved."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer, and a panel has provided their votes on team standings up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "As of April 17, a panel has voted on team standings, offering a clearer view of the playoff field."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended. The focus now shifts to their strategy for the upcoming season, including priorities for the transfer portal and integrating new recruits into the Wolfpack team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded, and the team is now concentrating on preparations for the next season. This includes strategizing for the transfer portal to strengthen the team and incorporating new recruits into the Wolfpack lineup."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in only four days. This rapid conversion showcases the flexibility and adaptability of the facility to accommodate major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' Opening Day ballpark in just four days, highlighting the facility's ability to adapt for major league games."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze played a key role in Crystal Palace's victory over Fulham, contributing a goal and an assist, as they won 3-0 on Saturday. This win secured their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze helped Crystal Palace beat Fulham 3-0 on Saturday by scoring a goal and providing an assist, ensuring their advancement to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:32:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson. The jury's decision came after Gleeson claimed improper medical treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a lawsuit for medical malpractice against Portland Timbers' team doctor, Richard H. Edelson. The jury sided with Gleeson, who argued he received improper medical treatment."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, Bayern Munich, the Bundesliga leaders, secured the win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to help Bayern Munich secure a 3-2 win over St Pauli on Saturday. This victory maintained Bayern Munich's position as the leaders of the Bundesliga."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:32:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Espanyol and Atletico Madrid drew 1-1 in LaLiga on Saturday. Cesar Azpilicueta scored for Atletico Madrid in the first half, but Espanyol's captain, Javi Puado, equalized with a penalty. The result impacts relegation-threatened Espanyol and third-placed Atletico Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol and Atletico Madrid ended in a 1-1 draw in their LaLiga match on Saturday. Cesar Azpilicueta scored for Atletico Madrid in the first half, while Espanyol's captain, Javi Puado, equalized with a penalty. The draw affects Espanyol, who are fighting relegation, and Atletico Madrid, currently in third place."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle is holding an open-top bus parade to celebrate winning a major domestic trophy, marking the end of a 70-year wait."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle is organizing an open-top bus parade to celebrate their victory in a major domestic trophy, the first in 70 years."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced the dismissal of head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) has fired head coach Dorival Júnior following Brazil's recent defeat to Argentina in a match on Tuesday."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to Crystal Palace's starting lineup for the first time since his ear was severely injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played for Crystal Palace again, starting a match for the first time since he had a serious ear injury."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo have appealed to FIFA, requesting the organization to rethink its decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have formally appealed to FIFA, urging the organization to reconsider its decision to disqualify the Mexican team from participating in the Club World Cup."
  },
  {
    "title": "Transfer rumors, news: Madrid plan shocking move for Fernandes",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 20:29:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Transfer Talk reports on speculation that Manchester United captain Bruno Fernandes may be considered as a replacement for Luka Modric in Real Madrid's midfield."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Transfer Talk suggests that Manchester United captain Bruno Fernandes is being considered as a potential replacement for Luka Modric in Real Madrid's midfield."
  }
]