[
  {
    "title": "UCLA Upsets Penn State, Week 6 Sees Top Teams Fall",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 11:37:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "UCLA delivered a statement upset of Penn State on Saturday, and then brought the troll game to back it up afterward.",
      "A busy Week 6 provided plenty of material deserving of some overreactions",
      "Also, a breakdown of how complicated the Big Ten as become in wake of the Nittany Lions' loss",
      "A look at how national championship contenders fared in Week 6 action",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOdllhc2RJUjZJZGExUkx0NkhRVVJ0RVFBeUNIVkZXaGxUYVU3UWNwU1NKMjNnWV9KTVBLOGljSVBfc0NpQ0hQVVY0cF9XNS1OWG14enM5amU0RUVpeUxDWFR0TVYtbG1mUEtLRHZHS2I5OEpGVDBtZ2ZOczJWTnVkaEtsaVQ4UEQxZlh3V1g4M1NaWWVuakk3b1lVa0Y?oc=5\" target=\"_blank\">B/R's 2025 Colle",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxNOUNzMF85UERmRjZXX2FZZTZyVFh1amR4cU9JRzNKUGVqWUFzb0UweDZQSkpWZjlDQmxtd29wRlZacmRTTGM2S1ZjbjZPc2p1WTBaSDJMVGQtaTQ2a3lRbDc1NkdUYW5Fa1RTUERaNGZGSXhZaDRMVF9hWFZxaVBzenlLaw?oc=5\" target=\"_blank\">Projecting the College Football AP Top 25 for Wee"
    ],
    "image_url": "",
    "titles": [
      "😆 Top trolls from college football Week 6",
      "College football Week 6 overreactions: Florida can't fall for Billy Napier digging himself out of hole again",
      "College Football Playoff Vibe Check, Week 6: Texas, Penn State done; Texas Tech emerges as class of Big 12",
      "College football grades: Ohio State earns 'A' mark, Texas gets 'F' on Week 6 report card",
      "B/R's 2025 College Football Winners and Losers from Week 6 - Bleacher Report",
      "Projecting the College Football AP Top 25 for Week 7 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.989,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.807,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UCLA achieved a notable upset victory over Penn State on Saturday, surprising many. Following the game, UCLA engaged in celebratory trolling. Additionally, both No. 7 Penn State and No. 9 Texas experienced unexpected defeats to unranked teams during Week 6 of college football. These upsets are anticipated to significantly impact the upcoming AP Top 25 poll rankings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel, Hamas to Hold Indirect Cairo Talks Amid Gaza War Optimism",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 15:14:53 GMT",
    "source": "Financial Times",
    "sources": [
      "CityNews",
      "The Guardian",
      "Global News",
      "Financial Times"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Negotiators to meet in Cairo after partial acceptance of Donald Trump’s plan for Gaza",
      "<p>Secretary of state says ‘we’ll know very quickly whether Hamas is serious or not’ about release of hostages from Gaza</p><p>The US secretary of state, Marco Rubio, said on Sunday that the war in Gaza has not ended, despite Israel and Hamas both agreeing to aspects of Donald Trump’s plan for an en",
      "U.S. Secretary of State Marco Rubio told NBC's Meet the Press that Hamas had \"basically\" agreed to President Donald Trump's proposal.",
      "CAIRO (AP) — Israel and Hamas prepared for indirect negotiations in Egypt on Monday, as hopes for a possible ceasefire in Gaza began to build after Prime Minister Benjamin Netanyahu said a hostage release could be announced this week. President Donald Trump has welcomed the militant group’s statemen"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F97060528-c83c-47c5-8430-bcd042344622.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Israel and Hamas prepare for crunch ceasefire talks",
      "Marco Rubio says Gaza war not yet over as Israel and Hamas prepare for talks",
      "Conflict in Gaza not over yet, Rubio warns",
      "Israel and Hamas prepare for negotiations in Egypt ahead of possible Gaza ceasefire"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.961,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Negotiators from Israel and Hamas are set to meet in Cairo for indirect talks after partially accepting Donald Trump's Gaza plan. U.S. Secretary of State Marco Rubio stated that the war in Gaza continues, but there is optimism for a ceasefire, especially with potential hostage releases. Both sides have shown some agreement to Trump's proposal, signaling a move towards negotiations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Detain and Deport Gaza-Bound Activists; Allegations of Mistreatme",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 12:32:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Activists from the Global Sumud Flotilla who hoped to reach Gaza have been deported after being intercepted and detained",
      "On his return at Rome’s Fiumicino Airport late Saturday, Italian journalist Saverio Tommasi said Israeli soldiers withheld medicines and treated prisoners “like monkeys.”",
      "ROME (AP) — Some of the activists detained while trying to reach Gaza by sea have returned to their home countries to describe mistreatment at the hands of Israeli guards, claims that Israel denies. Some 450 activists were arrested as Israeli forces intercepted the Global Sumud Flotilla, a fleet of "
    ],
    "image_url": "",
    "titles": [
      "Freed flotilla activists describe mistreatment in Israeli detention",
      "Gaza flotilla activists allege ‘stress and humiliation’ in Israeli custody",
      "Gaza flotilla activists allege mistreatment while being detained in Israel"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Activists from the Global Sumud Flotilla, attempting to reach Gaza, were intercepted, detained, and deported by Israeli forces. Upon returning, Italian journalist Saverio Tommasi and others claimed they were mistreated and deprived of medicines by Israeli soldiers, allegations that Israel denies. Some 450 activists were involved in the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL London Game: Vikings vs. Browns, Gabriel Debuts as QB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 11:39:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "The NFL went international in Week 5. Here's how Minnesota and Cleveland made the trip worth remembering in London.",
      "Browns rookie quarterback Dillon Gabriel is playing a solid game in his debut as an NFL starter."
    ],
    "image_url": "",
    "titles": [
      "Follow live: Dillon Gabriel tosses his second TD pass to put Browns back in front",
      "Dillon Gabriel's second TD pass puts Browns in the lead"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 5, the NFL held an international game in London featuring the Minnesota Vikings and Cleveland Browns. Browns rookie quarterback Dillon Gabriel made his NFL starting debut, delivering a solid performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Launches Pre-Dawn Airstrikes in Ukraine, Kills Five",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 13:11:13 +0000",
    "source": "New York Times",
    "sources": [
      "Financial Post",
      "New York Times"
    ],
    "domains": [
      "financialpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "At least five people were killed before dawn in another large-scale and wide-ranging assault.",
      "Russia launched a massive airstrike at targets across Ukraine overnight, including at energy facilities, killing at least five people and wounding several others."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/05/multimedia/05int-ukraine-strikes-jbfq/05int-ukraine-strikes-jbfq-mediumSquareAt3X.jpg",
    "titles": [
      "Russia Targets Ukraine’s Energy Infrastructure With Deadly Bombardment",
      "Russian Air Barrage Targets Ukraine, Damaging Gas Infrastructure"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia conducted a large airstrike on various targets across Ukraine, including energy facilities, resulting in at least five deaths and multiple injuries. This attack occurred before dawn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Strikes in Gaza; Talks Set in Egypt; Syria Holds Elections",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 15:28:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Strikes have continued in Gaza as mediators prepare to head to Egypt for talks starting on Monday.",
      "Fresh Israeli strikes were reported in Gaza as negotiators from Israel, the US and Hamas head to Egypt for talks. Meanwhile, Syria is holding its first elections since the ouster of Bashar Assad. DW has more."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b341/live/ee4c5e00-a1ff-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Eyes on Egypt ahead of crucial Gaza peace talks",
      "Middle East: Gaza strikes reported ahead of Egypt talks"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli forces conducted new strikes in Gaza amid ongoing tensions. Meanwhile, negotiators from Israel, the US, and Hamas are set to engage in talks in Egypt starting Monday. Concurrently, Syria is conducting its first elections since the removal of Bashar Assad.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moscow Escalates Attacks on Ukraine's Energy Infrastructure",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 13:58:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Moscow has stepped up its attacks in recent weeks, particularly on Ukraine&#039;s energy grid and gas production sites.",
      "The drone and missile assault hit nine regions and left tens of thousands without electricity as Russia ramps up its energy war ahead of winter in Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Five killed across Ukraine in overnight Russian attacks",
      "Russian air attack across Ukraine damages energy networks, kills five"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Moscow increased its attacks on Ukraine, targeting the country's energy grid and gas production sites, affecting nine regions. The drone and missile strikes have left tens of thousands without electricity, intensifying Russia's energy war on Ukraine as winter approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tampa Bay's Irving Out for Seahawks Game, Future Uncertain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:44:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The latest availability information on Tampa Bay's starting running back",
      "<p>Already slated to miss Sunday&#8217;s matchup against the Seattle Seahawks, Bucky Irving may have an extended stint on the sidelines. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/2e24ba36-48af-4ee7-9336-88fd55c79fec/bucky.png",
    "titles": [
      "Bucky Irving injury update: Bucs star RB dealing with multiple injuries, could miss multiple weeks, per report",
      "Report: Buccaneers RB Bucky Irving expected to miss at least two weeks"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tampa Bay's starting running back, Bucky Irving, will miss the upcoming game against the Seattle Seahawks and might have a prolonged absence. The team is facing uncertainty regarding Irving's availability for future games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anisimova Wins China Open, Claims Second WTA 1,000 Title",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 13:44:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Amanda Anisimova continues her breakout year with victory over Linda Noskova to win the China Open and claim her second WTA 1,000 title.",
      "Amanda Anisimova blasted her way to the China Open title after a summer of Grand Slam heartbreak at Wimbledon and the US Open."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/96db/live/690e9d30-a1ea-11f0-ab23-d127b1d8dfad.jpg",
    "titles": [
      "Anisimova beats Noskova to win China Open",
      "Anisimova blasts her way to China Open title after Grand Slam heartbreak"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amanda Anisimova won the China Open, securing her second WTA 1,000 title by defeating Linda Noskova. This victory marks a highlight in her year, following disappointments at Wimbledon and the US Open.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Triumph Over Yankees 10-1 in ALDS Opener",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 11:48:58 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>Manager John Schneider, outfielder Daulton Varsho and Game 3 starter Shane Bieber are all set to address the media ahead of Sunday&#8217;s outing. Watch the media conference here on Sportsnet.ca.</p>",
      "<p>The Toronto Blue Jays are making adjustments to their lineup for Game 2 of their ALDS series against the New York Yankees. </p>",
      "The Blue Jays have won 10-1 in Game 1 of the American League Division Series against the New York Yankees. This is the Blue Jays first postseason win since 2016. The two teams were playing at Rogers Centre on Saturday for the first game between Toronto and New York in the MLB playoffs. Blue Jays&#82"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/Big-Read-Shane-Bieber-Feature.jpg",
    "titles": [
      "Watch Live: Blue Jays address media before Game 2 of ALDS",
      "Blue Jays make changes to lineup for Game 2 of ALDS vs. Yankees",
      "Blue Jays win 10-1 in Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays defeated the New York Yankees 10-1 in Game 1 of the American League Division Series at Rogers Centre. This victory marks the Blue Jays' first postseason win since 2016. Catcher Alejandro Kirk contributed significantly with his second home run of the game, marking his fifth homer in the last three games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syria Holds First Parliamentary Elections Post-Assad Era",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 04:20:44 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Syria is holding parliamentary elections on Sunday for the first time since the fall of the country's longtime autocratic leader, Bashar Assad, who was unseated in a rebel offensive in December.",
      "Syrians are voting indirectly, and President Ahmed al-Shara is appointing a third of the lawmakers. Still, some see this as a step forward after decades of dictatorship."
    ],
    "image_url": "",
    "titles": [
      "What to expect as Syria holds first parliamentary elections since Assad's ouster",
      "Syria Chooses Its First Parliament Since End of Civil War"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.85,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Syria conducted its first parliamentary elections since the ousting of Bashar Assad in December. President Ahmed al-Shara is appointing one-third of the lawmakers in these indirect elections. Despite the unconventional voting process, some view it as progress following years of autocratic rule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syria Holds First Indirect Parliamentary Election Post-Assad Era",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 14:21:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Syria is holding its first indirect parliamentary election since the ouster of longtime ruler Bashar al-Assad.",
      "Two-thirds of new legislators will be chosen by electoral colleges, while rest will be appointed by interim president.",
      "People&#039;s Assembly to be chosen by electoral subcommittees in first vote under interim President Ahmed al-Sharaa.",
      "After decades of dictatorship and civil war, Syria is holding its first election this month. But not every Syrian will vote, nor will there be political parties or campaigning. So how will this historic ballot work?"
    ],
    "image_url": "",
    "titles": [
      "Video: Here’s how Syria is electing its first post-Assad parliament",
      "Syria counts votes after indirect election for first post-Assad parliament",
      "Everything you need to know about Syria’s first post-Assad elections",
      "Syria's first election after dictatorship: What you need to know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Syria is conducting its first indirect parliamentary election following the ouster of Bashar al-Assad. Two-thirds of the legislators will be selected by electoral colleges, with the remainder appointed by interim President Ahmed al-Sharaa. This marks the first election under al-Sharaa's interim presidency, occurring after years of dictatorship and civil war. However, the election will not feature political parties, campaigning, or universal suffrage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Everton Ends Crystal Palace's 19-Game Unbeaten Streak with Late Comeback",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 15:22:27 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Oliver Glasner looked on aghast while his Crystal Palace players rubbed their heads and sank to their knees in sheer disbelief. As well they might. Palace’s 19-game unbeaten run is over, vanishing against a late and thoroughly unexpected Everton recovery capped by Jack Grealish’s first goal for D",
      "FREE TO WATCH: Highlights from Everton&#8217;s match against Crystal Palace in the Premier League."
    ],
    "image_url": "https://i.guim.co.uk/img/media/098ed138f8c847ddefe6abb1d6d5c37c29007e78/245_0_1782_1426/master/1782.jpg?width=140&quality=85&auto=format&fit=max&s=8b108c6b5d7bce3d1d93efd3d8f53361",
    "titles": [
      "Grealish grabs late winner as Everton end Crystal Palace’s unbeaten run",
      "Grealish PUNISHES wasteful Palace to earn Everton dramatic late win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Crystal Palace's 19-game unbeaten streak ended with a loss to Everton, marked by a late comeback and Jack Grealish's first goal for Everton. The match highlights are available for viewing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Collier Cancels Meeting with WNBA Commissioner Amid Dispute",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:31:17 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOSUlQQUR0dFR4dzRzb0o1cnB4cU9Kejh5bXZNaDFVZU1BMHdIZ09ndVY1ZjdYaDBfU0lHcmxOX2d3anRDVEo5Z2lDRE9sVGJiMFFNZEozeXJLUDMybWtENW52RFdESnVEZ1RJYWE4bnNKdlB4UjhRZGhhYVo0ODl3UGdSNFM1MjZ0TV9iWjhNWlo2RWFEYnc?oc=5\" target=\"_blank\">Napheesa Collier Cancels",
      "<p>Minnesota forward Napheesa Collier canceled a meeting with WNBA commissioner Cathy Engelbert expected to take place next week, a person familiar with the situation told The Associated Press on Saturday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Napheesa Collier Cancels Meeting With WNBA Commissioner Amid Growing Tensions - Sports Illustrated",
      "AP Source: Napheesa Collier cancels meeting with WNBA commissioner amid tensions"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minnesota Lynx forward Napheesa Collier has canceled a planned meeting with WNBA Commissioner Cathy Engelbert, according to sources. This decision follows Engelbert's claims of inaccuracies in Collier's critical comments about WNBA leadership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "George Russell Wins Singapore GP; McLaren Clinches 10th F1 Title",
    "domain": "sports",
    "source_domain": "www.lemonde.fr",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:05:45 +0200",
    "source": "Le Monde",
    "sources": [
      "Sportsnet",
      "Le Monde"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.lemonde.fr"
    ],
    "snippets": [
      "Le Britannique s’est imposé dans la Cité-Etat, ce dimanche, devant Max Verstappen, Lando Norris et Oscar Piastri. L’écurie McLaren est, elle, mathématiquement assurée d’un dixième titre mondial des constructeurs de formule 1.",
      "<p>George Russell won the Singapore Grand Prix in dominant style Sunday as McLaren secured the Formula 1 constructors’ championship with six races to go.</p>"
    ],
    "image_url": "https://img.lemde.fr/2025/10/05/498/0/3352/1676/644/322/60/0/397ffa3_ftp-import-images-1-3c3banswoaxm-2025-10-05t141413z-1832118143-up1ela513jnuz-rtrmadp-3-motor-f1-singapore.JPG",
    "titles": [
      "George Russell remporte le Grand Prix de Singapour de F1, le titre des constructeurs pour McLaren",
      "George Russell wins F1’s Singapore GP as McLaren secures constructors’ title"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "George Russell won the Singapore Grand Prix, leading ahead of Max Verstappen, Lando Norris, and Oscar Piastri. With this victory, McLaren has mathematically clinched their tenth Formula 1 constructors' championship title, achieving the feat with six races remaining in the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heavy Rains in Himalayas: 18 Dead, 7 Missing, Rescue Efforts Hindered",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 08:34:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Heavy rains continue to disrupt rescue operations in Himalayan nation as authorities struggle to respond to the crisis.",
      "Authorities say at least 44 people are dead and five are missing after villages were swept away in the eastern Ilam district bordering India. The weather department warned that rain is likely to continue until Monday."
    ],
    "image_url": "",
    "titles": [
      "At least 47 killed in Nepal as heavy rains trigger landslides, flash floods",
      "Nepal: Deadly landslides, flash floods kill dozens"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Heavy rains in the Himalayan nation have hampered rescue efforts, resulting in 18 deaths and 7 missing after villages in eastern Ilam district were destroyed. The weather department predicts continued rainfall until Monday, complicating the crisis response.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three States Ban Coldrif Syrup After Deaths, Toxic Solvent Found",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 06:25:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Three states ban the cough syrup after children die allegedly after consuming the product.",
      "The Indian Health Ministry said in a statement that test samples of Coldrif cough syrup found a highly toxic industrial solvent. At least nine children died allegedly after consuming it."
    ],
    "image_url": "",
    "titles": [
      "India probes possible cough syrup link to deaths of at least nine children",
      "India: 3 states ban cough syrup after several children die"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.816,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Three states have banned Coldrif cough syrup after the Indian Health Ministry found a toxic industrial solvent in test samples. Nine children have reportedly died after consuming the product.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows Quick Hostage Return, Sends Team to Egypt for Gaza Plan Talks",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-04T18:47:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Israeli Prime Minister Netanyahu said he wants to see hostages returned in the coming days. He also said a team has been sent to Egypt \"to finalize technical details\" of Trump's plan for the future of Gaza.",
      "The families of hostages have reacted with a mix of optimism and trepidation, urging the Israeli government to not squander the opportunity."
    ],
    "image_url": "",
    "titles": [
      "Netanyahu hopes Gaza hostages return home in coming days",
      "The Next Steps for Hostages in Gaza"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.641,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu announced intentions to secure the return of hostages within days and has dispatched a team to Egypt to conclude technical aspects of Trump's Gaza plan. The hostages' families express cautious optimism, urging the government to seize this chance for resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OPEC+ Agrees to Increase Oil Production in November Amidst Member Disagreement",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 12:36:00 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "OPEC+ agreed to a modest increase in its November oil production as group leaders Saudi Arabia and Russia overcame a difference in position.",
      "OPEC+ is close to an agreement in principle to make another modest supply increase for November, overcoming a difference in position between group leaders Saudi Arabia and Russia."
    ],
    "image_url": "",
    "titles": [
      "OPEC+ Agrees to Modest Oil Production Increase for November",
      "OPEC+ Nears Agreement for Modest November Production Hike"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.929,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OPEC+ has agreed to a modest increase in oil production for November, resolving a disagreement between Saudi Arabia and Russia, the group's leading members. This decision aims to adjust supply in response to global demand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]