[
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 09:03:32 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Financial Times",
      "The Guardian",
      "ABC News",
      "NPR",
      "Deutsche Welle",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.npr.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "The attack took place outside a synagogue in Manchester. Prime Minister Keir Starmer called the attack \"appalling\" and \"all the more horrific\" for taking place on Yom Kippur, Judaism's holiest day.",
      "A car was rammed into pedestrians and at least one person stabbed as worshippers arrived to celebrate Yom Kippur.",
      "&#039;Appalled&#039; UK PM Starmer departs early from European summit in Copenhagen; decries that this happened on Yom Kippur.",
      "Police in the UK have declared a major incident outside a synagogue in Manchester. Two people died of their injuries, and the attacker was confirmed to be dead after police opened fire.",
      "UK authorities step up security at Jewish sites after what police describe as a terrorist incident",
      "<p>North of England editor Josh Halliday reports from the scene of the attack on Heaton Park Hebrew Congregation synagogue, in which two people were killed and three others seriously injured, in what appears to be the worst antisemitic incident in the UK in living memory</p><p>On Thursday morning at",
      "<p>Police say they know identity of man who carried out car and knife attack that left another four people seriously injured</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live\">Manchester synagogue stabbing – latest u",
      "<p>Police confirm that victims were Jewish and say that suspect, who they have not named, was shot dead within minutes during Yom Kippur attack</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/02/police-at-scene-of-reported-stabbing-at-synagogue-in-manchester\">Full story: two kill",
      "Officers shot and killed a suspect who had rammed a car into some victims and stabbed others outside the Heaton Park Hebrew Congregation, police said.",
      "Two people were killed when a man drove a vehicle toward a crowd of people and launched a stabbing attack near a synagogue in Manchester, police said.",
      "The assailant died after being shot by officers, and two people were arrested, the police said. The attack killed two people in Manchester, England, on Yom Kippur, the holiest day on the Jewish calendar."
    ],
    "image_url": "",
    "titles": [
      "U.K. police label Manchester's deadly synagogue attack as a 'terrorist incident'",
      "Deadly Manchester synagogue attack: What we know about victims and attacker",
      "Two killed in attack near Manchester synagogue, suspect shot by UK police",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Two killed in attack at Manchester synagogue",
      "The Manchester synagogue terror attack – Today in Focus Extra",
      "Manchester synagogue terror attack: two killed and suspect shot dead",
      "Manchester synagogue attack that killed two was a ‘terrorist incident’, say police – latest updates",
      "Two killed in attack at synagogue on Yom Kippur in England",
      "Deadly UK synagogue stabbing declared terrorist incident",
      "Live Updates: British Police Say Deadly Attack Outside Synagogue Was Terrorism"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.937,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.862,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 15:48:34 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Business Insider",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.businessinsider.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Two Jewish people died in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue on the holiest day in the Jewish religious calendar.",
      "Videos show Israeli forces intercepting several aid boats in international waters and detaining activists onboard.",
      "Huwaida Arraf says the intl community is failing to protect the flotilla &amp; Palestinians under Israel’s genocide in Gaza.",
      "Two people were killed and at least three others were in serious condition after the vehicle ramming and stabbing attack on Yom Kippur. Police said the suspect was dead.",
      "Starbucks on Thursday said it would close 1% of its North American stores, but didn't announce which ones. Business Insider has compiled a list."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dafd/live/b8da6150-9f8d-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know so far",
      "What we know about Israel’s interception of the Gaza flotilla",
      "Israel taking “illegal actions” against Gaza aid flotilla",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
      "Starbucks is closing hundreds of North American stores &mdash;&nbsp;here are the locations we know so far"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.972,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Collide on LaGuardia Taxiway; Flight Attendant Injured",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 15:38:51 GMT",
    "source": "The Guardian",
    "sources": [
      "Global News",
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "www.theguardian.com",
      "globalnews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "<p>Wing of one aircraft hit fuselage of another, resulting in one flight attendant with non-life threatening injuries</p><p>Two Delta Air Lines regional jets collided on the taxiway at LaGuardia airport in New York, injuring a flight attendant, damaging a cockpit and tearing off part of a wing in wh",
      "“Their right wing clipped our nose and the cockpit we have damage to our windscreen and ... some of our screens in here,” a pilot said, according to air traffic control audio.",
      "Two Delta Air Lines regional jets collided on the taxiway at LaGuardia Airport in New York, injuring a flight attendant, damaging a cockpit and tearing off part of a wing in what the airline described as a &#8220;low-speed collision.&#8221; An aircraft carrying 32 people was preparing for takeoff We"
    ],
    "image_url": "https://i.guim.co.uk/img/media/db0dfd137cd96c6f5c43e0243e4235ee559bd59f/1258_0_6291_5033/master/6291.jpg?width=140&quality=85&auto=format&fit=max&s=698194f6751b94def2812364bce1cb0f",
    "titles": [
      "Two Delta planes collide while on the taxiway in New York",
      "2 Delta jets collide on taxiway at LaGuardia airport",
      "Two Delta jets damaged in ‘low-speed collision’ on LaGuardia taxiway, injuring 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two Delta Air Lines regional jets collided on the taxiway at LaGuardia Airport, New York, in a low-speed collision. The incident resulted in a damaged cockpit, part of a wing being torn off, and one flight attendant sustaining non-life-threatening injuries. The collision occurred as one aircraft, carrying 32 passengers, was preparing for takeoff.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Java School Collapse: 60 Missing, Rescue Shifts to Recovery",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 08:54:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Some families say they&#039;re still holding out hope their loved ones are alive as authorities shift to recovery operation.",
      "Nearly 60 students are still missing after a school collapsed in Java. Rescuers have switched to using heavy machines to clear out debris as the clock is running out to find survivors.",
      "Rescuers saved five more students from under the building on Thursday but said they would end the search three days after the deadly accident."
    ],
    "image_url": "",
    "titles": [
      "‘No signs of life’: Hopes turn to anguish in Indonesia school collapse",
      "Indonesia school collapse: 'No signs of life' detected",
      "No More Signs of Life From Rubble of Collapsed School in Indonesia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.859,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nearly 60 students remain missing after a school in Java collapsed. Rescue efforts have transitioned to recovery, with heavy machinery now being used to remove debris. Despite this shift, some families maintain hope for their loved ones' survival. Five students were rescued on Thursday, but authorities plan to conclude the search operations three days post-accident.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gen Z Protests in Morocco, Another African Nation Demand Reforms",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 05:01:00 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "Gen Z-led protests in two diverse African countries highlight frustration over years of poor governance. Fueled by social media, these youth movements are demanding accountability.",
      "Police say they shot dead two people who were part of a crowd trying to storm a police station.",
      "Young people in Morocco are frustrated with social inequalities and demanding better education and health care."
    ],
    "image_url": "",
    "titles": [
      "From Madagascar to Morocco: Gen Z protests shake Africa",
      "First killings in Morocco since Gen Z protests erupted",
      "Morocco: Gen Z protests turn violent, three killed"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Gen Z-led protests in Morocco and another African country are driven by frustration over poor governance. Activists, using social media for mobilization, demand accountability, better education, and health care. These movements highlight the youth's demand for social equality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 14:23:26 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "South Africa and Turkey have criticised the incident in international waters. Israel says those on board are safe.",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0952/live/0af28640-9f7d-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Israel intercepts Gaza flotilla and detains activists including Greta Thunberg",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.944,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Hikes Lease Prices Amid Record Q3 Deliveries, Tax Credit Expiry",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 22:38:31 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios",
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com",
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1kanBtZU5jREtadjBQYm1GUG9PZG9JOUFiVkhDM2N5Tk9yOURCOTgtYlRaektiU05Gc0t4TUtpZklaWWlhUHJRVEFZc2RTRGZiZzlaNktmaVAxVTFXWFhycmVwZGpHaS1SRl9IcHZvYw?oc=5\" target=\"_blank\">Tesla hikes lease prices as EV tax credit expires</a>&nbsp;&nbsp;<font color=",
      "Tesla's third-quarter deliveries got a boost as some consumers rush to buy electric vehicles before a federal tax credit expired.",
      "Tesla reported 497,000 deliveries for the third quarter, as customers raced to buy its cars before the $7,500 EV tax credit expired earlier this week.",
      "The tax credit's expiration on September 30 motivated buyers to take advantage of the $7,500 incentive, giving Tesla a shot to return to sales growth in 2025."
    ],
    "image_url": "",
    "titles": [
      "Tesla hikes lease prices as EV tax credit expires - Axios",
      "Tesla deliveries rise 7% before EV tax credits expire",
      "Tesla smashes quarterly delivery numbers for the first time this year as EV credits expire",
      "Tesla has its best sales quarter ever as EV tax credit expires"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.68,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla increased its lease prices following a surge in third-quarter deliveries, with 497,000 vehicles delivered as consumers rushed to purchase electric vehicles before the expiration of a $7,500 federal tax credit on September 30. This expiration motivated buyers and contributed to Tesla's sales growth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Flames Extend Coach Huska's Contract Through 2027-28",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 15:37:50 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The Calgary Flames extended head coach Ryan Huska's contract for two additional years on Thursday, keeping him signed through the 2027-28 season.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOeVpNTkhWd3RwdGRsMWFSdkFHLUdwQU5SX2QxeWNpcXIxN0pUYXhzZGMzMHRhUVF2c3dzYjY1SFdETEdyZ3dNVEJaQTh1d0h3ZVJyM09Zc2lnWkFENEV3WjMwMU42QTdsX201djQ5S3U0SmMyNm1NdGRXcDFqdC1oR1pn?oc=5\" target=\"_blank\">Flames Extend Head Coach Ryan Huska</a>&nbsp;&nbsp;"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/14e74180c2c19183d55c523a0971f8dfe24a46415eaf47e1c315af7585c42a03.jpg?quality=65&strip=all",
    "titles": [
      "Flames extend head coach Ryan Huska for two years",
      "Flames Extend Head Coach Ryan Huska - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The Calgary Flames extended head coach Ryan Huska's contract for two additional years on Thursday, keeping him signed through the 2027-28 season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Hits $500B Valuation, Becomes Most Valuable Private Firm",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 06:09:59 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "OpenAI has completed a $6.6 billion secondary share sale at a $500 billion valuation, cementing its status as the most valuable private company in the world.",
      "As OpenAI’s valuation heads even higher, it raises the pressure for revenue generation. The company has a few initiatives in the works.",
      "Current and former OpenAI employees sold about US$6.6 billion of stock to investors"
    ],
    "image_url": "",
    "titles": [
      "OpenAI wraps $6.6 billion share sale at $500 billion valuation",
      "OpenAI joins an elite club with its new $500 billion valuation. Can it live up to that mark?",
      "OpenAI tops SpaceX as world’s most valuable startup with US$500 billion valuation"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.795,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI finalized a $6.6 billion secondary share sale, reaching a $500 billion valuation, making it the world's most valuable private company. This sale involved current and former employees selling stock to investors, highlighting increased pressure on the company to generate revenue through its initiatives.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yamamoto's 9 Ks Propel Dodgers to NLDS, Ohtani to Debut vs Phillies",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 11:28:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Yoshinobu Yamamoto struck out nine to lead the Dodgers past the Reds and into the NLDS, where Shohei Ohtani will start the opener against the Phillies.",
      "<p>Shohei Ohtani&#8217;s post-season pitching debut will come in Game 1 of the NLDS.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yamamoto puts L.A. in NLDS; Ohtani to start G1",
      "Dodgers’ Shohei Ohtani to start Game 1 of NLDS on mound"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Yoshinobu Yamamoto led the Dodgers to victory over the Reds with nine strikeouts, advancing them to the NLDS. Shohei Ohtani is set to make his post-season pitching debut in Game 1 against the Phillies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chisholm Jr. Leads Yankees to 4-3 Win Over Red Sox, Forces Game 3",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 11:28:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "One day after he was benched, Jazz Chisholm turned in a season-saving performance for the Yankees, making a run-saving play with his glove and scoring the tiebreaking run in Wednesday's do-or-die Game 2 against the Red Sox.",
      "<p>After being upset that he wasn&#8217;t in the lineup for Game 1, Jazz Chisholm Jr. came back and had his fingerprints over the Yankees&#8217; Game 2 win on Wednesday.</p>",
      "<p>Ben Rice went 2-for-4 with a solo shot in his first postseason appearance, and Austin Wells knocked in the game-winning run in the eighth inning as the New York Yankees defeated the Boston Red Sox 4-3, to force a winner-take-all Game 3.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chisholm turns page, saves Yanks to force Game 3",
      "Chisholm Jr. shakes off frustration, leads Yankees past Red Sox to force Game 3",
      "MLB Game 2 Highlights: Yankees 4, Red Sox 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jazz Chisholm Jr. delivered a crucial performance in Game 2 for the Yankees, making a key defensive play and scoring the tiebreaking run in a 4-3 victory over the Red Sox. This win, following his benching in Game 1, helped the Yankees force a decisive Game 3. Ben Rice and Austin Wells also contributed significantly, with Rice hitting a solo homer and Wells driving in the game-winning run.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xavien Howard, 32, Retires from NFL Days After Criticized Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 11:28:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Veteran cornerback Xavien Howard, 32, informed the Colts of his decision to retire just days after his much-criticized performance against the Rams.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxQMmlxd1huLUhKWHZQT2xaMTRXMHEyWE10a0htN1pXS3JjcHJpSkduX2VPelFncnhpMjR6b3h4THJHRmVwVnFkM0FGdjBRR1lLSjFmbGRQNzdxc21VN2hmeTU2c0FSUUszUmtJV1cwQlEzeEFnTFJPX2tJNXgxWEdSbzhmcUtQUzQwcGNGNFdZaGZXSE85dXhCcUp2RUFyRTQ?oc=5\" target=\"_blank\">Colts CB Xav"
    ],
    "image_url": "",
    "titles": [
      "Colts' Howard abruptly retires, says 'family first'",
      "Colts CB Xavien Howard Abruptly Retires After Rough Game vs. Puka Nacua, Rams - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Veteran cornerback Xavien Howard, aged 32, has announced his retirement from professional football, just days following a criticized performance against the Rams. This decision was communicated to his team, the Colts, marking the end of his career in the NFL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers Extend Niko Mikkola for 8 Years, Securing Top Defensemen",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 11:28:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Florida Panthers have agreed to an eight-year extension with defenseman Niko Mikkola, and as a result have locked in each of their top four defensemen until at least 2030.",
      "<p>The defenceman signed an eight-year contract extension with the Panthers, the team announced on Thursday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Panthers' Mikkola gets $40M extension",
      "Panthers sign Niko Mikkola to eight-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Florida Panthers have signed defenseman Niko Mikkola to an eight-year contract extension, ensuring their top four defensemen are secured until at least 2030. The team announced this agreement on Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Italian Unions Strike in Global Protest Against Israel's Flotilla Action",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 15:38:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Several boats from the Global Sumud Flotilla arrived at Israel’s Ashdod port on Thursday flying Palestinian flags.",
      "Protesters in cities around the world have condemned Israel&#039;s interception of the humanitarian flotilla bound for Gaza.",
      "<p>Thousands demonstrate around the world after flotilla was stopped and activists including Greta Thunberg detained</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates#top-of-blog\">Follow latest updates li"
    ],
    "image_url": "",
    "titles": [
      "Intercepted Gaza flotilla boats arrive at Israel’s Ashdod port",
      "Global protests against Israel’s intercepton of Gaza flotilla",
      "Israel’s Gaza flotilla interception triggers protests, diplomatic expulsions and calls for strikes"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Italian unions have called for a general strike, joining global protests after Israel intercepted a flotilla, detaining activists like Greta Thunberg. Thousands have marched worldwide, with multiple governments criticizing Israel's actions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards Amid Shutdown",
    "domain": "technology",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 14:59:28 +0000",
    "source": "New York Times",
    "sources": [
      "TechCrunch",
      "New York Times"
    ],
    "domains": [
      "techcrunch.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The cuts disproportionally affect Democrats as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states with affected projects all voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/02/multimedia/02cli-clean-energy-cuts-fjkz/02cli-clean-energy-cuts-fjkz-mediumSquareAt3X.jpg",
    "titles": [
      "Energy Dept. Cancels Hundreds of Clean-Energy Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in Harris-voting states"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, impacting projects in states that voted for Democrat Kamala Harris. This move comes amid a broader federal government shutdown, with these cancellations disproportionately affecting Democrats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Primatologist Jane Goodall Dies at 91",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 14:50:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Jane Goodall, the conservationist and primatologist renowned for her groundbreaking research on chimpanzees, has died.",
      "Dr. Jane Goodall, one of the world&#8217;s most beloved animal behaviorists and a pioneer in primatology has died at the age of 91, the Jane Goodall Institute confirmed Wednesday. The British scientist, best known for her groundbreaking work with chimpanzees in Tanzania&#8217;s Gombe Stream National"
    ],
    "image_url": "",
    "titles": [
      "Renowned chimpanzee researcher Jane Goodall dies at 91",
      "Renowned primatologist Dr. Jane Goodall dead at 91"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jane Goodall, the celebrated primatologist known for her pioneering research on chimpanzee behavior, has died at the age of 91. The Jane Goodall Institute announced she passed away of natural causes during a speaking tour in the US. Goodall, a British scientist, transformed our understanding of apes and was a tireless advocate for the natural world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Discuss Agency Cuts with Budget Director Vought",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 13:23:02 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQLURNREVuNHRwS0tzX2ZsSzZjOE1TN2FjR2MyMzBZUkEwRHhrVFBkRlJhM0lTalNPa3R4dHk4eGY0cEZqN3ZGYzlxOE9GWHNIQW00cXFfQVJFT0ZQNmVWemx2M0RscXN0cHpxNUxvQmI2eEhFQm5tT0hVYnpOVGlQS29HRmtUZw?oc=5\" target=\"_blank\">\"Unprecedented opportunity\": Trump, Vought to",
      "Trump in a Truth Social post said he will meet with Office of Management and Budget Director Russell Vought to discuss cutting agencies."
    ],
    "image_url": "",
    "titles": [
      "\"Unprecedented opportunity\": Trump, Vought to decide which \"Democrat\" agencies to cut - Axios",
      "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump announced on Truth Social that he plans to meet with Office of Management and Budget Director Russell Vought to discuss reducing government agencies. The outcome of the meeting and any subsequent actions are yet to be determined.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Conor McGregor Announces UFC Return at White House Event",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Thu, 02 Oct 2025 15:35:32 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.independent.co.uk"
    ],
    "snippets": [
      "The controversial former UFC champion has not fought since breaking his leg in a 2021 bout",
      "<p>While the UFC has remained tight-lipped on details surrounding its live event at the White House next year, one major detail may have just been revealed. Long-time MMA star Conor McGregor told Fox News&#8217; Sean Hannity on Wednesday night that he&#8217;ll be making his much-anticipated return f"
    ],
    "image_url": "",
    "titles": [
      "Impassioned Conor McGregor doubles down on White House fight: ‘Done deal’",
      "‘Done deal’: McGregor says he’ll fight on UFC’s White House card"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former UFC champion Conor McGregor announced on Fox News his return to fighting at a UFC event at the White House next year. This comes after McGregor has not competed since breaking his leg in a 2021 bout. The UFC has yet to provide further details about the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FIFA Chief Says Football Can't Solve Geopolitical Conflicts Amid Israel Debate",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 14:58:02 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "dpa-international.com"
    ],
    "snippets": [
      "Gianni Infantino says Fifa \"cannot solve geopolitical problems\" as pressure mounts on football's authorities to sanction Israel.",
      "FIFA president Gianni Infantino has rejected any intervention in conflicts and wars and rather stressed the unifying power of football. A statement by the ruling body said that Infantino stressed the importance of peace and unity at a FIFA council meeting on Thursday, especially in light of the Gaza"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8aa8/live/13b033a0-9f9a-11f0-8e4d-7723b0da5e04.jpg",
    "titles": [
      "Fifa cannot solve geopolitical issues - Infantino",
      "Infantino: 'FIFA cannot solve geopolitical problems'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "FIFA President Gianni Infantino stated that FIFA cannot resolve geopolitical issues amid calls to sanction Israel. At a council meeting, he emphasized football's role in promoting peace and unity, rejecting any intervention in conflicts. This stance comes as pressure on football's authorities increases regarding Israel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaxson Dart Joins Giants After Being Overlooked in 2025 NFL Draft",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 14:06:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The Saints passed on Dart in the 2025 NFL Draft, and now the Ole Miss product has an opportunity to prove them wrong",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQVHpNeGRLVlBRV3pZc2dDYlFLaTJYT09iZ29ZR2V5NFBoR195NUpQd3VDeThVWnZvWWlpVXVJRkxQdDRuOFkwOUU1eUE1MUQ3NmkyZy02aHhoQndQVlJHSGhmZkxTc1l4aW4zdUxCSUtrcFk5aS15dThIblEycGs2cDRKMA?oc=5\" target=\"_blank\">Why Giants' Jaxson Dart Will Have a Chip on His S"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/16f90f1f-50b5-4d6e-b18a-5c42404f6552/dartnyg.jpg",
    "titles": [
      "Giants' Jaxson Dart admits he has chip on his shoulder for matchup vs. Saints",
      "Why Giants' Jaxson Dart Will Have a Chip on His Shoulder While Playing the Saints - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jaxson Dart, an Ole Miss graduate, was overlooked by the Saints in the 2025 NFL Draft. He now has a chance to demonstrate his worth as he joins the Giants, turning the situation into an opportunity to prove any doubters wrong.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shuts Down as Congress Misses Funding Deadline",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 09:26:38 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown.",
      "After Congress failed to reach a funding agreement, the U.S. government officially shut down on Oct. 1."
    ],
    "image_url": "https://s.abcnews.com/images/US/251002_abc_social_shutdown_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  What does the government shutdown mean for you and your family?",
      "Yes, you still have to pay your student loans during the government shutdown"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government officially shut down on Oct. 1 after Congress failed to reach a funding agreement. ABC News' Selina Wang, as the senior White House correspondent, addressed the most searched questions regarding the shutdown on its first day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pianists Alter Sound Timbre with Touch; Study Solves Singlet Oxygen Mystery",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 08:54:04 EDT",
    "source": "ScienceDaily",
    "sources": [
      "New Scientist",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "Scientists confirmed that pianists can alter timbre through touch, using advanced sensors to capture micro-movements that shape sound perception. The discovery bridges art and science, promising applications in music education, neuroscience, and beyond.",
      "Singlet oxygen can be damaging in both cells and batteries but it has taken almost 60 years to work out exactly when it shows up in chemical reactions within both"
    ],
    "image_url": "",
    "titles": [
      "A century-old piano mystery has just been solved",
      "The mystery of highly reactive oxygen has finally been solved"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists have discovered that pianists can change the sound's timbre with their touch, using sensors to detect subtle hand movements. This finding connects art and science, with potential benefits for music education and neuroscience. In a separate study, researchers identified when singlet oxygen, harmful in cells and batteries, appears in chemical reactions, solving a 60-year-old mystery. These advancements offer new insights into both music performance and chemical processes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Denmark Appeals Judgment in Tax Fraud Case Involving Trader Sanjay Shah",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 13:08:31 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Danish government says it \"strongly disagrees with the premises of the judgment and is now seeking to appeal it\".",
      "Trader Sanjay Shah among defendants accused of tricking authorities over tax dividends"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0e4c/live/67b19be0-9f92-11f0-b9ae-cbef91e6ae73.jpg",
    "titles": [
      "Denmark loses £1.4bn tax fraud claim in UK court case",
      "Denmark loses £1.4bn London tax fraud case"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Danish government is appealing a judgment related to a case where trader Sanjay Shah and other defendants are accused of defrauding authorities through tax dividend schemes. The government has expressed strong disagreement with the judgment's premises.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Intercept Flotilla, Arrest Thunberg; Gaza Exodus Intensifies",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 23:07:36 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "As Israel cut off northern Gaza, the Global Sumud Flotilla was intercepted by Israeli forces, who arrested the activist Greta Thunberg aboard one of the vessels.",
      "Hundreds of thousands of Palestinians have fled Israel’s assault on Gaza City, but many are believed to remain, having nowhere to go or no means to leave."
    ],
    "image_url": "",
    "titles": [
      "Israel steps up Gaza City assault as Hamas weighs Trump peace deal",
      "Israel Escalates Gaza Offensive as Hamas Mulls Trump Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.701,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli forces intercepted the Global Sumud Flotilla, arresting activist Greta Thunberg among others, as they attempted to reach northern Gaza. Concurrently, Israel's military actions in Gaza City prompted hundreds of thousands of Palestinians to flee, though many remain trapped due to lack of resources or escape routes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hackers Apologize to BBC After Nursery Data Theft, Citing Regret",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 23:01:12 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The hackers tell the BBC they are sorry for their actions - but experts say it's a practical rather than moral move.",
      "<p>Experts say attempting to extort children lost Radiant group credibility in hacking world, which made it take action</p><p>Cybercriminals who stole pictures and the private information of <a href=\"https://www.theguardian.com/technology/2025/sep/26/kido-nursery-hackers-radiant-threaten-publish-chi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4c91/live/a39a27a0-9f59-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Hackers say they have deleted children's pictures and data after nursery attack backlash",
      "Kido nursery hackers say they have deleted stolen data"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.685,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.592,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hackers apologized to the BBC for stealing private information and pictures from a nursery, stating regret for their actions. Experts believe the apology was a strategic move to regain credibility in the hacking community after their attempt to extort children led to a loss of respect. This incident has prompted discussions on the ethics and reputation within cybercriminal circles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Conservationist Behind Chimpanzee Studies Dies at 91",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 20:53:35 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The conservationist, who died aged 91 on Wednesday, challenged how we relate to the natural world.",
      "<p>Pioneering scientist whose breakthrough studies of chimpanzees changed how the animals were perceived and led to greater protection</p><p>During the final months of 1960, in what is now <a href=\"https://www.tanzaniaparks.go.tz/national_parks/gombe-national-park\">Gombe national park</a>, Tanzania,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d9f8/live/de46afc0-9f06-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Dame Jane Goodall revolutionised our understanding of our closest primate cousins",
      "Dame Jane Goodall obituary"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.655,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A pioneering conservationist passed away at 91, known for groundbreaking chimpanzee studies in Tanzania's Gombe National Park in 1960. These studies altered perceptions of chimpanzees, leading to enhanced protections for them.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]