[
  {
    "title": "Israeli drone strikes kill four people in southern Lebanon",
    "summary": "State news agency says four killed in two separate attacks in the south as Israel says it targeted Hezbollah operatives.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:08:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.44
  },
  {
    "title": "A cleaner future for tires: Scientists pioneer chemical process to repurpose rubber waste",
    "summary": "Every year, millions of tires end up in landfills, creating an environmental crisis with far-reaching consequences. In the United States alone, over 274 million tires were scrapped in 2021, with nearly a fifth of them being discarded into landfills. A study has now pioneered a technique for breaking down this rubber waste and transforming it into valuable precursors for epoxy resins. This technique offers an innovative and sustainable alternative to traditional recycling methods while significantly reducing rubber waste in landfills.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:44:25 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.415
  },
  {
    "title": "Earliest days of Earth's formation",
    "summary": "New research sheds light on the earliest days of the earth's formation and potentially calls into question some earlier assumptions in planetary science about the early years of rocky planets. Establishing a direct link between the Earth's interior dynamics occurring within the first 100 million years of its history and its present-day structure, the work is one of the first in the field to combine fluid mechanics with chemistry to better understand the Earth's early evolution.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:44:30 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.408
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "summary": "Mark Lowen was covering the protests in Istanbul when he was arrested and later deported back to the UK, the BBC has said.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Video: New film delves into US college protests over Gaza genocide",
    "summary": "A new documentary, ‘The Encampments’ is shedding new light on the US college protests against the Gaza genocide.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:52:06 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care",
    "summary": "The Trump administration says it hopes to save $11.4 billion by freezing and revoking COVID-era grants.  Addiction experts say clawing back the federal funding is risky and could put patients at risk.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:22:09 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.388
  },
  {
    "title": "The Trump administration restructures federal health agencies, cuts 20,000 jobs",
    "summary": "The reduction in force comes along with a reorganization of the Department of Health and Human Services, consolidating 28 divisions to 15.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:50:01 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "'I feel like I have everything in front of me': Inside the $765 million marriage of Juan Soto and the Mets",
    "summary": "After a free agent megadeal that rocked the offseason, a new era begins for the Mets, New York and all of MLB.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:10:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "One room, 300 clubs, 80 agencies, 3,500 meetings: Inside soccer's secret transfer space",
    "summary": "The \"speed dating\" of the soccer world happens at TransferRoom, where over 300 clubs and 80 player agencies meet to talk deals 15 minutes at a time. Rob Dawson was there to see it.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:30:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Betting buzz: Gator fan's $5 parlay worth $168K ... if Duke wins",
    "summary": "One die-hard Florida Gator fan weighs what to do with a potential $168,000 parlay payday hinging on a Duke win.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Cuttlefish 'mesmerize' their prey with a moving skin pattern, study finds",
    "summary": "While sneaking up on prey, cuttlefish employ a dynamic skin display to avoid detection in last moments of approach, researchers have found.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:43:03 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "Research finds potential 'molecular mimics' behind COVID-induced autoimmune disease",
    "summary": "Scientists used advanced data analysis and machine learning to identify the viral proteins that may trigger autoimmune disorders such as type 1 diabetes and rheumatoid arthritis.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:42:49 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.375
  },
  {
    "title": "Children of moms who smoked or were obese are more likely to become obese adults",
    "summary": "A study finds that factors beyond a person's control, like socioeconomic status and whether their mom smoked or was obese, can influence whether they are overweight or obese as teenagers or adults.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:43:11 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cleaning microplastics",
    "summary": "Proof-of-concept work uses unique, safe particles to remove microplastics in a single cycle.",
    "domain": "Science",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 15:42:42 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "summary": "Strong wind, dry land and pine trees are a dangerous combination for wildfires, experts say.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "India: Why are private firms not investing despite record profits?",
    "summary": "Weak domestic consumption and muted export demand are restricting expansion plans, according to a report.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:29:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "OpenAI says ‘our GPUs are melting’ as it limits ChatGPT image generation requests",
    "summary": "The fervor around ChatGPT’s more accessible (and more advanced) image generation capabilities has forced OpenAI to “temporarily” put a rate limit on image generation requests, according to CEO Sam Altman. “It&#8217;s super fun seeing people love images in ChatGPT, but our GPUs are melting,” he posted on X today. Altman didn’t specify what the rate [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T13:28:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Pete Hegseth says Signal chat had no ‘war plans’. He’s wrong, say experts",
    "summary": "Signal app messages revealed Yemen bombing timelines, prompting debate about their classification and implications.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 08:41:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "summary": "Can the Dodgers repeat? Who will win MVP? Our experts make their predictions for the 2025 season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:48:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "First bets: Early picks for 2025 NFL season win totals",
    "summary": "What are the opening season win totals our experts like right now? Here are some early bets to consider.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "We answered the biggest questions: POY, WCWS picks and sleepers",
    "summary": "Our experts answered the biggest college softball questions at midseason. Which teams still have a lot to prove?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:38:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Trump pulls Stefanik nomination for U.N. ambassador because of thin GOP House majority",
    "summary": "The Republican congresswoman's nomination had been expected to easily clear the Senate — but Republicans are concerned about holding on to their thin majority in the House of Representatives.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:33:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Food is running out in Gaza nearly a month into Israeli blockade",
    "summary": "The World Food Programme says it has just five days left of flour and two weeks left of other food supplies in Gaza.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:40:14 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Syria's transitional leader is a former jihadist. Can he help stabilize the region?",
    "summary": "Ahmed al-Sharaa founded the Syrian branch of Al-Qaeda, but is now advocating unity. <em>The Atlantic's </em>Robert Worth discusses al-Sharaa's leadership and the Trump administration's group chat on Signal.<br /><br /> <br />",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:12:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "A lawyer who represented SpaceX looks to downsize federal contracting watchdog",
    "summary": "The appointment of Catherine Eschbach could raise conflict-of-interest concerns. She will also lead the downsizing of an agency that holds contractors accountable to federal civil rights laws.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:35:04 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Photos: Peak bloom in D.C. draws cherry blossom fans from near and far",
    "summary": "Springtime means cherry blossoms in the nation's capital. On a recent breezy morning, with peak bloom still two days away, the Tidal Basin was packed with both blossoms and visitors.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:30:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "There's no rulebook for deep-sea mining. Companies want to push forward anyway",
    "summary": "Countries have debated for decades whether to allow mining on the ocean floor, a potential trove of critical minerals. Now, companies are telling regulators they plan to move ahead, whether or not rules are in place.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:07:06 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ukrainians in front line regions reel from losses, but say hope dies last for them",
    "summary": "Into their fourth year of war, Ukrainians living in or near front line regions of their country grapple with their losses and contemplate an uncertain future.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:34:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump's new tariffs could raise car prices. And, Dems demand answers after Signal leak",
    "summary": "Trump announced he'll impose 25% tariffs on imported cars starting next week. The decision received mixed reactions. And, Democrats are demanding answers after bombing plans were discussed on Signal.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 06:55:53 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Six people dead after tourist submarine sinks off Egypt’s coast",
    "summary": "Local authorities say 39 rescued after vessel carrying tourists sunk off Hurghada’s tourist promenade area.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:24:34 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "summary": "Six people have died after the submarine sank near Hurghada, a popular tourist destination.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "summary": "Ukrainian President Volodymyr Zelensky shares this thoughts on Europe's support and his country's resilience.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Germany leads defiance to Trump car tariffs, saying it 'will not give in'",
    "summary": "Major economies vow to retaliate, with China accusing Washington of violating international trade rules.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "summary": "Police say the suspect was arrested after being overpowered with the help of a local resident - but the motive remains unclear.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:15:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "summary": "The film is set for release in May 2026, with Robert Downey Jr already announced as playing Doctor Doom.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "summary": "In an update, police also say they found evidence of blunt trauma on the remains of the toddler.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "summary": "After a child said there was a \"monster\" under the bed, the babysitter in Kansas checked and came face-to-face with a man.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'They invited me - now they're attacking me': Signal chat journalist speaks to BBC",
    "summary": "Speaking to the BBC’s Sarah Smith, The Atlantic's editor discusses the fallout of publishing the full Signal chat exchange among top officials.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:17:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "summary": "The law will allow Polish authorities to temporarily spend asylum rights at the border with Belarus.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "summary": "Riek Machar and his wife are detained after a convoy of 20 armed vehicles entered his home, his party says.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Brazil's Bolsonaro to stand trial on coup charges, court rules",
    "summary": "Brazil's top court has ruled that there is enough evidence to warrant that Jair Bolsonaro be put on trial.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 19:16:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "summary": "Boualem Sansal, 80, told a far-right news outlet that colonial France gave too much land to Algeria.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "China's dream of becoming a football superpower lies in tatters",
    "summary": "China has failed to qualify for the last five World Cups - and once again, their chances look unlikely.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 22:47:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French film star Depardieu denies sexual assault allegations at trial",
    "summary": "The two legal teams have clashed repeatedly in court as the French film star's lawyer has questioned the credibility of the two plaintiffs.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 20:28:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Four US soldiers missing for two days in Lithuania",
    "summary": "Lithuanian forces say search is ongoing after US Army finds vehicle submerged during drills near Belarus border.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 21:14:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Army in full control of Khartoum, Sudan military leader says",
    "summary": "\"Khartoum is free,\" says army chief Abdel Fattah al-Burhan after almost two years of occupation by the RSF.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 20:29:25 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "DR Congo conflict tests China's diplomatic balancing act",
    "summary": "Fighting in a mineral-rich region of central Africa proves a quandary for Chinese business interests.",
    "domain": "General",
    "location": "Global",
    "published": "Wed, 26 Mar 2025 23:20:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Satellite images reveal how South Korea wildfires spread",
    "summary": "BBC Verify looks at how Korean wildfires spread so rapidly",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:03:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Watch: How the South Korea wildfires became so deadly",
    "summary": "The BBC's Rachel Lee looks at what caused the wildfires to spread so fiercely.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:01:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Facebook&#8217;s new Friends-only feed ditches all the algorithmic junk",
    "summary": "Facebook is trying to go back to its roots with a new “Friends” tab that filters out the algorithmic recommendations that have taken over its main feed. The new tab is rolling out in the US and Canada, and will show your friends’ stories, reels, posts, and birthdays. In a blog post announcing the feature, [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T14:52:43-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 87 best deals",
    "summary": "Just as flower buds are beginning to bloom to mark the seasonal shift toward warmer months, Amazon is hosting its first big sales event of 2025. The Big Spring Sale, as it is known, is happening now, and runs through Monday, March 31st, bringing with it a slew of discounts on gardening supplies, bedding, and [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T14:42:10-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nintendo is paving the way for the Switch 2",
    "summary": "The biggest news at Nintendo&#226;&#x20ac;&#x2122;s March Direct showcase was a software update. Mixed in amongst a trailer for Metroid Prime 4: Beyond and the surprise reveal of a mobile news app, the company also announced what it calls &#226;&#x20ac;&#x153;virtual game cards.&#226;&#x20ac;&#157; They&#226;&#x20ac;&#x2122;re billed as a lending system that makes it relatively straightforward to share digital [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T14:06:13-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Fired Democratic FTC commissioners sue Trump",
    "summary": "The two Democratic Federal Trade Commission members illegally fired by Donald Trump have filed a lawsuit against the president and newly appointed Republican FTC chair Andrew Ferguson, as well as fellow commissioner Melissa Holyoak and executive director David Robbins. Commissioners Kelly Slaughter and Alvaro Bedoya write that, &#8220;Last week, President Donald Trump purported to fire [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T14:00:47-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Satya Nadella: DeepSeek is the new bar for Microsoft’s AI success",
    "summary": "Microsoft CEO Satya Nadella moved quickly to get DeepSeek&#226;&#x20ac;&#x2122;s R1 deployed on Azure in January. Nadella appeared to have anticipated the rise of a breakthrough like R1, and now he says a new bar has been set for the company&#226;&#x20ac;&#x2122;s own AI work. Speaking at an employee-only town hall last month, Nadella and his senior [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T13:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nintendo’s news app launches with a tiny Switch 2 leak",
    "summary": "While we expected to find out much more about Nintendo’s upcoming game system next week during the Switch 2 Direct event on April 2nd, a tiny new detail has been confirmed in this promo image for the new Nintendo Today news app. One of the screenshots listed in App Store and Google Play shows a [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T12:54:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon Big Spring Sale: all the deals you should know about",
    "summary": "Forget about Black Friday and Cyber Monday — or Prime Day, for that matter. For the second year in a row, Amazon has launched a spring sales event, which will run through Monday, March 31st, offering Prime and non-Prime members alike an opportunity to save big well ahead of the traditional shopping season. As you [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T12:44:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "iPhone users can now set WhatsApp as their default calling and texting app",
    "summary": "You can now choose WhatsApp as your iPhone’s default app for calls and text messages, as noted by WABetaInfo. After updating WhatsApp to version 25.8.74, you’ll see the app appear as an option in your Messaging and Calling default app settings. Apple first announced that it would let iPhone users in the European Union change [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T12:43:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Four wounded in Amsterdam stabbing attack, police say",
    "summary": "One suspect arrested after attack near the central Dam Square in the capital of the Netherlands.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:10:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who’s winning the global race for critical minerals?",
    "summary": "US President Donald Trump has invoked wartime powers to boost production of critical minerals.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "France’s Macron says not all European countries agree on force for Ukraine",
    "summary": "France’s Macron floats idea of a ‘reassurance force’ while UK’s Starmer accuses Russia of ‘playing games’.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:05:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who are the students Trump wants to deport?",
    "summary": "Rumeysa Ozturk, Mahmoud Khalil and Badar Khan Suri are among several students targeted by Trump.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "South Sudan opposition says vice president’s arrest ends peace deal",
    "summary": "A power-sharing deal between leaders Kiir and Machar unravels, threatening a return to South Sudan&#039;s bloody civil war.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:56:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "US immigration officials detain Turkish student over pro-Palestine views",
    "summary": "Video shows masked and plain-clothed US federal agents detaining a Turkish PhD student from Tufts University.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:35:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Kids Under Fire",
    "summary": "American doctors who volunteered in Gaza report witnessing disturbing pattern of children shot by the Israeli military.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:30:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
    "summary": "Europe increased its imports of Russian gas last year, says Ember, putting billions into Putin&#039;s Ukraine war chest.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:25:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What’s happened in Sudan’s civil war after new Khartoum battles?",
    "summary": "The Sudanese army hopes big wins in the capital can signal a turning point in the conflict with the paramilitary RSF.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:07:48 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French FM bats for ‘Franco-Chinese partnership’ during Beijing visit",
    "summary": "France urges multilateralism and deepened ties with China amid trade and security tensions with the US.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:02:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Hawaii’s Kilauea volcano launches lava fountains 180 metres high",
    "summary": "Video shows Mount Kilauea, Hawaii’s most active volcano, launching fountains of molten lava up to 180 metres high.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:30:52 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Full transcript of Trump team’s Yemen attack plan that was shared on Signal",
    "summary": "US officials accidentally leaked Yemen attack plans in Signal chat shared with The Atlantic editor-in-chief.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:08:52 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Prosecutors seek 15 years for ex-Spanish football president Villar",
    "summary": "Angel Maria Villar was replaced by Luis Rubiales in 2017 but now faces corruption and embezzlement charges.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:36:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sudan: At starvation’s edge",
    "summary": "Life for displaced Sudanese families is precarious.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:33:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The American dream is officially over",
    "summary": "All because the rich must always steal from the poor.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:19:31 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tottenham captain Son sparks South Korea pitch reviews as World Cup bid hit",
    "summary": "Captain Son Heung-min says poor pitches for home matches have hurt South Korea&#039;s 2026 World Cup qualifying campaign.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:37:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Yuki Tsunoda to replace Liam Lawson at F1 Red Bull Racing",
    "summary": "Yuki Tsunoda becomes the latest driver elevated to the famous F1 Red Bull team to drive alongside Max Verstappen.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:19:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Why is Pakistan’s new canal project sparking water shortage fears?",
    "summary": "Protesters fear than a plan to modernise agriculture could leave the lower riparian province of Sindh without water.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:54:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israeli air attack targets charity kitchen in Gaza",
    "summary": "An Israeli attack in central Gaza hit Palestinians who were waiting at a charity kitchen for a meal.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:51:07 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump calls Signal chat fallout a ‘witch hunt’ amid calls for probe",
    "summary": "Speaking to reporters from the Oval Office, Donald Trump focused on air strikes in Yemen rather than Signal chat leaks.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 09:12:03 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump says he may cut China tariffs to secure TikTok deal",
    "summary": "Trump says he will be willing to extend TikTok sale deadline in exchange for trade concessions.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 08:16:04 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Everything you need to know for MLB Opening Day, from lineups to live updates and takeaways",
    "summary": "Baseball is back! Here's your one-stop shop for all of the season-opening action.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:48:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "McCaffery brings fiery brand to alma mater Penn",
    "summary": "Penn has hired Fran McCaffery as its men's basketball coach, two weeks after he was fired at Iowa after a season in which the Hawkeyes won their fewest games in seven years.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sources: Dubs' Payton (thumb) out indefinitely",
    "summary": "Warriors guard/forward Gary Payton II has sustained a torn ligament in his left thumb and will be out for an indefinite period, sources told ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "summary": "Former NFL running back LeShon Johnson has been charged in a federal dogfighting case after 190 dogs were seized from him last year.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Top D-I scorer Latson to enter portal, agents say",
    "summary": "Florida State's Ta'Niya Latson, a three-time All-ACC selection who led the nation in scoring last season, is entering the transfer portal, her agents told ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Pass rusher Carter won't work out at PSU pro day",
    "summary": "Abdul Carter won't be participating in Penn State's pro day Friday, Carter's agent, Drew Rosenhaus, told ESPN's Adam Schefter.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Top-10 recruit Peat commits to Arizona, Lloyd",
    "summary": "Saying he wanted to be pushed at his new school, Koa Peat, one of the highest-ranked uncommitted high school prospects in the country, has chosen to play at Arizona.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "summary": "Four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, are being investigated for alleged \"indecent conduct\" during the Champions League game at Atlético Madrid, UEFA said on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sources: Jays make another offer to Guerrero",
    "summary": "In an attempt to sign star first baseman Vladimir Guerrero Jr., the Blue Jays have made another offer to the slugger in the past 24 hours, sources tell ESPN's Buster Olney.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:56:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The Calipari divorce worked out not only for Kentucky, but for Arkansas and BYU, too",
    "summary": "The coaching carousel dominoes have culminated in all three teams dancing to the second weekend.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "From a famed Russian basketball academy to Provo, Egor Demin is dialed in",
    "summary": "Demin has trotted the globe in pursuit of a dream, and now he has BYU on the verge of greatness.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "summary": "Does Paige Bueckers, Lauren Betts or Hannah Hidalgo takes over the top spot in our Sweet 16 player rankings?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:24:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "summary": "Hannah Hidalgo, Olivia Miles and Sonia Citron are driving Notre Dame toward a title.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:24:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "summary": "Mike Tannenbaum puts his GM hat on and makes his own first-round selections.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:49:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Already 2-0, Dodgers are the center of the spectacle on Opening Day",
    "summary": "Baseball hasn't seen anything like this superteam and its roster filled with All-Stars and phenoms.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:50:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "summary": "Our insiders break down the biggest NBA awards questions, including the MVP battle between Nikola Jokic and Shai Gilgeous-Alexander.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Three-pointer problem? Why the NBA has no qualms with it -- yet",
    "summary": "This season has seen a historic number of 3-point attempts. But does the league really need to rein in the 3s?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NHL betting: When, and how, will Alex Ovechkin break the NHL career goals record?",
    "summary": "Betting odds, picks and lines for Washington Capitals vs. Minnesota Wild on ESPN+ and Hulu tonight.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:57:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NHL playoff watch: Are the Minnesota Wild in trouble?",
    "summary": "A once-solid hold on playoff position now seems tenuous. Plus, projections for the entire postseason bracket.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:43:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'Have fun out there': How a simple message keeps Michigan State goaltender Trey Augustine on his game",
    "summary": "The Spartans goaltender recalls his late grandfather's words every time he steps on the ice.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:03:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "summary": "Here are the players on top of the Premier League, LaLiga, Bundesliga, Serie A and Ligue 1 scoring charts.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Davies' agent slams Canada staff over ACL tear",
    "summary": "Alphonso Davies' agent hit out at the player's treatment by Canada staff after it was announced that he has suffered a torn ACL against the United States, saying that the Bayern Munich star was \"pressured\" to play despite not being fully fit.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:23:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mbappé on Madame Tussauds statue: 'Handsome'",
    "summary": "Real Madrid forward Kylian Mbappé was pleasantly surprised by how \"handsome\" his wax statue is that will soon stand at London's Madame Tussauds.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:28:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Scaloni: Stop pressuring Messi over '26 World Cup",
    "summary": "Argentina coach Lionel Scaloni said Lionel Messi will decide whenever he wants if he plays at the 2026 World Cup.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 11:58:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Sources: Brazil set to decide Dorival's future",
    "summary": "The Brazilian Football Confederation (CBF) will discuss the future of Brazil coach Dorival Junior at a meeting on Friday, sources told ESPN Brasil.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:23:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Liga F approves challenge-only video review",
    "summary": "Liga F will introduce Football Video Support [FVS] next season as a first step towards the full implementation of VAR in the future, the Spanish Football Federation (RFEF) said on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:43:44 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Hermoso hopes for 'beautiful' Spain squad return",
    "summary": "Jenni Hermoso is hopeful of returning to Spain's squad for the upcoming UEFA Women's Nations League double header against Portugal.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:53:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Slegers hails Arsenal comeback against Madrid",
    "summary": "Arsenal manager Renee Slegers praised her side's stirring comeback in their 3-0 win over Real Madrid in the Women's Champions League on Wednesday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:57:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: Onana wants Utd stay, plans to rebuff SPL",
    "summary": "André Onana intends to stay at Manchester United even if he receives an offer from Saudi Arabia, a source has told ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:32:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Transfer rumors, news: Arsenal eye Ekitike as Isak alternative",
    "summary": "Arsenal have identified Eintracht striker Hugo Ekitike as an alternative to Newcastle's Alexander Isak.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:30:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Inside Brandon Graham's final, turbulent, triumphant season as an Eagle",
    "summary": "Graham, and family, recall the 15-year vet's final season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:58:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "For Notre Dame and Marcus Freeman, writing a different ending is the final step",
    "summary": "What's ahead for a Fighting Irish team that reached the national title game last season?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:37:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'Richie's Tater Shots': BYU's Saunders signs NIL deal with company founded by great-grandfather",
    "summary": "Saunders' great-grandfather co-founded Ore-Ida, best known for inventing the Tater Tot. The company has temporarily rebranded to Ore-Richie.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 09:49:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "summary": "Who has the edge in this week's UFC Fight Night? An MMA coach and betting insider make their picks.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:02:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What the numbers tell us about Mayer vs. Ryan and Zepeda vs. Farmer",
    "summary": "Two rematches on Saturday, one in Las Vegas, one in Mexico -- here's a look at the fights through the numbers.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mikaela Mayer-Sandy Ryan rivalry explained: All you need to know",
    "summary": "Ahead of their rematch on Saturday, we look at the Mayer vs. Ryan feud, the paint incident, and more.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Logos, coaches, key players and more",
    "summary": "Here are the teams, coaches and key players who will take the field as the UFL begins Season 2.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Vinicius Junior leads Team of the Week 28 in EA Sports FC 25",
    "summary": "The Brazilian forward nets his second appearance in TOTW.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:41:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bird Buddy’s solar-powered smart feeder is $100 off",
    "summary": "I admire birds as much as the next person, but taking up birdwatching isn’t something I’ve considered. I don’t have the patience, nor do I own a good pair of binoculars — which is necessary for seeing the majestic, winged creatures up close. What I might sooner settle on, however, is the Bird Buddy Pro, [&#8230;]",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T14:17:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "summary": "The allegations have left much of college athletics concerned about what other athletes might be victims.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  }
]