[
  {
    "title": "Masked Thieves Steal $7,000 Worth of Labubu Dolls in LA County",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 06:56:25 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "Fortune",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The LA County Sheriff's Department says it is investigating the incident.",
      "Police say video shows approximately $7,000 worth of Labubu dolls being stolen from a store in La Puente. The popular stuffed toy costs around $30 each, but often sell for more on secondary markets.",
      "The incident took place early Wednesday morning, and about $7,000 worth of Labubu dolls were stolen.",
      "LOS ANGELES (AP) — A group of masked thieves stole about $7,000 worth of Labubu dolls from a Los Angeles-area store this week, authorities said. The incident took place early Wednesday morning at a store in La Puente, a city about 18 miles (29 kilometers) east of Los Angeles, the LA County Sheriff&#"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cab5/live/79f6e020-75b8-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Watch: Masked thieves steal $7k of Labubu dolls in California",
      "WATCH:  Labubu dolls totaling $7,000 stolen from California store, authorities say",
      "Masked thieves stole all the Labubu dolls from a Los Angeles-area store. ‘We are still in shock’",
      "$7K worth of Labubu dolls stolen from Los Angeles store, authorities say"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.956,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.802,
    "summary": "A group of masked thieves, using a stolen Toyota, stole approximately $7,000 worth of Labubu dolls from a store in La Puente, Los Angeles County, early Wednesday morning. The popular toys, which can sell for more than their $30 retail price on secondary markets, were captured being taken on video, according to the Sheriff's Department.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "Two Japanese Boxers Die from Injuries After Tokyo Fights",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 03:00:57 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa have died following brain injuries sustained while competing on the same card, although in different fights, at Korakuen Hall in Tokyo on Aug. 2.",
      "Shigetoshi Kotari and Hiromasa Urakawa fought in separate bouts last weekend",
      "<ul><li><p>Hiromasa Urakawa passes days after Shigetoshi Kotari died </p></li><li><p>Pair had been injured in fights at same event in Tokyo on 2 August</p></li></ul><p>Two Japanese boxers have died days after suffering brain injuries in separate fights on the same card, boxing associations and media"
    ],
    "image_url": "",
    "titles": [
      "2 Japanese boxers die after injuries on same card",
      "Two Japanese boxers die after suffering brain injuries on same fight card",
      "‘Irreparable loss’: Two Japanese boxers on same card die from brain injuries"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary": "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa died following brain injuries from separate fights at an event in Tokyo's Korakuen Hall on August 2. Their deaths occurred days apart after competing on the same card. This tragic outcome has been confirmed by boxing associations and media reports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Israel's Gaza Control Plan Faces Global Condemnation, UK Boosts Aid",
    "domain": "general",
    "location": "global",
    "published": "2025-08-09T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CityNews",
      "Global News",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Some 20 countries called Israel's plan to seize Gaza City a \"dangerous escalation.\" Meanwhile, the UK pledged millions more in relief supplies, saying it wants the Palestinian territory \"flooded with aid.\"",
      "Prime Minister Benjamin Netanyahu faced opposition at home and abroad on Friday as his office said that the Israeli military would take control of Gaza City. Adam Rasgon, a reporter for The New York Times in Jerusalem covering Israeli and Palestinian affairs, describes what’s happening.",
      "'The plans that the Government of Israel has announced risk violating international law,' said a joint statement from Canada, Australia, France, Germany and the United Kingdom.",
      "Canada is joining international partners Saturday in panning Israel&#8217;s plan to take control of Gaza City approved this week. In a joint statement, foreign ministers from several countries including Canada, Australia, France, Germany and the United Kingdom said they reject a decision taken by th"
    ],
    "image_url": "",
    "titles": [
      "Middle East: Arab nations decry Israel's new Gaza City plan",
      "Israel’s New Plan to Take Gaza City",
      "Canada joins international partners condemning Israel’s plan to take over Gaza City",
      "Canada joins international partners to condemn Israel plan to take over Gaza City"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.771,
      "consensus": 0.935,
      "constructiveness": 0.047,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary": "Israel's plan to seize control of Gaza City has drawn international criticism and concerns of a \"dangerous escalation,\" with 20 countries, including Canada, Australia, France, Germany, and the United Kingdom, condemning the move as potentially violating international law. In response to the crisis, the UK has committed to sending millions more in relief supplies to the Palestinian territory. Prime Minister Benjamin Netanyahu faces significant opposition both domestically and internationally over the decision, as global leaders call for the area to be \"flooded with aid.\"",
    "constructiveness_score": 0.047,
    "constructiveness_reason": "1 constructive keywords out of 85 tokens"
  },
  {
    "title": "Canadian Firms Oppose Billionaire's Bid for Hudson's Bay Leases",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 19:59:24 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The mall owner also says Liu, who owns three B.C. shopping centres herself, has no brand, experienced staff or track record in retail.",
      "TORONTO &#8212; Several of Canada&#8217;s most prominent real estate companies are slamming an attempt from a B.C. billionaire to take over 25 former Hudson&#8217;s Bay leases, saying her plan for their spaces &#8220;defies commercial common sense&#8221; and is &#8220;entirely unrealistic.&#8221; Th",
      "TORONTO &#8212; Cadillac Fairview says a plan from a B.C. billionaire hoping to take over 25 former Hudson&#8217;s Bay leases &#8220;defies commercial common sense&#8221; and thus, she should not be allowed to move in. In filings made with the Ontario Superior Court on Saturday, Cadillac Fairview sa",
      "TORONTO — Several of Canada&#8217;s most prominent real estate companies are slamming an attempt from a B.C. billionaire to take over 25 former Hudson&#8217;s Bay leases, saying her plan for their spaces “defies commercial common sense” and is &#8220;entirely unrealistic.&#8221; The landlords, inclu"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/4bd6cde4ee8b3efa3730459bd77d8e25c1276abae07d244edbb7b798c6acdd61_caa0fd.jpg?quality=65&strip=all",
    "titles": [
      "Landlord says B.C. billionaire’s plan for Bay properties ‘defies commercial common sense’",
      "Landlords say Ruby Liu’s plan for Bay properties ‘defies commercial common sense’",
      "Landlord says Ruby Liu’s plan for Bay properties ‘defies commercial common sense’",
      "Landlords say Ruby Liu’s plan for Bay properties ‘defies commercial common sense’"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.777,
      "consensus": 0.897,
      "constructiveness": 0.057,
      "proximity": 1.0
    },
    "score": 0.772,
    "summary": "Several leading Canadian real estate firms, including Cadillac Fairview, are opposing a B.C. billionaire's bid to acquire 25 former Hudson's Bay leases. They argue her proposal lacks commercial viability and realism, highlighting her absence of a retail brand, experienced staff, or a proven track record in the sector. The opposition has been formally presented to the Ontario Superior Court, emphasizing the plan's departure from commercial norms.",
    "constructiveness_score": 0.057,
    "constructiveness_reason": "1 constructive keywords out of 70 tokens"
  },
  {
    "title": "365 Arrested in London at Banned Pro-Palestine Rally",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:11:36 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CityNews",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The Metropolitan Police said the number of arrests was the largest made by the force on a single day in the last decade.",
      "Campaigners say the detentions mark the largest ever mass arrest at a single protest by the London police.",
      "Protesters defy government ban and rally in Parliament Square",
      "<p>Number of arrests was highest recorded in relation to single operation in at least past decade, according to Met police</p><p>More than 450 people have been arrested in central London at the largest demonstration relating to Palestine Action since the group was proscribed as a terrorist organisat",
      "LONDON (AP) — British police said they arrested 365 people in central London on Saturday as supporters of a recently banned pro-Palestinian group intentionally flouted the law as part of their effort to force the government to reconsider the ban. Parliament in early July passed a law banning Palesti"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cc2a/live/974bb300-7566-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "Police make 474 arrests at protest against ban on Palestine Action",
      "UK police arrest 466 people at Palestine Action protest in London",
      "Police arrest hundreds of Palestine Action supporters under anti-terror law",
      "Police arrest 474 people at protest over Palestine Action ban in London",
      "London police arrest 365 people as pro-Palestinian protesters defy new law"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.78,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary": "In central London, British police arrested 365 people during a demonstration by supporters of Palestine Action, a pro-Palestinian group recently banned by Parliament. This event marks the largest number of arrests in a single day by the Metropolitan Police in the past decade. Critics argue that the ban on the activist group restricts freedom of speech and assembly, particularly targeting pro-Palestine protests. Despite the government ban, protesters rallied in Parliament Square, leading to the significant police response.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens"
  },
  {
    "title": "Salah Criticizes UEFA for Omitting Details of Palestinian Player's Death",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:25:26 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Mohamed Salah calls out Uefa over a tribute to Palestinian footballer Suleiman al-Obeid it posted on social media which failed to refer to the circumstances surrounding his death.",
      "Former Palestinian international player Suleiman Al-Obeid killed by Israeli attack on aid seekers in Gaza on Wednesday.",
      "Egyptian striker Mohamed Salah highlighted a UEFA post mourning Suleiman al-Obeid that omitted details about his death in Gaza. The former Palestinian international was reportedly killed in an Israeli strike.",
      "<p>Footballer Suleiman al-Obeid was killed in an Israeli attack in southern Gaza last week, according to Palestine Football Association</p><p>Mohamed Salah has criticised Uefa for failing to state how a footballer known as the “Palestinian Pelé” died in a tribute it posted.</p><p>Suleiman al-Obeid, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/68d5/live/96debd30-7562-11f0-836e-33040dd99c19.jpg",
    "titles": [
      "Salah calls out Uefa over wording of tribute to 'Palestinian Pele'",
      "Salah criticises UEFA tribute to ‘Palestinian Pele’",
      "Liverpool's Salah questions UEFA 'Palestinian Pele' tribute",
      "‘Can you tell us how he died?’: Mohamed Salah criticises Uefa over tribute to ‘Palestinian Pelé’"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.784,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.763,
    "summary": "Mohamed Salah criticized UEFA for not mentioning that Suleiman al-Obeid, a former Palestinian international footballer, was killed in an Israeli attack in Gaza. The Palestine Football Association confirmed al-Obeid's death occurred while aiding seekers in southern Gaza. Salah's critique focused on UEFA's tribute, which omitted the circumstances of al-Obeid's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "NFL Rookies, Free Agents Scrutinized in Preseason Week; Hunter Debuts",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 00:31:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "How did rookies and top free agent acquisitions fare in the NFL's first full preseason week?",
      "The two-way Colorado star took his first NFL snaps Saturday",
      "<p>Travis Hunter’s professional debut included 10 snaps on offence, eight on defence and no highlights.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL preseason Week 1 takeaways: Travis Hunter sees action at WR and CB in Jaguars debut",
      "Here's exactly how the Jaguars used Travis Hunter in the rookie's NFL preseason debut against the Steelers",
      "Travis Hunter plays offence, defence in pro debut as Jaguars lose to Steelers"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.928,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary": "Rookies and top free agent acquisitions in the NFL's first full preseason week were closely watched. Travis Hunter, a two-way Colorado star, made his professional debut with 10 snaps on offense, eight on defense, but had no standout moments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "Crew-10 Astronauts Safely Return After 5-Month ISS Mission",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 07:02:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The landing marks a successful end to their mission on board the International Space Station to help stranded pilots.",
      "The Crew-10 mission, returning on a SpaceX capsule, had replaced astronauts Wilmore and Williams, who were stranded aboard the International Space Station for nine months.",
      "Four astronauts returned to Earth on Saturday after hustling to the International Space Station five months ago to relieve the stuck test pilots of Boeing’s Starliner. Their SpaceX capsule parachuted into the Pacific off the Southern California coast a day after departing the orbiting lab. “Welcome "
    ],
    "image_url": "",
    "titles": [
      "Astronauts return to Earth in SpaceX splashdown after 5-month ISS mission",
      "NASA astronauts return to Earth from ISS after five months",
      "Astronauts return to Earth with SpaceX after 5 months at the International Space Station"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary": "Four astronauts successfully returned to Earth on Saturday, concluding their five-month mission aboard the International Space Station (ISS) where they replaced stranded astronauts Wilmore and Williams. The Crew-10 mission, utilizing a SpaceX capsule, parachuted into the Pacific Ocean off the Southern California coast, marking a successful end to their journey initiated to assist the pilots of Boeing’s Starliner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens"
  },
  {
    "title": "Jen Pawol Makes History as First Female MLB Umpire in Regular-Season Game",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 09 Aug 2025 21:29:59 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Pawol worked Saturday's doubleheader between the Braves and Marlins at Truist Park and is expected to be behind the plate for Sunday's game",
      "Jen Pawol's much-anticipated debut came as the first base umpire for Saturday's first game of a split doubleheader between the Atlanta Braves and Miami Marlins.",
      "<p>Jen Pawol has made history as the first female umpire to work a regular-season game in the major leagues.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/09/c1e5b2dd-171b-4ea5-b886-0f92da3bdd00/jen-pawol-umpire-g.jpg",
    "titles": [
      "WATCH: Jen Pawol makes MLB history as first female umpire to work a regular-season game",
      "Jen Pawol breaks MLB’s gender barrier as 1st female umpire to work a regular-season game",
      "Jen Pawol breaks gender barrier as first woman to umpire regular-season game"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.802,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary": "Jen Pawol became the first female umpire in Major League Baseball (MLB) history to officiate a regular-season game. She made her historic debut during a doubleheader between the Atlanta Braves and Miami Marlins at Truist Park, serving as the first base umpire for the first game on Saturday. Pawol is also slated to be behind the plate for Sunday's game, marking a significant milestone in MLB history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens"
  },
  {
    "title": "England Women's Rugby Triumphs Over France 40-6 Before World Cup",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:09:47 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "England's forward supremacy tells as they power to victory away to France in their final warm-up match before the 2025 Women's Rugby World Cup.",
      "Watch highlights as England thrash France 40-6 in their final warm-up game before the 2025 Women's Rugby World Cup.",
      "France 6-40 England: The World Cup favourites looked in frightening form in Mont-de-Marsan",
      "England ran in six tries as they completed their preparations for the Women's Rugby World Cup with a 40-6 win over France in Mont-de-Marsan."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/390b/live/d7f00660-755f-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "England thrash France in final World Cup warm-up",
      "England dominate France in final World Cup warm-up match",
      "Rampant Red Roses make World Cup statement with warm-up thrashing of France",
      "Red Roses cruise to win over France in final World Cup warm-up"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.78,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "In their final warm-up match before the 2025 Women's Rugby World Cup, England's women's rugby team secured a dominant victory over France, winning 40-6 in Mont-de-Marsan. Demonstrating their forward supremacy, England scored six tries, completing their preparations for the tournament with a strong performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens"
  },
  {
    "title": "Trump Nominates Tammy Bruce as US Deputy Representative",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:07:54 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Bruce, who is currently spokeswoman for the state department, has done \"brilliantly\" according to Trump.",
      "<p>Bruce, dubbed a ‘great patriot’ by Trump in announcement, now serves as state department spokesperson</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Saturday he was nominating Tammy Bruce, the state department spokesperson, as the next US deputy represent",
      "Bruce, a former conservative talk show host, had no prior experience in U.S. foreign policy before joining the State Department."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bd2c/live/ee227b00-7561-11f0-836e-33040dd99c19.jpg",
    "titles": [
      "Trump nominates ex-Fox News host Tammy Bruce as deputy UN ambassador",
      "Trump nominates ex-Fox commentator Tammy Bruce for deputy UN ambassador",
      "Trump picks State Dept. spokesperson Tammy Bruce for deputy U.N. post"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.779,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "Donald Trump announced his nomination of Tammy Bruce, the current State Department spokesperson and former conservative talk show host with no prior U.S. foreign policy experience, as the next US deputy representative. Trump praised Bruce's performance as \"brilliant\" and called her a \"great patriot.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "Landmine Injures 3 Thai Soldiers Near Cambodia Border Amid Ceasefire",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:15:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "It is the third incident in a few weeks in which Thai soldiers have been injured by mines around the border.",
      "The incident occured only days after an agreement to extend a ceasefire that ended the recent deadly conflict between the Southeast Asian neighbors.",
      "<p>Thai military accuses neighbouring country of planting concealed weapons in violation of international law</p><p>Three Thai soldiers were injured on Saturday after one tripped a landmine in territory along its frontier with Cambodia, Thailand’s army has said as it accused the neighbouring country"
    ],
    "image_url": "",
    "titles": [
      "Thai soldiers injured by landmine near Cambodia amid fragile truce",
      "Three Thai soldiers injured by landmine on Cambodian border",
      "Three Thai soldiers injured by landmine on border with Cambodia, army says"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.648,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary": "Three Thai soldiers were injured by a landmine along the Thailand-Cambodia border, marking the third such incident in recent weeks. This occurred shortly after both nations agreed to extend a ceasefire following a deadly conflict. Thailand's army accuses Cambodia of planting the mines, claiming it violates international law.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens"
  },
  {
    "title": "Mariano Rivera Injures Achilles at Old-Timers' Day, Surgery Needed",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 03:00:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Mariano Rivera tore an Achilles tendon while going after a fly ball at the New York Yankees' Old-Timers' Day game on Saturday and needs surgery.",
      "The Hall-of-Fame closer will have to undergo surgery at 55 to repair the ligament"
    ],
    "image_url": "",
    "titles": [
      "Rivera tears Achilles during Old-Timers' game",
      "Mariano Rivera suffers torn Achilles tendon during Yankees Old-Timers' Day game"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary": "Former New York Yankees pitcher Mariano Rivera, a Hall-of-Fame closer, tore his Achilles tendon while chasing a fly ball during the Old-Timers' Day game. The 55-year-old will require surgery to repair the ligament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens"
  },
  {
    "title": "NASCAR Leader Zilisch Breaks Collarbone in Victory Lane Fall",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 03:00:56 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "NASCAR Xfinity Series points leader Connor Zilisch broke his collarbone after a hard fall in Victory Lane at Watkins Glen International.",
      "Zilisch landed hard on the ground during the fall, but later said everything was OK beyond the broken bone"
    ],
    "image_url": "",
    "titles": [
      "Zilisch breaks collarbone in scary Victory Lane fall",
      "Connor Zilisch suffers broken collarbone after falling off his car in Victory Lane after NASCAR Xfinity race"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary": "NASCAR Xfinity Series points leader Connor Zilisch suffered a broken collarbone after falling in Victory Lane at Watkins Glen International. Despite the hard landing, Zilisch reassured that he was okay apart from the broken bone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens"
  },
  {
    "title": "Liverpool vs Crystal Palace at Wembley Season Opener; Chelsea Preps for Friendly",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 06:50:18 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Premier League champions Liverpool face FA Cup winners Crystal Palace at Wembley in the traditional curtain-raiser to the new season",
      "Everything you need to know ahead of Chelsea’s final pre-season friendly",
      "<ul><li><p>News and discussion as we count down to the action</p></li><li><p><a href=\"mailto:matchday.live@theguardian.com\">Get in touch</a> | <a href=\"https://viewer.gutools.co.uk/football/fixtures\">Check out the day’s upcoming fixtures</a></p></li></ul><p><strong>Here you go.</strong> Enjoy over a"
    ],
    "image_url": "",
    "titles": [
      "Is Liverpool v Crystal Palace on TV? Channel, kick-off time and how to watch Community Shield 2025",
      "Is Chelsea vs AC Milan on TV? Kick-off time, channel and how to watch pre-season friendly",
      "Community Shield buildup to Liverpool v Crystal Palace and more – matchday live"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.974,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "Liverpool, the Premier League champions, is set to face Crystal Palace, the FA Cup winners, at Wembley in the season's traditional opener. Additionally, Chelsea is preparing for their final pre-season friendly. Fans and viewers are encouraged to engage with the coverage and check upcoming fixtures as the new season approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens"
  },
  {
    "title": "Two Japanese Boxers Die from Injuries at Tokyo Event, Prompting Safety Concerns",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 10 Aug 2025 07:11:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "A second Japanese boxer has died from brain injuries suffered during separate bouts at the same event in Tokyo.",
      "A second Japanese boxer has died from brain injuries suffered during separate bouts at the same event in Tokyo."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10e5/live/e558b8e0-75b6-11f0-b3ef-cdf59e28b2a4.jpg",
    "titles": [
      "Second boxer from Tokyo event dies from brain injury",
      "Second boxer from Tokyo event dies from brain injury"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.961,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "Two Japanese boxers have died from brain injuries sustained in separate bouts at the same event in Tokyo. The tragic incidents have raised concerns about safety in the sport. Investigations are ongoing to determine the cause of the deaths and to prevent similar incidents in the future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens"
  },
  {
    "title": "EU Leaders Call for More Pressure on Russia Before Trump-Putin Summit",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 06:02:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Leaders of six European nations and the EU call for more pressure on Russia before Trump-Putin summit in Alaska.",
      "For President Vladimir V. Putin of Russia, it is an opportunity not just to end the Ukraine war on his terms but to split apart the Western security alliance.",
      "The American leader has agreed to a meeting with the Russian president in Alaska next Friday to discuss ending the war in Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Europe promises to ‘stand firmly’ with Ukraine as Trump, Putin plan summit",
      "With Ukraine in the Balance, Trump and Putin Head Into Summit With Mismatched Goals",
      "What Putin Hopes to Gain From a Summit With Trump"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.958,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Leaders of six European countries and the EU have urged for increased pressure on Russia ahead of a scheduled summit in Alaska between President Trump and President Putin. The meeting, set for next Friday, aims to discuss a resolution to the Ukraine war. European leaders express concerns that the summit could allow Putin to achieve his goals on his terms, potentially fracturing the Western security alliance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "NASA's 10th Commercial Crew Capsule Splashes Down in Pacific",
    "domain": "science",
    "location": "national",
    "published": "Sat, 09 Aug 2025 11:34:35 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "NASA"
    ],
    "domains": [
      "general",
      "science"
    ],
    "snippets": [
      "It took the capsule 17 hours to make the trip home, experiencing re-entry temperatures of around 3,000 degrees Fahrenheit as it punched through the atmosphere following Friday's ISS undocking.",
      "Editor&#8217;s Note: This release was edited Aug. 9, 2025, to update the International Space Station docking port for the Crew-10 mission. The first crew to splash down in the Pacific Ocean off the coast of California as part of NASA’s Commercial Crew Program completed the agency’s 10th commercial c"
    ],
    "image_url": "",
    "titles": [
      "4 people and 5 months in space, NASA's Crew-10 mission safely returns to Earth",
      "NASA’s SpaceX Crew-10 Mission Returns, Splashes Down Off California"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.709,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.632,
    "summary": "A capsule returned to Earth after a 17-hour journey from the International Space Station (ISS), enduring re-entry temperatures of about 3,000 degrees Fahrenheit. It successfully splashed down in the Pacific Ocean off the coast of California, marking NASA's 10th commercial crew mission. This event was also notable as the first crew to complete a splashdown in the Pacific Ocean under NASA’s Commercial Crew Program. The editor's note clarifies an update regarding the docking port for the Crew-10 mission, made on August 9, 2025.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 90 tokens"
  },
  {
    "title": "Elderly U.S. Workers Struggle Financially, Unable to Retire",
    "domain": "business",
    "location": "global",
    "published": "2025-08-10T07:47:01Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "For America's oldest workers, retirement isn't possible. Workers in their 80s live paycheck to paycheck, use Social Security, and dip into savings."
    ],
    "image_url": "https://i.insider.com/6894d38f194a2d49b8ae2c4b?format=jpeg",
    "titles": [
      "They're in their 80s, still working, and living paycheck to paycheck"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "Many of America's oldest workers in their 80s are unable to retire and live paycheck to paycheck, relying on Social Security and dipping into savings to make ends meet. This highlights the financial challenges faced by elderly workers in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "NY Man Submits Recordings in Case Against Ex Alleged to Pose as CIA Operative",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 04:01:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Filings in New York include recordings in support of Niels Troost’s claim his former partner pretended to be a CIA operative"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fef6fde00-0765-4a14-97de-63d8e8eba0b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Sanctioned oil trader sues corporate spooks over alleged ‘smear campaign’"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.9,
      "consensus": 0.393,
      "constructiveness": 0.091,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "In New York, Niels Troost has submitted recordings as part of his legal case, claiming his former partner falsely represented themselves as a CIA operative. These filings aim to support Troost's allegations against his ex-partner by providing evidence of the claimed deceit.",
    "constructiveness_score": 0.091,
    "constructiveness_reason": "1 constructive keywords out of 44 tokens"
  },
  {
    "title": "GPT-5 Launches: AI Insider Shares Engagement Tips",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 00:41:24 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "GPT-5 is here! It is important to upgrade your prompt engineering skills to best leverage GPT-5. I provide the key aspects you need to know. An AI Insider scoop."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/681fe9798b2392df68d842bc/0x0.jpg?width=960",
    "titles": [
      "Here Are GPT-5 Prompt Engineering Insights Including Crucial AI Prompting Tips And Techniques"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.931,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "GPT-5 has been released, marking a significant advancement in artificial intelligence. Users are encouraged to enhance their prompt engineering skills to fully utilize its capabilities. The article offers essential insights and tips for effectively engaging with GPT-5, as shared by an AI Insider.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens"
  },
  {
    "title": "COVID-19 Vaccines Save 2.5 Million Lives Globally, Report Finds",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 05:33:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/2-5-million-lives-saved-the-untold-story-of-covid-vaccines-global-impact/\" rel=\"nofollow\" title=\"2.5 Million Lives Saved: The Untold Story of COVID Vaccines’ Global Impact\"><img alt=\"Taking Off COVID Mask at Sunset\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "2.5 Million Lives Saved: The Untold Story of COVID Vaccines’ Global Impact"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.948,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary": "A report highlights that COVID-19 vaccines have saved around 2.5 million lives globally. The vaccines have been effective in reducing severe illness and death. The data underscores the importance of vaccination efforts in combating the pandemic. The impact of vaccines in saving lives is significant and emphasizes the need for continued vaccination campaigns to control the spread of the virus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "Olympic Medalists Richard, Nedoroscik Excluded from 2025 U.S. World Team",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 01:05:14 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Despite taking silver at this week’s U.S. Gymnastics Championships, Olympic medalist Frederick Richard was left off the U.S. team for the 2025 World Championships. Fellow Olympic medalist Stephen Nedoroscik, the \"pommel horse guy,\" also missed the cut."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68981b5e0ef093a5d89ad599/0x0.jpg?width=960&precrop=1978%2C1113%2Cx0%2Cy131",
    "titles": [
      "Olympic Stars Stephen Nedoroscik And Fred Richard Left Off World Championship Team"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.939,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary": "Olympic medalist Frederick Richard, who won silver at the U.S. Gymnastics Championships, and fellow Olympic medalist Stephen Nedoroscik were not selected for the U.S. team for the 2025 World Championships. This decision comes despite their previous achievements in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Cyber Attacks Continue Despite Ceasefire After 12-Day Conflict",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "A long-running campaign of cyber attacks has continued since a ceasefire ended the 12-day conflict"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F87370eb0-7f60-430c-9a2d-af1ed3f4bbba.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "The other Israel-Iran war"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.899,
      "consensus": 0.393,
      "constructiveness": 0.077,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary": "A series of cyber attacks has persisted following the conclusion of a 12-day conflict despite a ceasefire being in place. The attacks have been ongoing, indicating a sustained effort by unknown actors to target various entities. The situation highlights the persistent threat of cyber warfare even after physical conflicts have ended.",
    "constructiveness_score": 0.077,
    "constructiveness_reason": "1 constructive keywords out of 52 tokens"
  },
  {
    "title": "Immune Cells Linked to Alzheimer’s Resilience, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 05:08:44 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/some-brains-stay-sharp-thanks-to-a-plaque-eating-immune-cell-that-fights-alzheimers/\" rel=\"nofollow\" title=\"Some Brains Stay Sharp Thanks to a Plaque Eating Immune Cell That Fights Alzheimer’s\"><img alt=\"Microglia Brain Immune Cells\" class=\"webfeedsFeaturedVisual wp"
    ],
    "image_url": "",
    "titles": [
      "Some Brains Stay Sharp Thanks to a Plaque Eating Immune Cell That Fights Alzheimer’s"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.94,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary": "Researchers have discovered that certain brains remain resilient against Alzheimer’s due to a specific type of immune cell known as microglia. These cells combat Alzheimer's by consuming the harmful plaques associated with the disease, thus helping to maintain cognitive function. This finding could lead to new treatments targeting these immune cells to fight Alzheimer’s.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "New Amino Acid Found to Boost Weight Loss, Study Reveals",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 04:43:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-little-known-amino-acid-could-be-the-secret-to-rapid-weight-loss/\" rel=\"nofollow\" title=\"This Little-Known Amino Acid Could Be the Secret to Rapid Weight Loss\"><img alt=\"Beautiful Young Fit Happy Woman With Measuring Tape\" class=\"webfeedsFeaturedVisual wp-post-"
    ],
    "image_url": "",
    "titles": [
      "This Little-Known Amino Acid Could Be the Secret to Rapid Weight Loss"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.932,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.475,
    "summary": "Researchers have identified a lesser-known amino acid as a potential key to rapid weight loss. This discovery suggests that incorporating this specific amino acid into a diet could significantly enhance weight loss efforts. The study's findings offer a new perspective on dietary supplements and their role in managing weight.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens"
  },
  {
    "title": "FP Video Analyzes Trump's Trade War Effects, Toronto Housing Market Trends",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 11:00:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Watch FP Video for updates on Donald Trump's trade war and Toronto's housing market"
    ],
    "image_url": "",
    "titles": [
      "Canada faring ‘pretty good’ in Trump’s tariff war, except for this sector"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.644,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.474,
    "summary": "The FP Video provides updates on Donald Trump's trade war, highlighting its impacts and current developments. Additionally, it covers the state of Toronto's housing market, detailing changes and trends. This summary encapsulates the key information from the video, focusing on the effects of the trade war and the condition of the housing market in Toronto without speculating on future outcomes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "Space Discovery: Prebiotic Molecule May Illuminate Origins of Life",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:23:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/explosive-prebiotic-molecule-could-reveal-clues-to-life-in-space/\" rel=\"nofollow\" title=\"Explosive Prebiotic Molecule Could Reveal Clues to Life in Space\"><img alt=\"Cosmic Chemistry Explosion Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src"
    ],
    "image_url": "",
    "titles": [
      "Explosive Prebiotic Molecule Could Reveal Clues to Life in Space"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.817,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "Researchers have identified an explosive prebiotic molecule in space, which might provide insights into the origins of life. This discovery, highlighted through a conceptual art piece, suggests that the molecules necessary for life could be more widespread in the universe than previously thought. The current status of this research opens new avenues for understanding how life might develop in extraterrestrial environments.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens"
  },
  {
    "title": "Astronomers Uncover Star's Violent Merger History, Challenging Old Views",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 23:33:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-seemingly-normal-star-was-hiding-a-violent-past/\" rel=\"nofollow\" title=\"This Seemingly Normal Star Was Hiding a Violent Past\"><img alt=\"Hot White Dwarf Merger\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"623\" src=\"https://scitechdaily.com/images/Hot-Wh"
    ],
    "image_url": "",
    "titles": [
      "This Seemingly Normal Star Was Hiding a Violent Past"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.837,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary": "Astronomers have discovered that a star, initially thought to be normal, has a violent history of merging with another star. This conclusion was reached after observing its unusual characteristics and applying advanced models. The star, now a hot white dwarf, provides insights into stellar evolution and the outcomes of star mergers. This finding challenges previous understandings and highlights the complex nature of star life cycles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens"
  },
  {
    "title": "Astronomers Discover Starry \"Ghostly Bridge\" Between Galaxy Clusters",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:58:02 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-ghostly-bridge-of-stolen-stars-reveals-galactic-tug-of-war/\" rel=\"nofollow\" title=\"A Ghostly Bridge of Stolen Stars Reveals Galactic Tug-of-War\"><img alt=\"DECam Deep View Abell 3667\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdai"
    ],
    "image_url": "",
    "titles": [
      "A Ghostly Bridge of Stolen Stars Reveals Galactic Tug-of-War"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "Astronomers have discovered a \"ghostly bridge\" made of stars between two galaxy clusters, Abell 3667, revealing a cosmic tug-of-war. This phenomenon, captured using the DECam Deep View, indicates a massive gravitational interaction, where stars are being pulled from their galaxies. This finding provides new insights into the dynamics of galaxy clusters and the gravitational forces at play in the universe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "Virus Identified as Culprit in Pacific Sea Star Die-Off",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 14:40:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Scientists say they have at last solved the mystery of what killed more than 5 billion sea stars off the Pacific coast of North America in a decade-long epidemic."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-say-they-ha.jpg",
    "titles": [
      "Scientists say they have solved the mystery of what killed more than 5 billion sea stars"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.756,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Scientists have identified a virus as the cause of a decade-long epidemic that killed over 5 billion sea stars along the Pacific coast of North America. The virus, known as sea star-associated densovirus, is believed to have played a significant role in the mass die-off. This discovery sheds light on the mysterious decline of sea star populations in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens"
  },
  {
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time. It's also, seemingly, just the beginning - paving the way forward for the president's pollutin"
    ],
    "image_url": "",
    "titles": [
      "Why Donald Trump’s environmental data purge is so much worse this time"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.672,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.43,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "I keep hearing the same sentence repeating in my head. \"My vision is that every American is wearing a wearable within four years.\" RFK Jr., our current secretary of the Department of Health and Human Services, said this at a congressional hearing at the end of June. Wearables, he said, are key to th"
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.686,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.425,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 17 tokens"
  },
  {
    "title": "Aura’s Aspen impressive digital frame is the most affordable it’s been",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:35:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Returning to work or school from summer vacation is never easy, but the Aura Aspen could help you hold onto your favorite memories by putting them front and center. And right now, you can pick up the digital photo frame for around $199 ($30 off) from Amazon, Best Buy, and Aura, which is a new [&#823"
    ],
    "image_url": "",
    "titles": [
      "Aura’s Aspen impressive digital frame is the most affordable it’s been"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.68,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.424,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "Is This Seat Taken? makes seating fussy people fun",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Creating seating arrangements can be pretty stressful; the empath part of me strives to find the perfect seat for every person even if it's a nearly impossible task. If it's for a big, meaningful event, I get even more anxious. When you find the right place for everyone, though, it's even more satis"
    ],
    "image_url": "",
    "titles": [
      "Is This Seat Taken? makes seating fussy people fun"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.672,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.423,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  },
  {
    "title": "I went camping in a heat dome, and these five gadgets saved my vacation",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "I recently returned from a family camping trip to Cades Cove in the Great Smoky Mountains National Park. I live in South Carolina, so in mid-July, a trip to the mountains is usually an excellent way to seek out cooler temperatures. Not this year. Thanks to this summer's heat dome, I was facing a wee"
    ],
    "image_url": "",
    "titles": [
      "I went camping in a heat dome, and these five gadgets saved my vacation"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.672,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.423,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens"
  },
  {
    "title": "Tiny Particles in Organs May Cause Serious Health Issues",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 12:46:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Small particles can get lodged in crevices of organs from lungs to arteries, causing inflammation and other health issues."
    ],
    "image_url": "",
    "titles": [
      "How Canadian Wildfire Smoke Is Jeopardizing Health Across North America"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.669,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.422,
    "summary": "Tiny particles can become stuck in organ crevices like lungs and arteries, leading to inflammation and health problems. This can impact overall well-being and potentially cause serious health issues. It is crucial to understand and address the risks associated with these particles to maintain good health.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens"
  },
  {
    "title": "What&#8217;s a smut peddler to do these days?",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the aftermath of itch.io pulling the sale of over 20,000 pages of adult content, the creators of that work are left feeling betrayed, exhausted, and fearful. The number of platforms that permit the sale of adult material is shrinking, and there's no guarantee the ones that remain will still permi"
    ],
    "image_url": "",
    "titles": [
      "What&#8217;s a smut peddler to do these days?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.658,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.42,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens"
  },
  {
    "title": "Encryption made for police and military radios may be easily cracked",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:18:47 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "An encryption algorithm can have weaknesses that could allow an attacker to listen in."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/Screenshot-2025-08-08-at-15-37-31-Encryption-Made-for-Police-and-Military-Radios-May-Be-Easily-Cracked-WIRED-1045x648.png",
    "titles": [
      "Encryption made for police and military radios may be easily cracked"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.649,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "New adhesive surface modeled on a remora works underwater",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:08:48 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It was tested for its ability to adhere to the inside of the digestive tract."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-1142897466-1152x648.jpg",
    "titles": [
      "New adhesive surface modeled on a remora works underwater"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.646,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.417,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  }
]