[
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of an ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6868681533564815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3817170383391204,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while a court case is still ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has updated its Windows 11 Insider Preview, removing a bypass script that previously allowed users to set up the operating system without an internet connection or logging into an account. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged in during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6828678857291667,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38071697143229166,
    "summary": "Microsoft has updated the Windows 11 Insider Preview, eliminating the option to bypass the internet connection and account login requirements during setup. Now, all Windows 11 devices must be connected to the internet and logged into an account during the installation process."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway until Monday, March 31st, offering numerous deals on a wide range of products. These deals are available to all customers, not just Amazon Prime members. The sale includes over 100 deals on popular gear, and a separate roundup highlights affordable options for budget-conscious shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6745848656018518,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3786462164004629,
    "summary": "Amazon's Big Spring Sale is happening until March 31st, featuring over 100 deals on various products, open to all customers including non-Prime members. The sale also offers a selection of affordable options for those on a budget."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X (previously Twitter) in an all-stock deal. Musk valued xAI at $80 billion and X at $33 billion, which includes $12 billion in debt. This acquisition comes a few years after Musk originally bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6686159620370371,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37715399050925924,
    "summary": "Elon Musk's AI firm, xAI, has purchased the social media platform X (formerly known as Twitter) in an all-stock transaction. The deal values xAI at $80 billion and X at $33 billion, incorporating $12 billion of debt. This move follows Musk's initial acquisition of Twitter for $44 billion a few years prior."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature aims to enable IT professionals to remotely recover devices that won't boot, a response to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6612215175810185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37530537939525466,
    "summary": "Microsoft is testing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This feature is designed to help IT professionals remotely recover devices that are unable to boot, aiming to prevent issues like the previous Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their existing accounts to a Google account until next year. This update follows the company's acquisition of Fitbit in early 2021 and its subsequent integration of Fitbit’s services with its own. The original deadline was set for 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6451009269097223,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3712752317274306,
    "summary": "Google has postponed the deadline for Fitbit users to switch their accounts to Google accounts to next year, following its acquisition of Fitbit in 2021. This extension moves the original migration deadline, initially set for 2025."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer relations with the Trump administration following obstacles in global talks. Initially sponsored by Nauru, TMC's 2021 efforts accelerated the creation of regulatory frameworks for deep-sea mining."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6346490367708333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36866225919270834,
    "summary": "The Metals Company (TMC), focused on starting deep-sea mining, sought to improve ties with the Trump administration after facing challenges in international discussions. Sponsored by Nauru, TMC's actions in 2021 pushed for the development of regulations governing deep-sea mining."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. This sale event, running through March 31, 2025, offers significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6255984655208333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36639961638020835,
    "summary": "Amazon's Big Spring Sale, offering discounts on items such as gardening supplies and bedding, is now underway and will continue until March 31, 2025, aligning with the onset of warmer weather."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are collaborating on a thriller novel with elements similar to \"Squid Game.\" The untitled book, which has attracted eight-figure bids for publishing rights, involves players competing in lethal challenges to survive, as reported by Deadline."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6152954199305556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3638238549826389,
    "summary": "MrBeast and James Patterson are working together on a thriller novel, inspired by \"Squid Game,\" featuring a competition with deadly stakes. The yet-to-be-titled book has received publishing offers in the eight-figure range, according to Deadline."
  },
  {
    "title": "Lenovo’s upcoming SteamOS handheld will cost $50 more than expected",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:16:01-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lenovo's Legion Go S, a handheld gaming PC powered by SteamOS, was introduced at CES 2025 with a price of $499.99. It is positioned as a competitor to Valve's Steam Deck, fitting between their $399 LCD and $549 OLED models in terms of cost."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6072608956481482,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.361815223912037,
    "summary": "Lenovo unveiled the Legion Go S, a handheld gaming PC running on SteamOS, at CES 2025. Priced at $499.99, it competes with Valve's Steam Deck, slotting between the $399 LCD and $549 OLED versions in price."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro - Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 04:02:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 19 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 19 people and spread to a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Thailand's capital, leading to concerns that workers might be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers could be trapped in the debris."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:08:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other top officials, stating it demonstrated a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards a visit by the US Vice President and other senior officials, describing it as showing a \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting with Canadian leaders following the upcoming elections in Canada."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as highly effective and revealed intentions for a meeting with Canadian officials after Canada's forthcoming elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, detailing the emotional turmoil they are experiencing due to their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have expressed their emotional distress to the BBC over the disappearance of their loved ones."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, a public figure, faced ridicule for wearing a disguise several years ago during a TV appearance to promote his own book."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki, a public figure, was mocked for wearing a disguise on a TV show several years ago while promoting his book."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey this week following their coverage of mass protests happening throughout the nation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey after reporting on widespread protests across the country."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike targeting a Hezbollah location, following the launch of two rockets from southern Lebanon into northern Israel."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah site after two rockets were fired from southern Lebanon into northern Israel."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced allegations of copying the melody from the 1979 disco song \"Wiggle and Giggle All Night.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the melody of the 1979 disco track \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is viewed as an effort to question the legitimacy of the current government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event is seen as an attempt to challenge the legitimacy of the government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests demanding the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, calling for the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Alex Warren was homeless and sleeping in friends' cars - now he's number one",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:37:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An influencer who transitioned into a music career is achieving chart success by creating music that addresses and aims to heal from personal trauma."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An influencer who transitioned into a music career is gaining chart success with songs that focus on healing from personal trauma."
  },
  {
    "title": "A rediscovered painting that just made Indian art history",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, establishing a new record for the highest price achieved by the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an incident in South Sudan, where they came under fire while evacuating a military base."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for safely conducting an evacuation from a military base in South Sudan despite being under attack."
  },
  {
    "title": "'It's going to get worse': American car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices for cars have significantly increased, with expectations of further rises, according to a statement from a car seller to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have significantly risen, with further increases anticipated, a car seller told the BBC."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck a region already facing challenges including a civil war, food shortages, and a weakening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has hit a region that is already dealing with a civil war, food shortages, and a declining economy."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescue efforts in Mandalay where individuals, including a rescuer, were reported to be digging through rubble by hand to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage in Mandalay. Rescue teams, including locals, are manually searching through debris to locate survivors."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her lack of fear in the music industry and credited artists Charli XCX and Sabrina Carpenter as her inspirations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed confidence in navigating the music industry, attributing her fearlessness to the influence of artists Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs from Africa and beyond showcases a diverse range of moments, capturing the essence of daily life, natural beauty, and significant events across the continent."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's notable photographs from Africa and beyond highlight a variety of scenes, including everyday life, natural landscapes, and key events, reflecting the continent's diversity."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after evacuating from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby shortly after she evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Shwe Sar Yan Pagoda, located south-east of Mandalay in Myanmar, experienced a collapse at its top due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Shwe Sar Yan Pagoda, situated southeast of Mandalay in Myanmar, suffered a collapse at its top as a result of an earthquake."
  },
  {
    "title": "Bridge collapses into river in Mandalay, Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:49:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake struck central Myanmar, causing significant damage to the Ava Bridge near Mandalay, as shown in video footage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake hit central Myanmar, resulting in substantial damage to the Ava Bridge near Mandalay, as revealed in video footage."
  },
  {
    "title": "Four Afghan girl guitarists escaped the Taliban. Will they be forced back?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 04:42:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four Afghan girls, Yasemin, Zakia, Shukriya, and Uzra, all aged 7, fled Afghanistan and now face the risk of deportation due to a Trump-era order and Pakistan's policies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four Afghan girls, Yasemin, Zakia, Shukriya, and Uzra, all aged 7, fled Afghanistan and are now at risk of deportation because of a Trump-era order combined with Pakistan's immigration policies."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a growth factor cocktail that successfully reversed potentially fatal cell damage in mice infected with anthrax. This finding suggests the potential for adapting this treatment for use in humans."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a growth factor cocktail that reversed severe cell damage in mice with anthrax, indicating a possibility for human treatment adaptation."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created an advanced model using AI and machine learning to predict chemotherapy outcomes for muscle-invasive bladder cancer patients more accurately. This model combines whole-slide tumor imaging with gene expression analyses, offering superior performance compared to earlier models that relied on only one type of data."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new AI and machine learning model that accurately predicts chemotherapy outcomes for muscle-invasive bladder cancer patients by combining whole-slide tumor imaging with gene expression analyses. This approach outperforms previous models that used only one data type."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a direct link between dopamine levels and cognitive flexibility, showing that increased dopamine production in the brain is associated with better performance on challenging tasks. This finding, revealed through PET imaging, suggests the potential for developing targeted treatments for neurological and psychiatric disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have found a direct connection between dopamine levels in the brain and cognitive flexibility, using PET imaging. Higher dopamine production correlates with improved performance on difficult tasks. This discovery opens avenues for creating specific treatments for neurological and psychiatric conditions."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of Toxoplasma gondii, a parasite. This insight could help in understanding how to tackle latent infections in the nervous system."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can detect and control the dormant stage of Toxoplasma gondii, a parasite. This discovery could aid in developing strategies to address latent infections in the nervous system."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing nearly 270,000 seed plant species worldwide has found that environmental conditions and dispersal barriers play key roles in determining why certain plants thrive in specific regions but not in others. The research explored how these patterns of plant distribution have evolved over millions of years, highlighting the influence of geography and climate on global plant diversity."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species revealed that environmental conditions and dispersal barriers significantly influence plant distribution, explaining why some plants are found in certain areas but not others. This research, which examined plant diversity over millions of years, underscores the impact of geography and climate on where plants thrive worldwide."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:17:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and grabbed 19 rebounds, leading LSU to an 80-73 victory over NC State, securing the team's third consecutive Elite Eight appearance. This performance was crucial as teammate Flau'Jae Johnson faced difficulties during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow led LSU to an 80-73 win over NC State with 30 points and 19 rebounds, marking the team's third straight Elite Eight appearance. This was especially significant as her teammate Flau'Jae Johnson struggled during the game."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:16:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater from online bullying, stating that JuJu Watkins' ACL injury was not caused by a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State player Chandler Prater against online bullying, clarifying that the ACL injury of JuJu Watkins was not the result of a dirty play."
  },
  {
    "title": "Dodgers show off ring bling, keep title party going",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:17:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Following their championship celebration, the Dodgers unveiled their World Series rings, crafted with 14-karat yellow gold, diamonds, and sapphires, continuing the festivities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Dodgers celebrated their World Series victory by revealing their championship rings, made from 14-karat yellow gold, adorned with diamonds and sapphires."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:16:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the two-host regional system for the women's NCAA tournament, stating it has ruined the game. He expressed clear disdain for the format, though did not specify individuals responsible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma criticized the women's NCAA tournament's two-host regional system, stating it has ruined the game. He did not blame specific individuals for the format."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:16:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' suggestion that he could have scored 250 points in a 1970s-era game, stating that comparing different basketball eras is not feasible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo disagreed with LeBron James' claim that he could have scored 250 points in a 1970s basketball game, stating that comparing players across different eras is not practical."
  },
  {
    "title": "Vols stifle UK, one step from first Final Four trip",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:17:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tennessee defeated Kentucky 78-65, advancing to the Elite Eight in the NCAA tournament for the second year in a row. The Volunteers excelled in both offense and defense during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tennessee beat Kentucky 78-65, advancing to the NCAA tournament's Elite Eight for the second consecutive year. The Volunteers demonstrated strong performance in both offense and defense."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:16:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu won the women’s figure skating world championship, becoming the first American to claim the title since 2006, by defeating three-time defending champion Kaori Sakamoto."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu became the first American to win the women’s figure skating world championship since 2006, defeating three-time defending champion Kaori Sakamoto."
  },
  {
    "title": "UCLA lands MWC player of year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:17:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season for New Mexico, has committed to UCLA following his entry into the transfer portal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season for New Mexico, has transferred to UCLA after entering the transfer portal."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:15:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have been played. This marks a significant phase in the tournament, highlighting the top teams competing for the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has reached the Sweet 16 stage, with the first four games completed. This crucial phase showcases the top teams vying for the championship."
  },
  {
    "title": "Men's Sweet 16 tracker: Highlights, updates, more from Friday's games",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:29:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The news is following the progress of basketball teams competing to advance into the Elite Eight. The coverage tracks which teams will successfully move forward in the tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The news is covering the progress of basketball teams aiming to advance into the Elite Eight stage of the tournament. It focuses on analyzing the performance and potential of the teams competing to secure their spots in the next round."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, leading to a shift in focus towards the future. The team is now concentrating on portal priorities and welcoming new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded, prompting the team to shift their focus to the future. They are now prioritizing transfers and welcoming new recruits to strengthen their roster for the upcoming season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' Opening Day ballpark in only four days. This rapid conversion involved significant logistical and operational efforts to accommodate a major league game, showcasing the flexibility and capability of the facility to host such an event on short notice."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Rays' Opening Day ballpark in just four days, demonstrating the facility's ability to adapt and host a major league game with significant logistical and operational planning on short notice."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In discussions about whether there has been a change in the conduct of players or the refereeing approach in sports, players, executives, and analysts have provided various perspectives. They are debating if players are engaging in cleaner play or if referees are becoming more lenient in enforcing rules."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Debate arises on whether sports have seen a shift in player behavior or referee leniency. Players, executives, and analysts offer differing views on whether there's been an improvement in the cleanliness of play or a relaxation in rule enforcement by referees."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on the team standings, with the results and team schedules updated through April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff lineup is becoming more defined after a panel voted on team standings. The results and updated team schedules are available through April 17."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance in a game against Travis Hunter, who is considered a future NFL player."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, a prospect for the NFL."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The snowboarder, having faced challenges with depression, has regained her enthusiasm and is aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, previously struggling with depression, is now focused on qualifying for the 2026 Olympics. Her next opportunity to advance her goal is at the World Championships this Saturday."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had an exceptional season, establishing himself as one of the top left backs globally. He is also setting high aspirations for his future with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has been recognized as one of the leading left backs in the world after an outstanding season. He is also aiming for significant achievements with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 20:37:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Every team in the UFL is striving to outperform Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A year ago, Helen Hu, a retired gymnast, was working at a hostel in Ecuador. Recently, she made a remarkable comeback by winning the SEC beam title this past weekend."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, a retired gymnast who was working at a hostel in Ecuador a year ago, achieved a significant milestone by winning the SEC beam title this past weekend."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:24:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves, as announced on Friday."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has expressed that the speculation about his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States and Real Betis midfielder Johnny Cardoso stated that rumors of a possible transfer to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain with Atlético Madrid for the next season, according to sources cited by ESPN, despite his expressed desire to play in Major League Soccer (MLS) in the future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS) in the future, as reported by ESPN."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 00:24:33 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian soccer federation due to a severe knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation following a significant knee injury Alphonso Davies suffered."
  },
  {
    "title": "Chelsea captain Bright warns Barça: 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:41:12 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm about competing against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and showed excitement for facing Barcelona in the UEFA Women's Champions League semifinals."
  }
]