[
  {
    "title": "YouTube tests turning off notifications for channels you don&#8217;t watch",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T14:47:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "YouTube is conducting a test where it will disable push notifications for channels that upload frequently and for which users have set notifications to \"all\" but often ignore these alerts. This change aims to reduce notification clutter but may result in users missing updates from these channels."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9874874573958333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4568718643489583,
    "summary": "YouTube is testing a new feature that turns off push notifications for channels that post often and are frequently ignored by users who have opted for \"all\" notifications. This is intended to decrease the amount of unnecessary alerts, though it could lead to users missing updates from these channels."
  },
  {
    "title": "Google to pay $100 million to settle 14-year-old advertising lawsuit",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T14:18:49-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google agreed to pay $100 million to settle a lawsuit alleging it charged advertisers for clicks on ads outside their selected geographic areas. The settlement, awaiting judicial approval, was filed in a California court."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9678417665740741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45196044164351856,
    "summary": "Google has agreed to a $100 million settlement in a lawsuit claiming it billed advertisers for clicks on ads that appeared outside their chosen geographic areas. This agreement is pending approval from a California court."
  },
  {
    "title": "Helldivers 2 is locking out players who use older CPUs",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:55:50-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Some players of Helldivers 2 are unable to play the game on older computers due to a requirement for AVX2 support, a CPU feature common since 2013. This issue is linked to specifications set by developer Arrowhead Game Studios and publisher Sony."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9518518703125,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44796296757812504,
    "summary": "Helldivers 2 players with older computers are facing issues running the game because it requires AVX2 support, a CPU feature standard since 2013. This requirement comes from the game's developer, Arrowhead Game Studios, and its publisher, Sony."
  },
  {
    "title": "Musk threatens to sic the government on people ‘pushing’ Tesla ‘propaganda’",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:52:36-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk, in a 38-minute interview on Fox News, threatened to \"go after\" individuals spreading negative information about Tesla, labeling it as \"propaganda.\" This statement comes amid growing protests against the company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9495923707060185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44739809267650466,
    "summary": "Elon Musk, during a 38-minute interview on Fox News, warned he would \"go after\" people disseminating what he considers negative \"propaganda\" about Tesla. His comments arise amidst increasing protests against the company."
  },
  {
    "title": "First Alert’s new smart smoke alarm is meant to be a Google Nest Protect replacement",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:34:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "First Alert introduced a new series of smart smoke and carbon monoxide alarms compatible with Google Home, following Google's discontinuation of the Nest Protect smart smoke alarm. Google has partnered with First Alert for the Smart Smoke & Carbon Monoxide (CO) Alarm launch."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9367875227314815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44419688068287033,
    "summary": "First Alert has launched a new line of smart smoke and carbon monoxide alarms that work with Google Home. This comes after Google stopped making its Nest Protect smart smoke alarm and partnered with First Alert for this new product release."
  },
  {
    "title": "Here are the best streaming service deals available right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:32:40-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In 2025, there has been a notable increase in new TV shows and movies on subscription services, highlighting an issue for many viewers: the high cost of maintaining multiple concurrent subscriptions to keep up with the latest releases."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9357175931828704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44392939829571765,
    "summary": "In 2025, there's a surge in new TV shows and movies on subscription platforms, leading to concerns over the rising costs of holding multiple subscriptions to access new content."
  },
  {
    "title": "Madison Square Garden&#8217;s surveillance system banned this fan over his T-shirt design",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:10:41-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Frank Miller was banned for life from New York's Radio City Music Hall and was unable to attend a concert there on Monday night, which he planned to see in celebration of his parents' wedding anniversary. The ban was enforced before he could pass through security."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9204335969444445,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4401083992361111,
    "summary": "Frank Miller was permanently banned from New York's Radio City Music Hall, preventing him from attending a concert there on Monday night. The concert was meant to celebrate his parents' wedding anniversary. The ban was applied before he could go through security."
  },
  {
    "title": "A beginner’s guide to using Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Signal, a messaging app, gained significant attention after The Atlantic's editor-in-chief, Jeffrey Goldberg, was accidentally added to a group chat with top military officials discussing an airstrike. This incident, occurring on Monday, brought the app into the spotlight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.913002776886574,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43825069422164353,
    "summary": "Signal, a messaging app, became notably prominent when The Atlantic's editor-in-chief, Jeffrey Goldberg, was mistakenly added to a group chat involving top military officials who were discussing an airstrike. This event took place on Monday, highlighting the app's use among high-level officials."
  },
  {
    "title": "Here’s what military planning usually looks like — and why it doesn’t include Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T12:53:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Senior officials from the Trump administration, including Secretary of Defense Pete Hegseth and Vice President JD Vance, used a Signal group chat to plan a military strike on Houthi targets in Yemen, as reported by The Atlantic."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9083345634837963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4370836408709491,
    "summary": "Senior Trump administration officials, such as Secretary of Defense Pete Hegseth and Vice President JD Vance, utilized a Signal group chat to coordinate a military strike against Houthi targets in Yemen, according to The Atlantic."
  },
  {
    "title": "King Arthur wants to automate your sourdough starter",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:51:06-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Sourdough Sidekick is a new countertop appliance designed to automatically feed sourdough starters, ensuring they are ready for baking whenever needed. This device is a creation of FirstBuild, aiming to modernize the traditional process of baking sourdough bread by incorporating a novelty gadget."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8651234083449074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4262808520862269,
    "summary": "The Sourdough Sidekick, developed by FirstBuild, is a novel countertop appliance designed to automate the feeding of sourdough starters. This gadget aims to simplify the traditional sourdough bread baking process, ensuring starters are always ready for use."
  },
  {
    "title": "Trump and Carney hold first call amid ongoing trade war",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:28:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting with the Canadian leader after Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and revealed intentions to meet with the Canadian leader following Canada's forthcoming elections."
  },
  {
    "title": "Over 140 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:00:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake struck central Myanmar, causing tremors that were felt in neighboring south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, with its tremors also felt in south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building has collapsed in Thailand's capital, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building has collapsed in Bangkok, Thailand, raising fears of trapped workers."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. This military action took place hours after the rocket attack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah site in response to two rockets fired from southern Lebanon towards northern Israel. The military action occurred hours after the initial rocket attack."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests happening in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco track \"Wiggle and Giggle All Night\" in their music."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco song \"Wiggle and Giggle All Night\" in their own music."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The action is interpreted as an effort to dispute the legitimacy of the existing government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The action is seen as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "War veterans in Zimbabwe are planning protests demanding the resignation of President Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "War veterans in Zimbabwe are organizing protests to call for the resignation of President Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has signed an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order instructing his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children have died in a recent incident. Additional details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son since he was moved from the US to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The perpetrator's initial request for parole was denied in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club, who has had her first request for parole denied in Texas."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in connection with the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter for causing the death of Clare Nowland."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect has been arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was arrested with help from a local resident, as reported by police."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's President commented on Donald Trump's plans, describing them as \"serious\" but clarified that they have no connection to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's President described Donald Trump's Arctic plans as \"serious\" and clarified they are not linked to Moscow."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A quake struck a region already facing challenges including a civil war, food shortages, and a weakening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A region already dealing with a civil war, food shortages, and a weakening economy was hit by an earthquake."
  },
  {
    "title": "'Like a ruined city': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:47:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake hit Mandalay, with a local describing the situation to the BBC as a \"scene of a tragedy.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake struck Mandalay, causing significant distress. A local described the aftermath to the BBC as a \"scene of a tragedy,\" indicating widespread damage and impact."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer expressed her admiration for Charli XCX and Sabrina Carpenter, citing them as inspirations for her fearlessness in her music career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The singer from The Giver praised Charli XCX and Sabrina Carpenter, highlighting them as major influences for her own courage in pursuing a music career."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and national issues has made it challenging for the government to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government is facing difficulties in securing a second term due to a combination of international and domestic challenges."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is expanding due to affluent, urban Indians increasingly investing in the care of their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is experiencing growth as more affluent, urban residents are spending on their pets' care, particularly for dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of the best photos from Africa and beyond showcases a diverse range of subjects, capturing moments of beauty, daily life, and significant events across the continent."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's top photos from Africa and global regions highlight a variety of subjects, including stunning scenes, everyday life, and notable events, showcasing the continent's diversity."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the entire day playing golf with the US president if it would serve his country's interests."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister stated he is open to spending a whole day playing golf with the US president if it benefits his nation, highlighting his commitment to fostering stronger ties with the United States."
  },
  {
    "title": "Prime Deal: Sanders lands $54M ext. at Colorado",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deion Sanders and Colorado have finalized a five-year contract extension worth $54 million, as confirmed by a contract copy ESPN obtained on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Deion Sanders and Colorado have agreed on a five-year contract extension, valued at $54 million, according to a contract copy obtained by ESPN."
  },
  {
    "title": "Bueckers confirms to Lobo she'll enter WNBA draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, a standout basketball player from the University of Connecticut (UConn), has announced her decision to enter the WNBA draft."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, a prominent basketball player from the University of Connecticut (UConn), has declared her intention to join the WNBA draft."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his position as coach of the Memphis Grizzlies, who are presently ranked fifth in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies. The team is currently fifth in the Western Conference standings."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the NCAA's two-host regional system for the women's NCAA tournament, stating on Friday that the creators of the \"super regional\" format have \"ruined the game.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma criticized the NCAA's decision to use a two-host regional system for the women's NCAA tournament, calling the \"super regional\" format detrimental to the game."
  },
  {
    "title": "Source: Patriots planning to release LB Bentley",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The New England Patriots intend to release Ja'Whaun Bentley, a veteran linebacker and three-time team captain, on Friday, according to a report from ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The New England Patriots are planning to release Ja'Whaun Bentley, a veteran linebacker who has served as a team captain three times, this Friday, as reported by ESPN."
  },
  {
    "title": "PSU's Carter: 'Overall impact' makes me No. 1",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "At Penn State's pro day, outside linebacker Abdul Carter made a case for being the top pick in the NFL draft, emphasizing his ability to significantly enhance his team's performance through his \"overall impact.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "At Penn State's pro day, outside linebacker Abdul Carter showcased his skills, arguing he could be the top NFL draft pick due to his potential to greatly improve a team's performance with his \"overall impact.\""
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:47:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves. This decision was made on Friday."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:43:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million. He alleges the NCAA and the university conspired to blame him unfairly, labeling him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims that the NCAA and the university unfairly made him a scapegoat in their issues."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:27:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record number of 3-point shot attempts in the league. There is a discussion about whether measures should be taken to limit the frequency of 3-pointers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, sparking discussions on potentially implementing measures to reduce the frequency of 3-pointers."
  },
  {
    "title": "Picks, predictions, key players for every women's Sweet 16 game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:55:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Predictions have been made for the winners of the Sweet 16 regional semifinal matchups in Birmingham and Spokane, analyzing reasons why each team might emerge victorious."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Analysts have made predictions for the Sweet 16 regional semifinal basketball games in Birmingham and Spokane, detailing reasons for potential victories of the competing teams."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:55:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings, with discussions on who occupies the top spot among them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the latest Sweet 16 player rankings. The rankings have sparked discussions about who deserves the top spot among these athletes."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unusual series of events. Since his arrival, he has fully embraced his experience at the university, without any regrets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue University involved a unique sequence of events. Since joining, he has fully embraced his time at the university and has no regrets about his decision."
  },
  {
    "title": "Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup in the basketball tournament was determined following Thursday's four games. These matches finalized the first half of the teams advancing to the next round."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight in the basketball tournament was set after Thursday's games, determining the first half of teams moving to the next round."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark within a span of four days. This rapid conversion highlights the flexibility and adaptability of the facility to accommodate major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' Opening Day ballpark in just four days, showcasing the venue's ability to host major league games efficiently."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts suggest a trend in cleaner gameplay or a change in referees' officiating styles. The debate centers on whether athletes are adhering more closely to rules or if referees are becoming less inclined to call fouls."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "There is a growing debate in the sports community about whether the observed trend towards cleaner gameplay is due to players following rules more closely or referees being less likely to call fouls. This discussion involves players, executives, and analysts."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, and the schedules for each team have been outlined through April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's details are now clearer after a panel's voting, with team schedules set until April 17."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a game against Travis Hunter, showcasing his potential for an NFL career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, highlighting his NFL prospects."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, who previously faced challenges with depression, has regained her enthusiasm for the sport. She is now aiming to secure a spot in the 2026 Olympics, with her next opportunity for qualification being at the World Championships this Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, previously struggling with depression, has renewed her passion for snowboarding and is now targeting a spot in the 2026 Olympics. Her next chance to qualify is at the World Championships this Saturday."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had an exceptional season, establishing himself as one of the top left backs globally. His performance has sparked aspirations for significant achievements with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has had an outstanding season, earning recognition as one of the world's leading left backs. His performance has raised hopes for notable successes with the U.S. national team."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears, a team once known for their consistent success, have overcome significant challenges, including tragedy, to become contenders for a title once again."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears, historically a successful team, faced and overcame major obstacles, including a tragic event, positioning themselves as contenders for a championship title again."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Real Betis midfielder and United States international, Johnny Cardoso, has expressed confidence boosted by speculation linking him with a move to the Premier League."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Real Betis midfielder and United States international, Johnny Cardoso, has reported a boost in confidence amid rumors of a potential transfer to the Premier League."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:52:38 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources cited by ESPN. This decision comes despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay with Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:52:38 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian Soccer Federation after Alphonso Davies sustained a significant knee injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation due to a serious knee injury suffered by Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça: 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:41:12 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm about competing against Barcelona in the upcoming UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright lauded her team's strong mentality and is eager to face Barcelona in the UEFA Women's Champions League semifinals."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms the visualization of family trees into dynamic movies, illustrating the global movements of ancestors over time. This innovative approach is not limited to genealogy; it also has applications in tracking disease spread and analyzing animal migration patterns across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns family tree visualizations into dynamic movies, showing how ancestors moved globally over time. This method is not just for genealogy but can also be used to track the spread of diseases and study animal migration patterns across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between predicted and observed ocean temperatures around Antarctica over recent decades is due to increased meltwater and rain."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that increased meltwater and rain account for 60% of the gap between predicted and observed ocean temperatures near Antarctica in recent decades."
  }
]