[
  {
    "title": "UN Passes Resolution for Palestinian State, Gaza Division Amid Objections",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 22:42:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Reuters",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com",
      "bbc.com"
    ],
    "snippets": [
      "The measure mandates transitional administration for Gaza and floats 'credible pathway' for Palestinian statehood.",
      "UN Security Council approves Trump plan for Gaza security force Axios",
      "UN Security Council adopts US resolution on Trump's Gaza plan Reuters",
      "UN body quickly passes resolution that also includes reference to a future Palestinian state The US is planning for the long-term division of Gaza into a “green zone” under Israeli and international military control, where reconstruction would start, and a “red zone” to be left in ruins. Foreign for",
      "The U.S. is pushing the U.N. Security Council to support and enshrine Trump’s 20-point Gaza peace plan. But Israel, Hamas, Russia and others have objections.",
      "Russia and China abstained. The vote provides a legal mandate for the Trump administration’s vision of how to move past the cease-fire to rebuild the war-ravaged enclave after two years of war.",
      "UN body quickly passes resolution that also includes reference to a future Palestinian state; Hamas says the plan favours Israeli occupation The US is planning for the long-term division of Gaza into a “green zone” under Israeli and international military control, where reconstruction would start, a",
      "Included in the 20-point plan is the establishment of an International Stabilisation Force (ISF), which would work to demilitarise the territory."
    ],
    "image_url": "",
    "titles": [
      "UN Security Council passes US resolution backing Gaza international force",
      "UN Security Council approves Trump plan for Gaza security force - Axios",
      "UN Security Council adopts US resolution on Trump's Gaza plan - Reuters",
      "Trump Gaza plan: UN security council approves US-drafted resolution for international stabilisation force – live",
      "U.N. Security Council to vote on Trump’s 20-point Gaza peace plan",
      "U.N. Security Council Adopts Trump’s Peace Plan for Gaza",
      "Trump Gaza plan: Hamas rejects resolution for international stabilisation force approved by UN security council",
      "Trump's plan for Gaza backed by UN Security Council"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/unsc-approves-us-resolution-mandating-intl-stabilisation-force-in-gaza?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifkFVX3lxTE9jbUxTTTNQU3Z1MElqLXVtQ3VZbTZpZXNRdEhad05XQ3BSb3N2VXB1QTRaRHVnc0UzZmtzQU4xaUNxNl9IVmFjU0VpT1ROWFRNVE8weGVoVTVPZk9fR3lwbWpabk04ZzhZQkhmVmRGbTlKS3p3azY5aUJJWlJ5Zw?oc=5",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxNRGtHcThRbmlhNUlRaFZ5SDhoWUlUMDdoYXdQSEpBbEpZbUdYeW1RdmltbEI1ZXBaQ0FyQU5tRDl5Q1Y2ckNpNUdDUFYtWllqYXJSY2ZscDBTOGo0X1hUMmhCTGJhNi1iUGo1YlJ3V3VfaEdtT09PZnY5anl1Q2FzUU94NUc4cTBBNTV5VS02MGY0SHlEdzJwbXIzb2p2Z0NXSC1qVDJLQUxGdXREX3c?oc=5",
      "https://www.theguardian.com/world/live/2025/nov/17/un-security-council-donald-trump-gaza-israel-palestine-middle-east-latest-news-updates",
      "https://www.washingtonpost.com/national-security/2025/11/17/un-vote-gaza-trump-plan/",
      "https://www.nytimes.com/2025/11/17/world/middleeast/un-security-council-gaza-peace-plan.html",
      "https://www.bbc.com/news/articles/c0rpkgq4wllo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/unsc-approves-us-resolution-mandating-intl-stabilisation-force-in-gaza?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.988,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.928,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UN Security Council passed a resolution, including plans for a future Palestinian state and the division of Gaza into a \"green zone\" for reconstruction and a \"red zone\" in ruins. The U.S. supports this resolution as part of Trump's Gaza peace plan, despite objections from Israel, Hamas, and others. Russia and China abstained from the vote, which aims to rebuild Gaza after two years of conflict.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights into the ongoing issues surrounding the Israeli-Palestinian conflict. It reports on a potential solution proposed by the UN and gives readers a deeper understanding of the geopolitical dynamics involved. However, it doesn't provide enough context or details about the impacts and potential consequences of the resolution.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Explosion Damages Key Poland-Ukraine Aid Railway; PM Vows Action",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 17:42:39 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "The Guardian",
      "New York Times",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "theguardian.com",
      "nytimes.com",
      "dw.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Authorities say the blast happened on a line leading to the border with Ukraine.",
      "Polish railway track blast an 'unprecedented act of sabotage', PM says Reuters",
      "Polish PM vows to ‘catch the perpetrators, regardless of who their backers are’ after blast on track used for deliveries to Ukraine Poland’s prime minister, Donald Tusk, has described an explosion along a section of railway line used for deliveries to Ukraine as an “unprecedented act of sabotage” th",
      "Donald Tusk said unidentified saboteurs had tried to “blow up a train” on a route crucial for getting aid into Ukraine.",
      "The weekend blast caused considerable damage to the Warsaw-Lublin railway line in eastern Poland, which borders both Ukraine and Russia and serves as a major logistics hub for aid.",
      "The line links Warsaw to Lublin and continues onward to Ukraine. It has been used to deliver aid to that country."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9bdf/live/8c8e3e90-c3d8-11f0-ae46-bd64331f0fd4.jpg",
    "titles": [
      "Poland says blast on rail line to Ukraine 'unprecedented act of sabotage'",
      "Polish railway track blast an 'unprecedented act of sabotage', PM says - Reuters",
      "Poland railway blast was unprecedented act of sabotage, says Donald Tusk",
      "Polish Railway Explosion Was Sabotage, Prime Minister Says",
      "Polish railway explosion 'act of sabotage,' says PM Tusk",
      "Rail explosion in Poland was ‘sabotage,’ prime minister says"
    ],
    "url": "https://www.bbc.com/news/articles/cp85g86x0zgo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxQVkdXTDlkX1NhcmlTSWQyQ3VkaFN6VTdFdFB3MmhVMlR4TzhPMkRPZ0t3T2xRZFNjY1FQWGZCUWRBbDRaVlllaV85TVJNMlhsTGE5emtZWXpOTGwwV0c1RjlPSnB5Y3M2clFCMERFbmpRc1JRTmxsQ3E0X09Lckl6MzBDSjJBU3lxbXNfMV9UbmFHUTV4c1JuRk5lYlphemtISDZtbnhR?oc=5",
      "https://www.theguardian.com/world/2025/nov/17/poland-railway-blast-was-unprecedented-act-of-sabotage-says-donald-tusk",
      "https://www.nytimes.com/2025/11/17/world/europe/poland-railway-explosion-sabotage-ukraine.html",
      "https://www.dw.com/en/polish-railway-explosion-act-of-sabotage-says-pm-tusk/a-74781288?maca=en-rss-en-top-1022-rdf",
      "https://www.washingtonpost.com/world/2025/11/17/rail-explosion-poland-was-sabotage-prime-minister-says/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cp85g86x0zgo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.89,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.888,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "An explosion damaged the Warsaw-Lublin railway line in eastern Poland, a key route for aid deliveries to Ukraine, over the weekend. Polish Prime Minister Donald Tusk labeled the incident an \"unprecedented act of sabotage\" and vowed to find those responsible. The blast, which occurred near the Ukraine border, did not result in any reported injuries but caused significant damage to the railway infrastructure.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful update on a significant event that has implications for aid deliveries to Ukraine. However, it doesn't offer any solutions or deeper insights into the causes or potential impacts of the incident.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Trump Supports Releasing Unclassified Epstein Files, Reversing Stance",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 15:34:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "ABC News",
      "CBC News",
      "Bloomberg",
      "Associated Press",
      "NPR",
      "Reuters",
      "CNBC"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "abcnews.go.com",
      "cbc.ca",
      "npr.org",
      "cnbc.com"
    ],
    "snippets": [
      "\"We have nothing to hide,\" the US president writes - a reversal after previously resisting publishing the documents.",
      "In a shift, Trump says House GOP should vote for Epstein files' release Axios",
      "Trump said he would sign the bill to compel the Justice Department to release all files relating sex offender Jeffrey Epstein if it comes to his desk.",
      "U.S. President Donald Trump on Sunday urged his fellow Republicans in the House of Representatives to vote for the release of files related to the late convicted sex offender Jeffrey Epstein, after weeks of railing against the Democrats' desire to pass the Epstein Transparency Act.",
      "Trump Urges House to Vote for Epstein Files Release in Reversal Bloomberg.com",
      "In reversal, Trump says House Republicans should vote to release Epstein files AP News",
      "President Trump changes stance on the Epstein files, urging Republicans to support a House vote tomorrow. And, the U.S. military buildup in the Caribbean adds pressure on Venezuela.",
      "Trump reverses stance on Epstein files, urges Republicans to vote for releasing them Reuters",
      "U.S. President Donald Trump has called on Congressional Republicans to vote to release files related to deceased convicted sex offender Jeffrey Epstein.",
      "Trump for months has called the controversy over the DOJ's refusal to release the Jeffrey Epstein files a Democratic \"hoax.\" But some Republicans want them."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c05a/live/46ff00a0-c3d6-11f0-8669-5560f5c90fbe.jpg",
    "titles": [
      "Trump calls on House Republicans to vote to release Epstein files",
      "In a shift, Trump says House GOP should vote for Epstein files' release - Axios",
      "Trump says he would sign bill to release Epstein files if it reaches his desk",
      "In reversal, Trump urges Republicans to vote to release Epstein files",
      "Trump Urges House to Vote for Epstein Files Release in Reversal - Bloomberg.com",
      "In reversal, Trump says House Republicans should vote to release Epstein files - AP News",
      "Trump changes stance on Epstein files. And, the U.S. increases pressure on Venezuela",
      "Trump reverses stance on Epstein files, urges Republicans to vote for releasing them - Reuters",
      "Trump reverses stance on Epstein records, presses Republicans to support release",
      "Jeffrey Epstein victims' ad calls for files to be released, Trump urges GOP to vote for House measure"
    ],
    "url": "https://www.bbc.com/news/articles/cvgv653v1vjo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdk96T3JqLVByaUxYYXdId29sR2JCSFR1Wlp5b3VrVUhmRkl5U01oc3BkSUdJRWxCbmJBa2Yxekdab2JhRTBBb3BKbkNOckpXVXFINjQtWWRDOVVPMlFmdkxTTmRjc2lXaVhzV3RCWDc0Z25DTjlaaXA3b1YyMHpGVnRlR0NZbWRzQXZ2aWhKc0c?oc=5",
      "https://abcnews.go.com/Politics/trump-sign-bill-release-epstein-files-reaches-desk/story?id=127593346",
      "https://www.cbc.ca/news/world/epstein-trump-files-release-sunday-9.6981122?cmp=rss",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNRnE1dXRVLXd4V2tFTVdOa19icXh3N2YzYmttd0M5UFBvVW5lVmRCVlF6ZHI2a211OFVYNWlQOWxsNjhEU3cwUDdXZzAzX3JwSjZLcXc2ODhicWhOcnlQaTd3bUdvM0draGQ0UmQxZzl6UGdFMTFaeXYzVTNKb2FndjZLcllqUlRRQzJVN08zaVN5QXdHNXpDSjRGdVp4dXcxX3RZQmRkU05oOGxHY0xRSTZSQQ?oc=5",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxONTN4ZVpKb2tVNDBmTnNMY21rZjAyVHNDSkl0ZmJta3lSUklGVzZyNkFLU3dHeDFpNDg5eU9XMlVsd2dKSTI1d2l5MTh0SGZkaThibjNJbFFWdFJiYUR0dTMtNzlNS1YtVzljYVhtZUdzSnJWOXczdmt1bGxnbVVWSmk2Zjh2dTZMQzRNLW4tYkFGT2c1di1ITVBsOFRYdEJTQk9IT1ZSNXRuNmd3dEE?oc=5",
      "https://www.npr.org/2025/11/17/g-s1-98106/up-first-newsletter-trump-epstein-files-venezuela-charlotte-border-patrol",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxNZkl4eHpRNm03TVc1N2NSUmdCVmRXS0VHUnh6NzBsQXZIUno3c0FNQ25BQjAxV21MRk5OWm9kWjdfaU5Lc0F5NzluME0tS2N4ZzRxRkU5Q0tqVXRKUy1UdXJSeldtZzN4SFY5ZjFob2VHM20yREVtd3FsVk02ZzdoWktHZ0FCX1VraXFBWFBHX2VGOW5DWlM4RkNuYTlmUEwyLVhwNk5UTQ?oc=5",
      "https://www.cnbc.com/2025/11/17/trump-reverses-stance-on-epstein-records-presses-republicans-to-support-release.html",
      "https://www.cnbc.com/2025/11/17/trump-jeffrey-epstein-files-republicans.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvgv653v1vjo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.851,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.88,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump has reversed his previous stance and now supports the release of unclassified files related to Jeffrey Epstein. He stated on Truth Social that \"we have nothing to hide,\" aligning with House Republicans, some of whom had already pushed for a vote to release these files. This marks a notable shift as Trump had previously opposed making more of the Epstein files public. A vote in the House is expected to take place as early as Tuesday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a change in stance by a prominent political figure, which could influence public understanding and discourse on the Epstein case. However, it does not offer insights into solutions or improvements, nor does it significantly increase clarity around systems, causes, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "France, Ukraine Sign Deal for Up to 100 Rafale Jets Amid Defense Boost",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 18:49:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "France and Ukraine have signed a declaration of intent for Kyiv to acquire up to 100 Rafale fighter jets.",
      "President Volodymyr Zelensky hails a \"historic\" deal aimed at boosting Ukraine's defences against deadly Russian air attacks.",
      "Some in Ukraine criticized the 10-year timeline for the warplanes and other defense equipment, but France called it a long-term commitment to the country.",
      "Ukraine plans to buy up to 100 Rafale warplanes and air defense systems from France AP News"
    ],
    "image_url": "",
    "titles": [
      "‘Historic agreement’: Ukraine to receive fleet of French fighter jets",
      "Ukraine to get up to 100 French-made Rafale fighter jets",
      "France Agrees to Sell Up to 100 Rafale Fighter Jets to Ukraine",
      "Ukraine plans to buy up to 100 Rafale warplanes and air defense systems from France - AP News"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/17/historic-agreement-ukraine-to-receive-fleet-of-french-fighter-jets?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cwy170jkekdo?at_medium=RSS&at_campaign=rss",
      "https://www.nytimes.com/2025/11/17/world/europe/ukraine-france-rafale-fighter-jets.html",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZnM4cFEyU0wxMXRqRFZwQUdBVTJVSE5tNGh0WkpYUVNsNXh0aEpFQWNXZFpWbFBvNWxTcUFIdFVSZDlteTMwUU9tR0cybXVtM1NTTWlwZEFSWnYyQUJIWWdWWU1ZVnJxN3F2OFFjTmVYV1VzdWtCdFZiNU44WkZrRl92VTdkdTFIWlEyNWhoazlGVVNqcEE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/17/historic-agreement-ukraine-to-receive-fleet-of-french-fighter-jets?traffic_source=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.911,
      "consensus": 0.908,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "France and Ukraine have agreed on a declaration for Ukraine to purchase up to 100 Rafale fighter jets, a move President Zelensky describes as \"historic\" to strengthen defenses against Russian attacks. Despite some criticism in Ukraine over the 10-year timeline for delivery, France views it as a long-term commitment. This deal includes air defense systems alongside the warplanes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the defense deal between France and Ukraine. It gives readers a deeper understanding of the geopolitical implications of the deal and the strategic move by Ukraine to strengthen its defenses. However, it does not provide any solutions or improvements to the ongoing conflict with Russia.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "U.S. Announces Major F-35 Jet Sale to Saudi Arabia Ahead of Prince's Visit",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 20:59:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Reuters",
      "Bloomberg",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "US president signals major arms deal before Saudi Crown Prince Mohammed bin Salman's visit to the White House.",
      "U.S. will sell Saudi Arabia advanced F-35 fighter jets, Trump says Axios",
      "Trump says 'we'll be selling' F-35s to Saudi Arabia Reuters",
      "Trump Says US Plans to Sell F-35 Jets to Saudi Arabia Bloomberg.com",
      "Trump says he will sell F-35s to Saudi Arabia on eve of crown prince’s Washington visit AP News"
    ],
    "image_url": "",
    "titles": [
      "Trump says he will approve sale of F-35 fighter jet to Saudi Arabia",
      "U.S. will sell Saudi Arabia advanced F-35 fighter jets, Trump says - Axios",
      "Trump says 'we'll be selling' F-35s to Saudi Arabia - Reuters",
      "Trump Says US Plans to Sell F-35 Jets to Saudi Arabia - Bloomberg.com",
      "Trump says he will sell F-35s to Saudi Arabia on eve of crown prince’s Washington visit - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/trump-says-he-will-approve-sale-of-f-35-fighter-jet-to-saudi-arabia?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMibEFVX3lxTE5iX1NpckktdWpvcjRidjlfdFZwUVNaZ1V5aGdMUnlobzFUeGwyTWVmQWJNckppbWZhS1VjRkxqdEVmY01KQnk1d04zMUY2Z1ZXSnBMV1pVZV8yNzJkZ3pLNUhYSGg2SGlpN2l2QQ?oc=5",
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxQYkVwRWRxSkpma01GdWQ2WmZKSi1QV1NIZk13OWJLZkVNT0ZRNGFfcGFfc3lDaVJnbDVrZ0RBRDF6eG9RWU1JWFFXOVZXcTlLS1YxelVabHdaSUFCbDU3dmRFLVdJTU1oajJFc2YwLW5ISDV4UTJWNkxDNnNpUDkxeGZNUS1Ea3BhWU1HZVdHSkhyaEtfY1oxS1NtU3ZZVDRLTW85V1JWaU50SkRkbmhZSEVyUHhMY2ZJSGwyOTUyMm1JdkJHMG16LUhYcGZJNHc?oc=5",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQVUZnX3paaW1YelZ5ZnpKMkpkeDNSY1ZkN2t5ZlBfU2pxT01YRTBidjRiaXpUbDMwQnNxZ0NvMFlLQzZFekZ1ekNXenpMb29JeXlVTTlyX3FLMEJWb0N4MU9aTW10ZWRyWjQ3b1VhVUZxc3FsdThIMzdMNElvd0xXeHZqeGloa3ZlUGVhT1Y2WkNMampTUDdSaG9SbU4xWE1NOHpHMGQycw?oc=5",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxPOW5lb3ZMZUxlakY5SmZxTDVxcU9pOEVoSmRwUGVWNFh6VG5jM2JMRC02ZzQ0b0hmZnNQRTMtUFBsMmFlQXRfaV9RRGpnYVROVXRybUFWR0xIcVRfSlNPbkRjVWJfeGpINzJQU3UxcUhlbVNzYUNFME1wR2U3Tk5QYVFqbktpTWppaHdzZGxBZUF1aUhDd2hJU0tZQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/trump-says-he-will-approve-sale-of-f-35-fighter-jet-to-saudi-arabia?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.953,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. President announced a significant arms deal with Saudi Arabia, confirming the sale of advanced F-35 fighter jets ahead of Saudi Crown Prince Mohammed bin Salman's visit to the White House. This development was reported by both Axios and Reuters.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the arms deal between the U.S. and Saudi Arabia, providing context about the geopolitical relationship between the two countries. However, it lacks depth in terms of the potential impacts or consequences of this deal, and does not provide any actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Bangladesh Ex-PM Sheikh Hasina Sentenced to Death for 2024 Protest Suppression",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 15:06:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters",
      "Al Arabiya",
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "A Bangladeshi tribunal has sentenced former Prime Minister Sheikh Hasina to death for crimes against humanity.",
      "Bangladeshi judges have found former Prime Minister Sheikh Hasina guilty of crimes against humanity for the violent repression of anti-government protests in 2024.",
      "Bangladesh's Sheikh Hasina: From political dominance to death sentence Reuters",
      "Key events in Bangladesh as Hasina sentenced to death Reuters",
      "Bangladesh's ousted PM Hasina sentenced to death for student crackdown Reuters",
      "Bangladesh’s ousted PM Hasina sentenced to death Al Arabiya English",
      "Hasina sentenced in absentia by court in Dhaka over deadly crackdown on student-led uprising last year Bangladesh’s deposed prime minister Sheikh Hasina has been sentenced to death in absentia by a court in Dhaka for crimes against humanity over a deadly crackdown on a student-led uprising last year",
      "A Bangladesh war crimes court sentenced ousted prime minister Sheikh Hasina to death on Monday, concluding a months-long trial that found her guilty of ordering a deadly crackdown on a student-led uprising last year."
    ],
    "image_url": "",
    "titles": [
      "Exiled Bangladesh PM Sheikh Hasina sentenced to death in absentia",
      "Bangladesh's ex-PM Sheikh Hasina sentenced to death",
      "Bangladesh's Sheikh Hasina: From political dominance to death sentence - Reuters",
      "Key events in Bangladesh as Hasina sentenced to death - Reuters",
      "Bangladesh's ousted PM Hasina sentenced to death for student crackdown - Reuters",
      "Bangladesh’s ousted PM Hasina sentenced to death - Al Arabiya English",
      "Ousted Bangladesh PM Sheikh Hasina sentenced to death for crimes against humanity",
      "Bangladesh's ousted PM Sheikh Hasina sentenced to death for student crackdown"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/17/exiled-bangladesh-pm-sheikh-hasina-sentenced-to-death-in-absentia?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/bangladesh-s-ex-pm-sheikh-hasina-sentenced-to-death/live-74771291?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPZ25kaExOMThPOHBxbXhFWE5Semp3Y2d3TjFxbnNKSDd2M2xNUllLWEVpVDg5XzU3OFhTMkw5cTRzblpZWTVYVVhtN2RfX1ZZTnBFRE5lcjl0OTJ3dDg4UEoxMjBPbWRFOGh6SVlJbHBWbUlHWHl0aXNnTWNVWHpLUHFQaU13dHprYlFJNzNZbkR0c1dud1llaHdjOU1iNWdUNGtTd2ZVUDluRlVvUjdHUFoxaFd3UQ?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxONzN6dUxCenNoTnFvRVc1VmJBbzA2TTlrRjVPUUVBZk0zdHpBa3FVbFlYWl9wUVBhakxEV1Y3dUZ5SFc2ZmZrVE81MHltMXN3S2RZakZHblhuUk85UlpOMi1ialN5R1pveGx3bS1WV093M0IxVk13RnNhYkdkd1V5N1hHTzBhUHdPdm12cjlLQmNkZ2VuOFRwbDRiOS1SOG1K?oc=5",
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPc0twWlNPZHRTemhBRUprWVNHWWt3RDhtRW5XWWZZbXpuc2o5UlVJNGZyOE1la0QtV1dVNjQ4elJHWDhha2E5OVFRY2RXZ1FYRmE1dXZlTzNYWVp0QkI0d2VHZExxQkJ6dXM3djA0Skx2RkRrLVd1NU5adTBob0dDTW9PSVNIbjV1bWVPZFVaYi16VnpUanNvNmxyWjRRbHNqYjVyZExuTW5UQ2hpMFMyd191aFZlTmFS?oc=5",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxNaDJzbGJZR2RKQ1RGdG1scFp6ZzBlTVZHR013cGp1Wkx3V0lycS1sVjQtc2Zid1kxd3RnNFR5b2xRRmhjOGFOd29WNFBwdjNvWWlXNXQ1WXdpWFVMNk1LZUltSXYxakR1c1R3dTE2eTYxSzM1OEF1WkJNSUZxNnZ2NDhwZXg0dGxoZmVZdFEzWThWamVQYjU4YjltTURYZ0Jtd0I2VGFIM2JXN3p3Y1lER1ZRTE1LUkZ1ZVNGaTJWREMzdHgxZXFj0gHMAUFVX3lxTE4takxYU3NiWjBGaC1Ta0xsNDQxaFRqdUFfbGw2RnU0MlVWVUtWdWhqRXhsUU9tQ3MtODFlWnd6RXRIRzE5NDhWR3U5ZWNFYTg4TFM4RmljallfN1pQaEh1YkpMU0w5STFFNEliZVI2UUdybXV4alpvNTNMLVFxa2lHQ0ZQTUlrVl9UeWczU2NDR3V3d0t6dUhJNE45Yi1oUzQ4WDdRODRLQ01lWDZrSlhmTFphZVBQaGpPcnlNd2k3SFZDNUFZUUR4bDJEMQ?oc=5",
      "https://www.theguardian.com/world/2025/nov/17/ousted-bangladesh-pm-sheikh-hasina-found-guilty-of-crimes-against-humanity",
      "https://www.cbc.ca/news/world/bangladesh-tribunal-sentence-exiled-hasina-9.6981196?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/17/exiled-bangladesh-pm-sheikh-hasina-sentenced-to-death-in-absentia?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.843,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.864,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Prime Minister Sheikh Hasina of Bangladesh has been found guilty of crimes against humanity related to the violent suppression of anti-government protests in 2024. She has been sentenced to death. The country is currently experiencing tension ahead of the verdict's formal announcement.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This news informs about a significant event in Bangladesh's political landscape, but it doesn't provide enough context or depth about the underlying issues that led to the protests or the implications of the verdict. It also doesn't report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Jake Paul to Fight Anthony Joshua in Miami on Dec 19, Streamed on Netflix",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 13:54:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Forbes",
      "Bleacher Report",
      "Sportsnet"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "forbes.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "BBC Sport assesses what fighting YouTuber Jake Paul will do for Anthony Joshua's career and legacy.",
      "YouTuber Jake Paul will fight ex-world heavyweight champion Anthony Joshua in a professional bout in December.",
      "The so-called Judgment Day will generate millions of dollars and attract huge ratings, but leave boxing a little more broken The unsurprising confirmation of “a colossal global showdown” between Jake Paul and Anthony Joshua arrived on Monday morning with a dull thud. That grand description of an eig",
      "The Paul-Joshua fight will stream live on Netflix. It’s scheduled for eight, 3-minute rounds.",
      "Jake Paul vs. Anthony Joshua Date and Time Revealed for Historic Netflix Boxing Fight Bleacher Report",
      "YouTuber-turned-boxer Jake Paul will fight recent world heavyweight champion Anthony Joshua in a professional bout on Dec. 19."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7a60/live/83bf80d0-c0b3-11f0-8a6c-bdcd4bb2f081.jpg",
    "titles": [
      "Is Anthony Joshua risking his legacy by fighting social media star Jake Paul?",
      "Anthony Joshua to fight YouTube star Jake Paul in December",
      "Money lured Anthony Joshua to circus fight but he could really hurt Jake Paul | Donald McRae",
      "Anthony Joshua Reveals Brutal Reason For Fighting Jake Paul In Netflix Bout",
      "Jake Paul vs. Anthony Joshua Date and Time Revealed for Historic Netflix Boxing Fight - Bleacher Report",
      "Jake Paul to fight two-time world champion Anthony Joshua"
    ],
    "url": "https://www.bbc.com/sport/boxing/articles/c620q0vwxydo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/boxing/articles/cwyprrlww9do?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/sport/2025/nov/17/anthony-joshua-circus-fight-jake-paul-boxing",
      "https://www.forbes.com/sites/anthonystitt/2025/11/17/anthony-joshua-reveals-brutal-reason-for-fighting-jake-paul-in-netflix-bout/",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOXzlLM1pGZWZkeFRmYnVmbnBVYTYwMkIySmdkODJBZDFwcUJ1WWpmNlJvdUt5NklVRUlxem82bWV1MG9ZX19nSDFzenZuV05YNFRwS01majh5UEJCUV85OURzdThHZWtJa0FZU3E1T0czMjVUT0E4VERlS3F6Sk5ncm15enpsd0JmU2l0OFJ4ZVVDM3NkeTFjMndRRkJMQ2FnX0VabXFsT1RBaWlXSDZka1k3SG9QakhSenZyOTNyamJ5Q0E?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/boxing/articles/c620q0vwxydo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.822,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.844,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jake Paul, a YouTuber-turned-boxer, is set to fight former world heavyweight champion Anthony Joshua in a professional bout on December 19. The match, which will take place in Miami, will be streamed live on Netflix. This event marks a significant moment for both fighters, with discussions around its impact on Joshua's career and legacy.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an upcoming boxing match between Jake Paul and Anthony Joshua. However, it lacks depth or insight into the significance of the event, the preparation of the fighters, or the potential impact on their careers.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Germany Qualifies for 2026 World Cup After Defeating Slovakia",
    "domain": "sports",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-17T21:37:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "dw.com",
      "sports.yahoo.com",
      "sportsnet.ca",
      "espn.com"
    ],
    "snippets": [
      "After a big win against Slovakia, Germany have secured their spot at the 2026 World Cup that will be hosted across the United States, Canada and Mexico.",
      "Germany captain Joshua Kimmich said his side \"wanted to send a message\" with Monday's 6-0 thumping of Slovakia in Leipzig which sealed their progress to the 2026 World Cup. \"Everyone wanted to send a message today.",
      "So much for Germany being at risk of missing the World Cup.",
      "The race to qualify for the 2026 FIFA World Cup is drawing to a close. Here's how it's looking around the globe."
    ],
    "image_url": "",
    "titles": [
      "Germany secure 2026 World Cup spot with win over Slovakia",
      "Germany 'send message' with Slovakia rout to reach 2026 World Cup",
      "Germany, Netherlands qualify for 2026 World Cup",
      "2026 World Cup: Germany, Netherlands book their places"
    ],
    "url": "https://www.dw.com/en/germany-secure-2026-world-cup-spot-with-win-over-slovakia/a-74782115?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://sports.yahoo.com/article/germany-crush-slovakia-qualify-2026-220157880.html",
      "https://www.espn.com/soccer/story/_/id/40297462/2026-world-cup-how-nations-world-qualify"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/germany-secure-2026-world-cup-spot-with-win-over-slovakia/a-74782115?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.965,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.832,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Germany has qualified for the 2026 World Cup in the USA, Canada, and Mexico after defeating Slovakia. This victory ensures their participation in the tournament, overcoming Slovakia's challenge in a crucial match.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Germany's qualification for the 2026 World Cup. However, it lacks depth and insight as it does not discuss the team's performance, the significance of this victory, or the team's prospects in the tournament.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "FEMA Acting Administrator Resigns Amid Criticism Over Texas Flood Response",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 21:01:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Reuters",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Richardson is the second official President Donald Trump has appointed to lead FEMA since the start of his second term.",
      "The acting chief of the Federal Emergency Management Agency has left his post, marking another disruption in a year of staff and policy changes. His leadership was questioned after he delayed responding to deadly floods in Texas.",
      "Acting head of FEMA leaves after short and troubled tenure Reuters",
      "Richardson spent “limited time in daily operations meetings and shrank away from his role,” according to The Washington Post."
    ],
    "image_url": "",
    "titles": [
      "Acting FEMA head David Richardson steps down after troubled tenure",
      "FEMA acting chief David Richardson departs after 6 months on the job",
      "Acting head of FEMA leaves after short and troubled tenure - Reuters",
      "FEMA Head David Richardson Steps Down From Role After Six Months, Criticism Over Texas Floods"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/acting-fema-head-david-richardson-steps-down-after-troubled-tenure?traffic_source=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/11/17/g-s1-98165/david-richardson-fema-acting-chief-quit",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNMGxNUnBLa05uUFNoRnlkeHNRaGtqUklWeFlLaXk5SUtnWGV1MFYyQXRaY2VPTDdTdHd3LUtENXZ5MzJQc2FNR0dVbEx4Y3pTTmJ0QjM1d2VLVWlfU05EajRYTm5VN0xfZXB5STdfNzJPS0FpYTBEbTBBcVNETmJuaHJrV1RFcWNiZkUxQnMxMEszaU1NZC1qM1Z2S2Iya3N4MzJ3WHJraEhkLUhKYmx5VXVn?oc=5",
      "https://www.forbes.com/sites/antoniopequenoiv/2025/11/17/fema-head-david-richardson-steps-down-from-role-after-six-months-criticism-over-texas-floods/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/acting-fema-head-david-richardson-steps-down-after-troubled-tenure?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.954,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "David Richardson, the acting administrator of FEMA, has resigned six months into his role, following criticism over his handling of deadly floods in Texas. A senior Trump administration official confirmed his departure, and reports suggest Richardson had minimal involvement in daily operations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about the resignation of the FEMA acting administrator and the criticism over his handling of the Texas floods. However, it lacks depth and insight into the implications of this resignation, the specific criticisms, and how FEMA plans to improve its response to future disasters.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Jets Bench Fields for Taylor as Quarterback Amid 2-8 Season",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 17:59:29 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "New York will turn to Tyrod Taylor this week, but what will it do at quarterback beyond this season?",
      "Identifying where Fields might be headed to next",
      "Aaron Glenn has seen enough of Justin Fields. The New York Jets (2-8) head coach is opting to start 36-year-old Tyrod Taylor going forward, moving Fields to the No. 2, according to The Athletic’s Dianna Russini on Monday."
    ],
    "image_url": "",
    "titles": [
      "What does Justin Fields' benching mean for the future of the Jets?",
      "What's next for Jets' Justin Fields? Possible landing spots for former first-round pick after benching",
      "Reports: Jets benching Justin Fields in favour of veteran Tyrod Taylor"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47001333/new-york-jets-bench-justin-fields-future-qb-tyrod-taylor",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/whats-next-for-jets-justin-fields-possible-landing-spots-for-former-first-round-pick-after-benching/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47001333/new-york-jets-bench-justin-fields-future-qb-tyrod-taylor",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.82,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Jets, with a 2-8 record, are benching Justin Fields in favor of starting 36-year-old Tyrod Taylor as quarterback, as announced by head coach Aaron Glenn. This decision, reported by The Athletic's Dianna Russini, raises questions about the team's quarterback strategy beyond this season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a strategic decision made by a sports team, which could influence the reader's understanding of the team's current situation and future plans. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the causes or impacts of the decision.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Gunmen Kill School VP, Abduct 25 Girls in Nigeria; Search Underway",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-17T18:08:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CBC News",
      "Associated Press",
      "New York Times"
    ],
    "domains": [
      "dw.com",
      "cbc.ca",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "The school's vice president was shot dead and a security guard was injured. Authorities were combing the surrounding forests and possible escape routes in Kebbi state for the \"bandits.\"",
      "Gunmen attacked a high school in northwestern Nigeria before dawn on Monday, taking 25 schoolgirls and killing at least one staffer, authorities said of the latest abduction of students in the region.",
      "Gunmen abduct 25 girls from a high school in northwestern Nigeria AP News",
      "The kidnapping echoed the abduction of the Chibok girls 11 years ago and came as U.S. officials pressed the country to address violence against Christians."
    ],
    "image_url": "",
    "titles": [
      "Nigeria: Gunmen kidnap 25 students from Kebbi high school",
      "25 girls abducted from high school in Nigeria",
      "Gunmen abduct 25 girls from a high school in northwestern Nigeria - AP News",
      "25 Girls Abducted From School in Nigeria"
    ],
    "url": "https://www.dw.com/en/nigeria-gunmen-kidnap-25-students-from-kebbi-high-school/a-74782165?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/nigeria-school-abduction-9.6982120?cmp=rss",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxORmtLSVlLSkN0clE1VjNXYVdOeEI0NGZfWFRGNE5Pd2s4Q3Z6eDY5bDZHMF9HLUNOOFNuV2hoaUhFS2Q2YWhSVk44VnNpWUwxQU51VWRGTU4yUXJwV0ZySDNTNGkyQnpsWWNTNi1MakFFcy0wdjdyRjVQS3JzcVoxaFpWMG52bngwcXY4RS03VUVoeW8?oc=5",
      "https://www.nytimes.com/2025/11/17/world/africa/nigeria-school-kidnapping-girls.html"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/nigeria-gunmen-kidnap-25-students-from-kebbi-high-school/a-74782165?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.898,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Kebbi state, Nigeria, gunmen killed a school's vice president, injured a security guard, and abducted 25 girls from a high school. Authorities are searching the area for the assailants. This incident mirrors the Chibok girls' abduction 11 years ago and occurs amid U.S. calls for Nigeria to tackle violence against Christians.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the ongoing violence and abductions in Nigeria, but it does not provide any solutions or deeper insights into the root causes of these issues. Furthermore, it does not empower the reader with any actionable knowledge or understanding.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "UK to Ban Resale of Tickets Above Original Price to Curb Touting",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 21:19:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Ministers are expected to announce the plan to tackle touts and resale sites offering tickets at several times face value.",
      "Aggressive crackdown on touts comes after backlash over cost of watching live music and sport",
      "Touts, and ordinary consumers, will no longer be able to charge anything more than price at which they bought ticket Reselling tickets for profit is to be outlawed under plans due to be announced this week, the Guardian has learned, as the government goes ahead with a long-awaited crackdown on touts"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2933/live/809f2690-c3eb-11f0-a277-5df1a7bf8a43.jpg",
    "titles": [
      "Reselling tickets above face value set to be banned by government",
      "UK to ban resale of tickets above face value for live events",
      "Reselling tickets for profit to be outlawed in UK government crackdown"
    ],
    "url": "https://www.bbc.com/news/articles/c77z2l3yzl8o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.ft.com/content/e76df64b-b5ff-4e6d-9064-53233073908c",
      "https://www.theguardian.com/money/2025/nov/17/reselling-tickets-for-profit-to-be-outlawed-in-uk-government-crackdown"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c77z2l3yzl8o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK government plans to announce measures to prohibit ticket touts and resale sites from selling tickets at prices higher than their original purchase value. This move, aimed at addressing public frustration over inflated prices for live events, will make reselling tickets for profit illegal.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it provides useful information about a new policy that could affect consumers' decisions about purchasing event tickets. It also reports on a governmental solution to a problem, contributing to the reader's understanding of the issue.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Spurs' Victor Wembanyama Out for Weeks with Calf Strain",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 17:55:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Victor Wembanyama, who had an MRI on Sunday, will be sidelined for a few weeks as the Spurs are being cautious about his left calf strain, sources told ESPN.",
      "Wembanyama suffered a calf strain against the Warriors last Friday",
      "Victor Wembanyama is expected to be sidelined for a few weeks due to a left-calf strain, ESPN’s Shams Charania reported on Monday."
    ],
    "image_url": "",
    "titles": [
      "Sources: Spurs' Wembanyama out for a few weeks",
      "Victor Wembanyama missing time with calf strain: Spurs star out a few weeks, putting award candidacy at risk",
      "Report: Spurs’ Wembanyama expected to miss multiple weeks with calf injury"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47002707/sources-spurs-victor-wembanyama-weeks-calf-strain",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/victor-wembanyama-injury-calf-strain-san-antonio-spurs/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47002707/sources-spurs-victor-wembanyama-weeks-calf-strain",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.817,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Victor Wembanyama, a player for the Spurs, will miss a few weeks of play due to a left calf strain sustained during a game against the Warriors last Friday. An MRI confirmed the injury, leading the team to take a cautious approach to his recovery, as reported by ESPN and Shams Charania.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about an injury to a player and the team's response, which might be of interest to fans of the team or the sport. However, it does not provide deeper insights or actionable information for the reader, nor does it report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Bernie Kosar to Undergo Liver Transplant on Monday",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 21:31:50 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet",
      "Associated Press"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com",
      "sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Kosar had been diagnosed with cirrhosis, underwent numerous procedures recently",
      "Former Cleveland Browns QB Bernie Kosar posted on social media that his liver transplant was a success.",
      "Bernie Kosar received a liver transplant on Monday, more than a year after being placed on the waiting list.",
      "Bernie Kosar says he will receive a liver transplant Monday morning AP News"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/17/75c607f9-1621-4a7f-9aa7-57c0e896a71a/gettyimages-2197848069-1.jpg",
    "titles": [
      "Bernie Kosar receives liver transplant: Browns legend 'feeling good' after surgery",
      "Social media reactions as Former Browns QB Bernie Kosar has successful liver transplant",
      "Ex-QB Bernie Kosar has liver transplant after more than year on waiting list",
      "Bernie Kosar says he will receive a liver transplant Monday morning - AP News"
    ],
    "url": "https://www.cbssports.com/nfl/news/bernie-kosar-liver-transplant-updates-browns-miami/",
    "alternate_urls": [
      "https://sports.yahoo.com/article/social-media-reactions-former-browns-224054613.html",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPaEJqUXZjOWoycEV6VGZtYVA0Mk9kNmtSNWh3eEloNzRON2hJV2xpempVWEJTcE1NUS13YnJWX0l4YWptSG1JU0VfeDRMQlFFQmhzSUw5TlFNTThFQTc0R3k4aEVVazNKeGM5OXF3UER4dUNQS0tBSU9yMWFMUUFFNk5zYnhqdzBCSlBSQk1mOUZfNXNzZmJFUHREeWNDV1h3a0s5TFFMOC1zZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/bernie-kosar-liver-transplant-updates-browns-miami/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.964,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bernie Kosar, a former professional football player, announced he is scheduled to undergo a liver transplant on Monday morning, as reported by AP News.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a former football player's health situation but lacks depth or insight. It doesn't provide actionable insights for the reader or report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Virginia Tech to Hire James Franklin as Head Football Coach",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 17:55:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Virginia Tech is finalizing a deal to make James Franklin the school's next head coach, sources told ESPN on Monday.",
      "James Franklin, Va Tech Reportedly Finalizing HC Contract After Penn State Firing Bleacher Report",
      "Sources: Virginia Tech to Hire James Franklin As Next Head Football Coach Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Sources: Va. Tech finalizing deal to hire Franklin",
      "James Franklin, Va Tech Reportedly Finalizing HC Contract After Penn State Firing - Bleacher Report",
      "Sources: Virginia Tech to Hire James Franklin As Next Head Football Coach - Sports Illustrated"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/46991951/sources-virginia-tech-finalizing-deal-hire-james-franklin",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNblRtbTRzb3R2QWlKQUdfejJHSUEwMWpzdzZnOGVXMFk3QUpYMnpKWnhISENlejNpUkJLVElyNWZ0Z19EZGNROWhsMnEtZy1tM1Z4YVNpNjJDVHd4LXpCSVRLa3llSUx2ZUhLWHE3UVRMdUI3N0xZandRTWZqaHBMdmhUbDA1c19qN2pMcVktYXZreWVxU0tyX2VTb2dQR1hpX2Y0dm84ZThqNWlrd3VTTW5RN05mN2t2OEV4RGhkSEkzUjA?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQNUJBVVFYTjIyTk15SXVjTDJhS1ZWbmdwUW15VGF6WFRFYVJSVlF4REVRdHBmNnVoQXE0eGNjTFp0SHl4ckFRamMzNEhpRUk3WGl4bF8wUEM3QTJDTWpHbXJYSG5mclRGUFBtRnpORXNQOHNtWXgwOWd4YWdqdnVWY1F2N0JDN2x1ZUpyckJ4UjhpbUY3RzM1Y2Flc3h3SVIzckx3REswRkhaSllv?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/46991951/sources-virginia-tech-finalizing-deal-hire-james-franklin",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.992,
      "consensus": 0.769,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.805,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Virginia Tech is finalizing a contract to appoint James Franklin as their next head football coach, following his departure from Penn State. This move, reported by multiple sources including ESPN and Sports Illustrated, marks a significant development in the 2025-26 coaching carousel. Franklin's hiring comes after at least a month of speculation linking him to the Hokies.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a change in the coaching staff of Virginia Tech's football team. However, it does not delve into the implications of this decision, Franklin's past performance, or how this might impact the team's future, thus offering minimal depth or insight.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Trump Reverses Stance, Urges GOP to Support Epstein Files Release Amid Military ",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 18:09:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "bbc.com",
      "dw.com",
      "espn.com",
      "forbes.com"
    ],
    "snippets": [
      "There are still procedural and legal hurdles to cross before the files can be released to the public.",
      "President Trump spent weeks criticizing a push for the release of Jeffrey Epstein-related files, but now he's calling for the information about his former friend to be made public. What’s behind the shift?",
      "How did the fight come together? What does this fight mean for Paul, Joshua? Andreas Hale answers this questions and more.",
      "\"Sure, I would,\" Trump said when asked if he'd sign the bill ordering the Epstein files' release."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/334c/live/b5b19260-c3d1-11f0-bdbe-6f7df1044786.jpg",
    "titles": [
      "When is the Epstein files vote - and what happens next?",
      "Trump and the Epstein files: What you need to know",
      "Paul vs. Joshua: Everything you need to know",
      "How Soon Could The Epstein Files Be Released? What To Know As Trump Says He’ll Sign Bill"
    ],
    "url": "https://www.bbc.com/news/articles/cq50nvq8znvo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.dw.com/en/trump-and-the-epstein-files-what-you-need-to-know/a-74780282?maca=en-rss-en-top-1022-rdf",
      "https://www.espn.com/boxing/story/_/id/46998947/jake-paul-vs-anthony-joshua-boxing-all-need-know-fight",
      "https://www.forbes.com/sites/alisondurkee/2025/11/17/how-soon-could-the-epstein-files-be-released-what-to-know-as-trump-says-hell-sign-bill/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cq50nvq8znvo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.898,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump, after initially criticizing efforts to release Jeffrey Epstein-related files, has reversed his position, urging Republicans to support a House vote for their release. This shift comes amid a U.S. military buildup in the Caribbean, which is increasing pressure on Venezuela. Trump's call for support came late Sunday, indicating a significant change in his stance on the matter.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords (2): effort, support; semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Falcons' Penix Jr. on IR; Cousins May Play for Atlanta Amid Injury Wave",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 18:44:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Penix will miss at least four games after being place on IR",
      "Michael Penix Jr. Injury Update: Falcons QB Sent to IR, 'Potentially' Out For Season Sports Illustrated",
      "Kirby Smart Provides an Injury Update on Georgia Linebacker CJ Allen Sports Illustrated",
      "It could be time for Kirk Cousins in Atlanta. Falcons quarterback Michael Penix Jr. might be lost for the season due to a knee injury suffered Sunday, ESPN’s Adam Schefter reported on Monday."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/16/509c4e5a-1b7a-4a83-8a1b-c0eb7a164f7a/michael-penix.jpg",
    "titles": [
      "Michael Penix Jr. injury update: Falcons QB may have suffered season-ending knee injury, placed on IR",
      "Michael Penix Jr. Injury Update: Falcons QB Sent to IR, 'Potentially' Out For Season - Sports Illustrated",
      "Kirby Smart Provides an Injury Update on Georgia Linebacker CJ Allen - Sports Illustrated",
      "Reports: Falcons QB Michael Penix Jr. potentially out for season, heading to IR"
    ],
    "url": "https://www.cbssports.com/nfl/news/michael-penix-jr-injury-falcons-qb-knee-injury/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMidEFVX3lxTE1tZG51QXJ6V2JXODVTUUNpMVdqWFhhNTdSRWVXa0E1UGxKRF9hVjkyaU5HbHlseURFRkk5WFM4VW9WV1ZSeEtMVXcwX0FCaWhWd3kzaExSRHFYOS1LTmUwNnRpM3BlS3RWeHNoSkhNYjNnNm9S?oc=5",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNVkw4UVkyWnd5MWk4SGdlaXd6N0pfVWh6Y0pDNGRZbWRkcEswbWtoeFFUNGZPaEhla05NdWw0WWk0aWlsUlNCdkhqZHpxUlpxcjdGbUJmNUZBWUtrZHlWdFFDbHJkOGpHQzh2emg2Y0NyU19oVS10UE9SU0ZDVTZfWGtkRGRMSzRvS0tlOVF2S2pHUXd1ZTY0ZkRfbkZpVXBKRmt3ZEFGVGR3U01FWkpPNnBEaEZudFNnT21EMFI4VWdiWDg?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/michael-penix-jr-injury-falcons-qb-knee-injury/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Falcons QB Michael Penix Jr. is on IR and may miss the season with a knee injury. Packers RB Josh Jacobs and Georgia LB CJ Allen also face injury concerns. This situation raises the possibility of Kirk Cousins playing for Atlanta.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the injury status of several players and potential changes in the team lineup. It helps fans and followers of the sport to understand the current situation. However, it doesn't highlight any solutions to the injury problem or provide empowering knowledge.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Judge Questions Integrity of DOJ's Indictment of Ex-FBI Chief Comey",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 20:00:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Judge William Fitzpatrick wrote there was 'a reasonable basis' to question whether 'government misconduct' occurred.",
      "Judge finds 'profound' missteps in US probe of FBI ex-chief James Comey Reuters",
      "Judge Finds ‘Profound’ Missteps in DOJ’s Indictment of Comey Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "‘Disturbing pattern’: US judge rebukes ‘missteps’ in James Comey indictment",
      "Judge finds 'profound' missteps in US probe of FBI ex-chief James Comey - Reuters",
      "Judge Finds ‘Profound’ Missteps in DOJ’s Indictment of Comey - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/disturbing-pattern-us-judge-rebukes-missteps-in-james-comey-indictment?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxOTXRDcWRtdl9IbHNzYmIzRHp3MmJUQTVndGY0eXJKLTQ1N25aNV9yZzNWcndtbGkzTkFjd0sxWTBYQ2RwT1BKa3RGM1FxRkdCR0hsMjFua2FTUmthZjJzakU5Q09tV3dQS3ZtNzVWbjlkcml6QU5DSDA5MFBvQUlNZGVtN2hhQVNlLXEwY3Q2cVZTV28zVGN3WlhlYTI5d1RubmZVWFRfN1NvN2RRNVNzRHB4WXZnZmc?oc=5",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxQQ0FQbkNwSlRPSUs5R2x6UllLOUJtTkN2bEtCY29xZ0paUzNUZUhxbGwyQjY4X2FEMVVWNVBna0RyekJDaDFuX2ZNZHVlVEVVVGdvc0VWNUtZaUR5WXRqd3d4dUppRk5tNDVSMndZWWU1QkI5cE9aT1cxYnJRaDgtRU9ETk1WQWR6V0hrNmw1Q3RUSzRvQmc5SXAyQXVPVFFHdGhSSUhmei1FeTMwLVE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/disturbing-pattern-us-judge-rebukes-missteps-in-james-comey-indictment?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Judge William Fitzpatrick found 'profound' missteps in the DOJ's indictment of former FBI chief James Comey, suggesting a 'reasonable basis' to question potential government misconduct. This indicates significant concerns about the investigation's integrity.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about the DOJ's indictment of James Comey, which can help readers understand the broader implications of the case. However, it does not include any information about potential solutions or improvements, limiting its constructiveness.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Fan Sentenced for Public Nuisance at Ariana Grande Event in Singapore",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-17T11:10:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "LA Times",
      "The Guardian"
    ],
    "domains": [
      "dw.com",
      "nytimes.com",
      "latimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "A man has been given a brief jail sentence for jumping a barricade at the \"Wicked\" sequel premiere and throwing his arm around Ariana Grande.",
      "He pleaded guilty to one charge of being a public nuisance.",
      "The man who charged at Ariana Grande at the 'Wicked: For Good' premiere in Singapore has been sentenced to jail after being convicted as a public nuisance.",
      "Johnson Wen, who jumped over a barricade at Universal Studios Singapore and rushed at the Wicked star, has been convicted of being a public nuisance The man who grabbed Ariana Grande at a red-carpet premiere for Wicked: For Good in Singapore has been jailed for nine days. According to BBC News , Aus"
    ],
    "image_url": "",
    "titles": [
      "Singapore jails Australian man who rushed Ariana Grande",
      "Man Who Rushed Ariana Grande in Singapore Gets 9 Days in Jail",
      "That was fast: Man who accosted Ariana Grande last week is serving time already in Singapore",
      "Man who grabbed Ariana Grande at Wicked: For Good premiere sentenced to nine days in jail"
    ],
    "url": "https://www.dw.com/en/singapore-jails-australian-man-who-rushed-ariana-grande/a-74775143?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/17/world/asia/ariana-grande-singapore-fan-attack-sentence.html",
      "https://www.latimes.com/entertainment-arts/movies/story/2025-11-17/ariana-grande-man-jailed-singapore-wicked-good",
      "https://www.theguardian.com/film/2025/nov/17/man-who-grabbed-ariana-grande-at-wicked-for-good-premiere-sentenced-to-nine-days-in-jail"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/singapore-jails-australian-man-who-rushed-ariana-grande/a-74775143?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.777,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Johnson Wen was sentenced to nine days in jail for being a public nuisance after he jumped a barricade at the \"Wicked: For Good\" premiere in Singapore and approached Ariana Grande. He pleaded guilty to the charge, following an incident that gained attention when videos of the event, including Grande's co-star Cynthia Erivo intervening, went viral on social media.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an incident at a public event but lacks depth or insight. It doesn't explore wider issues related to event security or the implications of such incidents for public figures.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UCP Sues Ex-Members Over New Party Attempt in Alberta",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 17 Nov 2025 22:54:03 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Globe and Mail"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Alberta's United Conservative Party is suing two former caucus members over their attempts to start a new provincial political party under the Progressive Conservative brand.",
      "Alberta UCP launches lawsuit against former caucus members The Globe and Mail"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/PC-Revival.png",
    "titles": [
      "UCP files lawsuit against former caucus members and Alberta Party president",
      "Alberta UCP launches lawsuit against former caucus members - The Globe and Mail"
    ],
    "url": "https://globalnews.ca/news/11530147/ucp-files-lawsuit-progressive-conservative-party-gunthie-sinclair/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQQzhzaTlvdk8tSC1KQ0x2dDhzVU9WZnpRa1VSbmRidEVQVmVIMllyUTBZNVJaTm5abUFQWk03Z29OMzY5bUN0emhXcTFWRVpoWGRCQXduYXUtMkFEU3B3cW9IRURFUVFHUWlvYkpqQzlCQ0I0MTFpWUZHZ3hYeW5rS1gyQ01lX0RscVJzakhSQ0NSUGNfeUtGWkw3cEZ6MGI5ajdTaHhua1dwZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11530147/ucp-files-lawsuit-progressive-conservative-party-gunthie-sinclair/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.763,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United Conservative Party (UCP) of Alberta has filed a lawsuit against two of its former members for attempting to create a new political party using the Progressive Conservative brand. This legal action underlines a significant internal conflict within the province's conservative movement.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an ongoing internal conflict within a political party, which could influence the reader's understanding of the political landscape in Alberta. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the causes or impacts of the conflict.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ford Teams Up with Amazon to Sell Pre-Owned Cars Online",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 14:03:49 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Bloomberg",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Ford to sell used vehicles on Amazon, joining Hyundai Reuters",
      "Ford is partnering with Amazon for the automaker's franchised dealers to be able to sell certified pre-owned vehicles through the online retail giant.",
      "Ford Taps Amazon to Let Shoppers Buy Its Used Cars Online Bloomberg.com",
      "Amazon Autos, which kicked off last year with Hyundai, initially started with new cars. The deal with Ford pushes it into used car territory."
    ],
    "image_url": "",
    "titles": [
      "Ford to sell used vehicles on Amazon, joining Hyundai - Reuters",
      "Ford partners with Amazon for dealers to sell used vehicles online",
      "Ford Taps Amazon to Let Shoppers Buy Its Used Cars Online - Bloomberg.com",
      "Ford turns to Amazon to give used cars sales a boost"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPbi1FSFJKTHRFc1dOMmptbVdJOGxmSkRhNzlXZ3Q0VjZBVUEteVhISDNxczc4dFR5TXBaekMxVGM0QWNoaGZUM1JhU1Y1ZjNaVS12ZlJoRndreU8xbXVVTFNCMzVuT0JCZVNpaklWX3MwQ2F4RTRPd05aTGFIbVpvYXBuMzZDS3Z4VmRCams2Sy0xNmtkdXBRVW9kdkFWSlZmRFVPVUxFOEZnYURrS1h5RHdR?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/17/ford-amazon-used-vehicles.html",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNb290c3c4ZHl4Y19qU1RBS1hCLUh0MW9QLWp0b28zd0NGMVRINHY3ZU84dW9oSDd5eVhJMkE5MFQzTFFVYVRoVGw2Nzh0ckJ4TXpQUzZfSUI2RmNuWC13OGw2RVlWREtXQ3pWTWJiOE5YUE9FX2lMa3paQ2xIM0w0NzduUkxtS0JDYVY2RF9tbk1HWk15LUZIOXFsOHFkM2tKcFFrQVJBMFBpXzRr?oc=5",
      "https://techcrunch.com/2025/11/17/ford-turns-to-amazon-to-give-used-cars-sales-a-boost/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPbi1FSFJKTHRFc1dOMmptbVdJOGxmSkRhNzlXZ3Q0VjZBVUEteVhISDNxczc4dFR5TXBaekMxVGM0QWNoaGZUM1JhU1Y1ZjNaVS12ZlJoRndreU8xbXVVTFNCMzVuT0JCZVNpaklWX3MwQ2F4RTRPd05aTGFIbVpvYXBuMzZDS3Z4VmRCams2Sy0xNmtkdXBRVW9kdkFWSlZmRFVPVUxFOEZnYURrS1h5RHdR?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.825,
      "consensus": 0.888,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ford has partnered with Amazon, allowing its franchised dealers to sell certified pre-owned vehicles on the online retail platform. This collaboration aims to expand Ford's reach in the used car market by leveraging Amazon's vast customer base.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords (2): collaboration, expand; semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shedeur Sanders Debuts as Browns QB Against Ravens, Completes First Pass",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 15:00:11 GMT",
    "source": "Bleacher Report",
    "sources": [
      "Bleacher Report",
      "Sports Illustrated",
      "Associated Press"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Deion Sanders Reveals He Cried When Shedeur Entered for Browns vs. Ravens in Video Bleacher Report",
      "Shedeur Sanders Makes NFL Debut for Browns vs. Ravens After Dillon Gabriel Concussion Bleacher Report",
      "How Did Shedeur Sanders Do in NFL Debut for Browns? Insiders, Fans Weigh In Bleacher Report",
      "Will Shedeur Sanders Be Browns' QB1 When Dillon Gabriel Clears Protocol? HC Weighs In Bleacher Report",
      "How Shedeur Sanders Performed in NFL Debut With Browns Sports Illustrated",
      "Browns QB Shedeur Sanders has a rough NFL debut after relieving the injured Dillon Gabriel AP News",
      "Why Deion Sanders Was in Tears Over Shedeur Sanders’s NFL Debut With Browns Sports Illustrated",
      "Ex-NFL QB Defends Browns’ Kevin Stefanski Over Surprising Shedeur Sanders Admission Sports Illustrated",
      "Shedeur Sanders’s House Was Broken Into During Browns’ Loss to Ravens Sports Illustrated",
      "Shedeur Sanders fans will hate what Kevin Stefanski said after losing NFL debut Sports Illustrated",
      "Myles Garrett shares what Shedeur Sanders said in Browns locker room after loss Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Deion Sanders Reveals He Cried When Shedeur Entered for Browns vs. Ravens in Video - Bleacher Report",
      "Shedeur Sanders Makes NFL Debut for Browns vs. Ravens After Dillon Gabriel Concussion - Bleacher Report",
      "How Did Shedeur Sanders Do in NFL Debut for Browns? Insiders, Fans Weigh In - Bleacher Report",
      "Will Shedeur Sanders Be Browns' QB1 When Dillon Gabriel Clears Protocol? HC Weighs In - Bleacher Report",
      "How Shedeur Sanders Performed in NFL Debut With Browns - Sports Illustrated",
      "Browns QB Shedeur Sanders has a rough NFL debut after relieving the injured Dillon Gabriel - AP News",
      "Why Deion Sanders Was in Tears Over Shedeur Sanders’s NFL Debut With Browns - Sports Illustrated",
      "Ex-NFL QB Defends Browns’ Kevin Stefanski Over Surprising Shedeur Sanders Admission - Sports Illustrated",
      "Shedeur Sanders’s House Was Broken Into During Browns’ Loss to Ravens - Sports Illustrated",
      "Shedeur Sanders fans will hate what Kevin Stefanski said after losing NFL debut - Sports Illustrated",
      "Myles Garrett shares what Shedeur Sanders said in Browns locker room after loss - Sports Illustrated"
    ],
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNckpMemVSOHlvdmdwZVlONXVSQXNCTEVrVHVwdGlVbjJYVGRFR1NtNzFVS1diQVVEMWJYWW9UblVTZDZWNXd4UlRBc0lIZ3RDRXJUc28waEQ4TXdlZ0hGUE1QZE1tYjdNVExieFpIeTJnMUFLT19pZEJMZXdndEtTMUsyNUtvRjZCbkYzN3VNQnJ4MHR4bTdtcUg3RjNQX2psQUZhaGVWRVNpRkJ2eUpqbHVnS2IwVVd3XzRr?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPMlh0TFAtLXROdG5sSlRLbVZWY2tRODNIel9yOFdITGJPYW1PUWZUbVdJYjd6WnBYNmZRU2FkcmNST1FHUFppOERvWmRKOVNCOWZOMm9qWUR6aFNMd1c3RzhQY0lZbDdXS2ZzZGVZaS1OazlVR09zUGhTeXRtYldKWTlXOWprdDVTT2lHZHVFZklyZnpqMVFCQ1gxRVlGYmhIbHE0RG9ZWFVMQ191MXFLLWRQdF94Y1p3Tkltb2g1WE5DUzg?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNTFZHZ3I1YXBDVTFabjJXZUhxd19WVVphZkw3MnRabGJsQm9VVVVNS1BPcmlTbUI0YkNuMnA2V1BEMk1zZmk1aHNOWnk1cGFCcnBueGN6Z2c3bGJIeVoxYkY2M05FMUtRVHU5QnJhUkRsUHdkU2VUQ29MN3JhcEhISDdadGJLLVU1QjV1bmFIb1JtRWczbExETFRWY0xZQmNFM3lKU013Z2JDMVVt?oc=5",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOVWhQVkl6NV8yLXZGazE3aTdGN3FqMXl6V3VkNlE4VFA3WTVqSGt5VnJCVndiZ0EyMkgxQ0dQUlNPbmlicnVUeGlTSjRnRklEWnJjZTUtWXQ0N3RWMDZkVUJreEN3Rkh6Vm1jQTBVY215VXNPcW5HUHo0VHBMbVNoajNwY2xjZVJQb0tQWUkwLVZFQi1mazhNTXpKWmJublByLTdNVDNkMjY4Q0g4R3lWZ0lJd01wWEViTURHR2FlVUsyd28?oc=5",
      "https://news.google.com/rss/articles/CBMieEFVX3lxTFBNYlUzWDN5ZGhzVmFGS3ZOVVd2U0pRb1FzanBUODFwZUVocl9UdklMQllpZWhzbWhhQm5OTzNkTDBLdy04RE5hNzdMamI0cjdZa3NzUC1HYXRRU1RoaVhTWm95YnIwQUxJMVBibXMyYUZJaEdyM2g0Uw?oc=5",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxPUUMzU0VPNnRKOHk4eEpTdFotR0o2RmQ3Qm02bVBRTnZvWm1nZVQydm00V0M1d0lUOHQ4elAxdnJpMWVSeGp5a0tTNjN4NzZxRlhsaHJyTF9iRE9mNDRQTTFSR09TZjl5QzVLclZucEQ2UnBfUkpXcFpWRGJtRzdiVE52UElVbE1RRFdjclBKSlJSZw?oc=5",
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxNV2F5R2p5NXhYeDhJQWxCUWVVanZfS2l4ZTRiTlltZDY1TkpwSzFzbVhZNUp3ajRsM3hmNGlRdnpTTUtHRVlYWVBUT2xxTk5FSUZrbzBxU0RtNXp3dWNKRGprZlBrdDllRFcybTlRZW5XUk80Z3lVOGtEUFhaMWc5VmlFa3c4Zw?oc=5",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxPLUdISVR1VlhOczhxeGo0UHY5S3VnTVlEdTBFaFhNSnZTTVB2VlRySFFjWFdTS0RmRk9XZHU4TFN4SXBIS09QYkdBS3J6ZkEwZkY3NEJwdEJaR0s1NHpoQzVzbE5KeEFZWWcycjVqLTdjQjlZTnNZZ1htX1dpNWJLbzVxRFdhd3dOQ3FsWkxXTHR3aVdMdWtFNDVzWkRrYVk?oc=5",
      "https://news.google.com/rss/articles/CBMigAFBVV95cUxPeEtLZlpMS1BOSnpLZ1p2WEJWTW4weE5wSWlNTjZCUVFUT1lIYUdDWWN0cDFKRGQtZ2FpU1YwU3pGTFl5S0tYSV90UW55b2Vvcjk5WmhFVXFzTko4aV91RjZXWC1GRXktQ19xT2I5aEloaXNsTzQzM0k3OVNKVDRBMg?oc=5",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxOOWRmZTRWUHhTVl9HN050VjBQTTJhTmg1US1PanZzTWVFX0c4Z0lKTDlxRVQ3WHRNNkE4eE1pdjlSRFFhcHE4Z1hsMTB6QXZnSFpJby1lMFFjZ0xNOXR5a21sQmR0R1pienpSbUpReXZOM2psUU9OdnpYUE5EWldoNmQzZ1d2T2c0bVFId2FRT3VFTV9RYmdWMUFxQThqd1F0TVdJeUF0bnFPTEFHSWFDQVExOXpobkltZGNtdWFaVjlIWURrZHBsamJ5eEU?oc=5",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxQRUYtcWVMcU9mcDFER0xuX0lIRmpoNm15QlZFUHIyTDVaeWJUVzg1MW5ZX1l5Y1dOQTlMVFFjd19tT0JpRUxEZ01mc0xWanZhbnJzMTVEVUFtRjVSb0FnQmtyVE05aVZQNjZzTWYzSy00WXBvRE5jNjVnQ2F4eU0zWVUwcnNGcVQ3UWxqWXRmSE5CTlotek1JUmFPeWhRcUNfUnlQbVh4NUlJMjFwSEREd2ptcjE3bTd2Y2Y2b3IyT25wVllTNFlxejJhNVQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNckpMemVSOHlvdmdwZVlONXVSQXNCTEVrVHVwdGlVbjJYVGRFR1NtNzFVS1diQVVEMWJYWW9UblVTZDZWNXd4UlRBc0lIZ3RDRXJUc28waEQ4TXdlZ0hGUE1QZE1tYjdNVExieFpIeTJnMUFLT19pZEJMZXdndEtTMUsyNUtvRjZCbkYzN3VNQnJ4MHR4bTdtcUg3RjNQX2psQUZhaGVWRVNpRkJ2eUpqbHVnS2IwVVd3XzRr?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.841,
      "consensus": 0.749,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Shedeur Sanders made his NFL debut as quarterback for the Cleveland Browns in a game against the Baltimore Ravens, following Dillon Gabriel's concussion. Sanders completed his first NFL pass during the second half of the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic information about Shedeur Sanders' debut as a quarterback for the Cleveland Browns. It lacks depth or insight into his performance beyond the completion of his first pass, or the implications of his debut for the team.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Jeff Bezos Co-Leads AI Startup Project Prometheus with $6.2B Funding",
    "domain": "technology",
    "source_domain": "lemonde.fr",
    "location": "global",
    "published": "Mon, 17 Nov 2025 19:11:54 +0100",
    "source": "Le Monde",
    "sources": [
      "Le Monde",
      "TechCrunch",
      "Globe and Mail"
    ],
    "domains": [
      "lemonde.fr",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "Selon le « New York Times », le fondateur d’Amazon a créé une société dévolue à l’intelligence artificielle dans l’ingénierie, l’industrie et le monde physique.",
      "Jeff Bezos is partly backing a new AI startup called Project Prometheus that has raised $6.2 billion in funding, and will take on duties as co-chief executive.",
      "Jeff Bezos reportedly to co-lead AI startup called Project Prometheus The Globe and Mail"
    ],
    "image_url": "https://img.lemde.fr/2025/11/06/0/0/3529/1764/644/322/60/0/6fa9c93_ftp-import-images-1-vreq8sz6s6zq-761995cb1afd4c8199ffc9ad5d977f9a-0-20df5b90bd8c475499c9e35ddfaed344.jpg",
    "titles": [
      "Jeff Bezos lance à son tour sa start-up d’IA, Prometheus",
      "Jeff Bezos reportedly returns to the trenches as co-CEO of new AI startup, Project Prometheus",
      "Jeff Bezos reportedly to co-lead AI startup called Project Prometheus - The Globe and Mail"
    ],
    "url": "https://www.lemonde.fr/economie/article/2025/11/17/a-son-tour-jeff-bezos-lance-sa-start-up-d-ia-prometheus_6653788_3234.html",
    "alternate_urls": [
      "https://techcrunch.com/2025/11/17/jeff-bezos-reportedly-returns-to-the-trenches-as-co-ceo-of-new-ai-startup-project-prometheus/",
      "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPckRjdkQ2bVEwWUd2djBxNlBaRDJfTVlNeDFUeldjSm55V0EteWY5RGlRcHJ1TWp1ajV6QWhFbDZnazJLdDFXd2pER3d4TmZLR3FMODc2OTlUQmsweUZIeXBtMGtPMlpVeTM1VC1CdGZoZ09ocnBTQms1eVkyUzhvVkEyQW9lQk1hS3ZLaW9zUFphcElpTjlxRVJHel9EYmtvMlJIWXQ1MXhyMDZJNlRNOFgwck5xRmZJbjRFM0xWTWhiMFlMSEExU3FhOUxEak1CMDl3MVJsVG1DX3M?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.lemonde.fr/economie/article/2025/11/17/a-son-tour-jeff-bezos-lance-sa-start-up-d-ia-prometheus_6653788_3234.html",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jeff Bezos, former Amazon CEO, is set to co-lead Project Prometheus, an AI startup, alongside tech executive Vik Bajaj. After stepping down from Amazon, Bezos is embarking on this new venture which has secured $6.2 billion in funding. The project aligns with his vision of enabling \"millions of people living in space.\"",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NASA to Reveal New Images of Comet 3I/ATLAS Wednesday",
    "domain": "science",
    "source_domain": "livescience.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 22:32:06 +0000",
    "source": "Live Science",
    "sources": [
      "Live Science",
      "NASA"
    ],
    "domains": [
      "livescience.com",
      "nasa.gov"
    ],
    "snippets": [
      "NASA will finally share long-awaited images of interstellar object 3I/ATLAS taken during the comet's close flyby of Mars. A live stream has been set for Wednesday (Nov. 19).",
      "Lee este comunicado de prensa en español aquí. NASA will host a live event at 3 p.m. EST, Wednesday, Nov. 19, to share imagery of the interstellar comet 3I/ATLAS collected by a number of the agency’s missions. The event will take place at NASA’s Goddard Space Flight Center in Greenbelt, Maryland. Co"
    ],
    "image_url": "https://cdn.mos.cms.futurecdn.net/xkmAJAaj24k73omqaCPNuR-1280-80.jpg",
    "titles": [
      "Never-before-seen NASA images of comet 3I/ATLAS are coming on Wednesday (Nov. 19)",
      "NASA to Share Comet 3I/ATLAS Images From Spacecraft, Telescopes"
    ],
    "url": "https://www.livescience.com/space/comets/never-before-seen-nasa-images-of-comet-3i-atlas-are-coming-on-wednesday-nov-19",
    "alternate_urls": [
      "https://www.nasa.gov/news-release/nasa-to-share-comet-3i-atlas-images-from-spacecraft-telescopes/"
    ],
    "location_scope": "global",
    "link": "https://www.livescience.com/space/comets/never-before-seen-nasa-images-of-comet-3i-atlas-are-coming-on-wednesday-nov-19",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA will host a live event on Wednesday, Nov. 19, at 3 p.m. EST to reveal images of the interstellar comet 3I/ATLAS. The presentation, showcasing visuals from various NASA missions, will occur at the Goddard Space Flight Center in Maryland.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about an upcoming event where new scientific data will be revealed. It increases awareness about NASA's ongoing research and the exploration of interstellar bodies. However, it doesn't report on specific innovations or solutions, hence the score.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "NASA Pilot Preps for High-Altitude Earth Science Mission in California",
    "domain": "environment",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Mon, 17 Nov 2025 20:35 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "NASA ER-2 pilot Kirt Stallings waits inside the transport vehicle at Edwards, California, on Thursday, Aug. 21, 2025, moments before boarding NASA’s Armstrong Flight Research Center’s ER-2 aircraft for a high-altitude mission supporting the Geological Earth Mapping Experiment (GEMx). Through the veh",
      "NASA ER-2 pilot Kirt Stallings waits inside the transport vehicle moments before boarding the airborne science aircraft at NASA’s Armstrong Flight Research Center in Edwards, California, on Thursday, Aug. 21, 2025. Outside the window, the aircraft is being readied for a high-altitude mission support"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/11/afrc2025-0071-374orig.jpg",
    "titles": [
      "Suited Up for Science: NASA ER-2 Pilot Prepares for GEMx Flight"
    ],
    "url": "https://www.nasa.gov/image-detail/nasa-er-2-flies-geological-mapping-mission/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/suited-up-for-science-nasa-er-2-pilot-prepares-for-gemx-flight/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/nasa-er-2-flies-geological-mapping-mission/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On Aug. 21, 2025, NASA ER-2 pilot Kirt Stallings prepared for a high-altitude mission at the Armstrong Flight Research Center in Edwards, California. The mission aimed to support the Geological Earth Mapping Experiment (GEMx), focusing on advancing earth sciences from the skies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is constructive as it provides useful information about NASA's high-altitude mission and its purpose of advancing earth sciences. However, it does not clearly highlight solutions or empowering knowledge, nor does it offer a deep understanding of the systems or impacts involved.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bus Crash Near Medina Kills 45 Pilgrims Heading to Umrah",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-17T08:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "CBC News"
    ],
    "domains": [
      "dw.com",
      "nytimes.com",
      "cbc.ca"
    ],
    "snippets": [
      "Only one passanger among 46 pilgrims is reported to have survived after a bus collided with a tanker near Mednia.",
      "The passengers, who were participating in the Umrah pilgrimage, were traveling between the two holiest cities in Islam, authorities said.",
      "Dozens of Indian pilgrims are feared dead after a bus was in collision with a diesel tanker on Monday near the holy city of Medina in Saudi Arabia, Indian officials said."
    ],
    "image_url": "",
    "titles": [
      "Indians feared dead in Saudi Arabia bus crash",
      "More Than 40 Indian Pilgrims Are Killed in Bus Crash in Saudi Arabia",
      "Dozens of religious pilgrims from India feared dead in Saudi bus accident"
    ],
    "url": "https://www.dw.com/en/indians-feared-dead-in-saudi-arabia-bus-crash/a-74771705?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/17/world/middleeast/indian-pilgrims-bus-crash-saudi-arabia.html",
      "https://www.cbc.ca/news/world/saudi-medina-accident-india-pilgrims-9.6981219?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/indians-feared-dead-in-saudi-arabia-bus-crash/a-74771705?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.737,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A bus carrying 46 pilgrims to the Umrah pilgrimage in Saudi Arabia collided with a diesel tanker near Medina, resulting in at least 45 feared dead. Only one passenger is reported to have survived the crash. The victims were primarily Indian nationals.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story reports a tragic event, it doesn't provide any actionable insights, solutions, or deeper understanding of the causes or potential prevention measures. It's mainly a reactive report.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Open to Strikes on Mexico to Fight Drug Trafficking",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 20:28:30 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Trump says he would launch strikes against Mexico Reuters",
      "The president told reporters Monday the U.S. would do “whatever we have to do to stop drugs.”"
    ],
    "image_url": "",
    "titles": [
      "Trump says he would launch strikes against Mexico - Reuters",
      "Trump Says Military Strikes Against Mexico To ‘Stop Drugs’ Are ‘Okay With Me’"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQQk1reGJ1by1kbmdDeFdaeWJpeGZoeE02ZWVUdGdMaTBNakdGQUw2YTlCYkVNYmI4MV9iZG0zcmw1NkUzS1RjN3JRTXpEYUNnNWZudE9QWm1ZM0ZCdzZ6NGRLX2dZTmJBY1UyNjE5OUotTmFEZ21lRXpyX1BHQzBwa3psZnRGb1RYNE1haGZnTXhOaGk1NVhWQTlQeG9ldEVYRUE?oc=5",
    "alternate_urls": [
      "https://www.forbes.com/sites/antoniopequenoiv/2025/11/17/trump-says-military-strikes-against-mexico-to-stop-drugs-are-okay-with-me/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQQk1reGJ1by1kbmdDeFdaeWJpeGZoeE02ZWVUdGdMaTBNakdGQUw2YTlCYkVNYmI4MV9iZG0zcmw1NkUzS1RjN3JRTXpEYUNnNWZudE9QWm1ZM0ZCdzZ6NGRLX2dZTmJBY1UyNjE5OUotTmFEZ21lRXpyX1BHQzBwa3psZnRGb1RYNE1haGZnTXhOaGk1NVhWQTlQeG9ldEVYRUE?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump stated on Monday that he is open to launching strikes against Mexico to combat drug trafficking. He emphasized the U.S. would take necessary actions to halt drug-related activities.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness about a potential policy stance, but it lacks depth or insight into the complexities of drug trafficking, the potential impacts of such a policy, or any solutions being proposed. It doesn't offer actionable insights or deeper understanding for the reader.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  }
]