[
  {
    "title": "Cambodia, Thailand Agree to Ceasefire After US Pressure, Ending Border Clash",
    "domain": "general",
    "location": "national",
    "published": "Mon, 28 Jul 2025 04:01:50 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Al Jazeera",
      "The Guardian",
      "Washington Post",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Cambodia and Thailand agreed to a ceasefire on Monday, set to start at midnight local time, after attending talks in Malaysia aimed at ending a 5-day border dispute that has left dozens dead.",
      "US President Donald Trump threatened to pause tariff negotiations until the hostilities stopped.",
      "Malaysian PM says rival sides agree to an &#039;immediate and unconditional&#039; ceasefire after five days of deadly fighting.",
      "Malaysian PM Anwar Ibrahim says truce between Southeast Asian neighbours to begin at 17:00 GMT.",
      "Following days of deadly border clashes the leaders of Thailand and Cambodia have agreed to a ceasefire.",
      "<p>Malaysian PM says countries have reached ‘common understanding’ to halt the   worst fighting in a decade</p><p>Thailand and Cambodia have agreed to an “immediate and unconditional” ceasefire after talks in Malaysia that aimed to halt the worst fighting between the neighbouring countries in more t",
      "Thailand and Cambodia have agreed to “an immediate and unconditional ceasefire” starting at midnight, Malaysian Prime Minister Anwar Ibrahim said."
    ],
    "image_url": "",
    "titles": [
      "Thailand and Cambodia agree to ceasefire. What's behind the conflict?",
      "Thailand and Cambodia agree to 'immediate ceasefire'",
      "Thailand and Cambodia agree to ceasefire: Will it stop the deadly fighting?",
      "Thailand, Cambodia agree to ‘immediate, unconditional’ ceasefire: Malaysia",
      "Thailand and Cambodia agree to 'unconditional' ceasefire, Malaysian PM says",
      "Thailand and Cambodia agree to ‘immediate and unconditional’ ceasefire",
      "Thailand and Cambodia agree to ceasefire after deadly border clashes"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.844,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.871,
    "summary": "Cambodia and Thailand have agreed to an immediate and unconditional ceasefire starting at midnight local time, following talks in Malaysia. The ceasefire aims to end a 5-day border dispute that resulted in dozens of deaths. This agreement comes after US President Donald Trump threatened to halt tariff negotiations and is considered a significant step towards peace between the Southeast Asian neighbors, marking the end of the worst fighting in a decade as stated by Malaysian PM Anwar Ibrahim.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant step towards peace, a solution to a problem. It provides a deeper understanding of the situation and its resolution, contributing to the reader's knowledge about international relations.",
    "image": {
      "src": "https://live.staticflickr.com/8310/8003184756_fd7ff65c63_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/aa7d625a-3958-4677-a2a1-46f4f3fd6d19/thumb/",
      "alt": "Cambodia Teaching by Polly Butler",
      "credit": "Frontierofficial / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "US Plans Response as Deaths from Malnutrition Rise in Gaza",
    "domain": "general",
    "location": "global",
    "published": "Mon, 28 Jul 2025 15:12:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The US president's comments come after Israel's prime minister claims of hunger were a \"lie\".",
      "Infant is among at least 14 people who died from malnutrition in 24 hours across Gaza, hospital source tells Al Jazeera.",
      "US president says he is working on ‘various plans’ for the strip after meeting UK Prime Minister Keir Starmer in Scotland"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6f04/live/a66cc050-6bab-11f0-8dbd-f3d32ebd3327.jpg",
    "titles": [
      "Gaza experiencing 'real starvation', Trump says",
      "Baby dies from malnutrition as Trump warns of ‘real starvation’ in Gaza",
      "Trump says ‘real starvation’ afflicting Gaza"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.98,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary": "Following Israel's Prime Minister's dismissal of hunger claims in Gaza as \"lies,\" reports emerged of at least 14 people, including an infant, dying from malnutrition in the region within 24 hours, according to Al Jazeera. In response, the US President, after meeting with UK Prime Minister Keir Starmer in Scotland, stated he is developing \"various plans\" to address the situation in Gaza, indicating a move towards intervention or support.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it reports on a crisis and the attempts to solve it. It increases awareness about the situation in Gaza and the potential intervention from the US. However, it doesn't provide specific details about the planned response or how it might help, limiting its usefulness.",
    "image": {
      "src": "https://live.staticflickr.com/2452/4038813035_814181599f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/649e6e65-44d6-490b-82ba-d5aca1bfdda8/thumb/",
      "alt": "Table Top Exercise - East African partner nations test disaster response during Natural Fire 10 - US Army Africa - 091024",
      "credit": "US Army Africa / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Israeli Rights Groups Accuse Israel of Systematically Targeting Palestinians",
    "domain": "general",
    "location": "global",
    "published": "Mon, 28 Jul 2025 12:38:20 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Reports from B’Tselem and Physicians for Human Rights Israel add to growing domestic criticism of war conduct",
      "<p>Reports detailing intentional targeting of Palestinians as a group, and systemic destruction of Palestinian society, add to pressure for action</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jul/28/israel-gaza-aid-ceasefire-famine-middle-east-crisis-latest-news-updates\">Middle",
      "Israel says it is fighting against Hamas, not Palestinians as a group. But two of Israel’s best-known rights groups — long critical of Israeli policy — now say they disagree."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc1f71b55-72dc-4ddd-8fa0-0797a267e01c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Israeli rights groups accuse Israel of genocide in Gaza",
      "Israel committing genocide in Gaza, say Israel-based human rights groups",
      "In a First, Leading Israeli Rights Groups Accuse Israel of Gaza Genocide"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.929,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary": "Reports from B'Tselem and Physicians for Human Rights Israel criticize Israel's conduct in its conflict, accusing it of targeting Palestinians systematically and aiming to dismantle Palestinian society. These allegations add to domestic and international calls for accountability. Israel maintains its military actions are directed against Hamas, not Palestinians as a whole. The claims by these prominent Israeli rights groups mark a significant escalation in criticism against Israel's wartime policies.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the ongoing conflict between Israel and Palestine. It increases awareness about the claims of human rights violations and the responses from Israel. However, it does not offer potential solutions or improvements to the situation.",
    "image": {
      "src": "https://live.staticflickr.com/5567/14147237759_9b95e64ae9_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ad8c2482-4f8e-413d-9b37-cf79a53750e0/thumb/",
      "alt": "Interior of a cow from The Household Physician, 1905",
      "credit": "crackdog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "US President Disappointed as Putin Shortens Deadline, Affects Tariff Deal",
    "domain": "general",
    "location": "global",
    "published": "Mon, 28 Jul 2025 14:51:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "US president says he is disappointed in Russia&#039;s Putin as he shortens a 50-day deadline he set this month.",
      "New deadline marks shortening of 50-day window that US president gave Moscow last month to avoid sanctions",
      "<p>US president on visit to Scotland repeats he is ‘very disappointed’ with Vladimir Putin and increases pressure for peace deal</p><p>Reactions from <strong>Europe’s largest economy over the Trump tariff deal</strong> hatched in Turnberry, Scotland at the weekend, have <strong>inevitably been mixed"
    ],
    "image_url": "",
    "titles": [
      "Trump gives Russia 10 or 12 days to end war on Ukraine",
      "Trump says Russia has 10 to 12 days to agree ceasefire in Ukraine",
      "Trump gives Russia ‘10 or 12’ days to move on Ukraine as ‘no progress made’ – Europe live"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.973,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary": "The US president expressed disappointment in Russia's Vladimir Putin for shortening a 50-day deadline previously set to avoid sanctions. This adjustment was announced during a visit to Scotland, where the president reiterated his dissatisfaction with Putin and emphasized the need for a peace deal. The context of these developments includes mixed reactions from Europe's largest economy regarding a tariff deal made in Turnberry, Scotland.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context regarding the tariff deal and the impact of Russia's decision, but it doesn't offer any solutions or improvements. It provides awareness about the situation but lacks depth on the potential impacts or how the issue might be resolved.",
    "image": {
      "src": "https://live.staticflickr.com/3150/3076758953_67b7ba92e4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/5164aceb-7bd5-45ee-9f15-30127ea2ead1/thumb/",
      "alt": "'Mr. Lincoln, We Have a New President...' (#2 of 2 - a set)",
      "credit": "Tony Fischer Photography / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "PEI Confederation Bridge Toll Drops to $20; Ferry Fares Halved",
    "domain": "general",
    "location": "national",
    "published": "Mon, 28 Jul 2025 14:51:09 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Starting Aug. 1, tolls for all vehicles on the Confederation Bridge will drop from $50.25 to $20. Fares for inter-provincial ferries are also being cut by half.",
      "Prime Minister Mark Carney says that tolls on Prince Edward Island&#8217;s Confederation Bridge will be reduced starting Aug. 1, along with a handful of other Atlantic travel fees. Starting Friday, the bridge toll for an average vehicle will drop from $50.25 to $20. The government is also cutting fa"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2021/12/20211202151232-61a92d8b96ffa112bcfae62ejpeg.jpg?quality=65&strip=all",
    "titles": [
      "Carney cuts Confederation Bridge tolls, ferry rates to fulfill election promise",
      "Feds cut Confederation Bridge tolls, ferry fares in Atlantic Canada"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.972,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 1.0
    },
    "score": 0.752,
    "summary": "Starting August 1, tolls for vehicles on Prince Edward Island's Confederation Bridge will be reduced from $50.25 to $20, as announced by Prime Minister Mark Carney. Additionally, fares for inter-provincial ferries will be cut by half, aiming to lower travel costs in the Atlantic region.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a solution to high travel costs in the Atlantic region. It provides actionable information for readers who use these transportation methods and contributes to a broader understanding of regional policy changes.",
    "image": {
      "src": "https://live.staticflickr.com/4044/4666289439_49a4646d0f.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f265c7fd-71ef-4499-bd8e-010631923b3b/thumb/",
      "alt": "John Sark, Chief of the Prince Edward Island Mi’kmaq, ca. 1910-1920 / John Sark, chef des Micmacs de l’île du Prince-Édouard, vers 1910-1920",
      "credit": "BiblioArchives / LibraryArchives / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Boeing Faces Strike from 3,200 Workers at St. Louis Plants Over Offer Rejection",
    "domain": "general",
    "location": "global",
    "published": "Mon, 28 Jul 2025 12:24:39 GMT",
    "source": "The Guardian",
    "sources": [
      "Fortune",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<p>Plane maker expects over 3,200 union workers at three St Louis-area plants to strike after overwhelming no vote</p><p><a href=\"https://www.theguardian.com/business/boeing\">Boeing</a> Co expects more than 3,200 union workers at three St Louis-area plants that produce US fighter jets to strike afte",
      "Union leaders recommended approving the offer, but members overwhelmingly voted against it."
    ],
    "image_url": "https://i.guim.co.uk/img/media/2f9fb3fb43f73ebc528c4918b1c3fd96d52c62c9/429_0_4293_3435/master/4293.jpg?width=140&quality=85&auto=format&fit=max&s=e50020fbd2f0f5d3f12461e062b75ba3",
    "titles": [
      "Boeing fighter jet workers poised to strike after rejecting contract offer",
      "Boeing says thousands of union workers will likely go on strike after rejecting ‘the richest contract offer’ that would have upped wages by 20%"
    ],
    "score_components": {
      "magnitude": 0.79,
      "recency": 0.924,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary": "Boeing Co anticipates a strike from over 3,200 union workers at three St. Louis-area plants involved in producing U.S. fighter jets. This follows an overwhelming rejection of the company's offer by union members, despite union leaders recommending its approval.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the labor dispute at Boeing's St. Louis plants. It informs readers about the workers' rejection of the company's offer and the potential strike. However, it lacks depth or insight into the reasons for the dispute, the potential impacts, or possible solutions.",
    "image": {
      "src": "https://live.staticflickr.com/5187/5619120519_a35d8d3b37_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/573cc76c-1951-4943-a644-4479f1b2fd41/thumb/",
      "alt": "Large Fires in Northern Mexico",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "PM Carney to Announce Cost-Cutting Measures Amid US Trade Talks",
    "domain": "general",
    "location": "national",
    "published": "Mon, 28 Jul 2025 12:54:10 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Prime Minister's Office says in Mark Carney's itinerary that he will be announcing new measures to lower costs for Canadians, though does not provide more information.",
      "Prime Minister Mark Carney says Canada&#8217;s negotiations with the United States are in an &#8220;intense phase&#8221; after President Donald Trump announced a trade agreement with the European Union. Carney says that while there are similarities between the Canada&#8211;U.S. negotiations and thos"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/d9e46caba98a269f125269c14b5d3296ac05afc1dbd5e04f0fb6507b508a6758_d8e83a.jpg?quality=65&strip=all",
    "titles": [
      "Carney says talks with U.S. in ‘intense phase’ ahead of Aug. 1 deadline",
      "Carney says trade talks in ‘intense phase’ after Trump scores win with European Union"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.934,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.715,
    "summary": "Prime Minister Mark Carney is set to announce new measures aimed at reducing costs for Canadians, as confirmed by his office. Additionally, Carney revealed that Canada is currently in an \"intense phase\" of negotiations with the United States, following President Donald Trump's announcement of a trade agreement with the European Union. The details of the cost-reduction measures have not been provided.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the upcoming cost-cutting measures and the ongoing trade talks with the US. However, it does not provide details about the measures or the potential impacts of the trade talks, limiting the depth of understanding and actionable insights for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/65535/54594022547_e798997344_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1de5ed2f-18b8-4301-8dbb-8deaec09d283/thumb/",
      "alt": "Prime Minister Keir Starmer attends the G7 Summit in Canada",
      "credit": "UK Prime Minister / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "MLB Speedway Classic Sets Record with 85,000+ Tickets Sold",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 11:53:41 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "With more than 85,000 tickets sold, the MLB Speedway Classic between the Reds and Braves at Bristol Motor Speedway will break the single-game attendance record.",
      "MLB will host a special regular season game at Bristol Motor Speedway. When they do, it will set a new regular-season attendance record. Here's all the details"
    ],
    "image_url": "",
    "titles": [
      "MLB Speedway Classic to break attendance mark",
      "MLB Speedway Classic Will Set New MLB Regular Season Attendance Record"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.994,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.704,
    "summary": "The MLB Speedway Classic, featuring the Reds and Braves at Bristol Motor Speedway, has sold over 85,000 tickets, setting a new record for single-game attendance. This special regular season game marks a historic moment for MLB with its unprecedented crowd size.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a historic moment in MLB with its record-breaking crowd size. However, it lacks depth or insight into why this event was successful, how it was organized, or what impact it might have on future games.",
    "image": {
      "src": "https://live.staticflickr.com/7049/7027316319_048d38e898_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1e46776b-fcb6-4958-a5fc-232ed5ec0cf3/thumb/",
      "alt": "RED",
      "credit": "storebukkebruse / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cowboys' Rob Jones Out 2-3 Months with Neck Injury",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 11:53:41 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Cowboys guard Rob Jones will be out two to three months after breaking a bone in his neck Sunday at practice, sources told ESPN.",
      "Dallas Cowboys guard Rob Jones is expected to miss multiple months after breaking a bone in his neck Sunday."
    ],
    "image_url": "",
    "titles": [
      "Sources: Cowboys G Jones has broken neck bone",
      "Cowboys' Rob Jones breaks neck bone in training camp"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.994,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.702,
    "summary": "Dallas Cowboys guard Rob Jones suffered a neck injury during practice, breaking a bone. Sources indicate he will be out for two to three months. The team expects him to miss multiple months due to the injury.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant injury to a key player on the Dallas Cowboys. It provides useful information about the expected recovery timeline, but it does not delve into the potential impacts on the team's performance or how they plan to adjust their strategy.",
    "image": {
      "src": "https://live.staticflickr.com/67/226193738_f15afa71e0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/86cec092-7c35-4011-9715-a0da3608b89f/thumb/",
      "alt": "Cowboys",
      "credit": "literari / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Analyzing the Complex Impact of Trump's Trade Policy on the Economy",
    "domain": "business",
    "location": "global",
    "published": "Mon, 28 Jul 2025 04:00:08 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "No economy rises or falls for just one reason, even a shock as big as Trump’s trade policy",
      "No economy rises or falls for just one reason, even a shock as big as Trump's trade policy"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ffb002ce6-0c98-426e-a7fd-f091b471c761.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What the world got wrong about tariffs",
      "What the world got wrong about tariffs"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.776,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "The impact of Trump's trade policy on an economy is complex and multifaceted, with various factors contributing to its rise or fall. The outcome of an economy cannot be solely attributed to one single event, even a significant shock like changes in trade policies. The interconnected nature of economic systems means that multiple factors influence economic performance, making it challenging to pinpoint a single cause for fluctuations in an economy.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides a deep understanding of the complexity of economic systems and the multifaceted impacts of trade policies. It helps readers understand that an economy's performance cannot be attributed to a single event or policy, which is empowering knowledge. However, it does not report on solutions or improvements to the issues discussed.",
    "image": {
      "src": "https://live.staticflickr.com/5704/22429110291_7de1036f65_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/81f9ca0c-9592-4c9b-9db5-44947b7f88b0/thumb/",
      "alt": "NASA Analyzes Record-Breaking Hurricane Patricia",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Summer McIntosh Wins Second Gold at World Championships",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 08:44:31 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<p>Canada’s Summer McIntosh has won her second gold medal at the world swimming championships, taking the women’s 200-metre individual medley. Fellow Canadian Mary-Sophie Harvey won bronze.</p>",
      "Canada&#8217;s Summer McIntosh has won her second gold medal at the world swimming championships, taking the women’s 200-metre individual medley on Monday. The 18-year-old Toronto native touched the wall in two minutes, 6.69 seconds — nearly two seconds ahead of American Alex Walsh, who claimed silv"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/Summer.jpg",
    "titles": [
      "Canada’s McIntosh wins second gold at world swimming championships",
      "Canada’s Summer McIntosh wins second gold at world swimming championships"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.931,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "Summer McIntosh of Canada secured her second gold medal at the world swimming championships by winning the women's 200-metre individual medley. The 18-year-old from Toronto finished with a time of 2 minutes and 6.69 seconds, outpacing second-place finisher Alex Walsh of the USA by nearly two seconds. Canadian Mary-Sophie Harvey also performed well, earning the bronze medal in the same event.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story reports on the achievement of Summer McIntosh, which increases awareness about her performance at the world championships. However, it does not provide much context or insight into her training, strategies, or the significance of this win for her career or for Canadian swimming.",
    "image": {
      "src": "https://live.staticflickr.com/520/30765139183_62bb4e4667_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dccf4c8d-0b91-43f7-8362-3fc6207ad07d/thumb/",
      "alt": "canada",
      "credit": "PokemonaDeChroma / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Jayden Struble Signs Two-Year, $2.825M Contract with Team",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 13:04:18 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNT3pWcVlBQ0U5YWRRWmYwOGFKNEZhVXktanB4VHRsb25wR3l5ODVBWmU3WFZsRkgzVlNKb0dnRGJsa3NPeGJ2YmRLUWJyUEwxMmVNeXBNRTh0cjM2MURhN2VkeklRVndhZ0hSYkVoLUlCOWxqZEd0ZUlmNUhxdTMycFA0bWlXcm5OSXpCTg?oc=5\" target=\"_blank\">Two-year contract for Jayden Struble<",
      "<p>Defenceman Jayden Struble has signed a two-year, one-way contract worth $2.825-million ($1.4125 million in average annual value), the team announced Monday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Two-year contract for Jayden Struble - NHL.com",
      "Canadiens sign D Jayden Struble to two-year, $2.825-million contract"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.937,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary": "Defenceman Jayden Struble has signed a two-year, one-way contract with a value of $2.825 million. The contract has an average annual value of $1.4125 million. The announcement was made by the team on Monday.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a player's contract signing, but it does not provide deeper insights into the player's performance, the team's strategy, or the implications of this signing for the team or the league.",
    "image": {
      "src": "https://live.staticflickr.com/7073/7350058078_8d28aedce0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f62f1d55-abeb-401e-ac1f-7bace1931d44/thumb/",
      "alt": "Teacher of the Year",
      "credit": "USAG-Humphreys / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Newcastle in Early Talks to Sign Goalkeeper Aaron Ramsdale from Southampton",
    "domain": "general",
    "location": "global",
    "published": "Mon, 28 Jul 2025 14:12:34 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Newcastle have opened talks to sign England and Southampton goalkeeper Aaron Ramsdale but discussions remain at an early stage.",
      "Newcastle are in talks with Southampton over a move for goalkeeper Aaron Ramsdale."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1237/live/b86b0020-6bb8-11f0-82e5-136004252dd4.jpg",
    "titles": [
      "Newcastle open talks to sign Southampton's Ramsdale",
      "Newcastle in talks with Saints to sign Ramsdale"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.96,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary": "Newcastle is in early discussions to sign Aaron Ramsdale, the goalkeeper from Southampton and England. Talks are ongoing between Newcastle and Southampton regarding the potential transfer. The negotiations are still in the early stages, and no final decision has been reached yet.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the potential transfer of Aaron Ramsdale to Newcastle. However, it does not provide any deeper insights or implications of this potential move, such as how it might affect the team's performance or the player's career.",
    "image": {
      "src": "https://live.staticflickr.com/8349/8190875562_c2709a2aec_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/773e3e34-2a2a-4c5e-8af5-d6978e9fa2b0/thumb/",
      "alt": "Tor999, Chillingham Road, Heaton, Newcastle upon Tyne",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Lottie Woad Wins Women's Scottish Open in Pro Debut",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Jul 2025 12:31:52 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Two weeks ago, Lottie Woad was the world's No. 1 amateur. On Sunday, the 21-year-old Englishwoman became an LPGA Tour champion in her professional debut.",
      "<p>Lottie Woad tapped in one final birdie, plucked the ball out of the cup and gave a simple wave to the crowd as if she had done this before. The English star made it look easy on Sunday when she won the Women&#8217;s Scottish Open in her professional debut.</p>"
    ],
    "image_url": "",
    "titles": [
      "Woad, 21, wins Scottish Open in debut as pro",
      "Lottie Woad wins Women’s Scottish Open in her pro debut"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.611,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.625,
    "summary": "Lottie Woad, a 21-year-old English golfer, won the Women's Scottish Open in her professional debut, just two weeks after being ranked the world's No. 1 amateur. Her victory marks a seamless transition to professional golf, showcasing her readiness to compete at the highest level.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about Lottie Woad's impressive achievement in her professional debut, providing some context about her previous ranking and her readiness for professional golf. However, it could offer more insight into her journey, her preparation, or what this win means for her career.",
    "image": {
      "src": "https://live.staticflickr.com/2670/3701359595_f88f755b33_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/91086f5c-b0e1-4ce7-8a84-c450d2d7fd50/thumb/",
      "alt": "Scottish Open 2009",
      "credit": "Graeme Bird / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Canadian Dollar Predicted to Rise, Limited by Rate Cuts",
    "domain": "business",
    "location": "national",
    "published": "Mon, 28 Jul 2025 14:37:25 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Canada’s loonie will strengthen further against its US counterpart this year but its rise will be limited by the central bank’s interest-rate cuts, according to the currency’s most accurate forecaster in the second quarter."
    ],
    "image_url": "",
    "titles": [
      "Top Forecaster Sees Loonie’s Rise Tamed by Canada Rate Cuts"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 1.0
    },
    "score": 0.496,
    "summary": "The Canadian dollar, known as the loonie, is expected to increase in value against the US dollar throughout the year. However, this appreciation will be constrained by anticipated interest-rate cuts by Canada's central bank. This forecast was made by the most accurate currency predictor for the second quarter.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides empowering knowledge about the expected performance of the Canadian dollar, which can be useful for decision-making in various economic sectors. It also provides insight into the cause (interest rate cuts) and potential impacts of this trend.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51913289677_f7951de108_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e61d7b80-edba-4433-bf68-3b20ef933045/thumb/",
      "alt": "Constructing 'The Nest' apartment high rise",
      "credit": "Alan Light / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Comprehensive NFL Training Camp Coverage Across All 32 Teams",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 11:33:23 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Get insights on all 32 NFL training camps from our team of reporters in the field."
    ],
    "image_url": "",
    "titles": [
      "Latest news, buzz from all 32 NFL training camps: Giants QB Dart has strong practice"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.471,
    "summary": "Our team of reporters provides comprehensive insights from all 32 NFL training camps, delivering detailed updates and analyses on team preparations and player performances across the league. This coverage offers fans a thorough understanding of each team's current status and developments as the season approaches.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful and comprehensive information about the training camps of all 32 NFL teams, which can help readers understand the preparations and potential performance of each team in the upcoming season. However, it does not explicitly report on solutions, improvements, or innovations in the sport, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/7242/7256189200_ee4deecb1e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3d8f0570-b5b6-4e35-9803-5a7a5b4445a6/thumb/",
      "alt": "Team 'Our Robot System', Osterrath-Realschule (Rheda-Wiedenbrück)",
      "credit": "Zukunft durch Innovation / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Tariffs Surpass Initial 10% Baseline, Indicating Policy Shift",
    "domain": "business",
    "location": "national",
    "published": "Mon, 28 Jul 2025 15:50:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The figures are significant because they represent a major increase from the 10% baseline tariff Trump announced in April of this year."
    ],
    "image_url": "",
    "titles": [
      "Trump: Global baseline tariff will likely be 15% to 20%"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary": "The recent figures show a substantial rise in tariffs imposed by Trump, surpassing the initial 10% baseline announced in April. This increase is significant and indicates a notable shift in trade policy.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story offers useful information about a significant shift in trade policy, providing readers with a deeper understanding of the current economic situation. However, it doesn't report on potential solutions or impacts of this policy shift.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Summary_of_major_environmental-change_categories_expressed_as_a_percentage_change_%28red%29_relative_to_baseline_-_fcosc-01-615419-g001.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a5921c29-0f0e-47e8-a00a-cc97c976696c/thumb/",
      "alt": "Summary of major environmental-change categories expressed as a percentage change (red) relative to baseline - fcosc-01-615419-g001",
      "credit": "Corey J. A. Bradshaw; Paul R. Ehrlich; Andrew Beattie; et al. (13 January 2021). doi:10.3389/FCOSC.2020.615419 / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "New AI-Enhanced 3D Hologram Headset Mimics Real Vision",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 10:44:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Using 3D holograms polished by artificial intelligence, researchers introduce a lean, eyeglass-like 3D headset that they say is a significant step toward passing the \"Visual Turing Test.\""
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-leap-toward-lighter.jpg",
    "titles": [
      "New 3D headset uses holograms and AI to create lifelike mixed reality visuals"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary": "Researchers have developed a new 3D headset that resembles eyeglasses, utilizing 3D holograms enhanced by artificial intelligence. This innovation is considered a major advancement towards passing the \"Visual Turing Test,\" indicating a significant improvement in creating visually realistic 3D images.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution in the field of 3D imaging and artificial intelligence. It provides the reader with a deeper understanding of the progress made in this field, and the potential implications of such advancements.",
    "image": {
      "src": "https://live.staticflickr.com/65535/53456286479_bff0627ea1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8916ac68-9353-4532-86ec-e9b9c45227b4/thumb/",
      "alt": "New AI McTeam Associate",
      "credit": "Librarygroover / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gender Clinics Provide Multifaceted Support for Transgender Individuals",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 11:59:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Gender clinics provide multidisciplinary care that helps trans people to explore and affirm their gender identity."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/trans.jpg",
    "titles": [
      "Critics claim gender clinics are seeing an excess of trans boys. But new data suggest otherwise"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "Gender clinics offer comprehensive care to support transgender individuals in understanding and confirming their gender identity. These clinics provide a range of services and resources to assist individuals in their journey of self-discovery and affirmation. The multidisciplinary approach of these clinics aims to address the diverse needs of transgender individuals and help them navigate their gender identity with professional guidance and support.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights the progress made in providing comprehensive care for transgender individuals. It gives readers actionable insights into the services provided by gender clinics and their importance in supporting transgender individuals. It also increases awareness about the multidisciplinary approach required to address the diverse needs of the transgender community.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Gender_self-identification_around_the_world.svg",
      "thumbnail": "https://api.openverse.org/v1/images/57bb4972-b459-4079-b022-1f3f04a67a78/thumb/",
      "alt": "Gender self-identification around the world",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "ChatGPT can be a disaster for lawyers — Robin AI says it can fix that",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hello, and welcome to Decoder! I’m Jon Fortt — CNBC journalist, cohost of Closing Bell: Overtime, and creator of the Fortt Knox streaming series on LinkedIn. This is the last episode I’ll be guest-hosting for Nilay while he’s out on parental leave. We have an exciting crew who will take over for me "
    ],
    "image_url": "",
    "titles": [
      "ChatGPT can be a disaster for lawyers — Robin AI says it can fix that"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a solution to a potential problem. It provides actionable insights for lawyers who may be considering using AI in their work and informs them of an alternative that might be more suitable.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/UK_national_football_team_considering_compete_in_UEFA_Euro_and_FIFA_World_Cup_%E2%80%93_ChatGPT.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d42ef1c3-17e5-4cfb-bf47-cc4f88da54ab/thumb/",
      "alt": "UK national football team considering compete in UEFA Euro and FIFA World Cup – ChatGPT",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Tesla signs $16.5B deal with Samsung to make AI chips",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 15:32:25 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The deal for next-generation chips is a boon for Samsung."
    ],
    "image_url": "",
    "titles": [
      "Tesla signs $16.5B deal with Samsung to make AI chips"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about significant business developments in the tech industry, which could be useful for decision-making in various contexts. It also indirectly highlights trends in AI and electronics manufacturing. However, it doesn't explicitly focus on solutions, improvements, or empowering knowledge.",
    "image": {
      "src": "https://live.staticflickr.com/8593/16226096381_2e3bdcf1be_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/af73862d-3f88-468d-9786-8fdda127fe5d/thumb/",
      "alt": "Tesla Model X",
      "credit": "Don McCullough / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "20 national security experts urge Trump administration to restrict Nvidia H20 sales to China",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 15:29:44 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The letter states that allowing sales of the H20 AI chip to China could hurt the U.S.'s AI \"edge\" and further chip bottlenecks in the U.S."
    ],
    "image_url": "",
    "titles": [
      "20 national security experts urge Trump administration to restrict Nvidia H20 sales to China"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.443,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the geopolitical implications of technology sales, potentially aiding readers in understanding the complexities of international trade and national security. However, it doesn't provide solutions or progress, nor does it delve deeply into the systems or causes behind the issue.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Criticizes Putin Over Ukraine Aggression, Tensions Rise",
    "domain": "business",
    "location": "national",
    "published": "Mon, 28 Jul 2025 15:55:40 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump said he is \"disappointed\" in Russian President Vladimir Putin over his continued military aggression in Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Trump gives Russia less than two weeks to reach peace deal with Ukraine"
    ],
    "score_components": {
      "magnitude": 0.099,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.442,
    "summary": "President Donald Trump expressed disappointment in Russian President Vladimir Putin for ongoing military aggression in Ukraine. Trump's statement highlights tensions between the two countries. The situation underscores the complex relationship between the U.S. and Russia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the ongoing tensions between the U.S. and Russia, and it highlights a specific event that has contributed to these tensions. However, it does not provide actionable insights or discuss potential solutions to the problem.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Russian_President_Vladimir_Putin_headed_geese_flying_to_winter_%282012-09-06%29.jpeg",
      "thumbnail": "https://api.openverse.org/v1/images/3702819f-9081-43a0-a5aa-7ffd1f966a5a/thumb/",
      "alt": "Russian President Vladimir Putin headed geese flying to winter (2012-09-06)",
      "credit": "Пресс-служба Президента России / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Scientists Probe Elusive Neutrinos to Unravel Cosmic Mysteries",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 11:30:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Neutrinos are subatomic particles with no charge and very little mass that are known to weakly interact with other matter in the universe. Due to their weak interactions with other particles, these particles are notoriously difficult to detect."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/search-for-neutrinos-s.jpg",
    "titles": [
      "IceCube neutrino search sets first constraints on proton fraction of ultrahigh-energy cosmic rays"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Neutrinos are elusive subatomic particles with minimal mass and no charge, making them challenging to detect due to their weak interactions with matter. Scientists continue to study neutrinos to understand their role in the universe.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is informative and provides context about the study of neutrinos, a topic that might be obscure to many readers. However, it does not report on specific progress, solutions, or improvements in the field, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/4329/35947261675_0862fa8733_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/459578de-b7c0-43f9-89eb-de131a23fda6/thumb/",
      "alt": "Climate Scientist",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Carney Confirms Deep Trade Talks with US, Counters Trump's Remarks",
    "domain": "business",
    "location": "national",
    "published": "Mon, 28 Jul 2025 15:53:40 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Prime Minister Mark Carney said his government is still in deep trade talks with the Trump administration despite recent comments from the US president that suggested a deal with Canada wasn’t a priority."
    ],
    "image_url": "",
    "titles": [
      "Carney Says US-Canada Trade Negotiations at ‘Intense Phase’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary": "Prime Minister Mark Carney confirmed ongoing deep trade discussions with the Trump administration, countering President Trump's recent remarks that downplayed the urgency of a trade deal with Canada. The talks are part of efforts to negotiate terms beneficial to both nations, despite the perceived lack of priority from the US side.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the ongoing trade negotiations between two countries, which is useful for understanding the state of international relations and economic policy. However, it doesn't provide much detail about the potential impacts or solutions to the trade issues at hand.",
    "image": {
      "src": "https://live.staticflickr.com/21/28096036_7a7f2892c5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/54dc6803-3e6d-488f-873d-2cd0440008aa/thumb/",
      "alt": "US Flag",
      "credit": "ReneS / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ukraine Targets Russian Fleet in Black Sea, Disrupting Naval Operations",
    "domain": "business",
    "location": "global",
    "published": "2025-07-28T15:52:57Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Ukraine has relied on this innovative tactic to wreak havoc on Russia's Black Sea fleet, damaging or destroying a number of warships."
    ],
    "image_url": "https://i.insider.com/68878d973d5881a51c1e1681?format=jpeg",
    "titles": [
      "Russia's sinking fake ships with exploding naval drones. The training likely isn't for war with Ukraine."
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "Ukraine has employed an innovative tactic to target Russia's Black Sea fleet, causing damage to several warships. The tactic has been effective in disrupting Russian naval operations in the region. The situation highlights the ongoing tensions between the two countries and the strategic importance of the Black Sea.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing conflict between Ukraine and Russia, and the strategic importance of the Black Sea. However, it does not offer solutions or improvements, nor does it provide a deep understanding of the causes or impacts of the situation.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52063667405_d4bfa10372_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7682e85a-d3f5-42e8-9ed5-e52612fe114d/thumb/",
      "alt": "The cruiser 'Moskva.' Russian Navy photo",
      "credit": "manhhai / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Missing Persons Counts Drop as Communications Restore Post-Disasters",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 10:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The number of people reported missing after natural disasters often starts out shockingly high. But as communication systems are restored and records reconciled, those numbers typically drop dramatically."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/flood-3.jpg",
    "titles": [
      "Disaster experts explain high missing person counts following floods"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "After natural disasters, the initial high number of missing persons reported tends to decrease significantly as communication is restored and records are reconciled. This phenomenon is common and reflects the challenges in accurately tracking individuals during chaotic events.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it increases clarity around the system of tracking individuals during disaster events, and the impact of restored communications on the reported missing persons count. It provides useful context and insight, even though the topic is negative.",
    "image": {
      "src": "https://live.staticflickr.com/5827/22747301982_02bb3767bb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8a4944df-ffab-4736-a42e-99252da56c59/thumb/",
      "alt": "'Now I want to be a doctor' - Celina Kamanda, Ebola survivor in Freetown, Sierra Leone",
      "credit": "DFID - UK Department for International Development / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "A secretive space plane is set to launch and test quantum navigation technology",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 14:38:12 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "\"Testing this tech will be helpful for navigation in contested environments.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2017/05/3362935-1152x648.jpg",
    "titles": [
      "A secretive space plane is set to launch and test quantum navigation technology"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about advancements in space technology. However, it doesn't seem to focus on solutions, improvements, or attempts to solve problems, hence it doesn't score higher."
  },
  {
    "title": "Barnaby Joyce Stirs Debate on Australia's Net Zero Goal",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 11:57:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "One-time Nationals leader Barnaby Joyce sought to dominate the first sitting week of the current federal parliament by proposing a divisive plan to reverse Australia's net zero emissions target."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/1-australia.jpg",
    "titles": [
      "Barnaby Joyce wants Australia to abandon net zero—but his four central claims don't stack up"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "Former Nationals leader Barnaby Joyce aimed to take control during the first week of the current federal parliament by suggesting a controversial move to backtrack on Australia's net zero emissions goal. The proposal sparked debate and highlighted divisions within the government. Joyce's push for this change is ongoing, with discussions and negotiations expected to continue.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about Australia's net zero emissions goal and the political divisions surrounding it. It informs readers about the ongoing debate within the government, but it does not provide actionable insights or report on potential solutions to the issue.",
    "image": {
      "src": "https://live.staticflickr.com/3658/3462260137_2cd7c42444.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e45b7919-5d33-49ee-818e-45ddcb8a0699/thumb/",
      "alt": "Formal recognition of human rights?! In Australia?!",
      "credit": "moggs oceanlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Shows Credible Websites Also Spread Misinformation",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 11:54:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A growing body of research tracking the spread of misinformation online has largely focused on presumably false stories from unreliable sources—websites that fabricate content or intentionally mislead readers. But a recent study co-authored by researchers affiliated with the University of Maryland i"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/misinformation-spreade.jpg",
    "titles": [
      "How misinformation spreaders reframe news from reputable sources to support false claims"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "A recent study co-authored by researchers from the University of Maryland has expanded the focus on online misinformation, indicating that not only do unreliable sources contribute to its spread but also seemingly credible websites. This highlights a more complex landscape of misinformation online, challenging the notion that it originates solely from sources known for fabricating content or intentionally misleading readers.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the spread of misinformation online, highlighting that even credible sources can be involved. This increases reader awareness about the complexity of online misinformation, contributing to a deeper understanding of the issue.",
    "image": {
      "src": "https://live.staticflickr.com/5464/9282148023_04049332ec_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/52d0bf0c-2d74-488c-b37a-c0d2cdafb944/thumb/",
      "alt": "Nanjing University",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Giants' Training Camp Day 5: Productive Session with No Injuries",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 15:48:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A look at the sights and sounds from Day 5 of New York Giants training camp."
    ],
    "image_url": "",
    "titles": [
      "New York Giants training camp: Sights and sounds from Day 5"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "Day 5 of the New York Giants training camp featured a variety of activities, showcasing the team's ongoing preparations for the upcoming season. The event included rigorous practice sessions, strategy discussions, and team-building exercises, highlighting the players' and coaches' dedication to improving their performance. The day concluded without any reported injuries or incidents, indicating a successful and productive session for the Giants.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the New York Giants' training camp activities and progress, which could be valuable for fans and those interested in the team's performance. However, it does not provide deeper insights or awareness about broader trends, issues, or systems in the sport.",
    "image": {
      "src": "https://live.staticflickr.com/2553/4074710169_1f0fa7b432_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/65095640-537d-44de-84ab-259d5c88a762/thumb/",
      "alt": "Chang The Chinese Giant [c1870] Attribution Unk [RESTORED]",
      "credit": "ralphrepo / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Fermented meat with a side of maggots: A new look at the Neanderthal diet",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 14:48:17 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Researchers reconstruct ancient diets by studying stable nitrogen isotope ratios."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/maggots-1152x648.jpg",
    "titles": [
      "Fermented meat with a side of maggots: A new look at the Neanderthal diet"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.426,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of Neanderthal diets, contributing to our knowledge of human evolution. However, it doesn't necessarily give the reader actionable insights or report on progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/6003/6012918392_5f362aed17_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/eb229d6d-2265-4a9c-8678-37503300fc87/thumb/",
      "alt": "Fermentation/sljive/plums/rakija",
      "credit": "brankomaster / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Global Supply Chains Account for 70% of World Trade",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 11:00:12 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Global supply chains account for 70% of world trade. They are the arteries of global capitalism, moving goods and services across borders multiple times before reaching consumers."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/container-ship.jpg",
    "titles": [
      "How to reduce the hidden environmental costs of supply chains"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424,
    "summary": "Global supply chains, essential for the movement of goods and services, constitute 70% of world trade. These networks facilitate the international flow of products, often crossing borders multiple times before reaching consumers, and are fundamental to the functioning of global capitalism.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story provides basic awareness about the role of global supply chains in world trade, it doesn't delve into the implications, trends, or impacts of this fact. Therefore, it provides useful information but lacks depth and insight.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Share-global-food-emissions_%28OWID_1013%29.png",
      "thumbnail": "https://api.openverse.org/v1/images/33d8f238-c523-4e89-8fef-0771bad53c88/thumb/",
      "alt": "<div class='fn'> Share global food emissions</div>",
      "credit": "None / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Debt Negotiation Concludes, $10 Billion Agreement Reached",
    "domain": "business",
    "location": "global",
    "published": "Mon, 28 Jul 2025 10:14:30 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Agreement ends year of negotiations with creditors owed more than $10bn"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fff9e6288-87b7-4afc-81ed-e30332ce880c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Irish billionaire Paul Coulson strikes $300mn deal to walk away from Ardagh"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.883,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "After a year of negotiations, an agreement has been reached with creditors who are owed over $10 billion. The conclusion of the negotiations marks a significant milestone in resolving the debt issue.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the resolution of a significant debt issue, which can potentially impact a wide range of stakeholders. However, it doesn't provide much insight into the causes, impacts, or potential solutions to the broader issue of debt.",
    "image": {
      "src": "https://live.staticflickr.com/65535/47862071501_3952c0cd7f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2fc0978f-f061-4c1b-b5d0-0e004110008b/thumb/",
      "alt": "Chinese Vice Premier Liu He, right, arrives at the Office of the United States Trade Representative in Washington on 10th of May for trade talks. (Andrew Harnik/AP)",
      "credit": "quapan / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Anthropic Sued Over LLM Training Methods, Billions at Stake",
    "domain": "business",
    "location": "global",
    "published": "Mon, 28 Jul 2025 15:28:03 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The lawsuit centers on Anthropic’s use of books to train its LLM, Claude, and could leave the company on the hook for billions of dollars worth of damages."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2154161024.jpg?w=2048",
    "titles": [
      "A copyright lawsuit over pirated books could result in ‘business-ending’ damages for Anthropic"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Anthropic is facing a lawsuit over its use of books to train its LLM, Claude, which may result in the company being liable for billions in damages. The outcome of the lawsuit is pending, and the company's financial liability remains uncertain.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a lawsuit involving a company's training methods. However, it does not offer deeper insights into the implications of the lawsuit, the specifics of the training methods, or potential solutions.",
    "image": {
      "src": "https://live.staticflickr.com/3284/2899197879_5f4ef75fe0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/07805d2c-be30-48f6-b585-2376317cc42d/thumb/",
      "alt": "100 Billion Dollars",
      "credit": "Peat Bakke / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Neologisms Reflect Evolving American English",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 10:39:55 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "From \"yeet\" to \"social distancing,\" new words and phrases constantly emerge and evolve in American English. But how do these neologisms—newly coined terms—gain acceptance and become part of mainstream dialect?"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/hip-people.jpg",
    "titles": [
      "How new words enter our language: A linguistics expert explains"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "New words and phrases, known as neologisms, regularly enter American English, influenced by cultural, social, and technological changes. These terms gain acceptance and become mainstream as they are widely used and recognized across various platforms and contexts, reflecting the dynamic nature of language evolution.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is somewhat constructive. It provides awareness about the evolution of language and the influence of cultural, social, and technological changes. However, it doesn't provide actionable insights or report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/3881/14523936997_333c244d30_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/97016b28-8048-4aec-be20-f880f01020c5/thumb/",
      "alt": "McAninch Arts Center's Starlight Concert Series Featuring American English 2014",
      "credit": "COD Newsroom / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Liverpool Eyes Rodrygo, Explores Other Signings",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 10:36:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Liverpool are prioritizing a move for Real Madrid winger Rodrygo but have other options."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Liverpool eye Nusa, Fofana if Rodrygo move fails"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.41,
    "summary": "Liverpool is focusing on potentially signing Real Madrid's winger Rodrygo, but they are also considering other options. The club's transfer plans are being closely followed by Transfer Talk for the most recent updates on news, gossip, and rumors. The outcome of Liverpool's pursuit of Rodrygo or any alternative signings is currently pending.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides some awareness about Liverpool's transfer plans, but it lacks depth and insight. It doesn't offer any actionable insights or deeper understanding about the potential impact of these signings or the club's strategy.",
    "image": {
      "src": "https://live.staticflickr.com/2889/10849269065_36124d2431_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dab2fe41-3284-48c0-b1b7-cd776a4b7d9f/thumb/",
      "alt": "Armistice Service Liverpool 2013",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Avatar: Fire and Ash brings war to Pandora in first trailer",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T11:57:43-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The first trailer for Avatar: Fire and Ash is finally here, and it looks like James Cameron might have made another banger. Though Avatar: The Way of Water ended on hopeful note with Jake Sully (Sam Worthington), Neytiri (Zoe Saldaña), and their family finding a new home with a different group of Na"
    ],
    "image_url": "",
    "titles": [
      "Avatar: Fire and Ash brings war to Pandora in first trailer"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.388,
    "constructiveness_score": 0.2,
    "constructiveness_reason": "While this story might be of interest to fans of the Avatar franchise, it doesn't offer much in the way of actionable insights, understanding of broader systems or trends, or reports on progress or solutions. It primarily serves as an announcement or promotional piece.",
    "image": {
      "src": "https://live.staticflickr.com/4104/5045535250_32d6997943_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/33c3433d-7e4b-4b8f-89ed-1a67365b2eb6/thumb/",
      "alt": "Back of the Avatar Arch Card",
      "credit": "Aranami / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Flights grounded as Russia’s largest airline Aeroflot hacked and systems ‘destroyed’",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 13:33:35 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Russian prosecutor said it opened a criminal investigation into the cyberattack targeting Aeroflot, the largest airline in Russia."
    ],
    "image_url": "",
    "titles": [
      "Flights grounded as Russia’s largest airline Aeroflot hacked and systems ‘destroyed’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story raises awareness about the vulnerability of airline systems to hacking, it does not provide deeper understanding or actionable insights. It also doesn't report on any solutions or attempts to solve the problem.",
    "image": {
      "src": "https://live.staticflickr.com/5349/9345257093_889fb227be_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/982681b9-cdc9-4dd7-b9f9-657b33cb521b/thumb/",
      "alt": "In Flight",
      "credit": "Don McCullough / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Mario Kart World and other Switch 2 games are 10 percent off",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T10:19:31-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "I wasn’t expecting to see any deals on Switch 2 games for a while. Even though the console is currently much easier to find in stock, game discounts — especially ones on first-party Nintendo launch games — aren’t the norm. However, you can get 10 percent off on the likes of Mario Kart World, and [&#"
    ],
    "image_url": "",
    "titles": [
      "Mario Kart World and other Switch 2 games are 10 percent off"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.384,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a sale on video games, but it doesn't provide any deeper insight or understanding, nor does it report on progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/2382/2449697064_b066fb4755_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6424e4dd-d395-4fce-a0b5-b0a07aeaade4/thumb/",
      "alt": "Mario Kart World - iFest 2008",
      "credit": "deneyterrio / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]