[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for tasks to be automated by machines, such as self-driving cars and cleaning robots. While advanced humanoid robots may not be widely affordable, robot vacuums offer a more accessible option for automating household chores."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6958120408101851,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38395301020254624,
    "summary": "In today's technological age, machines are increasingly used for automation, including self-driving cars and cleaning robots. Although advanced humanoid robots remain expensive, robot vacuums provide a more accessible means for automating household tasks."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its first major sales event of 2025, the Big Spring Sale, which started recently and will continue until Monday, March 31st. This event features significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6457785853703704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37144464634259255,
    "summary": "Amazon's Big Spring Sale, its first major sales event of 2025, began recently and will run through March 31st. The event offers substantial discounts on a wide range of products, notably including gardening supplies and bedding."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced the existence of \"Switch 2 Edition\" games following its Nintendo Direct stream. This revelation was made on its website, detailing the new Virtual Game Card lending system."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6394147561574075,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3698536890393519,
    "summary": "Nintendo revealed \"Switch 2 Edition\" games and a new Virtual Game Card lending system on its website after a Nintendo Direct stream. This announcement was unexpected."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting several conservative podcasters for hours of access to senior Trump Administration officials. The event, aimed at engaging alternative media, is planned to be a recurring initiative to prioritize new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6170439551851852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3642609887962963,
    "summary": "On Thursday, the White House initiated Podcast Row, granting several conservative podcasters extensive access to senior officials from the Trump Administration. This event is designed to connect with alternative media and is intended to be a repeat initiative, emphasizing the administration's focus on new media outlets."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers, including its first color model, are being discounted. The Kindle Scribe, notable for its note-taking capability, is on sale at its lowest price ever for the 16GB version."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6084341226273149,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3621085306568287,
    "summary": "Amazon is offering discounts on several e-readers, including its first color model, as part of its Big Spring Sale. The Kindle Scribe, known for its note-taking feature, is available at its lowest price ever for the 16GB version."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission (FTC) have been directed by Bureau of Consumer Protection Director Christopher Mufarrige to stop describing the agency as \"independent\" in complaints, as revealed by an email reported by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5811078809722221,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3552769702430555,
    "summary": "Christopher Mufarrige, Director of the Bureau of Consumer Protection at the FTC, has instructed staff to cease referring to the agency as \"independent\" in complaints, according to an email disclosed by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian company, has released the Classic 2, an updated version of its original trackball mouse. The new model retains the same shape and ergonomics but features enhanced connectivity, a more accurate scroll wheel, and an improved design that simplifies 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5760063331712963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35400158329282405,
    "summary": "Ploopy, a Canadian firm, has launched the Classic 2, an upgraded trackball mouse. It keeps the original's design but offers better connectivity, a precise scroll wheel, and an easier-to-3D-print design."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features several dozen deals that are accessible without an Amazon Prime membership. Over 90 deals on popular gear, including affordable options, are highlighted in the main roundup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5492620024999999,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34731550062499994,
    "summary": "Amazon's Big Spring Sale is ongoing and concludes on March 31st. It offers numerous deals accessible to all customers, not just Amazon Prime members. The sale includes over 90 deals on popular items, featuring affordable options highlighted in the main roundup."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft announced it is creating a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises, with Tencent investing approximately $1.3 billion for a 25% stake. This values the new subsidiary at around $4.3 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5448900946064814,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3462225236516203,
    "summary": "Ubisoft is launching a subsidiary focused on its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six series, valued at $4.3 billion. Tencent is investing about $1.3 billion for a 25% share in this new venture."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on a variety of gadgets and gear, including Apple MacBooks. Apple's current MacBook lineup, equipped with its M-series chips, offers a diverse range of sizes and prices. The M1 MacBook Air has been discontinued."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.539799788923611,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3449499472309028,
    "summary": "Amazon's Big Spring Sale is currently happening, offering substantial discounts on numerous items, notably including Apple MacBooks. These MacBooks come with Apple's M-series chips and are available in various sizes and price points. Notably, the M1 MacBook Air model has been discontinued."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but stating they were unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's President described Trump's Arctic plans as \"serious,\" clarifying that they have no connection to Moscow's activities or interests in the region."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the imposition of tariffs by the Trump administration has altered Canada's relationship with the United States, potentially impacting future collaboration between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that tariffs introduced by the Trump administration have changed Canada's relationship with the United States, which could affect their future cooperation."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected JD Vance and his wife's involvement, following Donald Trump's vow to assert control over the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has declined involvement from JD Vance and his wife, following former President Donald Trump's pledge to establish control over the island."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order for his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children were among those killed in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were among the fatalities in a recent incident. Further details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was deported by the United States to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son after he was deported from the United States to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amidst challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The killer's initial request for parole was rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The murderer's first parole request was denied in Texas."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies have pledged to retaliate against Washington, with China specifically accusing the U.S. of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies, including China, have announced plans to retaliate against the United States, accusing it of violating international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case of Clare Nowland's death."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in relation to the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new technology has been developed with analysts suggesting that Russia likely played a role in its assistance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed, with analysts indicating that Russia likely provided assistance in its development."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist, was arrested during his coverage of protests in Istanbul and was later deported back to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The film, scheduled for release in May 2026, will feature Robert Downey Jr. in the role of Doctor Doom."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming film set for release in May 2026 will star Robert Downey Jr. as Doctor Doom."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was apprehended with the help of a local resident, as reported by the police."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on the remains of a toddler, as revealed in a recent update."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed when the child reported seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his home, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as reported by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Boualem Sansal, an 80-year-old individual, stated in an interview with a far-right news outlet that colonial France allocated an excessive amount of land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Boualem Sansal, an 80-year-old, claimed in an interview with a far-right news outlet that colonial France gave too much land to Algeria."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the deaths of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine, emphasizing the country's resilience amidst challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky highlighted Europe's backing for Ukraine, focusing on the nation's steadfastness in facing adversities."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local factors has made the government's attempt for re-election more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic issues is complicating the government's efforts to secure re-election."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban residents increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is growing as more wealthy, urban residents are spending more on their pets, particularly dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that the combination of strong winds, dry conditions, and pine trees significantly increases the risk of wildfires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts caution that the risk of wildfires is heightened due to strong winds, dry conditions, and the presence of pine trees."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed his willingness to spend an entire day playing golf with the US President if it would bring advantages to his nation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister stated he is open to spending a day playing golf with the US President, suggesting such an activity could benefit his country."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that allows individuals to view their family tree dynamically, illustrating ancestors' movements across the globe over time. This innovative approach, which transforms traditional static family trees into \"movies,\" can also be applied to model the spread of diseases and track animal migration patterns across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that transforms traditional, static family trees into dynamic \"movies,\" showing how ancestors moved around the world over time. This method can also model disease spread and track animal migration across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rain."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rain account for 60% of the unexpected difference in ocean temperatures around Antarctica over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals with Long COVID frequently experience feelings of being dismissed, disbelieved, and unsupported by their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that many people suffering from Long COVID often feel ignored, doubted, and unsupported by their medical professionals."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from varied precursor cells but also exhibit distinct gene regulation. This variation in gene regulation among skeletal cells may contribute to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that in vertebrates, skeletal cells from various body parts come from different precursor cells and have unique gene regulation. This diversity in gene regulation might help explain vertebrates' evolutionary success."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will help scientists counteract the misuse of science for political agendas by encouraging them to speak up."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends adding eugenics to college genetics curriculums. He argues this will aid in preventing the misuse of science for political purposes and encourage scientists to voice their concerns."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing soil samples from twelve parks in Dublin, Ireland, found that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study examining soil from twelve Dublin parks discovered higher concentrations of infective roundworm eggs at park entrances than in other park areas."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:20:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The tournament started with 68 teams, and after Thursday's games, only 12 teams remain in contention."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament began with 68 teams, and following Thursday's games, the field has narrowed to just 12 teams still competing."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech's place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored a crucial basket with 7.3 seconds left in overtime, helping Texas Tech to an 85-83 win over Arkansas. This victory, achieved after rallying from a 16-point deficit, advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased exceptional basketball skills during a game against Arizona, contributing significantly to a 100-93 victory with 30 points, 6 rebounds, 7 assists, and 3 blocks. This win propels the Blue Devils into the Elite Eight for the consecutive second season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg from Duke University played a pivotal role in their 100-93 win over Arizona, scoring 30 points, with 6 rebounds, 7 assists, and 3 blocks. This victory advances the Blue Devils to the Elite Eight for the second consecutive season."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers on Thursday. This shot is considered one of the most dramatic finishes in the NBA season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers on Thursday. This event is highlighted as one of the season's most dramatic finishes in the NBA."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not clearly state his future plans with the team following their Sweet 16 loss to Florida."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Maryland men's basketball coach Kevin Willard did not specify his future with the team after their loss to Florida in the Sweet 16."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU in the East Region semifinal. Mark Sears led the team in this achievement, breaking a 35-year-old record."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in the East Region semifinal. Mark Sears was the leading player in this achievement, surpassing a record that had stood for 35 years."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, failing to tie the game. This concluded the Astros' victory over the Mets with a final score of 3-1."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his debut game for the Mets, Juan Soto struck out during the ninth inning with two outs, missing the opportunity to tie the game. This resulted in the Astros defeating the Mets with a final score of 3-1."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, which was especially meaningful as he had been the subject of trade discussions during the offseason. His performance was celebrated by Cardinals fans, who gave him a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday amidst offseason trade discussions. His performance earned him a curtain call from Cardinals fans, highlighting his significance to the team and supporters."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million. He alleges that the NCAA and the university worked together to unfairly blame him, making him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims that the NCAA and the university conspired to unjustly make him the scapegoat."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders discuss the NBA's major awards, focusing on the MVP race between Nikola Jokic and Shai Gilgeous-Alexander, highlighting it as a key topic of interest."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are focusing on the MVP race, highlighting Nikola Jokic and Shai Gilgeous-Alexander as the main contenders. This topic has become a key point of interest in discussions about the league's major awards."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This basketball season has witnessed a record-breaking number of 3-point shot attempts, sparking discussions on whether there should be measures to limit the frequency of 3-pointers in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This basketball season has seen a record number of 3-point shot attempts, leading to debates about possibly introducing limits on 3-pointers in the league."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts are making predictions for the 2025 baseball season, including whether the Dodgers can win again and who might be named MVP."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts are predicting outcomes for the 2025 baseball season, focusing on the potential of the Dodgers to secure another win and speculating on possible MVP candidates."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This announcement indicates that regardless of a team's current status or expectations, there is support available for all teams aiming for success in 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "An announcement highlighted that support is available for all teams aiming for success in 2025, regardless of their current status or expectations."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings, with discussions on who takes the top spot among them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the latest Sweet 16 player rankings. There is ongoing discussion about who should be ranked as the top player among these athletes."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team in their pursuit of a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading figures for Notre Dame's basketball team, significantly contributing to the team's efforts towards winning a championship title."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical role, made his own selections for the first round of an unspecified event, presumably related to sports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, in a hypothetical scenario, made first-round selections for an unspecified sports-related event, demonstrating his choices in a theoretical context."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised concerns across college athletics, prompting worries about potential additional victims among athletes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concerns in college athletics, leading to fears there may be more victims among athletes."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1 have been highlighted, showcasing the top-performing players in each of Europe's major football leagues."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top scorers from Europe's major football leagues, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1, have been identified, spotlighting the leading players in each league based on their goal-scoring achievements."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona won against Osasuna 3-0, but coach Hansi Flick mentioned the victory came at a significant cost due to Dani Olmo's injury. The match was played on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona defeated Osasuna 3-0 in a match on Thursday. However, the victory was marred by an injury to Dani Olmo, as noted by coach Hansi Flick, who described the win as coming at a \"significant cost.\""
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced on Thursday that it is investigating alleged \"indecent conduct\" by four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, during a Champions League match at Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid, as announced on Thursday."
  },
  {
    "title": "Ronaldo to lead CONMEBOL anti-racism task force",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "CONMEBOL has appointed Ronaldo Nazario to head a new task force aimed at addressing racism and violence in South American soccer, as announced on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "CONMEBOL announced on Thursday that Ronaldo Nazario will lead a new task force focused on combating racism and violence in South American soccer."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, Bayer Leverkusen's coach, currently has no offers from other clubs, unlike the situation a year ago, indicating no immediate changes are expected regarding his future with the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, has not received any offers from other clubs, suggesting he will continue with the team as there are no signs of changes in his position."
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:41 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Qatar Sport Investment (QSI), which owns Paris Saint-Germain, is completing the acquisition of the Spanish football club Malaga, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is finalizing the purchase of the Spanish football club Malaga, as reported by ESPN through a source."
  },
  {
    "title": "Bompastor hails Chelsea's 'perfect night' in UWCL",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea's manager Sonia Bompastor described their night as \"perfect\" after the team came back from a 2-0 deficit against Manchester City, securing a place in their third consecutive Champions League semifinal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea's manager Sonia Bompastor praised her team's performance as \"perfect\" following their comeback from a 2-0 deficit against Manchester City, which secured their place in the Champions League semifinals for the third consecutive year."
  }
]