[
  {
    "title": "Sinclair to Air \"Jimmy Kimmel Live!\" Again, Nexstar Holds Out",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 18:30:54 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "Business Insider",
      "MarketWatch",
      "CNBC",
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com",
      "www.theguardian.com",
      "www.marketwatch.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Broadcast station owner Sinclair will begin airing \"Jimmy Kimmel Live!\" after three days of preempting the program since its return.",
      "<p>Announcement leaves Nexstar as the only TV station owner still preempting the late-night talkshow</p><p>Local TV conglomerate Sinclair Broadcast Group said its ABC-affiliate stations will start airing Jimmy Kimmy Live! again on Friday night, ending its preempting of the show.</p><p>Sinclair, alon",
      "The Sinclair suspension of Jimmy Kimmel’s late-night show prevented it from airing in Washington, D.C., Seattle and other popular markets.",
      "Sinclair agreed to air \"Jimmy Kimmel Live!\" on its ABC stations again. Rival broadcaster Nexstar still hasn't brought back Kimmel's show.",
      "Sinclair Broadcasting will air Jimmy Kimmel’s late-night talk show on its 38 ABC affiliate stations once again, the company announced, after Disney reinstated Kimmel from a suspension earlier this week. Along with fellow broadcast company Nexstar, Sinclair had suspended airing Kimmel’s show under pr",
      "Local-television giant Sinclair Inc. said Friday that it was ending its boycott of late-night host Jimmy Kimmel’s program on the company’s ABC affiliates, leaving Nexstar Media Group Inc. as the last remaining holdout."
    ],
    "image_url": "",
    "titles": [
      "Sinclair-owned ABC stations will bring 'Jimmy Kimmel Live' back to air Friday",
      "Sinclair ends boycott of Jimmy Kimmel Live! and will bring show back on air",
      "Sinclair’s 38 Stations Will Air ‘Jimmy Kimmel Live!’ After Boycott After Charlie Kirk Monologue",
      "Sinclair agrees to bring back 'Jimmy Kimmel Live!' to its ABC stations",
      "TV giant Sinclair is putting Jimmy Kimmel back on the air",
      "Sinclair ends boycott of Jimmy Kimmel show, putting pressure on Nexstar to bring program back"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.946,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.839,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sinclair Broadcast Group will resume airing \"Jimmy Kimmel Live!\" on its 38 ABC affiliate stations after a three-day suspension, leaving Nexstar as the only broadcaster still not airing the show. This decision follows Disney's reinstatement of Kimmel earlier in the week. Sinclair's suspension had affected major markets including Washington, D.C., and Seattle.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NYC Shooter Had Early-Stage CTE, Medical Examiner Confirms",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 19:03:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Business Insider",
      "Fortune",
      "CBS Sports",
      "Global News"
    ],
    "domains": [
      "www.businessinsider.com",
      "fortune.com",
      "www.cbssports.com",
      "globalnews.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The New York City chief medical examiner confirmed Tamura had low-stage CTE",
      "The 27-year-old gunman who shot and killed four people, and then himself, on July 28 in the New York City high-rise that includes the NFL office had CTE, a medical examiner said Friday, according to an NBC News report.",
      "A medical examiner confirmed Friday that Shane Tamura, who killed four people in July and blamed the NFL for hiding the dangers of brain injuries was suffering from CTE.",
      "The midtown Manhattan office shooter, Shane Tamura, left behind a note saying \"study brain for CTE.\"",
      "Shane Tamura showed evidence of early-stage degenerative brain disease tied to repeated blows to the head, according to New York City’s chief medical examiner."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/26/3f69f31d-46b9-464d-9ddb-1dfdb1f1cf67/nfl-logo-football-g.jpg",
    "titles": [
      "Shane Tamura, gunman who targeted NFL headquarters, had CTE, medical examiner says",
      "NYC shooter Shane Tamura, who targeted NFL office, had CTE, medical examiner says: Report",
      "Gunman who killed 4 at NFL offices had CTE, says medical examiner",
      "NYC office shooter who criticized NFL had CTE in his brain, medical examiner says",
      "NFL office shooter had low-level CTE, NYC medical examiner finds"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.977,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shane Tamura, the 27-year-old who killed four people and himself in a New York City high-rise on July 28, was confirmed by the chief medical examiner to have early-stage CTE. Tamura left a note urging his brain be studied for the condition, often linked to repeated head trauma. This finding was reported after he blamed the NFL for concealing the risks of brain injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chiefs' Fastest Receiver Worthy Returns for Ravens Game After Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 15:13:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.usatoday.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Xavier Worthy, the Chiefs' fastest receiver, is expected to play in Sunday's game against the Ravens after missing the past two games with a shoulder injury.",
      "Worthy has missed the Chiefs' last two games with a shoulder injury",
      "Kansas City's speedy second-year wide receiver has missed multiple games with a shoulder injury. Here's the latest on his status for Week 4.",
      "<p>The Kansas City Chiefs will get an ejection of energy for a big game in Week 4.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chiefs WR Worthy set to return Sunday vs. Ravens",
      "Xavier Worthy injury update: Chiefs WR expected to return vs. Ravens after full week of practice",
      "Is Xavier Worthy playing this week? Andy Reid gives update on Chiefs WR, per reports",
      "Chiefs’ Xavier Worthy expected to play vs. Ravens"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.98,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.81,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Xavier Worthy, the Kansas City Chiefs' fastest receiver, is set to return for Sunday's game against the Ravens after missing two games due to a shoulder injury. His comeback is expected to boost the team's performance in Week 4.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows to Continue Hamas War Amid Global Criticism at UN",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 10:24:31 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Al Jazeera",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.npr.org",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Israeli prime minister's speech was defiant, despite his growing international isolation over his refusal to end the devastating war to eradicate Hamas.",
      "The Israeli leader rails against critics and denounces Western allies for recognising Palestine in fiery UN address.",
      "<p>Israeli prime minister said recognition of Palestinian state is ‘insane’ days after countries such as UK and France did so</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/26/israeli-loudspeakers-broadcast-netanyahu-speech-to-un-gaza\">Israeli loudspeakers broadcast Netanyahu’s sp",
      "UNITED NATIONS (AP) — Encircled by critics and protesters at the United Nations, Israeli Prime Minister Benjamin Netanyahu told fellow world leaders on Friday that his nation “must finish the job” against Hamas in Gaza, giving a defiant speech despite growing international isolation over his refusal"
    ],
    "image_url": "",
    "titles": [
      "At U.N., amid jeers and cheers, Netanyahu says Israel 'must finish the job' in Gaza",
      "As delegates walk out, Netanyahu tells UN Israel must ‘finish job’ in Gaza",
      "Netanyahu vows to ‘finish job’ in Gaza during UN speech as delegates walk out",
      "Facing global isolation at UN, a defiant Netanyahu says Israel ‘must finish the job’ against Hamas"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.887,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.792,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Benjamin Netanyahu delivered a defiant speech at the United Nations, insisting on continuing the war against Hamas despite international isolation and criticism, including from Western allies who have recognized Palestinian statehood. His remarks followed actions by countries like the UK and France in recognizing Palestine, which led to protests and walkouts during his address. Netanyahu's stance has drawn accusations of war crimes and increased pressure to end the conflict, amidst reports of Palestinians living in poverty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fugitive Assata Shakur Dies in Cuba at 78",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 19:40:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Fortune",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "fortune.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The fugitive revolutionary spent decades in exile after escaping from a US jail in 1979.",
      "Assata Shakur had lived in exile in Cuba since 1979, after escaping a prison sentence for killing a police officer.",
      "<p>Shakur spent decades exiled after she was convicted of killing a state trooper in 1977 and escaped from prison</p><p>On 25 September, Assata Shakur, a former member of the Black Liberation Army, died aged 78 in Havana, Cuba, according to <a href=\"https://cubaminrex.cu/es/nota-de-prensa-del-minist",
      "Public Enemy's 1988 song “Rebel Without a Pause\" includes the lyrics “supporter of Chesimard,” referring to the legal name of the longtime FBI Most Wanted."
    ],
    "image_url": "",
    "titles": [
      "Assata Shakur, US Black liberation activist exiled in Cuba, dies at 78",
      "Assata Shakur: Fugitive Black activist dies in exile in Cuba",
      "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
      "Assata Shakur, fugitive Black militant and godmother to Tupac, dies in Cuba"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.99,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Assata Shakur, a fugitive and former member of the Black Liberation Army who was convicted of killing a state trooper in 1977 and escaped from a US jail in 1979, has died at the age of 78 in Havana, Cuba. Shakur, also known by her legal name Chesimard and mentioned in Public Enemy's 1988 song \"Rebel Without a Pause,\" spent decades in exile after fleeing to Cuba.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Director Comey Indicted for False Statements, Obstruction",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 07:12:03 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Ex-FBI Director James Comey indicted on criminal charges after Trump pressured the DOJ to investigate. And, Defense Secretary Pete Hegseth calls unusual meeting of top military commanders.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5xbUxMdkxzOUNVRkF5UEtQU0hxb1p6UnJBTnVFLVZINGRRQjlHLVlBTkRlWEdOT2JucW1yZzdGcWFYUWp3REIyVUF5dEtVQV9vUi1RV2szNUxFT3lGenhhaHY3cVpVQVJXQmZ4bGZCMWFDYnZrVXAzWGh6dGZ2NlU?oc=5\" target=\"_blank\">Former FBI director James Comey indicted</a>&nbsp;&nbsp;",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5uWmNkeTh6bko1VlN5ejdWM255Q3cxajNQMFJKbDhCTkN0UnlBTXhHRHlvWWZvRWVqZEpjZVVMUGxxbEtSekF0UkdsYUtJSE9IVFNNeVBtUmFpVDJQMUdxTUVaNE1Sd0phVjk5RzFmekZQdndDaG9oN2pOOGc0Zw?oc=5\" target=\"_blank\">Read: Former FBI chief Comey indicted on two charges</a>&",
      "The former FBI director has been indicted on charges of making a false statement and obstruction related to his testimony before the Senate Judiciary Committee in 2020.",
      "President Donald Trump gloated about the filing of criminal charges against James Comey, whom he fired as FBI director in 2017, in his first White House term."
    ],
    "image_url": "",
    "titles": [
      "Ex-FBI Director Comey has been indicted. And, Hegseth summons military leaders",
      "Former FBI director James Comey indicted - Axios",
      "Read: Former FBI chief Comey indicted on two charges - Axios",
      "WATCH:  Former FBI Director James Comey reacts to indictment",
      "Former FBI Director James Comey indicted after Trump called for charges"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.829,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey has been indicted by a federal grand jury on charges of making false statements and obstruction of justice. These charges are connected to his actions while investigating the Trump 2016 presidential campaign's potential collusion with Russia. President Donald Trump, who fired Comey in 2017, publicly expressed satisfaction over the indictment. The current status is that Comey faces legal proceedings for the accusations against him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Delegates Walk Out During Netanyahu's Speech, Canada's Rae Stays Seated",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 16:41:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Officials and diplomats left the auditorium in protest as the Israeli leader took the stage, leaving large parts of the hall empty.",
      "Israel's prime minister said it would be \"madness\" for Israel to allow a Palestinian state to be established. Many delegates left the room before Benjamin Netanyahu began his speech. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5wc3FGUWtTdktZTEg4SUxEX05uUnZJazdUTHdWLS1vVkRmOWgzbF9zV1lTNlFiU3dUbTk3bDU1WXFINnZlUzZMVXN0TjNlVDV0Smp1WGp2ZlQyRWdMOG1SVnVXV1p5WGJjN1lkaU1WRnROZ1ROZThRZA?oc=5\" target=\"_blank\">Netanyahu faces mass walk-out protest at UN speech</a>&nbsp;&nbsp",
      "A Palestinian state would be “national suicide” for Israel, Prime Minister Benjamin Netanyahu said, but many of the diplomats and leaders at the assembly boycotted his remarks."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f87e/live/39823af0-9af0-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Netanyahu attacks Palestinian recognition as dozens walk out of UN speech",
      "UNGA: Netanyahu rejects Palestinian state in fiery speech",
      "Netanyahu faces mass walk-out protest at UN speech - Axios",
      "Defiant Netanyahu Denounces Palestine Recognition, to a Mostly Empty U.N. Hall"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.911,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During Israeli Prime Minister Benjamin Netanyahu's speech at the UN General Assembly, a significant number of UN delegates walked out in protest. However, Canada's Ambassador Bob Rae did not participate in the walkout and remained seated throughout Netanyahu's address.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots' DC Terrell Williams Diagnosed With Prostate Cancer",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 14:58:49 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Patriots first-year defensive coordinator Terrell Williams has been diagnosed with prostate cancer.",
      "Williams had previously stepped away from the team ahead of their Week 2 game",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQbkpoRmFMMzdNX1lSM1c4NWVla0hrdlZMZWZudDhsbkNvR3puVmZjYWR1dTE1X0VqX3hlT2RRS2RobmF6RUticFJ6ZkZjZDVsMGJTSVN4X3hUTkdVSFQ1LVVCel9zckN6NnYtSElyT2lsenpiSTB4dTVXRGtwbG14VHZqczV5ZVdxTFdkbG5VVW8tNVhBeVFSYw?oc=5\" target=\"_blank\">Former Lions Defensiv"
    ],
    "image_url": "",
    "titles": [
      "Pats DC Williams diagnosed with prostate cancer",
      "Patriots defensive coordinator Terrell Williams diagnosed with prostate cancer: 'He's been through a lot'",
      "Former Lions Defensive Line Coach Diagnosed With Prostate Cancer - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Patriots defensive coordinator Terrell Williams, in his first year with the team, has been diagnosed with prostate cancer. He had taken a leave of absence starting before their Week 2 game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadian Postal Workers Strike Over Government's Cost-Cutting Measures",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 16:49:57 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Union says it’s ‘outraged and appalled’ by government’s order of sweeping changes to the national service</p><p>Postal workers in <a href=\"https://www.theguardian.com/world/canada\">Canada</a> have gone on strike after the government warned of an “existential crisis” and ordered sweeping changes t",
      "Canada Post is on pace to lose $1 billion this year, officials say. The Canadian Union of Postal Workers says it was blindsided by cost-cutting measures.",
      "The government’s previous attempts at postal service cuts were politically unpopular, but Canada Post’s dire financial situation has expedited them."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d2b176ab3d7d3994bc3ae61afc7ec2ed9ac9ad1f/174_0_2654_2124/master/2654.jpg?width=140&quality=85&auto=format&fit=max&s=a0ac1a369de36f1937a15e64fce6c14a",
    "titles": [
      "Canada postal workers strike after government orders end to door-to-door delivery",
      "Canada Post to end home delivery; workers declare national strike",
      "Canada Orders Postal Service to End Door-to-Door Mail Delivery"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Postal workers in Canada have gone on strike following the government's announcement of major changes to the national postal service, citing an \"existential crisis.\" The Canadian Union of Postal Workers expressed shock and outrage at the cost-cutting measures introduced in response to Canada Post's projected $1 billion loss this year. Previous efforts to reduce postal service costs were unpopular, but the current financial challenges have made such measures more urgent.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hackers Threaten to Leak Data of Nursery Children and Staff at Kido Internationa",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 19:28:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The criminals say they will share 30 more profiles along with 100 employees' data if a ransom is not paid.",
      "<p>Criminals calling themselves Radiant say they will post additional private data online unless they are paid</p><p>Hackers with pictures and the private information of thousands of nursery children have threatened to publish more information online unless they are paid.</p><p>Criminals calling the",
      "Kido International, which runs nursery schools, reported the incident to the authorities after hackers posted sensitive data on the dark web and demanded a ransom."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2273/live/808869a0-9abf-11f0-b832-7b9888705b9b.jpg",
    "titles": [
      "Nursery hackers threaten to publish more children's profiles online",
      "Kido nursery hackers threaten to publish more children’s profiles",
      "Hackers Steal Children’s Data and Photos from U.K. Nursery Chain"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hackers, identifying as Radiant, have threatened to release private data of thousands of nursery children and 100 employees from Kido International unless a ransom is paid. The group has already posted sensitive information on the dark web. Kido International has reported the incident to the authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terrorism Charges Against Rapper Liam Óg Dismissed Due to Filing Error",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 12:21:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The case against Liam  Óg Ó hAnnaidh is thrown out following a technical error in the way the charge against him was brought.",
      "Kneecap has generated widespread attention for its solidarity with Palestinians. Liam O'Hanna was facing terrorism charges after waving a flag of the Lebanese militant group Hezbollah during a London concert in 2024.",
      "<p>Chief magistrate at Woolwich crown court rules that charge brought against musician is unlawful and ‘null’</p><p>A terrorism charge against the Kneecap rapper Liam Óg Ó hAnnaidh has been thrown out by the chief magistrate due to a technical error.</p><p>Ó hAnnaidh had been charged with a terroris"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0e0e/live/17ad3130-9ac0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Terror case against Kneecap rapper thrown out",
      "Kneecap: UK throws out terror case against rap group member",
      "Terrorism case against Kneecap rapper Liam Óg Ó hAnnaidh thrown out"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.832,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The terrorism charges against Kneecap rapper Liam Óg Ó hAnnaidh were dismissed by the chief magistrate at Woolwich Crown Court due to a technical error in the filing process, rendering the charge unlawful and 'null'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadiens' Reinbacher Out for 4 Weeks with Fractured Hand Bone",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 26 Sep 2025 19:37:37 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The team said Reinbacher has a fractured metacarpal bone, one of the five long bones forming the palm of the hand.",
      "<p>Defenceman David Reinbacher is out four weeks after sustaining a broken hand, the Montreal Canadiens announced on Friday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/c3f0daa5947e0d7e82189fe858b0627537754e63a4a335b616501635730a212f-e1758915426323.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens defenceman Reinbacher out four weeks with broken hand",
      "Canadiens’ David Reinbacher out four weeks with broken hand"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Montreal Canadiens' defenceman David Reinbacher will be sidelined for four weeks due to a fractured metacarpal bone in his hand. The team confirmed the injury, which is one of the five long bones in the palm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Health Leaders Disappointed by RFK Jr.'s Stance on NCD Initiative",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 13:03:10 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Global health leaders expressed dismay at Kennedy's objection but vowed to move forward without the support of the U.S.",
      "<p>General assembly backs new targets on cancer, diabetes and heart disease but Robert F Kennedy Jr objects</p><p>A new vision for tackling the global noncommunicable diseases (NCDs) crisis has failed to reach consensus at the UN after the <a href=\"https://healthpolicy-watch.news/un-declaration-on-n"
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. 'rejects' a U.N. declaration on non-communicable diseases",
      "US refuses to back UN declaration on noncommunicable diseases"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.697,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Global health leaders were disappointed by Robert F. Kennedy Jr.'s opposition to a UN plan aimed at addressing noncommunicable diseases (NCDs) like cancer, diabetes, and heart disease. Despite his objection, the general assembly supported new targets for tackling these illnesses. The initiative will proceed without unanimous consensus.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: initiative, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Al Jazeera's Gasiorowska, Experts Analyze Ryder Cup Challenges, Advisor Pay Mode",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 10:02:14 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sports Illustrated",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Donald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.",
      "Al Jazeera’s Joanna Gasiorowska explains the Ryder Cup.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5sNXZPeV9kZlAxV09RanNWX2xZam9saG5iM3BoZ3pLQVFmWTJvN3lteXBrOUdVb0VzWnNMc1ZOak4wRkhqOTdzamJZQVZKcDJCbUJKY3dEV1dqcXhBc2lBTVlHcmZ0WlJTOTAwdVh2b204d0w3MjJXU3FXT0Y?oc=5\" target=\"_blank\">SI:AM | Everything You Need to Know About the 2025 Ryder Cup"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6a0c/live/dcbf1430-9aba-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Is the US-China TikTok deal done? Here's what you need to know",
      "What you need to know about the Ryder Cup",
      "SI:AM | Everything You Need to Know About the 2025 Ryder Cup - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.793,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Joanna Gasiorowska of Al Jazeera, along with Adam Stanley and Brad Faxon, discuss the Ryder Cup, focusing on the unique challenges of the Bethpage Black Golf Course for Team USA and Team Europe. Additionally, the article outlines various compensation models for financial advisors, highlighting their advantages and disadvantages for consumers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Schottenheimer Meets Hall of Famer Staubach During Press Conference",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 15:50:42 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "It was the first interaction Schottenheimer, who was named head coach on Jan. 24, has had with the Hall of Fame quarterback.",
      "Schottenheimer met Staubach for the first time after \"Captain Comeback\" interrupted his Friday presser"
    ],
    "image_url": "",
    "titles": [
      "'I'm pulling for you': Roger Staubach surprises Brian Schottenheimer at news conference",
      "Hall of Fame QB Roger Staubach professes 'love' for Cowboys, calls Brian Schottenheimer his 'favorite coach'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Schottenheimer, appointed head coach on January 24, met Hall of Fame quarterback Staubach for the first time when Staubach interrupted his press conference on Friday. This marked their first interaction.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU to Build Drone Wall on East Border, Backs €140bn Ukraine Loan",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 17:10:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Announcement comes after European bloc blamed Russia for violating Polish airspace in drone incursion this month.",
      "<p>Ministers aim to bolster defences after spate of airspace violations, amid rising momentum for €140bn loan to Ukraine</p><p>The EU has agreed to move forward with plans for a drone wall at the heart of its eastern defences as momentum grows for a €140bn loan to Ukraine based on Russian frozen ass"
    ],
    "image_url": "",
    "titles": [
      "EU to develop ‘drone wall’ amid regional airspace violations",
      "EU to move forward with plans for drone wall amid Russian incursions"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The EU plans to establish a drone wall to strengthen its eastern defenses following a series of airspace violations, including a recent one blamed on Russia in Polish airspace. This decision coincides with growing support for a €140bn loan to Ukraine, funded by frozen Russian assets.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Opposes West Bank Annexation by Israel",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 22:51:40 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5xZkgzaURWUUR4SzA0dVpWenFadHFkTWdFQ21UZ2xubmJ3eUFIY3Brc2VlcjlVeTVTRTFMTFJZYU03VDUyM1VLRElGU2VvYXpXS2RObHFsUmFDMWctVVp5YUZtWWpGRWlxZmFhSUo5aENoOTN4WWlsMjRiZw?oc=5\" target=\"_blank\">Trump says he won't let Netanyahu annex the West Bank</a>&nbs",
      "<p>British officials said they feared Trump would recognise Israeli control over the West Bank in retaliation for the UK, Australia, France and others recognising Palestine</p><p>Donald Trump has said he will not allow Israel to annex the occupied West Bank, rejecting calls from some far-right polit",
      "After more countries recognized a Palestinian state this week, President Trump said on Thursday that he would not permit Israel to take over the territory."
    ],
    "image_url": "",
    "titles": [
      "Trump says he won't let Netanyahu annex the West Bank - Axios",
      "Trump says he ‘will not allow’ Israel to annex West Bank after lobbying from allies",
      "Trump Says He Won’t Allow Israel to Annex the West Bank"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.628,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump announced he will not allow the annexation of the West Bank by Israel, despite several Israeli ministers advocating for it. This statement follows the recognition of a Palestinian state by more countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Commanders' Daniels, McLaurin Out for Sunday's Game Against Falcons",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 12:55:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Commanders will be minus QB Jayden Daniels and WR Terry McLaurin for Sunday's game in Atlanta.",
      "<p>The Washington Commanders will be without offensive star players Jayden Daniels and Terry McLaurin against the Atlanta Falcons on Sunday, coach Dan Quinn said.</p>"
    ],
    "image_url": "",
    "titles": [
      "Daniels, McLaurin both ruled out for Falcons game",
      "Commanders rule out QB Daniels, WR McLaurin ahead of game vs. Falcons"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Washington Commanders will not have quarterback Jayden Daniels and wide receiver Terry McLaurin available for their game against the Atlanta Falcons on Sunday, as confirmed by coach Dan Quinn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wilks Responds to Mayfield's 'Personal' Game Comments After 5 Days",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 11:46:34 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jets DC Steve Wilks had five days to mull a response to Baker Mayfield's postgame jab, and his reply didn't disappoint. Mayfield had called out Wilks, saying the Bucs' win was personal because \"their D-coordinator was the one that cut me in Carolina.\"",
      "Mayfield said the Bucs' win over the Jets was 'personal' because of his history with Wilks"
    ],
    "image_url": "",
    "titles": [
      "Wilks jabs Baker back for 'cut me in Carolina' take",
      "Steve Wilks jabs at Baker Mayfield after 'cut me in Carolina' comment: 'I don't think an interim has much say'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jets Defensive Coordinator Steve Wilks responded to Baker Mayfield's postgame comments, which highlighted the Buccaneers' win over the Jets as 'personal' due to Mayfield being cut by Wilks in Carolina. Wilks took five days to reply to Mayfield's jab, aiming to address the situation directly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk, Thiel, Bannon Named in Event Document; Musk Declined Invitation",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 18:00:31 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "Axios"
    ],
    "domains": [
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOWnljQzJ2czNBZjBYNGtWTFdOd0c5N2QtSnpFZzVZNDZ2cDZ3dlhJTVllY3pQbHlCbktVaW43Y1ljQVA2VEhXNExOTVpjVkhtNkk5dU1HOWt1M2Q1WVJCVXBzVDFzM0tEaDNKZ2hkWGRJVEJQWXF0c1lPbFBCTEdCUnpEX3BDSHlG?oc=5\" target=\"_blank\">Elon Musk, Peter Thiel and Steve Bannon nam",
      "\"Reminder: Elon Musk to island Dec. 6 (is this still happening?)\" one scheduling note reads. The Tesla executive previously said he declined invites."
    ],
    "image_url": "",
    "titles": [
      "Elon Musk, Peter Thiel and Steve Bannon named in Epstein files released by Democrats - Axios",
      "Newly released Epstein documents include mention of Elon Musk, Bill Gates, Peter Thiel, and Steve Bannon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elon Musk, along with Peter Thiel and Steve Bannon, were named in a document related to a scheduled event on an island on December 6. However, Musk, the Tesla executive, has previously stated that he declined invitations to such events.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Electrons Travel Underground, Linking Chemical Zones for Ecosystem Health",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 07:26:22 EDT",
    "source": "ScienceDaily",
    "sources": [
      "Phys.org",
      "ScienceDaily"
    ],
    "domains": [
      "phys.org",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Electrons flow underground in ways far more extensive than once believed, forming networks that link distant chemical zones. Minerals, organic molecules, and specialized bacteria can act as bridges, creating long-distance electron highways. These discoveries hold promise for pollution cleanup strate",
      "Beneath our feet, an invisible world of electron exchanges quietly drives the chemistry that sustains ecosystems, controls water quality, and even determines the fate of pollutants."
    ],
    "image_url": "",
    "titles": [
      "Hidden “electron highways” beneath our feet could revolutionize pollution cleanup",
      "Study reveals hidden 'electron highways' that power underground chemistry and pollution cleanup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers have discovered that electrons can travel underground over long distances, connecting separate chemical zones through networks formed by minerals, organic molecules, and bacteria. This process, crucial for ecosystem sustainability, water quality, and pollutant degradation, suggests new methods for environmental cleanup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Settles for $2.5B Over Prime Subscription Deception Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 00:47:16 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOVHZfNFRhbnRJcUdkQUViQWlta041LWJOYVpnYjA1SUlhMU5yNVFaRl9tR09sSTkxXzZ3S1JqeGVkZlA5Y2tnTzVXZFdpNnFPV01iaFBEV1B2Vms2Smd1YUhjX085a3F1QVljQ0o5eGdrakt0cUJjQlFMMGNiYkk3bzBXdW1YUQ?oc=5\" target=\"_blank\">How to get a refund from the Amazon Prime FTC",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTFA1WXVkbk5XT0tOa2t6cUJkMHlUR1ZfVENEZmpkNWtVQ21QU19JRnRoYmFQdHRLNzFOaUxVdWRwaHNXUGZBcTZUZjUtODNCZzlMTzBrejZTdEVzRWxnSjZWWmV4b0I5RFVUNm5WRw?oc=5\" target=\"_blank\">Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit</a>&nbsp;&nbsp;<f",
      "Amazon's $2.5 billion settlement with the FTC over alleged unfair Prime signup and cancellation practices has important implications for every subscription marketer."
    ],
    "image_url": "",
    "titles": [
      "How to get a refund from the Amazon Prime FTC settlement - Axios",
      "Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit - Axios",
      "Amazon’s $2.5 Billion FTC Settlement Rattles Subscription Marketers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.654,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon has agreed to a $2.5 billion settlement with federal regulators over allegations of deceptive web designs that tricked millions into unwanted Prime subscriptions and made cancellation difficult. The settlement includes a $1 billion civil penalty and $1.5 billion in consumer refunds for the estimated 35 million affected. The FTC accused Amazon of using \"dark patterns\" for auto-renewals and a complex cancellation process. This resolution follows a lawsuit and a Business Insider investigation into Amazon Prime's practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025-2026 DWU Challenges: High School Engineering, Middle School Aviation",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 26 Sep 2025 16:31:42 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "2025-2026 DWU: High School Engineering Challenge Challenge Materials Challenge Materials The 2025 Challenge Materials are coming soon. Register now to get copies as soon as they are released. Overview: What is an Uncrewed Aircraft System?&#160; An uncrewed aircraft system (UAS) can be defined as an ",
      "2025-2026 DWU: Middle School Aviation Challenge Challenge Theme AgAir: Integrating UAS into the Agriculture Industry The agricultural industry is an important part of life in the US and around the world by providing food, fuel, economic development, and more. It has been increasingly important to st"
    ],
    "image_url": "",
    "titles": [
      "2025-2026 DWU: High School Engineering Challenge",
      "2025-2026 DWU: Middle School Aviation Challenge"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.927,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.463,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2025-2026 DWU High School and Middle School Challenges focus on engineering and aviation, respectively. The High School Engineering Challenge materials are pending release, urging early registration. The theme for the Middle School Aviation Challenge is \"AgAir: Integrating UAS into the Agriculture Industry,\" highlighting the significance of uncrewed aircraft systems (UAS) in agriculture for food, fuel, and economic development. Participants are encouraged to explore the impact of UAS technology in the agricultural sector.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Studies Shed Light on Bigscale Pomfret and Gaslighting Mechanisms",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 13:12:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/what-is-the-bigscale-pomfret-scientists-unravel-secrets-of-an-oceanic-enigma/\" rel=\"nofollow\" title=\"What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma\"><img alt=\"Big Scale Pomfret\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"512\"",
      "<a href=\"https://scitechdaily.com/scientists-unravel-secrets-of-how-gaslighting-really-works/\" rel=\"nofollow\" title=\"Scientists Unravel Secrets of How Gaslighting Really Works\"><img alt=\"Marriage Problems Boyfriend Girlfriend Arguing\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma",
      "Scientists Unravel Secrets of How Gaslighting Really Works"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.865,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have conducted studies on the Bigscale Pomfret, revealing new insights into this oceanic species. In separate research, experts have also uncovered the mechanisms behind gaslighting, offering a deeper understanding of this psychological manipulation technique. Both studies contribute to our knowledge of marine biology and human behavior, respectively.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  }
]