[
  {
    "title": "Super Typhoon Ragasa Kills 21, Causes Widespread Damage in Asia",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 24 Sep 2025 04:57:28 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "New York Times",
      "Washington Post",
      "BBC",
      "NPR"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Typhoon Ragasa whipped waves taller than lampposts onto Hong Kong promenades and turned seas rough on the southern Chinese coast after leaving deadly destruction in Taiwan and the Philippines.",
      "A person was swept off their feet as water burst into the building.",
      "At least 14 people were killed in Taiwan after landslides and floods triggered by Super Typhoon Ragasa.",
      "<p>Nearly 2m people have been evacuated in southern powerhouse of Guangdong as it braces for storm</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/24/super-typhoon-ragasa-update-path-hong-kong-taiwan-china\">Ragasa: 17 killed in Taiwan as storm batters Hong Kong</a></p></li><li><p><",
      "<p>Chinese businesses and schools shut and residents in high-rises ordered to evacuate as storm forecast to make landfall along Guangdong coast</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates\">",
      "Almost 2 million people were evacuated across southern China as the world’s strongest typhoon this year continued its deadly rampage in Asia.",
      "One million residents of Guangdong, in southern China, were evacuated before the powerful storm made landfall on Wednesday. At least 21 people have been killed along its path this week."
    ],
    "image_url": "",
    "titles": [
      "Typhoon Ragasa batters Hong Kong and southern China",
      "Watch: Water shatters doors of Hong Kong hotel as typhoon batters region",
      "Super Typhoon Ragasa leaves destruction in Taiwan, Hong Kong, China",
      "Typhoon Ragasa live: deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
      "Super Typhoon Ragasa: 17 killed in Taiwan and Hong Kong battered as storm moves towards China",
      "Super Typhoon Ragasa kills 14 in Taiwan, causes mayhem in southern China",
      "Typhoon Ragasa Slams Into China After Deaths in Taiwan and the Philippines"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.935,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.857,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Super Typhoon Ragasa caused deadly destruction across Asia, including Taiwan, the Philippines, and southern China. In Taiwan, at least 17 people were killed due to landslides and floods. Nearly 2 million people were evacuated in Guangdong, China, in anticipation of the storm, which also led to the closure of businesses and schools. The typhoon, described as the world's strongest this year, has resulted in at least 21 deaths along its path.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Revises Stance on Ukraine, Backs Territory Reclaim with NATO Support",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:57:42 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "Axios",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "Last month, President Trump said Ukraine needed to be open to giving up some of its territory in peace talks with Russia. But those talks haven't happened. Now, he says Ukraine could win it all back.",
      "US President Donald Trump said that with \"time, patience, and the financial support of Europe and, in particular, NATO,\" Ukraine could regain its territory from Russia, who he said had been fighting \"aimlessly.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9ISERQbzZDaV96TXlsaXZ6NG1keUdBMnU2OTY2Rmw0SHVpdWxBZUoySUszSF9XWmFmSEdTYXdLMVRDM3p1RENCSjJyX1RQdkxQNjV3OTNnTW5EZEFSdUZxQU5UU0c1bERMSTJBd3REQlJxLW9mWWswbm1n?oc=5\" target=\"_blank\">In extraordinary shift, Trump says Ukraine can win war with Rus",
      "Ukrainian President Volodymyr Zelenskyy has welcomed U.S. President Donald Trump's latest comments.",
      "<p>US president claims Russia is in ‘big economic trouble’ as he calls for Nato countries to stop imports of Russian oil</p><p>Donald Trump has said he believes Ukraine can regain all the land that it has lost since the 2022 Russian invasion in one of the strongest statements of support he has given",
      "President Trump’s pivot could give him room to distance himself from a conflict that he once promised to solve in days or weeks."
    ],
    "image_url": "",
    "titles": [
      "Trump, in major shift, suggests Ukraine can win back territory long held by Russia",
      "Trump says Ukraine can regain territory lost to Russia since 2022",
      "In extraordinary shift, Trump says Ukraine can win war with Russia - Axios",
      "Defense stocks rally as Trump, in a major shift, says Ukraine can win back territory from Russia",
      "Trump says he believes Ukraine can regain all land lost to Russia since 2022 invasion",
      "In a Sudden Shift, Trump Says Ukraine Can Win the War With Russia"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.728,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.841,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has shifted his stance on the conflict between Ukraine and Russia, now stating that Ukraine can reclaim its territory with support from NATO and Europe. This marks a significant change from his previous position, where he suggested both Kyiv and Moscow might need to cede land to end the conflict. Trump's updated view aligns with increased assistance for Ukraine and suggests a strategic distance from the conflict, which he once claimed he could resolve quickly. Ukrainian President Zelenskyy has expressed gratitude towards Trump for his efforts to end the war.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Jimmy Kimmel Addresses Show's Suspension, Thanks Supporters on Return\"",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 07:03:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Al Jazeera",
      "The Guardian",
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "US TV host Jimmy Kimmel said it was ‘never his intention’ to make light of the killing of Charlie Kirk.",
      "\"Jimmy Kimmel Live!\" returned to air Tuesday night, roughly one week after the late night show was suspended by Disney's ABC broadcast network.",
      "Donald Trump threatens to sue ABC as comedian returns from suspension after Charlie Kirk comments",
      "<p>The host’s monologue noted that the suspension of his late night programme had ignited a national debate over free speech</p><p><a href=\"https://www.theguardian.com/tv-and-radio/jimmy-kimmel\">Jimmy Kimmel</a> returned to air on Tuesday night, calling government threats to silence comedians “anti-",
      "The late-night host thanked his audience and others who spoke up against his late-night show’s suspension."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel addresses Charlie Kirk row as show returns",
      "Jimmy Kimmel returns after ABC suspension: 'Never my intention to make light' of Charlie Kirk's murder",
      "Jimmy Kimmel hits out at ‘anti-American’ threats to free speech as show returns",
      "Jimmy Kimmel says silencing comedians is ‘anti-American’, as his show returns to air after suspension",
      "Jimmy Kimmel Returns: Says Charlie Kirk’s Killer Doesn’t ‘Represent Anyone’ As He Calls Out FCC Chair And Trump"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.898,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jimmy Kimmel, host of \"Jimmy Kimmel Live!\", stated it was not his intention to trivialize the killing of Charlie Kirk. The show was suspended by ABC but resumed airing one week later. Upon return, Kimmel expressed gratitude towards his audience and supporters who opposed the suspension.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Italian Cinema Icon Claudia Cardinale Dies at 87",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 10:25:04 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The actress, who starred in Fellini's 8 1/2, is synonymous with the golden age of Italian cinema.",
      "Best known for her role in Federico Fellini's \"8½,\" Cardinale has passed away after starring in over 100 productions.",
      "<p>The husky-voiced, chain-smoking actor had a reputation as a fiercely independent, free-spirited woman</p><ul><li><p><a href=\"https://www.theguardian.com/film/gallery/2025/sep/23/claudia-cardinale-a-life-in-pictures\">Claudia Cardinale: a life in pictures</a></p></li></ul><p></p><p>Claudia Cardinal",
      "One of the great, spirited European beauties to come out of the 1960s, Claudia Cardinale died surrounded by family in France on September 24. Here, an appreciation."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cf74/live/3dba72e0-992e-11f0-afaa-7fca54876f7d.jpg",
    "titles": [
      "Italian actress and star of The Pink Panther Claudia Cardinale dies aged 87",
      "Italian movie star Claudia Cardinale dies at age of 87",
      "Claudia Cardinale, glamorous star of The Leopard and Once Upon a Time in the West, dies aged 87",
      "Claudia Cardinale, Star Of “8½” And “The Pink Panther,” Dies At 87"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.944,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Claudia Cardinale, celebrated for her role in Federico Fellini's \"8½\" and a symbol of the golden age of Italian cinema, has died at 87. With a career spanning over 100 productions, Cardinale was known for her husky voice, independent spirit, and significant impact on post-war cinema.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 4 Fantasy Football: Improved Prospects for Robinson, Skattebo",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 06:56:21 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sbnation.com",
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Wan'Dale Robinson and Cam Skattebo could also see an increase in performance",
      "Chet Gresham takes us through the top 32 kickers for Week 4",
      "Chet Gresham takes us through the top 32 D/STs for Week 4",
      "Week 4 fantasy football start or sit picks, including Kenneth Walker, Jameson Williams, and more tough decisions for your fantasy team",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxQOHVrVVVzaU1hWG52Y3NucFFHSE1uVmZtbE5fd0VCbmpMQmJ6NDRsVUJEOEZuaTFJdEE3U25idkVBOXloVGdRU3gyaXVWTy03UThXVDdlNE05aUxXTm5FdXhXZWljeWd6TXFJT1NKTW52aXR0dlk0TjdGbjJQc3M5TVRwTVFickc2UFRuMFZSWlRSd21EMWc4WEdpTkw?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNeEVya2lWdDRodHRXQW16WWlOWTBpZS11VDl3eHVSbWpEZnNVUnRUeVRubGFPeTh1cG92LVI4eW43MnVVYmh1aXJfTGRVVnplQjROekNpNTRiejZESGdmMFYzZEJjR25ERUxjTUdqQndITGJ0VWxUT3B1S3RNanpCb21udllab3Q5c2dGTEh3MWFnaHR3UU1Beg?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/21/0747c4b8-9698-4eca-ab15-6afea4f7aa7c/jaxson-dart-cbs-5.jpg",
    "titles": [
      "Fantasy football: Jaxson Dart named starter for Week 4, potentially boosting Malik Nabers' value",
      "Top 32 fantasy football kickers for Week 4",
      "Top 32 fantasy football D/STs for Week 4",
      "Fantasy Football Start Or Sit Week 4: Kenneth Walker, Jameson Williams And More",
      "Running Back Start ‘Em, Sit ‘Em For Fantasy Football Week 4 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 4 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.896,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 4 fantasy football updates, Wan'Dale Robinson and Cam Skattebo are expected to see improved performances. Chet Gresham has provided rankings for the top 32 kickers and top 32 D/STs. Additionally, advice on whether to start or sit players such as Kenneth Walker, Jameson Williams, and others is available, helping fantasy team owners make informed decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump-Epstein Statue Installed on National Mall Sparks Reactions",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 09:39:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A pop-up statue showing Donald Trump holding hands with sex offender Jeffrey Epstein appeared near the US Capitol.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE05dXcza3hWam52VE5DbndEN21YR2IxYzVLZVBDUko0TVdKRTJTUkFHSVhGLXdKS1kyR1dselB3RG9Yd3VrUVpvVWptelFmcDVzdjdLSVZOTWc2S3QzaFhsNnpFekdWZXFYWGU3eVlhM3gyaWhsc2pNU2pn?oc=5\" target=\"_blank\">Statue of Trump and Epstein holding hands appears on the Nation",
      "<p>Bronze statue by an anonymous creator shows the two men frolicking and holding hands with a foot kicked back in joy</p><p>There’s a new statue on the east end of the National Mall for Washington DC residents and tourists to enjoy. The bronze statue shows two men frolicking, grinning wide and hold"
    ],
    "image_url": "",
    "titles": [
      "Statue of Donald Trump and Jeffrey Epstein appears in US capital",
      "Statue of Trump and Epstein holding hands appears on the National Mall - Axios",
      "New statue on National Mall celebrates ‘long-lasting bond’ between Trump and Epstein"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A bronze statue depicting Donald Trump and Jeffrey Epstein holding hands and frolicking has been installed on the east end of the National Mall in Washington DC. Created by an anonymous artist, the statue features both men with wide grins and a foot kicked back in joy, sparking reactions among residents and tourists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Oracle Launch $500B Stargate AI Project in Texas",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 21:01:02 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10cjBrMDkxZWZWbU1jekZrN3RrVklkTldxWGJSMG44eEdOcmVicXhSTTgzNU4wNmIxdS1zSVNiN1JsbTRiSjFsNjktX19GMFdkdk1XQmdwWFprQ3kybUZzOGZhN3h0VGw3UmNJU3pfUi13ZTlfeEctbEZB?oc=5\" target=\"_blank\">OpenAI announces five new sites for Stargate data center projec",
      "OpenAI and Oracle are betting big on America's AI future, bringing online the flagship site of the $500 billion Stargate program in Abilene, Texas.",
      "OpenAI is continuing to build out massive AI data centers to train and serve increasingly powerful AI models."
    ],
    "image_url": "",
    "titles": [
      "OpenAI announces five new sites for Stargate data center project - Axios",
      "OpenAI's first data center in $500 billion Stargate project is open in Texas, with sites coming in New Mexico and Ohio",
      "OpenAI is building five new Stargate data centers with Oracle and SoftBank"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.714,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI, in partnership with Oracle, has launched the flagship site of the $500 billion Stargate project in Abilene, Texas, marking a significant investment in the future of American AI. This initiative, which aims to expand AI data centers for training and deploying advanced AI models, will see its costs rise to $400 billion as it progresses.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: initiative, progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Criticizes EU Immigration Policy, Global Institutions at UN Assembly",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:40:33 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "ABC News",
      "Axios"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFB1cFA1NVE4VGczTUtWeFlsa3ZMYzR6bmtWLWpjQWlHTWUwcUMxUTE0bFpNdmZUc1czSGludmxSQWthOVJqUkNXY0FwMFNRbkFsTXEzR3djN25RR3FweEQyV1p3TVFXMHRsb0NUX1gyc1dlekRsQnVTVA?oc=5\" target=\"_blank\">Trump's middle finger to the UN: \"Your countries are going to hel",
      "President Donald Trump criticized the European Union's immigration policies while speaking at the United Nations General Assembly on Tuesday.",
      "In a meandering address, President Trump rebuked global institutions and complained about immigration, environmentalists, windmills and more."
    ],
    "image_url": "",
    "titles": [
      "Trump's middle finger to the UN: \"Your countries are going to hell\" - Axios",
      "WATCH:  Trump tells European Union nations: 'Your countries are going to hell'",
      "‘Your Countries Are Going to Hell’: Trump Airs His Grievances at the U.N."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.803,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During his speech at the United Nations General Assembly, President Donald Trump criticized the European Union's immigration policies and expressed disdain for global institutions, environmentalists, and windmills. His address was wide-ranging and included various complaints.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oklahoma State Fires Coach Mike Gundy After 21 Years Amid Poor Season Start",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:56:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Gundy's long tenure in Stillwater is over. Who replaces the Pokes legend and who are the key players on the roster?",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOY2ZGS19VN2xZbGNTTGNiUXExUEhyNVZnbldkTjhEQUpOU0RkN01PUTYtLVZQR2ZjS0RILVZqdW43YXNBaFhrMENjTURNWUxmR1Q5RHE1YThoMnVMNExRcE5PR2JCaXZOQ05rUF90M001aFZBVWRuWTFRX3NLeGFxUjVYV0V0N2Q0bHlIUFZhQ1ZHMDZWRTJiLUln?oc=5\" target=\"_blank\">Mike Gundy Fired: T",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkdPVFdlWlNDemkwOHBCNUJndGVfekM5dWo4Wm8zUTFqazJCSGVUWV9yN1c1bjZQTUx3UUh1bWU1TTNCa2VrcDc5OEpHSGxONVhpalB1ekZWdjVPYVU2cUdtZnRweTJlTHZsT0w0ajhiV1lmeWRhOUV6b0F0emxpNzhYSFhybm9RT3BZZng5ZlJzaGRCdHl3?oc=5\" target=\"_blank\">Mike Gundy Exited Oklah",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1PaUxHa1lHbklxNjM0c1hPUGJqTDhxMkhKaXdOaTl5YVlVaGVoWTBTNW9mRWE4ZGQ4eUF3THF4RGZOVUJia29FMnlMdWVpcF93Sl9PVmNvSHZ0TVk5WnRDd2tCZFBnaGdZaU9pbWR5aGZkRnA3NVE?oc=5\" target=\"_blank\">Oklahoma State Fires Mike Gundy, Program's Winningest Coach</a>&nbsp",
      "<p>Mike Gundy, one of college football’s most colourful coaches over the last two decades, has been fired at Oklahoma State, according to multiple media reports.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mike Gundy is out at Oklahoma State: Top candidates, transfers, recruits to watch",
      "Mike Gundy Fired: Ten Candidates for Oklahoma State Football Coaching Search - Sports Illustrated",
      "Mike Gundy Exited Oklahoma State Exactly How You’d Expect - Sports Illustrated",
      "Oklahoma State Fires Mike Gundy, Program's Winningest Coach - Sports Illustrated",
      "Oklahoma State fires football coach Mike Gundy after 20-plus years"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.698,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.701,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Oklahoma State has dismissed head coach Mike Gundy after a disappointing start to the 2024 season, ending his 21-year tenure with the team. The Cowboys have struggled, losing 11 of their last 12 games. The search for Gundy's replacement is underway, with the future direction of the program and its key players now a primary focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kremlin: Little Progress in US-Russia Relations; Trump Suggests NATO Aid for Ukr",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 11:04:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Kremlin also says US-Russia rapprochement yields &#039;close to zero&#039; results, as fears grow in Europe of Ukraine spillover.",
      "Trump’s statement that Ukraine could retake all of its territory lost to Russia with NATO’s help was a dramatic change in U.S. rhetoric on the war."
    ],
    "image_url": "",
    "titles": [
      "Russia says no choice but war after Trump U-turn on Ukraine",
      "Russia hits back at Trump after his abrupt swing toward Ukraine"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Kremlin stated that efforts to improve US-Russia relations have produced minimal results, amid concerns in Europe about the conflict in Ukraine spreading. Additionally, former U.S. President Trump suggested that Ukraine could reclaim all territories lost to Russia with NATO's assistance, marking a significant shift in the U.S. stance on the conflict.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Claims Resolution of Conflicts, Critiques Global Bodies at U.N.",
    "domain": "technology",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:34:40 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "TechCrunch",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "techcrunch.com"
    ],
    "snippets": [
      "In Trump’s speech before the U.N. General Assembly, he said he had ended a growing list of conflicts. In some of them, his role remains contested.",
      "President Trump’swith a rebuke of global institutions,",
      "We’ve compiled the answers to some of the most common questions users have about Bluesky."
    ],
    "image_url": "",
    "titles": [
      "Trump says he has ‘solved’ 7 conflicts. Here’s what to know about them.",
      "Here’s what to know.",
      "What is Bluesky? Everything to know about the X competitor"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.678,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During his speech at the U.N. General Assembly, President Trump claimed to have ended a list of conflicts, though his involvement in some remains disputed. He also criticized global institutions. The specifics of the conflicts or the nature of the criticism were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Convicted for Attempted Assassination of Trump, Faces Life Sentence",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-23T19:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "ABC News",
      "Deutsche Welle"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.dw.com"
    ],
    "snippets": [
      "The man was accused of plotting to shoot Donald Trump at the US president's Florida golf course last year. He faces life in prison.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQdEpTbnphd2daQU16UVd1Qzg3dWpNakFRS3dldEg3LVJWbFdITUd2dVNBT3FtM1oxbGEzM25tRlI5OWtyUG1HaFgwTzB2NVZHVFVXLWNHbl9ieGhJbXNWVG9ybTU5ZXVQd1BoUVBjbVJpZVZNM1BTQXJLRlNCekpfc0lxSkc?oc=5\" target=\"_blank\">Ryan Routh found guilty in Trump assassination a",
      "Ryan Routh, the man accused of trying to assassinate President Donald Trump on his West Palm Beach golf course last year, has been found guilty on all five counts."
    ],
    "image_url": "",
    "titles": [
      "US: Man convicted of Trump assassination attempt",
      "Ryan Routh found guilty in Trump assassination attempt - Axios",
      "WATCH:  Ryan Routh guilty on all counts in Trump golf course assassination attempt"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.699,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.684,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ryan Routh was convicted on five charges, including the attempted assassination of Donald Trump at a South Florida golf course last year. Representing himself in court, Routh now faces a life sentence. The jury concluded Routh intended to kill Trump during the incident. After the verdict, Routh attempted to stab himself in the neck with a pen.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube to Allow Banned Misinformation Channels to Seek Reinstatement",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 20:54:25 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "YouTube on Tuesday said it will allow previously banned accounts to apply for reinstatement, rolling back a policy that had treated violations as permanent.",
      "Google has announced it will reverse a major content moderation decision: YouTube will offer channels that were banned for spreading covid and election misinformation in 2020 a pathway back onto the platform. In a letter sent to the House Judiciary Committee, Alphabet's lawyers claimed that the Bide",
      "Alphabet blames the Biden administration for its moderation decisions."
    ],
    "image_url": "",
    "titles": [
      "YouTube to allow creators banned for Covid-19, election misinformation to apply for reinstatement",
      "YouTube will let creators who spread covid misinformation back on the site",
      "YouTube will restore channels banned for COVID and election misinformation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.712,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube, owned by Alphabet, announced it will enable channels banned for spreading COVID-19 and election misinformation in 2020 to apply for reinstatement. This marks a reversal of its prior policy treating such violations as permanent. The decision was disclosed in a letter to the House Judiciary Committee, where Alphabet suggested the Biden administration influenced its moderation policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jonathan Toews Returns to NHL, Jets Fall 3-2 to Oilers in Preseason Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:44:22 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Colin Miller and Colby Barlow scored the goals while Jonathan Toews played 18:36, winning just over half of his faceoffs.",
      "<p>Even though his Winnipeg Jets side lost 3-1 in pre-season action, Jonathan Toews got his first taste of NHL action in two-and-a-half years.</p>",
      "<p>Ty Emberson, Isaac Howard and Quinn Hutson each scored and Matt Tomkins made 13 saves as the Edmonton Oilers narrowly beat the Winnipeg Jets, winning 3-2.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/TOEWS.jpg?quality=65&strip=all",
    "titles": [
      "Jonathan Toews makes preseason debut as Winnipeg Jets fall to Oilers 3-2",
      "Jonathan Toews has quiet Jets pre-season debut",
      "NHL Pre-Season Highlights: Oilers 3, Jets 2"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.669,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jonathan Toews returned to NHL action after a two-and-a-half-year hiatus, playing 18:36 and winning just over half of his faceoffs in a preseason game where his team, the Winnipeg Jets, lost 3-2 to the Edmonton Oilers. Despite goals from Colin Miller and Colby Barlow for the Jets, the Oilers secured the win with goals from Ty Emberson, Isaac Howard, and Quinn Hutson, alongside 13 saves from Matt Tomkins.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jimmy Kimmel Back on TV, Defends Free Speech Amid Trump Criticism",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:01:06 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "The comedian was suspended for nearly a week by ABC's parent company, Disney, before returning to airwaves on Tuesday night.",
      "Jimmy Kimmel was back on TV after a six-day suspension with a defense of free speech and criticism of \"bullying\" from the US president. Donald Trump said ABC's decision to reinstate Kimmel \"puts the network in jeopardy.\""
    ],
    "image_url": "",
    "titles": [
      "'We have to speak out,' Jimmy Kimmel says in his late-night return",
      "Jimmy Kimmel returns to late night amid Trump criticism"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jimmy Kimmel returned to television on Tuesday night after a six-day suspension by Disney, ABC's parent company. In his comeback, Kimmel defended free speech and criticized \"bullying\" from US President Donald Trump, who questioned ABC's decision to reinstate him, suggesting it jeopardized the network. Prior to Trump's remarks, two major station owners had announced they would not broadcast Kimmel's show on their local stations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested in West Sussex Over Airport Delays Incident",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 11:53:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The National Crime Agency (NCA) said a man in his forties was arrested in West Sussex.",
      "<p>Man in West Sussex was held as part of investigation into last weekend’s incident affecting Collins Aerospace</p><p>A man has been arrested in the UK in connection with the <a href=\"https://www.theguardian.com/business/2025/sep/21/delays-continue-at-heathrow-brussels-and-berlin-airports-after-all"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a132/live/f7b9e9a0-9938-11f0-869a-3fa4ad43e8ee.jpg",
    "titles": [
      "Man arrested in connection with cyber-attack on airports",
      "UK arrest over cyberattack that hit Heathrow and European airports"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A man in his forties was arrested in West Sussex by the National Crime Agency as part of an investigation into an incident last weekend that impacted Collins Aerospace, causing delays at Heathrow, Brussels, and Berlin airports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump's H-1B Visa Changes May Deter Foreign Talent, Startups Warn",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 11:44:39 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Experts say President Donald Trump's changes to the H-1B program could deter startups from securing top foreign talent and drive those workers elsewhere.",
      "Startup founders are worried that changes to the H-1B visa program could make it even harder to compete with bigger companies in the talent wars."
    ],
    "image_url": "",
    "titles": [
      "Trump's H-1B visa changes could 'kneecap startups,' drive talent elsewhere, experts say",
      "Trump's H-1B overhaul could kneecap startups in the talent wars."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Experts and startup founders express concerns that President Donald Trump's modifications to the H-1B visa program may discourage top foreign talent from joining U.S. startups, potentially driving these workers to seek opportunities in other countries. This could exacerbate the challenges startups face in competing with larger companies for skilled employees.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Skubal's Struggles Lead Tigers to 7th Straight Loss, Guardians Tie for First",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:47:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Ace Tarik Skubal fell apart on the mound in Cleveland on Tuesday night and Detroit lost its seventh straight game, allowing the Guardians to catch the Tigers in the standings and secure the tiebreaker.",
      "<p>José Ramírez drove in a run with a swinging bunt when Cleveland rallied in a strange sixth inning against Detroit ace Tarik Skubal, and the Guardians beat the Tigers 5-2 on Tuesday night to move into a tie for first place in the AL Central.</p>"
    ],
    "image_url": "",
    "titles": [
      "Skubal, Tigers collapse, caught by Guardians",
      "Guardians down Skubal, Tigers to pull even atop AL Central"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On Tuesday night, Detroit Tigers' ace Tarik Skubal struggled on the mound, leading to a 5-2 loss against the Cleveland Guardians. This defeat marked the Tigers' seventh consecutive loss. During a pivotal sixth inning, José Ramírez's swinging bunt drove in a run, contributing to the Guardians' rally. The victory allowed the Guardians to tie with the Tigers for first place in the AL Central and secure the tiebreaker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Wins Overtime Thriller Against Minnesota in WNBA Semifinals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:38:00 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The 2025 WNBA semifinals are underway, and Phoenix beat Minnesota in OT in an instant classic Tuesday.",
      "We're down to the final four in the 2025 WNBA playoffs",
      "The Lynx will try to take a commanding 2-0 series lead on Tuesday night"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Fever, Lynx take 1-0 leads in semifinals",
      "WNBA playoff bracket, where to watch: Schedule, scores, TV channel for Fever vs. Aces, Mercury vs. Lynx",
      "Lynx vs. Mercury schedule: Game times, where to watch and what to know about WNBA playoff semifinals"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In the 2025 WNBA semifinals, Phoenix defeated Minnesota in an overtime match that was hailed as an instant classic. Despite this loss, Minnesota aims to secure a 2-0 series lead in their next game on Tuesday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Secure Postseason Berth with 3-2 Win Over White Sox",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 01:08:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "José Caballero, acquired at the trade deadline to provide a versatile spark off the bench, swatted a two-out, walk-off single in the ninth inning Tuesday night against the White Sox to secure the Yankees their 60th postseason berth in franchise history.",
      "<p>Watch as New York Yankees infielder Jose Caballero hits a walk-off single against the Chicago white Sox to clinch a post-season berth for his team.</p>"
    ],
    "image_url": "",
    "titles": [
      "Caballero's walk-off seals Yanks' 60th playoff berth",
      "Yankees’ Caballero hits single to walk off White Sox and clinch playoff berth"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jose Caballero's walk-off single scored Aaron Judge, leading the New York Yankees to a 3-2 victory over the Chicago White Sox, securing their postseason berth for the eighth time in nine seasons. This win marks the Yankees' 60th postseason appearance in team history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Guardians' David Fry Hit in Face by Pitch, Carted Off Field",
    "domain": "sports",
    "source_domain": "ftw.usatoday.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 11:36:51 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ftw.usatoday.com"
    ],
    "snippets": [
      "Is David Fry OK after he got hit in the face with a Tarik Skubal fastball?",
      "<p>Guardians designated hitter David Fry was carted off the field in the sixth inning Tuesday night after being hit in the face by a pitch as he tried to bunt.</p>"
    ],
    "image_url": "",
    "titles": [
      "David Fry injury update after Guardians DH hit in the face with pitch",
      "Guardians’ Fry hospitalized after being hit in face by pitch during bunt"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "David Fry, the Guardians' designated hitter, was hit in the face by a Tarik Skubal fastball while attempting to bunt during the sixth inning of Tuesday night's game. Following the incident, he was carted off the field for medical attention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Typhoon Ragasa Hits Taiwan, Philippines, Hong Kong, Macau; 14 Dead",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 07:10:32 +0000",
    "source": "New York Times",
    "sources": [
      "Forbes",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The storm left 14 dead in Taiwan, and flooded Hong Kong and Macau, disrupting flights.",
      "Dozens of people were injured in Hong Kong as the year’s most powerful storm passed close to the city and triggered flooding and landslides."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/23/multimedia/23int-typhoon-ragasa-ckbm/23int-typhoon-ragasa-ckbm-mediumSquareAt3X.jpg",
    "titles": [
      "One Million Evacuated in China as Typhoon Ragasa Barrels Toward Coast",
      "Around 2 Million Evacuated As Powerful Typhoon Ragasa Hits China After Killing 15 In Taiwan (Photos)"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Super Typhoon Ragasa caused significant destruction across Taiwan, the Philippines, Hong Kong, and Macau, resulting in at least 14 deaths in Taiwan. The storm led to widespread flooding, and disruptions to flights, prompting schools and businesses in Hong Kong and Guangdong to close.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Typhoon Ragasa Hits Hong Kong; 14 Dead in Taiwan, 1M Evacuate in China",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-24T04:13:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Phys.org",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "phys.org"
    ],
    "snippets": [
      "Ragasa, one of the strongest storms in years, also caused major damage and injuries in Hong Kong. In southern China, more than a million people evacuated their homes before it made landfall.",
      "Fierce winds, pounding rain and high seas battered Hong Kong on Wednesday as Super Typhoon Ragasa headed into southern China after causing a lake burst that killed at least 14 people in Taiwan."
    ],
    "image_url": "",
    "titles": [
      "Super Typhoon Ragasa leaves several dead in Taiwan",
      "14 killed by lake burst in Taiwan as Super Typhoon Ragasa wreaks havoc"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.847,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Super Typhoon Ragasa, one of the most powerful storms in years, struck Hong Kong with fierce winds and heavy rain, causing significant damage and injuries. Prior to hitting Hong Kong, it led to a lake burst in Taiwan, resulting in at least 14 deaths. In southern China, over a million people evacuated their homes in anticipation of the storm's landfall.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombia's Petro Seeks UN Probe into Trump Over Caribbean Strikes",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-24T03:37:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Gustavo Petro has called for a criminal investigation against Donald Trump over deadly strikes on boats in the Caribbean. Earlier, the US president said all drug smugglers will be blown \"out of existence.\" DW has more.",
      "<p>At UN, Gustavo Petro says ‘poor young people’ died in US strikes on alleged drug trafficking boats off Caribbean coast</p><p><a href=\"https://www.theguardian.com/world/colombia\">Colombia</a>’s president Gustavo Petro addressed the UN general assembly Tuesday to call for a “criminal process” to be"
    ],
    "image_url": "",
    "titles": [
      "UNGA: Colombia's Petro wants Trump to face criminal process",
      "Colombia’s Petro urges ‘criminal process’ against Trump for Venezuelan strikes"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Colombian President Gustavo Petro called for a criminal investigation against Donald Trump at the UN, citing deadly strikes on boats in the Caribbean targeting alleged drug smugglers. Petro highlighted the death of \"poor young people\" in these strikes. The call for legal action follows Trump's declaration to eliminate drug trafficking threats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Cancels Meeting on Gov Shutdown, Blames Democrats",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 21:36:08 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOWDlTYlFqNlNRRTZVT294VTFRVGhrYlpoV3l5TDdnT0x3N1laNU5nTWFJUXlUOTFnRUpldHVFQ3NHNE1pYms4NXdjeWlWdFU3X3JySjBId3NXVVFFNzU0NTJRbkhBbjRfYnNTWHdoMEdvM2Y4eDlITlI3UEFKLUpCQ2I2OG5DSDJVR0VHblppMkREZw?oc=5\" target=\"_blank\">Trump cancels meeting with to",
      "New York Democrats Sen. Chuck Schumer and Rep. Hakeem Jeffries say Trump will take the blame for a federal government shutdown if a deal can't be reached."
    ],
    "image_url": "",
    "titles": [
      "Trump cancels meeting with top Democrats as shutdown looms - Axios",
      "Trump cancels meeting with top Democrats as government shutdown looms"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.723,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump canceled a meeting aimed at preventing a federal government shutdown, blaming Congressional Democrats for the impasse. He accused them of losing their way in a post on Truth Social. New York Democrats Senator Chuck Schumer and Representative Hakeem Jeffries countered by stating Trump would be blamed for the shutdown, criticizing him for avoiding negotiations. The potential shutdown threatens federal workers' pay, air travel, and food stamp distribution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Study on Apple Cider Vinegar for Weight Loss Retracted Due to Errors",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 22:55:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily",
      "Phys.org"
    ],
    "domains": [
      "scitechdaily.com",
      "phys.org"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/viral-apple-cider-vinegar-weight-loss-breakthrough-turns-out-to-be-flawed-science/\" rel=\"nofollow\" title=\"Viral Apple Cider Vinegar Weight Loss Breakthrough Turns Out To Be Flawed Science\"><img alt=\"Apple Cider Vinegar\" class=\"webfeedsFeaturedVisual wp-post-image\" h",
      "An influential study claiming that drinking a small amount of apple cider vinegar every day helps people lose weight was retracted on Wednesday after an investigation found it contained multiple errors."
    ],
    "image_url": "",
    "titles": [
      "Viral Apple Cider Vinegar Weight Loss Breakthrough Turns Out To Be Flawed Science",
      "Journal retracts study linking apple cider vinegar to weight loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An influential study promoting apple cider vinegar for weight loss was retracted due to multiple errors found in its methodology. The investigation revealed the science behind the claim was flawed, overturning previous conclusions about its effectiveness for weight loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Eyes Crewed Artemis Moon Flight Within 20 Weeks",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:42:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Ars Technica",
      "Phys.org"
    ],
    "domains": [
      "arstechnica.com",
      "phys.org"
    ],
    "snippets": [
      "After multiple delays, the first crewed Artemis flight around the moon could be less than 20 weeks away, NASA officials said Tuesday, putting the space program one step closer to returning to the moon itself in its \"second space race\" with China.",
      "\"There is a desire for us to be the first to return to the surface of the Moon.\""
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/moon-orbit.jpg",
    "titles": [
      "NASA officials say Artemis II moon flight could come in early February",
      "NASA targeting early February for Artemis II mission to the Moon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.709,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA officials announced that the first crewed Artemis flight around the moon could occur in less than 20 weeks, advancing the space agency's goal to return to the lunar surface and stay ahead in the space race with China. This development brings NASA one step closer to its objective of returning humans to the moon.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Chair Powell Warns of High Asset Prices, Echoes Greenspan's Caution",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 18:12:02 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Powell on Tuesday noted that asset prices, a category that typically includes stocks and other risk instruments, are at elevated levels.",
      "Investors are wary of any sign that the Fed thinks “irrational exuberance”—as former Fed chair Alan Greenspan once called it—has kicked in."
    ],
    "image_url": "",
    "titles": [
      "Fed Chief Powell says stock prices appear 'fairly highly valued'",
      "Markets are selling off after Powell said six words investors don’t want to hear: ‘Equity prices are fairly highly valued’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.673,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Tuesday, Federal Reserve Chair Powell remarked that asset prices, which generally encompass stocks and similar risk assets, are currently high. This observation has made investors cautious, recalling former Fed Chair Alan Greenspan's warning against \"irrational exuberance\" in the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Philippine President Duterte Arrested on ICC Warrant, Detained in Netherlands",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 13:21:33 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Three charges against Duterte stem from his years-long campaign against drug users and dealers that rights groups say killed thousands</p><p>International criminal court prosecutors have charged the former president of the Philippines Rodrigo Duterte with three counts of crimes against humanity o",
      "International Criminal Court prosecutors allege that Rodrigo Duterte carried out crimes against humanity while in office, in pursuit of a brutal war on drugs."
    ],
    "image_url": "https://i.guim.co.uk/img/media/36e46b6c2bd64ad14e7d3135a25053510f503491/1346_478_3779_3023/master/3779.jpg?width=140&quality=85&auto=format&fit=max&s=6ce7f7712298e3295b9a652f5ff3f00f",
    "titles": [
      "Rodrigo Duterte, former Philippines president, charged with crimes against humanity at ICC",
      "Duterte, former Philippine president, charged with murder at ICC"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.609,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.584,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Philippine President Rodrigo Duterte was arrested in March by local authorities on an International Criminal Court (ICC) warrant and is currently detained in the Netherlands. The ICC has charged Duterte with three counts of crimes against humanity related to his aggressive anti-drug campaign, which rights groups claim resulted in thousands of deaths.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Picks 10 Astronauts for 2025 Class, Eyes Moon and Mars Missions",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 10:10:07 EDT",
    "source": "ScienceDaily",
    "sources": [
      "NASA",
      "ScienceDaily"
    ],
    "domains": [
      "www.nasa.gov",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "NASA has chosen 10 new astronaut candidates who will train for missions to the Moon and Mars. Their selection represents a powerful blend of talent and ambition, fueling humanity’s next great leaps into space.",
      "NASA’s 2025 astronaut candidate class greets the crowd in this Sept. 22, 2025, image. The group was introduced Monday following a competitive selection process of more than 8,000 applicants from across the United States. The class now will complete nearly two years of training before becoming eligib"
    ],
    "image_url": "",
    "titles": [
      "10 people who beat 8,000 others to become NASA astronaut candidates",
      "NASA’s New Astronaut Candidates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.632,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.581,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA selected 10 astronaut candidates from over 8,000 applicants for its 2025 class, introduced on Sept. 22, 2025. These candidates will undergo nearly two years of training for future Moon and Mars missions, marking a significant step in human space exploration.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tech Leaders to Discuss AI, Space Economy, and Startups at TechCrunch Disrupt 20",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 22:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At TechCrunch Disrupt 2025, True Anomaly’s Even Rogers and Vast’s Max Haot will join the Space Stage to explore what’s needed to unlock a sustainable and scalable space economy.",
      "On the AI Stage at TechCrunch Disrupt 2025, Mercor co-founder and CEO Brendan Foody will break down how artificial intelligence is transforming not just how we work, but also who gets to work in the first place.",
      "Vinod Khosla, founder of Khosla Ventures, takes the Disrupt Stage for a candid fireside chat on AI, climate, healthcare, and transformational startups. Hear blunt, big-picture advice from one of tech’s most legendary investors, and learn what founders truly need to succeed in turbulent times."
    ],
    "image_url": "",
    "titles": [
      "Building the new backbone of space at TechCrunch Disrupt 2025",
      "Mercor’s Brendan Foody breaks down AI’s impact on hiring at TechCrunch Disrupt 2025",
      "Vinod Khosla on AI, moonshots, and building enduring startups — all at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.744,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.434,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At TechCrunch Disrupt 2025, leaders in technology and investment, including Even Rogers, Max Haot, Brendan Foody, and Vinod Khosla, will discuss key topics shaping the future. They'll cover the development of a sustainable space economy, the impact of AI on employment, and the role of startups in addressing major global challenges such as climate change and healthcare. The event aims to provide insights into creating successful ventures in a rapidly changing world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  }
]