[
  {
    "title": "Side Quest’s creators wanted to tell stories about why people love games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T15:50:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Midway through its debut season, Apple's \"Mythic Quest\" introduced \"A Dark Quiet Death,\" an episode that diverged from its comedic tone to explore the serious narrative of another video game development team's journey. This marked the show's first significant shift in storytelling approach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9891659828703704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45729149571759264,
    "summary": "In its first season, Apple's \"Mythic Quest\" aired an episode titled \"A Dark Quiet Death,\" which deviated from the show's usual comedy to present a more serious story about a different video game development team. This episode represented the show's initial major change in storytelling style."
  },
  {
    "title": "ChatGPT’s Ghibli filter is political now, but it always was",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T15:11:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A report by Kylie Robison on OpenAI's new image generator, published by The Verge, highlights the technology's entertainment value and the ethical concerns it raises. The story also mentions Verge staff experimenting with ChatGPT, showcasing the growing interest in generative AI images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9625875138657407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45064687846643514,
    "summary": "A report by Kylie Robison in The Verge discusses OpenAI's new image generator, focusing on its entertainment potential and ethical issues. The article also notes Verge staff experimenting with ChatGPT, indicating a rising interest in generative AI images."
  },
  {
    "title": "YouTube tests turning off notifications for channels you don&#8217;t watch",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T14:47:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "YouTube is conducting a test that will disable push notifications for channels that post frequently and for which users have set notifications to \"all\" but often ignore these alerts. This change aims to reduce notification overload but may result in users missing updates from these channels."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9454087380555556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4463521845138889,
    "summary": "YouTube is testing a feature that turns off push notifications for channels that upload often and are frequently ignored by users who have chosen to receive all alerts. This initiative is designed to lessen the burden of excessive notifications, though it could lead to users missing updates from these channels."
  },
  {
    "title": "Google to pay $100 million to settle 14-year-old advertising lawsuit",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T14:18:49-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has agreed to pay $100 million to settle a lawsuit alleging it charged advertisers for clicks on ads outside their selected geographic locations. The settlement, awaiting judge approval, was filed in a California court."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.92576714,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.441441785,
    "summary": "Google has agreed to a $100 million settlement over a lawsuit claiming it billed advertisers for clicks on ads outside their chosen geographic areas. The agreement, pending approval by a judge, was submitted in a California court."
  },
  {
    "title": "Helldivers 2 is locking out players who use older CPUs",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:55:50-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Players of Helldivers 2 on older computers are facing issues running the game due to a requirement for AVX2 support, a CPU feature available since 2013. This requirement comes from the game's developer, Arrowhead Game Studios, and publisher, Sony."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9097739196064815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43744347990162036,
    "summary": "Helldivers 2 players with older computers are experiencing difficulties playing the game because it requires AVX2 support, a feature in CPUs since 2013. This specification is mandated by the game's developer, Arrowhead Game Studios, and its publisher, Sony."
  },
  {
    "title": "Musk threatens to sic the government on people ‘pushing’ Tesla ‘propaganda’",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:52:36-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk, in a 38-minute interview on Fox News, threatened to take action against individuals spreading negative information about Tesla, which he considers \"propaganda.\" This comes as protests against the company are increasing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9075116320949074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43687790802372684,
    "summary": "Elon Musk, during a 38-minute Fox News interview, warned of taking action against those disseminating what he deems \"propaganda\" against Tesla, amid rising protests against the company."
  },
  {
    "title": "First Alert’s new smart smoke alarm is meant to be a Google Nest Protect replacement",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:34:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "First Alert has introduced a new series of smart smoke and carbon monoxide alarms compatible with Google Home, following Google's discontinuation of its Nest Protect smart smoke alarm. Google is partnering with First Alert on this new product line."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8947083777083333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43367709442708335,
    "summary": "First Alert has launched a new line of smart smoke and carbon monoxide alarms that work with Google Home. This comes after Google discontinued its Nest Protect smart smoke alarm and decided to partner with First Alert for this new series."
  },
  {
    "title": "Here are the best streaming service deals available right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:32:40-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In 2025, there has been a notable increase in must-see TV shows and movies available on subscription services. However, the cost of maintaining multiple subscriptions to keep up with new releases each month has become a financial concern for many viewers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8936381789467592,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4334095447366898,
    "summary": "In 2025, there's a rise in popular TV shows and movies on subscription platforms, leading to higher expenses for viewers who subscribe to multiple services to access new content monthly, causing financial worries for many."
  },
  {
    "title": "Madison Square Garden&#8217;s surveillance system banned this fan over his T-shirt design",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:10:41-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Frank Miller was banned for life from New York's Radio City Music Hall and all related venues before he could attend a concert meant to celebrate his parents' wedding anniversary. He was informed of the ban while trying to pass through security on Monday night."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8783544712384259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.42958861780960644,
    "summary": "Frank Miller was permanently banned from entering New York's Radio City Music Hall and its associated venues, preventing him from attending a concert celebrating his parents' wedding anniversary. He learned of the ban as he attempted to go through security on Monday night."
  },
  {
    "title": "A beginner’s guide to using Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Signal, a messaging app, gained significant attention after The Atlantic's editor-in-chief, Jeffrey Goldberg, was accidentally added to a group chat with top military officials discussing an airstrike. This incident brought the app into the spotlight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.870921917025463,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.42773047925636576,
    "summary": "Signal, a messaging app, drew widespread attention when Jeffrey Goldberg, The Atlantic's editor-in-chief, was mistakenly added to a group chat where top military officials were discussing an airstrike. This incident highlighted the app's usage among high-level officials."
  },
  {
    "title": "Trump and Carney hold first call amid ongoing trade war",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:28:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive.\" He also stated that he and the Canadian leader plan to meet following the upcoming Canadian elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described talks with Canada as \"extremely productive\" and announced plans for a meeting with the Canadian leader after Canada's forthcoming elections."
  },
  {
    "title": "Over 140 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:00:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, with tremors felt in neighboring south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A powerful earthquake hit central Myanmar, also causing tremors in nearby regions of south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Thailand's capital, leading to concerns that workers might be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, collapsed, raising fears that workers could be trapped in the debris."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site in response to two rockets launched from southern Lebanon towards northern Israel. The strike occurred just hours after the rocket attack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah site in southern Lebanon, retaliating hours after two rockets were fired towards northern Israel from the same region."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests occurring in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco song \"Wiggle and Giggle All Night,\" alleging plagiarism."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend a meeting due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped a meeting because far-right European politicians were participating."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is perceived as an effort to question the validity of the current leadership in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event is being viewed as an attempt to challenge the legitimacy of the existing government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ahead of scheduled demonstrations by war veterans calling for his resignation, Zimbabwean President Emmerson Mnangagwa faces political pressure."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Zimbabwean President Emmerson Mnangagwa is facing political pressure as war veterans have scheduled demonstrations demanding his resignation."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump issued an order for his vice-president to concentrate on the operations of the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children have died in a recent incident, but additional information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son since he was moved from the US to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid a rising challenge from the opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Australian Prime Minister Anthony Albanese is seeking reelection, facing increased competition from opposition parties."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The killer's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The murderer's first parole request in Texas was denied."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in connection with the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter for the death of Clare Nowland."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's President commented on Trump's plans, describing them as \"serious\" but clarified they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the Arctic, Russia's President described Trump's plans as \"serious,\" clarifying that they have no connection to Moscow."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck a region already grappling with challenges including a civil war, food shortages, and a weakening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake hit a region facing a civil war, food shortages, and economic decline."
  },
  {
    "title": "'Like a ruined city': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:47:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake hit Mandalay, with a local describing the situation to the BBC as a \"scene of a tragedy.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake struck Mandalay, causing significant distress. A local reported to the BBC that the situation resembled a \"scene of a tragedy.\""
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her admiration for Charli XCX and Sabrina Carpenter, crediting them as inspirations. She also expressed her approach to her career with fearlessness."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer praised Charli XCX and Sabrina Carpenter as inspirations in her music career, emphasizing her fearless approach to her work."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local issues is making it challenging for the government to secure re-election for another term."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government is facing difficulties in securing re-election due to a combination of international and local issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban Indians spending more on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is witnessing growth as affluent, urban residents increase their spending on pets, particularly dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of the best photos from Africa and beyond showcases a diverse range of moments and scenes, capturing the continent's vibrant culture, daily life, and significant events."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's notable collection of photographs from Africa and surrounding areas highlights the continent's rich culture, everyday activities, and key events, showcasing a variety of dynamic moments and scenes."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the day golfing with the US president if it would serve his country's interests, highlighting a potential avenue for diplomatic engagement between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated his openness to spend a day golfing with the US president as a means of fostering diplomatic relations between Vietnam and the United States, indicating a readiness to use informal settings to advance his country's interests."
  },
  {
    "title": "How will Australia choose its next prime minister?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:44:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The nation is set to vote on May 3, with a guide available detailing its electoral system and key points of interest for the upcoming polls."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The nation will hold elections on May 3. A guide detailing the electoral system and important aspects of the upcoming polls is available for voters."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms the traditional family tree into a dynamic movie, illustrating the global movements of ancestors over time. This innovative approach not only provides a visual representation of familial migration patterns but also has potential applications in tracking disease spread and analyzing animal migration across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns family trees into dynamic movies, showing how ancestors moved globally over time. This method not only visualizes family migration patterns but could also help track disease spread and study animal migration."
  },
  {
    "title": "Compelling data point to a single, unknown respiratory virus as cause of Kawasaki disease",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:36 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent research indicates Kawasaki disease, which can cause severe heart issues in children, may be triggered by a single, unidentified respiratory virus. This challenges previous beliefs that multiple pathogens or toxins were responsible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Recent research suggests that Kawasaki disease, known for causing serious heart problems in children, might be caused by a single, yet unidentified, respiratory virus. This new finding challenges the earlier theory that the disease was triggered by various pathogens or toxins."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over recent decades is due to increased meltwater and rain in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that increased meltwater and rain around Antarctica account for 60% of the unexpected difference in ocean temperatures there over recent decades."
  },
  {
    "title": "Prime Deal: Sanders lands $54M Buffs extension",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deion Sanders and Colorado have finalized a five-year contract extension worth $54 million, as confirmed by a contract copy obtained by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Deion Sanders and the University of Colorado have agreed on a five-year contract extension worth $54 million, according to a document ESPN obtained."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his position as the coach of the Memphis Grizzlies, who are presently ranked fifth in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies, who currently hold the fifth spot in the Western Conference standings."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the two-host regional system for the women's NCAA tournament, stating it \"ruined the game.\" He expressed clear disdain for the organizers behind the decision."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma criticized the women's NCAA tournament's two-host regional system, stating it \"ruined the game\" and expressed disdain for the decision's organizers."
  },
  {
    "title": "Bueckers confirms she'll enter 2025 WNBA draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn basketball standout Paige Bueckers announced her decision to enter the 2025 WNBA draft."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, a prominent player for UConn's basketball team, has officially announced her intention to enter the WNBA draft in 2025."
  },
  {
    "title": "Source: UFL players use opener to appeal to Rock",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UFL players are set to start the season on Friday without a Collective Bargaining Agreement (CBA), according to a source cited by ESPN. They plan to address a letter to league co-owner Dwayne Johnson, seeking his assistance in the matter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UFL players are beginning their season on Friday without a Collective Bargaining Agreement, as reported by ESPN. They intend to send a letter to co-owner Dwayne Johnson, asking for his help with this issue."
  },
  {
    "title": "Source: Patriots planning to release LB Bentley",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The New England Patriots intend to release Ja'Whaun Bentley, a veteran linebacker and three-time team captain, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The New England Patriots are planning to release Ja'Whaun Bentley, a veteran linebacker who has served as a team captain three times, as reported by ESPN citing a source."
  },
  {
    "title": "PSU's Carter: 'Overall impact' makes me No. 1",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:23:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Penn State's pro day, outside linebacker Abdul Carter emphasized his aspiration to be the No. 1 NFL draft pick, highlighting his \"overall impact\" on improving team performance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "At Penn State's pro day, outside linebacker Abdul Carter expressed his ambition to be the top pick in the NFL draft, citing his ability to significantly enhance a team's performance as his key strength."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:47:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Catalonia region's top court in Spain has overturned Brazilian soccer player Dani Alves' sexual assault conviction."
  },
  {
    "title": "Picks, predictions, key players for every women's Sweet 16 game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:55:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Predictions for the Sweet 16 regional semifinals in Birmingham and Spokane have been made, outlining reasons why each team might win their matchup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Predictions for the Sweet 16 regional semifinals in Birmingham and Spokane have been released, providing analysis on why each team could potentially win their matchups."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:55:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings, with discussions on who takes the top spot among them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo have been highlighted in the latest Sweet 16 player rankings. There is ongoing discussion about who deserves the number one position among these athletes."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unexpected series of events. Since his arrival, he has fully embraced his experience at the university without any regrets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue was shaped by unforeseen circumstances. Despite this, he has wholeheartedly accepted his time at the university, expressing no regrets about his experience."
  },
  {
    "title": "Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup in the basketball tournament has been partially decided after Thursday's four games. These matches determined the first half of the teams advancing to this stage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The first half of the Elite Eight teams in the basketball tournament were determined after Thursday's games, finalizing four of the spots in this stage of the competition."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This quick conversion demonstrates the flexibility and capability of the facility to host major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' ballpark for Opening Day in just four days, showcasing the facility's ability to host major league games efficiently."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussion is ongoing among players, executives, and analysts about whether there's a trend toward cleaner gameplay or if referees are becoming less inclined to call fouls. This debate touches on the evolving nature of the game and officiating standards."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "There is an ongoing debate among players, executives, and analysts regarding whether the trend in the sport is towards cleaner gameplay or if referees are becoming more lenient in calling fouls. This discussion highlights the changing dynamics of the game and officiating standards."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as the panel's votes are in, detailing team rankings and their game schedules up until April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's details, including team rankings and game schedules through April 17, have been finalized following the panel's votes."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, had a record-setting performance in a game against Travis Hunter, showcasing his potential for an NFL career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, delivered a record-setting performance in a game, highlighting his potential for the NFL. This performance was notably against Travis Hunter."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, after facing challenges with depression, has regained her enthusiasm for the sport. She is now aiming to secure a spot in the 2026 Olympics by competing in the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder who overcame depression is working towards qualifying for the 2026 Olympics. She will compete in the World Championships on Saturday with hopes of securing her spot."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had a standout season, establishing himself as one of the top left backs globally. His performance has sparked aspirations for significant achievements with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a Fulham player, has gained recognition as one of the world's leading left backs after a standout season. His performance has raised hopes for major successes with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:58:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The UFL season begins on Friday night, with all teams aiming to challenge Birmingham's supremacy in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The UFL season starts on Friday night, with every team competing to dethrone Birmingham as the league's top team."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Helen Hu, who had retired from gymnastics and was working at a hostel in Ecuador a year ago, won the SEC beam title this past weekend."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, a former gymnast who had retired and was working at a hostel in Ecuador a year ago, won the SEC beam title this past weekend."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears, a team previously recognized for their consistent strength, have overcome significant challenges and a period of adversity, including tragedy, to reemerge as contenders for a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears, known for their consistent performance, faced and overcame challenges and a tragedy. They have now reemerged as contenders for a championship title."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder, Johnny Cardoso, has expressed that the ongoing speculation about his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States international and Real Betis midfielder, Johnny Cardoso, stated that speculation regarding a potential transfer to the Premier League has increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:29:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources cited by ESPN. This is despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:29:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian Soccer Federation due to a significant knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation following a serious knee injury Alphonso Davies suffered."
  }
]