[
  {
    "title": "Nvidia RTX 5090 mobile GPU:  more efficient and a little faster",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nvidia's 50-series desktop GPUs have faced challenges, including quality control problems, modest performance improvements, and melting cables. The new laptop GPUs, including the RTX 5090 flagship, also show modest performance gains but offer increased efficiency for laptop gamers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9963261722800926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45908154307002313,
    "summary": "Nvidia has encountered issues with its 50-series desktop GPUs, including quality control issues, minor performance upgrades, and incidents of melting cables. The company's latest laptop GPUs, such as the RTX 5090, similarly offer slight performance enhancements but improve efficiency for laptop gaming."
  },
  {
    "title": "Common Side Effects is coming back for a second season",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:39:28-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Adult Swim's animated series \"Common Side Effects\" is set to conclude its first chapter this Sunday. However, the network has announced the renewal of the series for a second season. The upcoming season will further explore the story of a man on a mission to save the world."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9820565925925926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45551414814814817,
    "summary": "Adult Swim's \"Common Side Effects\" will end its first chapter this Sunday, with the network confirming its renewal for a second season. The series, which follows a man on a world-saving mission, will continue to develop its storyline in the upcoming season."
  },
  {
    "title": "Amazon MGM Studios head Jennifer Salke steps down",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:30:44-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jennifer Salke, the head of Amazon MGM Studios, is stepping down to pursue producing. An internal memo from Mike Hopkins, head of Prime Video and Amazon MGM Studios, announced the departure and stated that Salke's position will not be filled as part of company restructuring efforts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9759748581134259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45399371452835646,
    "summary": "Jennifer Salke, the head of Amazon MGM Studios, is leaving her position to focus on producing. Mike Hopkins, the head of Prime Video and Amazon MGM Studios, announced her departure in an internal memo and mentioned that her role will not be replaced due to company restructuring."
  },
  {
    "title": "Nintendo’s Legend of Zelda movie hits theaters in March 2027",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:16:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo announced the premiere date for the upcoming live-action Zelda movie, titled \"The Legend of Zelda,\" which is set to release worldwide on March 26, 2027. Details about the movie remain largely unknown."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9660624323032407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45151560807581015,
    "summary": "Nintendo has announced that the live-action movie \"The Legend of Zelda\" will premiere worldwide on March 26, 2027. Further details about the film have not been disclosed."
  },
  {
    "title": "WhatsApp users can now add music to their status",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "WhatsApp introduces a feature enabling users to add temporary music clips to their profile updates. These snippets from popular songs can be featured in WhatsApp statuses, with the rollout happening globally over the coming weeks, as announced by Meta, WhatsApp's parent company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9546037665509259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44865094163773145,
    "summary": "WhatsApp is launching a new feature that allows users to include short music clips in their statuses. This update, announced by Meta, WhatsApp's parent company, will be available worldwide in the coming weeks. The feature enables users to share snippets from popular songs in their profile updates."
  },
  {
    "title": "OpenAI has a Studio Ghibli problem",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T08:58:44-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent internet trends show a surge in creating art using AI, with outputs ranging from stylized family portraits to various iterations of the Distracted Boyfriend meme. This showcases the diverse and imaginative creations possible, including both beautiful and unsettling artworks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9537113703935185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44842784259837964,
    "summary": "Recent trends highlight a surge in using AI for art creation, producing a wide range of works from stylized family portraits to new versions of the Distracted Boyfriend meme. These artworks vary from beautiful to unsettling, demonstrating the technology's versatility in creative expression."
  },
  {
    "title": "Android Auto’s latest beta brings full Android game support",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T06:56:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google is introducing gaming support to Android Auto, allowing users to play games such as Candy Crush Soda Saga and Angry Birds 2 on compatible car touchscreens. This feature is part of the Android 14.1 beta version, currently available to testers. At launch, four games will be supported."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8686944091782407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.42717360229456014,
    "summary": "Google is rolling out a new feature in the Android 14.1 beta version that enables gaming on Android Auto. Users can play games like Candy Crush Soda Saga and Angry Birds 2 on compatible car touchscreens. Initially, four games will be supported. This update is currently available to testers."
  },
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Robot vacuums offer an affordable option for automating household chores in an era where technology allows for tasks to be delegated to machines, including self-driving cars and robots designed for cleaning."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.40352737004629635,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31088184251157414,
    "summary": "Robot vacuums provide a cost-effective way to automate home cleaning tasks, reflecting a broader trend of using technology, such as self-driving cars and cleaning robots, to handle chores."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its first major sales event of 2025, titled the Big Spring Sale, which is currently underway and will conclude on Monday, March 31st. The sale offers significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3534879070486111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.29837197676215277,
    "summary": "Amazon's Big Spring Sale, its first major sales event of 2025, is offering significant discounts on items such as gardening supplies and bedding. The sale began recently and will end on Monday, March 31st."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream, as part of the new Virtual Game Card lending system's launch details on its website, according to VGC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3471170410069445,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2967792602517362,
    "summary": "Nintendo revealed the \"Switch 2 Edition\" games after its Nintendo Direct stream, introducing them as part of the new Virtual Game Card lending system, VGC reports."
  },
  {
    "title": "State of emergency declared in Myanmar after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:17:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, with its tremors also felt in regions of south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, and its effects were also felt in parts of south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building in Bangkok, Thailand, has collapsed, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers might be trapped within the debris."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action has been interpreted as an effort to question the legitimacy of the current government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event has been seen as an attempt to challenge the legitimacy of the government in Kyiv."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified that they are not related to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the Arctic, Russia's President acknowledged Donald Trump's plans as \"serious\" but emphasized that they have no connection to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered by the imposition of tariffs by Trump, posing risks to their future collaboration."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that the imposition of tariffs by Trump has changed the relationship between Canada and the US, potentially affecting future cooperation between the two countries."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:46:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected the idea of JD Vance and his wife's involvement in the island, following Donald Trump's promise to assert control over the territory."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has dismissed the proposal involving JD Vance and his wife, following a promise by Donald Trump to gain control over the territory."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:22:39 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "War veterans in Zimbabwe are planning protests to demand the resignation of President Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "War veterans in Zimbabwe are organizing protests to call for the resignation of President Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has signed an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order instructing his vice-president to prioritize the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have yet to be disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were confirmed dead in a recent incident. Details about the victims have not been fully released yet."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was deported by the United States to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was deported from the United States to a detention facility in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The music icon was fatally shot by the founder of her fan club. The perpetrator's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's first parole request in Texas has been denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing it of violating international trade rules."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies, with China among them, have committed to taking retaliatory actions against the United States. They accuse the U.S. of breaking international trade regulations."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case of Clare Nowland's death."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in connection with the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology in question was reportedly developed with assistance from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A technology was developed with help from Russia, analysts report."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested following an incident where police, with assistance from a local resident, managed to overpower them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been arrested after police, aided by a local resident, successfully subdued them following an incident."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found evidence of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a bed after a child reported seeing a \"monster\" there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a bed when investigating a child's claim of seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained when a convoy of 20 armed vehicles arrived at his home, according to his party's statement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained following the arrival of a convoy of 20 armed vehicles at their home, as stated by his party."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local factors is making it challenging for the government to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic issues is complicating the government's efforts to win re-election for a second term."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban residents increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is witnessing growth as more affluent, urban residents are spending on pampering their dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of outstanding photographs showcases a diverse range of moments from across Africa and beyond. The images capture a variety of scenes, highlighting the continent's rich cultural, social, and environmental landscapes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's collection of photographs presents a diverse array of moments from Africa and beyond, capturing the continent's rich cultural, social, and environmental landscapes through a range of scenes."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend a day playing golf with the US president if it would bring advantages to his country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated he is open to spending a day playing golf with the US president if it would benefit his country."
  },
  {
    "title": "How will Australia choose its next prime minister?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:44:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The nation is set to vote on May 3, with a guide available outlining its electoral system and key points to observe during the election process."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The nation will hold elections on May 3. A guide detailing the electoral system and important aspects to watch during the election process is available for voters."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms the visualization of family trees into dynamic movies, illustrating the global migration patterns of ancestors over time. This innovative approach not only enhances genealogical research but also has applications in tracking disease spread and studying animal migration across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns family tree visualizations into dynamic movies, showing ancestors' global migration patterns over time. This technique improves genealogical research and can be used to track disease spread and study animal migration in various geographic regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that 60% of the discrepancy between predicted and observed ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that 60% of the difference between expected and actual ocean temperatures near Antarctica is caused by more meltwater and rainfall, impacting predictions over many years."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and a lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that people with Long COVID often feel dismissed, disbelieved, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit distinct gene regulation. This discovery highlights a potential factor contributing to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from different parts of the body come from various precursor cells and have unique gene regulation. This finding may help explain vertebrates' evolutionary success."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a new non-invasive technique using terahertz (THz) imaging to create 3D visualizations of cochlear structures in mice, potentially revolutionizing the diagnosis of hearing loss and other conditions. This advancement could lead to the development of miniaturized THz devices, improving diagnostic speed, accuracy, and patient outcomes in various medical fields."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a non-invasive method using terahertz imaging to create 3D visuals of the cochlea in mice, aiming to transform hearing loss diagnosis. This technique may lead to smaller THz devices, enhancing diagnostic speed and accuracy in medicine."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for including eugenics in college genetics curriculums. He believes this will help scientists counteract the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, argues for the inclusion of eugenics in college genetics curriculums. He believes teaching this subject can help scientists prevent the misuse of science for political aims."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from 12 parks in Dublin, Ireland, showed higher levels of infective roundworm eggs at park entrances than in other park areas."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:37:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The field in the tournament has been reduced from 68 to 12 teams following Thursday's games, with all the action closely monitored."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament has progressed, narrowing down from 68 to 12 teams after Thursday's games. The event continues to be closely watched."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the conviction of Brazilian soccer player Dani Alves for sexual assault."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves. This decision was announced on Friday."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased his basketball skills in a game against Arizona, contributing 30 points, 6 rebounds, 7 assists, and 3 blocks to secure a 100-93 victory. This win propels the Blue Devils into the Elite Eight for the second consecutive year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg of Duke University scored 30 points, with 6 rebounds, 7 assists, and 3 blocks in a basketball game against Arizona, leading to a 100-93 win. This victory advances the Blue Devils to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers on Thursday. This shot is considered one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey from the Chicago Bulls scored a 47-foot 3-pointer at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers on Thursday. This moment is highlighted as one of the NBA season's most dramatic finishes."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech's place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored a crucial basket with 7.3 seconds left in overtime, helping Texas Tech defeat Arkansas 85-83. This victory, achieved after rallying from a 16-point deficit, advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to scapegoat him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. Pruitt claims that the NCAA and the University of Tennessee conspired to make him a scapegoat."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alex Ovechkin led the Capitals in a postgame handshake with retiring Wild goalie Marc-Andre Fleury, following their game on Thursday. This gesture was to honor Fleury's retirement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alex Ovechkin and the Capitals participated in a postgame handshake with Marc-Andre Fleury, the retiring Wild goalie, to honor his retirement after their game on Thursday."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking a notable moment as he had been the subject of trade discussions during the offseason. His performance was met with appreciation from Cardinals fans, who celebrated by giving him a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amid offseason trade discussions. His performance earned a curtain call from appreciative Cardinals fans."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:51:06 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not confirm his future plans with the team following their Sweet 16 loss to Florida, leaving his status with the Terrapins uncertain."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Maryland men's basketball coach Kevin Willard has not clarified his future with the team after their Sweet 16 defeat to Florida, leaving his status with the Terrapins in doubt."
  },
  {
    "title": "Home of the Rays?! Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:50:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in a span of four days. This quick conversion involved significant logistical and operational efforts to accommodate the event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' ballpark for Opening Day within four days. This rapid transformation required extensive logistical and operational planning to host the event."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:22:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings, with speculation on who will take the top spot among them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the newest Sweet 16 player rankings. There is ongoing speculation about who will be ranked as the top player among them."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:22:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team towards a championship. Their significant contributions on the court are central to the team's success and aspirations for a title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team towards a championship with their pivotal performances. Their contributions are crucial for the team's success and title ambitions."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:51:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This basketball season has recorded a historic high in 3-point shot attempts. There is a debate about whether the league should limit the number of these shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This basketball season has seen a record number of 3-point shot attempts, sparking a debate on whether the league should impose limits on these shots."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a game against Travis Hunter, showcasing his potential for an NFL future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, highlighting his NFL potential."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, previously battling depression, has regained her passion and is aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder who overcame depression is now aiming to qualify for the 2026 Olympics at the World Championships this Saturday."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are focusing on whether there has been a change in the style of play to be cleaner or if referees have become less inclined to call fouls. They are exploring various perspectives on the matter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Discussions among players, executives, and analysts are underway to determine if there has been a shift towards a cleaner style of play in their sport or if referees are now less likely to call fouls. They are considering different viewpoints on this issue."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, evaluating each team's performance up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is being determined as a panel evaluates team performances up until April 17, casting votes to decide which teams will advance."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had a standout season, positioning himself as one of the top left backs globally. He harbors ambitions of achieving significant success with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a Fulham player, has had an exceptional season, earning recognition as one of the leading left backs worldwide. He aims to achieve notable success with the U.S. national team."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unexpected series of events. Since his arrival, he has fully embraced his experience at the university, expressing no regrets about how he ended up there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue University involved unexpected events, but since arriving, he has fully embraced his experience and has no regrets about his journey there."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:19:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears have overcome significant challenges and a period of tragedy to become contenders for a championship title once again."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears have successfully navigated through substantial difficulties and a time of sorrow, positioning themselves as competitors for a championship once more."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:57:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso expressed that speculation linking him with a move to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Johnny Cardoso, a midfielder for Real Betis and the United States national team, stated that rumors of his potential move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann to delay Atleti exit for MLS",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:57:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources cited by ESPN. This decision comes despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Canada could face legal action in Davies injury row",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:57:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian Soccer Federation due to a severe knee injury suffered by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation following a significant knee injury sustained by player Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça : 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:52:20 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm about competing against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and expressed excitement for facing Barcelona in the upcoming UEFA Women's Champions League semifinals."
  }
]