[
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 09:57:26 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "NPR",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Striking a combative tone, Defense Secretary Pete Hegseth said the U.S. media was more focused on \"cheering against\" President Trump than covering airstrikes on Iran's nuclear sites.",
      "WASHINGTON (AP) — The Pentagon&#8217;s top leaders doubled down Thursday on how destructive the U.S. attacks had been on Iran&#8217;s nuclear facilities and described in detail the study and planning behind the bombing mission. In a rare Pentagon news briefing, Defense Secretary Pete Hegseth and Gen",
      "Trump, speaking at a news conference at the NATO summit in the Netherlands, celebrated allies boosting defense spending.",
      "<p>Pakistani government had credited US president with ‘pivotal leadership’ in its ceasefire negotiations with India</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/25/israel-iran-war-live-iranian-nuclear-program-could-restart-in-months-pentagon-finds-as-fragile-ceasefire-hold",
      "Leaders of the European Union are gathering in Brussels for the EU summit on Thursday. They are set to discuss conflicts in Ukraine and the Middle East, as well as the Trump administration tariffs. DW has the latest.",
      "<p>European Commission expects to hear on Thursday whether leaders want quick trade deal or tough reaction</p><p>European leaders will tell the European Commission later on Thursday whether they want a quick trade deal with the US, or favour a tough response to Donald Trump’s tariff threats.</p><p>T",
      "The US president doubles down on the ‘fake news’ media",
      "<p>Trump’s defense chief says US bombings degraded Iran’s nuclear sites, citing AI models over leaked intel doubts</p><p>The US secretary of defense, <a href=\"https://www.theguardian.com/us-news/pete-hegseth\">Pete Hegseth</a>, has defended the US strikes on Iranian nuclear enrichment facilities and ",
      "Hegseth said the bombing of Iran is the most \"complex and secretive military operation in history.\""
    ],
    "image_url": "",
    "titles": [
      "Pentagon chief: Iran strike was a 'historically successful attack'",
      "Pentagon leaders double down on the destruction from US attacks on Iran",
      "Trump admin live updates: Pentagon provides more details of US strikes against Iran",
      "Pakistan debates Trump Nobel peace prize nomination after US strikes on Iran",
      "EU summit: Leaders to address wars, US tariffs, migration",
      "EU leaders mull US tariff response as deadline looms over Trump’s 50% threat",
      "Has a Pentagon leak shattered Trump’s claims on Iran?",
      "Hegseth defends Iran strike amid doubts over Trump’s ‘obliteration’ claims",
      "Israel-Iran live updates: Hegseth defends Iran bombing, criticizes media"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.954,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.926,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "Senate Rules Block GOP Medicaid Cuts, Complicate Trump's Budget Approval",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 10:22:44 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "CNBC",
      "Axios",
      "NPR",
      "MarketWatch"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The nonpartisan Senate official whose office determines if legislation fits within the rules of the chamber dealt Senate Republicans a blow on proposed changes to Medicaid.",
      "The Senate parliamentarian said Thursday that several major planned cuts to Medicaid violate the chamber’s own rules and must be reworked or abandoned.",
      "President Donald Trump's budget bill, which is currently with the Senate, includes deep cuts to Medicaid.",
      "Trump wants Congress to pass his tax and spending bill by Independence Day. Some conservative Republicans in the Senate fear it could blow out the deficit.",
      "The Senate and House are fighting over Trump's 'One Big Beautiful Bill' and deficit costs, but chief financial officers tell CNBC the tax cuts will become law.",
      "Senate Republicans race to pass Trump's domestic policy bill by July 4, but are divided on key issues. And, NATO leaders agreed on a defense spending increase at yesterday's summit.",
      "The decision is a major setback for Republicans who are under time pressure.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE4xei1jcnY4ZnFVdXl2UXVGUE9qWGZNM01vMjQ3TUZSa00yTzFpQ0JwXy1TU09FNnRmTU5LdUVJcF9Dakg4WDZMSlVQY3ZMaTkzTHdISl9uTmtSeE1fUjVFSTZzS01sYjdNNE9Lalk0ZmdRSXJ0Rlg3TEVUS2hGdw?oc=5\" target=\"_blank\">Senate parliamentarian blocks Medicaid changes in \"big, b",
      "Republicans want to add work requirements for Americans to get Medicaid. Is that a necessary step to fight \"waste, fraud, and abuse\" or a sneaky way of cutting the social safety net?"
    ],
    "image_url": "",
    "titles": [
      "Medicaid changes don't meet Senate rules in 'big, beautiful bill' says parliamentarian",
      "Trump Medicaid cuts dealt major blow in Senate, imperiling tax bill",
      "Capitol Police arrest dozens of people protesting Medicaid cuts in Trump budget bill",
      "Trump hosting 'One, Big, Beautiful' event to push Senate Republicans to pass tax bill",
      "Trump's 'One Big Beautiful Bill' will pass, tax cuts win out over deficit threats: CFO survey",
      "Senate Republicans race to pass Trump's policy bill. And, takeaways from NATO summit",
      "Senate parliamentarian deals blow to GOP over Medicaid provisions in Trump's megabill",
      "Senate parliamentarian blocks Medicaid changes in \"big, beautiful bill\" - Axios",
      "The paperwork trap: A sneaky way to cut Medicaid in the 'One Big Beautiful Bill'?"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.881,
    "summary": "The Senate parliamentarian ruled that several major cuts to Medicaid proposed by Republicans violate Senate rules, requiring these plans to be revised or dropped. This decision complicates efforts to pass President Trump's budget bill, which includes significant Medicaid cuts and aims for approval by July 4. Amidst concerns from some Republicans about the potential for increased deficits, the struggle to pass the bill reflects broader divisions within the party and between the Senate and House over fiscal priorities. Despite these challenges, efforts continue to enact Trump's domestic policy a",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the ongoing political struggles surrounding President Trump's budget bill and Medicaid cuts. It increases awareness about the functioning of the Senate and the challenges in passing bills. However, it does not highlight any solutions or progress."
  },
  {
    "title": "Supreme Court Allows SC to Exclude Planned Parenthood from Medicaid",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 10:17:58 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Axios",
      "Al Jazeera",
      "LA Times",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Supreme Court allowed South Carolina to remove Planned Parenthood clinics from its state Medicaid program, even though Medicaid funds cannot generally be used to fund abortions.",
      "<p>Conservative states that banned abortion are still fighting with Planned Parenthood, which provides medical screening for women.</p>",
      "<p>Decision could embolden red states in US to block clinics that provide abortions from receiving Medicaid funds</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/jun/26/us-politics-live-latest-news-donald-trump-iran-democrats-republicans\">US politics live – latest updates</a></p",
      "<p>US supreme court allows South Carolina to exclude Planned Parenthood from Medicaid, a decision that could encourage other red states to follow suit</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/jun/26/supreme-court-planned-parenthood-decision\">Supreme court paves way for states ",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9OQkQ1eUMwM0JXcHhQSXE0RUVkRDBuY2hoZTNCb3hraXY4WmYwYUVaMjJCeDVCM3pJRnoxTnRsakJ3d2VKb2syT2NEUC14YWE5R2tKUlRtMC1teUMyVDF3TEVnRTA4Tm5WY1RJd2o5VXlQYXhmUk04NjU3bTRBdw?oc=5\" target=\"_blank\">Supreme Court ruling on patients rights' could devastate ",
      "Republican-led states have sought to deprive abortion providers of public funds by restricting access to Medicaid."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court upholds South Carolina's ban on Medicaid funds for Planned Parenthood",
      "Supreme Court says states may bar women on Medicaid from using Planned Parenthood clinics",
      "Supreme court paves way for South Carolina and other states to defund Planned Parenthood",
      "Three liberal supreme court justices dissent in case that imperils Planned Parenthood funding – live",
      "Supreme Court ruling on patients rights' could devastate Planned Parenthood - Axios",
      "US Supreme Court backs South Carolina effort to defund Planned Parenthood"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.961,
      "consensus": 0.988,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary": "The Supreme Court has ruled that South Carolina can exclude Planned Parenthood clinics from its Medicaid program. This decision is significant as it may inspire other conservative states to also block abortion providers from receiving Medicaid funds, despite Medicaid's general prohibition against funding abortions. This move is part of ongoing efforts by Republican-led states to limit public funding for abortion providers through Medicaid restrictions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the Supreme Court's decision and its potential implications on public funding for abortion providers. It provides context about ongoing efforts by Republican-led states to limit public funding for abortion providers. However, it does not provide any solutions or empowering knowledge for the readers."
  },
  {
    "title": "Trump Organization's T1 Smartphone Not Made in USA, Emphasizes American Values",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 13:32:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "Business Insider",
      "Investopedia",
      "Ars Technica"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "The Trump Organization has removed a reference to the recently-announced T1 smartphone being made in America.",
      "Trump T1 phone isn't \"made in the USA\" but is \"designed with American values.\"",
      "Trump Mobile now says its $499, gold-colored smartphone will be \"brought to life right here in the USA\" and \"proudly American.\"",
      "<figure><img alt=\"Joe Raedle / Staff / Getty Images Trump Mobile, led by President Donald Trump's sons Eric and Donald Trump Jr., plans to release a “T1 Phone” in August.\" src=\"https://www.investopedia.com/thmb/cOEiSz7AJMp8y-jLHkThTmveKF4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jp",
      "Former Centrica chief thinks UK oil major will need painful restructuring if it is to avoid being taken over"
    ],
    "image_url": "",
    "titles": [
      "Trump Organization scraps 'made in the USA' tag for its gold T1 smartphone",
      "After a week, Trump Mobile drops claim that Trump phone is “made in the USA”",
      "'Made in the USA' wording vanishes from Trump Mobile's smartphone listing",
      "Trump Phone No Longer Promises to Be 'Made in the USA'",
      "Sam Laidlaw no longer in the running to become BP chair"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.946,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary": "The Trump Organization has clarified that its T1 smartphone, priced at $499 and highlighted by its gold color, is not manufactured in the United States, but rather embodies \"American values.\" The marketing now emphasizes that the phone will be \"brought to life\" in the USA, aligning with a theme of national pride. This adjustment in the product's promotion comes from Trump Mobile, a venture led by Eric and Donald Trump Jr.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Trump Organization's new product, its manufacturing location, and the marketing strategy. It contributes to the reader's understanding of the product and its alignment with national pride. However, it does not report on solutions, improvements, or innovations, nor does it increase awareness about systems or impacts."
  },
  {
    "title": "Evander Kane Traded to Canucks for 2025 Pick, Oilers Clear Cap Space",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 10:35:23 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "NHL",
      "Bleacher Report",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The promising young forward gets a new start. Did the Sabres get enough in return?",
      "<p>The Utah Mammoth are set to add another young forward to their group as their rebuild continues. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE90QzhBT3pBdUNNcXZMWGJsMVlSWDRRVnM4bENYR0lSREdia0YyQTUyV2stTVBqS0tROVcxeEo2RW9CQmdSZ3I1LWlGNUVKRHhaT3dHZTRpdWlQS09jWlo3NVpPcF9OTDE3aVBSX3p1d2dXalpYN0loWHR0eTI?oc=5\" target=\"_blank\">Peterka traded to Mammoth by Sabres for Kesselring, Doan</a>",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1iN3hnNlE5Q3gyc194M25tUFluWWEwUmxQMHozSVR6X09acEJGN0M3dzN3b0U4eEhpTVJ3bHFIR05nMWhjU1RQM1J5LXRnaTR2aFJYVEhqZFExUzgyRGcySzhfTjhpVmZfY3NUNWVMTGFSbm5mZ1E?oc=5\" target=\"_blank\">Kane traded to Canucks by Oilers for draft pick</a>&nbsp;&nbsp;<font",
      "<p>The Wild are trading the forward to the Seattle Kraken for a draft pick, Sportsnet&#8217;s Elliotte Friedman reported on Thursday. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNdVZuODZVUGNCNVN6bi1lSEVQMzUyT29QZ1JhdzM0ODFGVDRUbkRPRFN4eENBajZBZWlqWjRxNzRVakZveFhSeU95LU9QSWROYXZSRDFvczBMWTB6VkFSZzhIWWpxd1luWTg0R1hORFFNTElaN2ptbkdYRk5RVEVWazdSMnMzYVhSNVZj?oc=5\" target=\"_blank\">CANUCKS ACQUIRE FORWARD EVANDER KANE FR",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVzhZbTFUdTUtUmk0aV9BUmtMVDNBTXhXeF9zeVA3NEFObURuSmR3TnhwTlg3V2dyMU5FWm1LUlhibEstLUJEOFpaajJkd2hQaXNPVmQtTGFPSmJtN2xZMEU0OGtXUHlGV0E0WnhadlNBNXZMMmR5RWVJSXZjTXVlLU1HMjByT2VM?oc=5\" target=\"_blank\">RELEASE: Oilers acquire pick from Canucks f",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPd1IwNVRQNmh1YVVUX0FzZUdqTGhMUU1LemcwU1pfZGJBc3Z0ZlBNU0JfQ2xDb0M0TzNzUEhaX0FaaDhmek50R1kyTmRNVDNlbU9FZ2QzTy1GbkZUdk9NSFRLZlJ5NFNmeTVkd1gwTkhKOTV6U2t2Tjk1NWM0U0tQZ2MwbnQ5eWNycEdNQXBIbDZqVk4tTVFBVw?oc=5\" target=\"_blank\">Winners and Losers of",
      "Peterka will give the Mammoth another dynamic presence in the top six"
    ],
    "image_url": "",
    "titles": [
      "Trade grades: Mammoth get an A+ for Peterka addition",
      "Sabres trade JJ Peterka to Mammoth for Josh Doan, Michael Kesselring",
      "Peterka traded to Mammoth by Sabres for Kesselring, Doan - NHL.com",
      "Kane traded to Canucks by Oilers for draft pick - NHL.com",
      "Wild trading Frederick Gaudreau to Kraken for draft pick",
      "CANUCKS ACQUIRE FORWARD EVANDER KANE FROM EDMONTON - NHL.com",
      "RELEASE: Oilers acquire pick from Canucks for Kane - NHL.com",
      "Winners and Losers of the JJ Peterka to Utah Mammoth Trade - Bleacher Report",
      "JJ Peterka trade grades: Mammoth add dynamic young scorer, Sabres bet big on Michael Kesselring"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.967,
      "consensus": 0.988,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.845,
    "summary": "Evander Kane was traded from the Edmonton Oilers to the Vancouver Canucks for a 2025 fourth-round pick. This move, reported by Sportsnet's Elliotte Friedman and discussed on The FAN Hockey Show, allows the Oilers to clear cap space ahead of free agency. Kane, who missed the entire regular season due to multiple surgeries, made his return during the playoffs before the trade to his hometown team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the trade of Evander Kane to the Canucks and the Oilers' strategy to clear cap space. However, it doesn't provide a deeper understanding of the potential impacts of this trade on the teams or players involved."
  },
  {
    "title": "Two Charged in Fatal Collision Involving Boy and School Bus in Almonte",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 15:36:51 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News",
      "CBC",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Over six months after a seven-year-old tragically lost their life while getting off their school bus, police have charged to people in connection with his death.",
      "A 9-year-old boy has died following a collision with a school bus on June 25 in Almonte, Ont. Ontario Provincial Police (OPP) said in a release that officers were called to the scene around 3:30 p.m. Wednesday. Officials said the boy was riding a bike at the time when the collision happened with the",
      "Police say the boy was a student at R. Tait Mackenzie Public School",
      "<img alt=\"Almonte collision June 25, 2025\" height=\"349\" src=\"https://i.cbc.ca/1.7571037.1750891174!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/almonte-collision-june-25-2025.jpeg\" title=\"Almonte collision June 25, 2025\" width=\"620\" /><p>Ontario Provincial Police said the child was comin"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/Screenshot-2025-06-26-102352.png",
    "titles": [
      "2 charged after London, Ont. boy killed coming off school bus",
      "Boy, 9, dead after collision with school bus while riding bike",
      "Nine-year-old cyclist dies after colliding with school bus in Almonte",
      "Boy dies after being struck by school bus in Almonte, Ont."
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.987,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.841,
    "summary": "Over six months after a 9-year-old boy was fatally injured in a collision with a school bus in Almonte, Ontario, on June 25, police have charged two individuals in connection with his death. The incident occurred when the boy, a student at R. Tait Mackenzie Public School, was riding his bike around 3:30 p.m. Ontario Provincial Police responded to the scene following the tragic event.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a tragic incident but does not offer any deeper insights or actionable takeaways for the reader. It does not discuss potential solutions or preventative measures to avoid such incidents in the future."
  },
  {
    "title": "Kenya Protests Over Tax Bill and Corruption Leave 16 Dead, 400 Injured",
    "domain": "general",
    "location": "global",
    "published": "Thu, 26 Jun 2025 12:24:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBC News",
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "New York Times",
      "Washington Post",
      "CBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The protests marked deadly demonstrations in 2024 against a controversial tax bill.",
      "Thousands demonstrated on Wednesday to express their anger over government corruption and police brutality.",
      "<img alt=\"Fireworks over a river.\" height=\"349\" src=\"https://i.cbc.ca/ais/7966efb2-901a-4a7e-a4f4-1a5e17ad505c,1750886142341/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C350%2C6723%2C3781%29%3BResize%3D%28620%29\" title=\"Fireworks explode above LeBreton Flats Park on Canada Day, in Ottawa, on Monda",
      "Demonstrators joined antigovernment marches across the country a year after huge rallies against a contentious tax plan left more than 60 people dead.",
      "<img alt=\"A man with toothpaste on his face and a kerchief around his neck holds both hands over his head and forms an X with his arms\" height=\"349\" src=\"https://i.cbc.ca/1.7570926.1750885508!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/kenya-security-protests-anniversary.JPG\" title=\"A pr",
      "At least eight people were killed as protests against police brutality in Kenya spread across the country, according to rights and medical groups.",
      "<p>Police clashed with people marching in Nairobi and other areas to honour those killed in protests last year</p><p>At least 16 people have been killed and 400 injured in <a href=\"https://www.theguardian.com/world/kenya\">Kenya</a> as a nationwide demonstration to honour those killed during last yea",
      "Security forces fortified Kenya's government buildings with razor wire ahead of a march marking one year since anti-Ruto protesters stormed the parliament. Reports suggest at least eight have died during the protests."
    ],
    "image_url": "",
    "titles": [
      "At least eight killed in deadly Kenya protests: What we know",
      "What to Know About the Antigovernment Protests in Kenya",
      "What to know ahead of Canada Day in Ottawa",
      "At Least 8 Killed as Protesters Battle Police in Kenya",
      "Police crack down on Kenyan protesters with deadly force a year after anti-tax uprising",
      "At least 8 killed as anti-government protests rock Kenya",
      "At least 16 people killed and 400 injured in Kenyan protests",
      "Kenya: Several killed in rally on deadly protest anniversary"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.924,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.835,
    "summary": "In Kenya, protests against a controversial tax bill and issues like government corruption and police brutality have led to significant unrest. Demonstrations across the country, marking a year since previous rallies against the tax plan resulted in over 60 deaths, have seen at least eight people killed recently. The protests, which also commemorate those killed last year, have involved clashes with police in Nairobi and elsewhere, with security forces bolstering government buildings in response. Overall, the current wave of protests has left at least 16 people dead and 400 injured.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a useful context about the ongoing protests in Kenya, their causes, and their impacts, contributing to the reader's understanding of the situation. However, it doesn't highlight any progress or solutions to the issues being protested."
  },
  {
    "title": "Zohran Mamdani Wins NYC Mayoral Democratic Primary Over Andrew Cuomo",
    "domain": "general",
    "location": "national",
    "published": "Thu, 26 Jun 2025 09:00:22 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "The Guardian",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOZndiQ0RDbE5FeE9MdjRVbE5SSTVCLXZsQXgzdjByZC1OVzNkZ09rT3A5QTk1aUdRUmg5eGFfbUV3cHdtd0lHcVhNQkxYZUtyZjZkUjVRb2JGeXY4MS00N0JhQ0pwOWt2RmdFeS1NaHBpcGRJM2paRUVFRVJFNUpreA?oc=5\" target=\"_blank\">Democratic establishment melts down over Mamdani's wi",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOOW1oVnk5MDlXM3MwRWhYN205U3BIWXFudVpNejJWMW5lUlZrRXpPaUE2ekRvLWk2X2ZOM3lJbUFyY0tnc0VwNUlMamFNR29RQmg1R2F5ZkNuaXlnWHRMeWF5WkZUQ0J1X0RPSmFldzV4Y3lILWw3TmRiU0N0OVM1dzU5aGJtbExUakE?oc=5\" target=\"_blank\">Zohran Mamdani's campaign was a perfect ",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOdWtpeW8zbURBRjZtWl96UTFtY1N3VHhXSUpOT1ZjMnhXQXFXNVl4UVJOXzF5ME9vV18zNkZoazhHSHo5NGtraVZjaFBkcEZPS3Blb3g4ampuTG9mNDIydXRIdGRyakFWT1hiSkl2OTVhWGNvWUNvQ3lJM3JIUDVtZXJ1cEdaSnJHaEc0RXpza1hZR05RRVpqLQ?oc=5\" target=\"_blank\">Andrew Cuomo concedes",
      "His possible win in the general election could bring what the Street hates most — tax hikes and tighter regulation threatening corporate and investment interests.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE14dS1RcjZYR1hfLXV5LXE2elhNSTh2SkNmeEdDdmRhYUdRRzUwVUVNbzJZQnBJUW81YTJ0dDJBZzNZOXBoOXQtNnlqT3E0bUVZSDVOanJmNXZ6QkhqZlhNcnVhWjlRLUl5WUVOYkxua0lGSC1nZHcwTE56M2o?oc=5\" target=\"_blank\">MAGA erupts with Islamophobic attacks on Zohran Mamdani</a>&",
      "<p>State assembly member subjected to death threats and xenophobic rhetoric from Republican figures</p><p>“Hamas terrorist sympathizer,” “jihadist terrorist,” calls for deportation and predictions of another 9/11 – these are among the torrent of Islamophobic attacks that have erupted across social m",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9CODVHeDhYblhSS004OHFtYWhGTlp3d0c1VW5vOS1yeFFtRjMxcVBHaFdvWFlJcU9zV1NXR1lBWkpNQ1psOEc2ZDZzbUN1NzFabWlOTXkxeXYyVVdIVUw3VUNfMzlZQjdVSE9ZSktUdDdJSTdGM1Nz?oc=5\" target=\"_blank\">Trump slings insults at Mamdani, other Democrats after NYC primary<",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPa05mU0Mwek1KdlZJbl9DRkhZMnlreU1fcF8zaHdaWlNjUUN6SDlaajZ0bmFKaEJGaDRkNFRVNFVQNlpjbzg1dDZZMndLNlFBLVNYZFJZVFA0aHRBbHdFcVptRmt3bUhCNk5ndjhCUkh6cTM1d3MtVUE4cjZvZ05ib1FvVzZIYjZ4cHow?oc=5\" target=\"_blank\">Democrats rage as Trump limits classifi",
      "The Trump administration is planning to limit classified information shared with Congress, sources familiar with the matter told ABC News.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFB1R0dOOXIwdUJPblFuZHotQVRsNTBaYllFZzB4YURhVVVmV29mSjlPTFB0Y0VGN0NFbG1TS0VrOWFzekh2UzNTNU5vUk93Qm0tMDFCWUlYa09tbkNsU1cwMzQwWWJqQ2piN0NGdWdpUEJrNzdVVVg5RWdpTEZmQQ?oc=5\" target=\"_blank\">Scoop: Trump to limit sharing classified info with Congre",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQa0ZQWGVQcWFWcmVIVUpVMXRlNUExdUl4U3NiYlJHM2trN05OXzlLUzJZaFQwa1B4c1lpaUNYUG1naGhJc2lNN0hKaHlKaUVxOW5SZGNOTy1GMVpUajY4OTRTVHpZdmpUZVBuaGhZd1RPVEh2dExKdjhWQnpPYTNwYQ?oc=5\" target=\"_blank\">\"Leaks are a problem\": Congress feuds over Trump limi",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNRWp3XzJiZGFQX1Z0dW1SQkNBcUV3WlNUS2NnU0JyMmFCZXBfaEFvX2JiY3VTdjhPV2pxM1dLZXF1aUtaTGF4X2dGWXVFYmlFTU5pTVdkemZKbnpJYVZOMnROYVAtbWFYUmhjdi1XT1FvY0ZnbUFqdnBITV9rTmJDQzVPcVd4TnNFX184WG1lSHRtSDczTk5ERQ?oc=5\" target=\"_blank\">D.C. progressives wan",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE00dkhRS1pha3lRb1F4V3FaenpsbDlRN25DZ3JfQ3hCaUE5eTNNZzNtYUZLRWVCN1lEUW04ZUtzc3Z6ZGVDNU9YT3dUaGJpX04xOTJMVEFkR1JrcFNYVHdrUUZWUl95VndzT0w4?oc=5\" target=\"_blank\">Zohran Mamdani has NYC's business community \"terrified\"</a>&nbsp;&nbsp;<font color=",
      "<p>Mamdani’s popularity represents the total collapse of a Democratic party establishment</p><p>The surprise electoral success of Zohran Mamdani, the 33-year-old democratic socialist running to be mayor of New York, most prominent city on Earth, is a political earthquake. The breadth and scope of hi",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOdFlTU0NFUFVvVXJBLWQ1aEFGU3pRdkxlenVNMUNfTjRrUUdiRkprZUFGaUxodXFMTmxYeHVPclhlMGVDU3I4VUpoRXV2bHpmTVlSNWpaRXliTFJubVFMdnNCbURxMlN4b3ZjWUIyVFZGT05xU2pLX1RoY245a09EYg?oc=5\" target=\"_blank\">\"There's a lot of anxiety\": Mamdani's win has some De"
    ],
    "image_url": "",
    "titles": [
      "Democratic establishment melts down over Mamdani's win in New York - Axios",
      "Zohran Mamdani's campaign was a perfect storm - Axios",
      "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary - Axios",
      "Zohran Mamdani’s victory in NYC mayoral primary leaves Wall Street 'alarmed' and 'depressed'",
      "MAGA erupts with Islamophobic attacks on Zohran Mamdani - Axios",
      "Mamdani faces barrage of Islamophobic attacks after New York primary success",
      "Trump slings insults at Mamdani, other Democrats after NYC primary - Axios",
      "Democrats rage as Trump limits classified intel sharing with Congress - Axios",
      "White House plans to limit classified info it shares with Congress on Iran attack",
      "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage - Axios",
      "\"Leaks are a problem\": Congress feuds over Trump limits on sharing intel - Axios",
      "D.C. progressives want their own Zohran Mamdani vs. Mayor Bowser - Axios",
      "Zohran Mamdani has NYC's business community \"terrified\" - Axios",
      "Zohran Mamdani has unleashed a political earthquake | Ben Davis",
      "\"There's a lot of anxiety\": Mamdani's win has some Dems freaking out about their primaries - Axios"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.86,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary": "Zohran Mamdani, a 33-year-old democratic socialist and state Assemblymember, has won the Democratic primary for New York City Mayor, defeating former Governor Andrew Cuomo. Mamdani, celebrated for making history with his victory, received 43.5% of the votes. His win signals a shift towards progressive politics in the city, rooted in immigrant-led global resistance movements. Cuomo conceded the race, marking Mamdani's victory as a significant moment for both the city and the Democratic party. This outcome has stirred reactions from various quarters, including Wall Street and the business commun",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the shift towards progressive politics in New York City, and the implications of Zohran Mamdani's victory on the Democratic party. However, it doesn't offer specific solutions or innovations, nor does it deeply explore the systems or causes behind this shift."
  },
  {
    "title": "Bezos Moves Venice Wedding Party Amid Protests and Local Backlash",
    "domain": "general",
    "location": "global",
    "published": "Thu, 26 Jun 2025 12:52:38 GMT",
    "source": "The Guardian",
    "sources": [
      "Forbes",
      "CBC News",
      "The Guardian",
      "Business Insider",
      "MarketWatch"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "<p>The Guardian’s picture editors select photographs from around the world</p> <a href=\"https://www.theguardian.com/news/gallery/2025/jun/26/kardashians-in-venice-and-a-french-spiderman-photos-of-the-day-thursday\">Continue reading...</a>",
      "<img alt=\"A woman dressed in white carries a handbag while walking on a dock\" height=\"349\" src=\"https://i.cbc.ca/1.7571353.1750945825!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/people-bezos-wedding.JPG\" title=\"Oprah Winfrey walks to get in a boat as she departs from Marco Polo Airport a",
      "Wedding guests have already touched down in Venice, including several members of the Kardashian family and Ivanka Trump.",
      "Gulfstream jets owned by Kim Kardashian and Oprah are among those that have landed in Venice this week ahead of Jeff Bezos' marriage to Lauren Sánchez.",
      "The billionaire Amazon founder Jeff Bezos is marrying Lauren Sánchez in Venice. They arrived in the city on Wednesday amid protests of their nuptials.",
      "The Amazon founder’s wedding may be ludicrously over the top by many people’s estimation, but it pales in comparison with the habits of Americans in love.",
      "Kim Kardashian, Ivanka Trump, Oprah Winfrey, and Andy Jassy have arrived in Venice for the multiday wedding of Jeff Bezos and Lauren Sánchez."
    ],
    "image_url": "https://i.guim.co.uk/img/media/8609340bfd6ce4406a5ff9a63d879ca8e76fd700/608_0_4007_3205/master/4007.jpg?width=140&quality=85&auto=format&fit=max&s=43b92b565efc9422eeb73cbb2841fce6",
    "titles": [
      "Kardashians in Venice and a French Spiderman: photos of the day - Thursday",
      "Oprah, Kardashians arrive in Venice amid protests against Bezos-Sanchez wedding",
      "Kim Kardashian, Oprah Winfrey And Tom Brady Arrive In Venice For Jeff Bezos’ Wedding (Photos)",
      "Bill Gates and Kylie Jenner's private jets among those flooding into Venice ahead of Jeff Bezos' wedding",
      "Photos show Jeff Bezos and Lauren Sánchez kicking off their wedding festivities in Venice",
      "Most American weddings are a lot more extravagant than the Jeff Bezos and Lauren Sanchez nuptials",
      "Jeff Bezos and Lauren Sánchez's wedding guest list: A-listers arrive in Italy to celebrate"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary": "Jeff Bezos and Lauren Sánchez moved their Venice wedding party venue from the city center due to protests. Critics argue the event exemplifies the exploitation of Venice. The wedding, attracting high-profile guests like Ivanka Trump and Diane von Furstenberg, has sparked debate between its economic benefits and the backlash from locals. Despite the controversy, preparations continue, highlighting the impact of public opinion on the plans of even the wealthiest individuals.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the event and its impact on the local community, but it doesn't offer deep insights or actionable information. The story doesn't report on solutions, improvements, or attempts to solve the problem of exploitation of Venice."
  },
  {
    "title": "Ronaldo Extends Contract with Al-Nassr Until 2027",
    "domain": "general",
    "location": "global",
    "published": "Thu, 26 Jun 2025 13:35:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sportsnet",
      "The Guardian",
      "Yahoo Sports",
      "Al Jazeera",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Cristiano Ronaldo has signed a new two-year deal at Al-Nassr, which will keep him at the Saudi Pro League club beyond his 42nd birthday.",
      "<ul><li><p>Portuguese star will be 42 when deal ends in June 2027</p></li><li><p>News brings recent transfer speculation to a close</p></li></ul><p>Cristiano Ronaldo has signed a new two-year deal at Al Nassr, extending his stay with the Saudi Pro League team to June 2027, when the forward will be 4",
      "<p>Cristiano Ronaldo has signed a two-year contract extension with Saudi Arabian club Al-Nassr. </p>",
      "Ronaldo and his Saudi club side Al Nassr made the new deal official, putting an end to rumours he could sign elsewhere.",
      "The Portuguese striker has officially signed another two-year deal and will remain in Saudi Arabia",
      "Cristiano Ronaldo has signed a new contract with Al Nassr to extend his stay in the Saudi Pro League.",
      "Ronaldo and his Saudi club side Al Nassr made the new deal official, putting an end to rumours he could sign elsewhere."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/84ed/live/deba6e50-5295-11f0-8541-4746d30440d4.jpg",
    "titles": [
      "Ronaldo signs new deal with Saudi club Al-Nassr",
      "‘A new chapter begins’: Cristiano Ronaldo signs new two-year Al Nassr deal",
      "Cristiano Ronaldo extends contract with Al-Nassr for two more years",
      "Cristiano Ronaldo signs new contract at Al Nassr until 2027",
      "Cristiano Ronaldo signs new two-year deal until 2027 with Saudi Pro League club Al-Nassr",
      "Ronaldo signs new deal to extend Al Nassr stay",
      "Cristiano Ronaldo signs new contract at Al Nassr until 2027"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.947,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary": "Cristiano Ronaldo has officially extended his contract with Al-Nassr for two more years, ensuring his stay at the Saudi Pro League club until June 2027, when he will be 42. This new deal concludes recent speculation about his transfer, affirming his commitment to Al-Nassr.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about Ronaldo's contract extension, it doesn't provide any deeper understanding or actionable insights for the reader. It also doesn't report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Mbappé Accuses PSG of Moral Harassment, Paris Prosecutors Investigate",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 11:57:35 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Kylian Mbappé has accused Paris Saint-Germain of moral harassment in a legal filing, the Paris prosecutor's office confirmed on Thursday.",
      "<p>Kylian Mbappé has accused Paris Saint-Germain of moral harassment in a legal filing, the Paris prosecutor’s office confirmed on Thursday.</p>",
      "A pair of investigators have been appointed to take charge of Real Madrid star Kylian Mbappé’s case against former club Paris Saint-Germain.That’s according to Le Parisien, citing AFP, who have o..."
    ],
    "image_url": "",
    "titles": [
      "Kylian Mbappé sues PSG for 'moral harassment'",
      "Kylian Mbappe files harassment complaint against Paris Saint-Germain",
      "Formal investigation opened as Real Madrid star Mbappé accuses PSG of harassment &amp; extortion"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.995,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.791,
    "summary": "Kylian Mbappé has filed a legal accusation against his former club, Paris Saint-Germain (PSG), alleging moral harassment. The Paris prosecutor's office confirmed the accusation and has since appointed a pair of investigators to handle the case. This development was reported by Le Parisien, citing AFP as their source.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about an ongoing legal issue involving a famous football player and his former club, providing useful context. However, it doesn't provide any actionable insights for the reader, nor does it report on any solutions, improvements, or attempts to solve the problem."
  },
  {
    "title": "Arsenal's Myles Lewis-Skelly Signs New Long-Term Contract",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 10:02:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Myles Lewis-Skelly has signed a new long-term contract at Arsenal, the Premier League club confirmed on Thursday.",
      "<p>Arsenal defender Myles Lewis-Skelly has signed a new long-term contract after making his first team debut last season.</p>",
      "Myles Lewis-Skelly's Grandma teams up with Arsenal to help surprise the youngster with friends and family after his new contract. X Credit: @Arsenal.",
      "Myles Lewis-Skelly has vowed to \"keep staying humble\" after signing a new long-term contract at Arsenal.",
      "<p>Jamie Benn signed a one-year contract to stay with the team, according to NHL Insider Frank Seravalli on Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Arsenal starlet Lewis-Skelly signs long-term deal",
      "Arsenal defender Myles Lewis-Skelly signs long-term contract",
      "Lewis-Skelly's wholesome contract surprise... from grandma!",
      "Lewis-Skelly vows to 'stay humble' after signing new Arsenal contract",
      "Stars captain Jamie Benn signing one-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.955,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.773,
    "summary": "Arsenal defender Myles Lewis-Skelly has signed a new long-term contract with the club, as confirmed by Arsenal on Thursday. Following his debut last season, this development secures his future at the club. The announcement was made special with a surprise gathering of friends and family, arranged by Arsenal and Lewis-Skelly's grandmother. He has expressed his commitment to \"stay humble\" following this new contract agreement.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a player's contract renewal but lacks depth or insight into the implications of this development for the club or the player's career. It doesn't provide actionable insights or deeper understanding for the reader."
  },
  {
    "title": "Big Ten, Big 12 Partner with PayPal for Athlete Compensation in $100M Deal",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 15:12:32 GMT",
    "source": "CNBC",
    "sources": [
      "CBS Sports",
      "CNBC"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "A new partnership between the Big Ten and Big 12 conferences and PayPal will allow student-athletes to receive their compensation via the fintech company.",
      "The Big 12's deal with PayPal is worth nearly $100 million over five years, sources tell CBS Sports."
    ],
    "image_url": "",
    "titles": [
      "PayPal teams up with the Big Ten and Big 12 to enable payments to student-athletes",
      "PayPal to disperse revenue-sharing payments to athletes in Big Ten, Big 12; will not acquire naming rights"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.979,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary": "The Big Ten and Big 12 conferences have entered into a partnership with PayPal, enabling student-athletes to receive compensation through the fintech platform. The agreement with the Big 12 is reported to be valued at nearly $100 million over a span of five years, according to CBS Sports. This deal marks a significant development in how student-athletes can receive payments.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights into how student-athletes can receive compensation, a topic of ongoing debate in the sports industry. It also reports on a significant innovation in the form of a partnership between sports conferences and a fintech platform, which is a solution to the problem of athlete compensation."
  },
  {
    "title": "NHL, NHLPA Begin Selection for 2028 World Cup of Hockey Host Cities",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 11:57:35 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The NHL and NHLPA have launched their host city selection process for World Cup of Hockey 2028, officially marking the return of the international best-on-best tournament.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPZ0V1bnRjajA1Zzg3blZJOXRvN2Q2ZHZHSVQwTldOR2RNNDBZRG1kX1VOQzV1NW9nRGhZYzZhN1NiY1J6VXg2YlgtWkZ0UldIYUk4ak5yTGI0SWFwaVNXUGZscUdSektpT1ZyM05QLXEzOGpjeWpyS2pyWUZDLWhfVVFfWUp4NmxDTTlSSA?oc=5\" target=\"_blank\">NHL, NHLPA begin host selection proce",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPY2tVeER4VzRocnBNNWRTMWJEMjFQRzk2SUo0T1hUdmgtcmRFLXlMT1R6V0hSX19COWNhU3JlV2owNXkyTG4wYTRBZ1VXLXVaRXA0MXl3cW1SclotZ2FjRTlodDlqcF93ODRzc2hWNE1UR2huOW5ZazE0Qi1FRkQ3ZkpwVQ?oc=5\" target=\"_blank\">NHL, NHLPA continuing discussions on new Collecti"
    ],
    "image_url": "",
    "titles": [
      "NHL, NHLPA launch World Cup 2028 host process",
      "NHL, NHLPA begin host selection process for World Cup of Hockey 2028 - NHL.com",
      "NHL, NHLPA continuing discussions on new Collective Bargaining Agreement - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.995,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.712,
    "summary": "The NHL and the NHLPA have officially initiated the process to select host cities for the World Cup of Hockey 2028, signaling the return of the prestigious international tournament. This move coincides with ongoing discussions about a new Collective Bargaining Agreement, indicating a period of significant planning and negotiation for the future of hockey.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs about the beginning of the selection process for the World Cup of Hockey 2028 host cities. It also contextualizes this information with ongoing discussions about a new Collective Bargaining Agreement, providing some insight into the future planning for the sport. However, it doesn't report on specific solutions or improvements."
  },
  {
    "title": "Wrexham Faces Southampton in First Championship Appearance in 40 Years",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 11:55:29 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Wrexham will begin their first Championship campaign in over 40 years away at former Premier League side Southampton, before a tough run in their first five.",
      "Birmingham vs Ipswich will kick off the new 2025/26 Sky Bet Championship season on Friday August 8, live on <em>Sky Sports</em>."
    ],
    "image_url": "",
    "titles": [
      "Wrexham to open Ch'ship season at Southampton",
      "Championship fixtures: Birmingham vs Ipswich, Southampton vs Wrexham open 2025/26"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.994,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.702,
    "summary": "Wrexham is set to start their first Championship season in over 40 years with an away game against former Premier League team Southampton. This marks the beginning of a challenging first five matches for them. Meanwhile, the 2025/26 Sky Bet Championship season will commence with Birmingham facing Ipswich on Friday, August 8, with the match being broadcast live on Sky Sports.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Wrexham's return to the Championship after a long absence, which could be significant for fans. It also informs about the start of the new season. However, it doesn't provide deeper insights or analysis, or report on any solutions or improvements."
  },
  {
    "title": "Micron Earnings Beat Expectations, AI Chip Demand Fuels Stock Surge",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 14:46:37 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Micron reported earnings and revenue on Wednesday that exceeded analysts' estimates.",
      "<figure><img alt=\"Bloomberg / Getty Images Micron Technology stock has gained over 50% in 2025 through Wednesday’s close\" src=\"https://www.investopedia.com/thmb/79GyCaq0zwrgOAFh8n7pWhDXLi8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2189904387-9426426a3d6c498c99836ba",
      "<figure><img alt=\"Justin Sullivan / Getty Images Micron reported record-high quarterly revenue after the bell on Wednesday\" src=\"https://www.investopedia.com/thmb/2gjbirZPyNNV2VzZxXCcZBB9GRQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2222120647-d7337c8d575c4f178c61e"
    ],
    "image_url": "",
    "titles": [
      "Micron reports earnings, revenue beat and issues strong forecast",
      "Micron Reports Record Revenue as Data Center Sales Surge on AI Demand",
      "Micron Gets Price Target Boosts on Record Revenue, Upbeat Outlook"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.97,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary": "Micron Technology Inc. reported earnings and revenue for the May quarter that surpassed analysts' expectations, driven by a surge in demand for artificial-intelligence chips, which increased sales of its high-bandwidth memory chips. This performance contributed to Micron's stock gaining over 50% in 2025 up to Wednesday's close.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about Micron's performance and the factors contributing to it, such as the demand for AI chips. However, it does not report on solutions, improvements, or attempts to solve problems, nor does it significantly increase awareness around systems, causes, or trends."
  },
  {
    "title": "Meta Wins Copyright Lawsuit; Getty Drops Claims Against Stability AI",
    "domain": "business",
    "location": "national",
    "published": "Thu, 26 Jun 2025 00:13:24 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Meta prevailed in a copyright case involving its AI model, but the federal judge left the door open for others to bring forward similar lawsuits.",
      "Getty Images dropped its primary claims of copyright infringement against Stability AI on Wednesday at London’s High Court, narrowing one of the most closely watched legal fights over how AI companies use copyrighted content to train their models.",
      "A federal judge sided with Meta on Wednesday in a lawsuit brought against the company by 13 book authors, including Sarah Silverman, that alleged the company had illegally trained its AI models on their copyrighted works."
    ],
    "image_url": "",
    "titles": [
      "Meta wins AI copyright case, but judge says others could bring lawsuits",
      "Getty drops key copyright claims against Stability AI, but UK lawsuit continues",
      "Federal judge sides with Meta in lawsuit over training AI models on copyrighted books"
    ],
    "score_components": {
      "magnitude": 0.69,
      "recency": 0.717,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary": "Meta won a significant legal victory in a copyright lawsuit filed by 13 authors, including Sarah Silverman, who claimed the company unlawfully trained its AI models using their copyrighted works. Federal Judge Vince Chhabria ruled in favor of Meta, emphasizing the company's fair use defense. Concurrently, Getty Images withdrew its primary copyright infringement claims against Stability AI in London, marking a notable week for the AI industry in copyright litigation. However, the judge noted that the potential market harm AI tools could cause to human-created content was not adequately addresse",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the legal landscape of AI and copyright infringement, which can inform readers, particularly those interested in technology, law, or AI. However, it does not clearly highlight solutions or progress, and while it mentions potential market harm, it does not delve deeply into the implications or causes."
  },
  {
    "title": "Utah Jazz Surprises by Selecting Ace Bailey as No. 5 Pick",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 11:57:35 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Rutgers forward Ace Bailey said he had \"no idea\" the Jazz had interest in taking him with the No. 5 pick, and a source told ESPN that Utah was not among his preferred destinations.",
      "Ace Bailey may not have wanted to land in Utah, but the Jazz provide the exact situation he can thrive in."
    ],
    "image_url": "",
    "titles": [
      "Bailey surprised by Jazz: 'No idea' they'd pick me",
      "Why Ace Bailey going to the Jazz is actually the best thing for him"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.995,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary": "Rutgers forward Ace Bailey was unexpectedly selected by the Utah Jazz with the No. 5 pick, despite Bailey expressing surprise at the choice, as he was unaware of the Jazz's interest in him. Additionally, a source revealed to ESPN that Utah was not on Bailey's list of preferred destinations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a surprising selection in a sports draft but does not provide deeper insights or understanding. It does not report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Ex-Barclays CEO Jes Staley Loses Legal Challenge, Lifetime Ban Upheld",
    "domain": "business",
    "location": "global",
    "published": "Thu, 26 Jun 2025 12:36:42 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Judge says former Barclays CEO did not fully disclose relationship with convicted sex offender but trims £1.8mn fine",
      "<p>Former Barclays CEO remains barred from holding senior financial roles after his ‘serious failure of judgment’</p><p>The former Barclays chief executive Jes Staley has lost a legal challenge against the UK financial regulator, leaving him banned from the City for life for misleading the watchdog "
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F6a29cb71-923b-4225-8d43-36c2e2144baf.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Jes Staley fails to overturn ban over Epstein links",
      "Jes Staley loses appeal against City ban for misleading watchdog over Epstein links"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.928,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary": "A judge ruled that former Barclays CEO Jes Staley did not fully disclose his relationship with a convicted sex offender, resulting in a legal challenge loss against the UK financial regulator. Consequently, Staley remains barred for life from holding senior financial roles in the City, marking a \"serious failure of judgment.\" His initial £1.8 million fine was reduced, but the ban remains in effect.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story is negative, it is constructive in that it provides useful insights into the consequences of failing to disclose conflicts of interest in senior financial roles. It increases awareness of the regulatory systems in place to maintain ethical standards in the financial industry, although it does not report on any solutions or improvements."
  },
  {
    "title": "Top Candidates Emerge to Succeed Powell as Fed Chair",
    "domain": "business",
    "location": "global",
    "published": "Thu, 26 Jun 2025 10:05:06 GMT",
    "source": "Investopedia",
    "sources": [
      "Forbes",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Al Drago / Bloomberg via Getty Images Fed Chair Jerome Powell's term ends in 11 months.\" src=\"https://www.investopedia.com/thmb/-aukUxvqbLrqN9EWw25k-EOxHPk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2221380181-d526d06cd501420ba2d6cccff1880521.jpg\" ",
      "The Polymarket prediction site identifies former Fed Governor Kevin Warsh, Fed Governor Christopher Waller and National Economic Council Director Kevin Hassett as the leading candidates to replace Powell."
    ],
    "image_url": "https://www.investopedia.com/thmb/-aukUxvqbLrqN9EWw25k-EOxHPk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2221380181-d526d06cd501420ba2d6cccff1880521.jpg",
    "titles": [
      "Trump Considers Naming Successor to Fed Chair Powell Early, Report Says",
      "How Soon Could Trump Replace Fed Chair? What To Know As He Reportedly Considers Powell Successor"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.88,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Jerome Powell's term as Federal Reserve Chair is set to end in 11 months. The prediction site Polymarket lists former Fed Governor Kevin Warsh, current Fed Governor Christopher Waller, and National Economic Council Director Kevin Hassett as top candidates to succeed Powell.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about potential successors to the Federal Reserve Chair, which could influence economic policy decisions. However, it does not provide in-depth analysis or insight into the potential impacts of these candidates' policies, limiting its overall constructiveness."
  },
  {
    "title": "What is an Xbox?",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-26T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "NASA",
      "The Verge"
    ],
    "domains": [
      "science",
      "technology"
    ],
    "snippets": [
      "Microsoft's \"This is an Xbox\" marketing campaign in November always felt a little too early. If you ask a friend or family member what an Xbox is, the response is likely going to be \"it's a game console.\" Xbox is ingrained in popular culture as a box under your TV that you play games on, [&#8230;]",
      "What are asteroids? Asteroids are rocky objects that orbit the Sun just like planets do. In fact, sometimes asteroids are called “minor planets.” These space rocks were left behind after our solar system formed about 4.6 billion years ago. Asteroids are found in a wide range of sizes. For example, o"
    ],
    "image_url": "",
    "titles": [
      "What is an Xbox?",
      "What Are Asteroids? (Ages 14-18)"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.995,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.66,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This title suggests a basic informational piece that may provide awareness about the Xbox, but without a summary, it's hard to determine if it offers any depth, insight, or actionable information."
  },
  {
    "title": "Sorenson Raises $150M for Third Fund; Jefferson Capital IPO Soars 27%",
    "domain": "business",
    "location": "global",
    "published": "Thu, 26 Jun 2025 11:27:06 +0000",
    "source": "Fortune",
    "sources": [
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Sorenson Capital has raised its third fund at $150 million, Fortune can exclusively report.",
      "Jefferson Capital Inc. shares rose as much as 27% in its public debut after the company and some of its backers raised $150 million in an initial public offering."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/Screenshot-2025-06-25-at-3.51.41 PM.png?w=2048",
    "titles": [
      "Exclusive: Sorenson Capital raises $150 million third fund to chase security and enterprise software deals",
      "Jefferson Capital Rises 27% After Bottom-Priced $150 Million IPO"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.905,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "Sorenson Capital successfully raised $150 million for its third fund, as reported exclusively by Fortune. In a related financial event, Jefferson Capital Inc. experienced a significant stock price increase, up to 27%, following its public debut. This surge came after the company and its investors raised $150 million through an initial public offering (IPO).",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of recent financial events, but it does not provide deeper understanding or actionable insights for the reader. It lacks context about what these events mean for the broader market or for individual investors."
  },
  {
    "title": "Intel is closing its automotive chipmaking business",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-26T09:19:14-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Intel is shutting down its business dedicated to making processors for cars. In a memo seen by The Oregonian, Intel tells workers that it plans to lay off “most” employees in the division, citing plans to shift focus to its “core client and data center portfolio.” “As part of this work, we have deci",
      "Intel has decided to close down its automotive business, a decision that will lead to layoffs."
    ],
    "image_url": "",
    "titles": [
      "Intel is closing its automotive chipmaking business",
      "Intel hits the brakes on its automotive business, and layoffs have started"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.941,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.656,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This title indicates a potentially significant development in the tech industry, which could impact various stakeholders. However, without a summary, it's unclear whether the story provides any depth, insight, or actionable information."
  },
  {
    "title": "Axiom Space Launch: First Astronauts from India, Poland, Hungary to ISS in 40 Ye",
    "domain": "business",
    "location": "global",
    "published": "Thu, 26 Jun 2025 14:59:33 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune",
      "Phys.org"
    ],
    "domains": [
      "business",
      "science"
    ],
    "snippets": [
      "Axiom Space, based in Houston, arranged the chartered flight, which was commanded by America’s most experienced astronaut, Peggy Whitson.",
      "The first astronauts in more than 40 years from India, Poland and Hungary arrived at the International Space Station on Thursday, ferried there by SpaceX on a private flight."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/AP25177458308972.jpg?w=2048",
    "titles": [
      "Meet Shubhanshu Shukla, Tibor Kapu, and Slawosz Uznanski-Wisniewski, the first astronauts from India, Hungary, and Poland to visit the International Space Station",
      "International Space Station welcomes its first astronauts from India, Poland and Hungary"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.975,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "Axiom Space, a Houston-based company, organized a private flight to the International Space Station (ISS), marking the arrival of the first astronauts from India, Poland, and Hungary in over 40 years. The flight, which took place on Thursday, was facilitated by SpaceX and led by Peggy Whitson, America's most experienced astronaut. This event signifies a notable moment in international space collaboration.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  },
  {
    "title": "\"Top 3 MLB Pitcher Strikeout Prop Bets Identified by SportsLine Model\"",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 14:48:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Thursday's nine-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/26/9039baaa-67a1-4564-8f70-3659e7b945ec/janson-junk.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Marlins starter against Giants"
    ],
    "score_components": {
      "magnitude": 0.269,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.517,
    "summary": "The SportsLine Projection Model, after running 10,000 simulations of every MLB game on Thursday's nine-game schedule, has pinpointed the top three pitcher strikeout prop bets. This analysis utilizes advanced algorithms to forecast player performance outcomes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers interested in sports betting. It uses advanced algorithms to predict player performance, thus offering a deeper understanding of the game. However, it does not report on solutions, improvements, or innovations, nor does it raise awareness about systems, causes, or impacts."
  },
  {
    "title": "Researchers develop a battery cathode material that does it all",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 15:08:01 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A mix of iron, chlorine, and lithium is conductive, stores lithium, and self-heals."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/GettyImages-2150496772-1152x648.jpg",
    "titles": [
      "Researchers develop a battery cathode material that does it all"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.457,
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story appears to report on a significant innovation in battery technology, which could have wide-ranging impacts. It suggests progress in the field and potentially offers insights into the research process and implications. However, without the summary, it's hard to fully assess its depth and usefulness."
  },
  {
    "title": "YouTube adds an AI Overviews-like search results carousel",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 14:08:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "YouTube is rolling out new AI-powered features to help users find content and information more easily, the company announced on Thursday."
    ],
    "image_url": "",
    "titles": [
      "YouTube adds an AI Overviews-like search results carousel"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new feature on a popular platform, YouTube. It highlights an innovation that could potentially improve the user experience. However, without the summary, it's hard to assess the depth of the story."
  },
  {
    "title": "Study: Vitamin C May Promote Younger-Looking Skin by Activating Genes",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 15:36:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/thicker-younger-skin-vitamin-c-reactivates-key-growth-genes/\" rel=\"nofollow\" title=\"Thicker, Younger Skin? Vitamin C Reactivates Key Growth Genes\"><img alt=\"Gold Bubble Serum on Skin Layer\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scite"
    ],
    "image_url": "",
    "titles": [
      "Thicker, Younger Skin? Vitamin C Reactivates Key Growth Genes"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary": "A study highlighted by SciTechDaily suggests that Vitamin C can promote thicker, younger-looking skin by reactivating key growth genes. This discovery points to the potential of Vitamin C in skincare, emphasizing its role in enhancing skin health and appearance by influencing genetic factors linked to skin growth and repair.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the potential benefits of Vitamin C for skin health. It also highlights an innovative discovery about Vitamin C's role in activating key growth genes, which may contribute to solutions or improvements in skincare."
  },
  {
    "title": "Anti-Aging Drug Mimics Lifespan Extension of Calorie Restriction: Study",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 15:01:04 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-anti-aging-drug-rivals-calorie-cutting-for-longer-life-study-finds/\" rel=\"nofollow\" title=\"This Anti-Aging Drug Rivals Calorie Cutting for Longer Life, Study Finds\"><img alt=\"Senior Hands Medicine Pills Close\" class=\"webfeedsFeaturedVisual wp-post-image\" height"
    ],
    "image_url": "",
    "titles": [
      "This Anti-Aging Drug Rivals Calorie Cutting for Longer Life, Study Finds"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "A study has discovered that a specific anti-aging drug can extend lifespan similarly to the effects of calorie restriction. The research, focusing on the drug's impact compared to dietary methods known for prolonging life, indicates a significant advancement in anti-aging treatments. This breakthrough could offer a new approach to increasing longevity without the need for strict dietary limitations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a significant advancement in anti-aging treatments. It reports on a solution to a problem (aging), and could help readers make decisions about their health and longevity."
  },
  {
    "title": "Researchers Discover Peptides Self-Assemble on Solid Surfaces for Nanotech",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 11:04:47 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Researchers at the Nano Life Science Institute (WPI-NanoLSI), Kanazawa University, report in Small, on how short peptides self-assemble linearly on atomically-thick solid surfaces, such as graphite and MoS2."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/from-hydration-layers.jpg",
    "titles": [
      "From hydration layers to nanoarchitectures: Water's pivotal role in peptide organization on 2D nanomaterials"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "Researchers at the Nano Life Science Institute, Kanazawa University, have discovered that short peptides can self-assemble into linear formations on atomically-thick solid surfaces like graphite and MoS2. This finding, reported in the journal Small, could have significant implications for the development of nanoscale materials and technologies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive because it increases awareness about a new discovery in nanotechnology. It provides the reader with a deeper understanding of how peptides can self-assemble on solid surfaces, which is useful information for those interested in this field."
  },
  {
    "title": "People use AI for companionship much less than we’re led to think",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 14:21:28 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A report by Anthropic reveals that people rarely seek companionship from AI, and turn to AI for emotional support or advice only 2.9% of the time."
    ],
    "image_url": "",
    "titles": [
      "People use AI for companionship much less than we’re led to think"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a useful context and insight into the use of AI for companionship, challenging common perceptions. It increases clarity around the trend of AI companionship, but it does not report on solutions or improvements."
  },
  {
    "title": "Mamyshev Oscillator Advances High-Energy Laser Pulse Generation",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 11:04:30 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The Mamyshev oscillator (MO) is a type of fiber laser capable of producing high-energy laser pulses at a tunable repetition rate. It is a mode-locked laser which uses light traveling within a closed-loop cavity to produce laser emission. Harmonic mode-locking (HML) is an advanced form of mode-lockin"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ieee-study-reveal-the.jpg",
    "titles": [
      "How harmonic mode-locked Mamyshev oscillators build up multiple laser pulses per cycle"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary": "The Mamyshev oscillator (MO) is a fiber laser that generates high-energy, tunable repetition rate laser pulses through mode-locking, a process where light circulates in a closed-loop cavity. It employs Harmonic mode-locking (HML), an enhanced mode-locking technique, to achieve its performance. This technology is significant for applications requiring precise, high-energy laser pulses.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about advancements in high-energy laser pulse generation. However, it lacks a clear explanation of the potential applications and impacts of this technology, which would have made it more useful to the reader."
  },
  {
    "title": "Cambrian Explosion: Dawn of Diverse Life Forms 530 Million Years Ago",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 11:04:07 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The Cambrian explosion was an extraordinary phenomenon in the evolution of life on the planet that led to the emergence of many animal phyla and the diversification of species. During this period, some 530 million years ago, most of the basic body plans of organisms that have survived to the present"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/cambrian-explosion-may.jpg",
    "titles": [
      "Cambrian explosion may have occurred 15 million years earlier than previously thought"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary": "The Cambrian explosion, occurring around 530 million years ago, was a significant evolutionary event where many animal phyla emerged, leading to a vast diversification of species. This period marked the establishment of most basic body plans of organisms that exist today.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into a significant event in evolutionary history, contributing to the reader's understanding of the origins of diverse life forms. However, it does not report on progress, solutions, or innovations, nor does it provide actionable insights."
  },
  {
    "title": "Suno snaps up WavTool for its AI music editing tools amid ongoing dispute with music labels",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 15:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AI music company Suno acquired WavTool, a browser-based AI DAW. This aims to improve editing capabilities for musicians."
    ],
    "image_url": "",
    "titles": [
      "Suno snaps up WavTool for its AI music editing tools amid ongoing dispute with music labels"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.436,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the acquisition of WavTool by Suno, which could impact the music industry. However, it does not provide a solution or progress on the ongoing dispute with music labels, and the depth of understanding is somewhat limited."
  },
  {
    "title": "UN Reports 828 Million People Globally Suffer from Hunger",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 10:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "There is a growing and urgent need to address global food insecurity. This urgency is underscored by reports from the Food and Agriculture Organization of the United Nations, which states that nearly 828 million people suffer from hunger worldwide."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/tomatoes-greenhouse.jpg",
    "titles": [
      "Autonomous AI systems can help tackle global food insecurity"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.433,
    "summary": "The Food and Agriculture Organization of the United Nations reports that global food insecurity is a pressing issue, with nearly 828 million individuals worldwide suffering from hunger. This highlights the urgent need for actions to address the growing problem of food scarcity on a global scale.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about a significant global issue, potentially increasing their understanding of food scarcity and its scale. However, it does not report on solutions or attempts to solve this problem, nor does it provide actionable insights for the reader."
  },
  {
    "title": "Study Finds Trees Favor Nitrate Over Ammonium, Challenging Old Beliefs",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 10:00:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new study published in the Journal of Plant Ecology has found that temperate forest tree species, regardless of their root symbiosis with either ectomycorrhizal (ECM) or arbuscular mycorrhizal (AM) fungi, consistently prefer absorbing nitrate (NO₃⁻) over ammonium (NH₄⁺). The findings challenge lon"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-study-reveals-cons.jpg",
    "titles": [
      "New study reveals consistent nitrate preference across temperate forest tree species in Northeast China"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.433,
    "summary": "A study in the Journal of Plant Ecology reveals that temperate forest trees prefer nitrate (NO₃⁻) over ammonium (NH₄⁺) for absorption, regardless of their root's symbiotic relationship with ectomycorrhizal (ECM) or arbuscular mycorrhizal (AM) fungi. This discovery challenges previous beliefs about tree nutrient preferences.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers a deeper understanding of tree nutrient preferences, challenging established beliefs and contributing to the readers' knowledge. However, it lacks a clear indication of how this discovery could be applied or used, limiting its score."
  },
  {
    "title": "Manchester United Advised to Target Everton's Beto for Scoring Boost",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 26 Jun 2025 15:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester United have been told to forget about Viktor Gyokeres and turn their attention towards Everton striker Beto.The Red Devils were abysmal in front of goal in the 2024/25 season, as depicted b..."
    ],
    "image_url": "",
    "titles": [
      "Club president urges Man Utd to sign 8-goal EPL striker: &#8220;Gyokeres would struggle&#8221;"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "summary": "Manchester United has been advised to shift their focus from Viktor Gyokeres to Everton striker Beto, following a disappointing performance in scoring during the 2024/25 season. This strategic suggestion comes as the team seeks to enhance their offensive capabilities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for Manchester United fans and those interested in football strategies. It offers insight into potential team decisions and player performance. However, it doesn't highlight any solutions or improvements, nor does it increase clarity around systems or causes."
  },
  {
    "title": "Reddit CEO pledges site will remain “written by humans and voted on by humans”",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 13:54:32 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Reddit is in an “arms race” to protect its communities from AI-generated content."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/GettyImages-2150483549-1024x648.jpg",
    "titles": [
      "Reddit CEO pledges site will remain “written by humans and voted on by humans”"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Reddit's stance on AI and human involvement, which can be valuable to users and those interested in the platform's policies. It contributes to the reader's understanding of the platform's operation, but without a summary, it's unclear if it provides actionable insights or deeper understanding."
  },
  {
    "title": "Summer Brings Joy and Uncertainty for Many Families",
    "domain": "science",
    "location": "global",
    "published": "Thu, 26 Jun 2025 09:44:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As the school year wraps up, many children are keen for summer break. Summer means sunshine, and hopefully popsicles and lots of playtime. But for many families, summer also brings a combination of excitement and uncertainty."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/summer-break.jpg",
    "titles": [
      "Summer break brings uncertainty for children, and kindness at home matters"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.95,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "As the school year ends, children look forward to summer for its sunshine, popsicles, and playtime. However, for many families, the season also presents a mix of excitement and uncertainty.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story raises awareness about the mixed feelings families may experience as summer approaches, it lacks depth and actionable insights. It doesn't provide solutions or strategies for dealing with the uncertainty, nor does it delve into the causes or impacts of this issue."
  },
  {
    "title": "Jeff Bezos is reportedly courting Trump after public spat with Musk",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 26 Jun 2025 14:35:21 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Bezos allegedly sees an opening for his space company, Blue Origin, now that Musk has been diminished in the eyes of the President."
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos is reportedly courting Trump after public spat with Musk"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.392,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the relationship between Bezos, Trump, and Musk, but it lacks depth and insight. It does not provide actionable insights or deeper understanding, nor does it report on solutions or improvements."
  }
]