[
  {
    "title": "Trump Plans Major Sanctions on Russia, Tariffs on China to End Ukraine War",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 10:05:36 -0400",
    "source": "NPR",
    "sources": [
      "Financial Post",
      "Axios",
      "NPR",
      "Global News",
      "Deutsche Welle",
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "financialpost.com",
      "www.theguardian.com",
      "globalnews.ca",
      "ottawa.citynews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Trump tells NATO members they need to cut off Russia energy purchases before he will take bigger steps to isolate Russia over its war in Ukraine.",
      "US President Donald Trump has said he is ready to sanction Moscow if all NATO allies halt purchases of Russian oil. Russian forces have used a pipeline to approach a front-line town in Ukraine. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1DTmpwX3h6SnRxN3BEMGNNWm9ZcU5ucVJzZ1MtUHZ4bzJLV3dDMFhQTkh0emdSeV9zV1hRdlBrelFkTE81Q2ZpMXZOWTNFaFJQYXYtY21lM3BKaldER1RtOXNpdHN3ay11aTVzYjA0TEF6bkd2QmVUbmRxdjBOSVE?oc=5\" target=\"_blank\">Trump ties new Russia sanctions to NATO tariffs on China",
      "<p>In Truth Social post, US president also suggests members consider imposing tariffs of 50% to 100% on China</p><p>Donald Trump has said he is ready to impose sanctions on Moscow, but on the condition that all Nato allies agree to completely halt purchases of Russian oil and implement their own san",
      "Trump posted on his social media site that NATO’S commitment to winning the war \"has been far less than 100%\"",
      "US President Donald Trump said he’s prepared to move ahead with “major” sanctions on Russian oil if NATO countries do the same.",
      "BASKING RIDGE, N.J. (AP) — President Donald Trump said Saturday he believes the Russia-Ukraine war would end if all NATO countries stopped buying oil from Russia and placed tariffs on China of 50% to 100% for its purchases of Russian petroleum. Trump posted on his social media site that NATO’S commi"
    ],
    "image_url": "",
    "titles": [
      "Trump tells NATO members they must move first on Russia sanctions over Ukraine",
      "Ukraine: Trump tells NATO allies to stop buying Russian oil",
      "Trump ties new Russia sanctions to NATO tariffs on China - Axios",
      "Trump ‘ready’ to impose sanctions on Russia if Nato nations stop buying its oil",
      "Trump calls on all NATO countries to stop buying Russian oil, threatens tariffs on China",
      "Trump Backs New Sanctions When NATO Stops Buying Russian Oil",
      "Trump calls on all NATO countries to stop buying Russian oil, threatens 50% to 100% tariffs on China"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.957,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.876,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump has stated he will impose major sanctions on Russia, aiming to isolate the country over its war in Ukraine, on the condition that all NATO allies cease purchasing Russian oil. He suggested that NATO's efforts in the conflict are insufficient and also proposed imposing tariffs of 50% to 100% on China for its purchases of Russian oil, believing these actions would help end the Russia-Ukraine war.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Utah Man Arrested for Murder of Activist Charlie Kirk",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 11:51:33 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "ABC News",
      "LA Times",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.npr.org",
      "www.latimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "\"This is everywhere. Every community, every town, every state,\" one of the suspect's neighbors said. \"It's going to be everybody's neighbor, everybody's classmate. It's not at all unusual anymore.\"",
      "Sitting outside was a grey car, similar to the model detectives said the suspect used to drive to the scene of the attack.",
      "Utah governor was criticised after he said he prayed that the man suspected of shooting Kirk “wouldn’t be one of us.&quot;",
      "NEW: A suspect has been arrested in the fatal shooting of conservative activist Charlie Kirk, officials announced.",
      "ABC News' Aaron Katersky reports on the casings that Utah Gov. Spencer Cox says were found on the scene.",
      "<p>Tyler Robinson had been close to his parents and two brothers growing up, and would often go on outings camping or hunting, a neighbor said.</p>"
    ],
    "image_url": "",
    "titles": [
      "Utah residents are reeling knowing the Charlie Kirk suspect is one of their own",
      "Watch: What we know about Charlie Kirk suspect Tyler Robinson",
      "‘One of us’, Utah governor’s remark on Charlie Kirk suspect criticised",
      "WATCH:  Utah governor says suspect in killing of Charlie Kirk is in custody",
      "WATCH:  Suspect in killing of Charlie Kirk in custody, officials say",
      "What we know about Tyler Robinson, the young suspect in Charlie Kirk killing"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.993,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.853,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A 22-year-old man from Utah has been arrested for the murder of conservative activist Charlie Kirk. Casings were found at the scene, as reported by Utah Governor Spencer Cox. President Trump confirmed that a suspect is now in custody regarding the fatal shooting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Fantasy Football Updates: Rankings, Projections, Expert Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 10:43:19 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine's model reveals its Week 2 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "DFS millionaire Mike McClure shares his top daily fantasy football picks and lineup advice for the Week 2 Sunday NFL schedule",
      "Will the Week 2 NFL matchup favor Justin Fields or Daniel Jones? Can you trust Nick Chubb against the Tampa Bay Buccaneers defense? Do you dare play New England Patriots?"
    ],
    "image_url": "",
    "titles": [
      "📈 Fantasy football rankings for NFL Week 2",
      "Fantasy Football Rankings, sleepers, streamers, cheat sheets for NFL Week 2, 2025 in PPR, standard leagues",
      "NFL DFS, Week 2: FanDuel, DraftKings daily Fantasy football picks include Travis Kelce, Christian McCaffrey",
      "NFL 2025 Week 2: Best/Worst Fantasy Football Matchups By Position"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The latest fantasy football updates include weekly individual and composite rankings for PPR and IDP formats, with additional superflex ranks by Eric Karabell. SportsLine's model has released Week 2 projections, PPR rankings, and start-sit advice applicable to platforms such as CBS Sports, ESPN, and Yahoo. DFS expert Mike McClure has also provided his top picks and lineup suggestions for Week 2's NFL games. The analysis covers player matchups, including the performance outlook for Justin Fields, Daniel Jones, Nick Chubb, and the viability of starting players against the New England Patriots de",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crawford vs. Alvarez: Anticipated Boxing Match Set for Saturday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 08:22:27 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Terence Crawford wanted the fight he wasn't supposed to win. He gets that opportunity Saturday after a yearslong chase.",
      "The pair of legendary fighters look to make history on Saturday night in Sin City",
      "SportsLine combat expert Josh Nagel has released his top boxing picks for Saturday's Canelo Alvarez vs. Terence Crawford fight on Netflix",
      "The biggest boxing match of the year is happening tonight. Here's how to watch Canelo Álvarez vs. Terence Crawford, including the start time, full match card and more."
    ],
    "image_url": "",
    "titles": [
      "How Terence Crawford landed Canelo Alvarez",
      "Canelo Alvarez vs. Terence Crawford fight predictions, expert picks for epic event in Las Vegas",
      "Canelo Alvarez vs. Terence Crawford prediction, odds, line, time: Picks from boxing expert who's up $1,500",
      "How To Watch The Canelo Vs. Crawford Fight On Netflix"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Terence Crawford will face Canelo Alvarez in a highly anticipated boxing match on Saturday, following years of pursuit for this challenging fight. The event includes a full card, with details on the main event's ring walk time available for those interested.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Director's Error After Kirk Assassination Leads to Wrongful Detentions",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Sep 2025 12:45:28 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "There is high-stakes uncertainty surrounding Patel’s leadership of the bureau when its credibility — and his own — are under extraordinary pressure.",
      "WASHINGTON (AP) — Hours after the assassination of conservative activist Charlie Kirk, FBI Director Kash Patel declared online that “the subject” in the killing was in custody. The shooter was not. The two men who had been detained were quickly released. Utah officials acknowledged that the gunman r"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/CP174989462.jpg?quality=65&strip=all",
    "titles": [
      "FBI director faces congressional hearings after missteps in Kirk assassination probe",
      "Patel faces congressional hearings after missteps in Kirk assassination probe and turmoil at FBI"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hours after the assassination of conservative activist Charlie Kirk, FBI Director Kash Patel mistakenly declared the shooter was in custody, leading to the release of two wrongly detained men. This incident has significantly pressured both the bureau's and Patel's credibility, highlighting a high-stakes uncertainty surrounding Patel's leadership amid the turmoil.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Gov. Cook's Condo Tagged \"Vacation Home,\" Counters Fraud Claim",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 11:23:53 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Fortune"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com"
    ],
    "snippets": [
      "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "Documents obtained by The Associated Press also showed that on a second form submitted by Cook to gain a security clearance, she described the property as a “second home.”"
    ],
    "image_url": "",
    "titles": [
      "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "Fed Governor Lisa Cook claimed 2nd residence as ‘vacation home,’ undercutting fraud claims used by Trump to fire her"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Documents reveal Fed Gov. Lisa Cook labeled a condo purchased in 2021 as a \"vacation home\" on a loan estimate, conflicting with Trump administration accusations of mortgage fraud. Additionally, for security clearance, she referred to it as a “second home,” as per The Associated Press.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Quinshon Judkins to Make NFL Debut with Browns Against Ravens",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 10:43:18 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Browns rookie running back Quinshon Judkins is expected to make his NFL debut against the Ravens, sources told ESPN.",
      "The Browns' second round pick signed just before Week 1 after having a battery charge dropped"
    ],
    "image_url": "",
    "titles": [
      "Sources: Browns RB Judkins expected to debut",
      "Browns RB Quinshon Judkins expected to make NFL debut vs. Ravens one week after signing deal, per report"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Browns rookie running back Quinshon Judkins, who was a second-round pick, is set to make his NFL debut against the Ravens, according to ESPN sources. This follows the dropping of a battery charge that allowed him to sign with the team just before Week 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stellantis Halts Ram 1500 REV, Unveils Ramcharger Extended-Range Truck",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 20:56:26 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Ram said it would still plan to launch an extended-range electric truck, which is equipped with an electric generator and a gas engine.",
      "Stellantis announced that it was discontinuing its Ram 1500 REV electric truck, citing slowing sales of heavy-duty electric trucks. The name plate, however, will live on. Stellantis said that it was renaming its Range-Extended Electric Vehicle (REEV) Ramcharger pickup to Ram 1500 REV. “This vehicle ",
      "Stellantis, the parent company of Ram, said Friday that it will no longer develop a battery-electric full-size pickup. The company cited low demand for full-size battery-electric trucks as the primary reason."
    ],
    "image_url": "",
    "titles": [
      "Ram cancels plans for all-electric pickup truck",
      "Stellantis cancels Ram 1500 REV as electric truck demand dims",
      "Ram ends EV pickup truck plans"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.656,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Stellantis announced the discontinuation of the Ram 1500 REV electric truck due to low demand for full-size battery-electric trucks. However, they plan to launch an extended-range electric truck, now named Ramcharger, featuring an electric generator and a gas engine. This move reflects a shift in their electric vehicle strategy while maintaining the Ram nameplate.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Pleads Guilty to Arson at MP Sharon Hodgson's Office",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 12:49:36 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Joshua Oliver, 28, who had been living in a tent near the building, will be sentenced in October.",
      "<p>Joshua Oliver, 28, pleaded guilty to arson that gutted premises in Washington, Tyne and Wear</p><p>A 28-year-old man has admitted to starting a fire that destroyed the constituency office of Labour MP Sharon Hodgson.</p><p>Joshua Oliver, of no fixed address, pleaded guilty to arson, with the resu"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/98a1/live/fcdf8b00-9074-11f0-8846-9bcb3d85cb2b.jpg",
    "titles": [
      "Man admits arson at Labour MP's office building",
      "Man admits starting fire that destroyed Labour MP Sharon Hodgson’s office"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Joshua Oliver, 28, pleaded guilty to committing arson that destroyed the constituency office of Labour MP Sharon Hodgson in Washington, Tyne and Wear. Living in a tent near the building, Oliver, who has no fixed address, will face sentencing in October.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "phrases: fixed",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tigers' Skubal Exits Game With Side Tightness Amid Postseason Concerns",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 08:53:48 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "All of the important fantasy spin and actionable takeaways resulting from the latest baseball news.",
      "<p>The Detroit Tigers will be holding their breath after ace Tarik Skubal left Friday&#8217;s game in the fourth inning with a trainer.</p>"
    ],
    "image_url": "",
    "titles": [
      "News: Tigers' Tarik Skubal exits start early with tightness in side",
      "Tigers’ Tarik Skubal leaves vs. Marlins with left side tightness in 4th inning"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tarik Skubal, the Detroit Tigers' star left-hander, exited the game against the Marlins in the fourth inning due to tightness in his left side. This occurred during an 8-2 loss for the Tigers. The team and fans are concerned about his availability for the postseason, considering his key role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LA Kings' Corey Perry Out 6-8 Weeks for Knee Surgery",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 15:43:59 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Los Angeles Kings forward Corey Perry will be sidelined for six to eight weeks after undergoing knee surgery.  The Kings will report for training camp in less than a week, and their season opener is Oct. 7 against Colorado.  Perry agreed to a one-year, $2 million contract laden with incentives to jo",
      "<p>Los Angeles Kings veteran forward Corey Perry will be out six-to-eight weeks after undergoing successful knee surgery, the team announced Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "LA Kings forward Corey Perry has knee surgery that will sideline him for 6-8 weeks",
      "Kings’ Corey Perry out several weeks after undergoing knee surgery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Los Angeles Kings forward Corey Perry will miss six to eight weeks due to knee surgery. This announcement comes as the Kings prepare for training camp and ahead of their season opener on October 7 against Colorado. Perry recently signed a one-year contract with the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Black Ferns Beat South Africa 46-17, Advance to World Cup Semi-Finals",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 15:33:28 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Defending champions New Zealand overcome a slow start and a spirited South Africa side to seal their spot in the Women's Rugby World Cup semi-finals.",
      "<ul><li><p>Quarter-final: New Zealand 46-17 South Africa</p></li><li><p>Black Ferns score six tries in second-half romp</p></li></ul><p>In New Zealand rugby the female of the species is currently deadlier then the male. South Africa’s women were always going to struggle to replicate <a href=\"https:/"
    ],
    "image_url": "",
    "titles": [
      "Black Ferns beat South Africa to reach semis",
      "New Zealand blitz South Africa after break to reach Women’s Rugby World Cup semis"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New Zealand defeated South Africa 46-17 in the Women's Rugby World Cup quarter-final, securing their place in the semi-finals. Despite a challenging start, the defending champions, known as the Black Ferns, rallied to score six tries in the second half, showcasing their dominance and advancing in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Share Picks for Week 3 College Football, Highlight Top Bets",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 14:57:04 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.backingthepack.com"
    ],
    "snippets": [
      "Thomas Casale has locked in his top three college football picks for Week 3 and his CFB parlay could pay out around +600",
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 3 college football schedule",
      "SportsLine's computer model has revealed its Week 3 college football picks, which include Arch Manning and Texas covering",
      "The SportsLine Projection Model has revealed its Northwestern Wildcats vs. Oregon Ducks picks for Saturday",
      "The Alabama Crimson Tide take on the Wisconsin Badgers in Week 3 of the college football season on Saturday",
      "The Clemson Tigers take on the Georgia Tech Yellow Jackets in Week 3 of the college football season on Saturday",
      "SportsLine expert Mike Tierney has revealed his Georgia Tech vs. Clemson picks in the Week 3 Saturday matchup",
      "Sit back, relax, and strap it down. Or go outside and enjoy the weather, if you must. There’s at least one compelling game in each window today. Noon Clemson vs. Georgia Tech 3:30 UGA vs. TennesseePitt vs. West Virginia 4:30 USF vs. Miami 7:30 Texas A&amp;M vs. Notre DameFlorida vs. LSUVanderbilt vs"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/12/597441b0-1b7a-4628-a295-0ef0c3d8e675/carson-beck-miami-hurricanes-imagn-images.jpg",
    "titles": [
      "2025 college football picks, Week 3 odds, lines, predictions from betting expert: This parlay returns 6-1",
      "2025 college football Week 3 picks against the spread, odds, betting lines, trends: Expert makes best bets",
      "College football odds, picks, predictions for Week 3, 2025: Computer backs Texas, Oregon State in best bets",
      "Oregon vs. Northwestern prediction, odds, start time: 2025 college football Week 3 picks from proven computer",
      "Alabama vs. Wisconsin: Where to watch college football Week 3, odds, betting picks, promos for Saturday",
      "Clemson vs. Georgia Tech: Where to watch college football Week 3, odds, betting picks, promos for Saturday",
      "Clemson vs. Georgia Tech prediction, odds, time: 2025 Week 3 college football picks from expert on 6-0 run",
      "College football Week 3 open thread"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Experts and models have made their picks for Week 3 of the college football season. Thomas Casale offers a parlay with a potential +600 payout, while Bruce Marshall highlights the week's best betting values. SportsLine's computer model and Mike Tierney have made their selections, including predictions for the Texas, Northwestern vs. Oregon, Alabama vs. Wisconsin, Clemson vs. Georgia Tech, and other key matchups. The schedule features compelling games throughout the day, including notable clashes like Clemson vs. Georgia Tech, UGA vs. Tennessee, and Texas A&M vs. Notre Dame.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "7.4 Magnitude Earthquake Strikes Kamchatka, Tsunami Alerts Issued",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 05:09:59 -0400",
    "source": "ABC News",
    "sources": [
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "A powerful 7.4 magnitude earthquake has struck near the east coast of Russia&rsquo;s Kamchatka region",
      "The quake briefly triggered tsunami alerts at nearby coastlines, less than two months after a larger earthquake sent tsunami waves across the Pacific."
    ],
    "image_url": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_4x3t_384.jpg",
    "titles": [
      "Powerful earthquake strikes near the east coast of Russia’s Kamchatka region",
      "7.4-Magnitude Earthquake Strikes Russia’s Far East"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.864,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A 7.4 magnitude earthquake hit near the east coast of Russia's Kamchatka region, briefly causing tsunami alerts for nearby coastlines. This event comes less than two months after a larger quake triggered tsunamis across the Pacific. The current status of the tsunami alerts has not been specified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"KPop Demon Hunters\" Soundtrack Tops Charts in South Korea and the US",
    "domain": "business",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 09:00:00 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "Forbes"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.forbes.com"
    ],
    "snippets": [
      "South Korea gave the world BTS and “Gangnam Style,” “Parasite” and snail mucus face cream. The U.S. sent back “KPop Demon Hunters” — and South Koreans love it.",
      "Huntr/x’s “Golden,” from the KPop Demon Hunters soundtrack, spends a fourth week at No. 1 on the Hot 100, tying historic girl group hits like TLC’s “No Scrubs.”"
    ],
    "image_url": "",
    "titles": [
      "South Korea is going wild for ‘KPop Demon Hunters,’ made in the U.S.",
      "‘KPop Demon Hunters’ Ties The Supremes And TLC"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.861,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "South Korea's cultural exports like BTS, \"Gangnam Style,\" \"Parasite,\" and snail mucus face cream have been globally celebrated. In response, the U.S. produced \"KPop Demon Hunters,\" which has gained popularity in South Korea. The soundtrack's song \"Golden\" by Huntr/x has topped the Hot 100 chart for four weeks, matching the success of iconic hits like TLC's \"No Scrubs.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Utah Man Arrested for Murder of Activist Charlie Kirk",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 07:22:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Al Jazeera"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A 22-year-old Utah man has been arrested and booked for killing the prominent right-wing activist.",
      "Officials said that 22-year-old Tyler Robinson of Utah has been arrested in connection with Charlie Kirk's death."
    ],
    "image_url": "",
    "titles": [
      "Suspect in Charlie Kirk killing caught in US; widow vows to carry on legacy",
      "Charlie Kirk's widow vows to continue his work after killing suspect arrested"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.832,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A 22-year-old man from Utah has been arrested for the murder of conservative activist Charlie Kirk. Casings were found at the scene, as reported by Utah Governor Spencer Cox. President Trump confirmed that a suspect is now in custody regarding the fatal shooting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chagas Disease, Spread by Kissing Bug, Now Endemic in the US",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-13T05:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Chagas disease, previously prevalent mainly in Latin America, is now increasingly occurring in the US. The \"kissing bug\" passes on a parasite that can cause life-threatening damage to the heart and nerves.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE53Y2RoQ1pFTTVsUkpvY3I3ampuSHZIYkdoQ0hocnczZURfMDJnQ1AxbjlhN2FsdUJyRWM3MWlzOWJNdGRweE10ZUxycl9vTDZfSzBfdVR4ZUl6aC1MYk92MzBOVGc0SDJGMElfd3lKMzRVNVlEYVU4aGRBQQ?oc=5\" target=\"_blank\">\"Kissing bug\" disease now seen as \"endemic\" in the U.S.</a>&n"
    ],
    "image_url": "",
    "titles": [
      "Chagas disease: 'Kissing bug' spreads in the US",
      "\"Kissing bug\" disease now seen as \"endemic\" in the U.S. - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.799,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Chagas disease, primarily found in Latin America, is now increasingly diagnosed in the US. It is transmitted by the \"kissing bug,\" leading to serious heart and nerve damage. This condition is now considered endemic in the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "USAID-Funded Birth Control Stuck in Belgium Amid Aid Cuts",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 22:20:14 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQNmJxd01fNGVLenBCNjdNcnN3UGZGTDd1TV9kZ28yRHB4UW01NlRhTzlZTGhjX091T291a0hhSmZEVWUzTUtsLWNNa21ud2R0UnFwamVZbXM5eGhYQy1JeVZhM1hqVTdtMVQwOFpLc1ZBbWhrYzIzMUFwM2I0QVN1OExlUGJoa0VIdjZxWUUyaw?oc=5\" target=\"_blank\">Advocates urge Trump not to destr",
      "The birth control pills, IUDs and hormonal implants were purchased by U.S.A.I.D. for women in low-income countries. They had been in limbo in a Belgian warehouse after the U.S. cut much of its foreign aid."
    ],
    "image_url": "",
    "titles": [
      "Advocates urge Trump not to destroy $10 million in contraceptives - Axios",
      "$10 Million in Contraceptives Have Been Destroyed on Orders From Trump Officials"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.675,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S.A.I.D. purchased birth control pills, IUDs, and hormonal implants for women in low-income countries. These supplies were stuck in a Belgian warehouse following U.S. foreign aid cuts. Advocates are urging action to resolve the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested for Armed Assault at Renfrew Motel",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Fri, 12 Sep 2025 20:32:11 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The initial search for the suspect had prompted a shelter-in-place order from police in the Renfrew area on Aug. 28.",
      "A 28-year-old male has been arrested and charged following an alleged armed sexual assault in Renfrew. Officials said that on Aug. 28, a woman went to a local hospital and reported she had been held against her will and sexually assaulted at a motel on Stewart Street. She said the man was known to h"
    ],
    "image_url": "",
    "titles": [
      "Man arrested in Ottawa charged with sexual assault in Renfrew",
      "Man arrested following two week search in serious assault case"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.664,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.588,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 28-year-old man was arrested and charged with armed sexual assault in Renfrew after a woman reported being held and assaulted at a Stewart Street motel on Aug. 28. The incident led to a temporary shelter-in-place order in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MADD Canada's Vigil in Brampton to Honor Victims of Impaired Driving",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 11:04:14 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "BRAMPTON, Ontario, Sept. 13, 2025 (GLOBE NEWSWIRE) &#8212; Today, MADD Canada will hold its annual Candlelight Vigil Service and Memorial Monument Ceremony to remember those who have been killed in crashes involving alcohol, cannabis and/or other drugs. This year, six new names have been added to th",
      "DARTMOUTH, Nova Scotia, Sept. 13, 2025 (GLOBE NEWSWIRE) &#8212; Community members, including victims’ families and friends, will gather today to remember those who have been killed in crashes involving alcohol, cannabis and/or other drugs. This year, the names of two victims, Talia Forrest and Jesse"
    ],
    "image_url": "",
    "titles": [
      "Ontario Victims of Alcohol and Drug-Related Crashes Honoured at MADD Canada’s Annual Memorial Ceremony",
      "MADD Canada Remembers Nova Scotia Victims of Alcohol and Drug-Related Crashes at Annual Memorial Ceremony"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.899,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.505,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On September 13, 2025, MADD Canada will host its annual Candlelight Vigil and Memorial Monument Ceremony in Brampton, Ontario, to honor individuals killed in crashes involving impaired driving. This year, six new names have been added to the memorial. Concurrently, in Dartmouth, Nova Scotia, a community gathering will remember victims, including Talia Forrest and Jesse, highlighting the ongoing impact of substance-impaired driving.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wisconsin Badgers to Face Alabama Crimson Tide in High-Stakes Game",
    "domain": "sports",
    "source_domain": "www.buckys5thquarter.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 15:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "www.buckys5thquarter.com",
      "www.rollbamaroll.com"
    ],
    "snippets": [
      "The Badgers have a big challenge ahead of them on Saturday.",
      "After a 2025 home opener win against out-of conference opponent ULM, Wisconsin is a big step up in talent vs Alabama."
    ],
    "image_url": "",
    "titles": [
      "Wisconsin Badgers vs. No. 19 Alabama Crimson Tide: 1st Half Game Thread",
      "Alabama Crimson Tide vs Wisconsin Badgers Game Thread"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.985,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Wisconsin Badgers, following their 2025 season-opening win against ULM, face a significant challenge as they prepare to play against the Alabama Crimson Tide on Saturday. This upcoming game is viewed as a considerable increase in competition level.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]