[
  {
    "title": "World Curling Increases Oversight After Double Touching Accusations",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 15 Feb 2026 19:09:45 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet",
      "Yahoo Sports",
      "Associated Press"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "World Curling adjusted its umpire setup at the Winter Games again Sunday night after a contentious weekend at Cortina Curling Olympic Stadium.",
      "The great Olympic curling controversy continues to swirl at Milano Cortina 2026. There were several developments on Sunday in the issue that stemmed from a Swedish accusation of Canada third Marc Kennedy ‘double-touching’ third rocks on release in a game on Friday. It resulted in a profanity-laced argument between Kennedy and Swedish third Oskar Eriksson during the ninth-end break. World Curling announced Saturday it would have two umpires move between all four sheets to observe deliveries for the rest of the event, and also issued a verbal warning to Canada for language use. But after two...",
      "CORTINA D’AMPEZZO, Italy (AP) — Controversy is swirling in curling at the Winter Olympics. The Canadian men's and women's teams, as well as the British men's team, have been accused of the same infraction: double-touching the curling stone after it is released. It comes as Canada, a historic curling",
      "Inside the widening Olympic curling controversy and allegations of cheating AP News"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2026/02/6be27008f8a33b62e502f6f8d2d1fda6a621adf95a763ae015a743332f9bdb65.jpg?quality=65&strip=all",
    "titles": [
      "World Curling changes umpire setup again at Games",
      "World Curling backtracks on umpire plan after Olympic controversy",
      "Inside the widening Olympic curling controversy and allegations of cheating",
      "Inside the widening Olympic curling controversy and allegations of cheating - AP News"
    ],
    "url": "https://globalnews.ca/news/11668930/world-curling-changes-umpire-setup-again-at-games/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/curling-controversy-winter-olympics-canada-103520863.html",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxOYWwydmJBa09TZlhTVDQtRmlBVWhURlRWWG5wV0lqRTdxeVRXaEpHV0FORE1oOFRXZW9ibkJaWkhCdXZGZnZvRzJDREVHOHVUUF9lclItUThGOC1vZ3Z0a1ZPR09XakNQcFFvUzBTYjVEemFrNzdhSUhHTVlGbW1QWlg4bXg5cEtIT01pR1hwLTEyYnBJT0pEMUxaUQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11668930/world-curling-changes-umpire-setup-again-at-games/",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.951,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.9,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about changes in the umpire setup at the World Curling Games. It could be useful for fans or participants wanting to understand the rules and organization of the event. However, without more context or explanation of the reasons and potential effects of these changes, its usefulness is limited.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "At the Milano Cortina 2026 Winter Olympics, World Curling increased umpire monitoring after accusations of 'double-touching' the stone by Canadian and British teams. A verbal warning was issued to Canada for language during a dispute. Umpires will now move between all sheets for the remainder of the event to observe deliveries.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "India Beats Pakistan to Reach T20 World Cup Super 8s",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 19:34:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Sky Sports",
      "BBC Sport",
      "Yahoo Sports"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com",
      "skysports.com",
      "bbc.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "India's win against Pakistan takes the defending champions through to the next round of cricket's T20 World Cup.",
      "Ishan Kishan defies a tricky Colombo pitch with 77 as India beat Pakistan by 61 runs in Group A of the T20 World Cup.",
      "Shai Hope's unbeaten half-century steers West Indies into the last eight and eliminates Nepal from the T20 World Cup.",
      "Group A: India, 175-7, bt Pakistan, 114, by 61 runs Opener’s 77 proves decisive on tricky pitch A day of no handshakes, and for Pakistan many head shakes. India coasted to victory in what became global cricket’s most lucrative mismatch after a superlative innings from the opener Ishan Kishan skewed",
      "India continued their T20 World Cup dominance of Pakistan with a thumping 61-run victory in Colombo sealing the defending champions and tournament favourites' spot in the Super 8s.",
      "What results do England, Australia and the rest of the countries need to join India and West Indies in the Super 8s at the T20 World Cup?",
      "Ishan Kishan's quickfire 77 is followed by a well-rounded bowling display as India thrash woeful Pakistan by 61 runs to qualify for the Super 8s stage of the ICC Men's T20 World Cup.",
      "India continue their recent on-field dominance over Pakistan by winning their highly anticipated meeting in Colombo by 61 runs to confirm their place in the Super 8s of the T20 World Cup.",
      "Archrivals India and Pakistan declined to shake hands before and after the most-anticipated game of cricket's Twenty20 World Cup, with India easily winning by 61 runs on Sunday to secure its Super 8 spot. India opener Ishan Kishan scored 77 off 40 deliveries in a match which almost didn't take place"
    ],
    "image_url": "",
    "titles": [
      "India rout bitter rivals Pakistan at T20 World Cup",
      "India hammer Pakistan to qualify for T20 World Cup Super Eights",
      "West Indies beat Nepal, become first team into T20 World Cup Super Eights",
      "India rout Pakistan in T20 World Cup grudge match after Kishan’s ‘amazing’ innings",
      "India rout Pakistan at T20 World Cup to seal Super 8s spot",
      "Who needs what to reach T20 World Cup Super 8s?",
      "India dismantle Pakistan in dominant display to progress to Super 8s",
      "Dominant India thrash rivals Pakistan in Colombo",
      "India crushes Pakistan by 61 runs in marquee game in T20 World Cup. No handshakes again"
    ],
    "url": "https://www.aljazeera.com/gallery/2026/2/15/india-rout-bitter-rivals-pakistan-at-t20-world-cup?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/sports/2026/2/15/india-hammer-pakistan-to-qualify-for-t20-world-cup-super-eights?traffic_source=rss",
      "https://www.aljazeera.com/sports/2026/2/15/west-indies-beat-nepal-become-first-team-into-t20-world-cup-super-eights?traffic_source=rss",
      "https://www.theguardian.com/sport/2026/feb/15/india-pakistan-t20-world-cup-cricket-match-report",
      "https://www.skysports.com/cricket/news/12040/13507942/t20-world-cup-india-beat-pakistan-yet-again-to-seal-super-8s-spot-as-salman-aghas-side-slump-chasing-176-in-colombo",
      "https://www.bbc.com/sport/cricket/articles/cx2gk7mx5d5o?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/sport/cricket/videos/cevn3vw1leko?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/sport/cricket/articles/crl4kz9z7rxo?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/pakistan-takes-india-marquee-game-054209195.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/gallery/2026/2/15/india-rout-bitter-rivals-pakistan-at-t20-world-cup?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.962,
      "consensus": 0.995,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.851,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the result of a cricket match but does not offer any deeper insights or understanding. There is no information on strategies used, player performances, or implications for future matches.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "India defeated Pakistan by 61 runs in Colombo, with Ishan Kishan scoring 77, to secure a place in the Super 8s of the T20 World Cup. The teams did not shake hands before or after the match. West Indies also advanced to the last eight, eliminating Nepal. India and West Indies are confirmed for the next round.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Weston and Stoecker Win Mixed Team Skeleton Gold for Great Britain",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 19:03:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "The Guardian",
      "Sky Sports",
      "BBC Sport"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "Matt Weston and Tabby Stoecker make history as they claim gold in the mixed team skeleton at the 2026 Winter Olympics. Weston becomes the first Team GB athlete to win two gold medals in a single Winter Olympics.",
      "Matt Weston makes more history in Cortina as he becomes the first Briton to win two gold medals at a Winter Olympics with a thrilling victory in the mixed team skeleton alongside Tabitha Stoecker.",
      "British pair triumph in mixed team skeleton event Bankes and Nightingale win mixed snowboard cross Great Britain had their greatest day at a Winter Olympics, after Matt Weston and Tabby Stoecker won gold in the mixed team skeleton in a combined time of 1min 59.35sec. It was the British team’s second",
      "Matt Weston and Tabby Stoecker teamed up to claim Olympic gold in the mixed team skeleton competition.",
      "Great Britain's Matt Weston and Tabby Stoecker give their reactions to making history by winning gold in the mixed team skeleton at the 2026 Winter Olympics.",
      "CORTINA D'AMPEZZO, Italy (AP) — Britain's Matt Weston waited a lifetime to capture his first Olympic skeleton gold medal. Weston and Tabitha Stoecker won the mixed skeleton event on Sunday night, their two-run combined time of 1 minute, 59.36 seconds good enough to get another Olympic gold for Brita"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e6df/live/9382bd20-0aa0-11f1-b7e1-afb6d0884c18.jpg",
    "titles": [
      "Weston and Stoecker make history as Team GB win third Olympic gold",
      "Weston & Stoecker win GB's second gold of day",
      "Weston and Stoecker strike gold to cap GB’s greatest day at Winter Olympics",
      "'Super Sunday' - Weston and Stoecker win mixed skeleton gold for Team GB",
      "'I can't believe it' - Weston and Stoecker react to historic gold",
      "Double Olympic gold for Matt Weston, who pairs with Tabitha Stoecker to win mixed skeleton title"
    ],
    "url": "https://www.bbc.com/sport/videos/c75ezvv7yddo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/gbs-weston-stoecker-win-thrilling-184302942.html",
      "https://www.theguardian.com/sport/2026/feb/15/matt-weston-tabby-stoecker-gold-mixed-team-skeleton-gb-winter-olympics-milano-cortina-2026",
      "https://www.skysports.com/olympics/news/12040/13508008/winter-olympics-2026-matt-weston-and-tabby-stoecker-win-mixed-team-skeleton-gold-for-team-gb",
      "https://www.bbc.com/sport/videos/c33j4m0ypxlo?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/double-olympic-gold-matt-weston-190336742.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/videos/c75ezvv7yddo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.948,
      "consensus": 0.975,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.843,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Team GB's achievement in the Olympics but lacks depth or insight. It does not provide information on the athletes' journey, the significance of the win, or the strategies used.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Matt Weston and Tabby Stoecker won gold for Great Britain in the mixed team skeleton at the 2026 Winter Olympics in Cortina d'Ampezzo, finishing with a combined time of 1 minute, 59.35 seconds. Weston became the first British athlete to win two gold medals at a single Winter Olympics.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "U.S. Figure Skating Confirms No Appeal of Olympic Ice Dance Results",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 14:54:08 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "forbes.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "U.S. Figure Skating did not appeal the French judge's scoring that played a major role in Team USA's Madison Chock and Evan Bates losing the ice dance gold medal to France's Laurence Fournier Beaudry and Guillaume Cizeron.",
      "U.S. Figure Skating does not intend to appeal the results of the highly controversial Olympic ice dance competition, effectively cementing a silver medal for Americans Madison Chock and Evan Bates.",
      "The Americans are not going to add steam to the latest ice dance controversy. U.S. Figure Skating is not planning to appeal the scores from Sunday’s free dance when France’s Laurence Fournier Beaudry and Guillaume Cizeron beat out Team USA’s Madison Chock and Evan Bates for Olympic gold last week, USA Today ‘s Jordan Mendoza and Christine Brennan reported Sunday. The judges’ marks drew plenty of scrutiny from fans and reporters. “There has been a lot of thoughtful, and at times emotional, discussion about the ice dance competition in Milan,” U.S. Figure Skating CEO Matt Farrell said in a..."
    ],
    "image_url": "",
    "titles": [
      "No U.S. appeal over dubious ice dance scoring",
      "USFS Signals No Appeal Of Olympic Ice Dance Results, Shifts Focus To Judging Reform",
      "Report: U.S. will not appeal controversial Olympic ice dance result"
    ],
    "url": "https://www.espn.com/olympics/story/_/id/47939486/no-appeal-ice-dance-scoring-sent-chock-bates-silver",
    "alternate_urls": [
      "https://www.forbes.com/sites/carolineprice/2026/02/15/usfs-signals-no-appeal-of-olympic-ice-dance-results-shifts-focus-to-judging-reform/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/olympics/story/_/id/47939486/no-appeal-ice-dance-scoring-sent-chock-bates-silver",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.971,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.822,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a decision not to appeal a scoring decision in ice dancing. However, it lacks depth or insight into the reasons for the decision, the implications for the sport, or the rules and regulations around scoring.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. Figure Skating has decided not to appeal the results of the Olympic ice dance competition, confirming a silver medal for Madison Chock and Evan Bates after they finished behind France's Laurence Fournier Beaudry and Guillaume Cizeron. The decision follows controversy over the judges' scoring but effectively finalizes the medal standings.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Klaebo Sets Winter Olympics Record With Ninth Gold Medal",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 09:08:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "NPR",
      "Associated Press",
      "The Guardian",
      "BBC Sport",
      "Globe and Mail",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Brazil became the first South American country to win gold at the Winter Olympics.",
      "Team GB wins two Winter Olympic titles on one day for the first time as Matt Weston and Tabitha Stoecker clinch mixed team skeleton gold.",
      "Once a racer for Norway, Pinheiro Braathen switched to Brazil, his mother's home country. In winning the Olympic giant slalom on Saturday, he earned South America's first medal at a Winter Games.",
      "Johannes Hoesflot Klaebo, Norway's king of cross-country skiing, becomes the Winter Olympics' outright most successful athlete with a record ninth gold medal.",
      "Norway cross-country star Klaebo wins 9th gold medal, setting a Winter Olympics record AP News",
      "Brignone wins giant slalom for 2nd gold medal of the Olympics, Shiffrin finishes 11th AP News",
      "Norwegian on course for six potential golds at Games France take cross-country skiing relay silver, Italy bronze Johannes Høsflot Klæbo led Norway to victory in the men’s 4 x 7.5km cross-country relay at the Milano Cortina Games on Sunday to win a record ninth career gold medal at the Winter Olympic",
      "Norway's Johannes Hoesflot Klaebo makes history as he wins gold in the men's 4 x 7.5km relay, to claim a record-breaking ninth Winter Olympics gold medal.",
      "Norway’s Johannes Hoesflot Klaebo sets Winter Olympics record with 9th gold medal in cross-country ski The Globe and Mail",
      "Norway’s Johannes Hoesflot Klaebo has made Olympic history. The cross-country skier set a Winter Games record with his ninth career gold medal on Sunday as Norway won the men’s 4×7.5km relay. Klaebo, 29, previously was tied with countrymen Bjorn Daehlie, Marit Bjron, and Ole Einar Bjorndalen. Sunday’s triumph marked Klaebo’s fourth gold at Milano Cortina 2026. American swimmer Michael Phelps has the all-time Olympic record with 23 gold medals. Klaebo could get into double figures by the end of the Games. His next chances for a 10th gold are in the team sprint on Wednesday or the 50-km race on...",
      "TESERO, Italy (AP) — Norway’s Johannes Hoesflot Klaebo has won a ninth gold medal in cross-country skiing, setting a Winter Games record, at the Milan Cortina Olympics . The 29‑year‑old anchored Sunday’s 4 x 7.5-kilometer relay in the men’s competition for his fourth gold at the 2026 Games. He had shared the record with three retired Norwegian athletes, Marit Bjoergen and Bjoern Daehlie in cross-country skiing and Ole Einar Bjoerndalen in the biathlon. He now stands alone at the top. ___ AP Winter Olympics: https://apnews.com/hub/milan-cortina-2026-winter-olympics"
    ],
    "image_url": "",
    "titles": [
      "Brazil wins first gold medal for South America at Winter Olympics",
      "Team GB clinches second gold of day at Winter Olympics",
      "Brazil's Pinheiro Braathen wins gold, and South America's first Winter Olympics medal",
      "Klaebo wins record ninth Winter Olympic gold",
      "Norway cross-country star Klaebo wins 9th gold medal, setting a Winter Olympics record - AP News",
      "Brignone wins giant slalom for 2nd gold medal of the Olympics, Shiffrin finishes 11th - AP News",
      "Klæbo leads Norway to relay win and claims record ninth Winter Olympics gold",
      "'The best ever!' Klaebo wins historic ninth Winter Olympics gold",
      "Norway’s Johannes Hoesflot Klaebo sets Winter Olympics record with 9th gold medal in cross-country ski - The Globe and Mail",
      "Norwegian cross-country skier Klaebo wins Winter Olympic record ninth gold",
      "Norway’s Klaebo wins 9th gold medal in cross-country skiing, setting a Winter Olympics record"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/15/brazil-wins-first-gold-medal-for-south-america-at-winter-olympics?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/articles/cm2x7m17jydo?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2026/02/15/nx-s1-5715075/brazil-braathen-gold-south-americas-first-winter-olympics-medal",
      "https://www.bbc.com/sport/articles/cy4wmyjnlz1o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNNjRBN0VLUElMWG4tam0zZkNtT19vVzBhU3ZRX3F0UzAwNldYZW0zM05RU2gtaWJMSG5qeDY1ZnE4d2hmanNvMFd0UFd3TUpQNjhVM3B0ZWxkbjRxZWxHMDF6VXRYRGkwUzNpajFNT2VoWkpKOE1TZVVPT0xWcktfZXJhVk5LU1hFTE52dkVXMlBMcWlNUGNZYXlEekVfTUdFWE5YLQ?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPOHRyVG10eDNuZEU2RXdNbXNRNHNSNkNodUV4SHpuSy1OQmhhc19HMmFzclU5Q0dGQy0xUVB5UEhOSzk3RUlwNjZwRlRJTWU2ZTVLWDg5SEozeEN3SC1wNy1JWkVibTgwcUwxN2w5ckdmMkdfT3EtZWszZ1NpRDczcW1Ud2ZXTHl0VlhhOXZfWDBQcFlNczJaYTBzdjEybmZCTUhxUHF3Ymx2T3NNNTRTWmhB?oc=5",
      "https://www.theguardian.com/sport/2026/feb/15/johannes-hosflot-klaebo-leads-norway-cross-country-relay-win-and-record-ninth-winter-olympics-gold",
      "https://www.bbc.com/sport/videos/cjd9e2ddzrmo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPcGNRYnByMGhSdnlvU2xBQTFNdG9meHpJdGFwTlRHZXRUUWZkZE5vQWNLVV9YQlZvU3BrX0NBMTV6Vkh1QmoxOXRlMjc5TkhuYy1KUzVIZkpGWloxS0tKOEtQUFFfeUM4Q0lwNWltenQxalhmXzk5N3g4dUstNmYtLTEyS0lmNkh3Y2VEOXlMWTVRRVN4TUlGWEF0cTJIelk2UDVxbFpUc09tUmhpazdFOHp4WTBpblFvVVFlbnRXZl9nRVk?oc=5",
      "https://sports.yahoo.com/articles/norway-klaebo-wins-9th-gold-120729510.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/15/brazil-wins-first-gold-medal-for-south-america-at-winter-olympics?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.72,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.816,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Brazil's achievement in the Winter Olympics, which could be of interest to sports enthusiasts or those following the event. However, without further context or analysis, it doesn't offer deeper understanding or actionable insights.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Norway’s Johannes Hoesflot Klaebo won his ninth career gold medal in cross-country skiing by anchoring the men’s 4 x 7.5km relay at the Milan Cortina 2026 Winter Olympics. This victory sets a new Winter Games record for most gold medals by an athlete. Klaebo surpassed previous record holders Marit Bjoergen, Bjoern Daehlie, and Ole Einar Bjoerndalen.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Syrian Army Takes Control of al Shaddadi Base in Coordination With US",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 17:54:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The move, in coordination with the US, is the latest implementation of the ceasefire agreement with Kurdish-led forces.",
      "Syrian army says it took control of Shaddadi base after coordination with US, agency says Reuters",
      "Syrian army takes control over al-Shaddadi base in Hasakah Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Syrian army takes over al-Shaddadi base after US withdrawal",
      "Syrian army says it took control of Shaddadi base after coordination with US, agency says - Reuters",
      "Syrian army takes control over al-Shaddadi base in Hasakah - Al Arabiya English"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/15/syrian-army-takes-over-al-shaddadi-base-after-us-withdrawal?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxOVE1FRXlsUHhHQld4Zzlkemh4Y2ZKM2NxZXlrd2JxOG5IMC1WNVhaemhRaVpqR0pva1YxZ2h5SkR3dnBFclphNXZYNnc5SWVCakdLS2VXNmJIWURMQmY5MmtUc2J3OXhpU3E0bk5qcHd6T2gwNnc0cnQydG5UN2xldUpfTFRELUgyTjRJZmR2dU53ZGFVU3N5MWh5N1l2eDU5QnNaUnpkRkRTWkV2ZkRHN1VSbmY4RFljRlFRU0twLUtvSXhNSURacVNWRldVNlk?oc=5",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPWmR5WmtYZ3RKSll3NGx0RkU4anM0ZE4zQ1B3U0ZCSzYxUWVzUmYzUXhENUVJd0lRM3B4T3ptQnRxLThUc2VWZEdWcG1rQ21qN3pjLTBiTHAxZExvS1FoSmZrTWxXMHA3Z1hQRExmbXI0SzkxQ1l2N1ktc05WaHZPWmtqM1hwZ1MwUElFajdrZXhPV0tJbVNMaHFkeWZUTlZBdFJaUkNLR3F2c1IydHpTbWJIR1k4bGctUzV30gG7AUFVX3lxTE9aZHlaa1hndEpKWXc0bHRGRThqczRkTjNDUHdTRkJLNjFRZXNSZjNReEQ1RUl3SVEzcHhPem1CdHEtOFRzZVZkR1ZwbWtDbWo3emMtMGJMcDFkTG9LUWhKZmtNbFcwcDdnWFBETGZtcjRLOTFDWXY3WS1zTlZodk9aa2ozWHBnUzBQSUVqN2tleE9XS0ltU0xocWR5ZlROVkF0UlpSQ0tHcXZzUjJ0elNtYkhHWThsZy1TNXc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/15/syrian-army-takes-over-al-shaddadi-base-after-us-withdrawal?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.918,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.787,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the geopolitical situation in Syria following the US withdrawal. However, it doesn't clearly highlight progress or solutions, nor does it fully explain the impacts or causes of these events.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Syrian army has taken control of the al-Shaddadi base in Hasakah following coordination with the US, as part of the ongoing ceasefire agreement with Kurdish-led forces.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump and Netanyahu Agree to Sanction Iranian Oil Exports",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 15:34:07 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com"
    ],
    "snippets": [
      "Trump and Netanyahu agree to increase pressure on Iranian oil Axios",
      "Trump, Netanyahu agree to sanction Iranian oil; analysts say Israel is pushing for war to cover West Bank annexation.",
      "Trump, Netanyahu agreed US should press Iran to cut oil sales to China, Axios reports Reuters"
    ],
    "image_url": "",
    "titles": [
      "Trump and Netanyahu agree to increase pressure on Iranian oil - Axios",
      "Trump and Netanyahu align on Iran pressure but split on endgame",
      "Trump, Netanyahu agreed US should press Iran to cut oil sales to China, Axios reports - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1nN0hVWG1lQ0pIc0dGSkFTMVBjX1cxd3dsQlM0TlkzLVIzdFNBVlpvbzB6UElaRU1oSG9TcWd4eTl4QncxaHBrMFFoSV9RVzdpU1ZSdThwaS1kSHFYOTFnUkxlRDE2M01kejF4WjhwX0k?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/features/2026/2/15/trump-and-netanyahu-align-on-iran-pressure-but-split-on-endgame?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNMXA0UHl5X1VDSnhSRUFvdEFpWkNUelZfanRhX2RIa0RTcjlISXhyUjdYMWtvSGluZjNWSjJJWWdNZE9pdzV0RDFGeFpDTnlmM2pGcVhpVUdKVGt1ZEoxOWxlTzVJZ3hvWGw0b3o0X3lPdVZwa1pMNXV0cTZFOEYteGU4NkVCMzB5TWpDdHh3OW5RSHRhM3drdWtMNUNFamxCdjFleWRUMjZLcEpfVHFBQTRnS2ZqWGJZb2VzLXVBWjNLYW0yOHJjbg?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1nN0hVWG1lQ0pIc0dGSkFTMVBjX1cxd3dsQlM0TlkzLVIzdFNBVlpvbzB6UElaRU1oSG9TcWd4eTl4QncxaHBrMFFoSV9RVzdpU1ZSdThwaS1kSHFYOTFnUkxlRDE2M01kejF4WjhwX0k?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.86,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.776,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about the geopolitical decisions and their potential impacts on the global oil market. However, it lacks depth in terms of offering actionable insights or solutions to the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Trump and Netanyahu have agreed to increase pressure on Iran by targeting its oil sales, particularly to China, according to multiple reports. The agreement includes plans to impose sanctions on Iranian oil as part of efforts to curb Iran's revenue.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Military Boards Sanctioned Oil Tanker Tracked From Caribbean",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 16:30:20 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Pentagon tracked sanctioned Veronica III from Caribbean Sea after it left Venezuela on day Maduro was captured US military forces boarded another sanctioned tanker in the Indian Ocean after tracking the vessel from the Caribbean Sea in an effort to target illicit oil connected to Venezuela, the Pent",
      "US Forces Board Second Sanctioned Oil Tanker in Indian Ocean Bloomberg.com",
      "The US military boarded an oil tanker in the Indian Ocean after tracking the vessel for thousands of miles, saying it tried to circumvent President Donald Trump’s energy blockade in the Caribbean against sanctioned ships."
    ],
    "image_url": "https://i.guim.co.uk/img/media/eadd4130c9b4b9230cd17d3702782a3c701f0665/1032_0_2543_2036/master/2543.jpg?width=140&quality=85&auto=format&fit=max&s=5dc477d767d949df3561dd0a468ed437",
    "titles": [
      "US forces board second Venezuela‑linked oil tanker in Indian Ocean",
      "US Forces Board Second Sanctioned Oil Tanker in Indian Ocean - Bloomberg.com",
      "US Forces Board Second Sanctioned Oil Tanker in Indian Ocean"
    ],
    "url": "https://www.theguardian.com/world/2026/feb/15/us-forces-board-second-venezuelalinked-oil-tanker-in-indian-ocean",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNTlpLZGtvajNjVXVmWVdGLXQxUDNabFdQOE1MUjVhTDFvMTcxeUxBaHU5aWl3TVJMeGlGTmlUTEdxNmpXV1VNQlpFRnJwNko1M3ZVeTY3VnBEaEY0YUxJT1FnVi1pU3lXNzFONTExbFFCNXRwNlBkbkJZSjZVWmpqeEtWWWdxejkxX2FqSDBBaExNdzE5ZlVvb2lMM1RPWi0tdHNkZ1RQSlFrSHluY1NHUQ?oc=5",
      "https://financialpost.com/pmn/business-pmn/us-forces-board-second-sanctioned-oil-tanker-in-indian-ocean"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2026/feb/15/us-forces-board-second-venezuelalinked-oil-tanker-in-indian-ocean",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.883,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.771,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the actions of US forces in relation to Venezuelan oil tankers, but without more context or depth, it's hard to say how useful this information is to the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "US military forces boarded a sanctioned oil tanker, Veronica III, in the Indian Ocean after tracking it from the Caribbean Sea. The vessel was allegedly attempting to evade an energy blockade against sanctioned ships linked to Venezuela.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Lab Tests Confirm Navalny Killed in 2024",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 13:05:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Five European countries say lab tests conclude that Russian opposition leader Alexey Navalny was killed in 2024.",
      "The toxin was found in the body of the Russian dissident Aleksei A. Navalny, who died in prison two years ago, five governments said, challenging Russia’s official account.",
      "Yvette Cooper says claim against Kremlin ‘deeply serious’ while Russia dismisses western ‘feeblemindedness’ The UK is mulling fresh sanctions against Moscow after pinning blame on the Kremlin for the poisoning of the Russian opposition leader Alexei Navalny, Yvette Cooper has suggested. The Foreign"
    ],
    "image_url": "",
    "titles": [
      "Europeans say Russia poisoned dissident Alexey Navalny with dart frog toxin",
      "Navalny Was Poisoned With Frog Toxin, European Governments Say",
      "UK considers new Russia sanctions after Navalny frog toxin finding"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/15/europeans-say-russia-poisoned-dissident-alexey-navalny-with-dart-frog-toxin?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/14/world/europe/russia-navalny-poison.html",
      "https://www.theguardian.com/politics/2026/feb/15/uk-considers-new-russia-sanctions-navalny-frog-toxin"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/15/europeans-say-russia-poisoned-dissident-alexey-navalny-with-dart-frog-toxin?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.803,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.747,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about an alleged poisoning incident involving a political dissident. However, without more details or analysis, it doesn't provide much depth or actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Five European countries report that lab tests confirm Russian opposition leader Alexey Navalny was killed in 2024. The UK is considering new sanctions against Moscow, attributing responsibility to the Kremlin. Russia rejects the accusations from western nations.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "German Galushchenko Detained Amid Corruption Investigation in Ukraine",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 19:35:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com"
    ],
    "snippets": [
      "German Galushchenko was detained by Ukraine's anti-corruption bureau while trying to leave the country.",
      "His detention comes as he faces legal proceedings after being dismissed in a corruption scandal."
    ],
    "image_url": "",
    "titles": [
      "Ukraine’s ex-energy minister arrested while trying to cross border",
      "Ukraine's ex-energy minister detained while attempting to leave country"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/15/ukraines-ex-energy-minister-arrested-while-trying-to-cross-border?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c4g5380xwqjo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/15/ukraines-ex-energy-minister-arrested-while-trying-to-cross-border?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.739,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a political event but doesn't offer much depth or insight into the implications or context of the arrest.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "German Galushchenko was detained by Ukraine's anti-corruption bureau while attempting to leave the country. His detention follows his dismissal and ongoing legal proceedings related to a corruption scandal.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Winter Storm Watch Issued for Northern California Ahead of Holiday",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 15 Feb 2026 08:45:23 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "As people travel for the holiday weekend, much of Northern California is under a winter storm watch, with communities bracing for several feet of snow.",
      "‘Major travel impacts’ expected as winter storm watch is issued for northern California AP News"
    ],
    "image_url": "",
    "titles": [
      "'Major travel impacts' expected as winter storm watch issued for northern California",
      "‘Major travel impacts’ expected as winter storm watch is issued for northern California - AP News"
    ],
    "url": "https://www.npr.org/2026/02/15/nx-s1-5715082/major-travel-impacts-winter-storm-watch-issued-northern-california",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxOS1J0cUtFSnQ3LS1teVp4OUdQc3NJMTZSbVlTZ3dCQ2o5eXVURmcwQzJZeE1iek9YREJOMC1VSEg1RjM2NnZEbVFtYmpKYkdqaDhRbV95YXNBR3lrOW8xZi1hZC1GTEkySU1TY3oxRG1hNFVQVDVEdnd0NXpKYUxWaWNVOUNTU0pnWk40dVBkWGh0Zw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/15/nx-s1-5715082/major-travel-impacts-winter-storm-watch-issued-northern-california",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.818,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.739,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it informs readers about a potential weather crisis, aiding in decision-making. However, it doesn't report on solutions or improvements, nor does it increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A winter storm watch has been issued for northern California, with several feet of snow expected. Authorities warn of major travel impacts as residents and travelers prepare for the holiday weekend.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Anthony Kim Wins LIV Golf Adelaide After Twelve Year Absence",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 15:35:03 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Associated Press",
      "Forbes"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Kim emerged from a star-studded final group to earn his first win since 2010 in comeback fashion",
      "Anthony Kim wins LIV Golf Adelaide in a remarkable career comeback AP News",
      "Twelve years away from competition, Anthony Kim wins the LIV Golf Adelaide title with a stunning 9-under 63, completing one of sport’s greatest comeback stories."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/15/d16c42af-dd62-47b3-9f14-f51b4b478ab6/anthony-kim-celebrate-liv-g.jpg",
    "titles": [
      "Anthony Kim wins first event after 12-year absence for recovery from injury, addiction at LIV Golf Adelaide",
      "Anthony Kim wins LIV Golf Adelaide in a remarkable career comeback - AP News",
      "Anthony Kim Completes Stunning Comeback With LIV Golf Adelaide Victory"
    ],
    "url": "https://www.cbssports.com/golf/news/anthony-kim-wins-recovery-addiction-what-happened-liv-golf-adelaide/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxQZVZ1Mnozd0RfeWFPbHVocEFuVmZQb21GdGhJcVhhVXM2VHU2Qy1fVFNfbHphdHpYZVZScFc5M19vVGRLUFp6eURNdVB6ZlByRDd5VFhKWUFkc2NtNVo0OEx0Z29jQjJUUE5KNzhaUldDV2tObnJFMGFKRHd0dzlkbExvbW9fN3lMR3VCTGxQY1ljSEU?oc=5",
      "https://www.forbes.com/sites/break80/2026/02/15/anthony-kim-completes-stunning-comeback-with-liv-golf-adelaide-victory/"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/golf/news/anthony-kim-wins-recovery-addiction-what-happened-liv-golf-adelaide/",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.723,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "keywords (1): recovery; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Anthony Kim won the LIV Golf Adelaide tournament, marking his first victory since 2010. After a twelve-year absence from competition, Kim secured the title with a 9-under 63, completing a notable career comeback.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Federica Brignone Wins Olympic Giant Slalom Gold",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 16:09:31 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "New York Times",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "nytimes.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Shiffrin's best event is still to come, but the pressure to medal is seriously mounting",
      "At 35, Federica Brignone of Italy became the oldest Olympic Alpine gold medalist. Mikaela Shiffrin of the U.S. finished a disappointing 11th.",
      "CORTINA D'AMPEZZO, Italy (AP) — Federica Brignone wins the gold medal in Olympic women’s giant slalom, Mikaela Shiffrin finishes 11th."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/15/370dff56-72ae-42e4-bb3c-b032aa72bdbb/untitled-design-2026-02-15t075421-239.png",
    "titles": [
      "2026 Winter Olympics: Mikaela Shiffrin finishes 11th in giant slalom as Italy's Federica Brignone goes legend",
      "How Italy’s Federica Brignone Won Gold in Giant Slalom.",
      "Federica Brignone wins the gold medal in Olympic women’s giant slalom, Mikaela Shiffrin finishes 11th"
    ],
    "url": "https://www.cbssports.com/olympics/news/2026-winter-olympics-mikaela-shiffrin-skiing/",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/15/world/federica-brignone-mikaela-shiffrin-giant-slalom.html",
      "https://sports.yahoo.com/articles/federica-brignone-wins-gold-medal-132759770.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/olympics/news/2026-winter-olympics-mikaela-shiffrin-skiing/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.875,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Federica Brignone won the gold medal in the Olympic women's giant slalom in Cortina d'Ampezzo, becoming the oldest Olympic Alpine gold medalist at age 35. Mikaela Shiffrin of the U.S. finished 11th.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Strikes in Gaza Kill at Least 12",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 18:42:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The Palestinian Red Crescent say a strike on a tent encampment in northern Gaza killed at least six people.",
      "Israel says strikes were in response to Hamas violations of ceasefire as Hamas calls attacks ‘massacre’ of displaced people At least 12 Palestinians were killed and several more injured across the Gaza Strip on Sunday as the Israeli military said it carried out airstrikes in response to ceasefire vi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/15e2/live/c2172d00-0a56-11f1-bf16-2578b6c691c8.jpg",
    "titles": [
      "Eleven killed in Israeli strikes on Gaza, rescuers say",
      "At least 12 Palestinians killed and several hurt in Israeli airstrikes on Gaza"
    ],
    "url": "https://www.bbc.com/news/articles/c8r15eyvk2do?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/feb/15/palestinians-killed-injured-gaza-israeli-airstrikes-hamas"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c8r15eyvk2do?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story raises awareness about a tragic event, it doesn't provide any actionable insights, solutions, or deeper understanding of the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "At least 12 Palestinians were killed and several injured across Gaza on Sunday, including at least six in a strike on a tent encampment in northern Gaza, according to the Palestinian Red Crescent. Israel stated the strikes targeted Hamas in response to ceasefire violations, while Hamas described the attacks as a massacre of displaced people.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. Mens Hockey to Face Sweden for Gold Medal Game Spot",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 14:55:35 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Find the full schedule, scoring and goaltending leaders and group standings here.",
      "On Sunday at the Winter Olympics, Mikaela Shiffrin skied, pairs figure skating begins and USA men's hockey takes on Germany.",
      "The U.S. can reach the gold medal game with a win over the Swedes on Monday"
    ],
    "image_url": "",
    "titles": [
      "Olympics men's hockey daily: U.S., Canada back in action Sunday",
      "2026 Winter Olympics: Mikaela Shiffrin, USA men's hockey back in action and more from Milan Cortina",
      "2026 Winter Olympics: Team USA women's hockey schedule, results ahead of semifinal against Sweden"
    ],
    "url": "https://www.espn.com/nhl/story/_/id/47898378/olympics-2026-men-hockey-nhl-players-teams-standings-stats-schedule",
    "alternate_urls": [
      "https://www.espn.com/olympics/story/_/id/47932527/2026-milan-cortina-italy-winter-olympics-best-moments-sunday",
      "https://www.cbssports.com/olympics/news/2026-winter-olympics-us-womens-hockey-schedule-results-standings/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nhl/story/_/id/47898378/olympics-2026-men-hockey-nhl-players-teams-standings-stats-schedule",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.711,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "At the Winter Olympics, the U.S. men's hockey team will play Sweden on Monday for a chance to advance to the gold medal game. On Sunday, Mikaela Shiffrin competed, pairs figure skating events began, and the USA men's hockey team faced Germany.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Bryce Harper Reacts to Phillies Exec Dombrowskis October Comments",
    "domain": "politics",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 16:53:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Harper said comments from the Phillies exec in October are 'kind of wild to me, still'",
      "Harper addressed Dombrowski's comments before the start of the season with reporters at spring training."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/15/110d1e78-7a83-428b-b939-2d2b06ce11da/bryce-harper-getty-10.png",
    "titles": [
      "Bryce Harper still mystified by Dave Dombrowski's 'elite' comments as Phillies open 2026 spring training",
      "Dave Dombrowski's comments still linger for Bryce Harper heading into new season: 'For Dave to say those things, it is still wild to me'"
    ],
    "url": "https://www.cbssports.com/mlb/news/bryce-harper-dave-dombrowski-elite-comments-phillies-2026-spring-training/",
    "alternate_urls": [
      "https://sports.yahoo.com/mlb/article/dave-dombrowskis-comments-still-linger-for-bryce-harper-heading-into-new-season-for-dave-to-say-those-things-it-is-still-wild-to-me-171420890.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/mlb/news/bryce-harper-dave-dombrowski-elite-comments-phillies-2026-spring-training/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.693,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a conflict between a baseball player and a team executive, but without more context or analysis, it's not particularly useful or informative.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bryce Harper responded at spring training to comments made by Phillies executive Dave Dombrowski in October, saying the remarks still seem 'kind of wild' to him.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Accepts European Findings on Navalny Poisoning as UK Weighs",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 16:59:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Secretary of state says Washington will 'not fight' European partners on their findings as UK considers new sanctions.",
      "Rubio says US does not dispute Navalny poisoning assessment by Europeans Reuters"
    ],
    "image_url": "",
    "titles": [
      "US ‘not disputing’ European assessment of Navalny poisoning, Rubio says",
      "Rubio says US does not dispute Navalny poisoning assessment by Europeans - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/15/us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPT1BDMlJrU2d0cWVZQkd6VVV4aVAzd1VmbUNVeWVSX1lRRE5EV0xOR2tOdHFNSFNRSnFzR1JsaTFWMVJucnpLQ21ma21GQVp2dkpUSjZEaEZzamg1R0dyZU9HM1ZFbFFMdkdlQVpPUXNjNVdvUDdTbnpETGlJWlpIYmtjajdJbWQwdnF3ekRTeVZ6cUhOZjdRVDN6TUJFOWdmVnk4NGN5ZktBVW1jM0trWWFZWW9XYlUyWFhUVGFR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/15/us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the US stance on the Navalny poisoning incident. However, it lacks depth or insight into the implications of this stance, the reasons behind it, or the broader geopolitical context.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Marco Rubio stated that the US does not challenge European assessments regarding the poisoning of Alexei Navalny. The secretary of state confirmed that Washington will not oppose European partners' conclusions, while the UK is considering new sanctions.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Protests Against Iranian Government Held in Multiple Cities",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 13:35:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "Munich, Los Angeles, and Toronto saw the largest crowds, with smaller rallies also taking place in Tel Aviv and Libson.",
      "People protesting the Iranian government gathered near the security conference in Munich, as well as in other cities. More U.S.-Iran talks are expected Tuesday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8d5c/live/4b55f3f0-0a7d-11f1-b7e1-afb6d0884c18.jpg",
    "titles": [
      "Hundreds of thousands join Iran protests around the world",
      "Thousands Rally for Iran Regime Change in Cities Around the World"
    ],
    "url": "https://www.bbc.com/news/articles/czr0lykl4g4o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/14/world/europe/iran-regime-rallies-munich.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/czr0lykl4g4o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.814,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.683,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about global protests related to Iran, which is important. However, it doesn't provide information on the causes, demands of the protestors, or potential impacts on policy or society.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Protesters gathered in Munich, Los Angeles, Toronto, Tel Aviv, and Lisbon to demonstrate against the Iranian government. The largest crowds were reported in Munich, Los Angeles, and Toronto. Additional U.S.-Iran talks are scheduled for Tuesday.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Lindsey Vonn to Return Home After Surgeries Following Olympic Crash",
    "domain": "politics",
    "source_domain": "sportsnet.ca",
    "location": "national",
    "published": "Sun, 15 Feb 2026 10:32:53 EST",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "CORTINA D’AMPEZZO, Italy — Lindsey Vonn was preparing to fly back to her home country on Sunday after her terrifying head-over-heels crash in the Olympic downhill, the U.S. Ski Team’s chief told The Associated Press. Sophie Goldschmidt, president and CEO of the U.S. Ski and Snowboard Association, told the AP the team’s medical staff has been coordinating Vonn’s recovery since the crash and subsequent helicopter evacuation at the Milan Cortina Games and would try to accompany her home. Vonn has had multiple surgeries in Italy to repair a complex tibia fracture in her left leg. “We’re working...",
      "CORTINA D'AMPEZZO, Italy (AP) — Lindsey Vonn was preparing to fly back to her home country on Sunday after her terrifying head-over-heels crash in the Olympic downhill, the U.S. Ski Team’s chief told The Associated Press. Vonn has had multiple surgeries in Italy to repair a complex tibia fracture in"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2026/02/vonn-2.jpg",
    "titles": [
      "Lindsey Vonn to have more surgeries at home: U.S. Ski Team chief",
      "Lindsey Vonn is preparing to fly home to the US with more surgeries to come, team official tells AP"
    ],
    "url": "https://sports.yahoo.com/articles/lindsey-vonn-preparing-fly-back-151714315.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/lindsey-vonn-preparing-fly-back-151714315.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.677,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Lindsey Vonn's health status but lacks depth or insight. It doesn't provide actionable insights or deeper understanding, nor does it report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Lindsey Vonn is preparing to return to her home country after undergoing multiple surgeries in Italy to repair a complex tibia fracture in her left leg. The U.S. Ski Team's medical staff has been coordinating her recovery since her crash in the Olympic downhill at the Milan Cortina Games, and plans to accompany her on the trip home.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Pentagon Warns Anthropic Over AI Safety Dispute",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 02:59:30 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Exclusive: Pentagon threatens to cut off Anthropic in AI safeguards dispute Axios",
      "Pentagon threatens to cut off Anthropic in AI safeguards dispute, Axios reports Reuters"
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Pentagon threatens to cut off Anthropic in AI safeguards dispute - Axios",
      "Pentagon threatens to cut off Anthropic in AI safeguards dispute, Axios reports - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9JT0g3ZURJRzB4cFEyR0Jra0ZxM2lxVmc1MTFabmJldHd0QUtLQk42ZTJFNG9URTBMSkx4RTdJYWJISjh5WUFnVGQ1Q2pyT0VMUTZZN05IQkZDN1hxbnZ4RGY0ODA5VXdIWElaNFJiUTJ1ZmRnVTdfekRLamFVX0E?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNcTBMLV8yOW0zaEFLM2owZ3kwbklGcjgyNlJFNjJJM2Y2em1qZHlLNjNwSG1oZWdWaXFMdjVLY3dOSGJUTWthNVZxSXNKU0F4UXdFSElIYktJVFcyZ2lSekIwN3dGVTNJYjJrV1pFQWY5Nng5RldmQWxJYXRSVFk5dnkxUXNSSFJJUEtNdmlsQUFHU0E4LWlEN3lJSWROR25LWl9Qa0FEaWwtRzVtWWFMOU52aE01ejlOeExJ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9JT0g3ZURJRzB4cFEyR0Jra0ZxM2lxVmc1MTFabmJldHd0QUtLQk42ZTJFNG9URTBMSkx4RTdJYWJISjh5WUFnVGQ1Q2pyT0VMUTZZN05IQkZDN1hxbnZ4RGY0ODA5VXdIWElaNFJiUTJ1ZmRnVTdfekRLamFVX0E?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.607,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.653,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the ongoing dispute between Pentagon and Anthropic over AI safeguards. It helps in understanding the importance of AI safety measures and the potential consequences of not adhering to them.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "The Pentagon has warned it may end its relationship with Anthropic due to disagreements over AI safety measures, according to Axios and Reuters reports.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "California Imports Gasoline via Bahamas to Address Fuel Shortage",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 16:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Gasoline-Starved California Is Turning to Fuel From the Bahamas Bloomberg.com",
      "US supplies of gasoline are being shipped out of the country to travel thousands of miles via the Bahamas before finally ending up in California, a state battling shrinking fuelmaking capacity and high pump prices."
    ],
    "image_url": "",
    "titles": [
      "Gasoline-Starved California Is Turning to Fuel From the Bahamas - Bloomberg.com",
      "Gasoline-Starved California Is Turning to Fuel From the Bahamas"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMVdPblRmMHdhZ19JclY2R1Nac1l6WnA0c09lYzVwZGZmLWs1Y1QtVERNNFdBWTBrWGthOEJkc1FNMFFhRGRKYW9IeDFxVHhJUElzUThaU1ZwVzVjcGxOUmp2MDEwMlMybDJMcjBfdmtXbk80ajVqdUJLakZyYlRUc09YQTg1dm5UX1hiVmVXM2QydGxfTXlxcU9xMXdwSGk5dzl3VnNSdm5hZElfQXRpZ0ZBUUc?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/gasoline-starved-california-is-turning-to-fuel-from-the-bahamas"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMVdPblRmMHdhZ19JclY2R1Nac1l6WnA0c09lYzVwZGZmLWs1Y1QtVERNNFdBWTBrWGthOEJkc1FNMFFhRGRKYW9IeDFxVHhJUElzUThaU1ZwVzVjcGxOUmp2MDEwMlMybDJMcjBfdmtXbk80ajVqdUJLakZyYlRUc09YQTg1dm5UX1hiVmVXM2QydGxfTXlxcU9xMXdwSGk5dzl3VnNSdm5hZElfQXRpZ0ZBUUc?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.871,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "California is importing gasoline routed through the Bahamas due to reduced in-state fuel production and high prices. U.S. gasoline is shipped overseas and then redirected to California to address local shortages.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Measles Outbreak in North East London Hospitalises Children",
    "domain": "science",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 15:32:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "A number of children have been hospitalised as officials urge families to check they are up to date with their vaccines.",
      "UK Health Security Agency urges parents in Enfield to get their children vaccinated as Easter holiday travels approach A big measles outbreak in north-east London is affecting unvaccinated children under the age of 10, the UK Health Security Agency (UKHSA) has confirmed. UKHSA previously reported 34"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9864/live/b008a410-0a4a-11f1-aeec-d316ccfb6391.jpg",
    "titles": [
      "'Fast-spreading' measles outbreak hits several schools in London",
      "Fast-spreading measles outbreak takes hold among under-10s in north London"
    ],
    "url": "https://www.bbc.com/news/articles/cev7edxxzm7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/society/2026/feb/15/measles-outbreak-under-10s-north-london"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cev7edxxzm7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.02,
      "proximity": 0.5
    },
    "score": 0.649,
    "constructiveness_score": 0.02,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A measles outbreak in north-east London has led to the hospitalisation of several unvaccinated children under 10. The UK Health Security Agency is urging parents in Enfield to ensure their children are up to date with vaccinations as Easter holiday travel approaches.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Iran Says U.S. Must Act to Advance Nuclear Deal Talks",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 15:07:40 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Majid Takht-Ravanchi, Iran's deputy foreign minister, tells the BBC's Lyse Doucet that the ball was \"in America's court to prove that they want to do a deal\".",
      "Iran open to compromises to reach nuclear deal with U.S., minister tells BBC CNBC"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b307/live/c12f3310-0a0b-11f1-b5e2-dd58fc65f0f6.jpg",
    "titles": [
      "Iran ready to discuss compromises to reach nuclear deal, minister tells BBC in Tehran",
      "Iran open to compromises to reach nuclear deal with U.S., minister tells BBC - CNBC"
    ],
    "url": "https://www.bbc.com/news/articles/clyz4y3zwz5o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxOUE94ZXhqYmxQd2ZEQUxSOWJYc1oyWXlqZUxTeHpUSFF6eTFsd1hqV29kZFdWSnhjUWU3a1dvNU9GVTFHX0xDbnYzVDkxSzJuOHFjSklnVXc4eXpuT1B2WnNQNm9TWUNyeENHR2Z0b0x5a29WQk1ydGxSRUczZzhRMEIyREpYUGkzOUd6TENnR09vN0FNX2RFRGJCVdIBoAFBVV95cUxQZDROVWNwRFFKZ1V0Sm9oRGx6bEM0WVlOWTdzUEItRXR1RkgwSHhBNl9xenJ6TXhURUdPcjIwLUtRQVAxS0Z2ZWEwdGI0Q3NzSk9PNWdzWmNad1BSM2tBRVRCMXZzVlRZMXlKdzVMdEpIMVV2Y0hOck1tLWxTLXBHZzdfek5HaGxMTG56dnEtNmdWd2o5ZDUtekJzSWFKemFN?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/clyz4y3zwz5o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.85,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Iran's deputy foreign minister Majid Takht-Ravanchi stated that Iran is open to compromises to reach a nuclear agreement with the U.S., but emphasized that it is now up to the U.S. to demonstrate its willingness to make a deal.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canada Launches Defense Strategy to Boost Domestic Investment",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 14:00:40 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Carney Plots ‘Buy Canada’ Defense Strategy to Unlock Billions in Investment Bloomberg.com",
      "Canada will spend more of its growing military budget with domestic firms under a defense-industrial strategy that’s meant to unleash more than C$500 billion ($369 billion) in investment over a decade."
    ],
    "image_url": "",
    "titles": [
      "Carney Plots ‘Buy Canada’ Defense Strategy to Unlock Billions in Investment - Bloomberg.com",
      "Carney Plots ‘Buy Canada’ Defense Strategy to Unlock Billions in Investment"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPZzB0TzgxbE9CUGlfS1J5NVNzeUFQeVVsZEpfUG93c2hoY2thRzJnRlBVNXNWeEJLc0NMOXI5OXhpcHB5M1dqci1vWUVMWUhkbjFLVHhXTmhsRmxmaGdURkxBVFJCejRBQ0l4RURadWh1WTRmeFU3SXVVcVJ0QzEwSGdtSWJ6MjdUSmt0NDJqNEZIVkJ0RERuckw1U3gyZ21sbW0xZTJ6R0dkSUtYakhkeUhaQThyWk1GSEs2OVhYTHppdw?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/carney-plots-buy-canada-defense-strategy-to-unlock-billions-in-investment"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPZzB0TzgxbE9CUGlfS1J5NVNzeUFQeVVsZEpfUG93c2hoY2thRzJnRlBVNXNWeEJLc0NMOXI5OXhpcHB5M1dqci1vWUVMWUhkbjFLVHhXTmhsRmxmaGdURkxBVFJCejRBQ0l4RURadWh1WTRmeFU3SXVVcVJ0QzEwSGdtSWJ6MjdUSmt0NDJqNEZIVkJ0RERuckw1U3gyZ21sbW0xZTJ6R0dkSUtYakhkeUhaQThyWk1GSEs2OVhYTHppdw?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.824,
      "consensus": 0.591,
      "constructiveness": 0.06,
      "proximity": 0.5
    },
    "score": 0.642,
    "constructiveness_score": 0.06,
    "constructiveness_reason": "keywords (2): investment, strategy; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Canada has announced a defense-industrial strategy to prioritize domestic firms in military spending, aiming to generate over C$500 billion in investment over the next ten years.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK Says Russia Increasingly Using Foreign Fighters in Ukraine War",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 12:31:40 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Russia’s Losses Boosting Reliance on Foreign Fighters, UK Says Bloomberg.com",
      "Russia is becoming increasingly reliant on foreign fighters in the war on Ukraine as its forces sustain more losses than they’re able to replace, UK Defence Secretary John Healey said."
    ],
    "image_url": "",
    "titles": [
      "Russia’s Losses Boosting Reliance on Foreign Fighters, UK Says - Bloomberg.com",
      "Russia’s Losses Boosting Reliance on Foreign Fighters, UK Says"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPUUpvQVNVUW96Z2FMY3RjdXhBWG1HUEVnVm1CTWhxU2R3SVJRdV91aW4zUTBFd0VuX3l3dHRNUG42YTBrbkJPeUhaMG9VQ0hLYXBPbEN1Zm9udFFWcUQ0SUxJdHVFZy1taEw4NDFMZzBIb0FRQ1pyOElNNzJCNFh1Q3FwVXFMT3B3b1ZUU1pVYkdJNURMNFdsMGdUdTJMQW5iMlVZTE9PRHBKczJmM3VpX0t3?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/russias-losses-boosting-reliance-on-foreign-fighters-uk-says"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPUUpvQVNVUW96Z2FMY3RjdXhBWG1HUEVnVm1CTWhxU2R3SVJRdV91aW4zUTBFd0VuX3l3dHRNUG42YTBrbkJPeUhaMG9VQ0hLYXBPbEN1Zm9udFFWcUQ0SUxJdHVFZy1taEw4NDFMZzBIb0FRQ1pyOElNNzJCNFh1Q3FwVXFMT3B3b1ZUU1pVYkdJNURMNFdsMGdUdTJMQW5iMlVZTE9PRHBKczJmM3VpX0t3?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.791,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.07, neg_sim=0.09; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "UK Defence Secretary John Healey stated that Russia is increasingly depending on foreign fighters in its war against Ukraine due to mounting losses that outpace its ability to replace troops.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Four New Astronauts Restore Full Crew at International Space Station",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 14 Feb 2026 23:36:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Four new astronauts arrive at the International Space Station to replace NASA's evacuated crew AP News",
      "The International Space Station returned to full strength with Saturday's arrival of four new astronauts to replace colleagues who bailed early because of health concerns."
    ],
    "image_url": "",
    "titles": [
      "Four new astronauts arrive at the International Space Station to replace NASA's evacuated crew - AP News",
      "Four new astronauts arrive at the International Space Station to replace NASA's evacuated crew"
    ],
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOakR4ZXJqbXhOdTA3eDMyRjFwOG1sNTQ4Q01WcDFKUW5TcnhONEVqNV95M2luVktEQWFFYWdKTWRVMFg5bWZmcW5VbnNIX1JCYlYwR092U055WFdLWnFiNElyTGFDSHpkVTJhbk0wbUFSblRiZ3k1ZEFkdi11MkduQnI5ay1BNktkNG9scHZQaDZDa1dP?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2026-02-astronauts-international-space-station-nasa.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOakR4ZXJqbXhOdTA3eDMyRjFwOG1sNTQ4Q01WcDFKUW5TcnhONEVqNV95M2luVktEQWFFYWdKTWRVMFg5bWZmcW5VbnNIX1JCYlYwR092U055WFdLWnFiNElyTGFDSHpkVTJhbk0wbUFSblRiZ3k1ZEFkdi11MkduQnI5ay1BNktkNG9scHZQaDZDa1dP?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.552,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.559,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Four new astronauts arrived at the International Space Station, restoring its full crew after the previous team left early due to health concerns.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Quarterback Taron Dickens Transfers to University of North Carolina",
    "domain": "politics",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 15:13:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com"
    ],
    "snippets": [
      "The University of North Carolina picked up former Western Carolina quarterback Taron Dickens out of the transfer portal.",
      "Former Western Carolina QB Taron Dickens signed with UNC out of the NCAA transfer portal, per On3’s Pete Nakos. He spent three years with the program before electing to transfer. Dickens is an intriguing quarterback prospect coming into Chapel Hill. Last season, Dickens had 3,508 yards, 38 touchdown"
    ],
    "image_url": "",
    "titles": [
      "Bill Belichick, UNC pick up another QB: Taron Dickens transfers from Western Carolina",
      "Former Western Carolina QB Taron Dickens signs with UNC"
    ],
    "url": "https://sports.yahoo.com/college-football/article/bill-belichick-unc-pick-up-another-qb-taron-dickens-transfers-from-western-carolina-151354500.html",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/former-western-carolina-qb-taron-134315439.html"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/college-football/article/bill-belichick-unc-pick-up-another-qb-taron-dickens-transfers-from-western-carolina-151354500.html",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.852,
      "consensus": 0.35,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.518,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player transfer in football, but it doesn't provide actionable insights or deeper understanding. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Taron Dickens, who played quarterback for Western Carolina for three years, has transferred to the University of North Carolina. Dickens signed with UNC out of the NCAA transfer portal after recording 3,508 yards and 38 touchdowns last season.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Uncertainty Grows as AI Trade Lacks Clear Leaders",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 17:51:31 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "In his Sunday column for Investing Club subscribers, Jim Cramer explores the software sell-off and Anthropic's influence on the stock market.",
      "The AI trade has entered a puzzling phase. Do we know who the winners are anymore? CNBC"
    ],
    "image_url": "",
    "titles": [
      "The AI trade has entered a puzzling phase. Do we know who the winners are anymore?",
      "The AI trade has entered a puzzling phase. Do we know who the winners are anymore? - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/15/jim-cramer-weighs-in-on-the-anthropic-fueled-software-stock-sell-off-.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPS3kwcElwRVlqRUlObmtmeEF1RnZiX2pJYTNxZ0FqTnMwVEpLNFZRUjl3OFltbEtUMDE3MVc0V3haLTBOczR1UXlXX0p0ZTBNeDNTM3Q0QUNSTE44WWZUNDFubW1hWlNJZ05LdGlBLWd4bkVxLTNaWXEzSlB0d1BKelY3N2dESEUwcEJvUWFMOWRSY1NVSVlRMzJ5UllmcGh4SDlLSjZZeHJpZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/15/jim-cramer-weighs-in-on-the-anthropic-fueled-software-stock-sell-off-.html",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.917,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.517,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The AI trade is experiencing significant uncertainty, with no clear leaders or dominant companies emerging at this stage, according to recent market analysis.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bitcoin Price Falls ETF Outflows Show No Signs of Investor Panic",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 15:24:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "As the price of bitcoin and other cryptocurrencies has crashed, exchange-traded funds have seen outflows, but ETF selling doesn't look like investor panic.",
      "In bitcoin price plummet, ETF flows are down but aren't signaling 'crypto winter' investor panic CNBC"
    ],
    "image_url": "",
    "titles": [
      "In bitcoin price plummet, ETF flows are down but aren't signaling 'crypto winter' investor panic",
      "In bitcoin price plummet, ETF flows are down but aren't signaling 'crypto winter' investor panic - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/15/bitcoin-price-crash-crypto-winter-investors-etf-flows.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUV92a2tBb3BIUTltdFBuc2NRdkR0dGJVSFNrNDFkYlNVbzNqcURqN3h5RFBHMVVVWWVBMW5oVEJyaWxLRDRVU2VmYmgzMU9NaVpWcm16eTktWmg3S0ozQS1LS3RseUNoZnpxbHRUZGVLMExraWt5TjJCcEpsYllWQ3JJdUhXWW9yblNrMlpIZzd3N0RO0gGaAUFVX3lxTFBOUUx4cTRncklycE92QnNUX1dFckVmVVltTjZuTl9SclVjNE55QmtkNFp5Qnc0WUVSeHJQcDNQNVlRRXVvRDFkY1E1QUtFWlpHZTFEV0dySTctX3NsQ3E0VnVnYW4ybGxFc0ltVW9nQTFvWENzOFl5UXZWdExDUjFwb2tqaVBVcFNNVlhocERiWHpXVGUtVUhLaGc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/15/bitcoin-price-crash-crypto-winter-investors-etf-flows.html",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.857,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.493,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bitcoin and other cryptocurrencies have dropped in price, leading to outflows from exchange-traded funds. However, ETF activity does not indicate widespread investor panic, according to market observers.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Epstein Files Reveal Details of Mortimer Zuckermans Personal Expenses",
    "domain": "business",
    "source_domain": "businessinsider.com",
    "location": "global",
    "published": "2026-02-15T15:12:30Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "businessinsider.com"
    ],
    "snippets": [
      "Here's how the billionaires in the files made their money.",
      "Billionaire real estate mogul Mortimer Zuckerman's personal expenses are laid out in exacting detail in the Epstein files."
    ],
    "image_url": "https://i.insider.com/698fa6eee1ba468a96ac166a?format=jpeg",
    "titles": [
      "The billionaires named in the Epstein files",
      "$100,000 a year on groceries, $220,000 on horses: What the Epstein files reveal about one billionaire's spending habits"
    ],
    "url": "https://www.businessinsider.com/the-billionaires-named-in-the-epstein-files-2026-2",
    "alternate_urls": [
      "https://www.businessinsider.com/epstein-files-reveal-how-billionaires-spend-money-mortimer-zuckerman-2026-2"
    ],
    "location_scope": "global",
    "link": "https://www.businessinsider.com/the-billionaires-named-in-the-epstein-files-2026-2",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.852,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.493,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Newly released Epstein files detail billionaire Mortimer Zuckerman's personal expenses, providing insight into his financial activities.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Markets Anticipate Ongoing Volatility Amid AI Developments",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 08:36:50 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Looking back at last week's volatility could gives some clues for the trading week ahead.",
      "Global week ahead: Markets brace for more AI noise and 'scare trading' CNBC"
    ],
    "image_url": "",
    "titles": [
      "Global week ahead: Markets brace for more AI noise and 'scare trading'",
      "Global week ahead: Markets brace for more AI noise and 'scare trading' - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/15/global-week-ahead-markets-brace-for-more-ai-noise-and-scare-trading.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxNWTZGMG16cmRaQzNLT0Z1ZktudTl2cTZYMUhVRXEweEh6MkpOQ0ZIcFQzaHFvZ2VwdUZzMzd6Mk05ZDdRLTAwVGQxU2N6a1ljWExuYVVRRm1FeGZzcTVtTW1lZEstSXJKSFpoWmI2b1EtSWtVd3dJcmZycXhrM1d1SkY2NXVJdnAtd1gyVlJtb21uekV3RGxzdWpIVHZBY0d6cUhhZzQ0ONIBrAFBVV95cUxQcHJhc25KQmwySFp2aHRGOTdqejNxY2RtTTRxcWZJekNWeW05UTZ4aFNSRGhNN21uYVFqcWFZMmJRSFdHNGNwYVJ0MG9KVDlpcmFlS1hvbElpWXBFamZqRnM3LWctYVVERFJrelRRSUIxR09OVWZCWXBWVFYyUVJXZE1PTlV1ZjBvSXBSQzBFSVgyVmxfTDBSbVJIbm9SREd4OUVLb3dFeWhpM2p3?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/15/global-week-ahead-markets-brace-for-more-ai-noise-and-scare-trading.html",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.709,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Markets are preparing for continued volatility in the coming week, with analysts expecting more fluctuations driven by developments in artificial intelligence and investor reactions described as 'scare trading.'",
    "is_trending": false,
    "trending_score": 0.0
  }
]