[
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale for 2025, which runs until March 31st. The sale offers significant discounts on a variety of items, including gardening supplies and bedding, to mark the beginning of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8818112671296297,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43045281678240743,
    "summary": "Amazon's Big Spring Sale for 2025 is underway until March 31st, featuring substantial discounts on items such as gardening supplies and bedding to celebrate the start of the warmer season."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a challenging yet rewarding experience for players. The game has been praised for its precision in gameplay, marking a significant achievement in the franchise's development of shinobi elements."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8305959890046296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41764899725115745,
    "summary": "Assassin's Creed Shadows has been commended for its enhanced stealth and assassination gameplay, offering players a challenging and precise experience. The game represents a notable advancement in the franchise's incorporation of shinobi elements."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is a gaming laptop aimed to rival the MacBook Pro, featuring a return to a thinner and lighter design compared to its previous, bulkier version."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7889293220833333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4072323305208333,
    "summary": "The Razer Blade 16, a gaming laptop designed to compete with the MacBook Pro, has been updated to a thinner and lighter model, moving away from its earlier, heavier design."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The BougeRV LED lantern, marketed as an outdoor light, functions as a versatile work lamp suitable for various settings needing additional illumination. It is rechargeable, portable, and features three adjustable LED panels that emit up to 3000 lumens, making it ideal for use in areas like campsites, workspaces, or for mechanical work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5049941366550925,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3362485341637731,
    "summary": "The BougeRV LED lantern is a rechargeable, portable outdoor light with three adjustable LED panels. It emits up to 3000 lumens, making it suitable for various settings such as campsites, workspaces, and mechanical work, where extra illumination is needed."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of an ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.17123256232638884,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2528081405815972,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while a court case is ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft announced that in its latest Windows 11 Insider Preview, it will remove a bypass script previously allowing users to set up Windows 11 devices without an internet connection or logging into an account. This move enforces the requirement for all Windows 11 devices to be connected to the internet and logged in during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.16723950653935182,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.25180987663483795,
    "summary": "Microsoft has announced that its newest Windows 11 Insider Preview will eliminate a script that allowed users to set up the system without an internet connection or account login. This change mandates internet connection and account login for all Windows 11 device setups."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently ongoing until Monday, March 31st, offering a wide range of deals that are accessible without an Amazon Prime membership. The sale features over 100 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.15896404334490732,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24974101083622682,
    "summary": "Amazon is hosting its Big Spring Sale until March 31st, featuring over 100 deals on popular gear and various low-cost alternatives. These deals are available to all customers, not just Amazon Prime members."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has purchased the social media platform X (previously Twitter) in an all-stock deal. Musk valued xAI at $80 billion and X at $33 billion, incorporating $12 billion of X's debt. This acquisition comes years after Musk originally bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.15300339421296305,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24825084855324075,
    "summary": "Elon Musk's AI company, xAI, acquired the social media platform X (formerly known as Twitter) in an all-stock transaction. The deal values xAI at $80 billion and X at $33 billion, including $12 billion in debt. This purchase follows Musk's initial acquisition of Twitter for $44 billion years earlier."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11. This feature, announced last year, aims to enable IT professionals to remotely recover devices that won't boot, in response to incidents like the previous Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.14561913465277776,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24640478366319443,
    "summary": "Microsoft is testing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This tool is designed to help IT professionals remotely fix devices that fail to boot, addressing issues similar to those experienced during the Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year. This update follows Google's acquisition of Fitbit in early 2021 and their initial integration of Fitbit's services with Google's, which initially set a 2025 deadline for account migration."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.12950802328703703,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.24237700582175925,
    "summary": "Google has postponed the deadline for Fitbit users to switch their accounts to Google accounts to next year, following its acquisition of Fitbit in 2021. This extension gives users more time beyond the initially set 2025 deadline for migrating their Fitbit services to Google's platform."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with BBC, describing it as \"incredible\" that bombs were dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur, in a BBC interview, condemned the military for dropping bombs during rescue operations, describing the action as \"incredible.\""
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, prompting ongoing rescue efforts to extract individuals trapped in the debris."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to rescue operations to save people trapped under the rubble."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have expressed their distress during interviews with the BBC, sharing their experiences and the emotional impact of their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing persons in Antigua have shared their distress and the emotional toll of their loved ones' disappearances in interviews with the BBC."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 21 people being injured and caused a restaurant along with several other buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Andrew Harding reports from Nuuk, revealing that numerous residents in the Danish territory feel intimidated by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Andrew Harding's report from Nuuk indicates that many locals in the Danish territory are feeling intimidated by the United States."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase do not belong to Somalia, and therefore, Somalia does not have the authority to relinquish control over these facilities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that Somalia lacks the authority to relinquish control over the Berbera port and airbase, claiming these facilities do not belong to Somalia."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons, less than a year into his sentence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who began serving a 20-year sentence, has been pardoned for health reasons, less than a year after his sentencing began."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. This initiative aims to improve the visual content available."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to enhance the quality of photos, particularly of celebrities, on a specific website. The project focuses on upgrading the visual content offered."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, a public figure, has been criticized for wearing a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for disguising himself to promote his book on TV."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration has initiated a probe as part of a broader effort to scrutinize diversity and inclusion practices."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation into diversity and inclusion practices as part of a wider review effort."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed against a controversial influencer, accusing him of assault and making threats during an incident in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a controversial influencer of assault and making threats in Beverly Hills, which the influencer denies."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's severity and the extensive length of the fault line it occurred on were major factors in the resulting devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake caused significant destruction due to its high magnitude and the long fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing widespread destruction in the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, and a car seller interviewed by the BBC predicts that the situation will worsen."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices have seen a significant rise, and according to a car seller interviewed by the BBC, this trend is expected to continue worsening."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the sale price of his work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was commended for their bravery during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received praise for their courage while conducting an evacuation at a South Sudan military base, where they were attacked."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere in the world, but some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, 30-year-old Phyu Lay Khaing was rescued and carried away on a stretcher, receiving cheers from onlookers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was rescued and subsequently carried away on a stretcher, an event that led to cheers from those watching."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed following a powerful earthquake in Myanmar on Friday, leaving dozens of people unaccounted for."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed in Myanmar after a powerful earthquake struck on Friday, resulting in dozens of people missing."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after evacuating from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby shortly after being evacuated from a hospital."
  },
  {
    "title": "How stable is Lebanon’s peace – after Israel attack on Beirut?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:39:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel is on high alert following a warning from Prime Minister Benjamin Netanyahu about the potential for further attacks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel has heightened its security measures in response to Prime Minister Benjamin Netanyahu's alert about the possibility of more attacks."
  },
  {
    "title": "Tufts University student can’t be deported  to Turkiye without court order",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:27:04 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rumeysa Ozturk, a student who supports Palestine, was arrested by US immigration officials in Massachusetts on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rumeysa Ozturk, a student known for her support of Palestine, was arrested by US immigration officials in Massachusetts on Tuesday."
  },
  {
    "title": "Skygazers marvel at Saturday’s partial solar eclipse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:38:56 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A partial eclipse was visible across Europe, Africa, and Newfoundland, captivating viewers with a display of celestial alignment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A partial eclipse was observed in Europe, Africa, and Newfoundland, attracting attention with its celestial spectacle."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators have discovered that mutations to VPS35, a crucial component in a pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to chemotherapy resistance. This finding may assist in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Investigators have found that mutations in VPS35, a key element in a pathway that employs reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy. This discovery could help identify tumors that are resistant to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study revealed that over 50% of US adults have faced discrimination, significantly impacting mental health. Those highly exposed to discrimination are over five times more likely to show signs of depression and anxiety. Moreover, individuals experiencing such mistreatment have almost nine times the likelihood of screening positive for both mental health conditions compared to those who haven't faced discrimination."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that over half of US adults have experienced discrimination, which greatly affects their mental health. Individuals who face high levels of discrimination are more than five times as likely to exhibit depression and anxiety symptoms. Furthermore, those subjected to mistreatment are nearly nine times more likely to test positive for both mental health issues than those who haven't experienced discrimination."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new customizable 3D printed hydrogel has shown promising results in preclinical trials for treating various types of meniscal tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new 3D printed hydrogel, designed to be customizable, has demonstrated promising outcomes in preclinical trials for the treatment of different kinds of meniscal tears."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A seven-day cold water immersion study shows it significantly boosts cellular resilience and autophagic function, aiding in stress management at a cellular level. This adaptation may contribute to improved health, disease prevention, and slower aging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A seven-day study on cold water immersion found it enhances cellular resilience and autophagic function, which helps cells manage stress better. This adaptation could lead to better health, disease prevention, and slower aging."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Around one-third of women aged 14-49 in the U.S. experience bacterial vaginosis (BV), marked by odors and discomfort. Over half of those treated with the first-line antibiotic, metronidazole, face recurrence. Researchers have now created a DNA PCR-based lab test for a more accurate diagnosis, allowing for tailored treatments."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the U.S., about one-third of women aged 14-49 suffer from bacterial vaginosis, characterized by odors and discomfort. Over 50% of those treated with metronidazole, the primary antibiotic, experience a recurrence. Researchers have developed a DNA PCR-based lab test for more precise diagnosis, enabling personalized treatments."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study focused on improving camera trap effectiveness for monitoring weasels found that using red meat as bait, enhanced with scent oils, significantly increases the chances of capturing these elusive animals on camera. This method aims to aid conservationists in accurately tracking weasel populations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study has found that using red meat bait, along with scent oils, significantly improves the success of camera traps in monitoring elusive weasels. This technique is aimed at helping conservationists track weasel populations more accurately."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that can learn independently, closely mimicking biological neurons. These \"infomorphic neurons\" form artificial neural networks that self-organize and learn from their immediate environment, enhancing their capacity to process information like their natural counterparts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created \"infomorphic neurons,\" a new type of artificial neuron that can independently learn and self-organize within artificial neural networks, closely resembling the learning process of biological neurons. This advancement allows these networks to better process information by learning from their surroundings."
  },
  {
    "title": "Yankees slug four HRs in 1st inning off Cortes",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Yankees pitcher Nestor Cortes, now with the Brewers, allowed first-inning home runs to Paul Goldschmidt, Cody Bellinger, Aaron Judge, and Austin Wells during a game in the Bronx on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Yankees pitcher, Nestor Cortes, now playing for the Brewers, gave up first-inning home runs to four players - Paul Goldschmidt, Cody Bellinger, Aaron Judge, and Austin Wells - in a game at the Bronx on Saturday."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is entering the NBA draft and the transfer portal, as confirmed by his agent to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, has decided to enter the NBA draft and the transfer portal, according to his agent's confirmation to ESPN."
  },
  {
    "title": "Bills, CB Benford agree to 4-year, $76M extension",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Buffalo Bills have finalized a four-year contract extension with cornerback Christian Benford, worth $76 million, according to his agents via ESPN's Adam Schefter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Buffalo Bills have agreed to a four-year, $76 million contract extension with cornerback Christian Benford, as confirmed by his agents and reported by ESPN's Adam Schefter."
  },
  {
    "title": "Paopao: S. Carolina should be 'punching first'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "South Carolina guard Te-Hina Paopao emphasized the importance of her team overcoming their tendency for slow starts by taking a more aggressive approach from the beginning of games. This statement was made in preparation for their upcoming Elite Eight match against Duke."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "South Carolina guard Te-Hina Paopao highlighted the need for her team to start games more aggressively to avoid slow beginnings. She made these remarks as they prepare for their Elite Eight match against Duke."
  },
  {
    "title": "2-time WNBA MVP Stewart re-signs with Liberty",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Breanna Stewart has re-signed with the Liberty, following her pivotal role in securing the team's first WNBA championship last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Breanna Stewart has re-signed with the New York Liberty after playing a key role in winning the team's first WNBA championship last year."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A well-executed inbounds play led No. 1 Houston to secure a 62-60 victory over Purdue, advancing them to the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston won against Purdue with a score of 62-60, moving on to the Elite Eight thanks to a successful inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts scored 31 points and had 10 rebounds, helping UCLA win 76-62 against Ole Miss. This victory takes UCLA to the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:57:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off homer on Friday, marking an emotional highlight early in the season after an illness led him to lose nearly 20 pounds."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, an emotional moment early in the season. This comes after an illness caused him to lose nearly 20 pounds."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:17:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston both secured victories in their respective games. The events of the night, including these wins, were analyzed in detail, covering key moments and performance highlights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, both Auburn and Houston achieved victories in their respective sports games. The coverage provided detailed analysis of these matches, highlighting significant moments and standout performances from the events."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:27:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Sweet 16 round of the women's NCAA tournament commenced with its first four games. This phase is a critical part of the tournament, determining which teams advance closer to the championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament entered the Sweet 16 round, featuring the first four games. This stage is crucial for teams aiming to progress towards the championship title."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The article provides an analysis of various sports matchups, discussing their implications for playoff projections, draft lottery standings, and additional related topics. It aims to inform readers about the potential outcomes and their impact on the sports season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The article analyzes different sports matchups, focusing on their potential effects on playoff projections and draft lottery standings. It aims to inform readers about how these outcomes could influence the overall sports season."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, outlining each team's schedule up until April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is being defined as a panel has voted on the team schedules leading up to April 17, clarifying the path forward for the competing teams."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:39:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, leading to a focus on future team development. This includes assessing transfer portal priorities and integrating new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded, prompting the team to shift focus towards building for the future. Efforts will center on evaluating transfer portal options and incorporating new recruits to strengthen the team for the upcoming season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' ballpark for Opening Day in just four days. This rapid changeover involved extensive preparations and modifications to accommodate the event, showcasing the flexibility and capability of the facility to host major league games on short notice."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Rays' ballpark for Opening Day within four days. This swift transformation required significant preparations and adjustments, demonstrating the facility's ability to host major league games at short notice."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting lines, point spreads, totals, and Basketball Power Index (BPI) ratings are now available for all games in the Women's basketball tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting information including lines, point spreads, totals, and Basketball Power Index (BPI) ratings for all games in the Women's basketball tournament has been released."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL are aiming to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are competing to surpass Birmingham, the current top team in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze scored a goal and provided an assist in Crystal Palace's 3-0 victory over Fulham on Saturday, securing their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze contributed a goal and an assist in Crystal Palace's 3-0 win against Fulham, helping his team advance to the FA Cup semifinals on Saturday."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) has fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving a jury award of over $20 million."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to play for Crystal Palace on Saturday, marking his first game since his ear was significantly injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played for Crystal Palace on Saturday for the first time since he suffered a major ear injury."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna has appealed to the Spanish football federation (RFEF), arguing that Barcelona improperly played defender Iñigo Martínez in their LaLiga match. The appeal is based on a technicality related to Martínez's absence from Spain's games due to injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has filed an appeal with the Spanish Football Federation (RFEF) against Barcelona for allegedly fielding defender Iñigo Martínez improperly in a LaLiga match. The complaint centers on a technicality regarding Martínez's participation following his absence from Spain's matches due to injury."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:31:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 match against the Houston Dash on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will have her left knee evaluated after being injured in a 0-0 game against the Houston Dash on Friday."
  },
  {
    "title": "Iraola 'happy' at Bournemouth amid Spurs talk",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bournemouth manager Andoni Iraola expressed satisfaction with his current position, amid rumors suggesting he might move to Tottenham Hotspur."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bournemouth manager Andoni Iraola has stated he is content with his current role, despite speculation linking him to a potential move to Tottenham Hotspur."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 13:49:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo appealed to FIFA, requesting the organization to reevaluate its decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have formally appealed to FIFA, asking the organization to reconsider its decision to disqualify the Mexican team from participating in the Club World Cup."
  }
]