[
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, which runs until March 31, 2025. The event features discounts on gardening supplies, bedding, and more, coinciding with the start of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9227216901041667,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44068042252604167,
    "summary": "Amazon's Big Spring Sale is underway until March 31, 2025, offering discounts on various items including gardening supplies and bedding. The sale is timed to coincide with the beginning of the warmer season."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, offering a challenging yet rewarding experience for players. This iteration is noted for its precision in gameplay, marking a significant achievement in the franchise's development of stealth elements."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8715064117824074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4278766029456018,
    "summary": "Assassin's Creed Shadows enhances the franchise with advanced stealth and assassination mechanics, providing a more challenging and rewarding gameplay experience. It is recognized for its precise gameplay, signifying a notable advancement in the series' stealth aspects."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is a gaming laptop that aims to be an alternative to the MacBook Pro, featuring a design that balances gaming capabilities with a thin and light chassis. This marks a return to a more streamlined design after previous models increased in size."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8298397446643518,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.417459936166088,
    "summary": "The Razer Blade 16 gaming laptop is designed as a MacBook Pro alternative, offering a balance between gaming performance and a slim, lightweight body. This represents a shift back to a more streamlined design following earlier models that had grown larger."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various lighting needs. It features a rechargeable, compact design with three swiveling LED panels that emit 3000 lumens, ideal for illuminating campsites, workspaces, or engine blocks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5459045590509259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3464761397627315,
    "summary": "BougeRV has released an LED lantern designed for outdoor camping, which doubles as a work lamp. It offers a rechargeable, compact design with three adjustable LED panels that produce 3000 lumens, making it suitable for lighting up campsites, workspaces, or engine blocks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, a court, led by Judge Amy Berman Jackson, issued a preliminary injunction to prevent the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) during ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.21214298458333325,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2630357461458333,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction to stop the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while legal proceedings are ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has updated its Windows 11 Insider Preview, removing a bypass script that previously allowed users to set up the operating system without an internet connection and logging in. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged in during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.2081499286342593,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2620374821585648,
    "summary": "Microsoft updated its Windows 11 Insider Preview, eliminating a script that let users install the OS without an internet connection and without logging in. Now, setting up Windows 11 requires internet access and user login."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features dozens of deals accessible without an Amazon Prime membership. A comprehensive roundup includes over 100 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.19987446526620378,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.25996861631655094,
    "summary": "Amazon's Big Spring Sale is ongoing until March 31st, offering numerous deals that do not require an Amazon Prime membership. The sale includes a wide range of popular items and budget-friendly alternatives, with a total of over 100 deals featured."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X, previously known as Twitter, in an all-stock deal. Musk valued xAI at $80 billion and X at $33 billion, which includes $12 billion in debt. This acquisition comes a few years after Musk originally purchased Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.19391381674768515,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2584784541869213,
    "summary": "Elon Musk's AI firm, xAI, has bought the social media site X (formerly Twitter) in an all-stock transaction. Musk valued xAI at $80 billion and X at $33 billion, including $12 billion of debt. This follows Musk's initial acquisition of Twitter for $44 billion a few years earlier."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653), a feature aimed at enabling IT professionals to remotely recover Windows 11 devices that won't boot. This development comes as a response to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.18652955542824057,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.25663238885706013,
    "summary": "Microsoft is trialing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This tool is designed to help IT professionals remotely fix devices that fail to boot, aiming to avert issues like those experienced during last year's Crowdstrike event."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to Google accounts until next year, following its acquisition of Fitbit in early 2021. Initially, users were required to make this transition by 2025, but a recent email to Fitbit users announced the extension."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.17041844384259264,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2526046109606481,
    "summary": "Google has postponed the deadline for Fitbit users to switch their accounts to Google accounts to next year, after initially setting a 2025 deadline. This change follows Google's acquisition of Fitbit in early 2021, as communicated in a recent email to Fitbit users."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers are currently engaged in efforts to rescue individuals trapped under the debris of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescuers are working to save people trapped under the rubble of a tower that fell on Friday."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has injured 21 people and caused a restaurant along with several buildings to burn, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city resulted in 21 people being injured and led to the destruction of a restaurant and several other buildings, as reported by local officials."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Andrew Harding reports from Nuuk, revealing that residents in the Danish territory feel pressured by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Residents of Nuuk, in the Danish territory, are feeling pressured by the United States, according to a report by Andrew Harding."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki has been criticized for wearing a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for disguising himself to promote his book on TV."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence when the pardon was granted."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year sentence, has been pardoned for health reasons."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration has initiated a probe as part of a broader effort to investigate diversity and inclusion practices."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has started an investigation into diversity and inclusion practices as part of a wider examination."
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US President labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting with Canadian leaders after Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US President described recent talks with Canada as \"extremely productive\" and revealed intentions to hold a meeting with Canadian officials following the forthcoming elections in Canada."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. The initiative aims to replace or improve these images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to enhance or replace low-quality celebrity photos on a particular website, aiming to improve the overall image quality on the platform."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed alleging that a controversial influencer committed assault and issued threats in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a well-known influencer of assault and making threats in Beverly Hills, claims the influencer denies."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from actors Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy apologized after receiving criticism from actors Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests happening in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, expressing their anguish over their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of people who have gone missing in Antigua have expressed their deep distress and concern to the BBC about their missing loved ones."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's magnitude and the extensive length of the fault line it occurred on were significant factors in the resulting devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake caused widespread destruction, significantly influenced by its magnitude and the long fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A massive earthquake struck central Myanmar, resulting in widespread destruction across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing extensive damage throughout the area."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mural by artist MF Husain, 14 feet wide, was sold for a record $13.8 million in New York. This sale sets a new highest price for Husain's artwork."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation at a military base in South Sudan. While under fire, the crew successfully carried out their mission, ensuring the safety of those involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew successfully completed an evacuation mission at a military base in South Sudan despite being under fire. Their actions, which ensured the safety of everyone involved, have been commended."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations for further rises, according to a car seller speaking to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have significantly increased, with further rises expected, as reported by a car seller to the BBC."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, some regions in Canada will experience a nearly total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere globally. However, certain areas in Canada will witness a nearly total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers successfully carried 30-year-old Phyu Lay Khaing to safety on a stretcher, receiving cheers from onlookers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was safely rescued and carried on a stretcher to safety, eliciting cheers from those watching."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday due to a powerful earthquake originating from neighbouring Myanmar. Dozens of people are reported missing following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to an earthquake from Myanmar. Dozens are reported missing after the collapse."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Skygazers marvel at Saturday’s partial solar eclipse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:38:56 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A partial eclipse was observed across Europe, Africa, and Newfoundland, captivating viewers with a unique astronomical event where the Earth, moon, and sun aligned."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A partial eclipse was visible in Europe, Africa, and Newfoundland, drawing attention as the Earth, moon, and sun aligned, creating a captivating astronomical event for viewers."
  },
  {
    "title": "A Reel War: Israeli filmmaker’s search for stolen Palestinian films",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:30:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An Israeli filmmaker has discovered archives previously held by the PLO, sparking discussions on Palestinian heritage and identity."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An Israeli filmmaker has uncovered archives that were once in the possession of the Palestine Liberation Organization (PLO). This discovery has initiated conversations about Palestinian heritage and identity."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators have discovered that mutations to VPS35, a crucial component in a pathway using reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapies. This finding could aid in identifying tumors that are resistant to treatments."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Investigators found that mutations in VPS35, essential for a pathway that uses reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy. This discovery may help identify tumors resistant to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study reveals that over 50% of US adults have faced discrimination, significantly impacting mental health. Those highly exposed to discrimination are over five times more likely to show signs of depression and anxiety. Compared to those unaffected, individuals experiencing discrimination have nearly nine times the odds of screening positive for both mental health conditions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study shows that over half of US adults have experienced discrimination, which greatly affects their mental health. Those facing high levels of discrimination are more than five times likely to exhibit depression and anxiety symptoms. Compared to unaffected individuals, those experiencing discrimination have almost nine times higher chances of showing signs of both mental health issues."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new customizable hydrogel, created using 3D printing technology, has shown promising results in preclinical trials for treating various types of meniscal tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new hydrogel developed with 3D printing technology has shown potential in preclinical trials for treating different kinds of meniscal tears. This customizable hydrogel could offer new options for patients with these knee injuries."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cold water immersion for a week has been shown to boost cellular resilience and autophagic function, which helps cells better cope with stress. This adaptation may improve health, increase longevity, and help prevent diseases by slowing down cellular aging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A week of cold water immersion has been found to enhance cellular resilience and autophagic function, aiding cells in stress management. This adaptation could potentially enhance health, extend lifespan, and aid in disease prevention by decelerating cellular aging."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Approximately one-third of women aged 14-49 in the U.S. experience bacterial vaginosis (BV), marked by odors and discomfort, with potential long-term health risks. Over half of those treated with the first-line antibiotic, metronidazole, face recurrence. Researchers have now created a DNA PCR-based lab test aimed at improving treatment by analyzing the bacteria responsible for BV, allowing for more personalized medication prescriptions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "About one-third of U.S. women aged 14-49 suffer from bacterial vaginosis, which can cause odors and discomfort. Over 50% see a recurrence after initial treatment with metronidazole. Researchers have developed a DNA PCR-based lab test to better target the bacteria causing BV, enabling more tailored treatments."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that red meat, enhanced with scent oils, is the most effective bait for capturing weasel images on camera traps. This finding aids conservationists in tracking weasel populations, as these animals are notoriously hard to photograph."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that using red meat laced with scent oils is the best bait for photographing weasels with camera traps. This technique helps conservationists in monitoring weasel populations, which are difficult to capture on camera."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that mimic biological ones more closely, capable of independent learning. These infomorphic neurons form artificial neural networks that self-organize and adapt by extracting information from their surroundings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created advanced artificial neurons that closely resemble biological ones, with the ability to learn on their own. These neurons form networks that can self-organize and adapt to their environment by processing information around them."
  },
  {
    "title": "Brain channels 'stopped in time' reveal chemical flow that enables learning and thinking",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 13:49:00 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent study has discovered findings that could help in creating new drugs aimed at either blocking or opening signaling channels. This advancement has the potential to treat a range of conditions, including epilepsy and certain intellectual disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found ways to potentially create drugs that can block or open signaling channels, offering new treatment possibilities for epilepsy and some intellectual disorders."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:17:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Friday night featured significant victories for Auburn and Houston, with detailed analysis available on their performances and strategic plays."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston both achieved significant victories in their respective games. Detailed analyses of these matches highlight their performance levels and strategic decisions that led to their wins."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is entering the NBA draft and the transfer portal, according to his agent's statement to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., awarded Big East Player of the Year and from St. John's, is entering the NBA draft and the transfer portal, as confirmed by his agent to ESPN."
  },
  {
    "title": "Bills, CB Benford agree to 4-year, $76M extension",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Buffalo Bills have signed cornerback Christian Benford to a four-year contract extension worth $76 million, as confirmed by his agents to ESPN's Adam Schefter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Buffalo Bills have extended cornerback Christian Benford's contract for four years at a value of $76 million, according to information from his agents reported by ESPN's Adam Schefter."
  },
  {
    "title": "2-time WNBA MVP Stewart re-signs with Liberty",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Breanna Stewart has re-signed with the New York Liberty, following a season where she played a pivotal role in securing the team's first WNBA championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Breanna Stewart has re-signed with the New York Liberty after playing a key role in winning the team's first WNBA championship last season."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A well-executed inbounds play led No. 1 Houston to a 62-60 victory over Purdue, securing their place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston won against Purdue with a score of 62-60, advancing to the Elite Eight after a successful inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts led UCLA to a 76-62 win against Ole Miss by scoring 31 points and grabbing 10 rebounds. This victory marks UCLA's first entry into the Elite Eight since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off home run on Friday, marking an emotional highlight in a season that began with him losing nearly 20 pounds due to illness."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, a significant moment in his season after he had lost nearly 20 pounds because of an illness."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb denounced the online bullying targeting Mississippi State's Chandler Prater, stating her belief that JuJu Watkins' ACL injury was not caused by a foul play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb condemned the online bullying aimed at Mississippi State's Chandler Prater, affirming her belief that the ACL injury suffered by JuJu Watkins was not the result of foul play."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:53:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' comment that Antetokounmpo could have scored 250 points in a 1970s game, stating that comparing different basketball eras is not feasible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo addressed LeBron James' remark suggesting Antetokounmpo could score 250 points in a 1970s basketball game, stating that comparing players from different eras is not practical."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:29:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament's Sweet 16 commenced with its first four games. This phase of the competition marks a critical point, narrowing down the teams as they vie for a spot in the Elite Eight and continue their journey towards the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament's Sweet 16 began with the first four games, advancing teams towards the Elite Eight and closer to the championship. This critical phase narrows down the contenders."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This report covers the implications of current matchups on playoff projections, draft lottery standings, and additional related updates. It examines what is at stake for teams in their respective matchups, providing an overview of the potential impacts on their positions in playoffs and draft lotteries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This report analyzes the effects of current sports matchups on playoff projections and draft lottery standings, detailing the stakes for teams in their games. It outlines how these matchups could influence their playoff positions or draft lottery odds."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on the team standings, with details provided on each team's schedule up until April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is taking shape after a panel voted on team standings, with a detailed schedule for each team running until April 17."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:39:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has concluded, leading to a shift in focus towards future team development. The team is now concentrating on portal priorities and welcoming new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has ended, and the team is now focusing on future development. This includes prioritizing transfers and integrating new recruits in preparation for the upcoming season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in only four days. This quick conversion showcases the adaptability and efficiency of the facility's management and staff in preparing for major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' Opening Day ballpark was rapidly set up at the Yankees' spring training facility in just four days, demonstrating the management and staff's capability to quickly adapt the venue for major league games."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:47:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team towards a potential championship title. Their performances have significantly contributed to the team's success this season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players for Notre Dame's basketball team, driving the team towards a potential championship with their standout performances this season."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting information, including lines, spreads, totals, and Basketball Power Index (BPI) ratings, has been released for every game of the Women's basketball tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting details for every game of the Women's basketball tournament, including lines, spreads, totals, and Basketball Power Index (BPI) ratings, are now available."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL are aiming to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are competing to overtake Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze scored a goal and provided an assist in Crystal Palace's 3-0 victory over Fulham on Saturday, securing their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze contributed a goal and an assist in Crystal Palace's 3-0 win against Fulham, advancing them to the FA Cup semifinals on Saturday."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that head coach Dorival Júnior has been dismissed following a loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) confirmed on Friday that they have terminated the contract of head coach Dorival Júnior. This decision comes after Brazil's football team lost to Argentina on Tuesday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson. Gleeson had accused the doctor of mishandling his treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won a lawsuit against Portland Timbers' team doctor, Richard H. Edelson, and was awarded over $20 million. Gleeson claimed that Edelson mishandled his medical treatment."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to Crystal Palace's starting lineup on Saturday, marking his first game since his ear was severely injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played in Crystal Palace's starting lineup on Saturday, his first game back after suffering a severe ear injury."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:41:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna has appealed to the Spanish football federation (RFEF), arguing that Barcelona improperly played defender Iñigo Martínez in their LaLiga match. The appeal is based on a technicality related to Martínez's absence from Spain's games due to injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has filed an appeal with the Spanish football federation (RFEF), claiming Barcelona incorrectly fielded defender Iñigo Martínez in a LaLiga match. The appeal centers on a rule regarding Martínez's participation following his absence from national team duty due to injury."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:31:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 match against the Houston Dash."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will be evaluated for a left knee injury she got during a 0-0 game against the Houston Dash."
  },
  {
    "title": "Iraola 'happy' at Bournemouth amid Spurs talk",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:51:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bournemouth manager Andoni Iraola expressed contentment with his current position at the club, despite rumors of a potential move to Tottenham Hotspur."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bournemouth manager Andoni Iraola stated he is happy with his role at the club, amid speculation about a possible transfer to Tottenham Hotspur."
  }
]