[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for the delegation of tasks to machines, such as self-driving cars and cleaning robots. While advanced humanoid robots may remain out of financial reach for many during their lifetimes, robot vacuums offer a more affordable option for automating household chores."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6536117859143518,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37340294647858796,
    "summary": "In today's technology-driven world, tasks like driving and cleaning are increasingly automated by machines, including self-driving cars and robots. Although advanced humanoid robots may be too expensive for widespread use, robot vacuums provide a more accessible way for people to automate household chores."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale, marking the start of the warmer months, is currently underway and will continue until Monday, March 31, 2025. The sale offers significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6035772480324073,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36089431200810185,
    "summary": "Amazon's Big Spring Sale is happening now through March 31, 2025, offering discounts on items such as gardening supplies and bedding to celebrate the start of the warmer months."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream, as part of its new Virtual Game Card lending system information on the company's website, according to VGC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5972124605092592,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35930311512731483,
    "summary": "Nintendo has announced \"Switch 2 Edition\" games after its Nintendo Direct stream, introducing a new Virtual Game Card lending system, as reported by VGC on the company's website."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting conservative podcasters for extensive access to senior Trump Administration officials. This event, aimed at engaging alternative media, is planned to be a recurring initiative, highlighting the administration's focus on incorporating new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5748398615625001,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35370996539062505,
    "summary": "On Thursday, the White House initiated Podcast Row, an event granting conservative podcasters access to senior officials from the Trump Administration. This move, aimed at engaging with alternative media, marks the beginning of what is intended to be a recurring initiative, showcasing the administration's effort to include new media outlets in its communication strategy."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers are being discounted, including its first color e-reader. Among these, the Kindle Scribe, notable for its note-taking capability, is on sale. The 16GB model of the Kindle Scribe has reached its lowest price ever."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5662302796990741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3515575699247685,
    "summary": "Amazon's Big Spring Sale features discounts on several e-readers, including the company's first color e-reader. The sale also highlights the Kindle Scribe, known for its note-taking feature, with the 16GB model hitting its lowest price to date."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission have been directed by Bureau of Consumer Protection Director Christopher Mufarrige to stop referring to the agency as \"independent\" in complaints, as revealed by an email obtained by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5389006797222222,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3447251699305556,
    "summary": "The Bureau of Consumer Protection Director, Christopher Mufarrige, has instructed Federal Trade Commission staff to cease describing the agency as \"independent\" in their complaints, according to an email revealed by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian tech firm, has released the Classic 2 trackball mouse, maintaining the original's design and ergonomics but with enhanced connectivity, a better scroll wheel, and an updated design for simpler 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.533797455474537,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3434493638686342,
    "summary": "Canadian tech company Ploopy has launched the Classic 2 trackball mouse, an update of its original model. The new version retains the original design and ergonomics but features improved connectivity, an enhanced scroll wheel, and a redesigned structure that simplifies 3D printing."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway, ending on Monday, March 31st. It features a wide range of deals accessible without an Amazon Prime membership. The sale includes more than 90 deals on popular products, with options for both high and low price points."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5070487145949074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3367621786487268,
    "summary": "Amazon's Big Spring Sale, ending on March 31st, offers over 90 deals on popular products. The sale is open to all customers, with no Amazon Prime membership required. Products available span various price ranges."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft is creating a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises, with Tencent investing €1.16 billion for a 25% stake. This values the new entity at approximately €4 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5026720717708333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3356680179427083,
    "summary": "Ubisoft is forming a subsidiary focused on its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six series, with Tencent acquiring a 25% share for €1.16 billion. This deal values the subsidiary at about €4 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on various gadgets and gear, including Apple MacBooks. Apple offers MacBooks with its M-series chips in several sizes and price points, though the M1 MacBook Air has been discontinued."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4975775170833333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3343943792708334,
    "summary": "Amazon's Big Spring Sale is currently happening, offering substantial discounts on a wide range of electronics, including Apple MacBooks. These MacBooks come with Apple's M-series chips in various sizes and price points. However, the M1 MacBook Air is no longer available as it has been discontinued."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified that they are not related to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" but stated they are not connected to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered by tariffs imposed by Trump, putting at risk future collaboration between the two countries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader expressed that tariffs introduced by Trump have changed the Canada-US relationship, potentially affecting future cooperation between the nations."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has expressed opposition to JD Vance and his wife following Donald Trump's promise to assert control over the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has opposed JD Vance and his wife after Donald Trump pledged to exert control over the island."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Former President Donald Trump has issued an order to his vice president, instructing him to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children died in a recent incident. Further details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who has been transferred to a prison in El Salvador by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was transferred from the United States to a prison in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The perpetrator's initial request for parole was rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's first parole request was denied in Texas."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing it of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies, with China among them, have announced plans to retaliate against the United States. They accuse the U.S. of violating international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case of Clare Nowland's death."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in relation to the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new technology was developed with assistance from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed with support from Russia, analysts report."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist for the BBC, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "BBC journalist Mark Lowen was arrested in Istanbul during coverage of protests and later deported to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The film, scheduled for release in May 2026, will feature Robert Downey Jr in the role of Doctor Doom."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming film, set for a May 2026 release, will star Robert Downey Jr. as Doctor Doom."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested following an incident where police, with the assistance of a local resident, managed to overpower and detain them."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been arrested after police, aided by a local resident, successfully subdued and detained the individual involved in an incident."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates confirm."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter found a man hiding under a child's bed after the child reported a \"monster\" there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter discovered a man hiding under a child's bed when investigating the child's claims of a \"monster\" in the room."
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his home, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as reported by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Boualem Sansal, an 80-year-old individual, stated in an interview with a far-right news outlet that colonial France allocated an excessive amount of land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Boualem Sansal, an 80-year-old, claimed in an interview with a far-right news outlet that colonial France gave too much land to Algeria."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A submarine sank near Hurghada, a well-known tourist spot, resulting in the deaths of six individuals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, leading to the deaths of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky expressed his views on the support Ukraine has received from Europe and highlighted the resilience of his country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine, emphasizing his country's resilience amidst challenges."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local factors has made the government's efforts to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government's bid for re-election faces difficulties due to a combination of global and domestic issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is expanding due to the increasing trend among affluent, urban Indians of pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is experiencing growth as more affluent, urban Indians are spending on pampering their dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that the combination of strong winds, dry land, and pine trees significantly increases the risk of wildfires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts highlight that the risk of wildfires is elevated due to strong winds, dry conditions, and the presence of pine trees."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to play golf all day with the US president if it would bring benefits to Vietnam, highlighting his commitment to fostering beneficial relations with the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated he is willing to play golf all day with the US president to benefit Vietnam, underscoring his dedication to improving relations with the United States."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that allows individuals to view their family tree dynamically, illustrating the global movements of ancestors over time. This innovative approach not only provides a unique perspective on genealogy but also has applications in tracking the spread of diseases and analyzing animal migration patterns across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that enables people to see their family tree in a dynamic way, showing ancestors' movements around the world over time. This method offers a fresh view on genealogy and can also be used to track disease spread and study animal migration patterns globally."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that increased meltwater and rainfall around Antarctica account for 60% of the observed difference between expected and actual ocean temperatures over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent study highlights that individuals experiencing Long COVID often report feeling neglected and doubted by their healthcare providers, indicating a lack of support and understanding for their condition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study shows that people with Long COVID feel ignored and doubted by their healthcare providers, suggesting a significant gap in support and understanding for their condition."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit distinct gene regulation. This variation in gene regulation among skeletal cells may contribute significantly to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from different parts of the body come from various precursor cells and show unique patterns of gene regulation. This diversity in gene regulation among skeletal cells is believed to play a key role in the evolutionary success of vertebrates."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Biology professor Mark Peifer from the University of North Carolina at Chapel Hill advocates for including eugenics in college genetics curriculums. He believes this will motivate scientists to address the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends incorporating eugenics into college genetics courses. He argues that this will help scientists confront and address the misuse of scientific research for political aims."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances have higher contamination levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from twelve parks in Dublin, Ireland, showed that park entrances have higher levels of infective roundworm eggs compared to other areas within the parks."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:20:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The tournament started with 68 teams, and after Thursday's games, only 12 teams remain. All the day's action was closely monitored."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament began with 68 competing teams. Following Thursday's games, the field has narrowed down to 12 remaining teams, with all of the day's events being closely followed."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech's place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored a crucial basket with 7.3 seconds left in overtime, helping Texas Tech win against Arkansas 85-83. This victory, after rallying from a 16-point deficit, advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased his basketball talent with 30 points, 6 rebounds, 7 assists, and 3 blocks in a Thursday night game, leading to a 100-93 victory over Arizona. This win secures the Blue Devils a spot in the Elite Eight for the consecutive second season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg, a player for Duke University, scored 30 points, grabbed 6 rebounds, gave 7 assists, and made 3 blocks in a game on Thursday, contributing to a 100-93 win against Arizona. This victory ensures that the Blue Devils advance to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers. The shot marked one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers. This shot is highlighted as one of the NBA season's most dramatic finishes."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not clearly state his future plans with the Terrapins following their Sweet 16 elimination by Florida on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "After the Maryland men's basketball team was eliminated from the Sweet 16 by Florida, Coach Kevin Willard did not specify his future plans with the Terrapins."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU during the East Region semifinal, led by Mark Sears. This breaks a 35-year-old record for most 3-pointers in a tournament game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in the East Region semifinal. Mark Sears led the team in this achievement, breaking a 35-year-old record for the most 3-pointers made in a single tournament game."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his first game with the Mets, Juan Soto struck out with two outs in the ninth inning, preventing the tying runs and concluding the game with a 3-1 victory for the Astros."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his debut game for the Mets, Juan Soto struck out with two outs in the ninth inning, missing the opportunity to tie the game. This resulted in a 3-1 win for the Astros."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking a notable moment after being involved in offseason trade discussions. His performance led to a curtain call from Cardinals fans, acknowledging the importance of the event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, earning a curtain call from Cardinals fans. This moment came after he was involved in offseason trade discussions, highlighting its significance."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging that it collaborated with the university to unfairly blame him, making him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the NCAA worked with the university to unjustly target him as a scapegoat."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NBA insiders are discussing key awards questions, focusing on the MVP competition between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are currently debating the MVP race, highlighting the competition between Nikola Jokic and Shai Gilgeous-Alexander."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, the NBA has experienced a record-breaking number of 3-point shot attempts. There is ongoing discussion about whether the league should take measures to limit the frequency of these shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This NBA season has seen a record number of 3-point shot attempts, sparking discussions about whether the league should implement rules to reduce these shots' frequency."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts are making predictions for the 2025 baseball season, including whether the Dodgers can win again and who might be named MVP."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts are predicting outcomes for the 2025 baseball season, focusing on the potential for the Dodgers to secure another victory and speculating on possible MVP candidates."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This message offers support for teams, regardless of their initial status as favorites or underdogs, for the year 2025, indicating a commitment to provide assistance to all teams aiming for success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In 2025, there will be support available for all teams striving for success, regardless of whether they are initially considered favorites or underdogs."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the Sweet 16 player rankings, with discussions on who takes the top spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the Sweet 16 player rankings. The rankings have sparked conversations about who deserves the top position among these athletes."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team towards a championship title. Their performances have been pivotal in the team's success this season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron have been key players for Notre Dame's basketball team this season, significantly contributing to the team's pursuit of a championship title."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical role, made his own selections for the first round of an unspecified event, presumably related to sports. His choices reflect his perspective and expertise as a former general manager."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, a former general manager, made his selections for the first round of a hypothetical sports event, showcasing his expertise and perspective."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised widespread concern in college athletics about the potential for more athletes to be victims."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concern in college athletics, suggesting the possibility of additional athletes being victims."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in Europe's top football leagues are highlighted, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1. Each league's top goal scorer is recognized for their performance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top goal scorers in Europe's major football leagues—Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1—have been recognized for their outstanding performance in scoring the highest number of goals in their respective leagues."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona won against Osasuna 3-0, but coach Hansi Flick stated the victory came at a \"high price\" due to Dani Olmo's injury during the match, which was played on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona defeated Osasuna 3-0 on Thursday, but the win was overshadowed by an injury to Dani Olmo, as noted by coach Hansi Flick, who described the victory as coming at a \"high price.\""
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced on Thursday that four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, are under investigation for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match versus Atlético Madrid. This was announced on Thursday."
  },
  {
    "title": "Ronaldo to lead CONMEBOL anti-racism task force",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "CONMEBOL has appointed Ronaldo Nazario to head a new task force aimed at addressing racism and violence in South American soccer, as announced on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "CONMEBOL has named Ronaldo Nazario as the leader of a new task force focused on tackling racism and violence in South American soccer. This announcement was made on Thursday."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, unlike the situation a year ago, indicating no immediate changes are expected regarding his future with the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, Bayer Leverkusen's coach, currently does not have any offers from other clubs, suggesting his position with the team is stable for now. This marks a change from the situation a year ago, where his future was more uncertain."
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:41 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Qatar Sport Investment (QSI), which owns Paris Saint-Germain, is completing the acquisition of the Spanish football club Malaga, according to information confirmed to ESPN by a source."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is finalizing the purchase of the Spanish football club Malaga, as confirmed to ESPN by a source."
  },
  {
    "title": "Bompastor hails Chelsea's 'perfect night' in UWCL",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea manager Sonia Bompastor celebrated a significant victory at Stamford Bridge, where her team overturned a 2-0 deficit against Manchester City, securing a place in their third consecutive Champions League semifinal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea manager Sonia Bompastor led her team to a significant comeback victory at Stamford Bridge, overcoming a 2-0 deficit against Manchester City. This win secured Chelsea's place in their third consecutive Champions League semifinal."
  }
]