[
  {
    "title": "Golf champion Fuzzy Zoeller dies at age 74",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Thu, 27 Nov 2025 14:43:00 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "ESPN",
      "CBS Sports",
      "The Guardian",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "npr.org",
      "espn.com",
      "cbssports.com",
      "theguardian.com",
      "skysports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Two-time golf champion Fuzzy Zoeller has died at the age of 74. One of golf's most gregarious characters Zoeller's career was tainted by a racially insensitive joke he made about Tiger Woods.",
      "Fuzzy Zoeller, a two-time major champion and one of golf's most gregarious characters whose career was tainted by a racially insensitive joke about Tiger Woods, has died, according to a longtime colleague. He was 74.",
      "Zoeller was haunted by a racist joke he made about Tiger Woods in 1997",
      "Masters champion in 1979 and US Open winner in 1984 Post-career reputation marred by remarks about Woods Trump pays tribute to ‘remarkable person and player’ Fuzzy Zoeller, the two-time major champion whose genial public persona was overshadowed by a racially insensitive joke about Tiger Woods that",
      "Fuzzy Zoeller, a two-time major champion, has passed away aged 74.",
      "Fuzzy Zoeller, a two-time major champion and one of golf’s most gregarious characters whose career was tainted by a racially insensitive joke about Tiger Woods, has died, according to a longtime colleague. He was 74."
    ],
    "image_url": "",
    "titles": [
      "Fuzzy Zoeller, golf champion haunted by racist joke about Tiger Woods, dies at 74",
      "2-time major champion Fuzzy Zoeller dies at 74",
      "Fuzzy Zoeller, two-time major champion who tarnished his own legacy, dies at 74",
      "Fuzzy Zoeller, two-time major winner haunted by racist Tiger Woods joke, dies aged 74",
      "Fuzzy Zoeller: Two-time major champion dies at 74",
      "Fuzzy Zoeller, major winner once tied to racist joke, dies at 74"
    ],
    "url": "https://www.npr.org/2025/11/27/g-s1-99665/fuzzy-zoeller-obituary-golf-masters-tiger-woods",
    "alternate_urls": [
      "https://www.espn.com/golf/story/_/id/47120544/two-major-champion-golfer-fuzzy-zoeller-dies-74",
      "https://www.cbssports.com/golf/news/fuzzy-zoeller-dies-tiger-woods-racist-joke/",
      "https://www.theguardian.com/sport/2025/nov/27/fuzzy-zoeller-dies-74-tiger-woods-racist-remark-masters-us-open",
      "https://www.skysports.com/golf/news/12040/13476279/fuzzy-zoeller-two-time-major-golf-champion-dies-at-74"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/27/g-s1-99665/fuzzy-zoeller-obituary-golf-masters-tiger-woods",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.99,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.918,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fuzzy Zoeller, a two-time major golf champion who won the Masters in 1979 and the US Open in 1984, has died at the age of 74. Zoeller was known for his outgoing personality, but his career was later overshadowed by a racially insensitive joke he made about Tiger Woods in 1997. Tributes have been paid following his death.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the death of a notable figure in golf, but it doesn't provide much depth or insight beyond that. It does not provide actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Pope Leo XIV visits Turkey to meet leaders and talk about peace",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 16:49:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian",
      "CBC News",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "cbc.ca",
      "dw.com",
      "nytimes.com"
    ],
    "snippets": [
      "Pope Leo XIV hailed Turkiye as a bridge between cultures and religions, during his first visit since becoming pontiff.",
      "Pope Leo warns of conflicts endangering humanity on first overseas trip Reuters",
      "Leo welcomed by Recep Tayyip Erdoğan as he begins six-day itinerary that will also include visit to Lebanon A new world war is being fought “piecemeal” and is endangering the future of humanity, Pope Leo has warned, as he arrived in Turkey for his first foreign trip since becoming head of the Cathol",
      "Pope Leo lamented that the world was seeing an unusual number of bloody conflicts during his first trip outside Italy as Catholic leader on Thursday, and he warned that a third world war was being \"fought piecemeal\" with humanity's future at risk.",
      "The pontiff has arrived in Ankara, where he met Turkey's President Recep Tayyip Erdogan. After three days in Turkey, Pope Leo will head to Lebanon, where the trip is seen as an opportunity to promote unity.",
      "Pope Leo begins first overseas trip in Turkey - as it happened Reuters",
      "The pope started his six-day trip, which will also include a visit to Lebanon."
    ],
    "image_url": "",
    "titles": [
      "Pope Leo warns ‘future of humanity is at stake’ during Turkiye visit",
      "Pope Leo warns of conflicts endangering humanity on first overseas trip - Reuters",
      "Pope Leo warns of risk from ‘piecemeal’ world war in first overseas trip",
      "Pope Leo warns of conflicts endangering humanity on 1st overseas trip",
      "Pope Leo XIV begins first trip abroad to Turkey, Lebanon",
      "Pope Leo begins first overseas trip in Turkey - as it happened - Reuters",
      "Pope Leo Visits Turkey on His First Trip as Pontiff"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/27/pope-leo-warns-future-of-humanity-is-at-stake-during-turkiye-visit?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxObWpVcnc0YklKX1JVZXNXaHZjUzJMbGo0TXpBQXV1cnV3Tm1WbDNhVEw0Q3ptX1hBS2NVUEtJN2dlRlEyRl9LdmE5VldEeE93OXhDSm1JYjA1RTRYbmFjakNJVXRRbjdDYlhhNTcxZmxaUFZOVlpmWi1JUlE5RkNmLUJPTHdCVjJlejV0UXQxTmRab0tDakp6ZGhqN0pDMTEzeDgxVUxvU0RCVmZCbElGRnZpUQ?oc=5",
      "https://www.theguardian.com/world/2025/nov/27/pope-leo-to-visit-turkey-and-lebanon-on-first-overseas-trip-as-pontiff",
      "https://www.cbc.ca/news/world/turkey-pope-leo-visit-9.6994271?cmp=rss",
      "https://www.dw.com/en/pope-leo-xiv-begins-first-trip-abroad-to-turkey-lebanon/a-74915414?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPWUVWSDN2M25IZXFpQWxFUEpqU2Y3MkthUVhzdzcwMTBQZjJLX2g3eVo4aEVReDZzbjM3dGg5d3R3SXFscTJYVWtVRnJVM1lFSFBYSnlsNEhtUDdMVV8zWmNidjMxVWZDdGRpZ2ozbW1EMERhNTFtWFBHQ3MzR1hIOFpxVXFFN0p0aGM5cU1UNC0wZHdvWF9ERm1RcExFMFlSSEJNMXBxdHc?oc=5",
      "https://www.nytimes.com/2025/11/27/world/europe/pope-leo-trip-pictures.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/27/pope-leo-warns-future-of-humanity-is-at-stake-during-turkiye-visit?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.901,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Pope Leo XIV has arrived in Ankara, Turkey, for his first overseas trip as leader of the Catholic Church. He will meet with President Recep Tayyip Erdogan and other political and religious leaders during a six-day visit aimed at promoting peace and unity. After three days in Turkey, the Pope will continue his trip to Lebanon. The visit is closely watched by international media.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the Pope's visit to Turkey and his diplomatic efforts. It gives a clear understanding of the Pope's mission and the political and religious context of his visit. However, it does not report on specific solutions or progress.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "France offers 10 month military service for young adults",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-27T18:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "The Guardian",
      "New York Times",
      "Bloomberg"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "France is paving the way for the return of voluntary military service for 18- and 19-year-olds. This decision follows an uproar over a general's warning that France must be prepared to \"lose its children.\"",
      "France's Macron unveils voluntary military service amid 'accelerating threats' Reuters",
      "Macron says plan to introduce 10 months’ service among 18- and 19-year-olds will help France respond to ‘accelerating threats’ Europe live – latest updates France is to introduce voluntary military service of 10 months aimed mainly at young people aged 18 and 19, as concern grows in Europe about the",
      "The effort, aimed at young people, came after an army chief angered many by saying the country must accept the possible loss of “our children” in a future war.",
      "France Introduces Voluntary Army Service Amid Russia Concerns Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "France plans to revive voluntary military service in 2026",
      "France's Macron unveils voluntary military service amid 'accelerating threats' - Reuters",
      "France to introduce voluntary military service amid threat from Russia",
      "France Creates Voluntary Military Service as Europe Faces Russian Threat",
      "France Introduces Voluntary Army Service Amid Russia Concerns - Bloomberg.com"
    ],
    "url": "https://www.dw.com/en/france-plans-to-revive-voluntary-military-service-in-2026/a-74931355?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNMVlaNkQxLS1WQ09hdHV2NlFkbXVLU1lUcXM4YklGTjdjRk9YWEhIWUV2bTYzV2RPTm0xZ3RTZWZKSzV5a3VZaTREaV8yMVp0XzdoTlUzbXByUjRDYThOelpWcXRhYk5wbEhIbXpHWEVhXzBEUmVWREVLWGVtY2NHZjk5X2p0QUtCOTNDTXJtc2hGTTFLVzBPX0NuUTFuRW1OdDNYZDBXUUkwV0pLLWNPcElONHZZb3Z0ai1vRUZkN1dXcWQ5anltQ0EyVk9NWDNncUdoanFlSDB6bFU?oc=5",
      "https://www.theguardian.com/world/2025/nov/27/france-voluntary-military-service-russia-threat-macron-plan",
      "https://www.nytimes.com/2025/11/27/world/europe/france-military-service.html",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNWFhFTE5QUWZrVWlSMk9WVEx5UTVkVHl2eUxZUF9vQ0ZjaVNRX1RKMGZVTWc5dWRZN0NEWnd2OGNMWVM5bklqWWhQd3hmYWgwYmxXWWM3VnBCcExvbjZ3N3hNQXEyaGF3dnRNN3JwTnZ3SUNMcU16U2xrcUFrdUJTYTFkdzVqUlZzb21yT2taTFQyeDZYZGtVajdEWmFrNHVfMDRGTTNrQWtLdGZKdWRON2h3?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/france-plans-to-revive-voluntary-military-service-in-2026/a-74931355?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.971,
      "consensus": 0.975,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.898,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "France has announced the introduction of a voluntary 10-month military service program for 18- and 19-year-olds. The move comes amid growing security concerns in Europe and follows public debate sparked by a general's warning about potential future conflicts. The program is intended to strengthen national preparedness but will not be mandatory.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is constructive as it informs about a new policy and its intended purpose. It gives readers an insight into the government's response to security concerns, which can help them understand the current political climate in France and Europe. However, it lacks details on how the program will be implemented and its potential impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Fire in Hong Kong buildings kills 85, many still missing",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 13:58:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Globe and Mail",
      "Deutsche Welle",
      "Reuters",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "dw.com",
      "washingtonpost.com",
      "theguardian.com"
    ],
    "snippets": [
      "Death toll rises to 85 as rescuers try to reach people trapped in upper apartments of high rises.",
      "Video: Hong Kong fire death toll continues to rise, hundreds still missing The Globe and Mail",
      "Authorities are still searching for survivors after firefighters brought a blaze that has killed 83 people under control. Three people have been arrested on suspicion of manslaughter. Follow DW for more.",
      "Hong Kong police arrest construction firm bosses over fire; death toll hits 83 with 300 missing Reuters",
      "Hong Kong Chief Executive John Lee ordered inspections of all Hong Kong public housing undergoing significant renovations in light of the devastating fires.",
      "Fire officials say operation to extinguish inferno is nearly complete, saying they have had calls from 25 people they are yet to reach A visual guide to the fire The death toll has risen again to 44, fire officials say. Officials said they are still having difficulties proceeding into the upper floo",
      "Want to get this in your inbox every weekday? Sign up for the Morning Mail here , and finish your day with our Afternoon Update newsletter Morning everyone. A government body aimed at increasing food security has been shot down by nutrition experts who say the scheme will only increase the amount of"
    ],
    "image_url": "",
    "titles": [
      "Hong Kong fire that killed at least 85 ‘under control’ but hundreds missing",
      "Video: Hong Kong fire death toll continues to rise, hundreds still missing - The Globe and Mail",
      "Hong Kong fire death toll rises to 83, another 250 missing",
      "Hong Kong police arrest construction firm bosses over fire; death toll hits 83 with 300 missing - Reuters",
      "Death toll in Hong Kong high-rise fire grows to 83",
      "Hong Kong fire: death toll rises to 83 as rescue crews search for survivors in still-burning towers – as it happened",
      "Australians’ diet ‘to worsen’, Hong Kong fire death toll rises, the shocking legacy of face transplants"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/hong-kong-fire-that-killed-dozens-under-control-hundreds-still-missing?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQY2dkRENFQ0s4VFB3VThKemlLYnhicmpDTXVFMHdnbl9pWnFNLW84YjNuQTRHTWVqbUtXZm5yTi1kVzh1NElmUk0xVzV5OWRvWl94VHRvdWxZbldZakxPRjd3RGZrRzZzelJLa0lCaGE3WjJDc0J3RDB1MnNVQm1hc3VSWTNQRE1yc2t5eFNsMHpRYUhLdjFPdXdxeVBXbEQ3eWs2aENfaUpMTFRKa0pPZg?oc=5",
      "https://www.dw.com/en/hong-kong-fire-death-toll-rises-to-83-another-250-missing/live-74913913?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNcngyRG5pdHlqOTlzQU5hQmNBNFBaam4zNWZUVHBhQURSbXg4ZHE5bHpkX3otT2h0d3ZWYUh0aVZYdzRfWFJCTUpTQ1I3VFlUVzRIX0ZHWng0OHZndjBBMy1sTE9ucUhDVjlPLUVFb1hRMk5mZXNEbXdkNERwSmpIc2VRZlF1OXlvM21DTlRfb0dMRzdHOXRiV1dWUVZpMmQyNWxzcQ?oc=5",
      "https://www.washingtonpost.com/world/2025/11/27/hong-kong-apartment-fire-death-toll/",
      "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
      "https://www.theguardian.com/australia-news/2025/nov/28/morning-mail-friday-ntwnfb"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/hong-kong-fire-that-killed-dozens-under-control-hundreds-still-missing?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.879,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.881,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The death toll from a major fire in Hong Kong high-rise buildings has risen to 85, with hundreds still missing as rescue operations continue. Firefighters have brought the blaze under control but are still searching for survivors, especially in upper floors. Three construction company executives have been arrested on suspicion of manslaughter. Authorities have ordered inspections of all public housing undergoing renovations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a tragic event and its aftermath, providing the reader with a deeper understanding of the situation. It also mentions the arrest of construction company executives, pointing to possible accountability, and the order for inspections of public housing, which could be seen as an attempt to prevent similar incidents in the future.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Stephen Curry will miss at least one week with a leg injury",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 14:13:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Bleacher Report",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The Warriors anticipate Stephen Curry will miss around a week with a quad contusion, depending on how he responds to treatment, sources told ESPN's Shams Charania and Anthony Slater.",
      "Curry was injured during Wednesday night's loss to Houston",
      "What Is Stephen Curry's Timeline to Return to Warriors After Quad Injury vs. Rockets? Bleacher Report",
      "Warriors point guard Steph Curry is set to miss at least the next week after suffering a quad contusion against the Houston Rockets on Wednesday night, ESPN’s Shams Charania reported Thursday."
    ],
    "image_url": "",
    "titles": [
      "Sources: Warriors' Curry (quad) to miss week",
      "Warriors' Stephen Curry (quad) to miss about a week but avoids serious injury, per report",
      "What Is Stephen Curry's Timeline to Return to Warriors After Quad Injury vs. Rockets? - Bleacher Report",
      "Report: Warriors’ Steph Curry to miss about a week with quad contusion"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47120325/sources-warriors-curry-expected-miss-week-quad-contusion",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/stephen-curry-injury-update-warriors-quad-nba/",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxORk1KYWxoTFB3bG1lbzdlSDFnRk53b0hleFlRaGRWdDktTkp1bnZTWm9qczRfLVJQVi1NSVU1VHhwMnFfSENySWtyaHdWSzV2dktCY2NzYmVjZlBZWmRJcUlwN1Q3RVB3S3lfaTFSYlNHSGZBM0tuNFpzUW92NElCbGhCSDJOVjByd1JtcWZ4RUZuS2FIbWZLZ0RWX0NJT3dEYlpTV3BURUstWVk2dUFmNWExNHRkSnVtRmc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47120325/sources-warriors-curry-expected-miss-week-quad-contusion",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.98,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.87,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Golden State Warriors point guard Stephen Curry is expected to miss at least one week after suffering a quad contusion during Wednesday night's loss to the Houston Rockets. His return will depend on how he responds to treatment, according to team sources. Curry will be re-evaluated after a week to determine when he can return to play.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story is useful to readers, particularly fans of Stephen Curry or the Golden State Warriors, as it provides information about Curry's injury and expected recovery time. However, it does not provide any deeper understanding or insight into a broader issue, nor does it report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "National Guard soldiers hurt in shooting near White House",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 15:49:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Axios",
      "Reuters",
      "Associated Press",
      "Globe and Mail",
      "Deutsche Welle",
      "BBC",
      "ABC News",
      "Financial Times",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "news.google.com",
      "dw.com",
      "bbc.com",
      "abcnews.go.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Guard members Sarah Beckstrom and Andrew Wolfe were wounded in a shooting that the FBI is investigating as 'terrorism'.",
      "Two West Virginia National Guard members deployed to Washington, D.C., remain in critical condition after being shot while on patrol just blocks from the White House on Wednesday afternoon.",
      "National Guard members shot in D.C. identified but motive still unknown Axios",
      "What to know about shooting of 2 National Guard members in D.C. Axios",
      "What we know about Afghan national suspected of DC shooting Reuters",
      "What we do and don’t know about the shooting of 2 National Guard members in DC AP News",
      "Video: Two National Guard members shot in Washington The Globe and Mail",
      "US officials said they are conducting a terrorism investigation after two National Guard members were critically wounded. Investigators examine the background of the suspect, who worked with US forces in Afghanistan.",
      "The suspect had been recruited to Unit 03 of the Kandahar Strike Force, a former military commander told the BBC, coming to the US after the withdrawal.",
      "Rahmanullah Lakanwal, the Afghan man who allegedly shot two National Guard members in Washington, D.C., had served in one of Afghanistan's elite counterterrorism units, according to a nonprofit run by people who served in Afghanistan.",
      "Suspect in National Guard shooting near White House had helped CIA Axios",
      "Trump: National Guard shooting an \"act of terror\" by Afghan \"flown in by the Biden admin\" Axios",
      "National Guard shooting reopens debate over Biden-era program that rushed to resettle Afghans who had worked with the US during its 20-year war in Afghanistan.",
      "Two victims remain in critical condition with nationwide investigation into the gunman under way",
      "Rahmanullah Lakanwal, 29, worked with agency-backed military units during US war in Afghanistan Washington DC national guard shooting: what we know so far The suspected shooter of two national guard members in Washington DC on Wednesday worked with CIA-backed military units during the US war in Afgh",
      "US Plans to Charge Suspect in Guard Shooting With Terrorism Bloomberg.com",
      "One suspect is in custody, police said.",
      "FBI raids homes after two National Guard members shot near White House Reuters",
      "US stops processing Afghan immigration requests after attack near White House Reuters",
      "National Guard soldiers shot in 'targeted' attack near White House Reuters",
      "Two national guardsmen in critical condition after apparent targeted shooting near White House The Globe and Mail",
      "2 National Guard members shot in an ambush attack just blocks from the White House AP News",
      "Photos from the scene where 2 National Guard members were shot near the White House AP News"
    ],
    "image_url": "",
    "titles": [
      "National Guard members shot in Washington, DC, attack identified",
      "Here's what we know about the shooting of 2 National Guard members in D.C.",
      "National Guard members shot in D.C. identified but motive still unknown - Axios",
      "What to know about shooting of 2 National Guard members in D.C. - Axios",
      "What we know about Afghan national suspected of DC shooting - Reuters",
      "What we do and don’t know about the shooting of 2 National Guard members in DC - AP News",
      "Video: Two National Guard members shot in Washington - The Globe and Mail",
      "US treating National Guard shooting as terrorism case",
      "National Guard shooting suspect worked with CIA in Afghanistan",
      "National Guard shooting suspect served in CIA counterterrorism unit, group says",
      "Suspect in National Guard shooting near White House had helped CIA - Axios",
      "Trump: National Guard shooting an \"act of terror\" by Afghan \"flown in by the Biden admin\" - Axios",
      "National Guard shooting suspect was likely vetted by US before being granted asylum",
      "Suspect in US National Guard shooting worked with US military in Afghanistan",
      "Suspect in Washington DC national guard shooting had ties to CIA, agency confirms",
      "US Plans to Charge Suspect in Guard Shooting With Terrorism - Bloomberg.com",
      "WATCH:  2 National Guardsmen shot near White House, officials say",
      "FBI raids homes after two National Guard members shot near White House - Reuters",
      "US stops processing Afghan immigration requests after attack near White House - Reuters",
      "National Guard soldiers shot in 'targeted' attack near White House - Reuters",
      "Two national guardsmen in critical condition after apparent targeted shooting near White House - The Globe and Mail",
      "2 National Guard members shot in an ambush attack just blocks from the White House - AP News",
      "Photos from the scene where 2 National Guard members were shot near the White House - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/national-guard-members-shot-in-washington-dc-attack-identified?traffic_source=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/11/27/nx-s1-5622955/national-guard-shooting-washington-dc-updates",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE13bWJHdnNCS0RnV3JYM2s1c2Nnc3k4RWRoRUJMdlF0QkFxaW4zSnhEbC1UYXhaTUh6MkZIdUNGVHpMeU1ZQVRFVGJ4SGFvZkVMUUY2eVpzUTRSY21MM290YTdycVR4emNDRHlKRDQxc2xsdGo4dExybHU2MA?oc=5",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTFBjY2E3eFc0ZEpfQmZFQWd3VDdFeGxPeV9OZS1mWWlfRWJ4dU9lczNZd1kyWGtoRlQ4MkpaMk9UWGdBZm1HdGZodk40ekRWNzhYZzJfeTVDWGNDX214aWVoWWxseWk2VFVSdWRhbDRlRVVsaFd0SXVnREtyZw?oc=5",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNQTYzcGJxR0laM0pWd1ZVWnd5MDVBRHJiNVY4bUhjNHVtaEpoU1BRWnhqaUFHR1I3UG9PeDRRYUN2NExCNGRhN1pkLWtyM0VaZ2E5RmdGd0dCOTBrVWx6YktFYzhXbThIZWhuUkRwcmY5M3pFZHRlVFpCQTBrTHc0YXo3SVk2SlI1QTYxQV9jQ0ZqNUMteE83a09WV0xVWGs4RGI5QWVXaFhUOTZwUXRyWGFLZUlKNDVZY3NTUVIzdlM?oc=5",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNc0ViMFcxRThQbVBoZnJ3VEJRTVFKUjJhdmNEY0hwUWpoTGhBaGF3VHBXMkItOVhqQnRvaThYbEY4d0RpWlhlVFNEZWw2Wm5WSl9oaXZCWG5UaHBudUkzR3h4bXUtYk9jYUhHYWlaQmViN1I0RTdrNXB6TWlfVTJmT0phQ1NYS3VYeEdlbjJIMXNxU1pqWmtESWZvX3hkcmRNZkhwdg?oc=5",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxPM0FkcUVER2JsWWdJSThtSjM1YnpPdlVPLWZFQk96S1BBRk1ZMjluSVNJNjVpNUg1cDZaT2NPeVVESTMxbHpVcEdGbGdFX0l2XzY3U04tZ29xUHc5Tm50QnM5aHB2U01tem9GcW1VbUd5M2ZpdHpQSXk1STFLQ3lJYzRhUGZEQmlvNHJxenJ5eWlhejVI?oc=5",
      "https://www.dw.com/en/us-treating-national-guard-shooting-as-terrorism-case/a-74927977?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/cly0jez2dl4o?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/11/27/nx-s1-5623041/national-guard-shooting-suspect-cia-unit-afghanistan",
      "https://news.google.com/rss/articles/CBMif0FVX3lxTE5QeU5pYUZSS1JQNTgtMG16R3k1TkgybzBXVDk5WGVhcDBTVWZVRTVNd3pwanEwNVF5VjZIYXRlOVdYTXdISjFiZ2hUTmJ3eVVkQXFZX3ROakxpT1lpQU03RXBCMWlpR3loRmtHOVhlLXJMb0ZoSjFuQWF0eHJxOTg?oc=5",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxPcS1DYVFlQUFRa19ZZGdwUkJaVExVVXNkRVpKTlZlc2Yxa2hpbGxrNDdSck9qM2NUOHpfWUhXVms3andvLTRsNnlvRUxLcTl5UzlLbWxvcWxYWWtHYTd6SmdzU2FybV9VQUY0akp1VXRaYlAwTlZyMXlFbjU4Z19hSV81WUU3SURCRDQ3ajdwZDVtaEU?oc=5",
      "https://abcnews.go.com/Politics/national-guard-shooting-suspect-vetted-us-granted-asylum/story?id=127930034",
      "https://www.ft.com/content/cd4beb68-eb34-4747-ba97-e2874fd51d4e",
      "https://www.theguardian.com/us-news/2025/nov/27/washington-dc-national-guard-shooting-suspect",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPRV9wTGwxUE9wV2F1MWxyS2pyX1pydHZ6WVB4ZTBkQ2lmbFdEOHZ3ZHZMYTFkVnFMeWVOVmJKU29tZlZYSmZzQU9lUTE4bDR0azZmVG1qVGVka3A5TDI3SGJtRHpKT1Exem1mU25MSU1BZkEzam4yYjRwa2N4ZFRnM3hudTYxc3MzY1JreE9vSGEzb2xTMk4zNjZQYXYzNy1hdXVSVlZnLVZoM3NlWXJj?oc=5",
      "https://abcnews.go.com/US/video/2-national-guardsmen-shot-white-house-officials-127909311",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOV2xBMEM0X3NfSmJnQnlld3dHR3hOVkxJaHBVOXVteHlMdEFtQjRWUjdSQ3NYaTZHMDhkdkpVaUVGMlA3X3lpa3hST1BKOUttT0dRVVltTG0zdFhwNkFxcGV3SmhuUl83TTAzQ1RhUVhKLUU0ZE1JT2sxWkJ2WFlsTnFLNm4xM095ZzFaUWhPZ0RRczNvT19WTVdZdGRzZjRGM0drSTM2ekkxOWxseWswRlFYYUs?oc=5",
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxQWXRobDdMV0tySnc5QW52R3pXYnlZTEItdzF2MmJ1Z2lVcTIyNW1FNVpqVXB4UHJ0QWVxRV9WOEhjX29yR1BYWkVsSzk5Uk1GeUQ2T1JZV1VCN3E0VWpJSEtEaVVlNFR4TTlUaUk1RlBheGZWU0tzaXJwN3hscXR1d19VVHZwa2NBR2k5UkRKVDFNbk1hOWFXNVN4NFoxTVpWMkk5eGZBLWdqcEJpYWZtVl9NSWtrbk5TcHJpeDZHbw?oc=5",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNT2VEM2hjNGtmTndKZmtrUUFUeTJxZTJtenBId1puM3J1R1E2RlN5cE9mZXdfY1FGQkhJeHJZUlNiUWdOYlp1OF9NMFhMUmx2dWc2SmZoX1hxd2IyMmVlc0stVXlyQzlEZ1d4R3ZOMlMycDc4UXhCVlBFWm5sazY4TU0xUkJkcVRwb1VmMnppTXIxSkJHdXhXTlk4WlRZRWs1S1lEWQ?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxPNGVjRFBmeEVjckkzd0VfdHQ5VVBnWFNjQ0trYjF1YTlvc0VzMGU0SXJVSktfMUdZUFM5d1kyUEJITjlpSmJtVUVVSGxacVNsZlFFYU83cFdxR3k5enBGbEE1MVl1MXRUZVpFZGVKNW94ZlJlU0NHVFdiWGcweGJsRl9lTlpCMVhtZWZxdm4xUDYzWGEtd1VNWWgzVk4xVWlh?oc=5",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMktMa2xlQnh5YWU5aEVCVnBJTVBhTUowcm0tQ2E1Zk44WDF2QVNxellIY2Y0amxrM0E3LVlOTUVHSnVidC1FVzM4cmg2dU1GTExnZU9LaE4zR1NSV1c2YmNma2hyRUk2enZRektfdmhSZUdMWEtWZmtSLV95OFowdWs2bnpVV0tMa1E3XzE0Zw?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxQcEgxREN5NkJQcjN1dEtqRGN5MEpSU0Y0bDJJUGNFZWZkU0tmeENDZGJIQzhDVkZWbkllZXcyaVBwUTRZbnZaaGtybHBhdjRTRDQwdXRKaEgxRk82UDhwRXlidFgwTUhGUDZPNWZ3THFoVnNvYmgtWEZlRlV0bUhCZkkyclJGdDh1ZFE3eXM0bmc3Y3hiOW5XN3E2YnlNWnds?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/national-guard-members-shot-in-washington-dc-attack-identified?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.913,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.863,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A shooting near the White House resulted in injuries to National Guard soldiers, according to police. One suspect has been taken into custody. In response, former President Trump has called for an additional 500 National Guard members to be deployed in Washington, D.C. Authorities describe the incident as a \"targeted\" attack. The situation is under investigation.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an incident but does not provide any actionable insights or deeper understanding. It does not report on solutions, improvements, or attempts to solve problems, and it does not increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Putin says there is no peace deal yet to end the war in Ukraine",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 15:19:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "Bloomberg",
      "CNBC"
    ],
    "domains": [
      "aljazeera.com",
      "ft.com",
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Russian leader says Ukraine must cede key territory and the world must recognise Russia’s gains.",
      "Russian president insists there is no draft treaty but says 28-point outline could form basis for further talks",
      "Putin Says No Final Peace Plan Draft Yet But Open to Talks Bloomberg.com",
      "Russian President Vladimir Putin said the outlines of a draft peace plan agreed by the U.S. and Ukraine could become the basis of a deal to end the war."
    ],
    "image_url": "",
    "titles": [
      "Putin says US-backed peace plan as framework is OK ‘in general’",
      "Putin plays down Ukraine peace plan as US envoys head to Moscow",
      "Putin Says No Final Peace Plan Draft Yet But Open to Talks - Bloomberg.com",
      "Putin breaks his silence on Ukraine peace plan, says Moscow ready for 'serious' talks"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/putin-says-us-backed-peace-plan-as-framework-is-ok-in?traffic_source=rss",
    "alternate_urls": [
      "https://www.ft.com/content/39cc1303-a3ec-4452-b32e-a678d09baefd",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOVk1DbHpYR0J3UlEtbC1RMzdYMkYwTXFaZ21DOER2R1E1cEZ5SXB0RmJRQTc1dkVvX0ZzNm5xMXFwbE44VzNrQzd2THNTclN3dTlOUEpJLUFjYzJLT2NhNi1ydkI2ZXZ3c3dCOWxObnd0LVZyTjk0UGl6b1l5TE52M0t1LWd6bmZCeE5XLXU2SFBvc1g1cVlSMGx3M2RrVVZSbU41QlpiUDR5bDhTMzRwdEtYX3JtQQ?oc=5",
      "https://www.cnbc.com/2025/11/27/putin-moscow-ready-for-serious-talks-on-ukraine-peace-plan.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/putin-says-us-backed-peace-plan-as-framework-is-ok-in?traffic_source=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.904,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russian President Vladimir Putin stated that there is currently no finalized peace plan to end the war in Ukraine but mentioned a 28-point outline that could serve as a basis for further negotiations. He insisted that Ukraine must cede key territories and that international recognition of Russia’s territorial gains is required. Talks remain open, but no agreement has been reached.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing conflict in Ukraine and Russia's position on it. However, it lacks depth as it does not provide much context about the conflict or the proposed peace deal, and does not offer insights into the potential impacts of the situation.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Venezuela stops six airlines from flying to its country",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 18:57:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Airlines including Iberia and TAP had paused flights to Venezuela after warnings about 'heightened military activity'.",
      "Venezuela revokes flight rights for six airlines as tensions with US escalate Reuters",
      "Carriers accused of joining ‘actions of state terrorism promoted by US’ after they suspended flights to Venezuela Venezuela has banned six international airlines, accusing them of “state terrorism” after the carriers suspended flights to the country following a warning from the US Federal Aviation A"
    ],
    "image_url": "",
    "titles": [
      "Venezuela suspends flight rights for six foreign airlines amid US tensions",
      "Venezuela revokes flight rights for six airlines as tensions with US escalate - Reuters",
      "Venezuela bans six international airlines as tensions with US escalate"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/venezuela-suspends-flight-rights-for-six-foreign-airlines-amid-us-tensions?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNb1RsSm9aQ19BaUhUQlNkM0lILUNBVWNSWF9KTmlLaFJuaVJGd1ZmcVNGTktFa0pQNWR1eU9IRUFlYTVRWDJ2OEwxS3F0QmdGSDlCMkpEMTFEcDQwXzlOZFVDT1BjdG54Qm11Zm5QeFJLR0J0QVZmVTM5UWxvYzVWOWtObERIQ2RPNG16dDZaTVRMcU93Z1pwdEFJaE9vblRPZDVzZ01BY18wbU1WMzBsdzdWLUw4d1VmX09qS2pFci0?oc=5",
      "https://www.theguardian.com/world/2025/nov/27/venezuela-bans-six-leading-airlines-as-tensions-with-us-escalate"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/venezuela-suspends-flight-rights-for-six-foreign-airlines-amid-us-tensions?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Venezuela has revoked the flight rights of six international airlines, including Iberia and TAP, after they suspended flights to the country due to warnings from the US about increased military activity. Venezuelan authorities accused the airlines of participating in \"state terrorism\" promoted by the US. The ban is part of rising tensions between Venezuela and the US. The affected airlines have halted their operations to Venezuela.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the current situation between Venezuela and the US, as well as the impact on international airlines. It increases clarity around the current tensions and the repercussions of these tensions. However, it doesn't report on any solutions or attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "JPMorgan will build a new main office in London",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 15:10:05 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "JPMorgan to build multi-billion pound tower in London's Canary Wharf Reuters",
      "Decision is boost for district and comes as boss Jamie Dimon praises UK chancellor Rachel Reeves",
      "JPMorgan to Build New London Headquarters in Canary Wharf Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "JPMorgan to build multi-billion pound tower in London's Canary Wharf - Reuters",
      "JPMorgan to build new Canary Wharf office tower",
      "JPMorgan to Build New London Headquarters in Canary Wharf - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQS0ZNdE1QZnlVaE1mWXlYWXAyRVFfUGluQ2NnZlZ3b0p0RU94U2lfdzdRRm4xWDZBY0FaOEJURzBBZWE2NGx5Q1Y1QklLb0lfbFMtYWJRZFc0MG96N3A4SXprZS12NEZsem50dkgyQUNEUFV3NllBbG9kOHV5WjZkbTB5OFFhYlVZNXN4Ym5rcDJGTFc3X1VuYmFRSQ?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/11358be2-1fd7-4cbc-a584-948c79576b02",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNOU9rZnl3NUJtZkJPTFZDUFF2Y2UyZk1oaGYzMHA2c1d1TDZlejhldDhIUEM2eUdGVnA3Z0RVem45NWl6dWRYUi1aZlpzSmZfQzlwUThBSVlkTGNqVWZvcEV1Z011WjhPQThFSWZDMzVZdnZIZkRSRXNpZE1XZGtBR3N3RzVlVmE2ZVBSTFJ4S1pUMUxFaGV6eVR1UVhES3h4MTcyeUc3aE9sNEZoU3B1TWpSOA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQS0ZNdE1QZnlVaE1mWXlYWXAyRVFfUGluQ2NnZlZ3b0p0RU94U2lfdzdRRm4xWDZBY0FaOEJURzBBZWE2NGx5Q1Y1QklLb0lfbFMtYWJRZFc0MG96N3A4SXprZS12NEZsem50dkgyQUNEUFV3NllBbG9kOHV5WjZkbTB5OFFhYlVZNXN4Ym5rcDJGTFc3X1VuYmFRSQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.901,
      "consensus": 0.769,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "JPMorgan has announced plans to build a new UK headquarters in London’s Canary Wharf. The decision is seen as a positive development for the district. JPMorgan CEO Jamie Dimon praised UK Chancellor Rachel Reeves in connection with the announcement. The move highlights the bank’s continued investment in London.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is quite constructive. It provides useful information about JPMorgan's investment in London, which could be useful for readers interested in the financial industry. It also reports on a positive development for the Canary Wharf district. However, it could provide more context or insight to be fully constructive.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Macys Thanksgiving Parade brings new balloons and big crowds to New",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 17:44:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CBC News",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "cbc.ca",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The 99th edition of the holiday tradition included new balloons representing characters like Buzz Lightyear and Pac-Man.",
      "The Macy's Thanksgiving Day Parade kicked off Thursday in New York City, with new balloons depicting Buzz Lightyear and Pac-Man taking to the skies and float favourites such as Tom Turkey gracing the streets.",
      "The 99th annual Macy’s Thanksgiving Day Parade, one of the largest in the world, dazzled crowds in Manhattan, New York, on Thursday. Thirty-two balloons, three giant balloons, 27 floats, four special units, 33 clown groups, 11 marching bands, performance groups, and music stars parade to welcome ‘Sa",
      "Macy’s Thanksgiving Day Parade kicks off in Manhattan AP News"
    ],
    "image_url": "",
    "titles": [
      "In the US, the Macy’s Thanksgiving Day Parade marches on despite wind gusts",
      "Macy's Thanksgiving Day Parade in photos",
      "Macy’s Annual Thanksgiving Day Parade 2025: in pictures",
      "Macy’s Thanksgiving Day Parade kicks off in Manhattan - AP News"
    ],
    "url": "https://www.aljazeera.com/gallery/2025/11/27/in-the-us-the-macys-thanksgiving-day-parade-marches-on-despite-high-winds?traffic_source=rss",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/macy-s-thanksgiving-day-parade-photo-scroller-9.6994434?cmp=rss",
      "https://www.theguardian.com/lifeandstyle/gallery/2025/nov/27/macys-annual-thanksgiving-day-parade-2025-in-pictures",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxNWHVDR2ZKWUo0cEp3U0RvQlFCSXdSNWQ2RVhqWFVoTHgwQ2NJS3FDZHhlTlJFaEVRUFR4NUFJSHJuZTBMeXMxS3dhYWVjZFUzTkYxWlF1Vjd0UWtNY2VTbU15WUFON0J4RFVxYUtndTIteEpLWjh6Rm5oLXFMdWJ2UnllbTJtczkwQmZyaG9UbVRQTTJvZ3dGSDc3OWxhUE5m?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/gallery/2025/11/27/in-the-us-the-macys-thanksgiving-day-parade-marches-on-despite-high-winds?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.951,
      "consensus": 0.908,
      "constructiveness": 0.054,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 99th Macy’s Thanksgiving Day Parade took place in New York City on Thursday, featuring new balloons of Buzz Lightyear and Pac-Man, along with traditional floats like Tom Turkey. The event included 32 balloons, 27 floats, multiple marching bands, clown groups, and performances, attracting large crowds in Manhattan. The parade proceeded as scheduled.",
    "constructiveness_score": 0.054,
    "constructiveness_reason": "semantic: pos_sim=0.22, neg_sim=0.00; semantic_boost=0.05; missing GPT constructiveness result",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Chiefs play Cowboys on Thanksgiving as NFL teams get ready for big",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 11:54:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "From Thanksgiving Thursday to \"Monday Night Football,\" it's a busy throwback slate in Week 13.",
      "Here's your weekly dose of John Breech's NFL picks",
      "Pete Prisco reveals all of his Week 13 picks, including the Bills over the Steelers in a crucial AFC game",
      "See what all of Kansas City's stars wore to AT&T Stadium ahead of the Chiefs' Week 13 matchup against the Dallas Cowboys on Thanksgiving Day.",
      "Chiefs vs. Cowboys predictions, expert picks, and odds for Thanksgiving Day on Thursday, November 27. Rashee Rice goes long.",
      "Will Taylor Swift be in attendance for the Chiefs vs. Cowboys on Thanksgiving in Dallas? Here's the latest."
    ],
    "image_url": "",
    "titles": [
      "Thanksgiving throwbacks from Lions, Cowboys top NFL Week 13 looks",
      "NFL Week 13 picks and score predictions: Cowboys stun Chiefs in Thanksgiving thriller, Ravens top Bengals",
      "Prisco's Week 13 NFL picks: Chiefs top Cowboys in high-scoring game; Ravens edge Bengals",
      "Chiefs stars arrive in style for Thanksgiving showdown vs. Cowboys",
      "Chiefs vs Cowboys Predictions, Picks & Best Bets for Thanksgiving Day",
      "Is Taylor Swift at the Chiefs game today? Latest updates for Thanksgiving game vs Cowboys"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47098691/nfl-2025-week-13-uniforms",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/nfl-week-13-picks-score-predictions-cowboys-stun-chiefs-packers-upset-lions-thanksgiving/",
      "https://www.cbssports.com/nfl/news/priscos-week-13-nfl-picks-packers-over-lions-chiefs-top-cowboys/",
      "https://sports.yahoo.com/articles/chiefs-stars-arrive-style-thanksgiving-194907568.html",
      "https://sports.yahoo.com/articles/chiefs-vs-cowboys-predictions-picks-194800604.html",
      "https://sports.yahoo.com/articles/taylor-swift-chiefs-game-today-193015580.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47098691/nfl-2025-week-13-uniforms",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.778,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 13 of the NFL features several notable matchups, including the Kansas City Chiefs facing the Dallas Cowboys on Thanksgiving Day, November 27, at AT&T Stadium. Experts have provided game predictions and picks, with attention on standout players like Rashee Rice. The Buffalo Bills are also highlighted in a key AFC game against the Steelers. Coverage includes pre-game events and player arrivals.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an upcoming NFL game, including some predictions and key players to watch. However, it does not provide deeper insights or understanding that could be useful for the reader beyond the immediate context of the game.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Trump says South Africa will not be invited to big world meeting",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 14:14:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "New York Times",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "US President Donald Trump reiterated unfounded claims of 'human rights abuses' of Afrikaners in South Africa.",
      "Germany says Trump should invite South Africa to G20 summit Reuters",
      "Trump says South Africa won't get 2026 G20 invite, South Africa calls it punitive Reuters",
      "The president did not attend this year’s annual gathering in South Africa, which has been a frequent target of his attacks.",
      "Trump Says He Won’t Invite South Africa to G-20 in Miami Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Can Trump ban South Africa from 2026 G20 summit, as he says he will?",
      "Germany says Trump should invite South Africa to G20 summit - Reuters",
      "Trump says South Africa won't get 2026 G20 invite, South Africa calls it punitive - Reuters",
      "Trump Says South Africa Is Not Invited to G20 Summit in U.S. in 2026",
      "Trump Says He Won’t Invite South Africa to G-20 in Miami - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/can-trump-ban-south-africa-from-2026-g20-summit-as-he-says-he-will?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQUDJEV2NaUER2b0tBaGVlNFZQb05fZ1NYRlRBYUJMdU4zVnB5eldOYTlZMGt1YlZ2NWtsa1BqUXY1WUVmNk1iOTc3N1FaRlotMWF0dmltNXRKWWY2QUVRMXVHaEphbTFQdzNSVEhCRldrT3lzSTVUbmZ0LTdRTHQ5N3NJVGhrbURVMGxMaVktdmZHOWdGUk81bWlyMnlOWWZTMHJENWJqS0o?oc=5",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYWlYSmtTUWhBbjlPNEZfSVBWSU1PbTVsaHMxMXhLWk9nVXFkWEZKR09hYUJQemk1VlIybnFpeFphOUQ4a2F2czlJUk9HSmphU1lGRXVpbzFxVHplQUVrd3NUaEI3QWlfMUxzVkNGZ1ZFZmN5WWZYY1pDbUo3WXh3TThpekQ3emMxcWx4cmVQcGJYZEdiQkJQN2llU1AwdGVZOTRSYXRKTnk?oc=5",
      "https://www.nytimes.com/2025/11/26/world/africa/trump-south-africa-g20.html",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQVzVqRXBSNUhtY2VMbEM5NkkyeFVqWDlvWWdrb285TlZ0dlp5WHRRb2FPWGt0V1lmcXladG1pTzJtV200VllRZi1QbGRGM3lxNDF1bmdDQnVBamY2ZHdlZklsRU5vdTkwM0RrZWQtX0N0WmFDT2RJMm1pcnJ1Wll6VGdfc091RVdBdDQwZjNjMVV5N2hqT0FpT2NPTm1uOTludVJuZG5fM2VtSzA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/can-trump-ban-south-africa-from-2026-g20-summit-as-he-says-he-will?traffic_source=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.884,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump has accused South Africa of committing human rights abuses against white Afrikaners. In response, he stated that he will not invite South Africa to the upcoming G-20 summit in Miami. The South African government has denied the allegations. The decision marks a diplomatic escalation between the two countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: accus); semantic: pos_sim=0.06, neg_sim=0.07",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Lions player Amon Ra St. Brown hurts ankle and leaves game early",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 18:57:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "St. Brown went down in the first quarter",
      "Amon-Ra St. Brown injured his ankle against the Packers in Week 13. We provide injury updates throughout the game.",
      "The Detroit Lions have lost one of their most important offensive weapons to injury."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/27/34642ef6-fde4-4c15-9abd-8c66a562776d/brown.jpg",
    "titles": [
      "Lions' Amon-Ra St. Brown exits Thanksgiving matchup vs. Packers with ankle injury, questionable to return",
      "Amon-Ra St. Brown injury: Lions WR questionable to return with ankle injury",
      "Lions star WR Amon-Ra St. Brown injures ankle vs. Packers"
    ],
    "url": "https://www.cbssports.com/nfl/news/lions-amon-ra-st-brown-exits-thanksgiving-matchup-vs-packers-ankle-injury/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/amon-ra-st-brown-injury-184233603.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/lions-amon-ra-st-brown-exits-thanksgiving-matchup-vs-packers-ankle-injury/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Detroit Lions wide receiver Amon-Ra St. Brown injured his ankle in the first quarter of the Week 13 game against the Green Bay Packers. He left the game and did not return. The team is providing updates on his condition as they become available. His absence is a significant loss for the Lions' offense.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a player's injury during a game. It doesn't provide any in-depth analysis or context about the implications of the injury, the player's history, or how the team might adapt to his absence.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Fire in Hong Kong apartment kills 80 people and many are still missing",
    "domain": "business",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 22:47:32 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times",
      "Business Insider",
      "Associated Press",
      "Bloomberg"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com",
      "businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "Police arrested three people for alleged manslaughter in connection to the blaze at Wang Fuk Court in the Tai Po district. At least 279 remain missing.",
      "Firefighters were still trying to fully extinguish the blaze more than 24 hours after it engulfed several towers in the complex. Dozens of people were still missing.",
      "The blaze tore through an apartment complex, killing scores. Dozens more are believed to be missing in what remains of the buildings.",
      "More than 80 people were killed in the most lethal fire in Hong Kong in nearly 70 years. Firefighters have extinguished the blaze in half of the buildings.",
      "The apartment complex had eight towers with roughly 4,600 total residents.",
      "3 arrested in Hong Kong, as a high-rise fire leaves at least 44 dead and 279 reported missing AP News",
      "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested.",
      "Residents describe how a blaze in a high-rise building in Hong Kong quickly spread, taking many by surprise and trapping an unknown number of people in the burning buildings.",
      "China Taiping Insurance Falls on Deadly Hong Kong Fire Liability Bloomberg.com",
      "Watch Rescue Efforts Continue After Hong Kong Fire Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Fire engulfs high-rise buildings in Hong Kong, killing at least 44",
      "At Least 55 Dead in Hong Kong Apartment Fire",
      "Images From the Deadly High-Rise Fire in Hong Kong",
      "What to Know About the Deadly Fire at a Hong Kong Apartment Complex",
      "Deadly Hong Kong apartment fire kills dozens, with hundreds still missing. Here's the latest.",
      "3 arrested in Hong Kong, as a high-rise fire leaves at least 44 dead and 279 reported missing - AP News",
      "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
      "Hong Kong Residents Describe How Apartment Fire Quickly Spread",
      "China Taiping Insurance Falls on Deadly Hong Kong Fire Liability - Bloomberg.com",
      "Watch Rescue Efforts Continue After Hong Kong Fire - Bloomberg.com"
    ],
    "url": "https://www.washingtonpost.com/world/2025/11/26/hong-kong-fire-tai-po/",
    "alternate_urls": [
      "https://www.nytimes.com/live/2025/11/27/world/hong-kong-fire",
      "https://www.nytimes.com/2025/11/27/world/asia/hongkong-fire-photos.html",
      "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
      "https://www.businessinsider.com/latest-wang-fuk-court-fire-hong-kong-update-death-toll-2025-11",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxOYjYtbmUwN0lJUDBDT3Y4QXJMWjEzb3pJZGNvbEZ4MmtiZ3UwYTloeEVoblFsYzVmMjdWd3VhWW4zMGtndHNwRm1OUm9FZG1OSHk1TWozeUZubmxHeVJyQmdvaW9DWDQxV09wTlFiU2ZYbUszTHN0WjFueTlFbUJCY0pTSDJoZ2lqd0gzQnVRbzFTazh0?oc=5",
      "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
      "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-apartments-fire-residents.html",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPZTRXSy0waG5hMXZFYzZEcjY5a2V2SS1lOGppTDJuck4zeWZhWjJMUWEwNTN2WU5scG9NWGdDRnNzTnI4aC1HNDVMVFB6R2d4N0lzVUxicEgyaVhCMWlDOHBnM1gxWXJfeHpqSEFTZm91dFBsZzV5bTgyZXI4UGZBakZRQ1lxV2hkLUkxTDZKNXB3b2ZxeGRIU1VzV3BwbWRMd1VMWC1zRzNieTJDb3YzR1lHV1V4dw?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZlgwLUo4YU1sWTllMnNGdEpHX0FDWEVWRzl2RXhKWURTRTB4UUs0TE1oQXFWbzAxWXZzclZKOVFBNGRjN2swUk5VNlZ1T3V5QjRCSzhMc2daX2FNUDdvc0h5Z0E4aFFiZDhYeUppOEQ1WU9BTkFOaWJIdEtzQnJHNUxpRng2eXN5UVdvUDJyazlBN1B6VVNCczAyTDVXaHlw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.washingtonpost.com/world/2025/11/26/hong-kong-fire-tai-po/",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.64,
      "consensus": 0.975,
      "constructiveness": 0.072,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fire at the Wang Fuk Court apartment complex in Hong Kong’s Tai Po district killed at least 80 people, with 279 still missing. The blaze, the city’s deadliest in nearly 70 years, engulfed several of the complex’s eight towers, which house about 4,600 residents. Firefighters have extinguished half the buildings, and rescue efforts continue. Police arrested three people for alleged manslaughter, citing concerns over building materials not meeting fire safety standards.",
    "constructiveness_score": 0.072,
    "constructiveness_reason": "keywords (1): effort; semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Afghan man accused of shooting two soldiers in Washington, D.C.",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Thu, 27 Nov 2025 14:45:23 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "The Afghan man suspected of shooting two National Guard members entered the U.S. under the program in 2021. Here's a look at why it was set up and how those who entered the U.S. were vetted.",
      "What is Operation Allies Welcome, the program linked to the D.C. shooting suspect? Axios"
    ],
    "image_url": "",
    "titles": [
      "What was 'Operation Allies Welcome,' which allowed some Afghans entry into the U.S.?",
      "What is Operation Allies Welcome, the program linked to the D.C. shooting suspect? - Axios"
    ],
    "url": "https://www.npr.org/2025/11/27/nx-s1-5622991/afghan-refugee-program-national-guard-shooting-suspect",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxOTldnY2FhV24wa3lHenl0bExzZjl4ajRqVUpRR3JsQXFJbWJ6NUUyNUIwRGxOV2VWNmpiTHFGa3Fka09ldWNWaDU4cnl2TzdSQl9KYjNCSmxQNmZzR2t5ZFdKZXAzZ0xwc1pBY2o3LURHd1pyZ3JBWlh5QnlRVE9aMUFYNA?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/27/nx-s1-5622991/afghan-refugee-program-national-guard-shooting-suspect",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Afghan man suspected of shooting two National Guard members in Washington, D.C., entered the U.S. in 2021 through Operation Allies Welcome. This program was established to resettle Afghans who assisted U.S. forces after the U.S. withdrawal from Afghanistan. Individuals admitted under the program underwent security and background checks before entering the country. The investigation into the shooting is ongoing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Operation Allies Welcome program and the security measures it involves. However, it does not report on solutions or improvements and does not significantly increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Rory McIlroy says money is causing problems in pro golf",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 14:13:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Rory McIlroy doubts the fracture in golf will be repaired, as the \"irrational\" spending of the LIV series has created such a gulf in the sport.",
      "Rory McIlroy doubts the fracture in golf will be repaired as the \"irrational\" spending of the LIV series has created such a gulf in the sport."
    ],
    "image_url": "",
    "titles": [
      "McIlroy: Tour merger with 'irrational' LIV unlikely",
      "McIlroy doubts rift in golf will be fixed due to 'irrational' LIV spending"
    ],
    "url": "https://www.espn.com/golf/story/_/id/47119158/rory-mcilroy-pga-tour-irrational-liv-golf-unlikely",
    "alternate_urls": [
      "https://www.skysports.com/golf/news/12040/13476149/rory-mcilroy-world-no-2-doubts-rift-in-golf-will-be-fixed-after-irrational-spending-from-liv"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/golf/story/_/id/47119158/rory-mcilroy-pga-tour-irrational-liv-golf-unlikely",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rory McIlroy has expressed doubt that the divide in professional golf can be resolved, citing the \"irrational\" spending by the LIV Golf series as a major factor. He believes this financial disparity has created a significant and possibly irreparable gap within the sport. The situation remains unresolved.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides an insight into the financial disparities in professional golf, based on the views of a prominent player. It increases awareness about a systemic issue within the sport, but it doesn't explore potential solutions or delve into the specific impacts of this disparity.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Guinea Bissau soldiers take control and choose new leader for one year",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 17:45:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Military takeover follows others in the region in recent years.",
      "The opposition has accused the president of putting a general in charge of the government so that he could stay in power.",
      "Guinea-Bissau soldiers announce general as junta leader, cementing coup days after election AP News",
      "General Horta Inta-A is named the head of a one-year transitional government after President Embalo was detained."
    ],
    "image_url": "",
    "titles": [
      "What was behind the coup in Guinea-Bissau days after the election?",
      "What to Know About the Coup in Guinea-Bissau",
      "Guinea-Bissau soldiers announce general as junta leader, cementing coup days after election - AP News",
      "Guinea-Bissau coup: What happened, why it matters, what happens next?"
    ],
    "url": "https://www.aljazeera.com/video/inside-story/2025/11/27/what-was-behind-the-coup-in-guinea-bissau-days-after-the-election?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/27/world/africa/guinea-bissau-coup.html",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxOeGo5VnRGVzJFZDlOSE1CU1RCelNwdHU4N29fTUxGME9ZSjBYUndpb2R2ajMxcDUwb2Y4U2ZkRGI0MjV3anFUMXI2Ny1BWm1qeDlXRHRscVltdVFlaDV2ZU91TnRCRkhFVkRfMXZLdzZzZ0M4YnJrZEJLZHd5U3UwVk1lUVlfdEQ1TjEydEpkWU5hVVlTTjRHYkdCQUhwc2hBQ2o4dQ?oc=5",
      "https://www.aljazeera.com/news/2025/11/27/guinea-bissau-coup-what-happened-why-it-matters-what-happens-next?traffic_source=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/inside-story/2025/11/27/what-was-behind-the-coup-in-guinea-bissau-days-after-the-election?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.047,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Guinea-Bissau’s military has taken control following the detention of President Embalo. Soldiers have named General Horta Inta-A as the leader of a one-year transitional government. The opposition claims the president appointed the general to retain power. This coup follows similar recent events in the region. The country is now under military rule.",
    "constructiveness_score": 0.047,
    "constructiveness_reason": "semantic: pos_sim=0.19, neg_sim=0.00; semantic_boost=0.05; missing GPT constructiveness result",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Campbells fires executive after investigation into offensive remarks",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 15:14:27 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Campbell's fires executive for alleged racist rant, disparaging company Axios",
      "Senior figure allegedly referred to customers buying ‘highly processed food’ and denigrated Indian employees Business live – latest updates Campbell’s has dismissed an executive who allegedly referred to the soup company’s products as being made for “poor people” and denigrated its Indian employees.",
      "Campbell's fires executive who was recorded saying company's products are for 'poor people' AP News"
    ],
    "image_url": "",
    "titles": [
      "Campbell's fires executive for alleged racist rant, disparaging company - Axios",
      "Soup firm Campbell’s dismisses executive over alleged ‘poor people’ comments",
      "Campbell's fires executive who was recorded saying company's products are for 'poor people' - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBNV1RQRmE3TU5aQ3p1RXZoUm9WY0tmbG12WDY4akgyQndxbXNfY2JhNS14TmstM2YxdFU2bDRxSzhLVjRWR0xCM0I4SE5jbFZXTXN5X1BNTTVIWU5YSUFVVDQ1Sm9oZnE0aUdFbjVIc3lUUWoyUGxiczJUTnY?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/business/2025/nov/27/soup-firm-campbells-dismisses-executive-over-alleged-poor-people-comments",
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNVWhkX2F0VllOd0VuNWRmMVF4Q3VFVUVMekZ5RlZaS054Y3dLQ3NYME9nRlR0MzFtWjQycGJYczJFSU94THNXRHNJRWF6UFlFbDlPX0E4YWQydTg3eV90ejcxQ2tqbzcwbG5NYjVlMkZUdm9jY1N3TTg5cEdMazZrQlQyWWJXTjhDQkV4WDVONWJjTnBFc2d5ZFZkdzU1Z2RNVnJ6MlJMQXgyU2pyZ0lTT1M0RFd3SWRy?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBNV1RQRmE3TU5aQ3p1RXZoUm9WY0tmbG12WDY4akgyQndxbXNfY2JhNS14TmstM2YxdFU2bDRxSzhLVjRWR0xCM0I4SE5jbFZXTXN5X1BNTTVIWU5YSUFVVDQ1Sm9oZnE0aUdFbjVIc3lUUWoyUGxiczJUTnY?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.902,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Campbell’s has fired executive Martin Bally after an internal investigation into a recorded incident in which he allegedly made racist and disparaging remarks about the company. Campbell’s described Bally’s comments as “vulgar, offensive and false.” The company stated that such behavior does not reflect its values. Bally is no longer employed by Campbell’s.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Netflix stops working for a short time during new Stranger Things show",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 02:36:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "forbes.com"
    ],
    "snippets": [
      "Netflix recovers following brief outage during 'Stranger Things' final season premiere Reuters",
      "Users on social media earlier posted that they were experiencing issues, and DownDetector.com showed that reports spiked around 9 p.m. Eastern.",
      "Here's when Stranger Things Season 5 lands on Netflix in your timezone, plus what to expect from Volume 1."
    ],
    "image_url": "",
    "titles": [
      "Netflix recovers following brief outage during 'Stranger Things' final season premiere - Reuters",
      "Netflix suffers brief outage during 'Stranger Things' season-five debut",
      "When Does ‘Stranger Things’ Season 5, Volume 2 Come To Netflix?"
    ],
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOdDFjRXlza3pDR1F3WHA4aDN2OTZQV0hwXzRSU0hka1dDLXJmNFREZ0VJaTJ4c1p0SGpJUkhHLVZCTUNfa3J3a1kyTFU0WnZuRTVYd2tPdUtTT0hnaFZaWFd0MHJNZG41U2tNcW9KZ1lZV3JGZWFLUGZISjVYNy11WlBVYTdqUVIxNXBhOUNlUTA0YXJFeEh2aUExakpabDV0N0NkbnFNQ3VqOVdLX2c?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/26/netflix-outage-stranger-things.html",
      "https://www.forbes.com/sites/erikkain/2025/11/27/stranger-things-5-release-date-time-netflix-volume-1-episodes/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOdDFjRXlza3pDR1F3WHA4aDN2OTZQV0hwXzRSU0hka1dDLXJmNFREZ0VJaTJ4c1p0SGpJUkhHLVZCTUNfa3J3a1kyTFU0WnZuRTVYd2tPdUtTT0hnaFZaWFd0MHJNZG41U2tNcW9KZ1lZV3JGZWFLUGZISjVYNy11WlBVYTdqUVIxNXBhOUNlUTA0YXJFeEh2aUExakpabDV0N0NkbnFNQ3VqOVdLX2c?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.693,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Netflix experienced a brief outage around 9 p.m. Eastern during the premiere of the final season of \"Stranger Things,\" leaving many viewers unable to stream the new episodes. Reports of the issue spiked on DownDetector.com and were widely shared on social media. Service was restored shortly after, and Netflix is now operating normally.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is not very constructive. It provides basic awareness about a temporary issue with Netflix, but it doesn't offer any deeper understanding or actionable insights. It also doesn't report on solutions or improvements, as the issue was resolved quickly and the service is now operating normally.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Chinese sports brands may try to buy Puma",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 12:21:03 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "China's Anta Sports and Li Ning exploring bid for Puma, source says Reuters",
      "China's Anta Sports is among a number of firms looking to buy the German athletic brand, according to a media report.",
      "Puma Shares Surge as China’s Anta Sports Weighs Potential Bid Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "China's Anta Sports and Li Ning exploring bid for Puma, source says - Reuters",
      "Puma shares pop 18% after report China's Anta Sports is looking to buy the sportswear giant",
      "Puma Shares Surge as China’s Anta Sports Weighs Potential Bid - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOYy1teU1USFhxSkFGQk81TXNfMlJzTG9mSkt0UHNXLUZWUUpYVTJUTmVPRXBLZ1BZajYxU3dndFZKY0xKdWFNcng2Um9OREdsT29pWm44NW9oY1VoeFFCVmo4bDM4NlUwX1Jwd3kycXhxaGliTERIUzVfd3YwNWFWWS1ENVJNbnlaQ21IZFZ0Q3dXNW5UU2NDaGQ1c2NBSmlqSmRPbWRxMTV2anhu?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/27/puma-shares-chinas-anta-sports-is-reportedly-looking-to-buy-the-firm.html",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQMWVIQjZrQ3ZuallYeTJNZkhDXzVNa3ZDNTQ4V1lHYUpMVnBHUkVpR1dHVTBXZmk0VUszYTd6bDNQd3QxaV9DUmREeXdVQXBmXzMwdDBjYXRVU0I5dzV0VnZVb0tnOTMxMXk1UFpPLWhqR21oZW1IdU41UkNFWnJSSTdacFVuZlR0aXFNYWNvanhMbXA3VkpDMnRFZ3VsTmlLRnFJZDR2Smc3VWtmQnNHSUhB?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOYy1teU1USFhxSkFGQk81TXNfMlJzTG9mSkt0UHNXLUZWUUpYVTJUTmVPRXBLZ1BZajYxU3dndFZKY0xKdWFNcng2Um9OREdsT29pWm44NW9oY1VoeFFCVmo4bDM4NlUwX1Jwd3kycXhxaGliTERIUzVfd3YwNWFWWS1ENVJNbnlaQ21IZFZ0Q3dXNW5UU2NDaGQ1c2NBSmlqSmRPbWRxMTV2anhu?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.85,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China’s Anta Sports and Li Ning are reportedly considering a bid to acquire German sportswear company Puma, according to media sources. News of the potential interest has led to a rise in Puma’s share price. No formal offer has been made, and the companies involved have not commented publicly on the reports. The situation is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Florida teen is released from Israeli prison after nine months",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 16:17:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Advocates say the 16-year-old's health had been in decline since his arrest in February for allegedly throwing rocks.",
      "Israeli soldiers had taken Mohammed Ibrahim from his home in a night raid when he was only 15 years old A 16-year-old American citizen was freed on Thursday after spending nine months in an Israeli prison. Mohammed Ibrahim, a Palestinian-American teenager from Florida whose case was first exposed by"
    ],
    "image_url": "",
    "titles": [
      "US teen Mohammed Ibrahim released from Israeli prison after nine months",
      "Palestinian-American teenager held in Israeli prison freed after nine months"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/us-teen-mohammed-ibrahim-released-from-israeli-prison-after-nine-months?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/27/mohammed-ibrahim-palestine-israel"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/us-teen-mohammed-ibrahim-released-from-israeli-prison-after-nine-months?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mohammed Ibrahim, a 16-year-old Palestinian-American from Florida, was released from Israeli prison on Thursday after being held for nine months. He was arrested at age 15 during a night raid by Israeli soldiers in February for allegedly throwing rocks. Advocates reported that his health declined during his detention. Ibrahim is now free.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the situation of a specific individual and the broader issue of youth detention in conflict zones. However, it does not provide a deeper understanding of the systemic issues, nor does it report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Rocket attack shuts down gas field in northern Iraq",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 09:14:54 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Rocket attack shuts down Iraq's Khor Mor gas field, bringing power cuts Reuters",
      "The strike is the latest in a string of attacks on energy infrastructure in Iraq’s northern Kurdish region, which some regional authorities have privately blamed on Iran-affiliated militias."
    ],
    "image_url": "",
    "titles": [
      "Rocket attack shuts down Iraq's Khor Mor gas field, bringing power cuts - Reuters",
      "Rocket Attack on Iraqi Gas Field Cuts Power to Most of Kurdistan"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPQUdzWU1VeW1BSm1qNG9ZVHhtY1N4Tk5KUWY3OTdjMFlCMVFoRG9HRTRKcGdDX25jZ1RMejRRQ2dXbDdUVWdqUWtoR1pKUjZ3TGdQbXRrVkl4bF9kUmRNT2FOV3JXR29hTVhsQjV1SjZwVW1BdWJGaXA3VGxVWkJFMUVnNE9ZYWFnc2ZKZ0dUMGdrd2huc2hwZ0ptVl8yVVpoX1BKbTEtejQwY3k2R0FCZUNGdzQzb29aVG1YelQxcWt0UQ?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/27/world/middleeast/rocket-attack-iraq-power-kurdistan.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPQUdzWU1VeW1BSm1qNG9ZVHhtY1N4Tk5KUWY3OTdjMFlCMVFoRG9HRTRKcGdDX25jZ1RMejRRQ2dXbDdUVWdqUWtoR1pKUjZ3TGdQbXRrVkl4bF9kUmRNT2FOV3JXR29hTVhsQjV1SjZwVW1BdWJGaXA3VGxVWkJFMUVnNE9ZYWFnc2ZKZ0dUMGdrd2huc2hwZ0ptVl8yVVpoX1BKbTEtejQwY3k2R0FCZUNGdzQzb29aVG1YelQxcWt0UQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.796,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A rocket attack forced the closure of Iraq's Khor Mor gas field in the northern Kurdish region, resulting in power outages. This incident is part of a series of recent attacks targeting energy infrastructure in the area. Regional authorities have privately attributed these attacks to Iran-affiliated militias. The gas field remains shut down as of now.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the impact of the rocket attack on the energy infrastructure and the potential actors behind it. However, it does not report on solutions or improvements, nor does it provide a deeper understanding of the underlying causes or trends.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NFL Thanksgiving games set with Lions, Cowboys, Ravens playing",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 13:05:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Here's everything you need to know for Chiefs-Cowboys and Bengals-Ravens. Who will win the NFL's two remaining Thanksgiving games?",
      "The SportsLine Projection Model locked in its top anytime TD scorer picks for Lions vs. Packers, Cowboys vs. Chiefs and Ravens vs. Bengals on Thanksgiving Day"
    ],
    "image_url": "",
    "titles": [
      "Two more Thanksgiving NFL games: We have picks, predictions, storylines and more",
      "Thanksgiving NFL anytime touchdown scorer picks, predictions, betting odds: Pick Amon-Ra St. Brown on Thursday"
    ],
    "url": "https://www.espn.com/nfl/story/_/page/viewersguide47095843/nfl-thanksgiving-picks-schedule-fantasy-football-odds-injuries-stats-2025",
    "alternate_urls": [
      "https://www.cbssports.com/betting/news/thanksgiving-nfl-anytime-touchdown-scorer-picks-predictions-betting-odds-pick-amon-ra-st-brown-thursday/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/page/viewersguide47095843/nfl-thanksgiving-picks-schedule-fantasy-football-odds-injuries-stats-2025",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL's Thanksgiving Day schedule features games between the Lions and Packers, Cowboys and Chiefs, and Ravens and Bengals. SportsLine has released predictions for top anytime touchdown scorers in each matchup. The games are set to take place as scheduled, with no results available yet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sammy Blais is coming back to play for the Montreal Canadiens",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 19:30:19 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The Canadiens have brought back this forward.",
      "Sammy Blais is headed back to the team he originally planned to spend the 2025-26 season with."
    ],
    "image_url": "",
    "titles": [
      "Canadiens Claim Forward Back Off Waivers From Maple Leafs",
      "Canadiens claim Sammy Blais off waivers from Maple Leafs"
    ],
    "url": "https://sports.yahoo.com/articles/canadiens-claim-forward-back-off-193019359.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/canadiens-claim-forward-back-off-193019359.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Montreal Canadiens have re-signed forward Sammy Blais. Blais is returning to the team he had previously planned to join for the 2025-26 season. The move marks his return to the Canadiens roster, though specific contract details were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.06, neg_sim=0.07",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Packers play Lions in first Thanksgiving football game today",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 19:34:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Today’s Thanksgiving football schedule features three games. The first of which features the Green Bay Packers vs Detroit Lions. Yet",
      "The NFL’s Thanksgiving slate gets rolling with a high-stakes divisional matchup as the hot Green Bay Packers visit the reigning NFC North champ Detroit Lions. Follow the action with Sportsnet’s live tracker starting at 1 p.m. ET / 10 a.m. PT."
    ],
    "image_url": "",
    "titles": [
      "Green Bay Packers TD vs Lions Leads to NFL Controversy",
      "NFL Live Tracker: Packers vs. Lions"
    ],
    "url": "https://sports.yahoo.com/articles/green-bay-packers-td-vs-193452343.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/green-bay-packers-td-vs-193452343.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL’s Thanksgiving schedule begins with the Green Bay Packers facing the Detroit Lions in a divisional matchup. The game starts at 1 p.m. ET / 10 a.m. PT. This is the first of three football games scheduled for Thanksgiving Day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US checks if Jefferies told enough about ties to failed car company",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 18:02:34 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "The FT said the SEC is looking into whether Jefferies gave investors enough information on their exposure to the failed auto business.",
      "Jefferies shares have tumbled since it disclosed its exposure to First Brands"
    ],
    "image_url": "",
    "titles": [
      "SEC investigates Jefferies over First Brands collapse, report says",
      "SEC probing Jefferies over First Brands disclosures"
    ],
    "url": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "alternate_urls": [
      "https://financialpost.com/news/sec-probing-jefferies-over-first-brands"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/11/27/sec-investigates-jefferies-over-first-brands-collapse-report-says.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Securities and Exchange Commission (SEC) is investigating whether Jefferies provided investors with sufficient information about its exposure to the failed auto business, First Brands. Jefferies' shares have declined following its disclosure of this exposure. The investigation is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: fail); semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Toronto Blue Jays sign pitcher Dylan Cease to a seven year contract",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 13:21:03 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "forbes.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Dylan Cease returns to the American League with the champion Blue Jays via free agency.",
      "The Blue Jays finally made the kind of top-of-the-market strike they’d attempted unsuccessfully the previous two off-seasons. Shi Davidi breaks down what Dylan Cease brings to the Blue Jays’ lineup.",
      "A trip around the majors sees the Blue Jays drop the first big free agent domino, by landing Dylan Cease, but what does that mean for Bo Bichette? Meanwhile Red Sox are eyeing a big middle of lineup bat, discussing Arenado’s future, and much more."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6928953f87357e2f4fe3679d/0x0.jpg?width=960",
    "titles": [
      "Blue Jays Bolster Rotation By Signing Free Agent Dylan Cease",
      "Blue Jays agree to seven-year, $210M deal with Dylan Cease",
      "Blue Jays land Dylan Cease, knocking down first big free agent domino"
    ],
    "url": "https://www.forbes.com/sites/danschlossberg/2025/11/27/blue-jays-bolster-rotation-by-signing-free-agent-dylan-cease/",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/danschlossberg/2025/11/27/blue-jays-bolster-rotation-by-signing-free-agent-dylan-cease/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have signed right-handed pitcher Dylan Cease to a seven-year, $210 million contract, according to multiple sources. This is the second-largest deal in franchise history. Cease, who made 32 starts last season with the San Diego Padres and posted a 4.55 ERA, is known for his high strikeout rates. The agreement marks a major move in Toronto’s off-season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Long droughts helped cause the fall of the Indus Valley Civilization",
    "domain": "science",
    "source_domain": "newscientist.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 16:00:27 +0000",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "newscientist.com",
      "phys.org"
    ],
    "snippets": [
      "Hotter temperatures and a series of droughts in what is now Pakistan and India fragmented one of the world’s major early civilisations, providing a \"warning shot\" for today",
      "Successive major droughts, each lasting longer than 85 years, were likely a key factor in the eventual fall of the Indus Valley Civilization, according to a paper published in Communications Earth & Environment. The findings may help explain why this major ancient civilization—a contemporary of anci"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/11/27135029/SEI_275893651.jpg",
    "titles": [
      "Warming and droughts led to collapse of the Indus Valley Civilisation",
      "Major droughts linked to ancient Indus Valley Civilization's collapse"
    ],
    "url": "https://www.newscientist.com/article/2506112-warming-and-droughts-led-to-collapse-of-the-indus-valley-civilisation/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
    "alternate_urls": [
      "https://phys.org/news/2025-11-major-droughts-linked-ancient-indus.html"
    ],
    "location_scope": "global",
    "link": "https://www.newscientist.com/article/2506112-warming-and-droughts-led-to-collapse-of-the-indus-valley-civilisation/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.083,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A new study published in Communications Earth & Environment finds that successive, prolonged droughts—each lasting over 85 years—contributed to the decline of the Indus Valley Civilization in present-day Pakistan and India. The research highlights climate change as a significant factor in the civilization’s fragmentation and eventual fall.",
    "constructiveness_score": 0.083,
    "constructiveness_reason": "keywords (1): research; semantic: pos_sim=0.19, neg_sim=0.05; semantic_boost=0.03",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Japan says Trump did not ask them to avoid upsetting China about",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 13:45:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Takaichi's suggestion earlier this month that Tokyo could intervene militarily if Taiwan is attacked enrages Beijing.",
      "Japan Denies Report That Trump Asked PM Not to Provoke China Over Taiwan Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Japan denies report Trump told PM Takaichi not to provoke China on Taiwan",
      "Japan Denies Report That Trump Asked PM Not to Provoke China Over Taiwan - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/japan-denies-report-trump-told-pm-takaichi-not-to-provoke-china-on-taiwan?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOQ0FTelhENlhqUjRHZHVNR2UxemhUVjEwUDM1VlBybEsybnVfNGxwb2NBUUhWUTlIb2xlZDJBaWNjZXozSU5RRkpHdlkxbGI1UDlwbVhFQTBzY3U5MjRkZ1BCa1l0aUp2TFJ3b2UtQ05ZMWJHUFBndXpFZ1hLNUlSTFZzWGtWTjlHZ29PcUNPUEhCaTZnUzBNX3dOYlA0WW9ER1RDbTR4cThvbGpDT0tGSV9JM296QQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/japan-denies-report-trump-told-pm-takaichi-not-to-provoke-china-on-taiwan?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Japan has denied reports that former U.S. President Donald Trump asked its prime minister not to provoke China over Taiwan. The denial follows remarks by Japanese official Sanae Takaichi suggesting Tokyo could intervene militarily if Taiwan is attacked, which prompted strong criticism from Beijing. Japanese officials have clarified their position and rejected claims of U.S. pressure on the issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.15 (keywords: attack, criticism); semantic: pos_sim=0.00, neg_sim=0.14",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NASA rover may have found signs of lightning on Mars",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 27 Nov 2025 12:00:04 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "Associated Press"
    ],
    "domains": [
      "phys.org",
      "news.google.com"
    ],
    "snippets": [
      "Scientists have detected what they believe to be lightning on Mars by eavesdropping on the whirling wind recorded by NASA's Perseverance rover.",
      "Scientists capture the crackling sounds of what they believe is lightning on Mars AP News"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-capture-the-1.jpg",
    "titles": [
      "Scientists capture the crackling sounds of what they believe is lightning on Mars",
      "Scientists capture the crackling sounds of what they believe is lightning on Mars - AP News"
    ],
    "url": "https://phys.org/news/2025-11-scientists-capture-crackling-lightning-mars.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxQSFRLM3NiWktJdlpDN2F1N0djWGMwUGFOcjdBZ0FHbFBrTkp1ZUJOUW1jYk9QZ1VFTktjTVBSUEttRTJ1YUhyYnVQUXF0WW0zUC1WNjMzZnlxZVVvVXZqcE5PZnFidXByODFUWmtaZ05nc25fR2FnQUhVWDNUaUkyOXhrTUNONi12U3BRcDdHRXp2U0NUOWJ4WGx3SEl3eFk?oc=5"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2025-11-scientists-capture-crackling-lightning-mars.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists using NASA's Perseverance rover have recorded crackling sounds that they believe indicate the presence of lightning on Mars. The audio was captured by the rover's microphones during a dust storm. If confirmed, this would be the first evidence of lightning on the planet. The findings are under further review.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Nikon camera and smart telescope prices drop for Black Friday",
    "domain": "business",
    "source_domain": "livescience.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 16:00:00 +0000",
    "source": "Live Science",
    "sources": [
      "Live Science",
      "MarketWatch"
    ],
    "domains": [
      "livescience.com",
      "marketwatch.com"
    ],
    "snippets": [
      "We break down the key differences to help you make an informed choice before the sales hit, so you don't waste money on something you won't use.",
      "“I received an email from eBay, or at least it looked like it was from an official eBay address.”",
      "“Be sure to ‘pay yourself first’ before you spend a dollar on deals,” says financial planner."
    ],
    "image_url": "https://cdn.mos.cms.futurecdn.net/rPJvaoWKzGpDNZMeArq2eZ-1280-80.jpg",
    "titles": [
      "Can't decide between a telescope and binoculars? Read this before Black Friday",
      "Beware of this Black Friday scam",
      "Stop and do this before you buy anything on Black Friday"
    ],
    "url": "https://www.livescience.com/space/astronomy/cant-decide-between-a-telescope-and-binoculars-read-this-before-black-friday",
    "alternate_urls": [
      "https://www.marketwatch.com/story/is-it-a-black-friday-scam-ebay-said-id-set-up-an-account-there-was-only-one-problem-i-hadnt-b4b8c169?mod=mw_rss_topstories",
      "https://www.marketwatch.com/story/stop-and-do-this-before-you-buy-anything-on-black-friday-50dc1ccb?mod=mw_rss_topstories"
    ],
    "location_scope": "global",
    "link": "https://www.livescience.com/space/astronomy/cant-decide-between-a-telescope-and-binoculars-read-this-before-black-friday",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Nikon D850 camera is currently available at a discounted price for Black Friday. Additionally, a popular smart telescope is being sold for $3,999 at several retailers. Separately, there are reports of phishing emails that appear to be from eBay, highlighting the need for caution when handling suspicious messages.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Soyuz spacecraft blasts off for International Space Station with Russian and American crew - Reuters",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 13:38:36 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Soyuz spacecraft blasts off for International Space Station with Russian and American crew Reuters",
      "A U.S.-Russian crew of three began a mission to the International Space Station aboard a Russian spacecraft following a successful launch Thursday."
    ],
    "image_url": "",
    "titles": [
      "Soyuz spacecraft blasts off for International Space Station with Russian and American crew - Reuters",
      "US-Russian crew of 3 blasts off to the International Space Station in a Russian Soyuz spacecraft"
    ],
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQOExKRVdkNXRWenY4eGlpbXlhWGRkWFdYejRYY2xYOGlsa2pFMjlxVUxSVllhTjBSS3FhY2lfbUtqdk02RXppWFp6a2h5clVGS0o2UTBWbFRrUGJQT3BmUDJRQ3Y1YmJ0X2tXSVBPc2dOdkRHZjU0NS1zZVZsbEJYVlIzSzZMN0xkbGZVdUE3VEVkd0JpWGc5ZVRhWTlqeEU5VXVzV1lvTWFXM1Q2WDdtdlFBVHpRQ3lDXy1hYnFn?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2025-11-russian-crew-blasts-international-space.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQOExKRVdkNXRWenY4eGlpbXlhWGRkWFdYejRYY2xYOGlsa2pFMjlxVUxSVllhTjBSS3FhY2lfbUtqdk02RXppWFp6a2h5clVGS0o2UTBWbFRrUGJQT3BmUDJRQ3Y1YmJ0X2tXSVBPc2dOdkRHZjU0NS1zZVZsbEJYVlIzSzZMN0xkbGZVdUE3VEVkd0JpWGc5ZVRhWTlqeEU5VXVzV1lvTWFXM1Q2WDdtdlFBVHpRQ3lDXy1hYnFn?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "China Warns of Bubble Risk in Booming Humanoid Robotics Industry - Bloomberg.com",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 10:08:05 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "The Verge"
    ],
    "domains": [
      "news.google.com",
      "theverge.com"
    ],
    "snippets": [
      "China Warns of Bubble Risk in Booming Humanoid Robotics Industry Bloomberg.com",
      "A humanoid robot bubble could be brewing, warned China’s leading economic planning agency on Thursday. The alert comes amid growing fears that a bubble in a related industry — AI — is about to burst. Speaking at a press briefing, National Development and Reform Commission spokesperson Li Chao said C"
    ],
    "image_url": "",
    "titles": [
      "China Warns of Bubble Risk in Booming Humanoid Robotics Industry - Bloomberg.com",
      "A humanoid robot-shaped bubble is forming, China warns"
    ],
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPMGt6MXR5NFNlck96c2NIZ0VNbUdmRVlyRk5ZMDV3YzNtM1ctcEtRVnUxVElLNGZablJTWHlxaW1uMXhZU2dhcWhUbzh5cWhicGZWSTR4c2lCSmV2b2gxWVN6VTUwZld4V0xRZlFuV0tjZUR5NTlWeGpJMWJvRnBHdTBUX0VjRFJSZzNoQU5wNHk5ZkhkRjRxb3VDQTA1VmlLV3UxSGR6M3VPNW5RTWtzV1BubkdWZw?oc=5",
    "alternate_urls": [
      "https://www.theverge.com/news/831451/china-humanoid-robotics-bubble"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPMGt6MXR5NFNlck96c2NIZ0VNbUdmRVlyRk5ZMDV3YzNtM1ctcEtRVnUxVElLNGZablJTWHlxaW1uMXhZU2dhcWhUbzh5cWhicGZWSTR4c2lCSmV2b2gxWVN6VTUwZld4V0xRZlFuV0tjZUR5NTlWeGpJMWJvRnBHdTBUX0VjRFJSZzNoQU5wNHk5ZkhkRjRxb3VDQTA1VmlLV3UxSGR6M3VPNW5RTWtzV1BubkdWZw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Woman killed in shark attack at remote beach in Australian national park",
    "domain": "science",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 04:42:36 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Phys.org"
    ],
    "domains": [
      "bbc.com",
      "phys.org"
    ],
    "snippets": [
      "The woman died at the scene and a man was critically injured after the attack in New South Wales.",
      "A bull shark killed a woman swimming off a remote beach in Australia's eastern state of New South Wales Thursday while a man was seriously injured and may have been saved by the \"heroic\" efforts of a passerby."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/77ac/live/d1615a70-cb17-11f0-857b-31fcc65fa2ab.jpg",
    "titles": [
      "Woman killed in shark attack at remote beach in Australian national park",
      "Bull shark attack kills woman, injures man at remote Australian beach"
    ],
    "url": "https://www.bbc.com/news/articles/cz68lglg5vlo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://phys.org/news/2025-11-bull-shark-woman-remote-australian.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cz68lglg5vlo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.725,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Some big stores and restaurants will be open on Thanksgiving 2025",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 11:03:45 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Open Thanksgiving 2025: See the list of stores and restaurants open Thursday Axios",
      "What's open on Thanksgiving — and how late Axios"
    ],
    "image_url": "",
    "titles": [
      "Open Thanksgiving 2025: See the list of stores and restaurants open Thursday - Axios",
      "What's open on Thanksgiving — and how late - Axios"
    ],
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBCUEJrLVZIMzQtaVg5aVo1bmxLRnB4Q2YxZlRDOTdGV0dRNE14eGE1QmZJTS1wSTNrRkYwaURHSjgtV0J1UE9oUUlvaENSZFI3SkxhYTQ2NWl4bXJSZ0ctS2xlS2xEVm9ZaUVLRTMzWEtGcC1QZmVaWVMzc1VDZUU?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZU8wdjNhWExPU25oMFlaMUZLdnc1eHhsNm1Cb204NVM1eGN3NnhCTHZLS25uWVFUTnlKWGFJMEw2YU8za21ielJNaFE0VzdHbllkLXRsY2RtQ2hUTUtGY0UxUFVBUldWU2xjSHVScDJpaE0zeVNpUmFCdkNXU3RMNWdWTQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBCUEJrLVZIMzQtaVg5aVo1bmxLRnB4Q2YxZlRDOTdGV0dRNE14eGE1QmZJTS1wSTNrRkYwaURHSjgtV0J1UE9oUUlvaENSZFI3SkxhYTQ2NWl4bXJSZ0ctS2xlS2xEVm9ZaUVLRTMzWEtGcC1QZmVaWVMzc1VDZUU?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.827,
      "consensus": 0.35,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.493,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Several major retailers and restaurants will remain open on Thanksgiving Day 2025, though hours may vary by location. National chains such as Walmart, CVS, and Starbucks are among those expected to operate, while many grocery stores and other businesses will close or have reduced hours. Customers are advised to check with local stores for specific opening times.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story is useful to readers as it provides actionable information about which stores and restaurants will be open on Thanksgiving Day. However, it does not provide any deeper understanding or insight into a broader issue, nor does it report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  }
]