[
  {
    "title": "Denmark Bans Civilian Drones Amid Security Concerns, Closes Airports",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:57:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Global News",
      "Al Jazeera",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com",
      "globalnews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Drone sorties over past week have caused the temporary closures of several Danish airports, raising security concerns.",
      "Danish government says security measures are required ahead of two summits of European leaders",
      "<p>Civilian unmanned flights to be banned during gathering of heads of EU governments amid spate of drone incursions </p><p>Danish authorities have said drones were seen at several military sites overnight and announced that all civilian use of the unmanned aircraft will be banned this week, as Cope",
      "This is the latest unexplained drone activity after several sightings, including over five Danish airports last week."
    ],
    "image_url": "",
    "titles": [
      "Denmark bans drone flights after latest drone sightings at military bases",
      "Denmark bans civil drones for a week after sightings over military bases",
      "Denmark reports more drone sightings ahead of European summits",
      "Denmark reports new drone sightings over army bases, NATO ups surveillance"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.976,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Recent drone activity, including sightings over five Danish airports, has prompted Denmark to temporarily close several airports and raise security concerns. Ahead of two European leaders' summits, the Danish government announced a ban on all civilian drone flights this week, especially after drones were observed at military sites. This measure aims to enhance security amid the unexplained drone incursions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Roses Triumph at Rugby World Cup, Beat Canada at Battersea Celebration",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Sun, 28 Sep 2025 15:45:10 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.independent.co.uk",
      "www.theguardian.com"
    ],
    "snippets": [
      "Rain could not England marked their World Cup win with a celebration event at Battersea Power Station",
      "<p>Strength in depth was key, with 32 players contributing in a tournament in which John Mitchell’s side were rarely troubled</p><p><strong>Hannah Botterman</strong> <em>Bristol Bears</em> Wanted to prove she is the best loosehead prop in the world and duly delivered. England at times would have bee",
      "In 2017 and 2022 England's Red Roses suffered crushing Rugby World Cup final defeats. On Saturday, they banished those demons to clinch final success over Canada."
    ],
    "image_url": "",
    "titles": [
      "England fans soak up celebrations as Red Roses mark Women’s Rugby World Cup triumph",
      "England squad ratings: how all the Red Roses performed at Rugby World Cup",
      "How England's Red Roses banished Rugby World Cup final demons"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.785,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England's Red Roses celebrated their Rugby World Cup victory at Battersea Power Station, overcoming previous final defeats in 2017 and 2022 by winning against Canada on Saturday. The team's depth, with 32 players participating, played a crucial role in their largely untroubled tournament performance. Hannah Botterman, from Bristol Bears, stood out by proving herself as the world's best loosehead prop.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Reports 500 Drones in Heavy Attack on Ukraine",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 04:52:23 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy said the large-scale attacks involved nearly 500 strike drones.",
      "Russia has launched a heavy attack on Ukraine with hundreds of kamikaze drones hitting residential buildings in Kyiv.",
      "Russia’s missile and drone attack came days after Ukrainian President Volodymyr Zelensky’s meeting with President Donald Trump at the U.N. General Assembly."
    ],
    "image_url": "",
    "titles": [
      "Large Russian drone and missile attack on Kyiv kills 4 and wounds at least 10",
      "Heavy Russian drone attack kills at least four in Ukraine’s capital Kyiv",
      "Four dead as massive Russian attack on Kyiv hits apartments, hospital"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.859,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy reported nearly 500 strike drones were used in one of the heaviest attacks on Ukraine since the war began. This information is supported by media reports and independent monitors, highlighting the scale of the assault.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hovland Withdraws from Ryder Cup, Singles Match Halved Due to Injury",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:54:08 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.sportingnews.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Viktor Hovland's Ryder Cup singles match against Harris English is declared a half point for Europe and the US.",
      "Norway's Viktor Hovland withdrew from the Ryder Cup on Sunday with a neck injury, a move that lifted Europe closer to a historic victory over the United States at Bethpage Black.&quot;There's nothing more I would like to do than be out there representing Team Europe and trying to help them win the R",
      "Viktor Hovland withdrew from his singles match Sunday in the Ryder Cup, which also meant Harris English had an early end to his week.  Hovland and English were scheduled to meet in the final match.  Under the captain's agreement, that will be considered a halve.",
      "The U.S. and Europe will be treated as a tie and each team will receive half a point.",
      "The Norwegian last played in the final morning match on Saturday.",
      "<p>Before even a single ball was hit on Sunday at the Ryder Cup, Team Europe inched slightly closer to victory.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c517/live/a6130ac0-9c83-11f0-95c6-7592d7636e22.jpg",
    "titles": [
      "Injured Hovland ruled out of Ryder Cup singles",
      "Injured Hovland withdraws from Ryder Cup as Europe moves closer to win",
      "Viktor Hovland out of Ryder Cup singles with injury. Harris English has to sit",
      "Ryder Cup: Europe's Viktor Hovland forced to withdraw from Sunday singles with a neck injury",
      "Viktor Hovland injury update: Golfer scratched from Sunday singles at Ryder Cup with neck soreness",
      "Viktor Hovland withdraws from Ryder Cup, moving Europe closer to victory"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.974,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Viktor Hovland withdrew from the Ryder Cup due to a neck injury, resulting in his singles match against Harris English being declared a half point for both Europe and the US. This decision, made before play on Sunday, moved Europe closer to a historic victory at Bethpage Black. Hovland last competed on Saturday, and his withdrawal marked an early conclusion to English's participation in the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Backs £1.5bn Loan for JLR to Recover from Cyber-Attack, Restart Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:38:20 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Liam Byrne spoke after the government announced it was backing a £1.5bn loan to the company, and warned cyber-attacks could become more common.",
      "Carmaker receives official backing after cyber attack that has halted production",
      "<p>Britain’s largest automotive employer plans to restart engine manufacturing in early October, report says</p><p>The government has said it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) as the carmaker battles the consequences of a recent cyber-attack.</p><p>JLR had to suspend"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d262/live/65281cd0-9c5b-11f0-b66e-67a4632b8ff2.jpg",
    "titles": [
      "Jaguar Land Rover may need more than £1.5bn government loan guarantee, MP says",
      "‘Moral hazard’ warning after £1.5bn government loan guarantee for JLR",
      "UK government will underwrite £1.5bn loan guarantee to Jaguar Land Rover after cyber-attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK government has underwritten a £1.5bn loan guarantee to Jaguar Land Rover (JLR), Britain's largest automotive employer, to help it recover from a cyber-attack and restart engine manufacturing in early October. This move, involving a loan from a commercial bank backed by UK Export Finance, aims to protect the automotive supply chain and provide certainty to suppliers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stampede at Tamil Nadu Rally for Actor Vijay Kills 39, Injures 40",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 02:39:53 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others.",
      "A crowd crush at a campaign rally for popular actor-turned-politician Vijay has killed at least 39 people in Karur.",
      "Crush at actor-politician Vijay’s rally in Tamil Nadu kills 39 people, including eight children; 40 others injured.",
      "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay."
    ],
    "image_url": "",
    "titles": [
      "Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40",
      "Crowd crush kills dozens in India at political rally for Tamil actor Vijay",
      "Crowd crush at political rally in southern India kills 39 people",
      "Stampede at Actor’s Political Rally Kills at Least 38 in India"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.821,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A stampede at a campaign rally in Tamil Nadu for actor-turned-politician Joseph Vijay Chandrasekhar, known as Vijay, resulted in at least 39 deaths, including eight children, and injured 40 others. The incident occurred in Karur during an event for the popular Indian actor and politician.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Selena Gomez and Benny Blanco Wed in California, Celebrities Attend",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 08:05:20 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Gomez shared pictures online of her in a white wedding gown, and guests included Taylor Swift and actor Paul Rudd.",
      "<p>Emmy- and Grammy-nominated performer announces marriage online with photos from California ceremony</p><p>Emmy- and Grammy-nominated performer <a href=\"https://www.theguardian.com/film/selena-gomez\">Selena Gomez</a> has married music producer and songwriter Benny Blanco, announcing the news in an",
      "SANTA BARBARA, Calif. (AP) — Selena Gomez has married music producer and songwriter Benny Blanco, announcing the news in an Instagram post showing the couple kissing and embracing on a lawn. “My wife in real life,” Blanco responded to the post Saturday by the Grammy- and Emmy-nominated performer. Go"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5b59/live/c9307e00-9c3a-11f0-b741-177e3e2c2fc7.png",
    "titles": [
      "Selena Gomez marries music producer Benny Blanco",
      "Selena Gomez marries music producer Benny Blanco: ‘My wife in real life’",
      "Selena Gomez marries Benny Blanco: ‘My wife in real life’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.828,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Selena Gomez married music producer and songwriter Benny Blanco in California, announcing their marriage with photos online. The ceremony was attended by celebrities including Taylor Swift and Paul Rudd. Blanco and Gomez shared their joy on Instagram, with Blanco referring to Gomez as \"my wife in real life.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gaza Health Ministry: 66,000 Palestinians Dead in Israel-Hamas War",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 11:51:52 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CityNews"
    ],
    "domains": [
      "www.npr.org",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The death toll in the Israel-Hamas war has topped 66,000 Palestinians, Gaza's Health Ministry said, a day before the Israeli Prime Minister heads for talks with U.S. President Donald Trump.",
      "CAIRO (AP) — The death toll in the Israel-Hamas war has topped 66,000 Palestinians, Gaza’s Health Ministry said Sunday, a day before Israeli Prime Minister Benjamin Netanyahu heads to the White House for talks with U.S. President Donald Trump on halting Israel’s ongoing offensive in Gaza City. Israe"
    ],
    "image_url": "",
    "titles": [
      "Palestinian death toll tops 66,000 as Netanyahu prepares to meet Trump",
      "Palestinian death toll tops 66,000 as Netanyahu prepares to meet Trump"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Gaza Health Ministry reports over 66,000 Palestinians have died in the Israel-Hamas war. This announcement comes as Israeli Prime Minister Benjamin Netanyahu prepares for discussions with U.S. President Donald Trump aimed at stopping Israel's offensive in Gaza City.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Orders Troops to Portland to Guard Immigration Sites",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T17:21:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "ABC News",
      "Axios"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.dw.com"
    ],
    "snippets": [
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "President Trump on Saturday said he ordered the deployment of troops to Portland to combat alleged domestic terrorists."
    ],
    "image_url": "",
    "titles": [
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Trump admin live updates: Gov. says 'no need' after Trump directs troops to Portland"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.622,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The president has directed troops to Portland with a \"full force\" directive, stating it is necessary to protect immigration detention facilities from what he terms \"domestic terrorists.\" This action is part of a broader initiative to address security concerns at these facilities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ryder Cup Announcer Resigns, Apologizes for McIlroy Chant Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 07:48:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "A master of ceremonies has stepped down from her role at the Ryder Cup after joining the Bethpage Black crowd in directing expletive-laced chants toward Rory McIlroy.",
      "The Ryder Cup first-tee announcer who encouraged expletive-filled chants at Rory McIlroy has apologised and stepped down, the PGA of America has confirmed."
    ],
    "image_url": "",
    "titles": [
      "Bethpage MC steps down over vulgar Rory chants",
      "Ryder Cup MC steps down after encouraging expletive-filled Rory chants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The first-tee announcer at the Ryder Cup, who prompted the crowd to chant expletives at Rory McIlroy, has apologized and resigned from her role, as confirmed by the PGA of America.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Winnipeg Jets Secure First Preseason Win; Samberg Injured",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 02:38:06 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Walker Duehr, Nikita Chibrikov, Parker Ford and Neal Pionk scored for the Jets in their first win of the preseason but Dylan Samberg left the game with an injury.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWldDUVZmd0xCaDBUUGZMVHlJSlgwblJ5SjRlaTZ6dkdNNXl1dTViLXliN0lfMGFoSFRXcWpyX2pzNzlRS1hvUm1nMmRnZjlrQzZ6Ny13Qm4yR3M3Uk53ZXhmcDhDSXZwZHV5Ujl6WlJ3cVpiWWxtcnBIbUlpZHM1bmVyaw?oc=5\" target=\"_blank\">THREE THINGS: Jets record first win of preseason<",
      "<a href=\"https://news.google.com/rss/articles/CBMiZEFVX3lxTE5kYVNPbUN2Wk1IYUxPTkZja2x3aTNFVm01M2VjMjRRNW5QQ25DSHN3RHcxTnA3cTlEZGQ0aEhndG5FWEFPY3dPVjloNUpvNmNUX3BDRzlKQmU0azZsWVRxak9pR1c?oc=5\" target=\"_blank\">Avalanche Outshine Stars with 4-1 Win in Preseason Action</a>&nbsp;&nbsp;<font color=\"#6f6f6"
    ],
    "image_url": "",
    "titles": [
      "Winnipeg Jets notch first win of the preseason, downing Calgary 4-2",
      "THREE THINGS: Jets record first win of preseason - NHL.com",
      "Avalanche Outshine Stars with 4-1 Win in Preseason Action - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In their first preseason victory, the Winnipeg Jets saw goals from Walker Duehr, Nikita Chibrikov, Parker Ford, and Neal Pionk. However, the win was marred by an injury to Dylan Samberg, who had to leave the game. The current status of Samberg's injury was not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "College Football Rankings Updated After Major Upsets",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 15:43:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "Vaughn Dalzell shares his College Football top 25 following all of the upsets, including Oregon's win over Penn State and Alabama's upset vs Georgia!",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOcm15VGdTeEFXT0ZWbWFGUkRRYUtERUlsUElmMWZxRW5WMU5BRjZDOUlBSW5SVkJ4dERzMmtwWGE4UmpfZmg2RnhIdDJsR2xPUmxmMkczNTFVU3lGc1dLUFpSQnpRVWZfcGJhWVdVanRWamhQX3hMUDFqNFhwZC14Q0dLSjlRSUVRZHJnRHgzZw?oc=5\" target=\"_blank\">Projecting the College Football A",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOdmNmOG9oOG1oMkZ6UVd4Um82cmdpUjhzbUcwLU81M0F0bEF4cFJ3M3BneVJhSGs5YU1OOHBqWUFTdEVlY2ZnbV84dTIwRGlvbW5WdkpJWmNCTGtUcmVjby1aWnhHeENIQ21PYy1fSGxoblZnTi03WDFPOHNKUFBtQlVmZjdRc1R4cDM2OVh3?oc=5\" target=\"_blank\">Ranking the Top Five Heisman Trophy"
    ],
    "image_url": "",
    "titles": [
      "2025 College Football Rankings Week 6 Top 25: New No. 1! Oregon, Alabama, and Ole Miss shake up polls",
      "Projecting the College Football AP Top 25 for Week 6 - Sports Illustrated",
      "Ranking the Top Five Heisman Trophy Candidates After College Football's Week 5 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Vaughn Dalzell has updated his College Football top 25 rankings following significant upsets, including Oregon's victory over Penn State and Alabama's surprising loss to Georgia. These changes reflect the latest shifts in college football dynamics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Singer Lola Young Collapses on Stage in New York, Says She's \"OK\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:03:32 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Lola Young was performing at a festival when she appeared to drop her microphone and fall backwards.",
      "<p>British singer thanks fans for support after incident at gig, during which she had told crowd of ‘tricky couple of days’</p><p>The British singer Lola Young has said she is “doing OK” after collapsing on stage during a festival performance in New York.</p><p>In footage posted on social media, the"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/152d/live/a091b3f0-9c77-11f0-8277-67a32d4ec754.jpg",
    "titles": [
      "Lola Young 'doing OK' after collapsing on stage during gig",
      "Lola Young ‘doing OK’ after collapsing on stage at festival in New York"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British singer Lola Young collapsed on stage during a New York festival performance after mentioning she had a \"tricky couple of days.\" She later assured fans she is \"doing OK\" through social media. The incident involved her dropping her microphone and falling backwards, which was captured in online footage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaxson Dart Named Giants QB1 Ahead of Week 4 Clash With Chargers",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 15:00:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bigblueview.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jaxson Dart gets the QB1 nod for the Giants while the Chargers are looking for a 4-0 start",
      "A matchup of two big Week 3 winners",
      "What will happen in Jaxson Dart’s debut?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/27/2d823bc1-dd24-4f77-9235-b27c43070475/untitled-design-2025-09-27t023126-697.png",
    "titles": [
      "Where to watch Giants vs. Chargers: TV channel, live stream, prediction, pick, odds",
      "Where to watch Browns at Lions TV channel, live stream, prediction, pick, odds, spread",
      "Giants vs. Chargers, Week 4: Live updates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jaxson Dart was named the starting quarterback (QB1) for the New York Giants. In Week 4, the Giants face the Los Angeles Chargers, who are aiming for a 4-0 start to the season. This game follows victories for both teams in Week 3. The outcome of Dart's debut as QB1 remains to be seen.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aston Villa Secures 3-1 Victory Over Fulham in Premier League Match",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:50:21 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>⚽️ Premier League updates from 4.30pm BST<br />⚽️ <a href=\"https://www.theguardian.com/info/2022/nov/14/football-daily-email-sign-up\">Sign up for Football Daily</a> | <a href=\"https://www.theguardian.com/football/live/2025/sep/28/aston-villa-v-fulham-premier-league-live\">Aston Villa 3-1 Fulham</a",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQQmZQVmxWUHZCQm9SejRDSENoYk5nR2htWVZjdk1vRXhsYkxKSjFPOE1hWnpwVzhkdUV2V1BVM3Y5Q1NXUk50a1p6b1VuN0VndmQ1YmkyaWVhcU5FTjhQcVdMSlZYWWkwaUROS1haR3I0UGFQd2otVnZkUjJ2bGxwSjNZbW4yTVNhaEE?oc=5\" target=\"_blank\">How to Watch Newcastle vs. Arsenal on TV"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b98114b481e8d006b1e545995c59c481acc126f0/385_0_4005_3206/master/4005.jpg?width=140&quality=85&auto=format&fit=max&s=67f5430aea78b19b2528ef10881fcd7e",
    "titles": [
      "Newcastle v Arsenal: Premier League – live",
      "How to Watch Newcastle vs. Arsenal on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aston Villa defeated Fulham 3-1 in the Premier League match. To watch Newcastle vs. Arsenal on TV, follow the provided link. The outcome of the Aston Villa vs. Fulham game is a 3-1 victory for Aston Villa.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "West Revives UN Resolutions Against Iran; Inflation, Shortages Plague Nation",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 09:48:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Six UN resolutions against Iran are automatically revived by the West as Iran and Russia call the move &#039;null and void&#039;.",
      "Already suffering a 40 percent inflation rate and critical shortages of power and water, many in Iran expect conditions to get worse."
    ],
    "image_url": "",
    "titles": [
      "Iranians fear more economic pain, war as UN sanctions snapback",
      "Iranians Brace for Economic Impact of New U.N. Sanctions"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The West has revived six UN resolutions against Iran, a move that Iran and Russia deem 'null and void'. Amidst this, Iran is grappling with a 40 percent inflation rate and severe shortages of power and water, with the populace bracing for worsening conditions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Steelers' Skylar Thompson Robbed, Incident Under Investigation",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 13:36:24 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOY3pnZXdpc05lcFdITUxrSWJZdlFZWFJwNlMySTEzYmZQQWptcWtpbzVTaVItMHEtaWxEb0F6X2NFV1ViUGduZUpzZi1SNHBiX1BWQ1VrcnAzWTl1b21yeGhjbmpsSFcyOVlwWWE4Um9kQVZpOWhlQUZ4VTFhWUdZY0dHMnF6MEpmMjJaWHFDU2ZVQQ?oc=5\" target=\"_blank\">Steelers Backup QB Skylar Tho",
      "<p>The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident Friday night after a report that the player had been robbed.</p>"
    ],
    "image_url": "",
    "titles": [
      "Steelers Backup QB Skylar Thompson Sustained Minor Injuries in Ireland Robbery - Sports Illustrated",
      "Report: Steelers backup QB Skylar Thompson robbed in Dublin"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident on Friday night, following reports that he was robbed. The current status of the situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Starmer Labels Farage's Immigration Policy \"Racist\" Amid Poll Concerns",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-28T11:52:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "British Prime Minister Keir Starmer has called for discipline within his center-left Labour Party as polls show Nigel Farage's anti-immigration Reform UK party well ahead.",
      "UK prime minister calls key Reform policy ‘racist’ as he focuses fire on Nigel Farage’s party"
    ],
    "image_url": "",
    "titles": [
      "Keir Starmer urges Labour to unite against Reform UK",
      "Starmer urges Labour to unite for ‘fight of our lives’ ahead of conference"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British Prime Minister Keir Starmer criticized Nigel Farage's Reform UK party's main anti-immigration policy as \"racist.\" Starmer emphasized the need for discipline within his center-left Labour Party amid polls indicating Farage's party is leading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kyiv Hit by Over 600 Drones and Missiles; Casualties Reported",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 11:46:41 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "More than 600 drones and missiles, predominantly aimed at Kyiv, hit factories and the Institute of Cardiology.",
      "<p>Moscow targets Kyiv and other regions with about 600 drones and 40 missiles, killing at least four people</p><p>Kyiv has experienced one of its worst bombardments since the start of Vladimir Putin’s full-scale invasion of Ukraine, with at least four people killed in what Volodymyr Zelenskyy descr"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7e0c/live/0796d830-9c48-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Zelensky condemns 'vile' Russian strikes lasting 12 hours",
      "Zelenskyy condemns Russia’s ‘vile and cowardly’ 12-hour bombing of Ukraine"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Over 600 drones and missiles targeted Kyiv, impacting factories and the Institute of Cardiology, resulting in casualties including a 12-year-old girl. Concurrently, unidentified drones were observed over Danish military bases. At the UN General Assembly, Russia's Foreign Minister Sergei Lavrov issued a warning against aggression towards Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Warming Intensifies Droughts; Liverpool Suffers Season's First Loss",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 11:00:09 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Rising global temperatures are making dry spells longer and more intense, with profound effects on health, food and the economy</p><p>Drought is a “creeping disaster” that devastates regions in slow motion. It kills livestock, ruins harvests, and has knock-on effects across the economy that force",
      "Liverpool suffered its first loss of the season as Crystal Palace exposed some of the weaknesses in the defending Premier League champions."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9e447f81dea87b8015e7ce585bab66d122ad4fa1/0_0_4320_3456/master/4320.jpg?width=140&quality=85&auto=format&fit=max&s=0b409d232031511853d0139947d6cc2d",
    "titles": [
      "What are droughts and how worried should we be about them?",
      "How Worried Should Arne Slot Be By Liverpool’s First Loss?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.88,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Global temperatures are increasing, leading to longer and more intense droughts. These conditions have significant impacts on health, food security, and economies by killing livestock, ruining crops, and causing widespread economic disruptions. Concurrently, Liverpool experienced its first defeat of the season against Crystal Palace, highlighting vulnerabilities in the team's defense as the current Premier League champions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]