[
  {
    "title": "Troops Enter Chicago Amid Legal Battles with City and State",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 09:52:58 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Axios",
      "ABC News",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Troops from Texas have been sent on a controversial mission to support President Trump's immigration crackdown.",
      "Troops arrive despite active legal challenges from Chicago and the state of Illinois in the courts.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQN2dSU1VIeUp2R190allwN1ZPaXBpWFkzaW45cnZBbC1nN3ZoemdKX25UZ2tKbmZieUUyeTdZNGFjVWhXR2tsMW93OFJVUEozQ2R1LVVpUzF2d1BkV25McFlPVEpVOXhlVVlUR2d2elB3TDYwZF8ycXlSdl9GNVZrdDQyeEIwWjhT?oc=5\" target=\"_blank\">Photos: Texas National Guard troops arrive ",
      "Members of the Texas National Guard have been seen at an Army Reserve Training Center in the southwest suburbs of Chicago, ABC News has learned.",
      "<p>Illinois governor says Donald Trump is ‘taking away people’s rights’. Plus, the key stats highlighting Israel’s destruction of Gaza</p><p>Good morning.</p><p>Texas national guard troops arrived in the Chicago area on Tuesday, marking an <a href=\"https://www.theguardian.com/us-news/2025/oct/07/tex",
      "<p>Military presence comes after judge declined to block troops from entering, following lawsuit filed by city and state</p><p>Texas national guard troops have arrived in the <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> area, marking an escalation of <a href=\"https://www.theguar"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/577c/live/36134040-a422-11f0-ba96-81d873a15aec.jpg",
    "titles": [
      "Hundreds of US National Guard troops arrive in Chicago",
      "US National Guard troops arrive in Illinois as Trump escalates crackdown",
      "Photos: Texas National Guard troops arrive in Chicago area for Trump crackdown - Axios",
      "Texas National Guard seen at training center in Chicago suburbs",
      "First Thing: National guard troops arrive in Chicago as governor decries Trump’s ‘military invasion’",
      "Texas national guard troops arrive in Chicago amid Trump’s crackdown"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.933,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Troops have arrived in Chicago despite ongoing legal challenges from both the city and the state of Illinois. This development follows a judge's decision not to prevent the military's entry, a decision made in the context of a lawsuit brought by Chicago and Illinois.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel in Chemistry for Pioneers of Pollution-Fighting Frameworks",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 06:08:02 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Phys.org",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.npr.org",
      "phys.org"
    ],
    "snippets": [
      "Susumu Kitagawa, Richard Robson and Omar M. Yaghi will share the prize. Their structures can \"capture carbon dioxide, store toxic gases or catalyse chemical reactions,\" the committee said.",
      "Susumu Kitagawa, Richard Robson and Omar M Yaghi&#039;s work can be used to harvest water from desert air.",
      "The work that won Susumu Kitagawa, Richard Robson and Omar M. Yaghi the 2025 Nobel Prize in chemistry could help tackle challenges such as climate change and lack of fresh water.",
      "Scientists Susumu Kitagawa, Richard Robson and Omar M. Yaghi won the Nobel Prize in chemistry on Wednesday for their development of metal–organic frameworks, which an expert likened to Hermione Granger's enchanted handbag in the fictional \"Harry Potter\" series."
    ],
    "image_url": "",
    "titles": [
      "Research on metal-organic frameworks gets the chemistry Nobel Prize",
      "Chemistry Nobel Prize awarded to trio in field of metal organic frameworks",
      "Trio wins chemistry Nobel Prize for metal organic framework",
      "Three scientists win Nobel Prize in chemistry for the development of metal-organic frameworks"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.958,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.826,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar M. Yaghi were awarded the 2025 Nobel Prize in Chemistry for their development of metal–organic frameworks. These structures are capable of capturing carbon dioxide, storing toxic gases, catalyzing chemical reactions, and harvesting water from desert air. Their groundbreaking work offers potential solutions to global challenges like climate change and water scarcity.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sullivan's Rangers Debut Ends in 3-0 Loss to Penguins",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 06:51:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mike Sullivan, a former New York assistant hired to be the next Rangers head coach in the offseason, made his debut Tuesday night at Madison Square Garden, but his former team, the Pittsburgh Penguins, stole the show and skated off with a 3-0 victory.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPTVJYNGZBeFJ1bEZvbWdiUm50LTlydDc3X0JJbm9aa2w4LXFra09tWUwzNkhYcjBueWQtNkpsTy02VUtFNktVSXMtZndLRG5rS2lXWEZZeG5XUktxeFM2T09SenFyX1NqM21EVmpjUjJIdERWdjE5YjhxRzhUVXN2YnM3OWJ6M0p2WmVOSTdsU1c?oc=5\" target=\"_blank\">Penguins spoil old coach Sulliva",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQZmUteEx1b25neEdDZ1dEQ3N6Tm41YkhtMUZhMUlHRm02TlRQZDRHa3N2ekIxSVFLV0JrZExLdUZFN1dNM0U0bF96QU5RTGRnVi1LSU1KTE41M0JIcEtrY1hZZTUzVkFVN21HYXBIWDV5a3lQN3gzVFpLS0M4bUFhdXR1TlRGUGFMZGdnUTdhUEhwQzg?oc=5\" target=\"_blank\">Penguins at Rangers projecte",
      "<p>Justin Brazeau scored twice, Arturs Silovs stopped all 25 shots he faced for his first regular-season NHL shutout, and the Pittsburgh Penguins beat the New York Rangers 3-0 on Tuesday night in each team&#8217;s opener.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sullivan's debut as Rangers coach spoiled by Pens",
      "Penguins spoil old coach Sullivan's Rangers debut with shutout win - NHL.com",
      "Penguins at Rangers projected lineups - NHL.com",
      "Penguins blank Rangers in coach Dan Muse’s debut"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Sullivan, newly appointed as the Rangers head coach, faced defeat in his debut when the Pittsburgh Penguins won 3-0 against the New York Rangers at Madison Square Garden. Justin Brazeau scored twice for the Penguins, and Arturs Silovs achieved his first regular-season NHL shutout by stopping all 25 shots from the Rangers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ravens Trade Oweh to Chargers for Gilman, Draft Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 06:51:03 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Ravens traded slumping pass rusher Odafe Oweh and a 2027 seventh-round pick to the Chargers on Tuesday in exchange for safety Alohi Gilman and a fifth-round pick in 2026, the teams announced.",
      "The Harbaugh brothers pull off a trade",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1WbGtRMVZiR0xIYWxuaFN1Q3BJLVdONWl3b1dPS2dhTm1vbTJENEZCcUtZQjVGZnhSTkFqTXFnNDZpRE9rbEtPWW9YSWlkY2J1WEFnYnVjU2pFc1I5ZEtBU3VIalFUbGFwdWt1MzVIaWc4ZjZvM1NkZjBoQVR6YWM?oc=5\" target=\"_blank\">Sliding Ravens Trade Linebacker Odafe Oweh to Chargers</"
    ],
    "image_url": "",
    "titles": [
      "Ravens shake up D, trade Oweh for Bolts' Gilman",
      "Ravens trade EDGE Odafe Oweh to Chargers for safety Alohi Gilman, late-round pick swap",
      "Sliding Ravens Trade Linebacker Odafe Oweh to Chargers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Baltimore Ravens have traded pass rusher Odafe Oweh and a 2027 seventh-round draft pick to the Los Angeles Chargers. In return, the Ravens received safety Alohi Gilman and a 2026 fifth-round pick. This trade was reported by ESPN's Adam Schefter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Watford FC Sacks Pezzolano, Reappoints Gracia as Head Coach",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 11:51:36 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Watford sack head coach Paulo Pezzolano after just 10 games in charge of the Championship club and replace him with former boss Javi Gracia.",
      "Have your say on Watford replacing boss Paulo Pezzolano with the returning Javi Gracia.",
      "<ul><li><p>Uruguayan was appointed in May and has Watford 11th</p></li><li><p>Gracia had spell as club’s manager that ended in 2019</p></li></ul><p>Watford have sacked their manager Paulo Pezzolano after only five months and 10 games in charge, with their former manager Javi Gracia confirmed as his ",
      "Watford have sacked head coach Paulo Pezzolano after just five months in charge and replaced him with former boss Javi Gracia."
    ],
    "image_url": "",
    "titles": [
      "Watford sack Pezzolano and reappoint Gracia",
      "Is Javi Gracia the right man to replace Paulo Pezzolano at Watford?",
      "Watford sack Pezzolano after 10 games and bring back Gracia as manager",
      "Pezzolano becomes 12th Watford manager sacked in five years as Gracia returns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Watford FC dismissed head coach Paulo Pezzolano after he led the team for five months and 10 games, with the club positioned 11th in the Championship. Javi Gracia, who previously managed Watford until 2019, has been reappointed as the new head coach.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "900 Stranded on Everest's Chinese Side Rescued After Snowstorm",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 01:02:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "About 900 hikers, guides and other staff who were stranded by a weekend snowstorm on the Chinese side of Mount Everest have reached safety, state media said late Tuesday.",
      "Those rescued included guides, yak herders and trekkers, who were trapped in a heavy snowstorm that began on Friday.",
      "Some 580 hikers and over 300 mountain guides, yak handlers or support staff were rescued, Chinese state media said, after heavy snows stranded them on Mount Everest."
    ],
    "image_url": "",
    "titles": [
      "Hundreds of hikers rescued from Mount Everest after severe snowstorm",
      "Hundreds of Everest hikers reach safety after snowstorm in Tibetan valley",
      "Hundreds of Mount Everest hikers rescued from snowstorm, 10 remain"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.862,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Approximately 900 individuals, including hikers, guides, yak herders, and staff, stranded by a weekend snowstorm on the Chinese side of Mount Everest, were safely rescued by late Tuesday. The group, caught in a heavy snowstorm starting Friday, has now reached safety, according to state media reports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Chemistry Awarded for Porous Materials Development",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 09:52:38 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Phys.org"
    ],
    "domains": [
      "www.theguardian.com",
      "phys.org",
      "www.bbc.com"
    ],
    "snippets": [
      "The winners of the prestigious science prize was announced by the Nobel committee in Sweden.",
      "<p>Trio honoured for developing revolutionary porous materials for applications ranging from gas storage to drug delivery</p><p>The Nobel prize in chemistry 2025 has been awarded to three scientists for developing revolutionary porous materials for applications ranging from gas storage to drug deliv",
      "The development of new compounds and novel ways of storing energy are some of the research fields commentators say could be contenders for the Nobel Prize in Chemistry announced Wednesday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8212/live/f2a133a0-a438-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Chemistry Nobel awarded for work on new materials that could help planet",
      "Nobel prize in chemistry awarded to scientists for work on porous materials",
      "Energy storage and new materials eyed for chemistry Nobel"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Nobel Prize in Chemistry 2025 was awarded to three scientists for their development of revolutionary porous materials with applications in gas storage and drug delivery. This announcement was made by the Nobel committee in Sweden, highlighting the trio's contributions to the field.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OMB: 2019 Back Pay Law Doesn't Cover Furloughed Workers Amid Shutdown",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 13:16:25 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "A new draft White House memo suggests a 2019 law signed by President Trump that guarantees that federal employees get paid after a shutdown ends would not apply to furloughed workers.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUS1lYl9GYkRZTWZLaTRhZ0dCMjg1SGJXUUpzdVpoUzdCTjB6VFpuUmpEX2lLMF82N0xtdURXZFY1aUtnZmZQN2FhWUc4ZjY1UWRsNldxaDJ3ZW9VZHJyU2xOeHFVUHliZXJ3OE1zY00tOVRjY1J5cnp6aWRObXhXakY3RFhwQktj?oc=5\" target=\"_blank\">Congress erupts over \"lawless\" Trump threat",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQeTdNcElLQ2hOX1pDXzdzZktyX2t2M2lheUM5YlMxZ0sxODRybHJWMXpaeW1OU3EzbWp4ZFRhYjcwV0lYY1lsTkhDdEtpeGx3Z2FTM3RJMUpPRUJ0MTZsYVlJMUtxU2pucWlLbXBtY1NPRWNDODZjNDlkdXZjd1hxUWRYRjQ?oc=5\" target=\"_blank\">Scoop: White House memo says furloughed federal ",
      "As the federal shutdown stretches on, furloughed federal workers face the threat of not receiving back pay, despite a 2019 law that requires it."
    ],
    "image_url": "",
    "titles": [
      "White House floats no back pay for some furloughed federal workers despite 2019 law",
      "Congress erupts over \"lawless\" Trump threat not to pay back furloughed federal workers - Axios",
      "Scoop: White House memo says furloughed federal workers aren't entitled to backpay - Axios",
      "Furloughed federal workers face threat of no back pay from shutdown, despite 2019 law requiring it"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.674,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House's Office of Management and Budget (OMB) contends that a 2019 law ensuring federal employees receive back pay after a shutdown does not apply to furloughed workers. This interpretation has sparked controversy amid the ongoing government shutdown, leaving furloughed federal employees at risk of not getting back pay as previously guaranteed by the 2019 legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches Prime Big Deal Days with Exclusive Member Discounts",
    "domain": "technology",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 11:00:57 +0000",
    "source": "Global News",
    "sources": [
      "The Verge",
      "Global News"
    ],
    "domains": [
      "www.theverge.com",
      "globalnews.ca"
    ],
    "snippets": [
      "From a KitchenAid stand mixer to a portable Cuisinart heater and beyond, read on for the best home improvement deals during Amazon Prime's Big Deal Days 2025 event.",
      "From a Philips Sonicare toothbrush to a smart Hanke carry-on, read on for the best travel deals available during Amazon Prime's Big Deal Days 2025 event--hurry and save now!",
      "From the Skylight calendar to a Ninja Foodi air fryer and beyond, read on for the best deals to snag during Amazon Prime's Big Deal Days 2025 event.",
      "We’re now in the second and final day of Amazon’s October Prime Day sale. That means it’s time to squeeze as much value out of your Prime subscription as you can until Thursday at 3AM ET / 12AM PT, which is when several deals will enter a brief hibernation ahead of Black Friday and Cyber [&#8230;]",
      "Editor’s note: This post highlights the biggest day one deals from Amazon’s sale. We’re leaving this post behind in favor of our new one focusing on the best day two deals. As such, this post will no longer receive updates. Amazon’s October Prime Day sale (aka Prime Big Deal Days) is finally here, a",
      "The second Amazon Prime Day sales event of the year is here, and once again it offers discounts on MacBooks, Windows laptops, and various PC accessories. Like previous Prime Big Deal Days, this sale runs for two days and requires a Prime membership to qualify for most discounts. Some sale prices are"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/prime-home.jpg?quality=65&strip=all",
    "titles": [
      "Improve your home with sales from Amazon October Prime Big Deal Days 2025",
      "Amazon October Prime Big Deal Days travel deals to shop before your next trip",
      "7 best home deals from Amazon October Prime Big Deal Days",
      "The 206 best October Prime Day deals",
      "The 207 best October Prime Day deals",
      "The best laptop deals you can get for Amazon’s October Prime Day"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon has launched its second Prime Day sales event of the year, known as Prime Big Deal Days, offering discounts on a wide range of products including MacBooks, Windows laptops, PC accessories, noise-canceling headphones, robot vacuums, and 4K OLED TVs. The sale, which lasts for two days, is exclusive to Prime members. Many of the discounted items have been recommended by experts after thorough testing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario Hospitals Need $1B Amid Rising Deficits, Association Says",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 10:45:00 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Hospitals across the province struggled with deficits, with many of them — small and large, urban and rural — ending the year in the red.",
      "Ontario hospitals need an additional $1 billion this year to keep pace with factors such as population growth and inflation, leaving them facing pressures far higher than the deficits they faced just at the end of last year, their association says. Hospitals across the province struggled with defici"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/CP174686596.jpg?quality=65&strip=all",
    "titles": [
      "Ontario hospitals say they have $1 billion in funding needs",
      "Ontario hospitals say they have $1 billion in funding needs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hospitals in Ontario are facing significant financial strain, with deficits reported across both small and large, urban and rural institutions. The Ontario Hospital Association has stated that an additional $1 billion is needed this year to address challenges stemming from population growth and inflation. This amount exceeds the deficits recorded at the end of the previous year, highlighting increasing financial pressures on the healthcare system.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Louisiana Police Release Video of Fatal Crash Involving Ex-LSU Player Lacy",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 06:51:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Louisiana State Police released video and records related to a fatal crash in December 2024 they allege was caused by ex-LSU football player Kyren Lacy.",
      "Lacy's attorney claimed police misrepresented the late LSU football star's involvement in the Dec. 2024 collision"
    ],
    "image_url": "",
    "titles": [
      "Police: Lacy's driving set off events in fatal crash",
      "Louisiana State Police: Evidence shows Kyren Lacy's 'reckless' driving led to events that caused fatal crash"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Louisiana State Police released video and records of a fatal crash in December 2024, attributing the cause to former LSU football player Kyren Lacy. However, Lacy's attorney disputes the police's portrayal of Lacy's involvement in the incident, suggesting a misrepresentation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Drops Spying Charges Against Two Men Due to Insufficient Evidence",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:02:10 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Prosecutors say they were unable to obtain evidence from the government to meet the threshold for prosecution.",
      "<p>Ministers and officials did not provide statements that China was threat despite ‘many months’ of effort to obtain them</p><p>Charges against two men accused of spying for China <a href=\"https://www.theguardian.com/uk-news/2025/sep/15/british-prosecutors-drop-case-against-two-men-accused-of-spyin"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/99b2/live/668aeee0-a3b3-11f0-9871-a159926144cf.jpg",
    "titles": [
      "Spy case collapse blamed on UK government failure to label China a threat",
      "China ‘spies’ case was dropped after government failed to provide evidence of Beijing threat"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British prosecutors dropped charges against two men accused of spying for China due to a lack of evidence. Despite efforts over many months, prosecutors could not obtain necessary statements from ministers and officials to meet the threshold for prosecution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Football: Start/Sit Advice and Top Waiver Wire Picks",
    "domain": "business",
    "source_domain": "touchdownwire.usatoday.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 11:34:27 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "www.forbes.com",
      "touchdownwire.usatoday.com"
    ],
    "snippets": [
      "The league is in great hands when it comes to ball carriers. Now, who should you Start/Sit during Week 6?",
      "Week 6 fantasy football start or sit picks, including A.J. Brown, Mason Taylor, and more players you should trust or bench for your team",
      "With bye weeks and injuries in play for NFL Week 6, the waiver wire is fantasy managers' most important tool. These four players should be available in your league."
    ],
    "image_url": "",
    "titles": [
      "Fantasy Football Start 'Em, Sit 'Em Week 6: RB Edition",
      "Fantasy Football Start Or Sit Week 6: A.J. Brown, Mason Taylor And More",
      "Week 6 Fantasy Football Waiver Wire Pickups: Bourne, Taylor And More"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "For NFL Week 6, fantasy football advice includes start or sit recommendations for players such as A.J. Brown and Mason Taylor. Given the impact of bye weeks and injuries, the waiver wire is crucial for managers seeking to adjust their teams. Four recommended players are highlighted as valuable pickups for this week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Myanmar Military Attack on Sagaing Festival Leaves Many Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:52:14 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Locals tell the BBC the carnage has made it hard to identify victims of the military attack.",
      "The junta targeted a  festival in the Sagaing region where people were also protesting army rule, according to witnesses and the civilian government in exile."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2649/live/2ab76460-a431-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "At least 24 killed as army paraglider bombs Myanmar Buddhist festival",
      "Myanmar Military Paraglider Bombs Buddhist Festival, Killing Dozens"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A military attack on a festival in Sagaing region, Myanmar, has resulted in significant casualties, making victim identification difficult, locals reported to the BBC. The event was also a protest against army rule, with both witnesses and the exiled civilian government confirming the junta's target.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Considers 1807 Law for National Guard Powers",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 10:42:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The US President has threatened to invoke an 1807 law to give the National Guard powers of arrest and policing.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQblJ2dkp2eDViUXhhUVdPeU9pZV85bkwzYUNFeGRiVlhLRERYekdENTExV2RuLVJqNE9Hb05kZ0dsM2wyaGljQ3NGR1hhT0wwZjJqclBKMnRpN3FvOGwwRVhjVkg1RkYwZzNubGlLMWxnWWpISGFodHBUV2xHSnVnN2xoc05YaDlhcGxYVWtsQW4?oc=5\" target=\"_blank\">How Trump could use the Insurrec"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens Insurrection Act as he sends troops to Chicago",
      "How Trump could use the Insurrection Act to send troops to American cities - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President has threatened to use an 1807 law to grant the National Guard arrest and policing powers. This move is aimed at addressing specific, undisclosed issues. The outcome or specific application of this threat remains unclear, as further details have not been provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kemi Badenoch Pledges to Scrap Stamp Duty on Primary Homes to Cut Deficit",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:32:42 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Leader pitches Conservatives as party of spending control with promise to drive down Britain’s deficit",
      "<p>Leader announces tax cut plan in policy-heavy speech aimed at boosting beleaguered party’s fiscal credibility</p><p>The Conservatives will scrap stamp duty on sales of primary residences if they win the next election, Kemi Badenoch has said in a policy-heavy speech designed to improve her party’s",
      "<p>Party leader says measure is a ‘bad tax’ and scrapping it would free up the housing market and improve social mobility</p><p>Voting in the Labour deputy leadership election opens today. <strong>Lucy Powell</strong>, the former Commons leader, is seen as the favourite and, as <strong>Jessica Elgot"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F18ea6c42-71f7-41a8-8ae2-70930fc84dcf.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Badenoch vows to scrap stamp duty",
      "Tories will scrap stamp duty on primary residences, Kemi Badenoch tells conference",
      "Tories would abolish stamp duty, Badenoch tells party conference – UK politics live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Conservative Party leader, Kemi Badenoch, has promised to eliminate stamp duty on sales of primary residences to reduce Britain's deficit and boost the party's fiscal reputation. This policy, aimed at freeing up the housing market and enhancing social mobility, was announced in a speech focusing on fiscal responsibility. Concurrently, the Labour deputy leadership election begins, with Lucy Powell viewed as the frontrunner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mariners' Raleigh Gifts Bat to Fan After ALDS Game 3 Win Over Tigers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 23:31:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "After the game, Cal Raleigh posed alongside the fan with an autographed bat to say thanks.",
      "<p>They say never meet your heroes, but sometimes fate has other plans. While the Seattle Mariners were busy celebrating an 8-4 win over the Detroit Tigers in Game 3 of their ALDS matchup — to take a 2-1 series lead — one fan got a couple more reasons to cheer.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Dump 61 Here': Raleigh meets fan who caught his home run ball",
      "Mariners fan sporting ‘Dump 61 here’ shirt catches homer, meets Raleigh"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Following the Seattle Mariners' 8-4 victory over the Detroit Tigers in Game 3 of their ALDS matchup, securing a 2-1 series lead, Cal Raleigh, a player from the Mariners, expressed gratitude to a fan by posing for a photo and gifting an autographed bat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Targets India for AI Expansion, Backed by Amazon",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 09:17:33 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "AI adoption among both consumers and businesses is expected to ramp up quickly in India. Amazon-backed Anthropic wants to be involved.",
      "Anthropic's next big bet is India — one of its fastest-growing markets worldwide."
    ],
    "image_url": "",
    "titles": [
      "Anthropic to open first India office as rival OpenAI boosts presence in the country",
      "Anthropic plans to open India office, eyes tie-up with billionaire Ambani"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic, an Amazon-backed company, is focusing on India as a key market for its expansion, anticipating rapid adoption of AI among consumers and businesses there. India is considered one of Anthropic's fastest-growing markets globally.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Intercepts Gaza-Bound Aid Flotilla; Activists to Be Deported",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 04:25:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Israeli military has intercepted and boarded several boats sailing towards Gaza.",
      "<p>Israeli foreign ministry confirms interception and says those on board will be deported</p><p>A new Gaza-bound aid flotilla has been intercepted by the Israeli army, days after the detention of activists on board vessels bound for the war-torn territory caused <a href=\"https://www.theguardian.com"
    ],
    "image_url": "",
    "titles": [
      "Israel intercepts Freedom Flotilla Coalition vessels en route to Gaza",
      "Israel intercepts another Gaza aid flotilla amid criticism over treatment of activists"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli military intercepted and boarded a Gaza-bound aid flotilla, days after detaining activists on similar vessels. The Israeli foreign ministry confirmed the interception, stating those on board will be deported.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bondi Clashes with Democrats in Tense Senate Judiciary Hearing",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 06:55:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.latimes.com"
    ],
    "snippets": [
      "Democrats on the Senate panel grilled her over her leadership of the Justice Department. She hit back, with GOP support.",
      "<p>Bondi's testimony before the Senate Judiciary Committee devolved into personal attacks against Democrats, who expressed dismay at their inability to get her to answer their inquiries.</p>"
    ],
    "image_url": "",
    "titles": [
      "US Attorney General Pam Bondi clashes with critics at key Senate hearing",
      "Atty. Gen. Pam Bondi dodges Democrats' questions in combative Senate hearing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During a tense Senate Judiciary Committee hearing, former Attorney General Pam Bondi aggressively responded to questions, leading to personal attacks against Democrats. Committee members expressed frustration over their inability to obtain answers from Bondi, indicating a contentious atmosphere throughout the session.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bengals Trade for QB Joe Flacco from Browns to Boost Offense",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 02:47:33 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Sanders is now second on the quarterback depth chart in Cleveland",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWE9GRl93d3E1ZjFtVnUwQ1JDS2t3cnBOSk5MX2V5Z0cxUGlXYThHcnBVYktzT2phRzJLTml1THlldXdrc2c0UFktcWhEeldleEFLWG13RWtoU1FlY0RFOFdvNUthX19QdFNQVFFFZ1VGeDdpX2lyRDR1S2JFUUJWUXA2YlQ?oc=5\" target=\"_blank\">Browns to Trade Joe Flacco to Quarterback-Needy ",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE1PRFktTnJfWXFscDJ5Ty1JY0oxR0ozVTJnVkVXN3ViZlpjTGJWbUFsOEZqQnBKUmdvcGF5Sk5tZl9lMktSb0dEYWUwbWxwU0M3aWhFejVjZVFFalpvQ2hYQVRSN21WYjUwNjlTcFFB?oc=5\" target=\"_blank\">Joe Flacco Trade Grades: Browns Were the Smart Team</a>&nbsp;&nbsp;<font color="
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/08/bbc33d83-b63b-4079-9494-11d50e2fbd42/sandersflacco.jpg",
    "titles": [
      "Shedeur Sanders reacts after Browns trade veteran QB Joe Flacco to Bengals: 'He helped me a lot'",
      "Browns to Trade Joe Flacco to Quarterback-Needy Bengals - Sports Illustrated",
      "Joe Flacco Trade Grades: Browns Were the Smart Team - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Cincinnati Bengals have traded with the Cleveland Browns to acquire veteran quarterback Joe Flacco, aiming to improve their struggling offense. This move is expected to impact the team's rookie quarterback and brings a seasoned player into the Bengals' lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Overcome 6-1 Deficit to Beat Blue Jays 9-6, Force ALDS Game 4",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 01:18:39 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>Louis Varland will take the ball for the Toronto Blue Jays to begin a bullpen game on Wednesday.</p>",
      "The New York Yankees have forced a Game 4 against the Blue Jays after defeating Toronto 9-6 in Game 3 of the American League Divisional Series (ALDS). The Blue Jays got up to an early 6-1 lead in the third inning before the Yankees rallied back. Game 4 will be at Yankee Stadium Wednesday at 7:08 [&#"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/10/CP175112622.jpg",
    "titles": [
      "Blue Jays’ Louis Varland to start Game 4 vs. Yankees",
      "Toronto Blue Jays give up early lead as Yankees force Game 4 with 9-6 victory"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.866,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Yankees defeated the Toronto Blue Jays 9-6 in Game 3 of the ALDS, overcoming an early 6-1 deficit. The discussion centers on whether Blue Jays' Shane Bieber was pulled too early by manager John Schneider. The Yankees' victory forces a Game 4 at Yankee Stadium.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NHL Openers: Penguins, Panthers, and Avalanche Secure Wins",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 04:12:36 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOWm05bTNqY1YxLWtaUFhyc3FtanNhSWU2M01kdnRFeUlqZUtUYTZyVkFjOHlzZHk0NVlJYUNSZlYyMmp3VDZhRDZ3R2VnQmZHYkdVTnlpWmVkX2RzS2YzZ1VDR0xnM2c1U0VaYURLaVV2RzVfRWs4S0JBYTd5LWhGOWVB?oc=5\" target=\"_blank\">Musings: Penguins 3, Rangers 0 (Season Opener)</a>&",
      "<p>Justin Brazeau potted his first two goals of the season while Arturs Silovs impressed in net, stopping all 25 shots to earn his first career shutout in his Pittsburgh Penguins debut as they win 3-0 over the New York Rangers.</p>",
      "<p>Frank Nazar opened the scoring on the new NHL season while Jesper Boqvist potted the game-winning goal for the Florida Panthers as they beat Chicago Blackhawks 3-2.</p>",
      "<p>Martin Necas found the back of the net twice while Cale Makar and Nathan MacKinnon both added two assists as the Colorado Avalanche beat the Los Angeles Kings 4-1.</p>"
    ],
    "image_url": "",
    "titles": [
      "Musings: Penguins 3, Rangers 0 (Season Opener) - NHL.com",
      "NHL Highlights: Penguins 3, Rangers 0",
      "NHL Highlights: Panthers 3, Blackhawks 2",
      "NHL Highlights: Avalanche 4, Kings 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.829,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the NHL season openers, the Pittsburgh Penguins defeated the New York Rangers 3-0, with Justin Brazeau scoring twice and Arturs Silovs achieving a shutout in his debut. The Florida Panthers won against the Chicago Blackhawks 3-2, with Jesper Boqvist scoring the decisive goal. Meanwhile, the Colorado Avalanche triumphed over the Los Angeles Kings 4-1, featuring two goals from Martin Necas and two assists each from Cale Makar and Nathan MacKinnon.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Zealand Oceans Warming 34% Faster, Risking NZ$206bn in Assets",
    "domain": "science",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 00:57:22 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>NZ$180bn worth of housing and $26bn of infrastructure at risk of flooding and storm damage, new government report finds</p><p>New Zealand’s oceans are warming 34% faster than the global average, with NZ$180bn (US$104bn) worth of housing at risk of flooding, a new report about the nation’s marine ",
      "The seas around New Zealand are warming much faster than global averages, scientists said Wednesday in a new study warning how climate change could batter the island nation."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7c22179d51af82b41a35bf0a66de06bce99a4cd0/54_0_5392_4314/master/5392.jpg?width=140&quality=85&auto=format&fit=max&s=b564d21a882c5933c65d8ccec33fcfed",
    "titles": [
      "New Zealand oceans warming 34% faster than global average, putting homes and industry at risk, report finds",
      "New Zealand's seas warming faster than global average: Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.775,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A new report reveals that New Zealand's oceans are warming 34% faster than the global average, putting NZ$180bn (US$104bn) of housing and NZ$26bn of infrastructure at risk of flooding and storm damage. This study underscores the significant threat climate change poses to the island nation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches Cheaper Model Y and 3, Prices Start at $36,990",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:31:46 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1XbFl5VFNyZnlQcGxoU21ZN0FTQTAxa1h1NU4zRzRaLXQzYUF4UjFiNFQ5ZllrbUs5SkNpM010SVR6bnZxdWp3MWItMkpNaVlGVV95S1cyYUpKQjJsMTlvUXNCemVHZUQ1WUFDM2t5bmg?oc=5\" target=\"_blank\">Tesla debuts cheaper versions of Model Y and Model 3 electric vehicles</a>&n",
      "The long-awaited cheaper Model 3 and Model Y are finally here, but they start at $36,990 and $39,990, respectively -- just a few thousand dollars less than Tesla's current offerings."
    ],
    "image_url": "",
    "titles": [
      "Tesla debuts cheaper versions of Model Y and Model 3 electric vehicles - Axios",
      "Tesla reveals slightly cheaper ‘standard’ versions of the Model 3 and Model Y"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.692,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk announced Tesla will sell more affordable versions of the Model Y to meet high demand, acknowledging the current price is too high for many consumers. The cheaper trims of the Model Y and Model 3 are now available, starting at $39,990 and $36,990, respectively. These prices, while lower, remain closer to $40,000, slightly missing the mass-market target price of under $30,000 that investors hoped for.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Bank Among Top Creditors to Bankrupt Auto Parts Firm, Swiss Bank Invests Too",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:09:57 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "www.ft.com"
    ],
    "snippets": [
      "US investment bank is one of largest-known creditors to bankrupt auto parts company",
      "Switzerland’s largest bank has multiple investments tied to bankrupt auto parts maker"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbd892d11-4ad6-4392-a76f-2b857198ad31.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Jefferies reveals $715mn fund exposure to First Brands invoices",
      "UBS fund holds 30% exposure linked to First Brands"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.959,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A US investment bank has emerged as one of the largest creditors to a bankrupt auto parts company. Additionally, Switzerland's largest bank holds multiple investments connected to the same bankrupt auto parts maker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]