[
  {
    "title": "EU, NATO Leaders to Meet Trump, Zelenskyy in Washington for Ukraine Peace Talks",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 17 Aug 2025 08:26:28 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "Al Jazeera",
      "Washington Post",
      "The Guardian",
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.npr.org",
      "globalnews.ca"
    ],
    "snippets": [
      "European Commission President Ursula von der Leyen and NATO Secretary-General Mark Rutte are among those expected to attend.",
      "Ukraine and its European allies have criticised Putin&#039;s stance on the war after the Alaska summit as a way to buy time.",
      "Russian President Vladimir Putin's continued refusal to accept a ceasefire is \"complicating\" efforts to reach a peace deal, Ukrainian President Volodymyr Zelenskyy said.",
      "<p>Emmanuel Macron, Friedrich Merz and others will aim to push back against ceding of Ukraine territory in ‘peace plan’</p><ul><li><p><a href=\"https://viewer.gutools.co.uk/world/live/2025/aug/17/trump-putin-meeting-european-leaders-ukraine-peace-deal-latest-updates-news\">Ukraine war live – latest up",
      "The meeting follows President Donald Trump’s summit with Russia’s Vladimir Putin in Alaska, after which Trump told allies that Putin wanted Ukraine’s Donbas.",
      "European and NATO leaders will join Zelenskyy in Washington Monday for talks with Trump on ending the war in Ukraine, with NATO-style security guarantees on the table.",
      "KYIV, Ukraine (AP) — European and NATO leaders announced Sunday they will join President Volodymyr Zelenskyy in Washington for talks with President Donald Trump on ending Russia’s war in Ukraine, with the possibility of U.S. security guarantees now on the negotiating table. European leaders, includi"
    ],
    "image_url": "",
    "titles": [
      "European leaders to join Ukraine's Zelenskyy for White House meeting with Trump",
      "European leaders to shore up Ukraine’s Zelenskyy for DC talks with Trump",
      "European leaders confirm they will join Zelenskyy in White House meeting",
      "European leaders including Starmer to join Zelenskyy in Washington for meeting with Trump",
      "European, NATO leaders to present united front with Zelensky in Trump meeting",
      "European leaders to join Ukraine’s Zelenskyy for meeting with Trump",
      "European leaders to join Ukraine’s Zelenskyy for meeting with Trump"
    ],
    "score_components": {
      "magnitude": 0.98,
      "recency": 0.926,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.853,
    "summary": "European and NATO leaders, including European Commission President Ursula von der Leyen and NATO Secretary-General Mark Rutte, are set to join Ukrainian President Volodymyr Zelenskyy in Washington for discussions with President Donald Trump aimed at ending the war in Ukraine. The talks, prompted by a recent summit between Trump and Russian President Vladimir Putin in Alaska, will explore U.S. security guarantees for Ukraine. The meeting comes amid criticisms of Putin's refusal to agree to a ceasefire, with Zelenskyy noting this stance complicates peace efforts. European allies, notably Emmanue",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 91 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump and Putin Discuss Ukraine Peace, Agree on NATO-Style Guarantees",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 15:34:35 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC",
      "CityNews",
      "Global News"
    ],
    "domains": [
      "fortune.com",
      "ottawa.citynews.ca",
      "www.cnbc.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Special Envoy Steve Witkoff's remarks come just days after President Donald Trump met in Alaska with the Russian president to discuss ending the war in Ukraine.",
      "Putin has agreed to let the U.S. and EU offer Ukraine NATO-style security guarantees, U.S. envoy says, calling it a major step toward a possible peace deal.",
      "Rubio, who is also Trump's national security adviser, said he did not believe issuing new sanctions on Russia would force Putin to accept a ceasefire.",
      "NEW YORK (AP) — Russia&#8217;s Vladimir Putin agreed at his summit with President Donald Trump to allow the United States and its European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part of an eventual deal to end the 3 1/2-year war in Ukraine, speci"
    ],
    "image_url": "",
    "titles": [
      "White House envoy claims Russia agreed to 'Article 5-like' security guarantees for Ukraine",
      "US envoy says Putin agreed to security protections for Ukraine as part of Trump summit",
      "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says",
      "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says"
    ],
    "score_components": {
      "magnitude": 0.98,
      "recency": 0.968,
      "consensus": 0.985,
      "constructiveness": 0.049,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary": "During a summit in Alaska, President Donald Trump and Russian President Vladimir Putin discussed ending the war in Ukraine. Putin agreed to let the U.S. and EU offer Ukraine NATO-style security guarantees, a significant move toward a potential peace deal. However, Trump's national security adviser, Rubio, expressed skepticism about the effectiveness of new sanctions on Russia to promote a ceasefire. This development marks a major step in diplomatic efforts to resolve the 3 1/2-year conflict in Ukraine.",
    "constructiveness_score": 0.049,
    "constructiveness_reason": "1 constructive keywords out of 82 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hurricane Erin Downgrades, Lowers Threat to Bahamas, U.S. East Coast",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 17 Aug 2025 08:39:42 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "Al Jazeera",
      "The Guardian",
      "CityNews",
      "Phys.org",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "phys.org",
      "financialpost.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "Heavy rain is still expected across the Virgin Islands and Puerto Rico, with rainfall of up to 8 inches in some areas.",
      "Erin is the fifth named storm of the Atlantic hurricane season, which runs from June 1 to November 30.",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE5KSHlwaFhpSmdvS1lpdnpEdFR0ZWQ0MzdpRTZSYU8yYnpqU25zY0NkWVZ6eGNPc0NLam43U1VJTWZvVmlfclh2S0taUUlSa0VfZ0c4SEhLUTV0V3dPVVZLQ2lEaGU1NU56V1VrbGFCaENfdw?oc=5\" target=\"_blank\">Hurricane Erin strengthens to Category 5</a>&nbsp;&nbsp;<font color=\"#6f6",
      "<p>First Atlantic hurricane of 2025 diminishes but tropical storm warnings issued for Turks and Caicos</p><p><a href=\"https://www.theguardian.com/world/2025/aug/16/hurricane-erin-gathers-force-as-it-nears-north-east-caribbean-leeward-islands\">Hurricane Erin</a> was downgraded to a category 3 hurrica",
      "Offshore Hurricane Erin was downgraded to a Category 3 storm early Sunday, as rain lashed Caribbean islands and weather officials warned of possible flash floods and landslides.",
      "Erin barreled through the Atlantic early Sunday, producing heavy winds and rainfall even after being downgraded to a Category 3 hurricane after earlier reaching the top of the five-step, Saffir-Simpson scale.",
      "Hurricane Erin weakened to a Category 3 hurricane Sunday as its outer bands continued to lash the Virgin Islands and Puerto Rico with heavy rains and tropical-storm force winds. While Erin&#8217;s maximum winds diminished, the storm&#8217;s overall size grew and forecasters issued tropical storm war"
    ],
    "image_url": "",
    "titles": [
      "Hurricane Erin downgraded to Category 3 storm",
      "Erin downgraded to Category 3 hurricane, NHC says",
      "Hurricane Erin strengthens to Category 5 - Axios",
      "Hurricane Erin weakens to category 3 as storm lashes Puerto Rico and Virgin Islands",
      "Downgraded Hurricane Erin lashes Caribbean with rain",
      "Erin Downgraded to Cat-3 Hurricane as it Churns Past Puerto Rico",
      "Hurricane Erin weakens to Category 3 as forecasters wait for northward turn"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.931,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.826,
    "summary": "Hurricane Erin escalated to a Category 5 storm, marking the first hurricane of the Atlantic season, before weakening on Saturday. Although it initially posed a threat to the Bahamas and the U.S. East Coast, the risk of direct impacts is now decreasing. Despite not being expected to make landfall, Erin could still cause strong waves, rip currents, and potential flooding in nearby islands, including Puerto Rico. The hurricane had reached maximum sustained winds of 160 miles per hour.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Canada Orders Air Canada Strike to Arbitration, Ends Travel Chaos",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 11:44:35 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC",
      "CityNews",
      "Global News",
      "New York Times"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.bbc.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Canada's jobs minister intervenes in the dispute in a bid to preserve \"stability and supply chains\".",
      "Jobs Minister Patty Hajdu ordered the sides to arbitration. The decision ended an hours-long strike that led the flag carrier to cancel hundreds of flights.",
      "The decision by the union representing the 10,000 workers means that travel chaos will most likely continue for at least a second day.",
      "Air Canada to resume flights today after feds order binding arbitration, ending strike &#38; lockout within 12 hrs. Full operations are expected to take days to normalize.",
      "The union representing Air Canada flight attendants says its workers remain on strike despite a back-to-work order. The Canadian Union of Public Employees says it will challenge an order by the Canada Industrial Relations Board to return to work by 2 p.m. ET. The federal government said Saturday tha"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b07b/live/dce7efd0-7a77-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Air Canada flights to resume after union told to end strike",
      "Canada orders Air Canada flight attendants back to work, ending strike",
      "Air Canada Flight Attendants Say They Will Defy Back-to-Work Order",
      "Union representing Air Canada flight attendants says strike will continue",
      "Union representing Air Canada flight attendants says strike to continue"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.894,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.808,
    "summary": "The Canadian government intervened in the Air Canada flight attendants' strike, ordering the airline and its striking employees back to work and into arbitration. This move came after the strike stranded over 100,000 travelers globally. Jobs Minister Patty Hajdu's decision aims to resolve the dispute and has led to the cancellation of hundreds of flights, affecting around 130,000 daily passengers. The full resumption of services is expected to take days, but the arbitration means that 10,000 cabin crew members will return to work, ending the work stoppage that significantly disrupted travel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 95 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "States Deploy National Guard to D.C. Amid Crime Concerns, Sparking Protests",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 17 Aug 2025 03:34:37 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "West Virginia said it was deploying 300 to 400 Guard troops, while South Carolina pledged 200 and Ohio says it will send 150 in the coming days, marking a significant escalation of the federal intervention.",
      "Three Republican-led states are sending their National Guard troops to aid President Donald Trump's effort to combat an \"out of control\" crime wave in the US capital.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5XVVpjVFRlQk1weTZOcDZUbHp4TkJhVk51OE84X2hGRjZpU2hqcUpsclJrOW85RnNOMkZ6RFA5VER1ZlpBVC1jaHRKdzU3MUdyTmo5djZLejV2bjNuZGtsWjQ4Z0x2VTJJbzJ4MlhxVDVzcTNUZzc1VV8xNA?oc=5\" target=\"_blank\">GOP-led states sending National Guard troops to D.C.</a>&nbsp",
      "<p>South Carolina and Ohio join West Virginia in pledging troops, fueling protests that<strong> </strong>national guard should not be used for ‘a political policing mission’</p><p>Three states have moved to deploy hundreds of members of their national guard to the nation’s capital as part of the <a "
    ],
    "image_url": "",
    "titles": [
      "Three Republican-led states to send hundreds of National Guard troops to Washington",
      "US states to deploy National Guard troops to Washington, DC",
      "GOP-led states sending National Guard troops to D.C. - Axios",
      "Three states to deploy hundreds of national guard troops to Washington DC"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.837,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.804,
    "summary": "Three Republican-led states, West Virginia, South Carolina, and Ohio, are deploying a total of 650 to 750 National Guard troops to Washington, D.C., in response to President Donald Trump's call to address what he describes as an \"out of control\" crime wave. This move has sparked protests and criticism regarding the use of the National Guard for what some see as a political policing mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Chimaev Wins UFC Middleweight Title, Sets Strike Record at UFC 319",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 11:13:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Khamzat Chimaev controlled Dricus Du Plessis for more than 21 minutes and set a UFC record for total strikes to win the middleweight title at UFC 319.",
      "Khamzat Chimaev completely dominated Dricus Du Plessis to win the UFC middleweight championship at UFC 319 on Saturday night.",
      "<p>Khamzat Chimaev would simply not be denied. He can now call himself a champion after defeating Dricus Du Plessis to win the middleweight title at UFC 319. </p>"
    ],
    "image_url": "",
    "titles": [
      "Dominant Chimaev wrestles Du Plessis' title away",
      "Relentless Chimaev beats Du Plessis to win UFC middleweight title",
      "Chimaev dethrones Du Plessis for middleweight title at UFC 319"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.981,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.782,
    "summary": "Khamzat Chimaev won the UFC middleweight championship at UFC 319 by dominating Dricus Du Plessis, controlling the fight for over 21 minutes. Chimaev set a UFC record for total strikes in the process, showcasing his skill and determination to become the champion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Lawyer Claims Foreign Actor Behind Havana Syndrome, Disputes Federal Report",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 17 Aug 2025 13:52:35 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "A lawyer for Canadian diplomats affected by Havana Syndrome says a foreign actor is to blame, despite a federal report ruling out malicious activity in Cuba.",
      "OTTAWA — A lawyer for Canadian diplomats and their families says he believes the mysterious ailments they suffered in Cuba were caused by a foreign adversary, despite a federal government report that dismisses the theory. Eight years after foreign service officials and their dependants began reporti"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/36dcbadd43c2abf6b0b32e2b91a7571a89d1530565cb90a543bfbba762455972.jpg?quality=65&strip=all",
    "titles": [
      "Lawyer ‘very confident’ a foreign adversary attacked Canadian diplomats in Cuba",
      "Lawyer ‘very confident’ a foreign adversary attacked Canadian diplomats in Cuba"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.954,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.713,
    "summary": "A lawyer representing Canadian diplomats impacted by Havana Syndrome in Cuba claims a foreign actor is responsible for their symptoms, challenging a federal report that found no evidence of malicious activity. This dispute arises eight years after the affected individuals first reported their mysterious ailments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Poilievre Among 214 in Alberta Byelection, Tests Conservative Support",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 17 Aug 2025 12:33:10 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Pierre Poilievre faces a key test Monday in Alberta's Battle River Crowfoot byelection, expected to win the Tory stronghold but watched closely for his vote margin.",
      "EDMONTON — Federal Conservative Leader Pierre Poilievre and 213 others vying for a seat in the House of Commons will be in the spotlight Monday, as voters in a rural Alberta riding head to the polls. Two political science professors say Poilievre is expected to handily win the byelection in Battle R"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/226e77b673c8c3d6a1ad0495eeec6535c53e766c29b521536c60abcb6904b601_0ad1c6.jpg?quality=65&strip=all",
    "titles": [
      "Byelection day in Alberta nears for vote with 214 candidates, including Poilievre",
      "Byelection day in Alberta nears for vote with 214 candidates, including Poilievre"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.928,
      "consensus": 0.682,
      "constructiveness": 0.065,
      "proximity": 1.0
    },
    "score": 0.708,
    "summary": "Pierre Poilievre and 213 other candidates are competing in a byelection in Alberta's Battle River Crowfoot, a known Conservative stronghold. Taking place on Monday, this election is seen as a significant test for Poilievre, the Federal Conservative Leader. Political science experts anticipate a strong victory for him, with the focus on the margin of his win to gauge his support level.",
    "constructiveness_score": 0.065,
    "constructiveness_reason": "1 constructive keywords out of 62 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Phillies' Zack Wheeler on 15-Day IL for Shoulder Blood Clot, Return Uncertain",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:47:01 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Wheeler pitched Friday against Washington and then later that night a clot was discovered in his arm.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNTGtpdWVmcEhOMS1PbTZ1QU81REk5RmZrSnRCZ0tCbGxiWTZDclZVQm4tVC1QYnZXZktVSEdVc2hraEFjZTgxOHJHSlROYlg4RC1wV3ZmaTVuZmNzQmlnVnVwTjdHdGlOQ2dvNW43anUzSnh4c1NXdURGdXdkTnhIeA?oc=5\" target=\"_blank\">Phillies to Put Zack Wheeler on Injured List With Blo",
      "<p>The Philadelphia Phillies placed ace Zack Wheeler on the 15-day injured list Saturday with a blood clot in his right arm.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a113f9fe2082d2f53b3ee8/0x0.jpg?width=960",
    "titles": [
      "Phillies Ace Zack Wheeler Goes On IL With Blood Clot In Throwing Arm",
      "Phillies to Put Zack Wheeler on Injured List With Blood Clot - Sports Illustrated",
      "Phillies ace Zack Wheeler diagnosed with blood clot in right arm, placed on 15-day IL"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.712,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary": "Philadelphia Phillies pitcher Zack Wheeler has been put on the 15-day injured list due to a blood clot near his right shoulder. There is no set timeline for his return.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Alabama's Jam Miller Out of Season Opener Against FSU Due to Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 11:13:03 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Alabama won't have its top returning rusher for the season opener against Florida State after Jam Miller suffered an upper-body injury in a scrimmage, sources told ESPN.",
      "Miller, Alabama's top returning rusher, suffered the injury during a scrimmage"
    ],
    "image_url": "",
    "titles": [
      "Sources: Bama RB Miller set to miss FSU opener",
      "Jam Miller injury: Alabama RB expected to miss season opener vs. FSU after suffering upper body injury"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.694,
    "summary": "Alabama's top returning rusher, Jam Miller, will miss the season opener against Florida State due to an upper-body injury sustained during a scrimmage. This setback leaves Alabama without a key player for the upcoming game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Monasterio's 11th-Inning Homer Secures Record 14th Win for Brewers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 11:13:03 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Andruw Monasterio hit a three-run home run in the 11th inning, and the Milwaukee Brewers won their franchise-record 14th game.",
      "Andruw Monasterio played hero with a three-run home run in the 11th inning"
    ],
    "image_url": "",
    "titles": [
      "Brewers rally again to win record 14th straight",
      "Brewers set franchise record with 14th straight win after crucial Reds error leads to extra innings"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary": "Andruw Monasterio's three-run home run in the 11th inning led the Milwaukee Brewers to their franchise-record 14th win. Monasterio's heroics secured the victory for the team, showcasing his impactful performance in the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Chargers' Quentin Johnston Suffers Concussion in Preseason Game Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 11:13:03 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chargers WR Quentin Johnston exited Saturday's preseason game on a cart after taking a big hit that left him motionless for several minutes, and head coach Jim Harbaugh said he has a concussion.",
      "Johnston remained down for several minutes after taking a hard hit on a deep ball attempt"
    ],
    "image_url": "",
    "titles": [
      "Chargers' Johnston has concussion after hard hit",
      "Quentin Johnston injury update: Chargers wide receiver carted off after big hit, diagnosed with concussion"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary": "Chargers wide receiver Quentin Johnston was carted off the field during a preseason game after a severe hit left him motionless for several minutes. Coach Jim Harbaugh confirmed Johnston suffered a concussion. His condition was monitored following the incident, emphasizing the impact of the collision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Squad Votes on Adams' Proposal for Rice as Captain; Chelsea vs Palace at 4:30pm",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 14:33:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "www.cbssports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "While club legend Tony Adams suggested Declan Rice should captain the team, the members of the squad had their vote on Thursday",
      "<ul><li><p>Updates from the 4.30pm BST kick-off at Old Trafford</p></li><li><p><a href=\"https://www.theguardian.com/football/live\">Live scoreboard</a> | <a href=\"https://www.theguardian.com/football/live/2025/aug/17/chelsea-v-crystal-palace-premier-league-live\">Chelsea v Crystal Palace – live</a></p"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/15/6add21bf-06ad-4b59-b62f-2f36ec1ecfbc/arsenal-5.jpg",
    "titles": [
      "Where to watch Arsenal vs. Manchester United: Live stream, TV channel, odds, kickoff time, news",
      "Manchester United v Arsenal: Premier League – live"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.968,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary": "Tony Adams proposed Declan Rice as team captain, but the squad held a vote on Thursday to decide. The outcome of the vote has not been provided in the content available. Additionally, there are updates for a match kicking off at 4.30pm BST at Old Trafford, with live scoreboards accessible through provided links, including a specific match between Chelsea and Crystal Palace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Onana, Hojlund Miss Man Utd Opener vs Arsenal Due to Injuries",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 15:54:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "onefootball.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "André Onana was left out of Man United's matchday squad due to injury for the Red Devils' Premier League opener against Arsenal, presenting a chance for Altay Bayindir to step up and make a positive...",
      "Rasmus Hojlund is left out of the Manchester United squad for Sunday's Premier League game with Arsenal at Old Trafford.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPUFRETHNpLXc2RndYMTZSODZzd0R5djZVa19FOGhtTHlyYTZfVnlVejhHcEpfbkdJZnlISXc2UEtXNU9ubDNQeDEtZExDZy11OThZN0xVZXR6RDRORWlERnlxSmlXMkJKZ3NGaG9ienREVENXLXdCSzRPTGFZSUFtRmhhcUQxdWgtZWZWcGpR?oc=5\" target=\"_blank\">Why Rasmus Hojlund Is Not in Man Ut"
    ],
    "image_url": "",
    "titles": [
      "😯 Arsenal gifted opener after Man Utd goalkeeper blunder",
      "Hojlund left out of Man Utd opener with Arsenal",
      "Why Rasmus Hojlund Is Not in Man Utd’s Squad vs. Arsenal - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.995,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "André Onana and Rasmus Hojlund were both left out of Manchester United's squad for their Premier League opener against Arsenal due to injury. Onana's absence allowed Altay Bayindir an opportunity to play, while the specifics of Hojlund's condition were not detailed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Eberechi Eze Bids Farewell to Palace Fans Amid Rule Complication",
    "domain": "sports",
    "source_domain": "www.telegraph.co.uk",
    "location": "national",
    "published": "Sun, 17 Aug 2025 15:36:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "www.telegraph.co.uk",
      "www.theguardian.com"
    ],
    "snippets": [
      "Eberechi Eze looked as though he said his goodbyes to the Crystal Palace fans at Stamford Bridge after being denied what might have been the perfect farewell by a little-known rule.",
      "<p>If there was a sense of the <a href=\"https://www.theguardian.com/football/2025/jul/13/chelsea-stun-psg-to-win-club-world-cup-after-cole-palmers-cool-double\">new world champions</a> being dragged back down to earth on a sweltering afternoon at Stamford Bridge, it should not be forgotten that any s"
    ],
    "image_url": "",
    "titles": [
      "Eberechi Eze denied potential farewell goal as Chelsea fail to beat Crystal Palace",
      "Eze has possible farewell goal ruled out as Crystal Palace hold Chelsea to draw"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary": "Eberechi Eze appeared to bid farewell to Crystal Palace fans at Stamford Bridge, following a match where a lesser-known rule prevented what could have been an ideal departure. This event occurred amidst the backdrop of a challenging game for the newly crowned world champions, highlighting the contrasts of success and personal transitions in professional football.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Oscar-Nominee Terence Stamp, Iconic Actor, Dies",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 15:28:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Oscar-nominated actor shot to fame in the 1960s, going on to star in numerous films across a six decade career.",
      "<p>Family says actor who worked with William Wyler, Pier Paolo Pasolini and Steven Soderbergh, ‘leaves behind an extraordinary body of work’</p><p>Terence Stamp, who made his name as an actor in 1960s London and went on to play the arch-villain General Zod in the Hollywood hits Superman and Superman"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b586/live/62ae44e0-7b7a-11f0-9fcb-edd2d2077908.jpg",
    "titles": [
      "Actor Terence Stamp, who starred as Superman villain, dies aged 87",
      "Terence Stamp, face of 60s British cinema and star of The Limey and Superman, dies at 87"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.966,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "Terence Stamp, an Oscar-nominated actor renowned for his roles in the 1960s and his portrayal of General Zod in the \"Superman\" films, has passed away. With a career spanning six decades, Stamp collaborated with directors like William Wyler, Pier Paolo Pasolini, and Steven Soderbergh. His family highlighted his \"extraordinary body of work\" in their announcement, marking the loss of a significant figure in the film industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Families Protest for Captive Release, End to Gaza Conflict",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 12:20:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Families of captives launch protest as pressure grows to halt the Gaza onslaught and release captives from Gaza.",
      "It was unclear how many people would join the planned day of action, which was expected to culminate with a large evening demonstration.",
      "Nearly two years of demonstrations have failed to push Prime Minister Benjamin Netanyahu to reach a deal with Hamas that would end the war and free the remaining captives."
    ],
    "image_url": "",
    "titles": [
      "Israelis hold nationwide protest to end Gaza war, ‘bring back the hostages’",
      "Israelis Join Nationwide Rallies to Call for Release of Hostages",
      "Israel Gears Up for Nationwide Strike to Support Hostages"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.924,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Families of individuals held captive in Gaza organized a protest to demand an end to the ongoing conflict and the release of captives. Despite nearly two years of demonstrations, these efforts have yet to persuade Prime Minister Benjamin Netanyahu to negotiate a deal with Hamas to conclude the war and secure the captives' freedom. The size of the turnout for the latest day of action, culminating in a significant evening protest, was uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Underlying Inflation Expected to Stay High, Says Desjardins Economist",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 10:02:07 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "OTTAWA &#8212; Tariff impacts are expected to keep underlying inflation elevated in July, a Desjardins economist says, even if the headline figure retreats. Statistics Canada is set to report inflation figures for July on Tuesday. A poll of economists expects annual inflation cooled last month to 1.",
      "OTTAWA — Tariff impacts are expected to keep underlying inflation elevated in July, a Desjardins economist says, even if the headline figure retreats. Statistics Canada is set to report inflation figures for July on Tuesday. A poll of economists expects annual inflation cooled last month to 1.7 per "
    ],
    "image_url": "",
    "titles": [
      "Economists expect tariffs lifted food prices, core inflation in July",
      "Economists expect tariffs lifted food prices, core inflation in July"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.881,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "In July, despite expectations for the headline inflation rate to decrease, underlying inflation is anticipated to remain high due to tariff impacts, according to a Desjardins economist. Statistics Canada will release the official inflation figures, with a consensus among economists predicting a drop to an annual rate of 1.7%.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/banknotes.svg",
      "thumbnail": "icons/banknotes.svg",
      "alt": "inflation",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rep. Zach Nunn Films Video at Iowa Fair Backing Trump Tax Law",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 14:18:39 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Republican Representative Zach Nunn is making an Iowa State Fair video about President Donald Trump’s tax law, shot on a John Deere tractor under the blazing August sun."
    ],
    "image_url": "",
    "titles": [
      "Midterm Fight Over Trump Bill, Tariffs Starts Early at Iowa Fair"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.174,
      "proximity": 0.5
    },
    "score": 0.512,
    "summary": "Republican Representative Zach Nunn filmed a video at the Iowa State Fair, focusing on President Donald Trump's tax law. The video, featuring Nunn on a John Deere tractor, was shot under the intense August sun. This effort highlights Nunn's support for the tax legislation.",
    "constructiveness_score": 0.174,
    "constructiveness_reason": "2 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Isak's Uncertain Future Impacts Newcastle's Performance, Loss to Villa",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 11:24:11 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Alexander Isak's future has been a huge distraction for Newcastle this summer, and while the team performed well, his absence was costly at Aston Villa."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a1f0e013000724add6fc13/0x0.jpg?width=960",
    "titles": [
      "Newcastle United Sends Clear Alexander Isak Message But Issues Remain"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "Newcastle faced distractions over Alexander Isak's future this summer, impacting their performance. Isak's absence was felt in a costly loss to Aston Villa. The situation highlights the challenges the team faced due to uncertainties surrounding the player.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "European Leaders, Ukrainian President to Discuss Territorial Pressure in US",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 15:42:02 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "www.ft.com"
    ],
    "snippets": [
      "European leaders will join Ukrainian president in US as he comes under pressure to concede territory to Moscow"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F08c02e83-d635-48aa-9429-6321196d6c05.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Zelenskyy to press for ceasefire at Trump meeting"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "European leaders are set to meet with Ukrainian President in the US amid pressure for him to cede territory to Moscow. The visit comes as Ukraine faces increasing pressure from Russia. The outcome of the meeting and any decisions regarding territorial concessions remain uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Singapore PM Prioritizes Job Security Amid Global, AI Challenges",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 17 Aug 2025 14:33:42 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Singapore’s Prime Minister Lawrence Wong said jobs for citizens will be the government’s top priority as the city-state faces risks from rising global trade barriers and artificial intelligence."
    ],
    "image_url": "",
    "titles": [
      "Singapore Prioritizes Jobs Amid Fragmenting World, Rise of AI"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "Singapore's Prime Minister, Lawrence Wong, has declared that securing jobs for citizens is the government's highest priority amid challenges posed by increasing global trade barriers and the advancement of artificial intelligence. This stance reflects the government's commitment to ensuring employment stability for its population in the face of external economic threats and technological disruptions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "A320 Series Set to Become Top-Selling Commercial Airliner",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 14:28:33 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "fortune.com"
    ],
    "snippets": [
      "The A320 series is poised to overtake its US competitor as the most-delivered commercial airliner in history."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2222053327-e1755440530241.jpg?w=2048",
    "titles": [
      "Airbus is about to eclipse a record that Boeing held for decades"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "The A320 series is on track to become the highest-selling commercial airliner, surpassing its US rival. This achievement highlights the popularity and success of the A320 series in the aviation industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 32 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "US Restoration Projects Revive Natural Landscapes Nationwide",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 17 Aug 2025 11:18:51 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "In San Francisco Bay, salt ponds created more than a century ago are reverting to marshland. Along the New York and New Jersey coasts, beaches ravaged by Superstorm Sandy underwent extensive restoration. In Alabama, a rebuilt spit of land is shielding a historic town and providing wildlife habitat."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/coastal-communities-re.jpg",
    "titles": [
      "Coastal communities restoring marshes, dunes, reefs to protect against rising seas and storm surges"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.485,
    "summary": "Across the United States, efforts to restore natural landscapes are underway. In San Francisco Bay, century-old salt ponds are being transformed back into marshland. The coasts of New York and New Jersey, previously damaged by Superstorm Sandy, have seen extensive beach restoration. Meanwhile, in Alabama, a reconstructed spit of land now protects a historic town and serves as a habitat for wildlife. These projects aim to rejuvenate and safeguard natural environments and communities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "UN Plastic Pollution Treaty Talks Stall in Geneva",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 17 Aug 2025 10:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Progress toward a legally binding global treaty on plastics pollution stalled and went into reverse this week. The United Nations Intergovernmental Negotiating Committee meeting in Geneva, Switzerland, ran overtime. It's likely to conclude this evening, without agreement."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/plastic-pollution.jpg",
    "titles": [
      "The global plastics treaty process has fallen flat—here's what went wrong, and how you can help"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "summary": "Efforts to create a global treaty on plastics pollution faced setbacks this week during the United Nations Intergovernmental Negotiating Committee meeting in Geneva, Switzerland. Despite extending the meeting's duration, it is expected to end without reaching an agreement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Criticized for Alignment with Putin at Alaska Meeting",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 13:16:29 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "www.ft.com"
    ],
    "snippets": [
      "Donald Trump’s alignment with Vladimir Putin in Alaska made him look a dupe"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F06ae30fd-67e9-4c9a-9126-df28828de7be.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "An incompetent way to pursue peace in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "During a meeting in Alaska, Donald Trump's apparent alignment with Vladimir Putin led to criticism, with some perceiving Trump as being manipulated or deceived. The interaction raised concerns about Trump's relationship with Putin and its implications. The outcome of the meeting and its impact on their dynamic remains to be seen.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Teenage Engineering did it again",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-17T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Hi, friends! Welcome to Installer No. 94, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, did you hydrate today, and also you can read all the old editions at the Installer homepage.) This week, I'm visiting LinkedIn way too much because of Mini Sudoku, lookin"
    ],
    "image_url": "",
    "titles": [
      "Teenage Engineering did it again"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 5 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA Satellites Uncover New Factor Affecting Weather Patterns",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 11:18:40 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasas-tiny-prefire-satellites-just-uncovered-a-hidden-driver-of-earths-storms/\" rel=\"nofollow\" title=\"NASA’s Tiny PREFIRE Satellites Just Uncovered a Hidden Driver of Earth’s Storms\"><img alt=\"PREFIRE Cubesat Illustration\" class=\"webfeedsFeaturedVisual wp-post-image"
    ],
    "image_url": "",
    "titles": [
      "NASA’s Tiny PREFIRE Satellites Just Uncovered a Hidden Driver of Earth’s Storms"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "NASA's PREFIRE satellites have identified a previously unknown factor influencing Earth's weather patterns. These small satellites revealed that certain atmospheric conditions, not well understood before, play a significant role in the development of storms. This discovery could enhance future weather forecasting and climate models, providing a deeper understanding of Earth's meteorological processes.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Dinosaur Species with Unique Spine Spike Discovered in Arizona",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 17 Aug 2025 08:40:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Researchers report three distinct tanystropheid taxa from the upper Blue Mesa Member of the Chinle Formation in the Petrified Forest National Park in Arizona, including a new genus and species, Akidostropheus oligos, with a distinctive back spike emanating from the spine."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/triassic-freshwater-de.jpg",
    "titles": [
      "Triassic freshwater deposits at Petrified Forest preserve diverse tanystropheids"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.931,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "Researchers discovered three different tanystropheid taxa in Arizona's Petrified Forest National Park, identifying a new genus and species named Akidostropheus oligos. This new species is notable for a unique back spike extending from its spine, found in the Chinle Formation's upper Blue Mesa Member.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA Launches Largest Radar Antenna for Earth Observations",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 10:53:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/full-bloom-nasas-record-breaking-radar-antenna-just-unfurled-in-orbit/\" rel=\"nofollow\" title=\"Full ‘Bloom’: NASA’s Record-Breaking Radar Antenna Just Unfurled in Orbit\"><img alt=\"NISAR Satellite Radar Antenna Reflector\" class=\"webfeedsFeaturedVisual wp-post-image\" h"
    ],
    "image_url": "",
    "titles": [
      "Full ‘Bloom’: NASA’s Record-Breaking Radar Antenna Just Unfurled in Orbit"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.897,
      "consensus": 0.393,
      "constructiveness": 0.065,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "NASA successfully deployed a record-breaking radar antenna in orbit, marking a significant achievement in space technology. This antenna, designed for the NISAR satellite mission, is notable for its size and capability to capture detailed Earth observations. The successful deployment enhances NASA's capacity for monitoring environmental changes and natural phenomena from space, providing valuable data for scientific research and environmental management.",
    "constructiveness_score": 0.065,
    "constructiveness_reason": "1 constructive keywords out of 62 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Why the former editor of Polygon is making a podcast for old gamers",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-17T08:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "In a recent episode of Post Games, host Chris Plante explores how video games can help players understand death. He's interviewing Kaitlin Tremblay, who is working on Ambrosia Sky, a game about death. \"What is it about games that is so useful for exploring the topic?\" Plante asks. \"I think there's s"
    ],
    "image_url": "",
    "titles": [
      "Why the former editor of Polygon is making a podcast for old gamers"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Topological Quantum Systems Challenge Time Evolution Prediction",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 17 Aug 2025 08:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Topological quantum systems are physical systems exhibiting properties that depend on the overall connectivity of their underlying lattice, as opposed to local interactions and their microscopic structure. Predicting the evolution of these systems over time and their long-range quantum correlations "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/predicting-the-topolog.jpg",
    "titles": [
      "Predicting the topological properties of quantum spin liquids using Rydberg atom lattices"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "Topological quantum systems, which show properties based on their lattice connectivity rather than local interactions, challenge researchers in predicting their time evolution and long-range quantum correlations. These systems' unique characteristics underscore the complexity of quantum physics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/atom.svg",
      "thumbnail": "icons/atom.svg",
      "alt": "quantum",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The one feature that keeps me from recommending flip phones",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-17T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "How it started I carry a lot of different phones around, and I rarely get questions about them because most people stopped talking about which phone they own around 2017. I could be using an unreleased iPhone 18 Pro Max Air Ultra to pay for my coffee and nobody would raise an eyebrow (present compan"
    ],
    "image_url": "",
    "titles": [
      "The one feature that keeps me from recommending flip phones"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Electric Constant Key to Universe's Structure and Stability",
    "domain": "science",
    "source_domain": "www.wired.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 11:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "www.wired.com"
    ],
    "snippets": [
      "The force between electrical charges is kind of a big deal—without it, the universe would be a primordial soup and you would not exist. That force is determined by the electric constant."
    ],
    "image_url": "https://media.wired.com/photos/689e4458cde3276d15ebd4e8/master/pass/science_electricity_getty.jpg",
    "titles": [
      "What Is the Electric Constant and Why Should You Care?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.899,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "The electric constant is crucial as it dictates the force between electrical charges. This fundamental force is essential for the structure and stability of the universe, preventing it from devolving into a chaotic state. Without this force, complex structures, including life itself, would not be possible.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Myanmar Earthquake Sparks California Seismic Concerns",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sun, 17 Aug 2025 10:28:13 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-mega-quake-shocked-myanmar-could-california-be-next/\" rel=\"nofollow\" title=\"A Mega-Quake Shocked Myanmar. Could California Be Next?\"><img alt=\"Seismic Activity Earthquake California Map\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitec"
    ],
    "image_url": "",
    "titles": [
      "A Mega-Quake Shocked Myanmar. Could California Be Next?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary": "A significant earthquake recently struck Myanmar, prompting discussions about the potential for a similar seismic event in California due to its fault lines. However, the current status or predictions for California were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI-powered stuffed animals are coming for your kids",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:39:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Do A.I. chatbots packaged inside cute-looking plushies offer a viable alternative to screen time for kids? Maybe not."
    ],
    "image_url": "",
    "titles": [
      "AI-powered stuffed animals are coming for your kids"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.653,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.426,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Judge says FTC investigation into Media Matters ‘should alarm all Americans’",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 20:32:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "A federal judge has blocked the FTC's investigation into Media Matters research around advertising and antisemitic content on X."
    ],
    "image_url": "",
    "titles": [
      "Judge says FTC investigation into Media Matters ‘should alarm all Americans’"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.665,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Celebrating 50 years of The Rocky Horror Picture Show",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:26:22 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "\"It's had a profound impact on our culture, especially on people who've felt different and marginalized.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/horrorTOP-1152x648-1754745307.jpg",
    "titles": [
      "Celebrating 50 years of The Rocky Horror Picture Show"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.65,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 17:50:31 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "The good news is that, for now, Erin appears unlikely to directly strike land."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1-1152x648.jpg",
    "titles": [
      "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.629,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.414,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]