[
  {
    "title": "2025 Nobel Prize in Physics Awarded for Quantum Tech Advances",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 06:17:37 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "NPR",
      "Al Jazeera",
      "New Scientist"
    ],
    "domains": [
      "www.npr.org",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "The Nobel committee said that the laureates' work provides opportunities to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.\"",
      "The announcement was made by the Royal Swedish Academy of Sciences in Stockholm.",
      "Quantum mechanics is the &#039;foundation of all digital technology&#039;, notes the chair of the Nobel Committee for Physics.",
      "John Clarke, Michel Devoret and John Martinis have won the 2025 physics Nobel Prize for their work in quantum mechanics. It is the second Nobel Prize to be awarded this year.",
      "The 2025 Nobel prize in physics has gone to John Clarke, Michel Devoret and John Martinis, whose work has led to the development of today's quantum computers"
    ],
    "image_url": "",
    "titles": [
      "The Nobel Prize for physics is awarded for discoveries in quantum mechanical tunneling",
      "Physics Nobel awarded to three scientists for work on quantum computing",
      "Nobel Prize in Physics awarded to trio for quantum mechanics discoveries",
      "Nobel Prize in physics goes to US-based trio for discoveries in quantum mechanics",
      "Nobel prize for physics goes to trio behind quantum computing chips"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.884,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "John Clarke, Michel Devoret, and John Martinis were awarded the 2025 Nobel Prize in Physics for their pioneering work in quantum mechanics, specifically advancing the development of quantum technology, including quantum computers, cryptography, and sensors. Their research has been crucial in demonstrating how quantum mechanics' properties can have practical applications in technology. The Royal Swedish Academy of Sciences in Stockholm announced the award, highlighting the trio's contributions as foundational to digital technology's future.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Reviews State Power on Conversion Therapy Bans",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The case pits conservative Christian groups against the LGBTQ+ community.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOeFV5Q0JvZFFfYmdGV1hpd0VWdTBhTXpQU3gwaVZyMWxVQ1A4ejVHc21fbFhnTVR3OFE1ZlVUOTcxakRVWHdqOVBlUnMzMUhBZzRoVzJEa1paWUhsRnRFa1BTMmtPXzZIbEprQ1M1WjdmYUVXZHBtakFWaG5zQTVRVDA1cE9mSHc?oc=5\" target=\"_blank\">Supreme Court weighs case on conversion ther",
      "The case considers whether states can “[censor] certain conversations between counselors and their clients based on the viewpoints expressed.”"
    ],
    "image_url": "",
    "titles": [
      "The Supreme Court weighs conversion therapy in a case from Colorado",
      "Supreme Court weighs case on conversion therapy for youth - Axios",
      "Will Supreme Court Overturn LGBTQ Conversion Therapy Bans? What To Know As Justices Hear Case Today."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.86,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Supreme Court is reviewing a case that examines if states have the authority to regulate conversations between counselors and clients, specifically focusing on the legality of conversion therapy bans. This case has ignited a conflict between conservative Christian groups and the LGBTQ+ community, with significant implications for both freedom of speech and the rights of LGBTQ+ individuals. The outcome is pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario Premier Ford Rejects Mayors' Plea to Keep Speed Cameras",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 07 Oct 2025 15:51:44 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Replying to a letter sent last week asking for changes to how speed cameras operate instead of an all-out ban, Ford repeated his claim the program is a 'cash grab.'",
      "Premier Doug Ford has doubled down on his government&#8217;s plan to ban municipal speed cameras across Ontario, rejecting appeals from Brampton Mayor Patrick Brown and Burlington Mayor Marianne Meed Ward to preserve the programs. In a sharply worded letter sent to both mayors, Ford dismissed the de"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/CP175086208.jpg?quality=65&strip=all",
    "titles": [
      "‘The answer is no’: Ford rejects plea from mayors to save, alter Ontario’s speed cameras",
      "‘Cash grabs, pure and simple’: Ford rebuffs mayors’ plea to keep speed cameras"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ontario Premier Doug Ford has reaffirmed his stance to ban municipal speed cameras, dismissing appeals from Brampton Mayor Patrick Brown and Burlington Mayor Marianne Meed Ward to keep the programs. Ford labeled the speed camera program a \"cash grab\" in response to a letter from the mayors requesting modifications to the program rather than an outright ban.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oklahoma QB John Mateer Eyes Return Against Texas, ESPN Reports",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 11:46:01 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "soonerswire.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "Oklahoma quarterback John Mateer is pushing to return for Saturday's game against Texas, sources told ESPN.",
      "According to a report from Pete Thamel of ESPN, Oklahoma quarterback John Mateer is pushing to return this Saturday vs. Texas."
    ],
    "image_url": "",
    "titles": [
      "Sources: OU's Mateer pushing to play vs. Texas",
      "REPORT: Oklahoma QB John Mateer pushing to play against Texas Longhorns"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oklahoma quarterback John Mateer is aiming to make a comeback for Saturday's game against Texas, as per sources. A report by Pete Thamel of ESPN confirms Mateer's efforts to return to the field this weekend.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool's Season Hinges on Salah's Form Amid Uncertainty",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 11:54:29 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "There is a lot of uncertainty around this new-look Liverpool side right now, but one thing we know for sure: if Salah doesn't play like himself soon, nothing else matters.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPNm10M0t1dEZEb1JVeDBVRndSZk1ZanRvYUlYaDl4NFhDcXV6dzktcWRhajJGZTFSQmxxcVU3VE1mMVE4cm9tNEhkU2lXWXlCQXktZlBOYlZvbkxhYTgycEhTbVMyT0V2ZE1GQ1JwemdnQndmdGxVM0FvdWlPc2FWNjByU2g3dw?oc=5\" target=\"_blank\">Wayne Rooney Takes Swipe at Mohamed Salah Ami"
    ],
    "image_url": "",
    "titles": [
      "Is it time to worry about Mohamed Salah at Liverpool?",
      "Wayne Rooney Takes Swipe at Mohamed Salah Amid Liverpool Woes - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Uncertainty surrounds Liverpool's current performance, with a consensus that Mohamed Salah's form is crucial for the team's success. The outcome of Liverpool's season is seen as heavily dependent on Salah's ability to play at his best.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Illinois Sues Trump Administration Over National Guard Deployment",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 06:48:42 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "NPR's Steve Inskeep speaks with Illinois Attorney General Kwame Raoul about President Trump's efforts to deploy National Guard forces to Chicago, over state and local objections.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUVhfLTJLLVpld2FXbFlueVlESHZzUGpmNkt4SXlCaHJ4cFFXZTVpWE54d3FwdVBEaG50eFB1TTZEamh5MFozUS15VFBWa2xoR0d3NG54TzZnS3VvYVFTck9xRVVJMmNVTi05Rl9kOUpRQ1NXU1BoTWF2THZ1VVRvNElfc0VkcFM3?oc=5\" target=\"_blank\">Illinois sues Trump over National Guard dep",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQSU83ZkFnMmR4eDlDN2l1Rk1DbVNjclFRaHM4VWZWcG1UWUJkbERQTE13MDBHTWVNRFRDcE1tWTc3NGx2TFJJTHRHN2pGQXROZ3FzR2I5Ny13eGpHSkZwVnBnOTA0YXU2bl9NUDdCbGtYZzRoS1Rvb05MMGVWYVJqQjRRNTJ1aUpIZG9WRFRaN3o?oc=5\" target=\"_blank\">Judge temporarily blocks Trump f"
    ],
    "image_url": "",
    "titles": [
      "Illinois AG responds to Trump's push to send National Guard to Chicago",
      "Illinois sues Trump over National Guard deployment to Chicago - Axios",
      "Judge temporarily blocks Trump from any sending National Guard troops to Oregon - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Illinois has filed a lawsuit against the Trump administration, challenging the decision to deploy National Guard troops to the state, labeling it \"unlawful and unconstitutional.\" The suit argues against the federalization of the Illinois National Guard and the deployment of out-of-state guard members, including those from Texas, claiming it threatens citizens with \"military occupation.\" A judge has temporarily blocked the Trump administration's move. California's Governor, Gavin Newsom, criticized the use of the military as political tools and announced intentions to sue as well.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jayson Tatum Supports Duke Basketball Program",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 14:41:38 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Tatum starred for the Blue Devils in 2016-17",
      "<p>Duke is getting help from former Blue Devils player and Boston Celtics star Jayson Tatum.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/bd63af14-5b5b-4f19-aabf-df0499a8127c/jayson-tatum-celtics-duke.jpg",
    "titles": [
      "Celtics' Jayson Tatum named Duke men's basketball 'chief basketball officer'",
      "Celtics’ Jayson Tatum named Duke’s chief basketball officer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jayson Tatum, a former Duke Blue Devils player and current Boston Celtics star, is contributing support to the Duke basketball program. Tatum played for Duke in the 2016-17 season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gold Futures Hit Record $4,000 Amid US Shutdown",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 10:46:33 -0400",
    "source": "Forbes",
    "sources": [
      "Financial Post",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "financialpost.com"
    ],
    "snippets": [
      "One economist recommended investors store wealth in the precious metal as an economic haven, while others warned of uncertainty.",
      "NEW YORK (AP) &#8212; Gold futures have soared above $4,000 per troy ounce for the first time, as many investors seek a &#8220;safe haven&#8221; to park their money as the U.S. government shutdown continues. Gold futures in New York jumped above the $4,000 mark Tuesday morning, marking a record high"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e51d620304086e7a13acbf/0x0.jpg?width=960&precrop=3392%2C1907%2Cx0%2Cy137",
    "titles": [
      "Gold Hits $4,000 For The First Time—Here’s Why",
      "Gold futures rise above $4,000 per ounce for the first time"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gold futures in New York surpassed $4,000 per troy ounce, a record high, as investors turned to the precious metal as a safe haven amid the ongoing U.S. government shutdown. This surge reflects mixed views among economists, with some recommending gold as a stable investment, while others caution about its uncertainty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Commemorates 2nd Anniversary of Hamas Attacks Amid Ceasefire Talks",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:37:35 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Israelis gather to commemorate the second anniversary of the Hamas-led attack in which 1,200 people were killed</p><p></p><p><em>Deborah Cole</em> <em>is Berlin correspondent for the Guardian</em></p><p>Germany marked the two-year anniversary of the 7 October attacks with sombre commemorations ac",
      "<p>Commemorations held in kibbutzim whose members were killed or kidnapped as Tel Aviv rally to call for hostages’ release</p><p>Israelis gathered across the country on Tuesday to mark the second anniversary of the 7 October attack, in which Hamas-led militants killed about 1,200 people and took 251",
      "Israelis commemorated the second anniversary of the Hamas-led attacks on southern Israel as fighting continued. Ceasefire negotiations are ongoing in Egypt."
    ],
    "image_url": "https://i.guim.co.uk/img/media/88f96cf76ce349adfdc52cdcd4d2cb2f1eb2e7e4/1108_250_6296_5037/master/6296.jpg?width=140&quality=85&auto=format&fit=max&s=b34712776c93a81665b4d31b0caaf307",
    "titles": [
      "Israel marks two years since 7 October Hamas attack as Gaza ceasefire talks continue – live",
      "Israelis gather to mark two years since 7 October Hamas attack that killed 1,200",
      "‘Enough.’ Israel marks 2 years since Oct. 7, with sounds of war from Gaza"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israelis marked the second anniversary of the Hamas-led attacks on 7 October, which resulted in approximately 1,200 deaths and 251 kidnappings. Commemorations took place across the country, including rallies in Tel Aviv advocating for the release of hostages still held in Gaza. Concurrently, ceasefire negotiations are underway in Egypt as fighting persists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Ongoing Trauma Marks 2 Years Since Israel-Gaza Conflict Escalation\"",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 14:10:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The trauma of the Hamas-led attacks on Israel continues to define and justify its bombing of Gaza, analysts say.",
      "Al Jazeera’s Ibrahim al-Khalili reflects on the two years since Israel’s war on Gaza began.",
      "In the two years since Hamas militants attacked Israel, we’ve interviewed more than 700 people in Gaza. Their stories stayed with us. So we tried to find them again."
    ],
    "image_url": "",
    "titles": [
      "Israel is fractured, isolated after two years of its war on Gaza: Analysts",
      "Al Jazeera reporter reflects on two years of war in Gaza",
      "What People in Gaza Told Us About Two Years of War"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two years after Hamas militants attacked Israel, prompting Israel to bomb Gaza, the trauma continues to impact both regions. Al Jazeera's Ibrahim al-Khalili highlights the ongoing effects, noting over 700 interviews conducted in Gaza to revisit the individuals affected. This period marks a significant chapter in the Israel-Gaza conflict, underscoring the lasting consequences of the warfare.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 6: 15 Games Highlighted; NHL 2025-26 Predictions Released",
    "domain": "sports",
    "source_domain": "thelistwire.usatoday.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 15:53:44 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "thelistwire.usatoday.com"
    ],
    "snippets": [
      "There are 15 games in Week 6 of the NFL season. There is one that sticks out as the worst but what is the best?",
      "<p>As a new season begins, we polled 19 Sportsnet NHL contributors for their predictions on how 2025-26 will play out. </p>"
    ],
    "image_url": "",
    "titles": [
      "NFL schedule rankings and predictions for Week 6 of 2025 season",
      "Sportsnet NHL Insider predictions for 2025-26 season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 6 of the NFL season features 15 games, with discussions around the best and worst matchups. Meanwhile, 19 Sportsnet NHL contributors have made predictions for the 2025-26 season as it kicks off.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Football: Drop or Target Players Amid NFL Injuries",
    "domain": "business",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 15:55:43 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Here are some players you can let drop onto the fantasy football waiver wire going into Week 6.",
      "From Cam Ward to Michael Carter, here are five fantasy football sleepers worth targeting for Week 6 as injuries continue to be an issue across the NFL."
    ],
    "image_url": "",
    "titles": [
      "Fantasy Football Waiver Wire: Players to drop for your Week 6 pickups",
      "Week 6 Fantasy Football Sleepers: 5 Players You Should Target"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "For Week 6 of the fantasy football season, certain players are recommended to be dropped, while others like Cam Ward and Michael Carter are highlighted as valuable sleepers to target. This advice comes in response to ongoing injury challenges within the NFL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pope Leo XIV to Appeal for Middle East Peace, Address Muslims and Christians",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 13:20:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Pontiff expected to appeal for peace in Middle East and address the region&#039;s Muslims and Christians.",
      "The choice signals that Pope Leo XIV aims to press for peace in the Middle East and show support for Christians in the region."
    ],
    "image_url": "",
    "titles": [
      "Pope Leo plans symbolic debut foreign trips to Turkiye and Lebanon",
      "Pope Leo to Visit Lebanon and Turkey"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pope Leo XIV is expected to appeal for peace in the Middle East and address both Muslims and Christians in the region. This move indicates his intention to advocate for peace and support the Christian community there.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mayor-Elect of Herdecke Stabbed; Chancellor Condemns Attack",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:31:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Chancellor Friedrich Merz condemns &#039;heinous attack&#039; after Iris Stalzer, mayor-elect of Herdecke, stabbed.",
      "Iris Stalzer, the incoming mayor of Herdecke, was found stabbed in her home, officials said. It was initially unclear whether it had been a targeted attack."
    ],
    "image_url": "",
    "titles": [
      "German mayor-elect gravely wounded in stabbing attack",
      "Mayor-Elect in Critical Condition After Stabbing in Western Germany"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Iris Stalzer, the mayor-elect of Herdecke, was stabbed in her home. Chancellor Friedrich Merz condemned the attack as heinous. The motive behind the stabbing is currently unclear, including whether it was a targeted attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LeBron James' Tease Leads to Lakers Ticket Spike, Ends as Ad Reveal",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 15:20:22 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "LeBron's tease for what ended up just being an ad got NBA fans stirred up this week",
      "Ticket prices for the Lakers' final home game of the season skyrocketed after LeBron teased a second decision, but it was an ad."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/f26235f4-44ed-4412-b5d4-c9983f79503b/lebron-james-getty-13.png",
    "titles": [
      "No, LeBron James has not announced his retirement with 'Second Decision' video",
      "Gotcha! LeBron James' second decision teaser turns out to be an ad"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "LeBron James caused a stir among NBA fans by teasing a significant announcement, which led to a spike in ticket prices for the Lakers' final home game. However, it turned out to be merely an advertisement, not a major career decision as speculated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon's Prime Big Deal Days Sale Offers Discounts on Top Tech",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T10:52:46-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon’s October Prime Day sale (aka Prime Big Deal Days) is finally here, and we’ve collected the best deals we could find on everything from noise-canceling headphones and robot vacuums to 4K OLED TVs. The majority of our recommendations have been thoroughly tested by&#160;Verge&#160;writers and e",
      "The day has finally come for a home theater overhaul. Perhaps you’re looking for a low-cost replacement that offers more features and a sharper design. Or, maybe your gaze is set upon massive OLED TVs with all the fixings. Regardless, Prime Big Deal Days sale is here, with deals from noteworthy TV m",
      "We've got deals on keyboards, laptops, accessories, and all kinds of stuff!"
    ],
    "image_url": "",
    "titles": [
      "The 162 best October Prime Day deals",
      "The best October Prime Day deals on TVs, soundbars, and more",
      "It’s Prime Day 2025 part two, and here are the best deals we could find"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days sale is currently underway, offering significant discounts on a wide range of products, including noise-canceling headphones, robot vacuums, 4K OLED TVs, laptops, keyboards, and various accessories. Many items on sale have been tested and recommended by Verge writers, ensuring quality picks for consumers looking to upgrade their tech and home theater setups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Meets Carney at White House, Trade and Security Discussed",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 12:43:35 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "President Trump on Tuesday is hosting Prime Minister Mark Carney of Canada, who is seeking relief from U.S. tariffs. Few people expect any major concessions.",
      "WASHINGTON — Prime Minister Mark Carney has arrived at the White House to meet with U.S. President Donald Trump to discuss trade and security. Trump indicated in advance of the meeting he&#8217;s still committed to his goals of drawing business from Canada and other nations and realigning global tra"
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/09/multimedia/carney-trump-wtk/00int-canada-trump-explainer-tqvm-mediumSquareAt3X.jpg",
    "titles": [
      "What to Know About Carney and Trump’s White House Meeting",
      "CP NewsAlert: Carney arrives at White House for meeting with Trump"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump met with Canadian Prime Minister Mark Carney at the White House to discuss trade and security. Despite Carney seeking relief from U.S. tariffs, few expect major concessions. Trump remains focused on drawing business from Canada and realigning global trade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Raducanu Retires from Wuhan Open Match; Alexandrova Defeats Mboko",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 14:53:28 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>Raducanu retires when trailing 6-1, 4-1 to Ann Li</p></li><li><p>Novak Djokovic vomits on court but wins in Shanghai</p></li></ul><p>Emma Raducanu’s brutal run of form and luck in Asia continued at the Wuhan Open as she retired because of illness from her first-round match at the WTA 1000",
      "Emma Raducanu retired from her first-round match at the Wuhan Open against Ann Li as she struggled with the humid conditions."
    ],
    "image_url": "https://i.guim.co.uk/img/media/36419b24f09d6b1997d48661ed127252fe74d597/150_0_2500_2001/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=e36c0bac8a3d6cf254ad049387420590",
    "titles": [
      "Listless Raducanu retires from first-round match at stiflingly hot Wuhan Open",
      "Raducanu retires from Wuhan Open first round"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Emma Raducanu retired from her Wuhan Open first-round match against Ann Li, trailing 6-1, 4-1, after struggling with hot and humid conditions and taking a medical timeout. The British number one looked devoid of energy throughout the match. In another match, Canada's Victoria Mboko was defeated by Russia's Ekaterina Alexandrova with scores of 6-3, 6-2.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Intercontinental Invests $2B in Polymarket, Stock Rises 3% in Premarket",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 14:38:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Intercontinental Exchange rose more than 3% in the premarket after the company announced it took a $2 billion stake in prediction markets platform Polymarket.",
      "Intercontinental Exchange to invest up to $2 billion in Polymarket, the prediction-market company founded by Shayne Coplan."
    ],
    "image_url": "",
    "titles": [
      "NYSE-owner Intercontinental Exchange rises after it takes $2 billion stake in Polymarket",
      "NYSE owner dives into prediction markets with $2 billion Polymarket investment"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Intercontinental Exchange announced a $2 billion investment in Polymarket, a prediction markets platform founded by Shayne Coplan. Following the announcement, Intercontinental's stock rose over 3% in premarket trading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Freedom Convoy Leaders Lich, Barber to Receive Sentencing Today\"",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Tue, 07 Oct 2025 13:29:08 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "ottawacitizen.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The two are expected in the Ottawa courthouse on Elgin Street after sentencing hearings in July.",
      "&#8220;Freedom Convoy&#8221; leaders Tamara Lich and Chris Barber are expected to learn their sentences today nearly four years after the protest movement that blockaded downtown Ottawa for several weeks. In April, both Lich and Barber were found guilty of mischief, while Barber was also found guilt"
    ],
    "image_url": "",
    "titles": [
      "Convoy leaders Tamara Lich and Chris Barber to be sentenced Tuesday",
      "Convoy leaders Lich, Barber to be sentenced for mischief from 2022 trucker protest"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tamara Lich and Chris Barber, leaders of the \"Freedom Convoy\" protest that blockaded downtown Ottawa for several weeks nearly four years ago, are set to receive their sentences today. Both were found guilty of mischief in April, with Barber also convicted of an additional charge. Their sentencing hearings took place in July, and they are expected at the Ottawa courthouse on Elgin Street for the announcement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trilogy Metals Shares Surge 225% After White House Invests",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 14:36:40 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Shares of U.S.-listed Trilogy Metals surged more than 225% on Tuesday, shortly after the White House said it would take a 10% stake in the Canadian company.",
      "The deal reverses the Biden administration’s earlier rejection of an Alaskan mining project."
    ],
    "image_url": "",
    "titles": [
      "Trilogy Metals shares soar over 200% after U.S. takes stake in minerals explorer",
      "Trilogy Metals Shares Skyrocket 260% As Trump Says U.S. Acquires Stake"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shares of Trilogy Metals, a Canadian company, soared over 225% after the White House announced a 10% investment. This move marks a reversal of the Biden administration's previous denial of an Alaskan mining project involving the company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FIFA Sanctions Malaysia for Fielding Ineligible Players in AFC Qualifier",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 13:16:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "FIFA cited falsified or doctored documentation in sanctioning Malaysia football for breaches in an AFC qualifier.",
      "Malaysia found seven new ringers for a 4-0 win against Vietnam. But FIFA says it was too good to be true, alleging \"cheating,\" because none had the Malaysian-born grandparent they would need to play for the country."
    ],
    "image_url": "",
    "titles": [
      "Malaysia football federation to fight FIFA sanctions for cheating claims",
      "Malaysian football to dispute FIFA 'cheating' allegations"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "FIFA sanctioned Malaysia's football team for using falsified documents to include seven ineligible players, based on a false claim of Malaysian ancestry, in a 4-0 win against Vietnam in an AFC qualifier. This breach of rules led to allegations of cheating by FIFA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gerrard Admits to \"Hating\" England Duty Over Team Egos",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:27:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Former England captain Steven Gerrard says he sometimes \"hated\" being on international duty and blames a lack of success with the Three Lions on key players being \"egotistical losers\".",
      "Former England captain Steven Gerrard says he sometimes &quot;hated&quot; being on international duty and blames a lack of success with the Three Lions on key players being &quot;egotistical losers&quot;."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/484c/live/ae1954d0-a38c-11f0-96cf-a52f331e209a.jpg",
    "titles": [
      "England's Golden Generation were 'egotistical losers' - Gerrard",
      "England's Golden Generation were 'egotistical losers' - Gerrard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Steven Gerrard, former England captain, expressed that he occasionally \"hated\" his international duties, attributing the national team's lack of success to the egoistic attitudes of some key players.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Met Police Dismantle Gang Behind 40,000 Phone Thefts, Smuggling to China",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 08:26:08 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Verge"
    ],
    "domains": [
      "www.bbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "BBC News is given access to what the Met Police says is the UK's largest operation against mobile phone thefts.",
      "An international gang suspected of smuggling up to 40,000 stolen phones from the UK to China over the past 12 months has been dismantled by police in London. The criminal network is allegedly responsible for up to 40 percent of all phones stolen in the city during this period, according to the Metro"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed69/live/658700f0-a346-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "One iPhone led police to gang suspected of sending up to 40,000 stolen UK phones to China",
      "Police bust gang suspected of stealing 40,000 phones"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Met Police conducted the UK's largest operation against mobile phone thefts, dismantling an international gang accused of smuggling 40,000 stolen phones to China over the past year. This gang was allegedly responsible for 40% of all phone thefts in London, as reported by the BBC News and Metro.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Memo: Furloughed Workers May Need New Law for Back Pay",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 09:58:13 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "Axios"
    ],
    "domains": [
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQeTdNcElLQ2hOX1pDXzdzZktyX2t2M2lheUM5YlMxZ0sxODRybHJWMXpaeW1OU3EzbWp4ZFRhYjcwV0lYY1lsTkhDdEtpeGx3Z2FTM3RJMUpPRUJ0MTZsYVlJMUtxU2pucWlLbXBtY1NPRWNDODZjNDlkdXZjd1hxUWRYRjQ?oc=5\" target=\"_blank\">Scoop: White House memo says furloughed federal ",
      "A draft White House memo says furloughed federal workers aren't automatically entitled to back pay, and Congress may have to pass a law to grant it."
    ],
    "image_url": "",
    "titles": [
      "Scoop: White House memo says furloughed federal workers aren't entitled to back pay - Axios",
      "Trump administration argues furloughed federal workers aren't guaranteed back pay"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A draft memo from the White House indicates that furloughed federal employees may not automatically receive back pay for the period they were not working. It suggests that new legislation from Congress would be required to authorize such payments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Enables App Creation Inside ChatGPT Conversations",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 05:57:18 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
      "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches new feature to integrate third-party apps - Axios",
      "OpenAI launches apps inside of ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.791,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI has introduced a feature allowing developers to create apps within ChatGPT conversations. This new integration aims to enhance user experience and functionality within the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Freakier Friday\" and \"The Conjuring: Last Rites\" Now Streaming",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 09:45:46 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Disney’s \"Freakier Friday\" has finally arrived on streaming. Here's how to watch the sequel starring Lindsay Lohan and Jamie Lee Curtis at home for your next movie night.",
      "\"The Conjuring: Last Rites,\" the highest-grossing horror movie of 2025, is now streaming just in time for spooky season. Here’s how to watch the franchise’s final film at home."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e29d67e629b58bdb04226c/0x0.jpg?width=960",
    "titles": [
      "‘Freakier Friday’ Is Now Streaming—How To Watch The Nostalgic Sequel Home",
      "‘The Conjuring: Last Rites’ Is Now Streaming—How To Watch The Horror Hit At Home"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.95,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney's sequel \"Freakier Friday,\" featuring Lindsay Lohan and Jamie Lee Curtis, is now available for streaming. Additionally, \"The Conjuring: Last Rites,\" the top-grossing horror film of 2025, has also been released for home viewing in time for the spooky season. Both films offer options for viewers seeking entertainment at home.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches October Prime Day Sale with Top Deals on Tech and More",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T09:49:08-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Editor’s note:&#160;Amazon’s October Prime Day sale is&#160;officially underway. If you’re looking to make the most of the two-day shopping event, we’ve put together a guide to the&#160;best Prime Day&#160;deals&#160;you can get. There are no bad iPads. That’s the best news about Apple’s tablet line",
      "Editor’s note:&#160;Amazon’s October Prime Day sale is&#160;officially underway.&#160;If you’re looking to make the most of the two-day shopping event, we’ve put together a guide to the&#160;best Prime Day deals&#160;you can get. Robot vacuums that can both mop and sweep your floors have improved si"
    ],
    "image_url": "",
    "titles": [
      "The best iPad to buy",
      "The best robot vacuum and mop to buy right now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.951,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's October Prime Day sale has begun, offering a two-day shopping event with significant deals. The sale includes a variety of products, with highlighted improvements in robot vacuums that can mop and sweep floors. A guide to the best Prime Day deals is available for shoppers looking to maximize their savings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Slashes Steel Import Quotas by 47%, Impacting UK and Others",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 15:46:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "The European Union unveiled fresh tariffs on Tuesday meant to shield its ailing steel sector, taking a page from Donald Trump’s protectionist playbook.",
      "BRUSSELS (AP) &#8212; The European Union proposed Tuesday cutting free-trade quotas by 47% on steel and steel products, effectively adding large tariffs on imports from countries like China, India, Turkey, and the United Kingdom, which said the measures would wreck the British steel industry. After "
    ],
    "image_url": "",
    "titles": [
      "EU Boosts Steel Protections With 50% Levy to Sustain Industry",
      "EU proposes steel industry protections, rattling UK manufacturers"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.991,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.441,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The European Union introduced new tariffs on steel imports, reducing free-trade quotas by 47% to protect its steel sector. This move affects imports from countries including China, India, Turkey, and the UK, with the UK warning that these measures could severely damage its steel industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]