[
  {
    "title": "Crystal Palace Debuts in Europe, Faces Liverpool in Community Shield 2025",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 12:02:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "The Guardian",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Palace will play in European competition for the first time this season, a reward for winning the FA Cup in May",
      "Mohamed SalahThe official lineups for the Community Shield have been announced. Mohamed Salah and Hugo Ekitike are in the starting eleven.Liverpool kick off their 2025-2026 season this Sunday. The Red...",
      "<ul><li><p>Minute-by-minute updates on the action at Wembley</p></li><li><p><a href=\"https://www.theguardian.com/football/2025/aug/10/minutes-silence-for-diogo-jota-cut-short-at-wembley-before-community-shield-liverpool-crystal-palace\">Silence for Jota cut short</a> | <a href=\"https://www.theguardia",
      "<p>FA Cup winners Crystal Palace face Premier League champions Liverpool in the Community Shield. Watch the match live on Sportsnet and Sportsnet+ starting at 10:00 a.m. ET / 7 a.m. PT.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/08/dc5e352c-6771-45ec-b30d-1ffe75f9f333/untitled-design-85.png",
    "titles": [
      "Where to watch Liverpool vs. Crystal Palace: Community Shield live stream, start time, how to watch",
      "Community Shield: Salah and Ekitike start against Crystal Palace",
      "Crystal Palace v Liverpool: Community Shield – live",
      "FA Community Shield on Sportsnet: Liverpool vs. Crystal Palace"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.919,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary": "Crystal Palace, having won the FA Cup in May, will compete in European competition for the first time this season. They face Premier League champions Liverpool in the Community Shield. The match features Mohamed Salah and Hugo Ekitike in the starting lineup for Liverpool, marking the start of their 2025-2026 season. The game is broadcast live on Sportsnet and Sportsnet+ and includes a moment of silence for Diogo Jota, which was cut short.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens"
  },
  {
    "title": "Two Japanese Boxers Die from Injuries After Tokyo Fights",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 10 Aug 2025 07:11:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "ESPN",
      "Deutsche Welle"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "A second Japanese boxer has died from brain injuries suffered during separate bouts at the same event in Tokyo.",
      "The Japanese athletes, both 28 years old, were rushed into emergency surgery after competing in separate bouts on August 2.",
      "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa have died following brain injuries sustained while competing on the same card, although in different fights, at Korakuen Hall in Tokyo on Aug. 2.",
      "Hiromasa Urakawa has become the second boxer to die from brain injuries sustained at the same event in Tokyo."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10e5/live/e558b8e0-75b6-11f0-b3ef-cdf59e28b2a4.jpg",
    "titles": [
      "Second boxer dies from brain injury after Tokyo event",
      "Japan: Two boxers die from brain injuries at Tokyo event",
      "2 Japanese boxers die after injuries on same card",
      "Two boxers die after competing at same event in Japan"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.813,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary": "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa died following brain injuries from separate fights at an event in Tokyo's Korakuen Hall on August 2. Their deaths occurred days apart after competing on the same card. This tragic outcome has been confirmed by boxing associations and media reports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "NFL Rookies, Free Agents Scrutinized in Preseason Week; Hunter Debuts",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 00:31:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "How did rookies and top free agent acquisitions fare in the NFL's first full preseason week?",
      "The two-way Colorado star took his first NFL snaps Saturday",
      "<p>Travis Hunter’s professional debut included 10 snaps on offence, eight on defence and no highlights.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL preseason Week 1 takeaways: Travis Hunter sees action at WR and CB in Jaguars debut",
      "Here's exactly how the Jaguars used Travis Hunter in the rookie's NFL preseason debut against the Steelers",
      "Travis Hunter plays offence, defence in pro debut as Jaguars lose to Steelers"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.786,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.724,
    "summary": "Rookies and top free agent acquisitions in the NFL's first full preseason week were closely watched. Travis Hunter, a two-way Colorado star, made his professional debut with 10 snaps on offense, eight on defense, but had no standout moments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "Critics Slam Canada's Handling of AI-Generated Hate Content",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 15:38:49 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Experts and advocates say Canadian rules aren't keeping up with the pace of hateful artificial intelligence-generated content, nor adequately addressing the safety risks.",
      "At first it appears to be a quirky video clip generated by artificial intelligence to make people laugh. In it, a hairy Bigfoot wearing a cowboy hat and a vest emblazoned with the American flag sits behind the wheel of a pickup truck. “We are going today to the LGBT parade,” the apelike creature say"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/16f55776a265c7867cd2c5ee9fbc460a438a270cfa324e9a51a9f87a9aca8db9.jpg?quality=65&strip=all",
    "titles": [
      "Concerns grow as AI-generated videos spread hate, racism online: ‘No safety rules’",
      "‘No safety rules’: Concerns grow as AI-generated videos spread hate online"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.99,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.708,
    "summary": "Experts and advocates criticize Canadian regulations for not adequately addressing the rapid growth of hateful AI-generated content, exemplified by a video featuring a Bigfoot character making derogatory comments about the LGBT community. This highlights the need for updated policies to manage safety risks associated with such content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "NASCAR Leader Zilisch Breaks Collarbone in Victory Lane Fall",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 11:12:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "NASCAR Xfinity Series points leader Connor Zilisch broke his collarbone after a hard fall in Victory Lane at Watkins Glen International.",
      "Zilisch landed hard on the ground during the fall, but later said everything was OK beyond the broken bone"
    ],
    "image_url": "",
    "titles": [
      "Zilisch breaks collarbone in scary Victory Lane fall",
      "Connor Zilisch suffers broken collarbone after falling off his car in Victory Lane after NASCAR Xfinity race"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.982,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary": "NASCAR Xfinity Series points leader Connor Zilisch suffered a broken collarbone after falling in Victory Lane at Watkins Glen International. Despite the hard landing, Zilisch reassured that he was okay apart from the broken bone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens"
  },
  {
    "title": "Ukrainian Drones Strike Major Refinery in Russia's Saratov Region",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:43:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Drones launched by Kyiv are targeting deeper into Russian territory than in past, Al Jazeera&#039;s correspondent reports.",
      "Ukraine’s General Staff said it made a successful drone strike early Sunday on a major refinery in the Saratov region, the latest in a series of attacks this month on Russian oil facilities."
    ],
    "image_url": "",
    "titles": [
      "Ukraine says it hit Russian oil refinery in drone exchanges; key talks loom",
      "Ukraine Says It Strikes Russia’s Large Saratov Oil Refinery"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.972,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary": "Ukrainian drones have targeted further into Russian territory, with a successful strike on a major refinery in the Saratov region reported by Ukraine's General Staff. This attack is part of a series of recent strikes on Russian oil facilities, indicating an escalation in Ukraine's drone operations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Tribute to Diogo Jota Disrupted by Fans at Wembley",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 10 Aug 2025 15:21:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<ul><li><p>Minority of fans in Crystal Palace end disrupt silence</p></li><li><p>Liverpool forward and brother died in July car accident</p></li></ul><p>Tributes were paid to former Liverpool forward Diogo Jota before the Community Shield but the minute’s silence at Wembley had to be cut short becau",
      "A minute's silence held in tribute to Diogo Jota and his brother Andre Silva was interrupted by a minority of Crystal Palace fans before being cut short ahead the Community Shield against Liverpool."
    ],
    "image_url": "https://i.guim.co.uk/img/media/c334998bd881435318091d9d2f825443985f9ecb/547_0_4826_3862/master/4826.jpg?width=140&quality=85&auto=format&fit=max&s=14202af3166a51f128d5fc26269eff76",
    "titles": [
      "Minute’s silence for Diogo Jota cut short at Wembley before Community Shield",
      "Jota tribute cut short after Wembley boos"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.964,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "A tribute to former Liverpool forward Diogo Jota and his brother Andre Silva, who both died in a July car accident, was disrupted at Wembley before the Community Shield match. A minute's silence was cut short due to disturbances caused by a minority of Crystal Palace fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Trump Proposes Ukraine-Russia Territory Swap, Faces Criticism from Ukraine",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 11:38:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy has staunchly rejected a suggestion by Donald Trump of &#039;swapping territory’.",
      "The Ukrainian leader’s blunt comments risk angering President Trump, who has made a peace deal between Ukraine and Russia one of his signature foreign policy goals."
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy rejects ‘gifting land’ to Russia ahead of Trump-Putin meeting",
      "Zelensky Rejects Ceding Territory to Russia After Trump Suggests a Land Swap"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.911,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "President Donald Trump is scheduled to meet with President Vladimir Putin in Alaska on Friday, where he has proposed that Ukraine and Russia consider a territory swap as a means to achieve peace. This suggestion comes as part of Trump's broader goal to broker a peace deal between the two nations. However, the idea has elicited sharp criticism from the Ukrainian leadership, potentially straining relations with President Trump, who views the peace agreement as a key objective of his foreign policy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 82 tokens"
  },
  {
    "title": "Breanna Stewart Optimistic for Quick Return After Knee Injury",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 15:40:37 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Breanna Stewart is feeling better after suffering a bone bruise in her right knee late last month and hopes to be back by the end of the month.  The two-time WNBA MVP hurt her knee in the Liberty's 101-99 loss to the Los Angeles Sparks on July 26 and talked before New York's game against Minnesota o",
      "<p>Breanna Stewart is feeling better after suffering a bone bruise in her right knee late last month and hopes to be back by the end of the month.</p>"
    ],
    "image_url": "",
    "titles": [
      "Breanna Stewart recovering from bone bruise in knee targets return by end of the month",
      "Liberty’s Breanna Stewart nearing return from knee injury by end of month"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Breanna Stewart, a two-time WNBA MVP, is recovering from a bone bruise in her right knee sustained during a game on July 26. She expressed optimism about returning to play by the end of the month. Stewart was injured in the Liberty's 101-99 loss to the Los Angeles Sparks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens"
  },
  {
    "title": "Trump Open to Ukraine's Inclusion in Putin Talks, Allies Support Kyiv",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 07:27:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The White House says Trump is open to Ukraine joining talks with Putin on Friday, as Zelensky insists any deal without Kyiv is a “dead decision”.",
      "<p>Europe promises to ‘stand firmly’ with Ukraine as Trump and Putin prepare to meet for summit on Friday</p><p>The Ukrainian president, Volodymyr Zelenskyy, has welcomed a statement from European allies that insists the “path to peace in Ukraine cannot be decided without Ukraine”, before a planned "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3bc6/live/8f504ac0-7576-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "Ukraine's European allies say peace talks must include Kyiv",
      "Zelenskyy welcomes European leaders’ demand peace talks must include Kyiv"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.818,
      "consensus": 0.632,
      "constructiveness": 0.063,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary": "The White House has indicated that President Trump is open to including Ukraine in discussions with Putin scheduled for Friday. This comes as Ukrainian President Volodymyr Zelenskyy states that any agreement made without Kyiv's involvement would be ineffective. Ahead of the summit, European allies have expressed their support for Ukraine, asserting that peace in the region cannot be achieved without its participation.",
    "constructiveness_score": 0.063,
    "constructiveness_reason": "1 constructive keywords out of 63 tokens"
  },
  {
    "title": "London Police Arrest 532 at Large Pro-Palestinian Rally",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 13:37:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Police in London detained close to 500 peaceful pro-Palestinian protesters for ‘terrorism’.",
      "<p>Met police say hundreds arrested at largest demonstration relating to Palestine Action since group was proscribed</p><p>A total of 532 people were arrested in London at the largest demonstration relating to Palestine Action since the group was banned, the Metropolitan police have said.</p><p>Hund"
    ],
    "image_url": "",
    "titles": [
      "London police arrest hundreds at Gaza protest supporting Palestine Action",
      "Police arrest 532 people at London protest over Palestine Action ban"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.95,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary": "In London, police detained 532 peaceful pro-Palestinian protesters during the largest demonstration by Palestine Action since the group was banned. The Metropolitan police labeled the arrests as related to terrorism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens"
  },
  {
    "title": "Algoma Steel Adopts Electric Arc Furnaces for Greener Production",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 10:03:20 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "TORONTO &#8212; Like some superhero channelling the power of lightning, Algoma Steel Inc. has started using the heat cast off by the arcs of powerful electric currents to make greener steel. Electric arc furnaces are nothing new &#8212; the technology is more than a century old, and there&#8217;s al",
      "TORONTO — Like some superhero channelling the power of lightning, Algoma Steel Inc. has started using the heat cast off by the arcs of powerful electric currents to make greener steel. Electric arc furnaces are nothing new — the technology is more than a century old, and there’s already a few in Can"
    ],
    "image_url": "",
    "titles": [
      "Greener steel arrives in Canada to a market in turmoil and future unclear",
      "Greener steel arrives in Canada to a market in turmoil and future unclear"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.882,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "Algoma Steel Inc. in Toronto has begun utilizing electric arc furnaces, an established technology, to produce more environmentally friendly steel. By harnessing the heat from electric currents, the company is innovating in the steel industry to reduce its carbon footprint.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens"
  },
  {
    "title": "Chavarria, Adidas Criticized for Alleged Cultural Appropriation in Mexico",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 13:45:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "He has apologised over the Oaxaca Slip-on, inspired by sandals made by Indigenous artisans, after criticism from Mexico.",
      "Fashion designer Chavarria and Adidas are under fire in Mexico, where authorities accuse their latest design of appropriating an Indigenous sandal."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9624/live/7bb5b0e0-75e9-11f0-b124-379f3981c765.jpg",
    "titles": [
      "Adidas designer sorry for shoes 'appropriated' from Mexico",
      "Mexico: US designer regrets 'appropriated' Adidas shoes"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.933,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary": "Fashion designer Chavarria and Adidas faced criticism from Mexico for allegedly appropriating Indigenous sandal designs in their Oaxaca Slip-on. Following the backlash, Chavarria has issued an apology. The controversy centers around accusations from Mexican authorities that the design infringes on the cultural heritage of Indigenous artisans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens"
  },
  {
    "title": "UK to Deport Most Foreign Criminals, Ban Re-entry",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 09:22:28 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Offenders would be barred from re-entering England and Wales under new government plans",
      "<p>Deported offenders will be barred from re-entering UK and measures will apply to those in custody too to cut costs</p><p>Most foreign criminals convicted by a UK court will be deported immediately, instead of 30% of the way through their prison sentences, under plans announced by the government.<"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7e1d7e44-ab19-4f7e-a183-b3bb76b644e4.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Foreign criminals to be deported from UK immediately after sentencing",
      "Foreign criminals convicted in UK to be deported immediately under new plans"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.851,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary": "The UK government has announced plans to immediately deport most foreign criminals convicted in UK courts, a change from the current policy where only 30% serve part of their sentence before deportation. Additionally, deported offenders will be prohibited from re-entering England and Wales. This move aims to reduce custody costs and applies to those currently in custody as well.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens"
  },
  {
    "title": "Portugal Mourns UK Family Killed in Alentejo Car Crash",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 12:23:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Town hall officials in Mourao have declared two days of mourning, starting today.",
      "<p>Four members of family from Thetford, Norfolk, died after car collided with another vehicle in Alentejo region</p><p>A UK family have been killed in a car accident while holidaying in southern Portugal, local authorities have confirmed.</p><p>Domingos Serrano, 55, his wife, Maria, 51, and their 2"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cc58/live/9a1472b0-75e4-11f0-9a7a-7f8e6f1149c0.jpg",
    "titles": [
      "Tribute after family die in Portugal holiday crash",
      "UK family killed in car crash on holiday in southern Portugal"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.907,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "Officials in Mourao, Portugal, have declared two days of mourning after a tragic car accident in the Alentejo region resulted in the deaths of four UK family members from Thetford, Norfolk. The victims were identified as Domingos Serrano, 55, his wife Maria, 51, and their two children. The family was holidaying in southern Portugal when their car collided with another vehicle.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens"
  },
  {
    "title": "EU Leaders Call for More Pressure on Russia Before Trump-Putin Summit",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 06:02:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Leaders of six European nations and the EU call for more pressure on Russia before Trump-Putin summit in Alaska.",
      "For President Vladimir V. Putin of Russia, it is an opportunity not just to end the Ukraine war on his terms, but to split apart the Western security alliance.",
      "Washington’s push to negotiate an end to the war has raised concerns the Trump administration will make concessions to Moscow that Kyiv finds unacceptable."
    ],
    "image_url": "",
    "titles": [
      "Europe promises to ‘stand firmly’ with Ukraine as Trump, Putin plan summit",
      "With Ukraine in the Balance, Trump and Putin Head Into Summit With Mismatched Goals",
      "Ukraine and Europe Project United Front Ahead of Trump-Putin Summit"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.811,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary": "Leaders of six European countries and the EU have urged for increased pressure on Russia ahead of a scheduled summit in Alaska between President Trump and President Putin. The meeting, set for next Friday, aims to discuss a resolution to the Ukraine war. European leaders express concerns that the summit could allow Putin to achieve his goals on his terms, potentially fracturing the Western security alliance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "Crew-10 Astronauts Safely Return After 5-Month ISS Mission",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 07:02:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The landing marks a successful end to their mission on board the International Space Station to help stranded pilots.",
      "The Crew-10 mission, returning on a SpaceX capsule, had replaced astronauts Wilmore and Williams, who were stranded aboard the International Space Station for nine months."
    ],
    "image_url": "",
    "titles": [
      "Astronauts return to Earth in SpaceX splashdown after 5-month ISS mission",
      "NASA astronauts return to Earth from ISS after five months"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.828,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary": "Four astronauts successfully returned to Earth on Saturday, concluding their five-month mission aboard the International Space Station (ISS) where they replaced stranded astronauts Wilmore and Williams. The Crew-10 mission, utilizing a SpaceX capsule, parachuted into the Pacific Ocean off the Southern California coast, marking a successful end to their journey initiated to assist the pilots of Boeing’s Starliner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens"
  },
  {
    "title": "Canada's June Trade Balance Report Due Tuesday",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 14:02:19 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "TORONTO &#8212; Five things to watch for in the Canadian business world in the coming week: Hudson&#8217;s Bay Hudson&#8217;s Bay and B.C. billionaire Ruby Liu have until Tuesday to file court documents responding to landlords and one of the department store&#8217;s leading lenders who want the reta"
    ],
    "image_url": "",
    "titles": [
      "Five things to watch for in the Canadian business world in the coming week"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.61,
    "summary": "Statistics Canada is set to release its merchandise trade balance report for June on Tuesday. Economists are keenly anticipating this data to assess the ongoing impact of global economic conditions on Canada's trade. This release is a critical indicator of the country's economic health, focusing on the difference between its imports and exports.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about an upcoming event that could impact the reader's understanding of Canada's economic health. It provides context about the importance of the trade balance report, which could be useful for decision-making in various sectors."
  },
  {
    "title": "Rams QB Stafford Returns to Practice After Back Injury",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 03:20:50 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Stafford is ready to resume practice after the Rams' preseason win against the Dallas Cowboys",
      "Matthew Stafford has been dealing with a lower back injury throughout training camp, but the Los Angeles Rams QB should be good for the regular season. ESPN’s Jeremy Fowler reported it’s been more of a cautious approach for the veteran signal caller. Despite there being some concerns for the aging q"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/10/d594a13f-7937-4069-b2e4-98546d97b8a4/matthew-stafford-nfl-los-angeles-rams-american-football-news-today-aug-9-2025.jpg",
    "titles": [
      "Matthew Stafford injury update: Rams QB expected to practice for first time in camp after throwing session",
      "Matthew Stafford injury update: NFL insider reveals latest on Rams QB, status for Week 1"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.767,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary": "Matthew Stafford, the Los Angeles Rams quarterback, is set to return to practice following a lower back injury that sidelined him during training camp. Despite concerns due to his age, ESPN's Jeremy Fowler reports that the team has taken a cautious approach with Stafford, who is expected to be ready for the regular season after the Rams' preseason win over the Dallas Cowboys.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens"
  },
  {
    "title": "Jaguars' Cam Little Hits 70-Yard Field Goal in Preseason, Won't Count in Records",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 02:39:04 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Little managed to drill a kick from 70 yards out, but the game being in the preseason means it won't count in the record books",
      "<p>Watch as Jacksonville Jaguars kicker Cam Little nails a field goal from 70 yards out at the conclusion of the first half of his team&#8217;s pre-season matchup against the Pittsburgh Steelers.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/10/5e86b049-b7b9-47a9-a3d0-c4dc35564d26/cam-little-jags.jpg",
    "titles": [
      "WATCH: Jaguars kicker Cam Little drills what would be an NFL-record long field goal against the Steelers",
      "Gotta See It: Jaguars’ Little drills 70-yard field goal vs. Steelers"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.756,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary": "Jacksonville Jaguars kicker Cam Little successfully made a 70-yard field goal during a preseason game against the Pittsburgh Steelers. Despite the impressive distance, the kick will not be recorded in the official NFL record books due to it occurring in the preseason.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens"
  },
  {
    "title": "Air Canada Flight Attendants to Stage Action at Four Major Airports",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 14:07:09 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Media Advisory On Monday, August 11th , Air Canada flight attendants, represented by the Canadian Union of Public Employees (CUPE), will hold a simultaneous action at airports in Montreal, Toronto, Vancouver, and Calgary, to raise awareness among Canadians about ongoing issues related to their worki"
    ],
    "image_url": "",
    "titles": [
      "Air Canada flight attendants organize national action to protest working conditions"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.537,
    "summary": "Air Canada flight attendants, represented by CUPE, will stage a coordinated action at Montreal, Toronto, Vancouver, and Calgary airports on August 11th to highlight work-related concerns. The event aims to raise awareness among Canadians about the challenges faced by the attendants.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "We found stuff AI is pretty good at",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Tech companies keep telling everyone that this or that AI feature is going to change everything. But when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster. Sometimes AI tools feel so open-ended, it's hard to know where to st"
    ],
    "image_url": "",
    "titles": [
      "We found stuff AI is pretty good at"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  },
  {
    "title": "US Consumers Face Slight Inflation Rise from Higher Import Duties in July",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:43:48 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The core consumer price index rose 0.3% in July, according to the median projection in a Bloomberg survey of economists. In June, core CPI edged up 0.2%."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2228231632-e1754836607153.jpg?w=2048",
    "titles": [
      "US inflation to rise as higher tariffs feed through"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.49,
    "summary": "In July, US consumers likely saw a small increase in underlying inflation due to retailers raising prices on goods affected by higher import duties. This indicates a gradual rise in prices for various items.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens"
  },
  {
    "title": "Opinion Questions Economists' Impact on Society, Lacks Detail",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 10:00:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Economists are most effective at being irrelevant."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/688f87b937ea41037d9318db/0x0.jpg?width=960",
    "titles": [
      "The Federal Reserve’s ‘Interest On Reserves’ Doesn’t Contain Inflation"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "This statement expresses a critical opinion on the relevance of economists, suggesting they are not effectively contributing to their field or societal issues. It lacks specific examples or outcomes, making it a general critique rather than a detailed analysis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens"
  },
  {
    "title": "Hawai'i Oceanographers Discover Giant Virus with Unusually Long Tail",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 09:30:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "University of Hawai'i at Mānoa oceanographers have identified PelV-1, a dinoflagellate-infecting giant virus whose micron-length tail reaches 2.3 µm, stretching current notions of viral architecture."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-giant-virus-wags-its.jpg",
    "titles": [
      "A giant virus wags its tail"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.485,
    "summary": "Oceanographers from the University of Hawai'i at Mānoa have discovered a giant virus named PelV-1 that infects dinoflagellates. This virus is notable for its unusually long micron-length tail, measuring 2.3 µm, challenging existing understandings of viral structures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "Deep-Sea Fish Vital in Earth's Carbon Cycle, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 13:40:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/deep-sea-fish-are-secretly-shaping-earths-carbon-cycle/\" rel=\"nofollow\" title=\"Deep-Sea Fish Are Secretly Shaping Earth’s Carbon Cycle\"><img alt=\"Deep Sea Fish\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Deep-Sea-S"
    ],
    "image_url": "",
    "titles": [
      "Deep-Sea Fish Are Secretly Shaping Earth’s Carbon Cycle"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.058,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "Research reveals that deep-sea fish play a significant role in Earth's carbon cycle by consuming and redistributing carbon. These fish, residing at depths below 200 meters, contribute to carbon sequestration by moving carbon from the surface to the deep ocean. This process, often overlooked, highlights the importance of deep-sea ecosystems in global carbon management and the need for their protection to maintain Earth's carbon balance.",
    "constructiveness_score": 0.058,
    "constructiveness_reason": "1 constructive keywords out of 69 tokens"
  },
  {
    "title": "7 password managers to help keep your apps safe",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Passwords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of passkeys, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them"
    ],
    "image_url": "",
    "titles": [
      "7 password managers to help keep your apps safe"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  },
  {
    "title": "Insects Vital for Ecosystems, Support Biodiversity",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 10:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Insects are arguably the most important animals on the planet. Their variety is unparalleled in nature, and they carry out vital tasks such as pollinating plants and providing food for other animals."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/yellow-butterflies.jpg",
    "titles": [
      "Climate-fueled El Niño events are devastating butterflies, beetles and other tropical insects"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "summary": "Insects play a crucial role in ecosystems by pollinating plants and serving as a food source. They are diverse and essential for maintaining biodiversity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 24 tokens"
  },
  {
    "title": "DNNs Boost AI by Analyzing Large Datasets for Precise Predictions",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 08:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Deep neural networks (DNNs), the machine learning algorithms underpinning the functioning of large language models (LLMs) and other artificial intelligence (AI) models, learn to make accurate predictions by analyzing large amounts of data. These networks are structured in layers, each of which trans"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/using-geometry-and-phy.jpg",
    "titles": [
      "Using geometry and physics to explain feature learning in deep neural networks"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "Deep neural networks (DNNs), crucial for the operation of large language models (LLMs) and other AI models, function by analyzing vast datasets. Structured in layers, DNNs learn to make precise predictions, enhancing AI's capabilities in processing and understanding complex data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "How big trucks and SUVs gobbled up the entire auto industry",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T10:15:17-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "How it started When I was growing up in the Midwest, everyone I knew drove small cars. My dad had a light pink Volvo 240, my mom drove a Dodge Dart, and my grandmother had a 1988 Honda Accord - which would eventually become my first car. We lived in the suburbs, so almost no [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "How big trucks and SUVs gobbled up the entire auto industry"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T08:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the fascinating new reality of the internet, teen girls can't learn about periods on Reddit and indie artists can't sell smutty games on Itch.io, but a military contractor will make you nonconsensual deepfakes of Taylor Swift taking her top off for $30 a month. Early Tuesday, Elon Musk's xAI laun"
    ],
    "image_url": "",
    "titles": [
      "Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens"
  },
  {
    "title": "Rapid Glacial Erosion in Canadian Arctic Signals Urgent Climate Concerns",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:05:40 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/glaciers-are-changing-earth-faster-than-you-think/\" rel=\"nofollow\" title=\"Glaciers Are Changing Earth Faster Than You Think\"><img alt=\"Canadian Arctic Glacial Erosion\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Can"
    ],
    "image_url": "",
    "titles": [
      "Glaciers Are Changing Earth Faster Than You Think"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "Recent studies highlight the rapid pace at which glaciers are reshaping Earth, with significant glacial erosion observed in the Canadian Arctic. This accelerated change is contributing to alterations in landscapes and potentially impacting global sea levels. Researchers emphasize the need for urgent attention to these changes to better understand their long-term effects on the planet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens"
  },
  {
    "title": "Inside the automated warehouse where robots are packing your groceries",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It's the lack of noise you notice first. There's no clatter of equipment, rumble of engines, or chatter of coworkers. Only the low hum of electronics. For an industrial space, this is eerily quiet, but it makes sense in a building where robots might outnumber people. I'm at a warehouse - or customer"
    ],
    "image_url": "",
    "titles": [
      "Inside the automated warehouse where robots are packing your groceries"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens"
  },
  {
    "title": "Smotrich Expresses Doubt in PM's Ability for 'Decisive Victory'",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:57:03 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Far-right ultranationalist Bezalel Smotrich says he has ‘lost faith’ that PM can achieve ‘decisive victory’"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5b01afa8-d049-4f8b-8752-df53ae513c01.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Netanyahu’s Gaza war plan will fail, warns Israel’s finance minister"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "Bezalel Smotrich, a far-right ultranationalist, has publicly stated his loss of faith in the Prime Minister's ability to secure a 'decisive victory.' This declaration marks a significant expression of doubt from a prominent political figure regarding the leadership's effectiveness.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "The next big AI model is here",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hi, friends! Welcome to Installer No. 93, your guide to the best and Verge-iest stuff in the world. (If you're new here, welcome, I'm sad the sun is setting sooner, and also you can read all the old editions at the Installer homepage.) This week, I'm reading about the rise of GEO, laughing at Kirby'"
    ],
    "image_url": "",
    "titles": [
      "The next big AI model is here"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens"
  },
  {
    "title": "Oceans Heat Up More Than Expected, Urgent Climate Action Needed",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 13:15:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/earths-oceans-are-boiling-and-its-worse-than-we-thought/\" rel=\"nofollow\" title=\"Earth’s Oceans Are Boiling. And It’s Worse Than We Thought\"><img alt=\"Earth Sun Heat Global Warming Thermometer\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://sc"
    ],
    "image_url": "",
    "titles": [
      "Earth’s Oceans Are Boiling. And It’s Worse Than We Thought"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "Recent reports indicate that the Earth's oceans are experiencing significantly higher temperatures, a condition more severe than previously understood. This warming trend poses serious environmental and ecological threats, highlighting the urgent need for comprehensive climate action to mitigate these effects.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "Ditching my phone for an LTE smartwatch was a humbling experience",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Leaving the house without my phone is the stuff of nightmares. Leaving the house without my phone on purpose? Are you kidding? What if I need to take a picture of something? What will I look at if I need to wait in line? What if disaster strikes or a War of the Worlds happens? [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "Ditching my phone for an LTE smartwatch was a humbling experience"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "NASA plans to build a nuclear reactor on the Moon—a space lawyer explains why",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 11:05:19 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Nuclear power could be the linchpin for long-term human activity."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2016/05/mmoonfarside-1152x648.jpg",
    "titles": [
      "NASA plans to build a nuclear reactor on the Moon—a space lawyer explains why"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.901,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.475,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens"
  },
  {
    "title": "Mathematicians Verify Decades-Old Tetrahedron Conjecture",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 11:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A tetrahedron is the simplest Platonic solid. Mathematicians have now made one that’s stable only on one side, confirming a decades-old conjecture."
    ],
    "image_url": "https://media.wired.com/clips/68949d18ea9eb1683f3eaa23/master/pass/Tetrafun-crX-Lede.mp4",
    "titles": [
      "This New Pyramid-Like Shape Always Lands With the Same Side Up"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.899,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "Mathematicians have successfully created a tetrahedron that is stable on only one side, verifying a conjecture that has been debated for decades. This achievement highlights a significant advancement in the understanding of Platonic solids, with the tetrahedron being the simplest form among them.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens"
  },
  {
    "title": "Immune Cells Linked to Alzheimer’s Resilience, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 05:08:44 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/some-brains-stay-sharp-thanks-to-a-plaque-eating-immune-cell-that-fights-alzheimers/\" rel=\"nofollow\" title=\"Some Brains Stay Sharp Thanks to a Plaque Eating Immune Cell That Fights Alzheimer’s\"><img alt=\"Microglia Brain Immune Cells\" class=\"webfeedsFeaturedVisual wp"
    ],
    "image_url": "",
    "titles": [
      "Some Brains Stay Sharp Thanks to a Plaque Eating Immune Cell That Fights Alzheimer’s"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.796,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "Researchers have discovered that certain brains remain resilient against Alzheimer’s due to a specific type of immune cell known as microglia. These cells combat Alzheimer's by consuming the harmful plaques associated with the disease, thus helping to maintain cognitive function. This finding could lead to new treatments targeting these immune cells to fight Alzheimer’s.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  }
]