[
  {
    "title": "Hall of Fame Goaltender Ken Dryden Dies at 78",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 08:47:25 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "Global News",
      "CBS Sports",
      "Forbes",
      "NPR",
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "globalnews.ca",
      "www.forbes.com",
      "www.npr.org",
      "www.cbssports.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Dryden backstopped the NHL's most successful franchise to championships in six of his eight seasons in the league from 1970-71 to '78-79. He died after a fight with cancer.",
      "Dryden was the anchor of Montreal's dynasty during the 1970s",
      "Ken Dryden, the Hall of Fame goaltender whose resume included six Stanley Cup victories and a stint in the federal cabinet, died Friday at the age of 78 after a battle with cancer.",
      "The hockey world lost one of its most iconic figures on Friday night, as Ken Dryden lost a battle with cancer at age 78.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE96N1RNb3VzWVRYbkg1QmJqRFVpbUhCMDhTQ3ZXcWo0c1JGTWNDTkd3ejF5SVhQN295OWx3ZEZvaVJZbWJ4MlRONXVHak82TDlLbHZmTDJHOWFrcjVHM2o1bEFiLTZDS0RiZGRNdEpBT283d0x1NWxZUEZLMGk?oc=5\" target=\"_blank\">Dryden dies at 78, Hall of Fame goalie won Stanley Cup 6 tim",
      "<p>Ken Dryden, the Hall of Fame goaltender whose long resume in and out of hockey included six Stanley Cup victories and helping backstop Canada&#8217;s generation-defining victory at the 1972 Summit Series, died Friday at the age of 78 after a battle with cancer.</p>",
      "MONTREAL — Ken Dryden, the Hall of Fame goaltender whose long resume in and out of hockey included six Stanley Cup victories and helping backstop Canada&#8217;s generation-defining victory at the 1972 Summit Series, died Friday at the age of 78 after a battle with cancer. A key member of the Montrea"
    ],
    "image_url": "",
    "titles": [
      "Ken Dryden, Hall of Fame goalie for the Montreal Canadiens, dies at age 78",
      "Ken Dryden dies at 78: Hall of Fame goalie won six Stanley Cups with Canadiens, had diverse post-NHL career",
      "Ken Dryden, Canadiens great, author, and politician, dies of cancer",
      "Hockey Hall Of Fame Member Ken Dryden Dies At 78",
      "Dryden dies at 78, Hall of Fame goalie won Stanley Cup 6 times - NHL.com",
      "Former Canadiens goalie Ken Dryden passes away at age 78",
      "Former Canadiens star goaltender, MP Ken Dryden dies of cancer at age 78"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.862,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ken Dryden, a Hall of Fame goaltender who won six Stanley Cups with Montreal and was pivotal in Canada's 1972 Summit Series victory, died at 78 after a battle with cancer. Dryden, celebrated for his role in Montreal's 1970s dynasty and his contributions to hockey and beyond, passed away on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Davey Johnson, World Series Winner as Player and Manager, Dies at 82",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 11:48:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "thelistwire.usatoday.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Davey Johnson, the manager of the 1986 world champion New York Mets, has died. He was 82.",
      "Darryl Strawberry called Davey Johnson a 'remarkable leader' in a social media tribute",
      "Davey Johnson, a four-time All-Star in his playing days and who managed the Mets to the 1986 World Series, has died at 82.",
      "<p>Davey Johnson, an All-Star second baseman who won the World Series twice with the Baltimore Orioles as a player and managed the New York Mets to the title in 1986, has died. He was 82.</p>",
      "The late Davey Johnson, who took four teams to the playoffs, still awaits a Cooperstown call."
    ],
    "image_url": "",
    "titles": [
      "Davey Johnson, manager of '86 Mets, dies at 82",
      "Davey Johnson dies at 82: MLB manager led Mets to 1986 World Series title",
      "Davey Johnson, manager of 1986 New York Mets, dies at 82",
      "Three-time World Series champion Davey Johnson dies at 82",
      "Davey Johnson, Pilot Of ‘86 Mets Champs, Leaves Great Legacy"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.993,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.853,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Davey Johnson, the former All-Star second baseman who won two World Series with the Baltimore Orioles and managed the New York Mets to their 1986 World Series victory, has passed away at the age of 82. Johnson, celebrated for his leadership and success in both his playing and managerial careers, including taking four teams to the playoffs, was remembered by former Mets player Darryl Strawberry as a 'remarkable leader.' Johnson's contribution to baseball remains recognized, though he has not yet been inducted into the Hall of Fame.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Seize 40% of Gaza City, Escalate Crisis with Tower Demolition",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:16:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "CityNews",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Israeli army is systematically destroying remaining infrastructure as it moves to seize Gaza&#039;s largest urban centre.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE15bUQwZHI3YmlpNTZ3UXpXQ3JIR2dBUVpEbWlIVkx2Q2lvZHdKYzV1S1NFSk9BUVhkU0dMM0FzTVVaSVlfQ0l6Q3NIRDUybTZIa2x1UHBTVlRXRS12VnhfcXZjMU5lRlN3NGZUaWxZRW4wQXBXa3YxTE0wZzRHQQ?oc=5\" target=\"_blank\">Israel bombs high-rise buildings in Gaza City ahead of ma",
      "The Israeli military issued evacuation orders for residents in the high-rise towers and urged Palestinians to move to the south of Gaza, as it intensifies its offensive on the city.",
      "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli army issued evacuation orders and targeted high-rise buildings in famine-stricken Gaza City on Saturday, calling on Palestinians to move to the territory&#8217;s south as it escalates operations ahead of a new offensive to seize the city of nearly 1 milli"
    ],
    "image_url": "",
    "titles": [
      "Israel bombs more Gaza City high-rises after forced evacuation orders",
      "Israel bombs high-rise buildings in Gaza City ahead of massive offensive - Axios",
      "Israel Targets More Buildings in Gaza City and Warns Residents to Flee",
      "Israel calls on famine-stricken residents to flee and targets more high-rises in Gaza City"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.982,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.793,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli military has taken control of approximately 40% of Gaza City, escalating tensions and causing widespread panic among civilians. The Israeli Defence Minister described the situation as \"the gates of hell are opening\" in Gaza. In a significant move, Israeli forces demolished the 12-storey Mushtaha tower in Gaza City. This action is part of a broader offensive that has seen the destruction of key infrastructure, leading to a severe humanitarian crisis for the city's residents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Surfer Dies in Shark Attack off Australian Coast; Beaches Closed",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 06:24:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Middle-aged victim reportedly lost both his legs in the attack while his surfboard was cut in half.",
      "A man died Saturday on a beach in Sydney \"after being bitten by what is believed to have been a large shark,\" police said.",
      "<p>Beaches from Manly to Narrabeen closed after death of 57-year-old who leaves behind wife and child</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theg",
      "The authorities in Australia closed beaches in the northern Sydney suburbs after the attack."
    ],
    "image_url": "",
    "titles": [
      "Shark attack kills surfer off Sydney beach in Australia",
      "Man dies in shark attack at Sydney beach in Australia",
      "‘A great tragedy’: man dies in shark attack near Dee Why on Sydney’s northern beaches",
      "Large Shark Kills Surfer Near Sydney, Police Say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.816,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A 57-year-old surfer died after a shark attack off the coast of Australia, resulting in the loss of both his legs. The incident led to the closure of beaches from Manly to Narrabeen. The victim, who was attacked while surfing, died at the scene and is survived by a wife and child.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sinner to Face Alcaraz in US Open Final, Trump to Attend",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 14:53:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sports Illustrated",
      "Al Jazeera",
      "Sky Sports"
    ],
    "domains": [
      "news.google.com",
      "www.skysports.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "All to know as the world&#039;s top two men&#039;s tennis players meet in New York in their third straight Grand Slam final.",
      "Jannik Sinner overcame Felix Auger-Aliassime to set up another final with Carlos Alcaraz, who defeated Novak Djokovic.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxObkhOZERaa2RoRnAwcEJTRjVhWlp5S2w3QWxNUlU4d2hlZm5ZMkZwMVd2cFNtdTNtQXpVcUxsMm0zMDVkUW12dFZVOFV5Y2RrRlh1YmJfdVBkRUtkWEZrTkRzdF8xdlR6aDAzWnpfcktEcnJ2TnVUMFUwTlNDejNTdHZnNWpCZ2VpZHhjeGlOMzFKYklIb1ZrTFkwMA?oc=5\" target=\"_blank\">Jannik Sinner Rea",
      "Carlos Alcaraz soaked up everything Novak Djokovic could throw at him before marching into his second US Open final and denying the 38-year-old a shot at a record-breaking 25th Grand Slam title."
    ],
    "image_url": "",
    "titles": [
      "Alcaraz vs Sinner – US Open final: Match time, head-to-head, stats, Trump",
      "US Open final: Alcaraz to play Sinner after ousting Djokovic",
      "Jannik Sinner Reaches U.S. Open Final, Match With Carlos Alcaraz to Decide World No. 1 - Sports Illustrated",
      "Alcaraz and Sinner to renew rivalry in blockbuster US Open final"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jannik Sinner defeated Felix Auger-Aliassime to reach the US Open final, where he will face Carlos Alcaraz, who beat Novak Djokovic in the semi-finals. This marks the third consecutive Grand Slam final between Sinner and Alcaraz. The winner will decide the world No. 1 ranking. US President Donald Trump plans to attend the final in New York.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Agrees to $1.5B AI Copyright Settlement, Pays Authors $3,000/Book",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T00:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CNBC",
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com",
      "www.cnbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "If the court approves the deal, it will be the largest in the history of US copyright cases, according to lawyers for the authors.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFBERV9wVGlXZHdncG8tbnV1aVEwcHpxaGxZZzlSTHdQUkpkMHJkMGpkNG0wbGlFaDhMUUtWT2FxZGVrWjRrVTJYeGxKS2xxZTRVLXdmTmF0djVwZzFqckdka1VIOEFkam93dVFzN1drbmp3dkdR?oc=5\" target=\"_blank\">Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlemen",
      "Authors had sued Anthropic, claiming the artificial intelligence startup had illegally used their books to train its models.",
      "Settlement shows AI companies can face consequences for pirated training data."
    ],
    "image_url": "",
    "titles": [
      "US: Anthropic to pay $1.5 billion in AI lawsuit settlement",
      "Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlement - Axios",
      "Anthropic agrees to pay $1.5 billion to settle authors' copyright lawsuit",
      "“First of its kind” AI settlement: Anthropic to pay authors $1.5 billion"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.727,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic has agreed to a $1.5 billion AI copyright settlement, under which it will pay authors $3,000 per book. This deal is seen by legal experts as potentially accelerating the trend towards licensing copyrighted material for AI model training.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Derailment Kills 15, Injures 18",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:55:18 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Kayleigh Smith and partner Will Nelson described as \"selfless\" and \"caring\" .",
      "<p>Relatives pay tribute to Kayleigh Smith, 36, and William Nelson, 44, who died when the Elevador da Glória derailed</p><p>The families of a British couple killed in Lisbon after a <a href=\"https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-c",
      "The crash, at a popular tourist site, killed at least 16 people. The authorities were working to identify the victims, who included an American citizen.",
      "At least 16 people were killed after the Glória funicular, one of the city’s most popular tourist attractions, crashed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/daa9/live/a3ab8770-8afa-11f0-a556-2733d63187eb.jpg",
    "titles": [
      "Families pay tribute to British couple killed in Lisbon funicular crash",
      "Families of British couple killed in Lisbon funicular crash ‘heartbroken’",
      "Portugal Searches for Cause of Lisbon Funicular Crash as Death Toll Rises",
      "Lisbon Funicular Crash: What to Know About the Cause and Victims"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A tragic incident occurred in Lisbon when the Glória funicular, a major tourist attraction, derailed and crashed, resulting in at least 15 fatalities and 18 injuries. This event took place on Wednesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Detains 475, Mostly South Koreans, in Georgia Factory Raid",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:29:58 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "US immigration officials detained 475 workers on Thursday - most of them South Korean nationals - saying they were working illegally.",
      "Most of the 475 people arrested in a raid on a Hyundai-LG battery factory under construction in the state of Georgia were from South Korea. Relations between Washington and Seoul have become strained of late.",
      "\"This, in fact, was the largest single-site enforcement operation in the history of Homeland Security investigations,\" a DHS official said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed3f/live/c45f9e90-8b2f-11f0-8abb-4d8cd1fe8125.jpg",
    "titles": [
      "Seoul holds emergency meeting after citizens detained in US Hyundai raid",
      "US: South Koreans detained in ICE raid on Hyundai plant",
      "South Korea responds after ICE detains 475 workers at a Hyundai-LG battery plant in Georgia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.966,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US immigration officials detained 475 workers, primarily South Korean nationals, for working illegally at a Hyundai-LG battery factory in Georgia. This event marks the largest single-site enforcement operation by Homeland Security Investigations. The raid has strained relations between the US and South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hundreds Protest in London Against Palestine Action Ban",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 14:15:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Hundreds of people have gathered in Parliament Square to oppose the group's ban under anti-terrorism legislation.",
      "<p>More than 1,000 people have pledged to risk arrest in demonstration billed as largest since group was proscribed</p><p>Arrests have begun at the largest demonstration yet opposing the proscription of Palestine Action.</p><p>More than 1,000 people pledged to risk arrest on Saturday at a fresh prot",
      "LONDON (AP) — Police on Saturday arrested some of the hundreds of protesters who gathered outside Parliament in London on Saturday to defy a ban on the group Palestine Action, which has been deemed a terrorist organization by the government. Defend Our Juries, the campaign group organizing the prote"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1d70/live/9b4776b0-8b28-11f0-8abb-4d8cd1fe8125.jpg",
    "titles": [
      "Arrests made at rally against Palestine Action ban in London",
      "Police make arrests at London Palestine Action ban protest",
      "Police detain London demonstrators supporting banned group Palestine Action"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hundreds of protesters gathered in Parliament Square, London, to oppose the ban on Palestine Action, labeled a terrorist organization by the government. Over 1,000 individuals pledged to risk arrest in what has been described as the largest demonstration against the proscription. Police arrested several participants during the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Air Canada Flight Attendants Vote on New Contract Post-Strike",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 06 Sep 2025 15:31:33 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Unionized Air Canada flight attendants will finish voting on a tentative new contract with the airline on Saturday, following a three-day strike earlier this summer.",
      "Flight attendants at Air Canada will wrap up voting on a new contract today at 3 p.m. ET. The tentative deal, which ended a strike at the airline last month, raises wages for workers and establishes a pay structure for time worked when aircraft are on the ground. Voting opened Aug. 27 for the 10,000"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/0adbbba5db82dbb61210e05df8b660e11ae888c6ec217a5ab24fea69ab1fb760.jpg?quality=65&strip=all",
    "titles": [
      "Air Canada flight attendants to wrap up vote on new contract Saturday",
      "Air Canada flight attendants to wrap up vote on new contract today"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.716,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Unionized Air Canada flight attendants are concluding their vote on a tentative contract today, which promises wage increases and a new pay structure for ground time. This deal, aimed at resolving issues that led to a three-day strike last month, affects 10,000 workers. Voting began on August 27.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Titans Extend Safety Amani Hooker's Contract for $48.6M",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 11:48:28 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Titans and safety Amani Hooker have agreed on a three-year contract extension worth $48.6 million that includes $29 million in guarantees, Hooker's agent told ESPN's Jeremy Fowler.",
      "Tennessee safety Amani Hooker has signed an extension, keeping one of the Titans’ longest-tenured players with the franchise around past this season.  The Titans announced the multi-year deal Saturday morning ahead of their season opener at Denver.  Financial terms were not included."
    ],
    "image_url": "",
    "titles": [
      "Titans, S Hooker strike 3-year, $48.6M extension",
      "Titans sign veteran safety Amani Hooker to a multi-year extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Tennessee Titans and safety Amani Hooker have agreed on a three-year contract extension, as confirmed by Hooker's agent to ESPN. The deal is valued at $48.6 million, with $29 million guaranteed. This extension secures Hooker, one of the Titans' longest-tenured players, with the team for the foreseeable future. The Titans officially announced the multi-year extension ahead of their season opener at Denver, though they did not disclose financial details.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alabama WR Williams Out Next Game Due to Concussion",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 11:48:28 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Alabama wide receiver Ryan Williams is still working through the concussion protocol and is not expected to play against Louisiana-Monroe, sources told ESPN.",
      "Williams suffered a concussion in the season opener against Florida State last weekend"
    ],
    "image_url": "",
    "titles": [
      "Sources: Alabama WR Williams still in protocol",
      "Ryan Williams injury: Alabama WR expected to miss game vs. ULM as Tide star remains in concussion protocol"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alabama wide receiver Ryan Williams, who suffered a concussion in the season opener against Florida State, is currently going through concussion protocol. According to ESPN sources, he is not expected to play in the upcoming game against Louisiana-Monroe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Clay's Playbook Adds Shadow Report for Week 1 NFL Fantasy Insights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 11:48:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "www.espn.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Mike Clay's Playbook now includes Shadow Reports, providing an all-encompassing look at Week 1's matchups to exploit and avoid in fantasy.",
      "Typically, rookies take time to earn a role in an NFL offense, and their rest of season outlook is much better than week one. That gives these veteran..."
    ],
    "image_url": "",
    "titles": [
      "🏈 The Playbook: Week 1 fantasy football guide",
      "Week 1 Fantasy Football Rankings: Sunday & Monday"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Clay's Playbook has expanded to include the Shadow Report, offering detailed insights on Week 1 NFL matchups for fantasy football players. This comprehensive guide aims to help users make informed decisions on starting or sitting players based on matchups and weather forecasts, among other factors. All relevant fantasy football content for Week 1 is now accessible in one location to assist players in dominating their matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers Beat Chiefs 27-21 in NFL Opener in Brazil, Ending Losing Streak",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 11:15:53 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Chargers held on to win at Corinthians Arena in São Paulo in a potentially critical AFC West battle.",
      "<p>Justin Herbert threw for 318 yards and three touchdowns in outdueling Patrick Mahomes, and the Los Angeles Chargers beat Kansas City 27-21 on Friday night in Sao Paulo, snapping a seven-game skid to the Chiefs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Herbert shines as Chargers earn AFC West win over Chiefs in Brazil",
      "Herbert outduels Mahomes to help Chargers beat Chiefs in Brazil"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Los Angeles Chargers defeated the Kansas City Chiefs 27-21 in their NFL season opener in São Paulo, Brazil. Justin Herbert led the Chargers with 318 passing yards and three touchdowns, outperforming Patrick Mahomes. This victory ended the Chargers' seven-game losing streak against the Chiefs and took place at the Corinthians Arena. Herbert's late-game slide for a first down sealed the win for the Chargers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sabalenka to Face Anisimova in US Open Final",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 09:59:57 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com"
    ],
    "snippets": [
      "No. 1 Sabalenka will take on No. 8 Anisimova in the US Open final Saturday. Who will prevail? It's not as straightforward as it seems on paper.",
      "<p>The 24-year-old endured humiliation at Wimbledon but has pulled off a rapid and remarkable comeback</p><p>Amanda Anisimova was struggling to maintain her composure in the days leading up to the final grand slam tournament of the year. As the American braced herself for her first round match, her "
    ],
    "image_url": "",
    "titles": [
      "Sabalenka vs. Anisimova: Who will win the US Open title?",
      "Anisimova faces battle with Sabalenka and recent demons at US Open final"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aryna Sabalenka, the defending champion and world No. 1, is set to compete against No. 8 seed Amanda Anisimova in the US Open women's final on Saturday. Both players have faced challenges in Grand Slam tournaments this season, adding a layer of anticipation to the match. The event will be broadcast live on Sky Sports starting at 9pm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arsenal Defeats London City Lionesses 4-1 in WSL Debut Match",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:37:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Arsenal come from behind to win 4-1 against Women's Super League newcomers London City Lionesses.",
      "In their first-ever match in the top flight of the English women’s game, London City Lionesses lost 4-1 to the European champions Arsenal at the Emirates Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/60ba/live/e60ac0b0-8b34-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Arsenal come from behind to beat London City Lionesses",
      "London City Lionesses Suffer Crushing Defeat To Arsenal On WSL Debut"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In their debut Women's Super League match, London City Lionesses were defeated 4-1 by Arsenal at the Emirates Stadium. Despite taking an early lead, the newcomers fell to the European champions, showcasing Arsenal's strength in the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Urges GOP Mayoral Candidates to Drop Out, Adams Refuses",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 06 Sep 2025 11:16:04 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9MVW45UzJCVXJ5YUZJNTUwSFNNdVBRMTAxakgxVFdHZi1uWGRvZ2lzYjFJR052ZTBiRmFqbWZ3WHEyb2tiejZfUTRuNWNmNHVNN0VUX1dVNDlPVVVjeGxpUVRpeUtiTXgyNGYxZkNuYWFHQXl0Vk9z?oc=5\" target=\"_blank\">Eric Adams refuses to exit NYC mayor race after reports of Trump jo",
      "President Donald Trump wants two candidates to drop out of the New York mayoral race to clear the way to beat Democratic nominee Zohran Mamdani."
    ],
    "image_url": "",
    "titles": [
      "Eric Adams refuses to exit NYC mayor race after reports of Trump job offer - Axios",
      "New York Mayor Adams refuses to quit race, blasts Cuomo after Trump nomination talk"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.885,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has called for two candidates to withdraw from the New York mayoral race to consolidate efforts against Democratic nominee Zohran Mamdani. Despite this, Eric Adams has refused to exit the race.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "100 Firefighters Tackle Blaze at Former BBC HQ in London",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:11:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Firefighters have been tackling the blaze for 12 hours, the London Fire Brigade says.",
      "<p>One person treated at scene after emergency services called to nine-storey building shortly after 3am</p><p>Firefighters are tackling a blaze in London’s White City after a fire broke out in the early hours of Saturday at the former BBC HQ.</p><p>London fire brigade (LFB) said about 100 firefight"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1473/live/899b7390-8b31-11f0-8abb-4d8cd1fe8125.jpg",
    "titles": [
      "Fire breaks out at BBC's former HQ Television Centre",
      "Firefighters tackle blaze at BBC’s former HQ in west London"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Firefighters have been battling a fire at the former BBC HQ in London's White City for 12 hours. The London Fire Brigade was called to the nine-story building just after 3 am. One person has been treated at the scene. Around 100 firefighters are involved in the operation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk Threatens to Quit, Tesla Sets New $2T-$8.5T Compensation Goals",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T07:55:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.dw.com"
    ],
    "snippets": [
      "Tesla's board said the controversial CEO has threatened to leave the company more than once. The staggering pay package is designed to make him stay.",
      "Musk’s new comp plan sets 12 goals for Tesla’s market cap, starting at $2 trillion and eventually rising to an incredible $8.5 trillion."
    ],
    "image_url": "",
    "titles": [
      "Tesla board proposes $1 trillion pay package for Elon Musk",
      "Elon Musk delivered on Tesla’s ‘mission impossible’ goals before—but the targets for his $1 trillion pay package are even more delusional"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla's board revealed that CEO Elon Musk has threatened to quit multiple times, leading to a new compensation plan aimed at retaining him. This plan includes 12 market cap goals for Tesla, beginning at $2 trillion and potentially reaching up to $8.5 trillion.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Method Converts PET Waste into CO2-Capturing Material",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 22:22:50 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "Phys.org"
    ],
    "domains": [
      "www.sciencedaily.com",
      "phys.org"
    ],
    "snippets": [
      "A team of chemists has discovered how to transform PET plastic waste into BAETA, a material that captures CO2 with remarkable efficiency. Instead of ending up as microplastics in the environment, discarded bottles and textiles could become tools to combat climate change. The method is energy-friendl",
      "Chemists at the University of Copenhagen have developed a method to convert plastic waste into a climate solution for efficient and sustainable CO2 capture. This is killing two birds with one stone as they address two of the world's biggest challenges: plastic pollution and the climate crisis."
    ],
    "image_url": "",
    "titles": [
      "Scientists made plastic that eats carbon",
      "Scientists transform plastic waste into efficient CO₂ capture materials"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.751,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Chemists at the University of Copenhagen have developed a method to convert PET plastic waste into BAETA, a material that efficiently captures CO2, addressing plastic pollution and climate change simultaneously. This innovative, energy-friendly process offers a dual solution to major environmental challenges.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "HHS Report to Explore Possible Tylenol-Autism Link, Kenvue Denies Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 21:23:24 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFBJOTNyNW83bjNKYkZZU1Q1eXU2cmhBalV3bTZCeFlHakM4bWh3SWVWNUlPeUVSclJUSnVNZVZhUUN2T0QxWk9LVFJTem02eDRpOUZ6UEVodUJmaGMzYkV3NUpuWkJtSnY3Um44Yk1VbURqX2ZjMV9TcFFUTXVBaDQ?oc=5\" target=\"_blank\">RFK Jr. to draw link between Tylenol and autism, new rep",
      "HHS will release the report that could draw that link between the pain medication and autism this month, according to the Wall Street Journal."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. to draw link between Tylenol and autism, new report says - Axios",
      "Kenvue stock drops 10% on report RFK Jr. will link autism to Tylenol use during pregnancy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.663,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Department of Health and Human Services (HHS) is set to release a report this month that may suggest a link between Tylenol and autism, as reported by the Wall Street Journal. Kenvue, the manufacturer of Tylenol, denies any connection as alleged in the upcoming report.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Dismisses Newsmax Antitrust Lawsuit Against Fox News",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 18:43:01 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1Na0hrUmtnQmFmQWpvUzhPTUhXVDNjcThxOU5MMkkyWFRJanNweU0wTTdNOVQzaXZRTGN1TGxLSkMwZzE0dGUwbTQ2TFVFVDV6ZnJYbHpUMTkxUGplVjFhWEVqcHZpY1pqZ3JUVU9lVmU0QzAzU09DXw?oc=5\" target=\"_blank\">Judge dismisses Newsmax's antitrust lawsuit against Fox</a>&nbsp;",
      "Judge Aileen Cannon is best known for presiding over a criminal case against President Trump for retaining classified government records after his first term."
    ],
    "image_url": "",
    "titles": [
      "Judge dismisses Newsmax's antitrust lawsuit against Fox - Axios",
      "Judge dismisses Newsmax's antitrust suit against Fox News, but will allow amended complaint"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.627,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US District Judge Aileen Cannon dismissed Newsmax's antitrust lawsuit against Fox News and its parent company, just two days after it was filed. Judge Cannon is known for overseeing a criminal case against President Trump related to classified records.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warner Bros. Sues Midjourney Over Copyright Infringement Claims",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:56:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "Warner Bros. case builds on arguments raised in a Disney/Universal lawsuit."
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "Warner Bros. sues Midjourney to stop AI knockoffs of Batman, Scooby-Doo"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.617,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Warner Bros. accuses Midjourney of intentionally allowing users to generate content from copyrighted images after lifting previous restrictions. This case follows similar legal arguments made in a Disney/Universal lawsuit against Midjourney.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Keir Starmer Reshuffles Cabinet to Boost Labour Party's Effectiveness",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 17:56:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "An in-depth look at which Labour MPs are currently serving in Prime Minister Keir Starmer's cabinet.",
      "Overhaul of top team hands experienced ministers and fast risers new briefs and challenges"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/32a4/live/ebb32100-8a4f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Who's in Keir Starmer's new cabinet?",
      "Who’s who in Starmer’s new cabinet?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.617,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.578,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Prime Minister Keir Starmer has reshuffled his cabinet, assigning new roles and challenges to both seasoned ministers and rapidly advancing members of the Labour Party. This move aims to strengthen the team's effectiveness and address current political demands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]