[
  {
    "title": "Bad Bunny to Headline 2026 Super Bowl Halftime Show",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 02:41:33 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Forbes",
      "NPR",
      "Axios",
      "BBC",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.npr.org",
      "www.cbssports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The National Football League, Apple Music and Roc Nation made the announcement during halftime of Sunday night's game between the Green Bay Packers and Dallas Cowboys.",
      "The Puerto Rican pop star says the performance will be \"for my people, my culture, and our history\".",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWTA4MnZGLTNwMVViRVhST3dHWG5xQmJ6UFVpTklSbFBxSy1rMGctY1Nlb2pIdGpRSnpyTld1SEhLUVFPNlR4NFBEWlhzNExvRUh2TDRCNkhNanhOWTdEc1R0bUVNWDdsNWdZM2I1aWFzMFZENUVZMlJMVlFkRl9tbE92VQ?oc=5\" target=\"_blank\">Bad Bunny to headline Super Bowl halftime show in",
      "Bad Bunny, a three-time Grammy Award winner, is the most-streamed artist in the world",
      "Check out the list of artists who've taken the stage in the history of the iconic event",
      "<p>Latin trap and reggaeton artist to lead NFL half-time celebration on 8 February, following Kendrick Lamar’s record-breaking 2025 show</p><p>Bad Bunny will headline the NFL’s biggest stage next year: the Super Bowl half-time show in northern California.</p><p>The NFL, Apple Music and Roc Nation an",
      "Get to know who is Bad Bunny before he performs at the NFL's 2026 Super Bowl LX Halftime Show that could mark a politically charged moment."
    ],
    "image_url": "",
    "titles": [
      "Latin superstar Bad Bunny will headline the 2026 Super Bowl halftime show",
      "Bad Bunny revealed as Super Bowl half-time show performer",
      "Bad Bunny to headline Super Bowl halftime show in 2026 - Axios",
      "Bad Bunny selected to perform during 2026 Super Bowl LX halftime show",
      "Full list of every Super Bowl halftime performer in history: Bad Bunny to headline show in 2026",
      "Puerto Rican superstar Bad Bunny to headline 2026 Super Bowl half-time show",
      "Bad Bunny To Play 2026 Super Bowl LX Halftime Show: All The Details"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.969,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.864,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Puerto Rican artist Bad Bunny, a three-time Grammy winner and the world's most-streamed artist, is set to headline the Apple Music Super Bowl Halftime Show at Levi's Stadium in Santa Clara, California, on Feb. 8. His performance at the 2026 Super Bowl LX could be a significant, potentially politically charged event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova's Pro-European Party Leads Election Amid Russia Interference Claims",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 05:40:31 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The election was seen as critical for Moldova's EU path, and President Maia Sandu warned the country's future was in danger.",
      "The governing party decisively victorious in parliamentary election widely viewed as a choice between Europe and Russia.",
      "Moldovans await the results of a closely-watched parliamentary election, amid claims of Russian interference.",
      "Moldovans voted in a high-stakes election to decide whether the country moves closer to the European Union or Russia. The defeated pro-Russian party has called for a protest against the results. Follow DW for more.",
      "<p>PAS garners 50.03% of vote after more than 99.5% of ballots counted in poll deciding whether country steers closer to EU or Russia</p><p>Moldova’s ruling pro-European party has retained its parliamentary majority after Sunday’s pivotal election, seen as a test of the president’s push to keep the ",
      "With virtually all the results in, the party of President Maia Sandu was set to keep its majority in Parliament, in a vote widely seen as a showdown between Europe and Russia."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg",
    "titles": [
      "Pro-EU party in Moldova set to win vote mired in claims of Russian interference",
      "Moldova’s pro-EU party wins election hit by Russian interference claims",
      "Moldova’s pro-EU party takes lead in election as vote counting under way",
      "Moldova: Ruling pro-EU party wins election",
      "Moldova’s pro-European party retains majority in key election",
      "Pro-Europeans Set to Win Pivotal Election in Moldova Despite Russian Meddling"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.93,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldova's pro-European ruling party leads with 46% of the vote in a parliamentary election marked by allegations of Russian interference. The election is pivotal for deciding whether Moldova aligns more closely with the EU or Russia. The outcome could see President Maia Sandu's party retaining its majority, amid a high-stakes vote influenced by overseas ballots and accusations against Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Secure 2-0 Pre-Season Win Against Devils",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:41:33 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "Ottawa Citizen"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.",
      "<p>Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.</p>",
      "Rookie centre Stephen Halliday scored the third-period winner as the Senators picked up their second victory of the pre-season"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5ee59b15d0a74103bbd3509d2c16e975c33e42411b2fa0a44b19f3473754a80d.jpg?quality=65&strip=all",
    "titles": [
      "Ullmark nets shutout as Senators beat Devils 2-0",
      "Ullmark nets shutout as Senators beat Devils",
      "Takeaways: Linus Ullmark makes 14 stops in Ottawa Senators' victory over Devils"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.838,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.768,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Stephen Halliday and Olle Lycksell scored for the Ottawa Senators in a 2-0 win against the New Jersey Devils during an NHL pre-season game on Sunday at the Videotron Centre. Halliday's goal came in the third period on a power play, securing the Senators' second pre-season victory. Lycksell's goal was scored into an empty net.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Win AL East Title, Kirk Hits 2 HRs in 13-4 Victory Over Rays",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 01:14:37 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Blue Jays manager John Schneider was only 20 seconds into his post-game speech Sunday when he was drowned out by his roaring players and doused in champagne.",
      "Alejandro Kirk hit two homers and drove in six runs to power the Blue Jays to a 13-4 victory over the Tampa Bay Rays on Sunday to give Toronto its first American League East Division title since 2015.",
      "<p>For the first time in a decade, the Toronto Blue Jays are AL East champions.</p>",
      "<p>For the first time in a decade, the Toronto Blue Jays are back atop the American League East.</p>",
      "<p>Watch as John Schneider gives an impassioned speech to the Blue Jays after clinching the AL East division title before the team popped their celebratory champagne in the clubhouse.</p>",
      "<p>Toronto Blue Jays stars Alejandro Kirk, George Springer and manager John Schneider speak with Sportsnet&#8217;s Hazel Mae immediately after clinching the team&#8217;s first AL East title since 2015.</p>",
      "TORONTO – Six months of grinding to qualify for the meaningful games of the seventh are over and this&#160;Toronto Blue Jays&#160;season spent walking through a dream continues, with the chance to push back the awakening deep into October.&#160; An American League East title, the club’s first since "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/b2296baf516a6ce31fbf6e507300f3362189c81b55f415341b8fa20bc5c636e1.jpg?quality=65&strip=all",
    "titles": [
      "Jays beat Rays to take East, earn bye to ALDS",
      "Blue Jays beat Rays 13-4, take East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015",
      "‘A wagon’: Sports world reacts to Blue Jays winning AL East title",
      "Blue Jays pop champagne in locker room after clinching AL East title",
      "Blue Jays’ Schneider, Kirk and Springer speak after clinching AL East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.865,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 13-4 win over the Tampa Bay Rays with two home runs, securing their first AL East title since 2015. The victory in their regular-season finale was highlighted by Kirk's first career grand slam. George Springer and Addison Barger also contributed with home runs. This triumph marks the team's notable return to the top of the American League East after a decade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Injured in Ravens' 37-20 Loss to Chiefs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 02:52:30 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Ravens quarterback Lamar Jackson sustained a hamstring injury in the third quarter of his team's 37-20 loss to the Kansas City Chiefs on Sunday at Arrowhead Stadium, and Baltimore coach John Harbaugh had no update during his postgame media availability.",
      "Jackson is questionable to return as his team trails by 17 points entering the fourth quarter",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE96Rno0NDRNUFk1NTRXZTNPbWRBMjNrSzlGWjVpM0ZEdF9UU1luWV9HZTdfVkJaQ1NPRUxxaU1hd2ZGTkFENzV5RGRQQUdlcEd6WVk3d01iNVdaYnJDeXJYMERWS1NvRlE4MlZCcnpEcjJrSzdKMmVhS0E3ME5Wdw?oc=5\" target=\"_blank\">Lamar Jackson Exits Ravens-Chiefs With Hamstring Injury</"
    ],
    "image_url": "",
    "titles": [
      "Jackson injures hamstring as Ravens fall to 1-3",
      "Lamar Jackson injury: Ravens quarterback exits Week 4 game against Chiefs with hamstring injury",
      "Lamar Jackson Exits Ravens-Chiefs With Hamstring Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lamar Jackson, quarterback for the Baltimore Ravens, left the game with a hamstring injury in the third quarter during a 37-20 loss to the Kansas City Chiefs at Arrowhead Stadium. Coach John Harbaugh provided no update on Jackson's condition postgame. Jackson's status was listed as questionable for return as the Ravens faced a 17-point deficit entering the fourth quarter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury Overcomes Deficit to Reach WNBA Finals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 02:52:30 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Phoenix Mercury overcame a 13-point fourth-quarter deficit to defeat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday to advance to the WNBA Finals for the first time since 2021, and in that round, they'll take on Indiana or Las Vegas.",
      "Alyssa Thomas had 23 points, 10 assists and 8 rebounds",
      "Phoenix punched its ticket to the WNBA Finals on Sunday",
      "<p>Alyssa Thomas scored 23 points, DeWanna Bonner made two key 3-pointers in the fourth quarter and the Phoenix Mercury overcame a 13-point deficit in the final period to beat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday night and advance to the WNBA Finals for the first time since 2021"
    ],
    "image_url": "",
    "titles": [
      "Mercury top short-handed Lynx, make WNBA Finals",
      "WNBA playoffs: Phoenix Mercury fend off short-handed Minnesota Lynx in Game 4 to reach WNBA Finals",
      "WNBA playoff bracket, where to watch: Schedule, scores, TV channel as Mercury eliminate Lynx to reach Finals",
      "Mercury overcome 13-point deficit, beat Lynx to advance to WNBA Finals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Phoenix Mercury rallied from a 13-point fourth-quarter deficit to defeat the Minnesota Lynx 86-81 in Game 4, advancing to the WNBA Finals for the first time since 2021. Alyssa Thomas led with 23 points, 10 assists, and 8 rebounds, while DeWanna Bonner contributed crucial fourth-quarter 3-pointers. They will face either Indiana or Las Vegas in the Finals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bradley Criticizes Ryder Cup Rule After Hovland Withdrawal; Donald Defends",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 02:52:30 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "golf.com",
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "U.S. captain Keegan Bradley said the Ryder Cup's longstanding envelope rule involving injured players should change, but European counterpart Luke Donald said it's there to protect players and should remain in place.",
      "A rule is slammed by U.S.",
      "Ryder Cup nvelope ule comes into play and controversy follows as Viktor Hovland is forced to withdraw from Sunday singles."
    ],
    "image_url": "",
    "titles": [
      "Ryder Cup envelope rule must change, per Bradley",
      "‘Has to change': 1 rule slammed by Keegan Bradley after Ryder Cup loss",
      "Ryder Cup Envelope Rule Comes Into Play And Causes Controversy."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. Ryder Cup captain Keegan Bradley criticized the envelope rule after Viktor Hovland's withdrawal led to controversy, advocating for a change. However, European captain Luke Donald defended the rule, emphasizing its role in protecting players. The disagreement highlights differing perspectives on the rule following its impact on the competition's proceedings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Stampeders Acquire Lorenzo Mauldin IV from Ottawa Redblacks",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:39:08 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "Ottawa Citizen"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.",
      "<p>The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.</p>",
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks. Ottawa got a fourth-round pick in the 2026 Canadian Football League draft in return. The Redblacks have a 4-10 record this season, which is the worst record among th"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/35f544e9af9cb37edc23a029a411c340477b8d6f03ee5b12fd023f39dc225093.jpg?quality=65&strip=all",
    "titles": [
      "Stampeders get all-star Lorenzo Mauldin IV",
      "Stampeders get all-star Lorenzo Mauldin IV in trade with Redblacks",
      "Redblacks trade all-star Lorenzo Mauldin IV to Stampeders"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.82,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Calgary Stampeders traded for all-star American defensive lineman Lorenzo Mauldin IV from the Ottawa Redblacks on Sunday, exchanging a fourth-round pick in the 2026 CFL draft. The trade comes as the Redblacks hold a 4-10 season record, the lowest in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NYC Mayor Adams Suspends Campaign Amid Funding Issues, Crowded Race",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 17:54:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Adams bows out, leaving the race between Democrat Zohran Mamdani and former New York Governor Andrew Cuomo.",
      "President Donald Trump has suggested that NYC Mayor Eric Adams and Curtis Sliwa, the Republican nominee, should both drop out of the race.",
      "<p>New York City mayor abandons faltering bid to win re-election in social media video set to strains of song My Way</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a>, <a href=\"https://www.theguardian.com/us-news/eric-adams\">Eric Adams</a>, announced on Sund",
      "Adams announced his departure on Sunday in an eight-minute video on X, saying media speculation and lack of funding influenced his decision."
    ],
    "image_url": "",
    "titles": [
      "Eric Adams says he is dropping out of New York City mayoral race",
      "Eric Adams drops out of New York City mayoral race",
      "Eric Adams drops out of New York City mayoral race",
      "Eric Adams drops out of the New York mayor's race weeks ahead of the election"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.743,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "New York City Mayor Eric Adams has suspended his re-election campaign, citing media speculation and funding issues. His withdrawal sets up a race between Democrat Zohran Mamdani, Republican Curtis Sliwa, and former Governor Andrew Cuomo, running as an independent. Adams made the announcement through a social media video. President Trump had suggested both Adams and Sliwa should drop out. The election is set for November.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthony Stolarz Secures 4-Year, $15M Deal with Toronto Maple Leafs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 19:07:34 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Goalie Anthony Stolarz and the Toronto Maple Leafs have agreed to a four-year contract extension.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPRGNCc2ZOOWZmNE9oQzBob0NkTFpNUjZ5aFdGZlI4cHI4c0FRTXJoWDBQdEE0SFJYYkJRQzR6QnZubl8wcGtleGs0M2tvOUtjOTVQZ04zV2NWRzY3eFpkU3o2dmpBQVYtdnFUay1HMnZZVnlNa3o5RXc5RW5INldzeGhPSkNDQm0zVzJFRmhYbnJmSVU?oc=5\" target=\"_blank\">Stolarz signs 4-year, $15 mi",
      "<p>Anthony Stolarz has agreed to the biggest pay day of his life, and it still may be a bargain for the Toronto Maple Leafs.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/bf7a3286377e0a5839a285ffdce045e381f0b808bcacf3e801dd6e6e4377e00b.jpg?quality=65&strip=all",
    "titles": [
      "Stolarz signs four-year extension with Maple Leafs",
      "Stolarz signs 4-year, $15 million contract with Maple Leafs - NHL.com",
      "Maple Leafs agree to four-year contract extension with goalie Anthony Stolarz"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.762,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthony Stolarz has signed a four-year, $15 million contract extension with the Toronto Maple Leafs, securing his position as a goalie for the team. This agreement reflects the team's commitment to Stolarz as a key player in their lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Bualoi Hits Vietnam: 11 Dead, 21 Missing, 250K Evacuated",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T07:58:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Phys.org",
      "Deutsche Welle"
    ],
    "domains": [
      "phys.org",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Typhoon Bualoi has hit Vietnam's coast earlier than expected, causing death and extensive destruction. Residents have been warned of flash floods and landslides.",
      "Vietnam is evacuating more than 250,000 people as Typhoon Bualoi draws nearer to its shores, with authorities warning it could trigger \"multiple natural disasters\" at once.",
      "It left an additional 21 people missing in Central Vietnam, which is still recovering from another storm. Bualoi’s deadly path started in the Philippines over the weekend.",
      "Typhoon Bualoi ripped roofs from buildings and uprooted electrical poles along Vietnam's coast, killing at least 11 people, local and national officials said on Monday."
    ],
    "image_url": "",
    "titles": [
      "Typhoon Bualoi lashes Vietnam, killing at least 11",
      "Typhoon Bualoi: Vietnam warns of flash floods, landslides",
      "Typhoon Bualoi Slams Into Central Vietnam, Bringing Storm’s Death Toll to 22",
      "Typhoon Bualoi batters Vietnam coast, killing 11"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.996,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Typhoon Bualoi struck Vietnam's coast, causing significant damage, including deaths and destruction. It killed at least 11 people, left 21 missing, and prompted the evacuation of over 250,000 residents due to threats of flash floods, landslides, and multiple natural disasters. The storm, which began in the Philippines, damaged buildings and infrastructure in Vietnam, where recovery from a previous storm is still ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gunman Kills 4, Injures 8 at Michigan Church; Shot Dead by Police",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 16:52:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "At least eight others injured in shooting and fire in Grand Blanc Township, and suspect shot dead by police.",
      "A man killed at least four people and injured several others in a shooting at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, before dying in a shootout with police, officials said.",
      "<p>Church allegedly set ablaze by gunman on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans</p><p>At least four people were killed and eight others injured after a gunman opened fire at a Mormon church in <a href=\"https://www.theguardian.com/us-news/michigan\">M",
      "GRAND BLANC TOWNSHIP, Mich. (AP) — A gunman opened fire inside a Church of Jesus Christ of Latter-day Saints chapel in Michigan during a Sunday service and set the building ablaze, killing at least two people and injuring eight others before police shot him, authorities said. Hundreds of people were"
    ],
    "image_url": "",
    "titles": [
      "US shooter kills at least four at Mormon church in Michigan",
      "US: At least 4 dead in shooting at Mormon church",
      "At least four dead and eight injured after shooting at Mormon church in Michigan",
      "2 people dead and 8 wounded in a shooting and fire at a Michigan church, police say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.727,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A gunman attacked the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, during a Sunday service, killing at least four and injuring eight others before being shot dead by police. The assailant drove into the church, opened fire on attendees, and set the building on fire. The incident, described by the FBI as an \"act of targeted violence,\" occurred amidst several other shooting attacks across the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oregon Sues Trump Over National Guard Deployment to Portland",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 04:26:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The Democrat-run state is challenging Trump&#039;s authority to deploy soldiers to what he has called &#039;war ravaged Portland&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOYTdZLVBwcEFSRkdrbTNPY1BzNHdLdnBhdzNrTjA0M3hXeHozYzh2Zm5mZkpVZkZmdnhzSWFycEVpNEx2VGhkZ0JHUmNNYk8zekFaaU8tVXdCQURxdnpsQzBWNjI1STN5RDlxY1hUNFdVX3Y0cWtLV21KVks0eldZZXJ5d3VTUVJGZEhOazZWTTBrNktO?oc=5\" target=\"_blank\">Oregon sues Trump in bid to",
      "The suit was filed after the Defense Department sent a memo to Oregon state leaders informing them about the deployment of 200 National Guard troops in Portland."
    ],
    "image_url": "",
    "titles": [
      "Trump to deploy 200 National Guard troops to Oregon as state leaders sue",
      "Oregon sues Trump in bid to stop National Guard deployment to Portland - Axios",
      "What We Know About The National Guard Deployment In Portland As Oregon Sues Trump Administration"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.925,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oregon has filed a lawsuit against President Trump's decision to deploy 200 National Guard troops to Portland, challenging his authority. The legal action comes after the Defense Department notified Oregon state leaders of the deployment, aimed at addressing what Trump referred to as 'war ravaged' conditions in the city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Denmark Bans Civilian Drones Amid Suspicious Activities, Preps for Summit",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 04:28:34 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Denmark is one of several European countries that have reported \"drone incidents\" in recent weeks.",
      "Denmark is closing its entire airspace to civilian drones. The ban comes as the Nordic country prepares to host European leaders after a flurry of suspicious drone activity in recent days.",
      "<p>The ban on civilian unmanned flights will last until Friday and comes as heads of EU governments gather amid spate of drone incursions</p><p>Danish authorities have said drones were seen at several military sites overnight and announced that all civilian use of the unmanned aircraft will be banne"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/492d/live/22faa510-9ce9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Denmark bans all civilian drone flights ahead of European summit",
      "Denmark bans civil drones after more sightings",
      "Denmark bans drones ahead of European summits amid further sightings at military sites"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.907,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Denmark has temporarily closed its airspace to civilian drones until Friday due to a series of suspicious drone activities, particularly at military sites. This measure coincides with the country preparing to host European leaders. The ban is a response to recent drone incidents reported in Denmark and other European countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Namibia Deploys Soldiers to Fight Fire in Etosha National Park",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 06:39:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The fire has burned through one-third of Etosha National Park, home to the endangered black rhinoceros.",
      "<p>Vast tract of park that is home to 114 mammal species, including critically endangered black rhino, affected</p><p>Namibia has begun deploying hundreds of soldiers to fight a fire that has burned through a third of the vast Etosha national park, one of Africa’s largest game reserves, officials sa"
    ],
    "image_url": "",
    "titles": [
      "Namibia deploys army to fight fire in one of Africa’s largest reserves",
      "Namibia deploys army to fight wildfire burning third of Etosha game reserve"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fire has consumed one-third of Etosha National Park in Namibia, affecting an area home to 114 mammal species, including the critically endangered black rhinoceros. In response, Namibia has deployed hundreds of soldiers to combat the blaze in one of Africa's largest game reserves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "GSK CEO Emma Walmsley Steps Down, Luke Miels to Take Over",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 06:25:42 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "London-listed drugmaker’s chief commercial officer Luke Miels will take over later this year",
      "<p>Chief commercial officer Luke Miels to take over as CEO at UK-based pharmaceutical company in surprise move</p><p>The pharmaceutical group GSK has announced the surprise departure of its chief executive, Emma Walmsley, after eight years in the top job.</p><p>Walmsley, who has run the FTSE 100 com"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7b7d834d-8de7-4f99-a7b3-630d8df2c2a5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "GSK chief Walmsley to step down",
      "GSK’s Emma Walmsley to be replaced as chief executive"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "GSK, a UK-based pharmaceutical company, announced the departure of CEO Emma Walmsley after eight years. Luke Miels, the chief commercial officer, is set to take over later this year in a surprise move.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Starbucks to Close 1% of North American Stores, Locations Unspecified",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-29T04:55:55Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Starbucks on Thursday said it would close 1% of its North American stores, but didn't announce which ones. Business Insider has compiled a list.",
      "Chain closures are cutting into local coffee routines. Here’s what we've confirmed so far."
    ],
    "image_url": "https://i.insider.com/68d724611c1f80efbec473c1?format=jpeg",
    "titles": [
      "Starbucks is closing over 100 North American stores &mdash;&nbsp;here are the locations we know so far",
      "Which Starbucks locations are closing in Ottawa?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Starbucks announced on Thursday it will close 1% of its North American stores, but did not specify which ones. Business Insider has compiled a list of the closures. These closures are impacting local coffee routines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stowaway Found Dead in Plane's Landing Gear in North Carolina",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 17:48:33 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "Police say maintenance workers discovered the body Sunday morning after the plane landed from Europe.",
      "A stowaway was found dead Sunday in the landing gear of an American Airlines flight that arrived in North Carolina from Europe, according to police."
    ],
    "image_url": "",
    "titles": [
      "Stowaway found dead in landing gear of American Airlines flight in Charlotte",
      "Stowaway found dead inside landing gear of an American Airlines flight"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.806,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A stowaway was found dead in the landing gear of an American Airlines flight from Europe upon its arrival in North Carolina on Sunday, police reported. Maintenance workers discovered the body that morning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China, North Korea Discuss Strengthening Ties to Counter US Influence",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 02:55:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Chinese Foreign Minister Wang Yi holds talks with his North Korean counterpart, Choe Son Hui, in Beijing.",
      "North Korea and China have long been economic and strategic allies but the East Asian neighbors are looking to revitalize relations to counter the US."
    ],
    "image_url": "",
    "titles": [
      "China and North Korea agree to resist ‘hegemony’, Foreign Ministry says",
      "North Korea, China agree to deepen ties against hegemonism"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chinese Foreign Minister Wang Yi met with North Korean counterpart Choe Son Hui in Beijing to discuss revitalizing economic and strategic alliances between China and North Korea, aiming to counter US influence in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tropical Storm Imelda Expected to Become Hurricane, May Veer Away from US",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 05:03:45 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOTFctdTV3VXBqN01IR05vbnhTMWw4MnhrdWgwOEROQUl0MXM4Y3dXVzMwRGlpVXBIZUc5OEtUNmdJdWs4OHBVblFSaHRvTWtuVDFfSG9rNXdldkxsbVBUZUpCRi1PcUxnNk1faEtZd1FFQTRBR1ItYnZ0bmt3U0xjUFJHdVY?oc=5\" target=\"_blank\">Tropical Storm Imelda to threaten Carolinas with",
      "<p>Forecast track could take storm, which caused disruption in Bahamas and Cuba, away from US east coast</p><p>Tropical Storm Imelda formed on Sunday and was expected to become a hurricane on a forecast track that could take it away from the US east coast in the coming days. The storm was causing di"
    ],
    "image_url": "",
    "titles": [
      "Tropical Storm Imelda to threaten Carolinas with heavy rains - Axios",
      "Tropical Storm Imelda forming and expected to become hurricane"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tropical Storm Imelda formed on Sunday and is anticipated to become a hurricane. Its forecasted path suggests it might move away from the US east coast. Previously, Imelda caused disruptions in the Bahamas and Cuba.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Karearea Named New Zealand's Bird of the Year Amid Controversy-Free Contest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T03:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The threatened karearea, New Zealand's fastest bird, was crowned Bird of the Year. There are between roughly 5,000 to 8,000 karearea left.",
      "<p>The country’s fastest bird has taken out the top prize in a scandal-free year for the annual poll</p><p>New Zealand’s fastest bird, capable of flying 200km/h in its pursuit of prey, has been crowned bird of the year – a long-running annual competition that has previously been a lightning rod for "
    ],
    "image_url": "",
    "titles": [
      "New Zealand's only falcon wins annual bird election",
      "Threatened kārearea falcon wins New Zealand’s 2025 bird of the year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The karearea, New Zealand's fastest bird capable of speeds up to 200km/h, was named Bird of the Year. With an estimated population of 5,000 to 8,000, this recognition comes in a year free from the controversies that have marked previous competitions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown Looms, Stocks Stay Resilient in September",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:12:54 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5iWldBRFA4eWd0VkFPZHdBcTg4bFh0N2xxUTZ4NWdTajN6RGYzOGQ4dDlNU2V2dG5raXhjWTJENUlybF9fM280RnJhXzFHcmMxNkh0YmZ4OXpkMDdxSXFGcTJqOExrcjZkUzh0a2FIY01oWlBnWXUxY2w3ODg?oc=5\" target=\"_blank\">No one wants to shoulder the government shutdown blame</a>&n",
      "Stocks are defying their typical weakness in September — but it isn’t October yet"
    ],
    "image_url": "",
    "titles": [
      "No one wants to shoulder the government shutdown blame - Axios",
      "The last thing the stock market wants right now is a government shutdown. Here’s why."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.813,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amid concerns over a potential government shutdown, no party is willing to take the blame for the impasse. Meanwhile, contrary to usual trends, stock markets have shown resilience in September, although the situation could change with the arrival of October.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]