[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff members shared their favorite tech and gadgets, ranging from recent purchases to items they've owned for years, including office tools and kitchen gadgets. This collection showcases a variety of products that have been highlighted for their usefulness and appeal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8956953368865741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4339238342216435,
    "summary": "Verge staff shared their top tech and gadgets, covering both recent buys and long-owned items. The selection spans office tools to kitchen gadgets, emphasizing their utility and attractiveness."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, running until March 31, 2025. The event features discounts on gardening supplies, bedding, and other seasonal items, coinciding with the onset of warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7159036696875001,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.388975917421875,
    "summary": "Amazon has initiated its Big Spring Sale, which will continue through March 31, 2025. The sale offers reduced prices on a variety of products, including gardening supplies and bedding, aligning with the arrival of spring."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a rewarding experience for players. The game's precise demands on players to embody a shinobi character enhance its appeal and effectiveness in the Assassin's Creed franchise."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6646883912152779,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37617209780381944,
    "summary": "Assassin's Creed Shadows introduces new advanced stealth and assassination mechanics, offering a rewarding experience by requiring players to accurately portray a shinobi character. This addition enhances the game's appeal within the Assassin's Creed series."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is a gaming laptop aimed to be an alternative to the MacBook Pro, featuring a design that is both thinner and lighter compared to its previous generation. It is designed to appeal to users who prefer gaming laptops that maintain a conventional laptop appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6230217240162037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36575543100405095,
    "summary": "The Razer Blade 16 is a new gaming laptop designed to compete with the MacBook Pro, offering a thinner and lighter design than its predecessors. It targets users who want gaming laptops with a traditional appearance."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various settings needing additional light. It is rechargeable, compact, and features three adjustable LED panels that emit 3000 lumens, making it ideal for use in areas such as campsites, workspaces, or for automotive repairs."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3390865383680556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.29477163459201394,
    "summary": "BougeRV has released a rechargeable LED lantern designed for outdoor camping and various lighting needs. It is compact and features three adjustable LED panels with a brightness of 3000 lumens, making it suitable for campsites, workspaces, and automotive repairs."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) until a final decision is made in the ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.005324963865740884,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2113312409664352,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from taking apart the Consumer Financial Protection Bureau (CFPB) until a final court decision is reached."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft is updating Windows 11 to remove a bypass that allowed users to set up their devices without an internet connection and logging in. This change, announced in the latest Windows 11 Insider Preview, means all Windows 11 devices will now require an internet-connected account for setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.001331907916666597,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.21033297697916664,
    "summary": "Microsoft announced in the latest Windows 11 Insider Preview that all Windows 11 devices will now require an internet connection and a Microsoft account for setup, removing the previous option to bypass these requirements."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Efforts to find survivors are being hindered by a severe shortage of equipment, inconsistent communication, and damaged roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Search and rescue operations are facing challenges due to a lack of equipment, poor communication, and damaged infrastructure, making it difficult to locate survivors."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with BBC, describing it as \"incredible\" that bombs would be dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur condemned the military for dropping bombs during rescue operations in an interview with the BBC, labeling the actions as \"incredible.\""
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, prompting rescue operations to save individuals trapped in the debris. Rescuers are actively working to extract survivors from the wreckage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to rescue efforts to save people trapped under the debris. Rescue teams are currently working to find and save survivors from the collapsed structure."
  },
  {
    "title": "Pro-democracy protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Demonstrators rallied in support of opposition leader Ekrem Imamoglu, who claims his arrest was politically motivated."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Demonstrators gathered to back opposition leader Ekrem Imamoglu, arguing his arrest was politically motivated."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk in the Danish territory, Andrew Harding discovered that many locals feel pressured or bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During a visit to Nuuk, the capital of Greenland, journalist Andrew Harding reported that numerous residents feel coerced or intimidated by the United States. This sentiment is prevalent in the Danish territory, reflecting concerns among the local population regarding their interactions with the US."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has resulted in 21 people being injured. The blaze affected a restaurant and several other buildings, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire broke out in a city, injuring 21 people. The incident involved a restaurant and multiple buildings, as confirmed by local officials."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya, a restaurant chain, has temporarily shut down after reports emerged of customers discovering an insect and a rat in their meals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a restaurant chain, has temporarily closed its doors following reports from customers who found an insect and a rat in their meals."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul has reported that Ms. Hall is currently with Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul announced that Ms. Hall is with Qatari officials and is expected to return home shortly."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have passed away at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have died at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, a public figure, has been criticized after it was revealed that he used a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for using a disguise to promote his book on TV."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase do not belong to Somalia, therefore Somalia cannot give them away."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic argues that Somalia does not have the authority to relinquish control of the Berbera port and airbase, as these facilities are claimed to not be under Somalia's jurisdiction."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, expressing deep anguish over their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing people in Antigua have expressed their deep distress and anguish to the BBC over the disappearance of their loved ones."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence when the pardon was granted."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year prison sentence, has been pardoned for health reasons."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation into diversity and inclusion initiatives as part of a wider examination of these practices."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially those of celebrities, on a specific website. The initiative aims to improve the visual content by replacing or enhancing the existing images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to improve the quality of photos, particularly of celebrities, on a specific website. The project focuses on replacing or enhancing poor-quality images to improve the site's visual content."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An earthquake caused significant destruction, with its impact amplified by the magnitude of the quake and the extent of the fault line on which it occurred."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake resulted in widespread destruction, with the severity of the damage being influenced by the earthquake's magnitude and the size of the fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing widespread damage throughout the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, and a car seller interviewed by the BBC predicts further escalation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices have risen sharply, with a car seller interviewed by the BBC expecting prices to continue to climb."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their conduct while evacuating a military base in South Sudan amidst gunfire."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere in the world. Some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers received applause for successfully carrying Phyu Lay Khaing, a 30-year-old individual, to safety on a stretcher."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, a rescue operation was applauded for safely transporting 30-year-old Phyu Lay Khaing to safety using a stretcher."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday due to a powerful earthquake originating from neighboring Myanmar. Dozens of people are currently unaccounted for following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to a powerful earthquake from neighboring Myanmar. Dozens of people are missing following the collapse."
  },
  {
    "title": "Protesters in Tel Aviv say government responsible for captives’ fate",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:01:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Angry demonstrators in Israel are calling on the government to take action to ensure the release of individuals being held captive in Gaza."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Israel, demonstrators have expressed their anger by urging the government to intervene and secure the release of hostages being held in Gaza."
  },
  {
    "title": "Elon Musk protesters gather at Tesla showrooms",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 20:29:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Protesters have intensified their efforts against Tesla, focusing on both the company's dealerships and its vehicles. This action is part of a broader movement opposing Elon Musk."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Protesters targeting Tesla have escalated their actions, focusing on the company's dealerships and vehicles. This is part of a larger movement against Tesla's CEO, Elon Musk."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st off Cortes; win 20-9",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit a total of nine home runs in a game against the Brewers, with four homers scored off pitcher Nestor Cortes in the first inning, leading to a 20-9 victory on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees achieved a total of nine home runs in their game against the Brewers, securing a 20-9 win. Four of these home runs were scored off pitcher Nestor Cortes in the first inning."
  },
  {
    "title": "TCU wins as Van Lith into Elite Eight for 5th time",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "TCU's Hailey Van Lith scored 26 points, leading the Horned Frogs to a 71-62 victory over Notre Dame in the Sweet 16 round of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith of TCU scored 26 points, guiding the Horned Frogs to a 71-62 win against Notre Dame in the Sweet 16 of the women's NCAA tournament."
  },
  {
    "title": "Grizz GM: No player input on call to fire Jenkins",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Grizzlies General Manager Zach Kleiman did not consult with any team members before deciding to fire Taylor Jenkins as the team's coach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Grizzlies General Manager Zach Kleiman made the decision to fire Taylor Jenkins as the team's coach without consulting any team members beforehand."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trinity Rodman, a player for the US Women's National Soccer Team, has stated that she believes her back problems will not fully heal, indicating a long-term health concern."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Trinity Rodman, a member of the US Women's National Soccer Team, has acknowledged that her back issues are likely to be a persistent health problem, suggesting they may not completely resolve."
  },
  {
    "title": "Scherzer (lat) exits Jays debut after 3 innings",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut for the Toronto Blue Jays, 40-year-old Max Scherzer, a two-time World Series champion who joined the team in January, exited the game against the Baltimore Orioles after three innings due to right lat soreness, according to the team's announcement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Max Scherzer, a 40-year-old pitcher and two-time World Series champion, left his debut game for the Toronto Blue Jays after three innings because of right lat soreness. This incident occurred during a match against the Baltimore Orioles, following his team joining in January."
  },
  {
    "title": "Sources: Kansas frosh Bidunga to enter portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kansas freshman Flory Bidunga plans to enter the transfer portal, as confirmed by sources to ESPN. He has communicated his intentions to the Kansas coaching staff."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kansas freshman Flory Bidunga intends to enter the transfer portal, as confirmed by sources to ESPN. He has informed the Kansas coaching staff of his decision."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is declaring for the NBA draft and entering the transfer portal, according to his agent's statement to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, has announced through his agent that he is declaring for the NBA draft and entering the transfer portal."
  },
  {
    "title": "No. 2 WNBA prospect Miles still deciding future",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:54:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Notre Dame basketball player Olivia Miles, who is expected to be the second pick in the WNBA draft, has stated she is considering entering the draft but has not made a final decision yet."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Notre Dame basketball player Olivia Miles, anticipated to be the second pick in the upcoming WNBA draft, has expressed that she is contemplating entering the draft. However, she has not yet made a definitive decision."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:36:59 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston secured victories in their respective games. The event was followed by detailed analysis of both teams' performances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, both Auburn and Houston won their respective games. The victories were followed by detailed analyses of each team's performance."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:42:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, with the first four games being closely monitored. This phase marks a critical juncture in the competition as teams vie for a spot in the Elite Eight, moving one step closer to the championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has reached the Sweet 16 stage, with the first four games drawing attention. Teams are competing for a place in the Elite Eight, advancing towards the championship title."
  },
  {
    "title": "Yankees belt NINE home runs -- and Aaron Judge's chase for 63 is on",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:57:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A judge hit three home runs in a game, leading New York to set a new record in long ball history. This performance highlighted the player's exceptional talent."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A judge achieved a remarkable feat by hitting three home runs in a single game, setting a new record for New York in long ball history. This performance underscored the player's extraordinary talent."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an overview of what is at stake in each sports matchup, including updated playoff projections, draft lottery standings, and additional information related to the outcomes of these events."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article outlines the implications of various sports matchups, detailing updated playoff projections, draft lottery standings, and the potential outcomes of these events."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, evaluating each team's performance up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A panel has voted, assessing team performances up to April 17, to clarify the playoff field."
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:22:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's UFC Fight Night is the focus of predictions from an MMA coach and a betting insider, both making their picks on who has the edge in the upcoming fights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This week's UFC Fight Night has sparked predictions from both an MMA coach and a betting insider, who have shared their insights on which fighters they believe have the upper hand in the upcoming bouts."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State has been eliminated from their current competition. Looking forward to the next season, the focus shifts to portal priorities and incoming recruits for the Wolfpack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State has been eliminated from their current competition. The team is now focusing on their priorities in the transfer portal and the recruitment of new players for the upcoming season."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Women's tournament features detailed betting information, including lines, spreads, totals, and Basketball Power Index (BPI) ratings for each game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Women's tournament now offers comprehensive betting details for each game, covering lines, spreads, totals, and Basketball Power Index (BPI) ratings, providing gamblers with essential information for making informed decisions."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This rapid conversion demonstrates the facility's adaptability and the efficiency of the teams involved in the process."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This change showcases the adaptability of the facility and the efficiency of the teams responsible for the conversion."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Every team in the UFL is striving to surpass Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:11:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze scored a goal and provided an assist in Crystal Palace's 3-0 victory over Fulham on Saturday, securing their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze contributed a goal and an assist in Crystal Palace's 3-0 win against Fulham on Saturday, helping them advance to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:11:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving an award of over $20 million from a jury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against the Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, Bayern Munich, the Bundesliga leaders, secured the win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half, helping Bayern Munich to a 3-2 win over St Pauli on Saturday. As Bundesliga leaders, Bayern Munich maintained their position with this victory."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:11:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Captain Javi Puado scored a penalty for Espanyol, equalizing a match against Atletico Madrid after Cesar Azpilicueta's first-half goal. The game ended in a 1-1 draw, impacting Espanyol's fight against relegation and Atletico Madrid's position in LaLiga's top three."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Captain Javi Puado scored a penalty for Espanyol, securing a 1-1 draw against Atletico Madrid. This result came after Cesar Azpilicueta's first-half goal for Atletico. The draw affects Espanyol's battle to avoid relegation and Atletico Madrid's standing in LaLiga's top three."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 17:11:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle celebrated their first major domestic trophy in 70 years with an open-top bus parade through the city, marking the end of a long wait for such an achievement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle marked their first major domestic trophy win in 70 years with an open-top bus parade through the city, celebrating the end of a lengthy period without such an achievement."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat by Argentina on Tuesday."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators discovered that mutations in VPS35, a crucial component in a pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapies. This finding could aid in identifying tumors that are resistant to treatments."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Investigators found that mutations in VPS35, a key part of a pathway utilizing reactive oxygen species (ROS) to destroy cancer cells, may cause resistance to chemotherapy. This discovery could help identify tumors that are resistant to treatment."
  }
]