[
  {
    "title": "U.S. Economy Grows 3% in Q2, Reversing Earlier Decline",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 09:03:59 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "Axios",
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The U.S. economy grew this spring after a slowdown earlier this year.  A report from the Commerce Department shows the nation's GDP grew at an annual rate of 3% in the second quarter of the year.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5uUlJQdllibFN3ZjRCYmNXS1V0ZGhsZ2FXX1FKOTdjR3QwX1dmaGNhWGloQzlUMVhaUHl4RC12eXQ1OFNKMXplUUhKNlJaOVFHblViOE9mcml3V21PTno0RlJuU3pucGRYZXNrN0Ffc01FSkU?oc=5\" target=\"_blank\">U.S. economy returns to growth in second quarter on trade swings</a>&nbs",
      "Rebound masks significant slowdown in first half of year as tariffs distort GDP statistics",
      "A turnaround marked a reversal from a decline of 0.5% for the first quarter."
    ],
    "image_url": "",
    "titles": [
      "The U.S. economy rebounds to 3% growth in second quarter — but tariffs skew picture",
      "U.S. economy returns to growth in second quarter on trade swings - Axios",
      "US economy grew at 3% rate in second quarter",
      "U.S. Economy Rebounded In Second Quarter As GDP Rises 3%"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.937,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.869,
    "summary": "The U.S. economy experienced growth in the second quarter of the year, expanding at an annual rate of 3% according to a Commerce Department report. This growth marks a reversal from the first quarter, during which the economy declined by 0.5%. The report highlights that trade swings have contributed to this rebound, despite a significant slowdown in economic activity earlier in the year.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the U.S. economy's growth, which can inform decision-making in various sectors. It also offers some context for the growth, noting the role of trade swings, but it doesn't delve into potential solutions or improvements for maintaining this growth.",
    "image": {
      "src": "https://live.staticflickr.com/2698/4159109316_98c7714dba.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7dbda1fc-a94b-46e6-8c5a-7d5e6639f242/thumb/",
      "alt": "Economy Growing",
      "credit": "Speaker Nancy Pelosi / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Criticizes India's Trade, Imposes 25% Tariff on Goods",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 14:20:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The US president said while India &#039;is our friend&#039;, it imposes stiff tariffs on US goods and buys too much Russian oil.",
      "US President Donald Trump criticized Indian trade policies and the decision to buy weapons from Russia while announcing that the US would impose tariffs of 25% on India.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE4xeWo3MEJkVF9QbHZMSFhWWWFIRWs3UlN4ajI3TnJ4UE9pQnYzdjlYUVZhWkpQVmRLWGNsektnSWJZYTNEZENQZ1ZZYi1fSDFveE1yXzlMVGFwRHFCSUZZSHd6TkpiVWtHRDVpNUowZHJTdFZIYzVWdll0Zw?oc=5\" target=\"_blank\">Trump says India will likely face a 20% to 25% tariff</a>&nbs",
      "The 25% tariff rate is modestly lower than what he imposed on India on \"Liberation Day,\" when he announced a 26% rate on the key trading partner.",
      "US president lashes out at New Delhi’s trade policies and economic ties with Russia",
      "<p>US president calls Delhi a friend but criticises policies such as buying arms and energy from Russia amid Ukraine war</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jul/30/mercedes-benz-porsche-aston-martin-toyota-donald-trump-tariffs-eurozone-gdp-us-business-live-news\">Bus"
    ],
    "image_url": "",
    "titles": [
      "Trump hits India with 25% tariff, extra ‘penalty’ for Russian oil purchases",
      "Trump to impose 25% tariff on India",
      "Trump says India will likely face a 20% to 25% tariff - Axios",
      "Trump announces 25% tariff on India plus 'penalty' for trade with Russia",
      "Trump hits India with 25% tariffs and unspecified ‘penalty’",
      "Trump imposes 25% tariff on India plus ‘penalty’ over ties to Russia"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.846,
    "summary": "US President Donald Trump criticized India for its trade policies and purchasing weapons from Russia, labeling India as a friend but expressing concerns over its economic actions. In response, Trump announced the US would impose a 25% tariff on Indian goods, slightly lower than the previously stated 26% on \"Liberation Day.\" This move highlights tensions between the US and India regarding trade imbalances and India's energy and arms dealings with Russia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing trade tensions between the U.S. and India. However, it lacks depth in terms of exploring the potential impacts of these tariffs, and it doesn't report on any attempts to solve these trade issues.",
    "image": {
      "src": "https://live.staticflickr.com/1004/4729221809_0976378ff3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e5193e5e-dc4e-4a16-8880-5d1b0ca24abc/thumb/",
      "alt": "The Growth of Fair Trade",
      "credit": "GDS Infographics / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "8.8 Magnitude Earthquake off Kamchatka Triggers Pacific-Wide Tsunami Warnings",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 14:44:42 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "BBC",
      "Washington Post",
      "CityNews",
      "Deutsche Welle",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The 8.8 magnitude earthquake is believed to be one of the most powerful ever recorded.",
      "A magnitude 8.8 quake hit Russia’s Kamchatka Peninsula, prompting tsunami warnings as far away as the US West Coast.",
      "A powerful earthquake off Russia's east coast has triggered evacuations throughout the Pacific, from Japan to Peru. The US states of Hawaii and California are also impacted by the waves. DW has the latest.",
      "The earthquake, which struck early Wednesday, triggered evacuation orders in Hawaii and Japan.",
      "<p>Quake of 8.8 magnitude hit near Russia’s Kamchatka peninsula and reportedly caused waves up to 4 metres high</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jul/30/tsunami-alert-pacific-islands-japan-russia-magnitude-8-earthquake-follow-live-updates\">Tsunami warning – live upda",
      "The year’s strongest earthquake struck off Russia’s Kamchatka Peninsula, triggering tsunami warnings and advisories in Hawaii, California, Oregon and Washington.",
      "TOKYO (AP) — One of the strongest earthquakes ever recorded struck off Russia’s sparsely populated Far East early Wednesday, sending tsunami waves into Japan, Hawaii and the U.S. West Coast. Several people were injured, but none gravely, and no major damage has been reported so far. Authorities warn"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/07d1/live/b1fe23a0-6d27-11f0-8dbd-f3d32ebd3327.jpg",
    "titles": [
      "Have the tsunami waves caused any damage so far?",
      "Tsunami waves hit Hawaii, Japan after Russia quake: What we know so far",
      "Tsunami waves hit Hawaii, California after Russia earthquake",
      "Tsunami waves reach California and Hawaii after massive earthquake in Russia",
      "Tsunami alerts from Japan to US after powerful earthquake off Russia",
      "Tsunami live updates: Waves reach Hawaii, California after 8.8-magnitude Russia quake",
      "8.8 magnitude quake strikes off Russia’s Far East. Tsunami waves reach Japan, Hawaii and California"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.97,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "An 8.8 magnitude earthquake off Russia's Kamchatka Peninsula, one of the strongest ever recorded, triggered tsunami warnings across the Pacific, affecting areas from Japan to Peru, including the US states of Hawaii and California. The quake, occurring early Wednesday, led to evacuations but resulted in no grave injuries or major damage. Tsunami waves reached up to 4 meters high.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides awareness about a significant natural disaster and its immediate impacts, it doesn't offer much in terms of actionable insights or deeper understanding. There's no discussion of the systems in place for dealing with such events, or any potential improvements or solutions for mitigating future damage.",
    "image": {
      "src": "https://live.staticflickr.com/8703/17557928942_b5195e10b8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e778bf4f-ea76-4f92-a67f-548a8d37d1ea/thumb/",
      "alt": "7.3 magnitude earthquake in Nepal [Image 3 of 3]",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK to Recognize Palestine if Israel Rejects Ceasefire and Peace Steps",
    "domain": "general",
    "location": "global",
    "published": "2025-07-29T23:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "Washington Post",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Prime Minister Keir Starmer said the UK would make the move unless Israel agrees to a ceasefire in Gaza and meets other conditions. Israel has slammed the announcement, saying it \"rewards\" Hamas.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOb2dtYkZpRDBiNWtXZ3A4TmdBTV9oeC04RjRGejFBZC1mMnBwRkw1Q1FrZkoxTXdEWnFneExCSkZIaUtPcnYxNV90SGUyX0R2UUZsRHcyck5PM1RqN3FyeXJwUFdCN1lJLUJxU0lOUk9rYlFxS1E2R1htVTZqanRoZQ?oc=5\" target=\"_blank\">U.K. to recognize Palestine in September if Israel do",
      "The U.K. leader’s demands came amid what he said was British revulsion over starvation in Gaza.",
      "Prime Minister Keir Starmer said his government would act unless there was a truce, citing the “intolerable” humanitarian crisis in Gaza."
    ],
    "image_url": "",
    "titles": [
      "UK to recognize Palestine state unless Israel stops Gaza war",
      "U.K. to recognize Palestine in September if Israel doesn't change course - Axios",
      "Starmer vows to recognize Palestinian state unless Israel shifts Gaza policy",
      "UK Will Recognize Palestinian Statehood In September, Unless Israel-Hamas Cease-Fire is Reached"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.71,
      "consensus": 0.935,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "UK Prime Minister Keir Starmer announced that the UK will formally recognize Palestine as a state in September unless Israel agrees to a ceasefire in Gaza, allows U.N. aid, and takes steps toward long-term peace. This decision comes amid growing domestic pressure and the \"increasingly intolerable\" humanitarian situation in Gaza, according to Starmer. Israel's Prime Minister Benjamin Netanyahu criticized the move, claiming it rewards Hamas. The UK's stance was confirmed following an emergency Cabinet meeting focused on the Middle East crisis.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights a potential solution (recognition of Palestine) to the ongoing Middle East crisis. It provides useful information about the UK's stance and the conditions under which it would recognize Palestine. It also increases awareness about the humanitarian situation in Gaza and the domestic pressures influencing the UK's decision.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "8.8-Magnitude Earthquake Strikes Off Kamchatka, Among Top Six Recorded",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 13:24:23 +0000",
    "source": "Washington Post",
    "sources": [
      "The Guardian",
      "Phys.org",
      "Washington Post"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "The 8.8-magnitude earthquake that struck Russia’s Kamchatka Peninsula could be among the six strongest on record, according to U.S. geological authorities.",
      "<p>An 8.8-magnitude quake off the coast of Russia set off tsunami warnings – how does it compare with past temblors?</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jul/30/tsunami-alert-pacific-islands-japan-russia-magnitude-8-earthquake-follow-live-updates\">Tsunami updates – foll",
      "Today at about 11:30am local time, a magnitude 8.8 earthquake struck off the coast of Russia's Kamchatka Peninsula in the country's far east."
    ],
    "image_url": "",
    "titles": [
      "Earthquake off Russia’s coast is among strongest ever recorded",
      "What are the strongest earthquakes ever recorded?",
      "Kamchatka earthquake is among top 10 strongest ever recorded. Here's what they have in common"
    ],
    "score_components": {
      "magnitude": 0.87,
      "recency": 0.943,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary": "An 8.8-magnitude earthquake hit off the coast of Russia's Kamchatka Peninsula at approximately 11:30am local time. This quake is considered one of the six strongest recorded, as per U.S. geological authorities. Tsunami warnings were issued following the seismic event.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a major earthquake and its potential impact, including the issuance of tsunami warnings. However, it lacks depth or insight into the causes, potential solutions for disaster management, or the broader implications of such seismic events.",
    "image": {
      "src": "https://live.staticflickr.com/5589/15147968852_3f9aa97d20_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d73b4de-e43e-44cd-afdc-e561e58e8ee0/thumb/",
      "alt": "Staraya Russa, Russia",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "London Court Allows Challenge Against Palestine Action Ban",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:27:46 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The group's co-founder wins a bid to bring a legal challenge after the government banned it as a terror organisation.",
      "<p>Huda Ammori argued that home secretary’s decision to proscribe group under terrorism laws was ‘abuse of power’</p><p>The co-founder of Palestine Action can bring a legal challenge to the home secretary’s decision to ban the direct action group under anti-terrorism laws, a high court judge has rul",
      "A High Court judge in London said that Palestine Action had the right to challenge the British government’s decision to ban it as a terrorist group."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/30fb/live/28e84d60-6d41-11f0-9462-bb509dc78127.jpg",
    "titles": [
      "Palestine Action can challenge UK ban, court rules",
      "Palestine Action co-founder wins permission to challenge ban",
      "Pro-Palestinian Protest Group Can Appeal U.K. Ban, Judge Rules"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.984,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary": "A High Court judge in London has ruled that Huda Ammori, co-founder of Palestine Action, can legally challenge the UK home secretary's decision to ban the group as a terrorist organization. Ammori argued that the proscription under anti-terrorism laws was an 'abuse of power.' This ruling allows Palestine Action to contest the government's ban, marking a significant step in their legal battle against the designation.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about a significant legal development, giving readers a deeper understanding of the UK's anti-terrorism laws and their application. However, it doesn't report on solutions or improvements, nor does it provide a comprehensive view of the broader political context.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/High_Court_of_Australia_%286769096715%29.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ac7076c1-88f8-442b-91b1-62c70d61eec6/thumb/",
      "alt": "High Court of Australia (6769096715)",
      "credit": "Alex Proimos from Sydney, Australia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "U.S. Economy Grows 3% in Q2, Surpassing Expectations",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 08:50:03 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "Business Insider",
      "ABC News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The U.S. economy has largely defied fears of a tariff-induced downturn.",
      "Gross domestic product was expected to grow at a 2.3% annualized pace in the second quarter, according to the consensus estimate.",
      "Real GDP unexpectedly rose at an annualized rate of 3% in the second quarter, strongly rebounding after a contraction in the first quarter."
    ],
    "image_url": "https://s.abcnews.com/images/Business/grocery-store-gty-jt-250729_1753816578346_hpMain_4x3t_384.jpg",
    "titles": [
      "US economy grew more than expected as Trump's tariffs took hold",
      "U.S. economy grew at a 3% rate in Q2, a better-than-expected pace even as Trump's tariffs hit",
      "US economic growth was hotter than expected last quarter"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.932,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary": "The U.S. economy outperformed expectations in the second quarter, with real GDP growing at an annualized rate of 3%, surpassing the consensus estimate of 2.3%. This growth marks a significant rebound from a contraction in the first quarter, indicating the economy has resisted fears of a tariff-induced downturn.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of the current state of the U.S. economy, which can inform readers' decision-making in a variety of areas. It also reports on positive progress in the economy. However, it does not delve into the causes or potential impacts of this growth, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/2698/4159109316_98c7714dba.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7dbda1fc-a94b-46e6-8c5a-7d5e6639f242/thumb/",
      "alt": "Economy Growing",
      "credit": "Speaker Nancy Pelosi / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Yankees Acquire Outfielder Austin Slater from White Sox Ahead of Trade Deadline",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:46:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Austin Slater is a backup outfielder for the Yankees, even with Aaron Judge hurt",
      "According to Jack Curry of YES Network, the Yankees are trading for Austin Slater on Wednesday, on the eve of MLB’s trade deadline.",
      "<p>The New York Yankees have acquired outfielder Austin Slater in a trade with the Chicago White Sox, ESPN&#8217;s Jeff Passan reported Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/ac9c2084-e907-4fed-9841-477b3a44c26f/austin-slater-getty.png",
    "titles": [
      "Yankees trade for White Sox outfielder in another depth move ahead of deadline",
      "Austin Slater trade: Yankees acquiring White Sox outfielder, report says",
      "Yankees acquire OF Austin Slater in trade with White Sox"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary": "The New York Yankees acquired outfielder Austin Slater in a trade from the Chicago White Sox, as reported by ESPN's Jeff Passan and confirmed by Jack Curry of YES Network. This move, made on the eve of MLB's trade deadline, adds Slater to the Yankees' roster as a backup outfielder, even as Aaron Judge is injured.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs the reader about the trade between the Yankees and the White Sox, providing useful context about the state of the team and its strategy ahead of the trade deadline. However, it does not clearly highlight progress, solutions, or empowering knowledge.",
    "image": {
      "src": "https://live.staticflickr.com/7084/7150603369_ce7930655b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/31217638-f9e5-4b29-8e51-89973802de95/thumb/",
      "alt": "Harry Caray (1914-1998) -- Bleachers Entrance Wrigley Field Chicago (IL) 2012",
      "credit": "Ron Cogswell / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sportsnet Launches Trade Tracker for Major League Roster Updates",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 19:00:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "You know the major leaguers on the move -- but what about the potential stars of tomorrow headed the other way in those deals?",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNSmFfR3l2d3NpZXYxS29PVVE3QWJkVDNEM3lrdnRjSTZ6blhrVnlZY0JQTGZmZ2h6U1ljQ2RJV2dPQ3dncWlJcGptR1RqMGduYWsteU5GTzkzMGhMbkVjYjd6MTNidUo4RzJXZkdfOTBzQTM4elBUOXViSzVJYVc3ZUx3?oc=5\" target=\"_blank\">Four Ideal Fits for Dodgers at 2025 MLB Trade Deadl",
      "<p>With contending teams ready to bolster their rosters for the post-season push, you can stay up to date with every trade made before the deadline in Sportsnet&#8217;s trade tracker below.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ranking every prospect dealt before the 2025 MLB trade deadline",
      "Four Ideal Fits for Dodgers at 2025 MLB Trade Deadline - Sports Illustrated",
      "2025 MLB Trade Deadline Tracker: Every move made"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.699,
      "consensus": 0.847,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary": "Sportsnet's trade tracker offers updates on all major league trades before the deadline, focusing not only on current stars but also on potential future talents moving between teams. This tool is designed to keep fans informed about roster changes as contending teams strengthen their lineups for the post-season.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it introduces a new tool for fans to stay informed about roster changes in Major League Baseball. It empowers the reader with actionable insights and a deeper understanding of the dynamics of player trades. It also highlights an innovation in the way sports news is reported."
  },
  {
    "title": "Vince McMahon Accused in Connecticut Highway Crash Involving 3 Cars",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 11:39:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Former WWE CEO Vince McMahon is accused of causing a crash on a Connecticut highway that wrecked his Bentley and damaged two other cars.",
      "McMahon allegedly rear-ended a BMW on a Connecticut highway with debris hitting a third vehicle",
      "<p>Former WWE CEO Vince McMahon is accused of causing a crash on a Connecticut highway that wrecked his Bentley and damaged two other cars, a few hours before Hulk Hogan&#8217;s death hit the news and he was quoted praising the wrestling icon.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ex-WWE boss McMahon cited over 3-car crash",
      "Former WWE CEO Vince McMahon cited for reckless driving in Connecticut highway crash",
      "Former WWE boss Vince McMahon cited for reckless driving in Connecticut crash"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.988,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary": "Former WWE CEO Vince McMahon is accused of causing a highway crash in Connecticut, where his Bentley rear-ended a BMW, leading to debris hitting a third vehicle. The incident, which resulted in the wrecking of McMahon's Bentley and damage to two other cars, occurred hours before the news of Hulk Hogan's death, after which McMahon praised the wrestling icon.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic information about the accident but does not provide any actionable insights or deeper understanding to the reader. It does not report on any solutions or improvements, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/6182/6128808470_2345e9f038_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6ed414b0-1721-48a7-a77e-7e366a1cb4cc/thumb/",
      "alt": "Sediment Spews from Connecticut River",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ollie Pope to Captain England in 5th Test vs India, Stokes Injured",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 11:23:12 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Ollie Pope leads England in place of captain Ben Stokes, who has been ruled out of the fifth Test against India starting at The Oval on Thursday.",
      "<ul><li><p>Shoulder tear likely to require seven weeks of rehab</p></li><li><p>Ollie Pope to lead England, while Jofra Archer is rested</p></li></ul><p>Ben Stokes has been ruled out of the final Test match of England’s international summer with a grade-three muscle tear in his shoulder, aggravated d",
      "Ben Stokes has been ruled out of England's fifth Test against India, with the hosts making four changes for the Kia Oval fixture."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/799e/live/ae8af710-6d41-11f0-af20-030418be2ca5.jpg",
    "titles": [
      "'The risk is too high' - Stokes to miss fifth Test",
      "Ben Stokes ruled out of crunch fifth Test with India: ‘The risk was way too high’",
      "Stokes ruled out of fifth Test vs India as England change four"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.904,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary": "Ollie Pope will captain England in the fifth Test against India at The Oval, replacing Ben Stokes who has been sidelined due to a grade-three shoulder muscle tear. Stokes' injury is severe enough to likely require seven weeks of rehabilitation. Alongside this change, England has made four adjustments to their lineup for the match, including resting Jofra Archer.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about changes in the lineup for an upcoming cricket match due to an injury. However, it doesn't provide deeper insights into the implications for the team's performance, the injury's impact on the player's career, or broader trends in the sport.",
    "image": {
      "src": "https://live.staticflickr.com/8452/8056788637_aaec69b15b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cd137efb-1932-4455-bcb4-4ed571aeca3a/thumb/",
      "alt": "Frank Dombrowski (left) of the United States and Captain W. Drinkwater of Canada, rival captains... / Frank Dombrowski (à gauche) des États-Unis et le capitaine W. Drinkwater du Canada, les capitaines des équipes rivales...",
      "credit": "BiblioArchives / LibraryArchives / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Olympic Biathlon Champion Laura Dahlmeier Dies in Mountaineering Accident",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 13:56:08 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Two-time Olympic champion Laura Dahlmeier dies aged 31 after a mountaineering accident in Pakistan.",
      "Two-time Olympic champion Laura Dahlmeier dies aged 31 after a mountaineering accident in Pakistan.",
      "German Olympic star Laura Dahlmeier has been confirmed dead following a mountaineering accident in Pakistan. Adverse weather conditions had hampered attempts to rescue the former Olympic champion.",
      "<ul><li><p>Former biathlete struck by rockfall at altitude of 5,700m</p></li><li><p>Tributes paid to athlete ‘with heart, attitude and vision’</p></li></ul><p>The German double Olympic biathlon champion Laura Dahlmeier has died after a mountaineering accident in Pakistan, her management confirmed on"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2089/live/7d712990-6d43-11f0-9462-bb509dc78127.jpg",
    "titles": [
      "Olympic star Dahlmeier dead after climbing accident",
      "Olympic star Dahlmeier, 31, dead after climbing accident",
      "German Olympic star Dahlmeier confirmed dead in Pakistan",
      "German Olympic champion Laura Dahlmeier dies after mountaineering accident in Pakistan"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.954,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "Laura Dahlmeier, a German two-time Olympic biathlon champion, has died at the age of 31 following a mountaineering accident in Pakistan. The accident, which involved a rockfall at an altitude of 5,700 meters, led to her death despite efforts for rescue, hindered by adverse weather conditions. Tributes have been paid to Dahlmeier, highlighting her heart, attitude, and vision.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the tragic accident, it does not offer any actionable insights or deeper understanding to the reader. It does not report on any solutions or improvements, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/7243/7370183804_89215baac7.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bb3f9c7f-0ca8-4b3a-9ce9-4ef3911218d5/thumb/",
      "alt": "“Angela Merkel thinks we're at work” flag makes the front page of German tabloid newspaper Bild, #DontTellMerkel",
      "credit": "dullhunk / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Léon Marchand Sets New World Record in 200m Medley",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 11:39:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Léon Marchand broke the world record in the 200-meter individual medley Wednesday at the world championships in Singapore, clocking 1 minute, 52.61 seconds, to surpass the 1:54.00 set in 2011 by Ryan Lochte.",
      "<p>Léon Marchand broke the world record in the 200-metre individual medley on Wednesday at the world championships in Singapore, clocking 1 minute, 52.61 seconds to surpass the 1:54.00 set in 2011 by American Ryan Lochte.</p>"
    ],
    "image_url": "",
    "titles": [
      "Marchand breaks Lochte's 200m medley record",
      "French star Leon Marchand breaks world record in 200 IM"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.988,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.731,
    "summary": "French swimmer Léon Marchand set a new world record in the 200-meter individual medley at the world championships in Singapore, finishing in 1 minute, 52.61 seconds. This time beat the previous record of 1:54.00 set by American Ryan Lochte in 2011. Marchand's achievement marks a significant milestone in the sport of swimming.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it highlights an achievement and progress in the sport of swimming. It provides empowering knowledge about Léon Marchand's new world record, which can inspire readers and give them a deeper understanding of the sport.",
    "image": {
      "src": "https://live.staticflickr.com/1879/43312917225_bfccba7749_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/39a1d97e-2b94-4857-b167-ae82da66d687/thumb/",
      "alt": "1949 Delahaye 175 S Saoutchik Roadster (French)",
      "credit": "Ronald Douglas Frazier / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Meta Focuses on AI and Smart Glasses Ahead of Q2 Earnings",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:23:02 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Meta reports second-quarter earnings on Wednesday, so Zuckerberg's letter gives investors a glimpse into his AI strategy.",
      "Mark Zuckerberg wrote in a letter that smart glasses and other personal devices will become \"our primary computing devices\" in the future."
    ],
    "image_url": "",
    "titles": [
      "Zuckerberg shares AI 'personal superintelligence' vision after spending billions on top talent",
      "Mark Zuckerberg just shared his vision for 'personal superintelligence.' Read his letter."
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.983,
      "consensus": 0.632,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary": "Meta is set to report its second-quarter earnings on Wednesday. Ahead of this, Mark Zuckerberg released a letter highlighting the company's AI strategy, emphasizing the future role of smart glasses and personal devices as primary computing tools. This announcement offers investors insight into Meta's direction and priorities.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for investors and a deeper understanding of Meta's future direction and priorities. It highlights the company's focus on AI and smart glasses, thus increasing clarity around trends in the tech industry.",
    "image": {
      "src": "https://live.staticflickr.com/5061/5616191299_6cc66cddfa_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/861fefb9-97cd-47b8-baae-ca977cc4553a/thumb/",
      "alt": "Did Kubrick channel Bacon?",
      "credit": "Ben Ledbetter, Architect / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Admin Cites Public Interest in Epstein, Maxwell Crimes",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:36:55 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The Trump administration in new court filings said the public has a \"clearly expressed interest\" in \"effrey Epstein’s and Ghislaine Maxwell’s crimes.\"",
      "<p>‘Rule of five’ requires government agencies to provide relevant information if at least five members of the committee request it</p><p>On Capitol Hill today, Senate Democrats – led by minority leader <strong>Chuck Schumer</strong> – will hold a press conference at 12pm ET to discuss their plans t"
    ],
    "image_url": "",
    "titles": [
      "Senate Democrats seek Jeffrey Epstein files from Trump administration through obscure law",
      "Senate Democrats use rare law to push for Epstein files release – US politics live"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.988,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary": "The Trump administration has stated in court filings that there is a significant public interest in the crimes of Jeffrey Epstein and Ghilaine Maxwell. This statement aligns with the \"rule of five,\" which mandates government agencies to release pertinent information upon request by at least five committee members. Concurrently, Senate Democrats, headed by Minority Leader Chuck Schumer, are set to hold a press conference to outline their strategies regarding this matter, emphasizing the ongoing political and legal scrutiny surrounding Epstein and Maxwell's crimes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the ongoing political and legal scrutiny surrounding Epstein and Maxwell's crimes. It informs readers about the 'rule of five' and its implications, thereby contributing to the reader's decision-making process. However, it does not offer any solutions or progress towards addressing the underlying issues.",
    "image": {
      "src": "https://live.staticflickr.com/5282/5322370352_fb3b83fe16_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c9f229ca-1454-4233-8941-20313f652a5d/thumb/",
      "alt": "Brager-Gutman Building/Epstein's (1929), 201-213 W. Lexington Street, Baltimore, MD 21201",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK Air Traffic Control Issue Fixed, Delays Possible",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:50:00 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Authorities say they have resolved issue but delays may still follow",
      "The disruptions came after a company that provides air traffic control services in Britain said it had experienced a “technical issue.”"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F56b4b7b5-4bb7-43f2-9004-3cabfbb32e92.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Flights from London grounded by ‘technical issue’ in air traffic control",
      "Departing Flights Are Grounded at London Airports"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.992,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary": "Authorities have resolved a technical issue that caused disruptions in air traffic control services in Britain. While the problem has been addressed, delays may still occur as a result of the incident.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the resolution of a technical issue that disrupted air traffic control services in Britain. However, it does not provide any insight into the cause of the issue, potential solutions to prevent such issues in the future, or the broader impact on the aviation industry.",
    "image": {
      "src": "https://live.staticflickr.com/1568/25453021162_523b656bf9_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2e502454-43ab-4466-82ed-35858ab50c4d/thumb/",
      "alt": "Sergeant Richard Shepherd & the New Zealand Cross",
      "credit": "Archives New Zealand / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Levis Surgery May Elevate Ward to Titans' Starting QB, Says Coach Callahan",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:18:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Levis' surgery paves the way for Ward to start the season as Tennessee's QB1",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE4tRlp5SGxJQTI3MVl3bHF0Ny0tMXZEUG5KMmVnNWs3ZkhYZk9PREtXSnlKbEJCdzFLLXFFZURtVm9idkNmYnB0YkotSGZjUjVvbUVSanBnVF9rWGdfSUNVanRRQ1JqY2w2d0kwX3NyX0t2bVZNQkQ4eFdB?oc=5\" target=\"_blank\">Titans' Brian Callahan Shares Update on Will Levis After QB's S"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/bed34adb-b776-4a36-8b1d-749fc1b3a2a4/willlevis.png",
    "titles": [
      "Titans' Brian Callahan shares conversation with Will Levis after surgery, explains where Cam Ward is improving",
      "Titans' Brian Callahan Shares Update on Will Levis After QB's Shoulder Surgery - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.981,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary": "Tennessee Titans quarterback Will Levis underwent surgery, potentially allowing Logan Ward to start the season as QB1. Coach Brian Callahan provided an update on Levis' condition, indicating a shift in the team's quarterback situation. The outcome is that Ward may take on a more prominent role due to Levis' surgery.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story usefully informs readers about a potential change in the Tennessee Titans' quarterback situation due to Will Levis' surgery. It provides context and insight into the team's strategy, even though the news is negative for Levis. However, it doesn't highlight any solutions or improvements, which would have made it more constructive.",
    "image": {
      "src": "https://live.staticflickr.com/65535/50350620677_92b2cc9fd1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8f219415-16db-453a-80e1-d049b265089e/thumb/",
      "alt": "Titan - Map Projected - July 25 2015",
      "credit": "Kevin M. Gill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cincinnati Bengals Release RB Zack Moss After Injury-Shortened Season",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 11:39:20 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Cincinnati Bengals released RB Zack Moss on Wednesday, the team announced.",
      "Moss tallied just 242 rushing yards and two touchdowns in an injury-shortened 2024 season"
    ],
    "image_url": "",
    "titles": [
      "Bengals release veteran RB Moss after 1 season",
      "Bengals release Zack Moss: Veteran RB was attempting comeback from broken neck suffered in 2024"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.988,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.691,
    "summary": "The Cincinnati Bengals announced the release of RB Zack Moss. In the 2024 season, Moss had 242 rushing yards and two touchdowns, but his season was cut short due to injury.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the release of Zack Moss from the Cincinnati Bengals due to an injury-shortened season. However, it doesn't provide much depth or insight into the implications for the team, potential replacements, or how this might affect the player's career.",
    "image": {
      "src": "https://live.staticflickr.com/5141/5670090313_4dc829de8d_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/28c47f0a-2166-41d4-9f44-b29947be5cfd/thumb/",
      "alt": "Cacao: moss on stems due to moist environment",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "SportsLine's Cohen Reveals Top Bets for 2025 Wyndham Championship",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:27:58 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "SportsLine expert Eric Cohen reveals his top 2025 Wyndham Championship prop bets at Sedgefield Country Club in Greensboro, NC",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPZFYtYk9OaFU1MFJFbzBnNk1xci13NzZBWWhlTWllbUw3ajlVcndiaVZZNEhoWnZkMFU2NGFFY3FDaGpMS21XemZlMnpuLU9fLThYNzdUUU9lNjlrcWt6c0R0a0Z2ZWF6VVJuMVFyaHpOanc4SUpBWldHUHVIelNBeFlQNnNZOTFj?oc=5\" target=\"_blank\">2025 Wyndham Championship Betting Models, P"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/1ffb97a3-eb91-4d74-84b6-3fb9b0ebf4ba/jake-knapp-imagn.jpg",
    "titles": [
      "2025 Wyndham Championship props, expert picks, predictions: PGA insider backing Jake Knapp at Sedgefield CC",
      "2025 Wyndham Championship Betting Models, Picks: Accuracy Vital at Short Sedgefield CC - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.985,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary": "Eric Cohen, a SportsLine expert, has disclosed his top prop bets for the 2025 Wyndham Championship, which will take place at Sedgefield Country Club in Greensboro, NC. This announcement provides bettors with expert insights and predictions for the upcoming golf tournament.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive in that it provides actionable insights for those interested in sports betting. However, it does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/7444/9520392082_d8150124ae_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2b9cae6d-91c7-42e8-b840-fb29b27cebc6/thumb/",
      "alt": "BMW 318d Touring Sportsline F31",
      "credit": "nakhon100 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ukraine Uses Drones to Strike Russian Military Sites Amid Conflict",
    "domain": "business",
    "location": "global",
    "published": "2025-07-30T13:52:59Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Ukrainian forces have used long-range drones to strike Russian air bases, ammunition storage sites, and other high-value military targets."
    ],
    "image_url": "https://i.insider.com/688a1b5d85e81483682eec91?format=jpeg",
    "titles": [
      "Satellite images show Russia built shelters for vulnerable aircraft after relentless drone strikes, intel says"
    ],
    "score_components": {
      "magnitude": 0.249,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Ukrainian forces have employed long-range drones to attack Russian air bases, ammo storage sites, and key military targets. The strikes are part of Ukraine's defense strategy amid the conflict with Russia. The outcome of these attacks is ongoing, with Ukraine aiming to weaken Russian military capabilities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some useful information about Ukraine's defense strategy in the ongoing conflict with Russia. However, it doesn't provide much depth or insight into the broader context of the conflict, the effectiveness of the drone strikes, or potential solutions to the crisis.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52234684507_87e7866f01_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ff51b4d7-0b41-4c73-87a9-923ab8a332c8/thumb/",
      "alt": "Starfield",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Top 3 MLB Pitcher Strikeout Props Identified for Wednesday's Games",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:04:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Wednesday's 15-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2023/08/10/86c60ec7-8afd-46a2-865f-23228d52db95/usatsi-dean-kremer-orioles.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Orioles starter against Blue Jays"
    ],
    "score_components": {
      "magnitude": 0.209,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "The SportsLine Projection Model analyzed all MLB games and pinpointed the top three pitcher strikeout props for Wednesday's 15-game lineup. This data-driven approach aims to provide insights for betting on pitcher performance. The identified props offer potential value for those interested in sports betting.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "Similar to the first story, this one provides actionable insights for sports bettors. It does not, however, report on progress or increase awareness around broader issues or trends.",
    "image": {
      "src": "https://live.staticflickr.com/8395/8674505872_0b39d3a96b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/34d01a23-274a-44fe-9d2b-a3d0bbf26e00/thumb/",
      "alt": "Flat-top Mountain - Anchorage",
      "credit": "Accretion Disc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "PlayerZero raises $15M to prevent AI agents from shipping buggy code",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "PlayerZero landed angel investors like Databricks' Matei Zaharia, Dropbox's Drew Houston, Figma's  Dylan Field, and Vercel's Guillermo Rauch, its founder says."
    ],
    "image_url": "",
    "titles": [
      "PlayerZero raises $15M to prevent AI agents from shipping buggy code"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of AI with PlayerZero raising funds to solve a specific problem - preventing AI agents from shipping buggy code. It provides useful information about the company's efforts and the potential impact on the industry.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trinity College Researchers Advance in Biomimicry for Material Development",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 12:00:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Half a billion years ago, nature evolved a remarkable trick: generating vibrant, shimmering colors via intricate, microscopic structures in feathers, wings and shells that reflect light in precise ways. Now, researchers from Trinity have taken a major step forward in harnessing it for advanced mater"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-unlock-natu.jpg",
    "titles": [
      "Programmable nanospheres unlock nature's 500-million-year-old color secrets"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "Researchers from Trinity College have made significant progress in utilizing a natural phenomenon that produces vibrant colors through microscopic structures in feathers, wings, and shells. This advancement, inspired by a method that evolved half a billion years ago, aims to apply this technique for the development of advanced materials.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on significant progress in the field of biomimicry, providing readers with a deeper understanding of the topic. It highlights an innovative approach to material development, which could have wide-ranging implications.",
    "image": {
      "src": "https://live.staticflickr.com/7424/14131389295_92337c4a58.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a41fd05f-b819-4ba9-a536-bd7bfcaccc97/thumb/",
      "alt": "NASA's Best-Observed X-Class Flare of All Time",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Biologist Uses Art to Simplify DNA Research for Public Understanding",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 10:42:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As a molecular biologist, talking to the public about my work with DNA has often felt like trying to translate a foreign language. This got me thinking: could these scientific ideas be presented in an artistic way, to help people engage with them?"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/forget-ai-generated-mu.jpg",
    "titles": [
      "Forget AI-generated music—this music was composed using DNA sequences"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "A molecular biologist explores the challenge of communicating complex DNA research to the public. They consider using art as a medium to make scientific ideas more accessible and engaging. This approach aims to bridge the gap between scientific communities and the general public by translating technical concepts into a more universally understandable form.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story highlights an innovative approach to improving public understanding of complex scientific research. It empowers readers with knowledge and potentially inspires similar initiatives in other fields.",
    "image": {
      "src": "https://live.staticflickr.com/8625/16520737809_fbd7005de1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6575dc81-0cf0-466c-bbb2-73ce9312a546/thumb/",
      "alt": "Krista Lundgren, #ScienceWoman",
      "credit": "USFWS Mountain Prairie / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Skechers is making kids’ shoes with a hidden AirTag compartment",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:13:18 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Skechers launches kids' shoes with built-in AirTag holder."
    ],
    "image_url": "",
    "titles": [
      "Skechers is making kids’ shoes with a hidden AirTag compartment"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information to parents about a new product that could potentially help keep their children safe. It also reports on an innovative solution to a common concern, making it fairly constructive.",
    "image": {
      "src": "https://live.staticflickr.com/7025/6488463511_e3720e0756_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cc3c3332-601e-4f97-a516-d6d202abef3f/thumb/",
      "alt": "CL Society 170: Skechers",
      "credit": "francisco_osorio / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "How 2 UC Berkeley dropouts raised $28 million for their AI marketing automation startup",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A marketing automation startup called Conversation has a founding story that sounds like it could have been an episode of the HBO show “Silicon Valley.”"
    ],
    "image_url": "",
    "titles": [
      "How 2 UC Berkeley dropouts raised $28 million for their AI marketing automation startup"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.444,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into how the two individuals raised a significant amount of funding for their startup. It can potentially offer actionable insights for readers who are interested in entrepreneurship, fundraising, or AI technology. However, without details on the specific strategies or solutions they used, it falls short of a higher score.",
    "image": {
      "src": "https://live.staticflickr.com/7302/12572168315_e61f78a8c8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/010c2f29-9f3e-4182-af36-376e6b1e44da/thumb/",
      "alt": "How To Make A Cyanotype Pt. 1 - 'THE STUFF'",
      "credit": "_-0-_ / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Africa's Carbon Impact Unclear Amid Conflicting Emission Studies",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 11:49:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Africa is a source of uncertainty in carbon cycle calculations. By some estimates, the continent's landscapes emit 2.1 billion tons more carbon dioxide than they take up each year—about equal to 1.5 times the annual emissions from coal-fired power plants. But other estimates are almost the complete "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/when-rain-falls-in-afr.jpg",
    "titles": [
      "Satellite data reveal African grasslands' carbon uptake rises with rainfall, unlike forests and savannas"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary": "Africa's role in the global carbon cycle is unclear, with estimates varying significantly. Some research suggests the continent emits 2.1 billion tons more CO2 annually than it absorbs, equivalent to 1.5 times the emissions from coal-fired power plants. However, other studies present nearly opposite findings, highlighting the need for more accurate data to understand Africa's true impact on global carbon emissions.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the uncertainties in global carbon emission data and highlights the need for more accurate studies. It does not offer solutions or specific actionable insights, but it does provide a deeper understanding of the complexities of carbon emissions.",
    "image": {
      "src": "https://live.staticflickr.com/5515/10677199886_146792d40f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1c3e1808-c1ee-4539-9ab3-7575b37fad63/thumb/",
      "alt": "Satellite Captures Eclipse Passing Over Africa",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Will online safety laws become the next tariff bargaining chip?",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-30T10:49:31-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "President Donald Trump and other Republicans have railed for years against foreign regulation of US tech companies, including online safety laws. As the US fights a global tariff war, it may bring those rules under fire - just as some of them are growing teeth. Over the past weeks, Trump has touted "
    ],
    "image_url": "",
    "titles": [
      "Will online safety laws become the next tariff bargaining chip?"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.44,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of the potential implications of online safety laws in the context of international trade. However, it doesn't provide clear solutions or progress on the issue."
  },
  {
    "title": "Harvest Portfolios Announces Final July 2025 T-Bill ETF Distribution",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 15:31:03 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "OAKVILLE, Ontario &#8212; Harvest Portfolios Group Inc. (“Harvest”) announces the final July 2025 cash distribution for the following distribution for the Harvest Canadian T-Bill ETF for the month ending July 31, 2025. The distribution will be paid on or about August 8, 2025 to unitholders of record"
    ],
    "image_url": "",
    "titles": [
      "Harvest ETFs Announces Final July 2025 Cash Distribution for the Harvest Canadian T-Bill ETF"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Harvest Portfolios Group Inc. has declared the final July 2025 cash distribution for the Harvest Canadian T-Bill ETF. The distribution will be paid around August 8, 2025, to unitholders of record.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful to the unitholders of the Harvest Canadian T-Bill ETF as it informs them about the final July 2025 cash distribution. However, it does not provide broader insights into the performance of the ETF, the reasons behind the distribution, or any potential impacts on the market.",
    "image": {
      "src": "https://live.staticflickr.com/6002/5975854912_ec86274ec4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/200c1b7b-8556-4266-9429-6e9adc71aab0/thumb/",
      "alt": "Open Water Diver - 23. Juli 2011 - TauchSport-Steininger",
      "credit": "TauchSport_Steininger / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Hermes Raises Prices in U.S. Due to Tariff Hikes",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 14:34:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Luxury-goods giant Hermes International has been passing along tariff increases to its U.S. customers."
    ],
    "image_url": "https://images.mktw.net/im-488888",
    "titles": [
      "There’s finally inflation from tariffs — in Hermes bags"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "Luxury brand Hermes International has been raising prices for its U.S. customers in response to tariff hikes. The company is passing on these increases to consumers, impacting the cost of their products in the U.S. This move reflects the ongoing trade tensions affecting the luxury goods market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the impact of tariff hikes on consumer goods prices, specifically in the luxury goods market. However, it doesn't provide solutions or deeper insights into the issue, hence the score.",
    "image": {
      "src": "https://live.staticflickr.com/3069/3110761639_46b2cf42f5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9929ce68-a87d-41c6-9c58-2e1d19e37135/thumb/",
      "alt": "Alexandre and Arianne, Two Lovers or Due Amanti, by Giulio Romano",
      "credit": "zugaldia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "DJI finally brings its impressive Amflow e-bike to US trails",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-30T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Starting today, DJI’s Amflow electric mountain bike range is&#160;available to buy&#160;in the United States. It comes over a year since the showcase for DJI’s very impressive Avinox drive system was launched in Europe, sending shockwaves through the industry and leaving stalwarts like Bosch and Spe"
    ],
    "image_url": "",
    "titles": [
      "DJI finally brings its impressive Amflow e-bike to US trails"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.428,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about the introduction of a new e-bike model in the US market, which could be useful for potential buyers or enthusiasts. However, it doesn't highlight any specific progress, solutions, or empowering knowledge.",
    "image": {
      "src": "https://live.staticflickr.com/7527/15712564704_f4333b7615_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b5e1ea2e-3d68-4dc5-a089-32986b2ca8cf/thumb/",
      "alt": "Parachute return of Will's rocket as captured by DJI drone",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The latest MacBook Air with M4 is down to its lowest price ever",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-30T10:58:11-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "If you need a laptop for school or work, our top recommendation is Apple’s 13-Inch MacBook Air with the M4 chip, which is at an all-time low price of $799 ($200 off) at Amazon and Best Buy. The machine is thin and light, yet its M4 chip is powerful enough to handle more intense workloads, [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "The latest MacBook Air with M4 is down to its lowest price ever"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for consumers interested in purchasing a MacBook Air. However, it does not provide any deeper insights or report on any progress, limiting its overall constructiveness.",
    "image": {
      "src": "https://live.staticflickr.com/2278/2262882737_32d94427e1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/65df38f3-146e-4f73-bcb7-5e1912ddc503/thumb/",
      "alt": "MacBook Air - open",
      "credit": "dan taylor / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Australian PM Visits Chengdu Panda Base, Showcases China's Panda Diplomacy",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 10:52:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Anthony Albanese's recent visit to Chengdu's panda breeding base showed the enduring power of China's panda diplomacy."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/panda-2.jpg",
    "titles": [
      "How China's pandas became its most valuable diplomats—and its vulnerable children"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.423,
    "summary": "Australian Prime Minister Anthony Albanese's visit to the panda breeding base in Chengdu highlights the ongoing influence of China's panda diplomacy strategy. This gesture underscores the diplomatic efforts China employs through its iconic pandas to foster international relationships.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some insight into China's unique diplomatic strategy, offering readers a better understanding of international relations. However, it doesn't provide actionable insights or report on progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/8552/28270372650_e0fa1ef4fb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3d86f1c9-3e65-4a64-87a8-50d0f2dcf1db/thumb/",
      "alt": "Orlando - Disney World - EPCOT - 2016 Epcot Flower and Garden Festival - World Showcase - China - Chinese Dragon Topiary",
      "credit": "jared422_80 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Detroit Battles Chronic Absenteeism in K-12 Students",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 11:59:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Thousands of K-12 students in Detroit consistently miss days of school."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/student-2.jpg",
    "titles": [
      "More than 50% of Detroit students regularly miss class, and schools alone can't solve the problem"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "Thousands of K-12 students in Detroit are frequently absent from school, impacting their education. Chronic absenteeism remains a significant issue in the city, affecting student learning and overall academic performance. Efforts are being made to address this issue and improve attendance rates to ensure students receive a quality education and succeed in school.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the issue of chronic absenteeism in Detroit's K-12 schools. It raises awareness about the problem, but it doesn't offer any specific solutions or improvements, nor does it provide a deep insight into the causes or impacts of the issue.",
    "image": {
      "src": "https://live.staticflickr.com/4068/4303758956_5946e303bd_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/aa8189f2-4d46-4184-b6c8-153009aa5621/thumb/",
      "alt": "Detroit International Auto Show 01-24-10",
      "credit": "cletch / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Minnesota activates National Guard as cyberattack on Saint Paul disrupts public services",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:50:47 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Gov. Tim Walz activated the state military's cyber forces to help ensure public services continue to run as the city of Saint Paul battles an ongoing cyberattack."
    ],
    "image_url": "",
    "titles": [
      "Minnesota activates National Guard as cyberattack on Saint Paul disrupts public services"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.417,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the severity of cyberattacks and their potential to disrupt public services. However, it does not provide any actionable insights or report on solutions to this problem, limiting its overall constructiveness.",
    "image": {
      "src": "https://live.staticflickr.com/1423/950644417_d70dce4fce_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/13686aac-6667-4a6b-8766-022bae31ca14/thumb/",
      "alt": "Minnesota",
      "credit": "The U.S. Army / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Climate Change May Halve Rainfall in World's Wettest Areas",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 11:00:06 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Some of the rainiest places on Earth could see their annual precipitation nearly halved if climate change continues to alter the way ocean water moves around the globe."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/tropics.jpg",
    "titles": [
      "Rainy tropics could face unprecedented droughts as an Atlantic current slows"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary": "Climate change may lead to a significant decrease in annual precipitation in some of the world's rainiest areas due to alterations in ocean water circulation patterns. This change could result in nearly halving the amount of rainfall in these regions.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story raises awareness about the potential impacts of climate change on rainfall patterns, it doesn't provide any actionable insights, solutions or deeper understanding of the causes or systems involved. It's mainly focused on the potential negative impact.",
    "image": {
      "src": "https://live.staticflickr.com/2643/3902667852_d2c0df11ee_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/91d903ce-601e-4394-86c5-4b130dba2d96/thumb/",
      "alt": "Current World Population Growth Rate",
      "credit": "Digital Dreams / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Mark Zuckerberg promises you can trust him with superintelligent AI",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-30T10:44:22-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hours before Meta’s earnings call, CEO Mark Zuckerberg shared his vision for the future of AI: personalized super-smart AI for everyone —&#160;especially in the form of wearable glasses.&#160; He said his vision is for everyone to have an AI tool that “helps you achieve your goals, create what you w"
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg promises you can trust him with superintelligent AI"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.413,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Mark Zuckerberg's stance on AI, but it lacks depth or insight. Without further information on why or how we can trust him, or what his plans are for superintelligent AI, the story does not contribute meaningfully to readers' understanding or decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/4029/4632633277_6fe50efab0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a77bdc9a-591c-452c-860b-9530c0e5a9f6/thumb/",
      "alt": "Email with Mark Zuckerberg, CEO of Facebook",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Chemical Warfare Causes Widespread Devastation, Affects Over a Million",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 12:01:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Chemical warfare is one of the most devastating forms of conflict. It leverages toxic chemicals to disable, harm or kill without any physical confrontation. Across various conflicts, it has caused tens of thousands of deaths and affected over a million people through injury and long-term health cons"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/chemical-weapon.jpg",
    "titles": [
      "To better detect chemical weapons, materials scientists are exploring new technologies"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary": "Chemical warfare, utilizing toxic chemicals to harm or kill in conflicts, has resulted in tens of thousands of deaths and affected over a million individuals through injury or long-term health consequences. This form of warfare avoids physical confrontation but causes widespread devastation.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story raises awareness about the devastating impacts of chemical warfare, it doesn't provide actionable insights, report on solutions, or give a deeper understanding of the underlying systems or causes.",
    "image": {
      "src": "https://live.staticflickr.com/7425/9242117258_13c025f51a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1260fac8-e3ce-427b-bed8-114326596d79/thumb/",
      "alt": "Affection over the roofs of Paris",
      "credit": "Aarni Heiskanen / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ice Crystals Cause Stunning Sky Phenomena: Halos, Sundogs, Crown Flashes",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 11:52:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Ice crystals in Earth's atmosphere sometimes align just right to create various striking visual effects, from a halo around the moon, to bright spots called sundogs on either side of the sun in a winter sky, or a rainbowed pillar, called a crown flash, above a storm cloud."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/sun-dogs-other-celesti.jpg",
    "titles": [
      "Sun dogs and other celestial effects could appear in alien skies"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41,
    "summary": "Ice crystals in Earth's atmosphere can align to produce visual phenomena such as halos around the moon, sundogs beside the sun, or a crown flash above storm clouds. These effects result from the specific orientation of ice crystals, creating striking visuals in the sky.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the natural phenomena caused by ice crystals in the Earth's atmosphere. However, it doesn't provide a deep understanding of the topic or actionable insights for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/110/254492763_1b71837037.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ac1a77f0-36ef-4606-a6f6-89527c071218/thumb/",
      "alt": "HALO WARS",
      "credit": "nywriter21 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Homes.com Owner Sues Over Alleged Copyright Infringement of 46,000 Photos",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 15:24:12 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Owner of Homes.com sues for allegedly infringing more than 46,000 copyrighted photos"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-1232333049-e1753888948330.jpg?w=2048",
    "titles": [
      "Zillow is the target of a massive infringement lawsuit that could force it to pay north of $1 billion in damages"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408,
    "summary": "The owner of Homes.com has filed a lawsuit accusing a party of infringing on over 46,000 copyrighted photos. The legal action aims to address and rectify the unauthorized use of these images. The current status of the case or the identity of the accused party has not been disclosed.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the issue of copyright infringement, which is important. However, it lacks depth and insight as it does not disclose the identity of the accused party or provide any context about the broader implications of the lawsuit, such as its potential impact on copyright law or the real estate industry.",
    "image": {
      "src": "https://live.staticflickr.com/3585/3325242389_038a93a39c.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/67f4b193-9cf9-4d5b-9335-3b7dcfb0973b/thumb/",
      "alt": "Willowbeck Nursing Home",
      "credit": "building construction partnership / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]