[
  {
    "title": "Court Rules Most Trump Tariffs Illegal, Exceeding Authority",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:07:43 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC",
      "Deutsche Welle",
      "New York Times",
      "CNBC",
      "Axios",
      "NPR",
      "Financial Post",
      "ABC News",
      "Al Jazeera",
      "CityNews",
      "Business Insider"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "abcnews.go.com",
      "ottawa.citynews.ca",
      "www.cnbc.com",
      "www.ft.com",
      "www.aljazeera.com",
      "financialpost.com",
      "www.bbc.com",
      "news.google.com",
      "www.businessinsider.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The U.S. Court of Appeals for the Federal Circuit, in Washington, D.C., delayed enforcing its decision, which is expected to be appealed to the Supreme Court.",
      "The tariffs can remain in place until mid-October to allow the Trump administration time to request the Supreme Court take up the case.",
      "But the court has allowed the tariffs to remain in place while the Trump administration appeals to the Supreme Court.",
      "A US appeals court ruled that most tariffs imposed by President Donald Trump are illegal. The Trump administration has said it will appeal the ruling to the Supreme Court.",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTFB6eVNBbldSM2ZPLUJieXJWNS1SRW5PbEtoN2pCOExfTnZKQUNvQVNLV1BSWUttLWtnekE2Sm81SnVLSi14dWdLTVZCbU5vMkRqZ3pCQmNFTnhfM1lGQ3FSNXppMnFsUlhURjhF?oc=5\" target=\"_blank\">Most of Trump's tariffs are not legal, court rules: what to know</a>&nbsp;&nbsp;<fo",
      "A federal appeals court has ruled that most of President Donald Trump’s sweeping global tariffs are unlawful.",
      "Judges uphold ruling that the president exceeded his authority",
      "<p>This blog is now closed. Read the full story <a href=\"https://www.theguardian.com/us-news/2025/aug/29/trump-tariffs-illegal-appeal-court-ruling\">here</a></p><p><strong>A visit to <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a> by two US senators has drawn criticism from China, which",
      "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court.",
      "<p>Trump found to have overstepped authority with tariff policies as president accuses court of political bias</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> overstepped his presidential powers with most of his globe-rattling <a href=\"https://www.theguardian.com/us-",
      "A federal appeals court found President Donald Trump's tariff plan unconstitutional, ruling that he overstepped his executive power to write trade policy.",
      "The court found the ‘Liberation Day’ and fentanyl-related tariffs exceeded the powers of the national security statute that Trump evoked to imposed them",
      "WASHINGTON (AP) — A federal appeals court ruled Friday that President Donald Trump had no legal right to impose&#160;sweeping tariffs&#160;on almost every country on earth but left in place for now his effort to build a protectionist wall around the American economy. The ruling from the U.S. Court o",
      "The appeals court stayed its ruling until Oct. 14, giving the Trump administration time to ask the Supreme Court to hear the case."
    ],
    "image_url": "",
    "titles": [
      "Most of President Trump's tariffs are illegal, U.S. court rules",
      "US court rules many of Trump's global tariffs are illegal",
      "US appeals court rules Trump’s foreign tariff campaign is largely illegal",
      "US President Trump's sweeping tariffs largely illegal, but can stay in place for now, appeals court rules",
      "Most of Trump's tariffs are not legal, court rules: what to know - Axios",
      "Trump’s global tariffs are unlawful, appeals court says",
      "Trump’s tariffs ruled illegal by US appeals court but stay in place",
      "US appeals court rules most of Trump’s sweeping global tariffs illegal – as it happened",
      "Trump’s Sweeping Tariffs Invalidated by Appeals Court",
      "Most of Trump’s tariffs are illegal, federal court rules",
      "Trump's tariffs ruled illegal by appeals court; why plan stands for now",
      "Many Trump tariffs ruled illegal by U.S. federal appeals court, but remain for now",
      "Court finds Trump’s tariffs against Canada, other countries illegal, but leaves them in place for now",
      "Most Trump tariffs ruled illegal by appeals court, dealing major blow to trade policy"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.81,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A U.S. federal appeals court ruled that most of the tariffs imposed by President Donald Trump are illegal, stating he exceeded his authority. The decision, which upholds a trade court's ruling, is based on violations of a 1977 law and the U.S. Constitution. Although the tariffs remain in effect temporarily to allow time for an expected appeal, the outcome represents a significant challenge to Trump's trade policies. The Supreme Court is anticipated to review the case following the appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Blocks Palestinian President from UN General Assembly Attendance",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 07:22:55 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "New York Times",
      "Axios",
      "Financial Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com",
      "www.bbc.com",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "The decision comes as France leads international efforts to recognise a Palestinian state at the UN meeting next month.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOZGV4bUNVVGFaRWxOV3hYTVBrOFpPN0FMTjZEcV8yYmlyVlU0eEFFUUl5czBueGotR0ZHRnpTclpjRkVkcXJxWHVwUjhEX2VibWkwN3hZYkRjbFFiYUpoQlVGTnhyZFpmTTZSS1NrQWZGMDE1U204M3pJTUktVXpBbU1fdjh0Zw?oc=5\" target=\"_blank\">U.S. blocks Palestinian president from attend",
      "Trump administration extends visa ban to include authority’s president",
      "The United States generally allows foreign officials to attend the United Nations General Assembly. The administration’s move comes amid a new push for Palestinian statehood.",
      "The Trump administration said it will deny visas to Palestinian Authority President Mahmoud Abbas and 80 other Palestinian officials in a move that will likely make it impossible for them to attend next month’s meeting of the UN General Assembly."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa76/live/913f1f60-8501-11f0-bf6f-0d0a8492a6fd.jpg",
    "titles": [
      "US blocks Palestinian leader from attending UN meeting in New York",
      "U.S. blocks Palestinian president from attending UN General Assembly - Axios",
      "US bars Palestinian leader Abbas from UN meeting to recognise state",
      "Trump Administration Bars Palestinian Officials From U.N. Meeting in New York",
      "US Will Deny Visas to Top Palestinian Leaders Before UN Meeting"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.962,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.832,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United States has blocked the Palestinian president from attending the UN General Assembly next month, amid efforts led by France to recognize a Palestinian state. This decision marks a significant move by the U.S. administration, contrasting with the general practice of allowing foreign officials to attend the assembly.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spirit Airlines Files for Bankruptcy Again Amid Financial Struggles",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 03:23:19 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Business Insider",
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com",
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE9TZENHc1lvay10a016NFlfS0toVlpqVDFRaEhvUmtDaXhkMEpaNGd4OWtwSjc4bWZ4WXpWYWw0Qm1jempOa3RtWC1MVUlTamdUN1RTUEFSU2s4RXlEMHdRNlh1emVwM3d6YmU3a1lGZG5keU0?oc=5\" target=\"_blank\">Spirit Airlines is back in bankruptcy</a>&nbsp;&nbsp;<font color=\"#6f6f6",
      "Spirit Airlines filed for bankruptcy protection again, just months after the budget carrier came out of Chapter 11 protection earlier this year.",
      "Spirit Airlines on Friday filed for bankruptcy for the second time in a year. The discount airline warned in early August it may not survive the year.",
      "The move comes after the budget airline emerged from bankruptcy in March."
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines is back in bankruptcy - Axios",
      "Spirit Airlines files for Chapter 11 bankruptcy protection for the second time in a year",
      "Spirit just filed for bankruptcy .... again",
      "Spirit Airlines files for bankruptcy again, has this to say about its Labor Day flights"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.886,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Spirit Airlines has filed for Chapter 11 bankruptcy protection for the second time within a year, citing dwindling cash reserves and increasing losses exacerbated by Trump tariffs. Despite emerging from a previous bankruptcy in March, the low-cost carrier has struggled to recover, leading to this latest filing. Spirit intends to continue operating normally during the restructuring process, allowing passengers to book flights as usual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Cuts $4.9B in 'Woke' Funding from USAID, State Dept.",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-30T00:32:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "US President Donald Trump has bypassed Congress to cut nearly $5 billion in funding earmarked for international aid. The move could spark a fight over who truly holds the power of the purse in the United States.",
      "President Donald Trump told Congress that he will slash $4.9 billion of congressionally-approved USAID and State Department foreign aid funding.",
      "US president makes new effort to assert power over Congress with bid to cut ‘woke’ funding"
    ],
    "image_url": "",
    "titles": [
      "Trump cuts billions more in approved US foreign aid",
      "WATCH:  Trump cuts nearly $5B of foreign aid",
      "Trump moves to scrap $4.9bn in already allocated US foreign aid"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has unilaterally cut $4.9 billion in congressionally-approved funding for USAID and the State Department, aiming to assert his power over Congress. This move, described as an effort to cut 'woke' funding, may lead to a dispute regarding the constitutional power of the purse in the United States.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nationwide Protests Erupt Over Police Violence, Inflation in Makassar",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 05:53:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The demonstrations - which also focus on cost-of-living and politicians expenses - are seen as a key test for President Prabowo Subianto.",
      "Protesters angered by police violence, parliamentarians&#039; wages and inflation are staging nationwide demonstrations.",
      "Protests over the death of a motorcycle taxi driver escalated in Makassar on Friday night, with protesters hurling rocks and Molotov cocktails."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2c71/live/7a5aec80-8537-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Three dead after protests over death of taxi driver in Indonesia",
      "Why are antigovernment protests taking place in Indonesia?",
      "Indonesia: Blaze kills 3 amid protests over driver death"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nationwide protests have erupted in response to police violence, high parliamentarian wages, and rising inflation. The situation escalated in Makassar with demonstrators throwing rocks and Molotov cocktails after a motorcycle taxi driver's death. These protests are considered a significant challenge for President Prabowo Subianto, highlighting public discontent with the cost of living and political expenses.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Targets Wind Industry Funding, Calls Projects Wasteful",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 16:24:22 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The wind industry has been in President Donald Trump's crosshairs since his first day in office, but his administration has recently escalated its attacks.",
      "The Trump administration’s campaign against wind power continued as it targeted funding for marine terminals and ports to support development of the industry.",
      "“Wasteful wind projects are using resources that could otherwise go towards revitalizing America’s maritime industry,” Transportation Secretary Sean Duffy said."
    ],
    "image_url": "",
    "titles": [
      "Trump administration cancels $679 million for offshore wind projects",
      "Transportation Dept. Cancels $679 Million for Offshore Wind Projects",
      "Trump breaks wind funding again, canceling $679 million in federal funding for a dozen offshore projects"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.705,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Since taking office, President Trump's administration has criticized the wind industry, recently intensifying efforts by targeting funding for marine terminals and ports aimed at supporting the sector. Transportation Secretary Sean Duffy labeled these wind projects as wasteful, arguing the resources should be used to rejuvenate America’s maritime industry instead.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Denies Visas to PLO, PA Members Amid Palestinian ICC Appeals",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 20:44:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Palestine’s UN envoy Riyad Mansour said Washington’s visa ban on Palestinian officials threatens to bar Mahmoud Abbas.",
      "The move comes as U.S. allies prepare to recognize Palestinian statehood next month.",
      "<p>Step comes when France is leading a push to recognise Palestinian state after Israel’s unyielding bombing of Gaza</p><p>The US has begun denying and revoking visas from members of the Palestine Liberation Organization (PLO) and the Palestinian Authority (PA) in advance of the UN general assembly "
    ],
    "image_url": "",
    "titles": [
      "Reaction to US visa ban on Palestinian officials ahead of UNGA",
      "U.S. denies visas to Palestinian officials ahead of U.N. General Assembly",
      "US denies visas to Palestinian Authority leaders for UN general assembly"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.787,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. has started denying and revoking visas for members of the Palestine Liberation Organization (PLO) and the Palestinian Authority (PA), including potentially Mahmoud Abbas, in response to Palestinian appeals to the ICC and ICJ over Israeli actions in occupied territories. This move coincides with efforts by U.S. allies, led by France, to recognize Palestinian statehood following Israel's bombing of Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paetongtarn Shinawatra Dismissed as Thailand PM Amid Scandal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 19:34:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Paetongtarn Shinawatra was dismissed after a leaked phone call scandal.",
      "<p>Daughter of former PM Thaksin accused of failing to protect country’s interests over leaked phone call with Cambodia’s leader</p><p>Thailand’s constitutional court has dismissed Paetongtarn Shinawatra from her position as prime minister, ruling that as the country’s leader she violated ethical ru",
      "Paetongtarn Shinawatra became the third member of her family to be removed from the job, as the nation plunged into fresh political instability."
    ],
    "image_url": "",
    "titles": [
      "What next for Thailand after court sacks suspended prime minister?",
      "Thai court dismisses prime minister Paetongtarn Shinawatra",
      "Thai Court Dismisses Prime Minister Paetongtarn Shinawatra From Office"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.768,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paetongtarn Shinawatra was dismissed as Thailand's Prime Minister by the constitutional court for failing to protect the country's interests, following a scandal involving a leaked phone call with Cambodia's leader. This makes her the third member of her family to be removed from office, leading to renewed political instability in Thailand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers, Yankees, Pirates, and Giants Secure Wins in MLB Highlights",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 02:08:50 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Andruw Monasterio's solo shot in the sixth started a five-run inning as the Milwaukee Brewers routed the Toronto Blue Jays 7-2 on Friday in a showdown between the American and National League leaders.",
      "<p>Andrew Vaughn had three hits and two RBIs on the night, Freddy Peralta struck out eight batters in six innings, and the Milwaukee Brewers took a 7-2 win over the Toronto Blue Jays.</p>",
      "<p>Trent Grisham crushed his fourth career grand slam, Anthony Volpe tacked on a two-run shot, and Carlos Rodon allowed a run over six innings as the New York Yankees trounced the Chicago White Sox 10-2.</p>",
      "<p>Tommy Pham drove in a pair of runs, Paul Skenes struck out six batters in six innings, and the Pittsburgh Pirates took a 4-2 win over the Boston Red Sox.</p>",
      "<p>Blaze Alexander homered for the Arizona Diamondbacks while Zac Gallen tossed six shutout innings striking out eight batters as the Diamondbacks beat the Los Angeles Dodgers 3-0.</p>",
      "<p>Canadian Jonah Tong punched out six batters in his MLB debut, Brandon Nimmo hit two of the Mets&#8217; six home runs on the night, and New York crushed the Miami Marlins 19-9.</p>",
      "<p>Riley Greene had three knocks bringing in two runners while catcher Dillon Dingler smashed a solo shot home run to help the Detroit Tigers beat the Kansas City Royals 5-3.</p>",
      "<p>Dominic Smith hit a two-run shot and drove in four runs, Luis Matos added a solo shot and three RBIs to his season tally, and the San Francisco Giants took a 15-8 win over the Baltimore Orioles.</p>",
      "<p>Brandon Marsh added two hits and an RBI to his season tally, Ranger Suárez allowed just one run in five innings, and the Philadelphia Phillies earned a narrow 2-1 win over the Atlanta Braves.</p>",
      "<p>Logan Allen struck out five batters in six innings, Kyle Manzardo and Nolan Jones each hit solo home runs on two hits, and the Cleveland Guardians took a 5-4 win over the Seattle Mariners.</p>",
      "<p>Masyn Winn drove in three runs, including knocking in a key insurance run in extra innings, to lead the St. Louis Cardinals past the Cincinnati Reds 7-5.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/d8948af34131e6f7641e02b780d2f027ecb93bcbd88e93551a8d3192b276e15b.jpg?quality=65&strip=all",
    "titles": [
      "Monasterio, Peralta lead Brewers past Blue Jays",
      "MLB Highlights: Brewers 7, Blue Jays 2",
      "MLB Highlights: Yankees 10, White Sox 2",
      "MLB Highlights: Pirates 4, Red Sox 2",
      "MLB Highlights: Diamondbacks 3, Dodgers 0",
      "MLB Highlights: Mets 19, Marlins 9",
      "MLB Highlights: Tigers 5, Royals 3",
      "MLB Highlights: Giants 15, Orioles 8",
      "MLB Highlights: Phillies 2, Braves 1",
      "MLB Highlights: Guardians 5, Mariners 4",
      "MLB Highlights: Cardinals 7, Reds 5 (F/10)"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Milwaukee Brewers defeated the Toronto Blue Jays 7-2, with Andruw Monasterio igniting a five-run inning. Other MLB highlights include the New York Yankees' 10-2 victory over the Chicago White Sox, the Pittsburgh Pirates winning 4-2 against the Boston Red Sox, the Arizona Diamondbacks shutting out the Los Angeles Dodgers 3-0, the New York Mets overpowering the Miami Marlins 19-9, the Detroit Tigers beating the Kansas City Royals 5-3, the San Francisco Giants securing a 15-8 win over the Baltimore Orioles, the Philadelphia Phillies narrowly defeating the Atlanta Braves 2-1, the Cleveland Gua",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Sox Release Buehler, Promote Prospect Tolle to Majors",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 01:47:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Red Sox released veteran right-hander Walker Buehler in a series of moves Friday that included calling up top pitching prospect Payton Tolle for his major league debut.",
      "<p>The Boston Red Sox released veteran right-hander Walker Buehler in a series of moves Friday that included calling up top pitching prospect Payton Tolle for his major league debut.</p>"
    ],
    "image_url": "",
    "titles": [
      "Red Sox release Buehler, call up prospect Tolle",
      "Red Sox release RHP Walker Buehler"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Boston Red Sox released veteran pitcher Walker Buehler and called up pitching prospect Payton Tolle for his major league debut as part of a series of team changes announced on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fantasy Draft Tips: Karabell, Richard Share Insights, Chiefs Players Touted",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 01:47:24 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The annual hit is back, with players Eric Karabell feels are going earlier than they should in drafts this summer.",
      "Tier-based TE rankings to help you build out your Fantasy rosters",
      "Tier-based WR rankings to help you build out your Fantasy rosters",
      "Tier-based RB rankings to help you build out your Fantasy rosters",
      "Using tiered-based rankings allow you to avoid missing out on position runs in your drafts",
      "Here's what to do -- and not do -- in a salary cap draft",
      "Jamey's list of 10 bust candidates relative to ADP also features one key rookie he's fading",
      "Jamey's final list of breakouts includes rookies as well as players from the Cowboys, Steelers, Packers and more"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Do Not Draft list",
      "Fantasy Football Tight End Rankings Tiers 5.0: Your draft day cheat sheet for drafting the TE position",
      "Fantasy Football Wide Receiver Rankings Tiers 5.0: How to draft the WR position and where value falls",
      "Fantasy Football RB Rankings Tiers 5.0: Where Ashton Jeanty falls in Jamey Eisenberg's draft day cheat sheet",
      "Fantasy Football Quarterback Rankings Tiers 5.0 August, 29: Jamey Eisenberg's guide for grabbing value at QB",
      "2025 Fantasy Football salary cap draft: When paying up for Ja'Marr Chase, Brock Bowers and others goes wrong",
      "2025 Fantasy Football Busts 4.0: Why Saquon Barkley heads up Jamey Eisenberg's do not draft list",
      "2025 Fantasy Football Breakouts 4.0: Jamey Eisenberg is targeting these 20 players in all Fantasy drafts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Eric Karabell suggests some players are being drafted too early in fantasy football leagues. Meanwhile, Dave Richard praises rookies like Omarion Hampton, highlighting their potential value. From the ninth draft position, specific strategies were discussed. Additionally, advice was given to target four Kansas City Chiefs players in fantasy drafts, indicating their expected strong performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bayern Munich Signs Nicolas Jackson on Loan from Chelsea",
    "domain": "sports",
    "source_domain": "www.bavarianfootballworks.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 07:41:02 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "onefootball.com",
      "www.theguardian.com",
      "www.bavarianfootballworks.com"
    ],
    "snippets": [
      "Bayern Munich might have some help on the way…",
      "Bayern Munich have reached an agreement to sign Chelsea striker Nicolas Jackson on loan, according to journalist Fabrizio Romano.The deal will see Bayern pay an initial €15 million fee for a one-sea...",
      "Did the Bavarians land on the right Blues brother?",
      "According to Florian Plettenberg, the agreement would be finalized with a loan with an option to buy. It seems that Kompany will finally have a reliable reinforcement for Bayern's forward line. Nico J...",
      "<ul><li><p>All the latest going into Saturday’s action</p></li><li><p><a href=\"https://www.theguardian.com/football/blog/2025/aug/29/premier-league-10-things-to-look-out-for-this-weekend\">Ten things to look out for</a> | <a href=\"mailto:matchday.live@theguardian.com\">Email matchday live</a></p></li>"
    ],
    "image_url": "",
    "titles": [
      "Update: Bayern Munich and Chelsea agree to loan deal for Nicolas Jackson",
      "🚨 BREAKING: Bayern Munich 'agree' loan deal for Chelsea's Nicolas Jackson",
      "Report details why Bayern Munich chose Nicolas Jackson over Christopher Nkunku",
      "⚠️Nico Jackson to Bayern, deal DONE",
      "Buildup to Chelsea v Fulham, Bayern agree Jackson loan, and more – matchday live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bayern Munich has finalized a deal to sign Chelsea striker Nicolas Jackson on loan. The agreement includes an initial fee of €15 million for one season, with an option to buy. This move is seen as a significant reinforcement for Bayern's forward line.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Struff and Djokovic Advance at US Open; Djokovic Sets Age Record",
    "domain": "sports",
    "source_domain": "dpa-international.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 07:42:18 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "dpa-international.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Germany's Jan-Lennard Struff reached the US Open round of 16 for the first time in his career, stunning home favourite Frances Tiafoe in straight sets on Friday. The 35-year-old qualifier defeated the two-time US Open semifinalist and world number 17 6-4, 6-3, 7-6 (9-7) in 2 hours and 9 minutes.",
      "<p>Novak Djokovic shook off a back problem early in the match to beat Cam Norrie on Friday night and at 38 become the oldest man to reach the fourth round of the US Open since Jimmy Connors was the same age in 1991.</p>"
    ],
    "image_url": "",
    "titles": [
      "Germany's Struff beats Tiafoe and reaches fourth US Open round",
      "Novak Djokovic shakes off back problem, reaches fourth round of US Open at 38"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Germany's Jan-Lennard Struff advanced to the US Open round of 16 for the first time, defeating Frances Tiafoe in straight sets. Meanwhile, Novak Djokovic overcame a back issue to beat Cam Norrie, becoming the oldest man to reach the fourth round of the US Open at 38 since Jimmy Connors in 1991.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dallas Mavericks Waive Olivier Maxence-Prosper to Re-Sign Danté Exum",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 22:00:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Mavs waiving O-Max opens up a roster spot to re-sign Danté Exum",
      "Dallas Mavericks Waive Former First-Round Draft Pick Olivier Maxence-Prosper after two seasons to get under the second apron. What's next for the 23-year-old?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/29/0d7fad1f-11a7-4d42-89c1-67c944d61ed2/olivier-maxence-prosper-mavericks-g.jpg",
    "titles": [
      "Mavericks waive Olivier Maxence-Prosper: Why Dallas is reportedly parting ways with 2023 first-round pick",
      "Dallas Mavericks Waive Former First-Round Draft Pick"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.808,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Dallas Mavericks have waived Olivier Maxence-Prosper, a former first-round draft pick, after two seasons with the team. This move was made to get the team under the second salary cap apron and has opened up a roster spot, which they plan to use to re-sign Danté Exum. The future for 23-year-old Maxence-Prosper remains uncertain following his release.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Jersey Little Leaguer's Bat Sold for $10K After Suspension Lifted by Judge",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 22:10:27 -0400",
    "source": "ABC News",
    "sources": [
      "ESPN",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.espn.com"
    ],
    "snippets": [
      "The bat tossed in the air by a New Jersey Little Leaguer to celebrate a home run that earned him a suspension later lifted by a judge has sold for nearly $10,000 at auction",
      "The bat tossed in the air by a New Jersey Little Leaguer to celebrate a home run that earned him a suspension later lifted by a judge sold Friday for nearly $10,000 at auction."
    ],
    "image_url": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_4x3t_384.jpg",
    "titles": [
      "Suspended Little Leaguer's bat sells for nearly $10,000 at auction",
      "Suspended Little Leaguer's bat sells for $10K"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.882,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The bat tossed in the air by a New Jersey Little Leaguer to celebrate a home run that earned him a suspension later lifted by a judge has sold for nearly $10,000 at auction",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Overturns Ban, 130 Asylum Seekers to Stay at Bell Hotel",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 01:40:22 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Feelings on the High Street are mixed as unrest continues over a local hotel  housing asylum seekers.",
      "<p>Judges say decision to allow injunction was ‘seriously flawed’ and contained several ‘errors in principle’</p><p>More than 130 people seeking asylum will be allowed to remain in the Bell hotel in Epping after the court of appeal overturned a high court ban on housing them there, leaving police br"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0810/live/ba4368f0-853b-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Three arrests at Epping protest after court rules asylum seekers can stay at hotel",
      "Asylum seekers to remain at Epping hotel after court of appeal revokes ban"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A court of appeal overturned a high court ban, allowing over 130 asylum seekers to stay at the Bell hotel in Epping. The decision, criticized for being 'seriously flawed' with 'errors in principle,' has resulted in mixed feelings on the High Street amid ongoing unrest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sen. Hawley Probes Meta Over AI, Firm to Restrict Chatbot Topics",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 20:34:26 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Sen. Josh Hawley, R-Mo., said he was launching an investigation into Meta following a damning Reuters report about the company's AI policies.",
      "The company will limit its AI characters and train the chatbot not to discuss self-harm and suicide, or have romance conversations with children."
    ],
    "image_url": "",
    "titles": [
      "Meta changes teen AI chatbot responses as Senate begins probe into 'romantic' conversations",
      "Meta changes the way its AI chatbot responds to kids after senator launches probe into its conversations with teens"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.768,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sen. Josh Hawley announced an investigation into Meta after a Reuters report criticized its AI policies. In response, Meta plans to restrict its AI characters and retrain its chatbot to avoid topics of self-harm, suicide, and romantic conversations with minors.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Irish Aid Worker, Eight Others Freed in Haiti After Kidnapping",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 21:57:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ransoms have surged as Haiti struggles with widespread gang violence, particularly around its capital Port-au-Prince.",
      "<p>Gena Heraty was abducted at orphanage she ran along with seven Haitian colleagues and a three-year-old child</p><p>An Irish aid worker and eight fellow captives have been released nearly a month after they were kidnapped in Haiti.</p><p>Gena Heraty, a missionary who ran the Our Little Brothers an"
    ],
    "image_url": "",
    "titles": [
      "Irish missionary among the eight released after Haiti orphanage kidnapping",
      "Irish missionary and eight others freed weeks after kidnapping in Haiti"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.808,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Haiti, amidst escalating gang violence, Irish aid worker Gena Heraty and eight others, including seven Haitian colleagues and a three-year-old child, were kidnapped. They were abducted from the orphanage Heraty managed near Port-au-Prince. Nearly a month after their kidnapping, all nine captives have been released.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ben Shelton Withdraws from US Open Due to Shoulder Injury",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 21:09:35 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOZGdocFVpazFGcmk3bTQ2Y1pVdFUyeFE3NUxqdHFVZUhzNHFjWXJuLXJOZHNwWXR4UnNIa1RrNTZfZVRfUTlEVUNOT29uUGN2YTlzcnRBckNzTlFrdnVWbk5oNXMwZlgwdTIzTm9wV2NVUnRqOWN1QWpiN3lJS0JHN3dtWS1ycHNXcEpicg?oc=5\" target=\"_blank\">American Ben Shelton Retires From U.S",
      "<p>Ben Shelton had just acrobatically taken the third set of his US Open third-round match, getting up from a tumble to the court during the point and then throwing his left arm into the air to encourage cheers after he won it.</p>"
    ],
    "image_url": "",
    "titles": [
      "American Ben Shelton Retires From U.S. Open Due to Shoulder Injury - Sports Illustrated",
      "Ben Shelton out of US Open after injuring shoulder against Mannarino"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.778,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ben Shelton withdrew from his third-round match at the US Open due to a left shoulder injury. This occurred after an acrobatic play where he won the third set, despite taking a tumble and using his left arm to rally the crowd.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TikTok Adds Voice Messages and Image Sharing to Direct Messaging",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-29T15:53:06-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Every platform wants to be the place you hang with friends — even Spotify as of this week — so it’s apparently time for TikTok to shore up its direct messaging feature! It told TechCrunch that over the next few weeks, all users should see voice messages and image sharing options arrive in their DMs.",
      "The new capabilities bring TikTok’s messaging experience more in line with that of other popular social apps and services."
    ],
    "image_url": "",
    "titles": [
      "TikTok is now letting everyone DM each other with voice memos and pictures",
      "TikTok now lets users send voice notes and images in DMs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.773,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TikTok is enhancing its direct messaging feature by introducing voice messages and image sharing options, as confirmed to TechCrunch. This update, rolling out over the next few weeks, aims to make TikTok's messaging capabilities comparable to other leading social apps.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Crash in Key Largo Kills One, Injures Another; Legal Battle Ensues",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 17:34:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Tesla collision in Key Largo, Florida, killed 22-year-old Naibel Benavides and severely injured her boyfriend, Dillon Angulo.",
      "The company's lawyers blame the driver (who settled with the victims separately) for the crash, and the plaintiffs' lawyers for \"overwhelming\" the jury with \"irrelevant evidence.\""
    ],
    "image_url": "",
    "titles": [
      "Tesla asks for $243 million verdict to be tossed in fatal Autopilot crash suit",
      "Tesla challenges $243 million verdict in Autopilot death trial"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.722,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Key Largo, Florida, a Tesla crash resulted in the death of 22-year-old Naibel Benavides and serious injuries to Dillon Angulo. Tesla's legal team attributes the accident to the driver, who has already settled with the victims. They accuse the plaintiffs' lawyers of biasing the jury with irrelevant evidence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "End of \"De Minimis\" Exemption Sparks Concern in Retail Over New Tariffs",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 11:57:28 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBPQU9UTGIxbTBvdzV1VnBWS3JKX3U1OWtQYlUxXzZNaEE1Q1NJazI2R2M4NEdKdjNRQWRKRGVEWWgzbzJyczM1aVV4Ylc1WWthc29Icnl5Rlk0aUFHTlZ1WFY3akx6NWt3ZFMyMDlOR1pyTnp4a09kUg?oc=5\" target=\"_blank\">End of \"de minimis\" exemption means new tariffs on millions of pa",
      "The de minimis exemption, an obscure trade law provision, came to an end globally on Friday, setting off a panic across the retail industry."
    ],
    "image_url": "",
    "titles": [
      "End of \"de minimis\" exemption means new tariffs on millions of packages - Axios",
      "Retail panic: What the end of the 'de minimis' exemption means for brands across the globe"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.642,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The global termination of the \"de minimis\" trade law exemption on Friday has led to widespread concern in the retail industry, as it will result in new tariffs on millions of packages.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]