[
  {
    "title": "Sabalenka Wins Second Straight US Open, Clinches Fourth Grand Slam Title",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 02:42:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "World number one Aryna Sabalenka defended her US Open title with a straight-sets victory against Amanda Anisimova.",
      "The Belarusian tennis player Aryna Sabalenka has successfully defended her US Open crown, becoming the first woman since Serena Williams in 2014 to do so.",
      "<ul><li><p>Sabalenka overcomes American 6-3, 7-6 (3)</p></li><li><p>World No 1 clinches fourth grand slam title</p></li></ul><p>At the end of an excruciating season filled with near-misses and heartbreak at the final hurdle, Aryna Sabalenka began her third consecutive US Open final with one final ch",
      "World No 1 Aryna Sabalenka successfully defended her US Open title with a thrilling 6-4 7-6 (7-3) win over Amanda Anisimova in New York.",
      "<p>Aryna Sabalenka did not make many mistakes despite not sacrificing any power — well, until near the end — and outplayed Amanda Anisimova for a 6-3, 7-6 (3) victory in the US Open final Saturday, making her the first woman to win the tournament in consecutive years since Serena Williams more than "
    ],
    "image_url": "",
    "titles": [
      "US Open: Sabalenka wins second straight title, defeats Anisimova",
      "Aryna Sabalenka wins second straight US Open title",
      "Aryna Sabalenka sweeps aside Amanda Anisimova to retain US Open title",
      "Sabalenka retains US Open title with thrilling win over Anisimova",
      "Sabalenka defeats Anisimova for her second consecutive US Open title"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.893,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aryna Sabalenka won her second consecutive US Open title, defeating Amanda Anisimova 6-3, 7-6 (3). This victory marks Sabalenka's first major win of the year and her fourth Grand Slam title overall. She becomes the first woman to win back-to-back US Open titles since Serena Williams in 2014.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Crash: Cable Snap Identified as Critical Failure",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 19:44:26 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The rest of the mechanism worked properly, says a preliminary statement into the crash which killed 16 people.",
      "Initial findings revealed that the funiculr accident occurred within 50 seconds. Officials called the deadly crash one of Lisbon's worst tragedies in recent memory.",
      "<p>Investigators say it had not been possible to visually inspect section of cable that separated before incident</p><p>A cable linking two carriages snapped shortly before Wednesday’s funicular crash in Lisbon that killed 16 people, accident inspectors have said in a report.</p><p>An operator tried",
      "Portuguese authorities released a highly anticipated preliminary report into the disaster, which killed 16 people this week.",
      "Investigators are searching for the cause of the crash that killed 16 people, with questions focusing on a possible failure of the cable that kept the two cars in balance."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1692/live/b6e4a9e0-8b57-11f0-bc53-038b81db70b3.png",
    "titles": [
      "Cable snapped before Lisbon funicular crash, investigators say",
      "Lisbon funicular cable disconnected before crash — report",
      "Lisbon funicular cable snapped before deadly crash, report finds",
      "Authorities Point to Cable Disconnecting in First Report on Lisbon Funicular Crash",
      "Lisbon Funicular Was Inspected Hours Before Deadly Crash"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.756,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.747,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A preliminary report on the Lisbon funicular crash, which resulted in 16 deaths, identified a cable snap as the critical failure. Investigators noted the rest of the system was functional but highlighted that the section of cable that failed had not been visually inspected prior to the incident. This crash is considered one of Lisbon's worst tragedies in recent memory. The investigation is ongoing to determine the exact cause of the cable failure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Detains 475, Mostly South Koreans, in Georgia Factory Raid",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 15:38:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Business Insider",
      "New York Times"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "South Korea's foreign minister is considering a trip to the U.S. to meet with the Trump administration after hundreds of South Koreans were arrested in Georgia at an electric vehicle battery plant.",
      "The country said it had sent diplomats to the site, and South Korea’s foreign minister said he might travel to Washington himself to address the matter.",
      "\"This, in fact, was the largest single-site enforcement operation in the history of Homeland Security investigations,\" a DHS official said."
    ],
    "image_url": "",
    "titles": [
      "ICE arrests at a Georgia Hyundai plant create new tension with South Korea",
      "Immigration Raid on Hyundai-LG Plant in Georgia Rattles South Korea",
      "South Korea responds after ICE detains 475 workers at a Hyundai-LG battery plant in Georgia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.771,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US immigration officials detained 475 workers, primarily South Korean nationals, for working illegally at a Hyundai-LG battery factory in Georgia. This event marks the largest single-site enforcement operation by Homeland Security Investigations. The raid has strained relations between the US and South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Father Mother Sister Brother\" Wins Golden Lion at Venice Film Festival",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 16:08:47 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Jim Jarmusch's quietly humorous relationship triptych won the top prize on Saturday. The film about the relationships between siblings, and with their parents, stars Adam Driver, Vicky Krieps and Cate Blanchett.",
      "“The Voice of Hind Rajab” won the Silver Lion Grand Jury Prize, one of the highest honours at the Venice Film Festival.",
      "Director Ben Hania pays tribute to slain five-year old Palestinian girl, calls for accountability for Israeli killings.",
      "<p>The Voice of Hind Rajab, a harrowing account of a Palestinian child’s death in Gaza, won the runner-up Silver Lion</p><p>US indie director Jim Jarmusch unexpectedly won the coveted Golden Lion at the Venice film festival on Saturday with Father Mother Sister Brother, a three-part meditation on th"
    ],
    "image_url": "",
    "titles": [
      "Jim Jarmusch's 'Father Mother Sister Brother' wins top prize at Venice Film Festival",
      "Hind Rajab film given major prize at Venice film festival",
      "Gaza war film The Voice of Hind Rajab wins 2nd prize at Venice festival",
      "Jim Jarmusch’s Father Mother Sister Brother, starring Cate Blanchett, surprise winner of Venice Golden Lion"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.779,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jim Jarmusch's film \"Father Mother Sister Brother,\" a meditation on familial relationships starring Adam Driver, Vicky Krieps, and Cate Blanchett, won the Golden Lion at the Venice Film Festival. The runner-up Silver Lion was awarded to \"The Voice of Hind Rajab,\" depicting a Palestinian child’s death in Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Over 1,500 Protest Against Palestine Action Ban, 425 Arrested",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 20:59:14 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Hundreds gathered in Parliament Square to oppose the group's ban under anti-terrorism legislation.",
      "Violence breaks out as police move in on 1,500 people protesting against government’s ban on anti-genocide group.",
      "<p>Police say offences include assault and support for a proscribed group as 1,500 oppose ban in Parliament Square</p><p>More than 425 people have been arrested at the largest demonstration yet opposing the proscription of Palestine Action.</p><p>Defend Our Juries, who organised the demonstrations, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/372f/live/936ae4d0-8bab-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "More than 425 arrested at rally against Palestine Action ban in London",
      "Police make mass arrests at Palestine Action rally outside UK Parliament",
      "More than 425 arrested as protesters defy ban on Palestine Action in London"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.776,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Over 1,500 people protested in Parliament Square against the government's ban on the anti-genocide group, Palestine Action, resulting in violence and police intervention. Authorities reported offences including assault and support for a proscribed group, leading to more than 425 arrests. This event marks the largest demonstration against the ban, organized by Defend Our Juries.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Postal Traffic to US Plummets 80% After Tariff Policy Change",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T14:45:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CityNews",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "Postal flows to the United States have almost come to a halt, with 88 operators worldwide fully or partially suspending services, the Universal Postal Union said.",
      "<p>Dozens of operators have suspended service to the US until a solution is implemented on parcels worth $800 or less</p><p>Postal traffic into the United States plunged by more than 80% after the Trump administration ended a tariff exemption for low-cost imports, the United Nations postal agency sa",
      "Postal traffic into the United States plunged by more than 80% after the Trump administration ended a tariff exemption for low-cost imports, the United Nations postal agency said Saturday. The Universal Postal Union says it has started rolling out new measures that can help postal operators around t"
    ],
    "image_url": "",
    "titles": [
      "Postal traffic to US down by over 80% amid tariffs, UN says",
      "Postal traffic into US plunges by more than 80% after Trump ends exemption",
      "Postal traffic to US sank 80% after Trump administration ended exemption on low-value parcels"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.696,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Postal traffic to the United States has decreased by over 80% following the Trump administration's decision to end a tariff exemption for low-cost imports, according to the Universal Postal Union. This has led to 88 postal operators worldwide fully or partially suspending their services to the US. The agency is implementing new measures to address the issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick Wins First Game at UNC, Bans Patriots Scouts",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 02:37:42 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Bill Belichick picked up win No. 1 at North Carolina as it beat Charlotte 20-3. He also confirmed that Patriots scouts have been banned from the UNC facility, saying, \"It's obvious I'm not welcome at their facility, so they're not welcome at ours.\"",
      "The first-year Tar Heels coach explains his reasoning for nixing New England personnel from being around his program"
    ],
    "image_url": "",
    "titles": [
      "Belichick wins 1st at UNC, confirms Patriots ban",
      "Bill Belichick acknowledges ban on Patriots scouts at UNC facilities: 'They're not welcome at ours'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bill Belichick, now coaching at North Carolina, achieved his first win with the team, defeating Charlotte 20-3. He also stated that New England Patriots scouts are banned from UNC facilities due to a personal unwelcome feeling, reciprocating the ban at Patriots facilities. This decision was explained as stemming from his own treatment by UNC.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Clay's Playbook Adds Shadow Report for Week 1 NFL Fantasy Insights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 02:37:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Mike Clay's Playbook now includes Shadow Reports, providing an all-encompassing look at Week 1's matchups to exploit and avoid in fantasy.",
      "SportsLine's NFL DFS optimizer has revealed its top value picks for Sunday daily fantasy football in Week 1"
    ],
    "image_url": "",
    "titles": [
      "🏈 The Playbook: Week 1 fantasy football guide",
      "NFL DFS: Optimizer reveals Week 1, 2025 daily fantasy football lineups, picks for DraftKings, FanDuel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Clay's Playbook has expanded to include the Shadow Report, offering detailed insights on Week 1 NFL matchups for fantasy football players. This comprehensive guide aims to help users make informed decisions on starting or sitting players based on matchups and weather forecasts, among other factors. All relevant fantasy football content for Week 1 is now accessible in one location to assist players in dominating their matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Young Fan Meets Phillies' Bader After Home Run Ball Dispute",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 20:37:16 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.npr.org"
    ],
    "snippets": [
      "A boy in the stands of a Philadelphia Phillies game thought he'd scored a baseball hit by Phillies outfielder Harrison Bader, until another fan insisted the ball was hers.",
      "<p>On this edition of Central Sixty, a young Phillies fan goes through a rollercoaster of emotions after getting a home run ball, Shane Smith collides with Kyle Teel and Vladimir Guerrero Jr. applauds a ball girl for a wicked catch.</p>",
      "<p>The Philadelphia Phillies invited a young fan to meet Harrison Bader following their 9-3 win over the Miami Marlins on Friday night after an apparent dispute over a home run ball hit by the centre fielder during the game.</p>"
    ],
    "image_url": "",
    "titles": [
      "Young Phillies fan is gifted swag after adult fan takes his home run ball",
      "Angry Phillies fan demands home run ball from father on son’s birthday",
      "Phillies invite young fan to meet Harrison Bader after dispute over home run ball"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A young fan at a Philadelphia Phillies game experienced a dispute over a home run ball hit by outfielder Harrison Bader. Initially believing he had caught the ball, a disagreement with another fan ensued. Following the incident, the Phillies invited the young fan to meet Harrison Bader after their 9-3 victory over the Miami Marlins, turning the situation into a positive experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia's Major Air Assault on Ukraine: 805 Drones, 13 Missiles Launched",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-07T03:22:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Russia carries out massive strikes, attacking Ukraine with 805 drones and 13 missiles. The attacks set fire to Ukraine's cabinet of ministers building. DW has the latest.",
      "Russia unleashed a massive air assault on Ukraine early Sunday, setting the main government building in Kyiv ablaze for the first time during the war."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: Government building damaged during Russia attacks",
      "Ukrainian government building ablaze after Russian drone, missile attacks"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia launched a significant air assault on Ukraine, employing 805 drones and 13 missiles. This attack resulted in the Ukraine's cabinet of ministers building in Kyiv catching fire, marking a notable escalation in the conflict. DW reports on the ongoing situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Illinois Governor Labels Trump \"Wanna-Be Dictator\" Amid Protests",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 03:10:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Illinois Governor JB Pritzker denounces Trump as a wanna-be dictator as protesters rally in Chicago and Washington, DC.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNUzhiQkhPLV90a1hqdkprV2tlNmc0UnM1NDl4TVNMbV9XNFVOb2xIZHlnS0pHUnVKWlBia2g4UlVLeWpDV3FHS3dib09pRDBRcW1YN2NVRjF1UnV0NjZwUGEyeXhUY0Z0V0FySjVGM2hoU21YTy1jZTA4Z3Q2Rl9FTTd2OFYzWU5JZFJYbDNaSQ?oc=5\" target=\"_blank\">Trump threatens Chicago with \"Dep"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens ‘war’ on Chicago as thousands protest federal crackdown",
      "Trump threatens Chicago with \"Department of WAR\" ahead of planned crackdown - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Illinois Governor JB Pritzker criticized Donald Trump, calling him a \"wanna-be dictator\" amid protests in Chicago and Washington, DC. This statement comes as Trump hinted at federal intervention in Chicago, sparking public demonstrations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Rodgers Joins Steelers, Faces Former Jets Replacement",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 07:02:52 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Two years after Aaron Rodgers' New York Jets debut came to a \"devastating\" halt, the four-time MVP returns with the Pittsburgh Steelers, with his replacement also facing his former team.",
      "Two years after Aaron Rodgers' New York Jets debut came to a &quot;devastating&quot; halt, the four-time MVP returns with the Pittsburgh Steelers, with his replacement also facing his former team."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0b65/live/ef8e2cc0-8a59-11f0-8d38-636775327ed2.jpg",
    "titles": [
      "Rodgers back at scene of his darkest day for Pittsburgh Steelers debut",
      "Rodgers back at scene of his darkest day for Pittsburgh Steelers debut"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two years following a disappointing halt to his debut with the New York Jets, four-time MVP Aaron Rodgers returns to play with the Pittsburgh Steelers. In a notable matchup, Rodgers' replacement at the Jets will also face his former team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yoshinobu Yamamoto Achieves 2025 MLB's First No-Hitter",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 03:28:20 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The no-hitter would have been the first of the 2025 MLB season",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNR2xRdHVhODRtSEtjbUhqbFc3cEZlRXdJcFFlY180bVZnelFIOVk2QzhXMm1OZnh4RnhLUVJiVkVGRjV2c21QeURzR1lPc3pWVUFhSlJhVUd2dVg0d1lFOUlBSjBYTkxlSHpuWXVqVVdMbl9rSG9qQklSTlR5OEV0bm1YV18xVHBSUUZlSTdQUQ?oc=5\" target=\"_blank\">Yoshinobu Yamamoto's No-Hitter Br"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/07/e94a3cf7-137e-4bad-86a1-a0a0b397d551/yamamoto-getty.png",
    "titles": [
      "WATCH: Dodgers' Yoshinobu Yamamoto loses no-hitter with one out to go, Orioles win on walk-off against bullpen",
      "Yoshinobu Yamamoto's No-Hitter Broken Up With One Out to Go in Dodgers Disaster - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.907,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Yoshinobu Yamamoto pitched the first no-hitter of the 2025 MLB season, marking a significant achievement in his career and for his team. This event is highlighted as a milestone in the season's progress.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Air Canada Flight Attendants Reject Wage Offer, No New Strike Planned",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 22:35:02 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "But the vote will not lead to a repeat of the walkout that snarled air travel in Canada last month.",
      "VANCOUVER, British Columbia &#8212; Flight attendants at Air Canada and Air Canada Rouge have voted 99.1% against ratifying the company&#8217;s wage offer. Voter turnout was 99.4%. Even with the proposed increase, Air Canada flight attendants would still earn less than federal minimum wage, which is"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/06/multimedia/06canada-airline-pbfl/06canada-airline-pbfl-mediumSquareAt3X.jpg",
    "titles": [
      "Air Canada Flight Attendants Overwhelmingly Reject Proposed Contract",
      "CUPE: Air Canada flight attendants reject Air Canada’s wage offer"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Air Canada flight attendants overwhelmingly rejected the company's wage offer, with 99.1% voting against it, despite a recent agreement that ended a strike disrupting travel. The vote will not lead to another walkout. The rejection comes after operations resumed on Aug. 19 following a strike that impacted thousands. The offered wages are still below the federal minimum wage, despite high voter turnout (99.4%) in the decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Italian Teen Carlo Acutis Celebrated as \"Cyber-Apostle\" for Documenting Miracles",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 23:35:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Before his death at 15, Carlo Acutis was known for his love of technology and had created a website to document miracles.",
      "Italian cyber-apostle, who showed kindness to less fortunate, hailed for using precocious tech talent to spread word."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/de0e/live/bc1429a0-8b83-11f0-9ded-07f8df19ee37.png",
    "titles": [
      "Carlo Acutis: From a baptism in London to the first millennial saint",
      "‘God’s influencer’ Carlo Acutis to become first millennial saint"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlo Acutis, an Italian teenager who passed away at 15, used his technology skills to create a website documenting miracles. Known for his kindness towards the less fortunate, Acutis is celebrated as a \"cyber-apostle\" for his efforts to use his tech talents for religious purposes before his death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Hanks to Be Honored by Military Academy for Citizenship",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 22:48:16 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Little known about decision, although Hanks, who has advocated for military memorials, also voted for Biden</p><p>In Forrest Gump, the <a href=\"https://www.youtube.com/watch?v=BFpVF3lCufo\">title character</a>, played by Tom Hanks, receives the Congressional Medal of Honor from President Lyndon B ",
      "Hanks, 69, was scheduled to be recognized as an “outstanding citizen” who reflected the military academy’s ideals."
    ],
    "image_url": "https://i.guim.co.uk/img/media/122bdcd8c9c949d660a95d97b6b51f4ef7258cea/603_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=48bb0483f3edfaf0808c5733a4fc85ea",
    "titles": [
      "West Point cancels ceremony to honor Tom Hanks as ‘outstanding US citizen’",
      "West Point Alumni Association Reportedly Canceled Ceremony Honoring Tom Hanks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.806,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tom Hanks, aged 69, was set to be honored as an \"outstanding citizen\" by a military academy, reflecting the institution's ideals. This recognition aligns with Hanks' history of advocating for military memorials. Additionally, Hanks, known for his role as Forrest Gump, a character who receives the Congressional Medal of Honor, has shown support for political figures, including voting for Biden. The specifics of the decision to honor him remain largely undisclosed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "USF Upsets University of Florida in Early-Season Shock",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 00:27:49 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "USF handed in-state foe Florida a devastating early-season loss",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOQk80MFFjaDh0M1RycFZyN1JmczNhc1ZRQ1BPN2FJV1FuNTB5UjFua1FUa0RUcG0xb2VYeDFDSy1MOENhYXhRdmZIWnpXb1puTzZEa19UT0pUNW9SMktSdEgzb3VEVlU3VTJGQkgyQUVrTlRBbnFaMWlzYjRmX2MzamRhSi1KN3NLR0xVTUpoNFhHdGhuZHc?oc=5\" target=\"_blank\">South Florida Upsets No."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/07/c0aa718b-dd98-406b-b196-c67320848f8e/usf-1.jpg",
    "titles": [
      "South Florida shocks No. 13 Florida on 20-yard walk-off FG as late penalties cost Gators",
      "South Florida Upsets No. 13 Florida After Ill-Timed Penalty for Spitting - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "South Florida defeated the University of Florida in an early-season game, marking a significant upset. This loss for Florida against an in-state rival, USF, has implications for their season standings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC's Paul Craig Retires After Knockout Loss at UFC Paris",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 18:00:26 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "After a vicious KO loss to Modestas Bukauskas, UFC veteran Paul Craig called it a career on Saturday. Here's the news and everything you need to know about UFC Paris.",
      "<p>Paul Craig retires from MMA as the only fighter to defeat reigning UFC champ Majored Ankalaev.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/67cd3f6bb5849021ca373d61/0x0.jpg?width=960",
    "titles": [
      "UFC Veteran Announces Retirement In Octagon After Buzzer-Beater KO Loss",
      "Paul Craig announces retirement after knockout loss at UFC Paris"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.81,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UFC veteran Paul Craig announced his retirement following a knockout loss to Modestas Bukauskas at UFC Paris. Craig is notable for being the only fighter to defeat current UFC champion Majored Ankalaev.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Escalates Military Actions in Gaza, Orders Evacuations",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 18:44:36 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Israel continues to expand its military operation in Gaza, urging Palestinians to leave Gaza City and move south.",
      "<p>Residents say military gave them 20 minutes to evacuate 15-storey building before attacking, with casualties unclear</p><p>An Israeli strike has destroyed a high-rise building in Gaza City – the second in as many days – as the military demanded residents move to a so-called humanitarian zone in t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/67a0/live/d8f798e0-8b38-11f0-a23b-03b8d466a85d.png",
    "titles": [
      "Israel destroys second high-rise as assault on Gaza City intensifies",
      "Israel destroys second Gaza high-rise as military kills another 56 Palestinians, including aid-seekers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.741,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel has intensified its military operations in Gaza, instructing residents of Gaza City to relocate southwards for safety. The military enforced a 20-minute evacuation notice before destroying a 15-storey building in Gaza City, marking the second such incident in consecutive days. The number of casualties remains uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]