[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technological advancements have made it possible to use robots for various tasks, such as self-driving cars and cleaning robots. While fully autonomous humanoid robots may not be financially accessible to most people within their lifetimes, robot vacuums offer an affordable option for automating home cleaning tasks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8174696782638889,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41436741956597223,
    "summary": "Technological progress has enabled the use of robots for tasks like driving and cleaning. Although fully autonomous humanoid robots remain expensive and out of reach for many, robot vacuums provide a cost-effective solution for automating home cleaning."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, the first major sales event of 2025, coinciding with the start of the warmer months. The sale, which includes discounts on gardening supplies, bedding, and more, is ongoing and will conclude on Monday, March 31st."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7674385192939814,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4018596298234953,
    "summary": "Amazon has initiated its Big Spring Sale, marking 2025's first significant sales event to align with the onset of spring. This event offers reduced prices on various items, including gardening supplies and bedding. The sale is currently active and is set to end on Monday, March 31st."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream, revealing them on its webpage dedicated to the new Virtual Game Card lending system. This system is set to launch soon, marking the first mention of Switch 2 games by the company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7610727485300927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4002681871325232,
    "summary": "Nintendo has announced \"Switch 2 Edition\" games after its Nintendo Direct stream, introducing them on a webpage for its upcoming Virtual Game Card lending system. This marks the company's first mention of Switch 2 games, indicating a new phase for the gaming console."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting several conservative podcasters for hours of access to senior officials from the Trump Administration. This initiative aims to engage alternative media and is planned to be a recurring event, highlighting the administration's priority to include new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7387016802777777,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39467542006944445,
    "summary": "On Thursday, the Trump Administration invited conservative podcasters to the White House for Podcast Row, offering them extended access to senior officials. This event, intended to be recurring, signifies the administration's effort to engage with alternative media outlets."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers are discounted, including its first color e-reader. The Kindle Scribe, notable for its note-taking capability, is on sale for an all-time low price. Only the 16GB version of the latest model is included in this offer."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7300927599652778,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3925231899913194,
    "summary": "During Amazon's Big Spring Sale, several e-readers, including its first color e-reader, are on sale. The Kindle Scribe, known for its note-taking feature, is available at its lowest price ever, but only the 16GB model is part of this promotion."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission have been directed by Bureau of Consumer Protection Director Christopher Mufarrige to stop referring to the agency as \"independent\" in complaints, as per an email revealed by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.702767320775463,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38569183019386577,
    "summary": "The Bureau of Consumer Protection's Director, Christopher Mufarrige, has instructed Federal Trade Commission staff to cease describing the agency as \"independent\" in official complaints, according to an email disclosed by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian company, has launched the Classic 2 trackball mouse, maintaining the same design and ergonomics as its predecessor but featuring enhanced connectivity, a more precise scroll wheel, and an updated design optimized for easier 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6976651223842593,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3844162805960648,
    "summary": "Ploopy, a Canadian firm, has released the Classic 2 trackball mouse, preserving the original model's design and ergonomics. The new version offers improved connectivity, a more accurate scroll wheel, and a design update for simpler 3D printing."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until Monday, March 31st, offering a wide range of deals that are accessible without an Amazon Prime membership. The sale features over 90 deals on popular items, including some budget-friendly options."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6709193215509259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37772983038773145,
    "summary": "Amazon is holding its Big Spring Sale until March 31st, featuring more than 90 deals on various items. These deals are available to all shoppers, not just Amazon Prime members, and include a selection of budget-friendly options."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft announced it is creating a subsidiary for Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six, with Tencent investing approximately $1.3 billion for a 25% stake. This values the new subsidiary at around $4.3 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6665469249652778,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37663673124131947,
    "summary": "Ubisoft is launching a subsidiary focused on its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises. Tencent is investing about $1.3 billion for a 25% share in the subsidiary, valuing it at approximately $4.3 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on a variety of gadgets, including Apple's M-series chip-equipped MacBooks. These MacBooks are available in several sizes and price points, following Apple's discontinuation of the M1 MacBook Air."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6614558002662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3753639500665509,
    "summary": "Amazon has launched its Big Spring Sale, offering substantial discounts on numerous gadgets, among them Apple's M-series chip MacBooks. These discounted MacBooks come in various sizes and price ranges, especially noteworthy since Apple has discontinued the M1 MacBook Air."
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the Arctic, Russia's President addressed Donald Trump's plans, labeling them as \"serious.\" He also made it clear that these plans have no connection to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered because of tariffs imposed by Trump, potentially affecting future collaborations between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that Trump's tariffs have changed Canada-US relations, possibly impacting future cooperation between the countries."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has expressed opposition to JD Vance and his wife, following Donald Trump's vow to assert control over the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has opposed JD Vance and his wife, in response to Donald Trump's promise to take control of the island."
  },
  {
    "title": "Six dead after tourist submarine sinks in Red Sea",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:42:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A vessel carrying tourists sank off the coast of Hurghada in the Red Sea on Thursday morning. Local authorities reported that 39 people were rescued following the incident near Hurghada's tourist promenade area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tourist boat sank near Hurghada in the Red Sea on Thursday morning. Local officials confirmed that 39 individuals were rescued after the incident, which occurred close to the city's tourist promenade."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has instructed his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was deported by the United States to a prison in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son after he was deported from the United States to a jail in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Australian Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a revitalized opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Australian Prime Minister Anthony Albanese is seeking re-election, facing competition from a rejuvenated opposition party."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The killer's initial request for parole was rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was murdered by the founder of her fan club. The individual responsible for the murder was denied parole in Texas during their first request for release."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing it of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies, with China among them, have committed to retaliating against the United States, alleging that it has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's development was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The development of the technology was reportedly supported by Russia, as indicated by analysts."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist, was arrested in Istanbul during protest coverage and later deported to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The film, featuring Robert Downey Jr as Doctor Doom, is scheduled for release in May 2026."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A film starring Robert Downey Jr as Doctor Doom is set to be released in May 2026."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested following an incident in which police, with assistance from a local resident, managed to overpower the individual."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been arrested after police, with help from a local resident, successfully subdued the individual involved in an incident."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, a recent update revealed."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed after the child reported seeing a \"monster.\""
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Poland has passed a law enabling its authorities to temporarily suspend asylum rights at the border with Belarus."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Poland has enacted a law permitting the temporary suspension of asylum rights at its border with Belarus."
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his home, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as reported by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Boualem Sansal, an 80-year-old individual, stated in an interview with a far-right news outlet that colonial France allocated excessive land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Boualem Sansal, an 80-year-old, claimed in an interview with a far-right news outlet that colonial France gave too much land to Algeria."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the deaths of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine and emphasized his country's resilience."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky highlighted Europe's backing for Ukraine and stressed the nation's determination in facing challenges."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A combination of international and national factors has made the government's efforts to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mix of global and domestic issues is complicating the government's campaign for re-election."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban Indians increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is witnessing growth as more affluent, urban residents are spending more on their pets, particularly dogs and cats, treating them with various luxuries and care products."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that the combination of strong winds, dry land, and pine trees significantly increases the risk of wildfires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts caution that the risk of wildfires is heightened due to strong winds, dry conditions, and the presence of pine trees, which contribute to the potential for fires."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms family trees into dynamic movies, illustrating the global movements of ancestors over time. This innovative approach not only enhances genealogical research but also has applications in tracking disease spread and studying animal migration patterns across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns family trees into animated movies, showing how ancestors moved around the world over time. This method improves genealogical research and can also be used to track the spread of diseases and study animal migration patterns globally."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over recent decades is due to increased meltwater and rainfall."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rainfall account for 60% of the unexpected difference in ocean temperatures around Antarctica in recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study found that many individuals with Long COVID often feel ignored, doubted, and unsupported by their healthcare providers, indicating a significant gap in patient-provider communication and understanding regarding this condition."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit distinct gene regulation patterns. This variation in gene regulation among skeletal cells may contribute significantly to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that in vertebrates, skeletal cells from different parts of the body come from various precursor cells and have unique gene regulation patterns. This diversity in gene regulation may play a key role in vertebrates' evolutionary success."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will encourage scientists to address and counteract the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, suggests adding eugenics to college genetics curriculums. He argues this will help scientists confront and prevent the misuse of science for political aims."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An analysis of soil samples from twelve parks in Dublin, Ireland, found that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil analysis in twelve Dublin parks revealed higher concentrations of infective roundworm eggs at park entrances than in other park areas."
  },
  {
    "title": "Men's Sweet 16 live tracker: 3-seed Texas Tech being challenged for Elite Eight spot, while 1-seed Duke in control",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:36:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm ready to assist you. Please provide the news content you'd like summarized."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Please provide the news content you want summarized."
  },
  {
    "title": "Giddey's 47-ft, buzzer-beating heave stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey scored a 47-foot 3-pointer at the buzzer, leading the Chicago Bulls to a 119-117 win over the Los Angeles Lakers. This dramatic shot marked one of the season's most exciting finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey hit a 47-foot 3-pointer at the buzzer, securing a 119-117 victory for the Chicago Bulls over the Los Angeles Lakers. This thrilling moment is highlighted as one of the NBA season's most exciting finishes."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not provide a clear statement on his future with the team following their Sweet 16 loss to Florida on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following Maryland men's basketball team's Sweet 16 defeat to Florida, Coach Kevin Willard did not give a definitive answer regarding his future with the team."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU in the East Region semifinal. Mark Sears led the team in this historic achievement, breaking a 35-year-old record."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in the East Region semifinal. Mark Sears was the leading scorer in this game, which broke a record that had stood for 35 years."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut game for the Mets on Thursday, Juan Soto struck out with two outs in the ninth inning, missing an opportunity to tie the game. This resulted in the Astros securing a 3-1 victory."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing a game tie. This led to the Astros winning the match 3-1."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, amid offseason trade rumors. His performance led to a curtain call from Cardinals fans, acknowledging the moment's importance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, leading to a curtain call from Cardinals fans amidst offseason trade rumors. This moment highlighted his significant contribution to the game."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to unfairly blame him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the organization conspired with the university to unjustly hold him responsible."
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former NFL player LeShon Johnson faces charges related to dogfighting following the seizure of 190 dogs from his property last year. The case is now proceeding in federal court."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former NFL player LeShon Johnson is charged with involvement in dogfighting after 190 dogs were seized from his property. The case is currently moving forward in federal court."
  },
  {
    "title": "Crosby breaks Gretzky's point-per-game record",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sidney Crosby has set a new NHL record for maintaining a point-per-game average over his career, surpassing the previous record held by Wayne Gretzky."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Sidney Crosby has broken the NHL record by maintaining a point-per-game average over his career, surpassing the previous record set by Wayne Gretzky."
  },
  {
    "title": "How Calipari's departure led to Kentucky, Arkansas and BYU in the Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The coaching changes across three teams have successfully led each of them into the second weekend of competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Three teams have advanced to the second weekend of their competition following successful coaching changes."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders analyze major NBA awards, focusing on the MVP competition between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Insiders are analyzing the NBA's major awards, with a spotlight on the MVP race. The competition is highlighted by Nikola Jokic and Shai Gilgeous-Alexander, who are both considered strong contenders for the Most Valuable Player award."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season has marked a historic high in the number of 3-point attempts in the league, sparking discussions on whether there is a need to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The current basketball season has seen a record number of 3-point shot attempts, leading to debates about potentially limiting how often these shots are taken."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts have made their predictions for the 2025 baseball season, including whether the Dodgers can win again and who might be named MVP."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts have predicted outcomes for the 2025 baseball season, focusing on the potential for the Dodgers to secure another victory and identifying candidates for the MVP title."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides information for teams aiming to succeed in 2025, offering insights and support regardless of whether they are already favorites or underdogs hoping to make a significant impact."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article offers guidance and support for teams aiming to achieve success in 2025, catering to both favorites and underdogs seeking to make a significant impact."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The latest Sweet 16 player rankings have sparked interest in whether Paige Bueckers, Lauren Betts, or Hannah Hidalgo will secure the top position."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The recent release of the Sweet 16 player rankings has generated widespread interest in the basketball community, focusing on whether Paige Bueckers, Lauren Betts, or Hannah Hidalgo will claim the top spot."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team towards a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading figures in Notre Dame's basketball team, significantly contributing to the team's pursuit of a championship title."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical capacity, has made his own selections for the first round of an unspecified event, presumably related to sports. This activity is indicative of Tannenbaum applying his experience as a general manager to make theoretical picks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, with his background as a general manager, made theoretical first-round selections for an unspecified sports event. This exercise showcases his application of expertise in a hypothetical scenario."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised widespread concern within college athletics over the potential for other athletes to be victims."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concerns in college athletics about the possibility of more athletes being victims."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in Europe's top football leagues are currently dominating in the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1. Each league has standout players who are at the top of the scoring charts, showcasing their talent and contributing significantly to their teams' performances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top scorers in Europe's major football leagues—Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1—are significantly impacting their teams by leading the scoring charts. These standout players are showcasing their talent across the continent."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced on Thursday that four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, are under investigation for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" in a Champions League match against Atlético Madrid, as announced on Thursday."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, contrasting with the situation a year ago, indicating no immediate need to make decisions about his future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, is not currently considering offers from other clubs, showing a change from the situation a year ago. This suggests he does not have to make immediate decisions about his future."
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona's women's team advanced to the Champions League semi-finals after defeating VfL Wolfsburg 6-1 at home in the quarter-final's second leg. This victory secured them a 10-2 win on aggregate, as they continue their defense of the title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona's women's team progressed to the Champions League semi-finals by beating VfL Wolfsburg 6-1 at home, achieving a 10-2 aggregate victory in the quarter-final. They are continuing their defense of the title."
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Premier League clubs will have an early 10-day transfer window in June before the FIFA Club World Cup, followed by a reopening on June 16, according to an announcement from the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Premier League clubs are set to have a 10-day transfer window in early June, ahead of the FIFA Club World Cup. The transfer window will then reopen on June 16, as announced by the league."
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Manchester City plans to delay any decisions on Claudio Echeverri's future with the team until the summer, according to information from a source reported by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Manchester City will postpone making decisions about Claudio Echeverri's future with the team until the summer, as reported by ESPN citing a source."
  }
]