[
  {
    "title": "England Wins Third Women's Rugby World Cup, Defeating Canada 33-13",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 10:52:12 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC",
      "CityNews",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "England were not always world-beaters. But two big bets on their future and the women's game turned around their fortunes.",
      "In 2017 and 2022 England's Red Roses suffered crushing Rugby World Cup final defeats. On Saturday, they banished those demons to clinch final success over Canada.",
      "<p>England finally has a Women&#8217;s Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.</p>",
      "England finally has a Women&#8217;s&#160;Rugby&#160;World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday. Victory by five tries to three capped an astonishing World Cup cycle in which England won every match, 33 in a row,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/60fc/live/54b9ab20-9c56-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "How two big gambles finally paid out in Red Roses World Cup glory",
      "How England's Red Roses banished Rugby World Cup final demons",
      "Canada drops Women’s Rugby World Cup final against England",
      "Canada loses Women’s Rugby World Cup final 33-13 to England"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.953,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "England won their third Women's Rugby World Cup title by defeating Canada 33-13 at Twickenham, in front of a record crowd of 81,885. Ellie Kildunne stood out in a game that marked England's dominance in women's rugby, completing a perfect World Cup cycle with 33 consecutive wins. This victory cements England's status as a powerhouse in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stampede at Tamil Nadu Rally for Actor Vijay Kills 39, Injures 40",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 02:39:53 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others.",
      "A crowd crush at a campaign rally for popular actor-turned-politician Vijay has killed at least 39 people in Karur.",
      "Crush at actor-politician Vijay’s rally in Tamil Nadu kills 39 people, including eight children; 40 others injured.",
      "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay."
    ],
    "image_url": "",
    "titles": [
      "Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40",
      "Crowd crush kills dozens in India at political rally for Tamil actor Vijay",
      "Crowd crush at political rally in southern India kills 39 people",
      "Stampede at Actor’s Political Rally Kills at Least 38 in India"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.892,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A stampede at a campaign rally in Tamil Nadu for actor-turned-politician Joseph Vijay Chandrasekhar, known as Vijay, resulted in at least 39 deaths, including eight children, and injured 40 others. The incident occurred in Karur during an event for the popular Indian actor and politician.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Reimposes Sanctions on Iran Over Nuclear Concerns",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 01:29:33 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The United Nations reimposed sanctions on Iran early Sunday over its nuclear program, further squeezing the Islamic Republic as its people increasingly find themselves priced out of the food they need to survive and worried about their futures.",
      "The United Nations has reimposed sanctions on Iran over its nuclear program",
      "<p>Foreign ministry attacks ‘unjustifiable’ return of measures expected to have wide effects on troubled economy</p><p>Widespread UN sanctions against Iran have come back into force for the first time in a decade, prompting anger from Tehran, after last-ditch nuclear talks with western powers failed"
    ],
    "image_url": "",
    "titles": [
      "UN imposes 'snapback' sanctions on a hungrier, poorer and more anxious Iran",
      "UN imposes 'snapback' sanctions on Iran over its nuclear program",
      "Iran angry as sweeping UN sanctions take effect after failure of nuclear talks"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.87,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United Nations has reimposed sanctions on Iran due to concerns over its nuclear program, marking the first return of such measures in a decade. This decision comes after nuclear talks with Western powers failed, significantly affecting Iran's already troubled economy and exacerbating the financial difficulties faced by its citizens. Tehran has criticized the sanctions as \"unjustifiable.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Argentina Shocked by Live-Streamed Murder of Three Women; 5 Arrested",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 11:19:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Thousands are demanding justice after a suspected drug gang livestreamed on Instagram the torture and killing",
      "Drug gang suspected in torture and murder of two young women, and a 15-year-old girl, in crime that shocks Argentina.",
      "The murder of three young women who were tortured live on social media has shocked Argentina. Five suspects have been detained but the alleged mastermind behind the killings is still at large.",
      "The live streamed torture and killing of three young women in Buenos Aires has stunned the country, setting off worries about the increasing presence of drug cartels."
    ],
    "image_url": "",
    "titles": [
      "Livestreamed brutal murder of three young women sparks outrage in Argentina",
      "Thousands protest livestreamed murder of 2 women, young girl in Argentina",
      "Argentina: Thousands march for women murdered on livestream",
      "Brutal Murder of 3 Women, Broadcast On Instagram, Shocks Argentina"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Argentina, three young women, including a 15-year-old girl, were tortured and murdered, an act broadcasted live on social media, shocking the nation. Five suspects are in custody, yet the alleged mastermind remains at large.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cleveland Guardians Clinch Playoff Spot After Historic Comeback",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 23:07:25 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Guardians clinched a playoff berth Saturday night after CJ Kayfus was hit by a pitch with the bases loaded in the ninth inning.",
      "For the seventh time in 10 seasons, Cleveland heads to the postseason",
      "<p>It took 161 games, but we finally know the six teams that will battle it out in the American League playoffs.</p>",
      "<p>Watch as Cleveland Guardians&#8217; C.J. Kayfus is hit by a pitch with the bases loaded, resulting in his team becoming the final American League squad to clinch a post-season spot. </p>",
      "<p>Jamhai Jones hit a two-run single to rally Detroit from an early deficit, and the Tigers beat the Boston Red Sox 2-1 on Saturday to clinch a spot in the AL playoffs.</p>",
      "<p>Sal Stewart homered and hit an RBI single, Miguel Andjuar went 3-for-5 and the Cincinnati Reds moved a step closer to their first post-season berth since 2020 by beating the Milwaukee Brewers 7-4 on Saturday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Guardians clinch playoff berth on walk-off HBP",
      "Guardians clinch MLB playoff spot on walk-off hit-by-pitch in pursuit of AL Central, record-breaking comeback",
      "Guardians walk off Rangers on HBP to become final AL playoff team to clinch",
      "Guardians clinch post-season berth on walk-off hit-by-pitch",
      "Tigers clinch AL playoff berth with win over Red Sox",
      "Reds on cusp of playoff berth after beating Brewers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.828,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Cleveland Guardians secured a playoff spot for the seventh time in ten seasons after a win clinched by CJ Kayfus getting hit by a pitch with bases loaded in the ninth inning. This achievement comes after a significant mid-season turnaround, overcoming a 10-game losing streak in July. The Guardians' entry into the postseason was confirmed in their 161st game, marking one of the biggest comebacks in baseball history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlos Ulberg Wins First UFC Main Event in Perth, Eyes Title Shot",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 08:00:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "CBS Sports"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Carlos Ulberg dropped Dominick Reyes in the opening round for his ninth straight win at UFC Fight Night in Australia.",
      "The native of New Zealand made it look easy on Saturday night in Australia",
      "Ulberg or Reyes can make a serious statement the week before UFC 320: Magomed Ankalaev vs. Alex Pereira 2",
      "<p>Carlos Ulberg made a massive statement in his first UFC main event spotlight and moved one step closer to a title shot.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ulberg dominates Reyes with first-round KO at UFC Fight Night",
      "UFC Fight Night results, highlights: Carlos Ulberg blasts Dominick Reyes for first-round KO, wants title shot",
      "UFC Fight Night prediction -- Carlos Ulberg vs. Dominick Reyes: Fight card, start time, odds, live stream",
      "Carlos Ulberg knocks out Dominick Reyes at UFC Perth to inch closer to title"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlos Ulberg, a fighter from New Zealand, secured a significant victory in his first UFC main event on September 27, 2025, at UFC Perth, Australia. Despite the event experiencing three late cancellations, including both Tafa brothers, Ulberg's performance stood out across the 12 bouts that took place. His win has positioned him closer to a title shot in the UFC.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Backs £1.5bn Loan for JLR to Recover from Cyber-Attack, Restart Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 10:11:53 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ministers hope the loan, from a commercial bank and underwritten by the government, will give certainty to suppliers.",
      "Government says guarantee from UK Export Finance will protect the automotive supply chain",
      "<p>Britain’s largest automotive employer plans to restart engine manufacturing in early October, report says</p><p>The government has said it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) as the carmaker battles the consequences of a recent cyber-attack.</p><p>JLR had to suspend"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d5f6/live/8d1a5bf0-9c5a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Government to guarantee £1.5bn loan to Jaguar Land Rover after cyber shutdown",
      "Jaguar Land Rover wins £1.5bn UK loan support after cyber attack",
      "UK government will underwrite £1.5bn loan guarantee to Jaguar Land Rover after cyber-attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.94,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK government has underwritten a £1.5bn loan guarantee to Jaguar Land Rover (JLR), Britain's largest automotive employer, to help it recover from a cyber-attack and restart engine manufacturing in early October. This move, involving a loan from a commercial bank backed by UK Export Finance, aims to protect the automotive supply chain and provide certainty to suppliers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Reports 500 Drones in Heavy Attack on Ukraine",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 04:52:23 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy said the large-scale attacks involved nearly 500 strike drones.",
      "Media reports and independent monitor describe the latest strikes on Ukraine as &#039;one of the heaviest&#039; since war began."
    ],
    "image_url": "",
    "titles": [
      "Large Russian drone and missile attack on Kyiv kills 4 and wounds at least 10",
      "At least 4 killed in major Russian drone, missile attack on Ukraine’s Kyiv"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy reported nearly 500 strike drones were used in one of the heaviest attacks on Ukraine since the war began. This information is supported by media reports and independent monitors, highlighting the scale of the assault.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Deploys Troops to Protect Immigration Facilities in Major US City",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 21:42:04 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The president says the latest move is \"necessary\" to protect immigration detention facilities in the major US city.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "President Trump on Saturday said he ordered the deployment of troops to Portland to combat alleged domestic terrorists."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f730/live/021eaaf0-9c01-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Trump authorises 'full force' as Portland set to become latest city to see troops deployed",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Trump admin live updates: Gov. says 'no need' after Trump directs troops to Portland"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.725,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The President has announced the deployment of troops to a major US city, marking the fourth such action in Democrat-controlled cities. This move aims to safeguard immigration detention facilities, deemed \"necessary\" for their protection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadiens Beat Maple Leafs 4-2 in NHL Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 01:51:13 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Riley Kidney and Lane Hutson each scored power-play goals in the second period and the visiting Montreal Canadiens defeated the Toronto Maple Leafs 4-2 in NHL pre-season action on Saturday.",
      "<p>Designated for a new role this season, Alex Newhook looked the part Saturday in a win over the Maple Leafs. </p>\n<p>If he can replicate that type of effort in the regular season, it will go a long way for the Canadiens. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/aeec906f82173b3430671e411a85bb59a73cc9d1f9e595f4a22c0d3f9ab6e395.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens use power play to beat Leafs",
      "Newhook shines in new role to help Canadiens beat Maple Leafs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.807,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Riley Kidney and Lane Hutson scored power-play goals in the second period, leading the Montreal Canadiens to a 4-2 victory over the Toronto Maple Leafs in an NHL pre-season game. Alex Newhook, in a new role for the Canadiens, also impressed during the match. The outcome highlights potential strengths for Montreal as they prepare for the regular season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russian Strikes Kill 4 in Ukraine; Poland Secures Airspace",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 09:29:07 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy says assault involved nearly 500 drones and more than 40 missiles",
      "<p>At least four people were killed in the overnight attacks on Kyiv and other regions as Poland takes preventive measure to secure airspace</p><p>Russian strikes involving “hundreds” of drones and missiles have killed at least four people, including a 12-year-old girl, and wounded at least 10 peopl"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F395702f2-45f4-4fbf-9323-88e1ba81ae57.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Russian missiles and drones pound Ukraine in ‘savage’ 12-hour attack",
      "‘Hundreds’ of Russian missiles and drones hit Ukraine in deadly strikes as Poland scrambles jets"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russian strikes on Kyiv and other Ukrainian regions, involving nearly 500 drones and over 40 missiles, resulted in at least four deaths, including a 12-year-old girl, and wounded at least 10 individuals. In response to the attacks, Poland has taken measures to secure its airspace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "West Revives UN Resolutions Against Iran; Inflation, Shortages Plague Nation",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 09:48:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Six UN resolutions against Iran are automatically revived by the West as Iran and Russia call the move &#039;null and void&#039;.",
      "Already suffering a 40 percent inflation rate and critical shortages of power and water, many in Iran expect conditions to get worse."
    ],
    "image_url": "",
    "titles": [
      "Iranians fear more economic pain, war as UN sanctions snapback",
      "Iranians Brace for Economic Impact of New U.N. Sanctions"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The West has revived six UN resolutions against Iran, a move that Iran and Russia deem 'null and void'. Amidst this, Iran is grappling with a 40 percent inflation rate and severe shortages of power and water, with the populace bracing for worsening conditions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Starmer Labels Farage's Immigration Policy \"Racist\" Amid Poll Concerns",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-28T11:52:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "British Prime Minister Keir Starmer has called for discipline within his center-left Labour Party as polls show Nigel Farage's anti-immigration Reform UK party well ahead.",
      "UK prime minister calls key Reform policy ‘racist’ as he focuses fire on Nigel Farage’s party"
    ],
    "image_url": "",
    "titles": [
      "Keir Starmer urges Labour to unite against Reform UK",
      "Starmer urges Labour to unite for ‘fight of our lives’ ahead of conference"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British Prime Minister Keir Starmer criticized Nigel Farage's Reform UK party's main anti-immigration policy as \"racist.\" Starmer emphasized the need for discipline within his center-left Labour Party amid polls indicating Farage's party is leading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Rays 5-1, Clement Scores Twice, Yesavage Pitches Shutout",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 21:43:05 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ernie Clement scored twice and drove in two runs while rookie starter Trey Yesavage threw five shutout innings as the Toronto Blue Jays defeated the Tampa Bay Rays 5-1 on Saturday afternoon.",
      "<p>Alejandro Kirk hit a solo shot, Trey Yesavage struck out five through five scoreless innings, and the Toronto Blue Jays took a 5-1 win over the Tampa Bay Rays.</p>",
      "<p>Aaron Judge, Giancarlo Stanton and Ryan McMahon all belted home runs as the New York Yankees sailed to a 6-1 victory over the Baltimore Orioles. Cam Schlittler earned the win on the mound, striking out nine over seven innings of work.</p>",
      "<p>Jahmai Jones drove in both of his team&#8217;s runs on two hits to lead the Detroit Tigers to a 2-1 win over the Boston Red Sox – clinching a playoff berth in the process. Despite the loss, rookie Connelly Early struck out seven over five innings of work.</p>",
      "<p>Pete Alonso picked up his 38th home run of the season and blasted an RBI double to lead the New York Mets to a 5-0 victory over the Miami Marlins. Clay Holmes tossed six innings of one-hit ball to earn his 12th win on the year. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/cb5558399663a5e2770ee6f5aa1407e6ce43cf1c990bc61c3c5b33a944f3b252.jpg?quality=65&strip=all",
    "titles": [
      "Clement leads the way as Blue Jays top Rays 5-1",
      "MLB Highlights: Blue Jays 5, Rays 1",
      "MLB Highlights: Yankees 6, Orioles 1",
      "MLB Highlights: Tigers 2, Red Sox 1",
      "MLB Highlights: Mets 5, Marlins 0"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.74,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ernie Clement scored twice and had two RBIs, and Trey Yesavage pitched five shutout innings, leading the Toronto Blue Jays to a 5-1 victory over the Tampa Bay Rays on Saturday. Clement's performance included a two-run double, and Andres Gimenez added an RBI single in the second inning to secure the win for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kyiv Hit by Over 600 Drones and Missiles; Casualties Reported",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 11:46:41 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "More than 600 drones and missiles, predominantly aimed at Kyiv, hit factories and the Institute of Cardiology.",
      "<p>Twelve-year-old girl among those killed in Kyiv; unidentified drones spotted over Danish military bases on Saturday night</p><p>In an address at the UN general assembly in New York on Saturday, Moscow’s foreign minister <strong>Sergei Lavrov</strong> warned that “any aggression against my country"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7e0c/live/0796d830-9c48-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Zelensky condemns 'vile' Russian strikes lasting 12 hours",
      "Zelenskyy condemns ‘vile’ and deadly Russian strikes on Ukraine; drones spotted over Danish military sites – Europe live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 600 drones and missiles targeted Kyiv, impacting factories and the Institute of Cardiology, resulting in casualties including a 12-year-old girl. Concurrently, unidentified drones were observed over Danish military bases. At the UN General Assembly, Russia's Foreign Minister Sergei Lavrov issued a warning against aggression towards Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seychelles to Hold Presidential Election Rerun, Date TBD",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 10:31:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "The electoral authority has not announced when the rerun election is expected to be held.",
      "VICTORIA, Seychelles (AP) &#8212; With no outright winner in Seychelles&#8217; presidential election, the country will hold a rerun vote between the two main contenders, the electoral authority said Sunday. The date for the rerun hasn&#8217;t been announced yet. Opposition figure Patrick Herminie re"
    ],
    "image_url": "",
    "titles": [
      "Seychelles to hold rerun presidential election as no candidate secures 50%",
      "Seychelles to hold rerun presidential election after no outright winner"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seychelles will have a rerun of its presidential election after no candidate won outright, according to the electoral authority. The two main contenders, including opposition figure Patrick Herminie, will compete in the rerun, though the date for this election has not yet been announced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova Votes in Key Election Amid Russian Interference Claims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 06:42:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "Most polls project the governing pro-EU Party of Action and Solidarity in the lead.",
      "CHISINAU, Moldova (AP) &#8212; Moldovans on Sunday cast ballots in a tense parliamentary election plagued by claims of Russian interference, a vote seen as a choice between integration with the European Union or a drift back into Moscow&#8217;s fold. Sunday&#8217;s pivotal vote will elect a new 101-"
    ],
    "image_url": "",
    "titles": [
      "Moldova holds parliamentary elections hit by claims of Russian interference",
      "Moldovans vote in a tense election plagued by Russian interference claims"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldovans voted in a crucial parliamentary election amid claims of Russian interference. The election is viewed as a pivotal moment, deciding between further integration with the European Union or closer ties to Moscow. Most polls place the pro-EU Party of Action and Solidarity in the lead.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Marc Márquez Clinches Seventh MotoGP Title at Japanese Grand Prix",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 07:10:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The 32-year-old wins his first MotoGP riders&#039; title since 2019 after finishing second to Francesco Bagnaia at Motegi.",
      "<ul><li><p>Francesco Bagnaia wins Japanese Grand Prix</p></li><li><p>Márquez takes unassailable lead with five races to go</p></li></ul><p>Ducati’s Marc Márquez clinched his seventh MotoGP world championship at the Japanese Grand Prix on Sunday and his first since 2019 after he took an unassailable "
    ],
    "image_url": "",
    "titles": [
      "Marc Marquez wins 2025 MotoGP world championship at Japanese Grand Prix",
      "Marc Márquez beats brother Álex to emotional MotoGP world championship"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Marc Márquez, riding for Ducati, secured his seventh MotoGP world championship title and his first since 2019 by finishing second at the Japanese Grand Prix, behind race winner Francesco Bagnaia. With this result, Márquez took an unassailable lead in the championship standings with five races remaining in the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Nears Ryder Cup Victory with Record Lead Over US",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 18:53:55 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Europe is on the verge of retaining the Ryder Cup after a dominant Saturday left it just 2.5 points from victory over the United States at Bethpage Black.",
      "<p>On an &#8220;intense&#8217; Day 2 at the Ryder Cup, Rory McIlroy helped lead the European side to an 11.5-4.5 advantage. </p>\n<p>And if history tells us anything, that’s an insurmountable lead.</p>"
    ],
    "image_url": "",
    "titles": [
      "Europe holds historic lead, on brink of Ryder Cup",
      "McIlroy helps Europe take commanding lead after ‘intense’ Day 2 at Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Europe is on the verge of retaining the Ryder Cup after taking a record seven-point lead over the United States at Bethpage Black, despite facing a barrage of insults from the crowd. Rory McIlroy described the abuse as \"really, really challenging.\" Europe needs just 2.5 points to secure victory, following a dominant performance on Saturday. President Donald Trump did not attend the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McIlroy, Lowry Endure Fan Abuse, Lead Europe to Ryder Cup Victory",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 01:23:32 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After facing abuse from American fans which \"crossed the line\", Rory McIlroy and Shane Lowry lead Europe towards a rare Ryder Cup away win.",
      "<p>Rory McIlroy backed away from the ball, turned around and told a group of heckling fans to sShut the (expletive) up!” Then, he stepped up to his shot and did the work himself.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/509b/live/d25f81e0-9bf6-11f0-be96-85c61452c8b2.jpg",
    "titles": [
      "McIlroy & Lowry silence New York crowd on famous European day",
      "Fiery Rory McIlroy colourfully tells New York crowd to shut up"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.782,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rory McIlroy and Shane Lowry faced abuse from American fans during the Ryder Cup, with incidents crossing the line of sportsmanship. Despite the hostile environment, they led Europe towards a rare away victory. McIlroy notably confronted hecklers directly, demanding silence before taking his shot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Sightings Near Defense Sites in Germany and Denmark",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 23:58:48 +0000",
    "source": "Fortune",
    "sources": [
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "financialpost.com",
      "fortune.com"
    ],
    "snippets": [
      "In neighboring Germany, several drones were reported in the northern German state of Schleswig-Holstein, which borders Denmark, from Thursday into Friday night.",
      "BERLIN (AP) &#8212; The Danish defense ministry said Saturday that &#8220;drones have been observed at several of Danish defense facilities.&#8221; The new drone sightings overnight Friday into Saturday come after there were several drone sightings in the Nordic country earlier this week, with some "
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/GettyImages-2236871014-e1759017055385.jpg?w=2048",
    "titles": [
      "Denmark reports drone sightings at military facilities as NATO warns Russia about violating airspace",
      "Denmark reports new drone sightings at military facilities"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.776,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Germany and Denmark, multiple drone sightings were reported near defense facilities. In Germany, the drones were seen in Schleswig-Holstein, while in Denmark, the sightings occurred at several defense locations overnight from Friday to Saturday, following earlier reports of drones in the region earlier in the week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Deploy Troops to Portland, Threatens \"Full Force\" Use",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T17:21:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local offic"
    ],
    "image_url": "",
    "titles": [
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Donald Trump says he is deploying troops to Portland, Oregon"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.676,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump announced on Saturday that he plans to deploy troops to Portland, Oregon, authorizing the use of \"Full Force\" if needed to counteract what he termed \"domestic terrorists.\" This decision aims to protect U.S. Immigration and Customs Enforcement facilities. The announcement was made via social media, with no immediate details provided by the White House.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  }
]