[
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of an ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.962379884837963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45059497120949077,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while a court case is ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has announced that in the latest Windows 11 Insider Preview, it will remove a bypass script that previously allowed users to set up Windows 11 devices without an internet connection and logging in. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged into an account during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9583734852083333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4495933713020833,
    "summary": "Microsoft will update Windows 11 Insider Preview, removing a script that permitted offline setup. Now, setting up Windows 11 devices requires an internet connection and account login."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until March 31st, offering numerous deals accessible without an Amazon Prime membership. The main roundup includes over 100 deals on popular gear, while another post highlights affordable options."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9500852515856482,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44752131289641206,
    "summary": "Amazon's Big Spring Sale, running until March 31st, features over 100 deals on popular items, accessible to all customers without requiring an Amazon Prime membership. The sale also includes a selection of affordable options highlighted in a separate post."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X (previously Twitter) in an all-stock deal. Musk valued xAI at $80 billion and X at $33 billion, which includes $12 billion of debt. This acquisition comes years after Musk originally bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9441142785532407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44602856963831017,
    "summary": "Elon Musk's AI firm, xAI, has bought the social media platform X (formerly Twitter) in an all-stock transaction, valuing xAI at $80 billion and X at $33 billion, including $12 billion in debt. This follows Musk's initial purchase of Twitter for $44 billion years earlier."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has initiated testing for Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653). This feature, aimed at IT professionals, enables remote recovery of Windows 11 devices that are unable to boot. It was first announced last year to prevent incidents similar to the Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.936716655787037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44417916394675927,
    "summary": "Microsoft has begun testing Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This feature, designed for IT professionals, allows for the remote recovery of devices that cannot boot. It was introduced following the Crowdstrike incident last year, aiming to enhance system resilience."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, following its acquisition of Fitbit in early 2021. Initially, users were required to make the switch by 2025, but a recent email to Fitbit customers announced the extension."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9205920317824074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4401480079456018,
    "summary": "Google has postponed the deadline for Fitbit users to transfer their accounts to Google accounts to next year. This decision comes after Google's acquisition of Fitbit in early 2021. Initially, the migration was mandatory by 2025, but a new announcement via email to Fitbit customers has extended this timeline."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer relations with the Trump administration following obstacles in global talks. Initially sponsored by Nauru, TMC's activities in 2021 accelerated efforts to establish mining regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9101422768981482,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43753556922453707,
    "summary": "The Metals Company (TMC), focusing on deep-sea mining, sought to improve ties with the Trump administration after facing challenges in international discussions. Initially backed by Nauru, TMC's actions in 2021 pushed for the creation of mining regulations."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the onset of warmer months. This sale event, running until March 31, 2025, features significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9010911157291667,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43527277893229166,
    "summary": "Amazon has initiated its Big Spring Sale, which will last until March 31, 2025. The sale offers substantial discounts on a wide range of products, such as gardening supplies and bedding, to mark the beginning of the warmer months."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are co-writing a thriller novel with elements similar to Squid Game, as reported by Deadline. The untitled book, attracting eight-figure bids for publishing rights, features a storyline where participants battle to survive lethal challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8907854107060185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43269635267650464,
    "summary": "MrBeast and James Patterson are collaborating on a thriller novel inspired by Squid Game, involving deadly survival challenges. The yet-to-be-titled book has received publishing bids in the eight-figure range, according to Deadline."
  },
  {
    "title": "Lenovo’s upcoming SteamOS handheld will cost $50 more than expected",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:16:01-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lenovo unveiled the Legion Go S, a handheld gaming PC running SteamOS, at CES 2025, priced at $499.99. This positions it as a competitor to Valve's Steam Deck, sitting between their $399 LCD and $549 OLED models in terms of cost."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8827469053125,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.430686726328125,
    "summary": "Lenovo introduced the Legion Go S, a handheld gaming PC that operates on SteamOS, at CES 2025. With a price of $499.99, it competes directly with Valve's Steam Deck, placing itself between the $399 LCD model and the $549 OLED model in terms of price."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:59:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other top officials as showing a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards the visit by the US Vice President and other senior officials, describing it as demonstrating a \"lack of respect.\""
  },
  {
    "title": "Trump and Carney hold first call amid ongoing trade war",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:25:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive,\" stating plans for a future meeting between the two leaders after Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and announced intentions for a future meeting with Canadian leaders after Canada's elections."
  },
  {
    "title": "Over 150 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:18:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, with tremors also felt in south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing tremors that were also felt in parts of south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Bangkok, Thailand, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers could be trapped in the debris."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah location in response to two rockets fired from southern Lebanon into northern Israel."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests happening in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco song \"Wiggle and Giggle All Night,\" implying potential plagiarism."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend a meeting due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped a meeting because far-right European politicians were participating."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The action is viewed as an effort to question the legitimacy of the existing government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The action is seen as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests calling for the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, demanding the resignation of Zimbabwean President Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order for his vice-president to concentrate on the operations of the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, although specific details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were confirmed dead in a recent incident. Specific details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any details regarding her son's condition after he was transferred to a prison in El Salvador by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son's health or condition following his transfer from the United States to a prison in El Salvador."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The killer's initial request for parole has been rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. In Texas, the killer's first request for parole was denied."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter for the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the case of Clare Nowland's death."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" and stated they are not connected to Moscow."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck amidst a period marked by civil war, food shortages, and a deteriorating economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has occurred during a time of ongoing civil war, food shortages, and economic decline."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescue efforts in Mandalay where individuals were reported to be digging through rubble by hand to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage. In Mandalay, people are manually searching through debris to locate survivors, initiating rescue operations."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her fearlessness in music and how artists Charli XCX and Sabrina Carpenter inspire her."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed her admiration for the fearlessness in her music career, highlighting artists Charli XCX and Sabrina Carpenter as inspirations for her bold approach."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local issues has made the government's efforts to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government faces increased difficulties in securing a second term due to a combination of international and local issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban residents increasingly spending on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care industry in India is expanding as more affluent, urban individuals are investing in products and services for their pets, particularly dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments across Africa and beyond. The selection highlights the continent's vibrant cultures, natural beauty, and significant events, capturing the essence of daily life and landmark occasions in various African countries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's standout photographs highlight Africa's diverse cultures, natural landscapes, and significant events. The collection captures daily life and landmark occasions across various African countries, showcasing the continent's vibrant essence."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the entire day playing golf with the US president if it would serve his country's interests."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated his readiness to spend a whole day playing golf with the US president if it would benefit his country, showcasing his commitment to fostering positive relations between Vietnam and the United States."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Ravens, Harbaugh reach extension through '28",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "John Harbaugh, the coach with the most wins in Ravens history, has signed a three-year contract extension, keeping him with the team until the 2028 season. This agreement comes as he was about to enter the last year of his current deal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "John Harbaugh, the most successful coach in Ravens history, has secured a three-year contract extension, ensuring his position with the team through the 2028 season. This new deal was finalized as he was approaching the final year of his existing contract."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the two-host regional format of the women's NCAA tournament, stating it has negatively impacted the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma expressed criticism towards the women's NCAA tournament's two-host regional format, arguing it has adversely affected the quality of the game."
  },
  {
    "title": "Diggs: ACL, 1,000-yard history affected Pats deal",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Stefon Diggs confirmed that his new contract with the Patriots, valued at $69 million as reported by ESPN's Adam Schefter, met his expectations. This agreement comes after Diggs suffered a torn ACL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Stefon Diggs has agreed to a new contract with the Patriots, worth $69 million, as confirmed by ESPN's Adam Schefter. This deal was reached following Diggs' recovery from a torn ACL, meeting his expectations."
  },
  {
    "title": "Okananwa leads Duke past UNC and into Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Oluchi Okananwa achieved her third double-double of the season, leading Duke to a victory over North Carolina, advancing them to the Elite Eight in the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Oluchi Okananwa secured her third double-double of the season, propelling Duke to a win against North Carolina. This victory advanced Duke to the Elite Eight in the women's NCAA tournament."
  },
  {
    "title": "Prime Deal: Sanders lands $54M Buffs extension",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deion Sanders and Colorado have entered into a five-year contract extension worth $54 million, as confirmed by a contract copy obtained by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Deion Sanders and the University of Colorado have agreed on a five-year contract extension, with a total value of $54 million, according to a contract copy obtained by ESPN."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced the dismissal of head coach Dorival Júnior after Brazil's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) has fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his position as the coach of the Memphis Grizzlies, who are currently ranked fifth in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies, who are ranked fifth in the Western Conference."
  },
  {
    "title": "Hundred hunt: Djokovic is 1 win from 100th title",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:07:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Novak Djokovic advanced to the Miami Open final, putting him one victory away from achieving his 100th career singles title. He secured his spot in the final by defeating Grigor Dimitrov."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Novak Djokovic reached the Miami Open final, moving one win away from his 100th career singles title, after beating Grigor Dimitrov."
  },
  {
    "title": "Men's Sweet 16 live tracker: Highlights, updates, more on Ole Miss-Michigan State",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:50:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The article discusses the progress of a basketball tournament, specifically focusing on which four teams will advance to the Elite Eight stage. It invites readers to follow the updates and outcomes of the games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The article provides an update on a basketball tournament, highlighting the progression of four teams to the Elite Eight stage. It encourages readers to stay informed on game results and further developments."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unexpected series of events. Since his arrival, he has fully embraced his experience at the university, with no regrets about the path that led him there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue University was unexpected, but since arriving, he has fully embraced his experience there, expressing no regrets about how he ended up at the university."
  },
  {
    "title": "Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup in the tournament began to take shape after Thursday's four games. These matches determined the first half of the teams that will compete in the next round."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight in the tournament started to form following Thursday's games, which decided the initial four teams advancing to the next round."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' Opening Day ballpark within a span of four days. This rapid conversion involved significant logistical and operational efforts to ensure the venue was ready to host the season's opening game, showcasing the flexibility and capability of the facility to accommodate major league events on short notice."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly turned into the Rays' Opening Day ballpark in just four days. This change required extensive planning and work to prepare the venue for the season's first game, demonstrating the facility's ability to host major league events with little notice."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are ongoing regarding whether there has been a shift in the style of play towards cleaner gameplay or if referees have become less inclined to call fouls. These conversations aim to understand the changes observed in officiating and player behavior."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Players, executives, and analysts are in discussions to determine if the observed changes in gameplay are due to a shift towards cleaner play or a decrease in foul calls by referees. The aim is to understand the recent developments in officiating and player behavior."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, with the team rankings and their schedules up until April 17 now published."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's details have been clarified following a panel's voting, resulting in the publication of team rankings and their schedules leading up to April 17."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance against Travis Hunter, showcasing his potential for the NFL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, demonstrating his NFL potential."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, who has faced challenges with depression, is now aiming to qualify for the 2026 Olympics. She will be competing at the World Championships on Saturday, where she hopes to secure her spot for the upcoming Olympic games, having rediscovered her passion for the sport."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, previously struggling with depression, is targeting qualification for the 2026 Olympics. She competes at the World Championships on Saturday, aiming to earn her Olympic spot after reigniting her love for the sport."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, Fulham's left back, has had a standout season, establishing himself as one of the top players globally in his position. He is aspiring to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, the left back for Fulham, has had an impressive season, gaining recognition as one of the leading players in his position worldwide. He aims to reach major achievements with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:58:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The UFL season begins on Friday night, with all teams aiming to compete against Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The UFL season is set to start on Friday night, featuring all teams vying to challenge Birmingham's top spot in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A year ago, Helen Hu, a former gymnast, was working at a hostel in Ecuador. Recently, she achieved a significant milestone by winning the SEC beam title in gymnastics."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, once a gymnast and previously employed at a hostel in Ecuador, has recently won the SEC beam title in gymnastics, marking a significant achievement in her athletic career."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:16:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Real Betis midfielder and United States international Johnny Cardoso has expressed that the speculation surrounding his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Johnny Cardoso, a midfielder for Real Betis and the United States national team, stated that rumors of a possible move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources reported by ESPN. This decision comes despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 18:16:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian Soccer Federation due to a significant knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation following a serious knee injury to Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça: 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:41:12 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm about competing against Barcelona in the upcoming UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and showed excitement for facing Barcelona in the UEFA Women's Champions League semifinals."
  }
]