[
  {
    "title": "Landslide in Sudan's Darfur Kills 1,000; Sole Survivor Found",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 07:28:05 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "BBC",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The landslide on Sunday happened after heavy rain and \"levelled\" a remote mountainous village, the group says.",
      "A landslide triggered by heavy rain destroyed an entire village in Sudan’s Darfur, killing more than 1,000 people.",
      "Sudan Liberation Movement/Army appeals for UN help to recover bodies from village buried by landslide after heavy rain.",
      "The landslide wiped out an entire village in the Marra Mountains, according to the Sudan Liberation Movement/Army. Only one person is said to have survived.",
      "<p>Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor</p><p>More than 1,000 people were killed in a landslide in western Sudan on Sunday, according to a rebel group that controls the area.</p><p>The landslide, which followed heavy rain, destroyed a ",
      "The landslide leveled a village in the remote Marra mountains, the Sudan Liberation Movement/Army said. It asked international aid organizations for help in recovering bodies."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f6a2/live/f5e16510-879d-11f0-a54b-b1b405e766a4.jpg",
    "titles": [
      "At least 1,000 killed in Sudan landslide, armed group says",
      "Sudan landslide ‘kills more than 1,000’",
      "Landslide kills more than 1,000 in Sudan’s Darfur region, armed group says",
      "Sudan landslide kills over 1,000 people, says rebel group",
      "Sudan landslide kills at least 1,000 people, rebel group says",
      "Landslide Kills More Than 1,000 People in Sudan, Rebel Group Says"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.965,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A landslide in Sudan's Darfur region, caused by heavy rain, destroyed a village in the Marra Mountains, leaving over 1,000 people dead with only one survivor. The Sudan Liberation Movement/Army, which controls the area, has called for international assistance to recover bodies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Osaka Defeats Gauff to Reach First Grand Slam Quarterfinal Since 2021",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 23:09:27 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Forbes",
      "Sportsnet",
      "CBS Sports",
      "Al Jazeera",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.forbes.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Two-time US Open champion Naomi Osaka earns her most impressive win since returning to the tour by knocking out third seed Coco Gauff.",
      "Two-time US Open tennis champion Osaka upset Gauff in straight sets, while Iga Swiatek beat Ekaterina Alexandrova.",
      "Osaka jumped on Gauff early and held strong from there on out",
      "<ul><li><p>Four-times grand-slam champion wins 6-3, 6-2</p></li><li><p>Osaka has always won title after reaching last eight</p></li></ul><p>Naomi Osaka turned back the clock on Monday in New York, producing the cleanest big‑stage performance of her comeback from maternity leave to overwhelm Coco Gau",
      "In a battle of former U.S. Open champions, Naomi Osaka knocked out Coco Gauff 6-3, 6-2 on Monday to reach her first Grand Slam quarterfinal in four years.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQOUltZFdyd2pmZHpKLXlvV3hmYl9WMFhPT2laclEyVjNoUmR6Z1NTek9MQ3VJa1ZSRDBvUG4xd0RCczFOaFNjOTNRQ3FtWWRRZjBjOWRSUVNyeGxuR1ZIUUhLZEVWZnZJMkstbEFvMGZYOTctYjJfOUhEbThUNW90cUVRLW9WeGhSYm1PV3R3alpsMmxG?oc=5\" target=\"_blank\">Naomi Osaka Upsets Coco Gau",
      "<p>Naomi Osaka eliminated Coco Gauff 6-3, 6-2 at the U.S. Open with a far more confident and consistent brand of tennis Monday to reach her first Grand Slam quarterfinal in more than 4 1/2 years.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/40d2/live/65469e70-876c-11f0-a4c8-d381adcec3ce.jpg",
    "titles": [
      "'The moments I play tennis for' - Osaka beats Gauff at US Open",
      "Naomi Osaka defeats Coco Gauff to reach US Open quarterfinals",
      "Naomi Osaka defeats Coco Gauff at US Open, advancing to first slam quarterfinal since 2021 Australian Open",
      "Naomi Osaka dominates Coco Gauff to power into US Open quarter-finals",
      "U.S. Open 2025: Naomi Osaka Knocks Out Coco Gauff To Reach Quarters",
      "Naomi Osaka Upsets Coco Gauff in Highly-Anticipated U.S. Open Rematch - Sports Illustrated",
      "Osaka eliminates Gauff to reach US Open quarterfinals"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.812,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Naomi Osaka defeated Coco Gauff 6-3, 6-2 at the US Open, reaching her first Grand Slam quarterfinal since 2021. This victory marks Osaka's most significant win since her return to the tour, showcasing a dominant performance against the third seed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nestlé Fires CEO Freixe Over Conduct, Names Navratil New Chief",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 22:00:17 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "The Guardian",
      "BBC",
      "Washington Post",
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.forbes.com",
      "news.google.com",
      "www.washingtonpost.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The food giant says Laurent Freixe had an \"undisclosed\" relationship with \"a direct subordinate\".",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZjZYNnVqb25tcGUzeTZkeHN3REFlckdRVUhNUW9uQldPUWo0Nms2cGJ0TmdXdmtxWFk2NThQSGZxSmRLaWtKcnpmQUozdS1tR2tJUmZTUUJOYlR5MnM1clZNc2lRQVVHYkd2ZUhITExLV0VvN2N5T1JfOWhLRjBuN0ZQZ2dRQ203MDRB?oc=5\" target=\"_blank\">Nestlé fires CEO Laurent Freixe over \"r",
      "<p>Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement</p><p>Nestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached i",
      "The Swiss food giant said Laurent Freixe’s dismissal was effective immediately and named longtime executive Philipp Navratil as its new CEO.",
      "Philipp Navratil, chief executive of Nestlé Nespresso, was named Freixe’s successor, effective immediately.",
      "Nestlé says it has dismissed its CEO Laurent Freixe after he failed to disclose a romantic relationship with a direct subordinate."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4271/live/bebf9420-875d-11f0-ac15-0be71ebd833b.png",
    "titles": [
      "Nestle fires boss after romantic relationship with employee",
      "Nestlé fires CEO Laurent Freixe over \"romantic relationship\" with employee - Axios",
      "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "Nestlé removes CEO after investigation into relationship with subordinate",
      "Nestlé Ousts CEO Laurent Freixe After ‘Undisclosed Romantic Relationship’ With Subordinate",
      "Nestlé says it dismissed CEO Laurent Freixe over an undisclosed romantic relationship with his direct subordinate"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.793,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nestlé dismissed CEO Laurent Freixe for failing to disclose a romantic relationship with a direct subordinate, breaching the company's code of conduct. Philipp Navratil, previously of Nestlé Nespresso, was appointed as the new CEO, marking the company's third chief executive change in just over a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oscar-Nominee Graham Greene Passes Away at 73",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 03:11:54 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Forbes",
      "CityNews"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The legendary Canadian actor was also known for his roles in The Green Mile and Maverick.",
      "<p>The trailblazing Canadian First Nations actor, who was nominated for an Academy Award, died in Toronto after a long illness</p><p>Graham Greene, the prolific Oscar-nominated Canadian First Nations actor and Hollywood trailblazer, has died aged 73 in a Toronto hospital after a long illness.</p><p>",
      "Graham Greene, best known for his role as Kicking Bird in Kevin Costner’s 1990 film \"Dances with Wolves,\" died September 1. He was 73.",
      "TORONTO — Oscar-nominated Canadian actor Graham Greene, who broke through with memorable roles across several genres at a time when the entertainment industry shunned Indigenous talent, has died at age 73. Greene’s management team said he died on Monday in Stratford, Ont., after a long illness. The "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fded/live/8ff49d30-87a2-11f0-ab9b-159340cdd16b.jpg",
    "titles": [
      "Dances With Wolves star Graham Greene dies aged 73",
      "Graham Greene, Dances with Wolves actor, dies aged 73",
      "Graham Greene, Oscar Nominated Actor ‘In Dances With Wolves,’ Dies At 73",
      "Canadian actor Graham Greene, known for role in “Dances With Wolves,’ dies at 73"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.883,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Graham Greene, the Oscar-nominated Canadian First Nations actor known for his roles in \"Dances with Wolves,\" \"The Green Mile,\" and \"Maverick,\" has died at age 73 in Toronto after a long illness. Greene, celebrated for breaking barriers for Indigenous actors in Hollywood, passed away on September 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Pledges $280M in Aid to SCO Members at Tianjin Summit",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 04:57:10 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "Chinese President Xi Jinping is hosting a high-profile summit with leaders from Russia, North Korea and India gathering among others in a challenge to U.S. influence.",
      "Chinese President Xi Jinping outlines plans for new development bank and financing options for SCO members.",
      "A viral photo of Modi, Xi and Putin at the SCO summit highlights shifting power, unresolved tensions and the limits of global alliances.",
      "Their display of friendship in China was aimed at projecting an alternative to U.S. global leadership, even as serious differences among them remain.",
      "It is unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, though Beijing has sought to cast itself as a global peacemaker."
    ],
    "image_url": "",
    "titles": [
      "China's Xi hosts Putin and Modi at Shanghai Cooperation Organization summit",
      "China, Russia pledge new global order at Shanghai Cooperation summit",
      "Behind the smiles with Putin, Modi and Xi at China summit",
      "Xi, Putin and Modi Try to Signal Unity at China Summit",
      "China's Xi urges AI cooperation, rejects ‘Cold War mentality’ at SCO summit"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.617,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a summit in Tianjin, the Chinese leader pledged $280 million in aid to members of the Shanghai Cooperation Organisation (SCO). The contribution aims to support the SCO, but it remains uncertain if this will lead to significant breakthroughs in reducing tensions among member states. Beijing is positioning itself as a global peacemaker through this gesture.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League Transfer Window Closes with Record Activity, Controversies",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 03:35:47 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "This summer transfer window broke more records, with last season's Premier League champions doing an astonishing amount of business to remain ahead of the pack. Here are our winners and losers.",
      "Manchester United made the worst move of the transfer window, which isn't great news considering the struggles",
      "Man City keeper James Trafford found a roadblock to his fairytale story and Erik ten Hag wass brutally dismissed on a dramatic day with something for everybody",
      "BBC Scotland's Nick McPheat assesses the mood across the Scottish Premiership's teams after a hectic transfer deadline day."
    ],
    "image_url": "",
    "titles": [
      "Who won and lost the transfer window? Assessing Liverpool, Arsenal, Man United, more",
      "Transfer window superlatives: Alexander Isak to Liverpool best deadline day deal; Man United make worst move",
      "Transfer deadline day winners and losers: Alexander Isak and Marc Guehi, a tale of two Liverpool targets",
      "Who won the Scottish Premiership transfer window?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This summer's transfer window saw record-breaking activity, with the Premier League champions significantly bolstering their squad to stay competitive. Manchester United faced criticism for what was deemed the worst move of the window, amidst broader struggles. Manchester City's James Trafford encountered significant challenges, and Erik ten Hag was notably dismissed, adding drama to the proceedings. Additionally, BBC Scotland's Nick McPheat provided insights into the Scottish Premiership teams' sentiments following a bustling transfer deadline day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Padres' Jason Adam Injured, Carted Off Field in Game vs Orioles",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 00:37:11 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "All-Star reliever Jason Adam was carted off the field after getting injured in the seventh inning of the Padres' loss to the Orioles on Monday.",
      "San Diego loses a key high-leverage reliever with the playoffs approaching",
      "<p>All-Star reliever Jason Adam of the San Diego Padres was carted off the field after getting injured in the seventh inning Monday against the Baltimore Orioles.</p>"
    ],
    "image_url": "",
    "titles": [
      "Pads reliever Adam suffers ruptured quad tendon",
      "Jason Adam injury: Padres All-Star RP suffers ruptured quad in loss to Orioles, reveals recovery timeline",
      "Padres reliever Jason Adam carted off field with ruptured quadriceps tendon"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "All-Star reliever Jason Adam of the San Diego Padres was carted off the field due to an injury during the seventh inning of Monday's game against the Baltimore Orioles. This injury poses a significant loss for San Diego as they approach the playoffs, losing a key high-leverage reliever.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Najee Harris Cleared for Contact After Eye Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 00:37:11 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chargers running back Najee Harris has been cleared for contact after an eye injury.",
      "Harris, who was injured in a July 4 fireworks incident, told reporters he expects to play Friday",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPVUw2RWdNSUlqaXl4d2JVZGtoU25ERXFScDdIVzNsV1g4ZDZpLS1hcGRQNXZjS3g0MUxGNDlIb3NmQ0g1ekpsa0t6QlZVeUZ3emhSbTlfSWhLc0lOMTc5UlptUE0xd2FfNzhabG9sTUdZc3B3dVdBckxfclJsNnJVV1lpaTA3RGlDeHEydlBVMGg2bDNXUVpvUw?oc=5\" target=\"_blank\">Chargers RB Najee Har"
    ],
    "image_url": "",
    "titles": [
      "Bolts' Harris cleared for contact, expects to play",
      "Najee Harris injury update: Chargers RB cleared for contact, hopes to play Week 1 vs. Chiefs after hurting eye",
      "Chargers RB Najee Harris Says He’s ‘Ramping Up’ to Play in Season Opener vs. Chiefs - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chargers running back Najee Harris has been cleared for contact after an eye injury from a July 4 fireworks incident. Harris expects to play on Friday, indicating positive progress in his recovery and readiness for upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Earthquake Kills 900, Injures 2,500; Aid Sought",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 06:02:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Rescuers try to reach isolated villages in eastern Kunar province after a 6.0 quake kills 800 people and wounds 2,800.",
      "<p>Rescuers search into the night for people trapped under debris of mud and stone homes in steep valleys</p><p>The Taliban have called for international aid as Afghanistan reels from an earthquake that killed more than 900 people and left thousands injured.</p><p>Rescuers searched into the night on",
      "The quake, near the border with Pakistan, injured more than 2,500 people in mountainous areas that rescue workers took hours to reach.",
      "Hundreds of people were killed and more than 2,500 were injured, according to the Taliban government, and the death toll was expected to rise.",
      "Rescue workers struggled to reach isolated areas in eastern Afghanistan after a magnitude 6.0 quake."
    ],
    "image_url": "",
    "titles": [
      "Afghanistan earthquake live: Search for survivors on after 900 killed",
      "Afghanistan earthquake: Taliban appeal for aid as death toll rises to 900",
      "Afghanistan Earthquake Leaves More Than 800 Dead",
      "What to Know About the Earthquake in Afghanistan",
      "An Earthquake Killed Hundreds in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.957,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Kunar province, Afghanistan, killing over 900 people and injuring more than 2,500. Rescue efforts continue in isolated, mountainous areas, with rescuers working through the night. The Taliban government has requested international aid to cope with the disaster's aftermath.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belgium to Recognize Palestine, Impose Sanctions on Israel Amid Gaza Airstrikes",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 01:40:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "FM Maxime Prevot says his country will recognise Palestine this month and impose 12 &#039;firm sanctions&#039; on Israel.",
      "Belgian Foreign Minister Maxime Prevot​​ said the move is to pressure the Israeli government to respect international law. This comes as new Israeli airstrikes were reported in Gaza. DW has the latest.",
      "<p>Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’</p><p><strong>The Palestinian foreign ministry</strong> has said it <a href=\"https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-pale"
    ],
    "image_url": "",
    "titles": [
      "Belgium to recognise Palestinian statehood, impose sanctions on Israel",
      "Middle East updates: Belgium to recognize Palestinian state",
      "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.874,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Belgian Foreign Minister Maxime Prevot announced Belgium will recognize Palestine and impose 12 sanctions on Israel to pressure its government to respect international law. This decision follows recent Israeli airstrikes in Gaza. The move is targeted not at the Israeli people but at ensuring their government adheres to international and humanitarian law.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Massive Earthquake Hits Afghanistan, Death Toll Rises",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 06:58:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The provincial head of disaster management, Ehsanullah Ehsan, says they cannot &#039;predict&#039; the number of bodies trapped.",
      "As the death toll climbs, rescue workers are trying to reach survivors in the isolated regions of Afghanistan that were ravaged by a massive earthquake.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9kVlVEc0dfY0NQWHFmdjE2TEc5cTRDdzViUGlMYnNuVk54Wm5Fd3huaHZJQmhxVUdPSmstampCazFBc1hTTmdCM0ZEaEZLVFhpRDUzenJjVHdpUzdmaHVpT0NJUzJ2YkNzRlE3TEZWQQ?oc=5\" target=\"_blank\">Photos: Search for survivors after deadly quake devastates Afghanistan</a>&nb"
    ],
    "image_url": "",
    "titles": [
      "Rescuers focus on remote mountainous regions after Afghanistan earthquake",
      "Afghanistan earthquake: Search on for survivors in remote areas",
      "Photos: Search for survivors after deadly quake devastates Afghanistan - Axios"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.976,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A massive earthquake has devastated isolated regions in Afghanistan, leading to an increasing death toll. Ehsanullah Ehsan, the provincial head of disaster management, stated that the number of bodies trapped cannot be predicted. Rescue workers are currently trying to reach survivors amidst the destruction.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Protests Demand Economic Justice, Criticize Trump Policies",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 20:55:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Tens of thousands gather under &#039;Workers Over Billionaires&#039;, pushing for livable wages and economic justice.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOWVhYaEdrR1ZoX21LLVVzNWZVaW9uMjFVRmx2TXQtY20wSHJxM0NXbU4xS2hPanVobDBxWjh3eGxERU1hYkkzYXJVbWVsNk9rM2U0RmVNM2VES0NWbTNDalNPelBfMmVSZm0wRW1pMUVqODFqRHp3TjA2dWFIdFZEbUxCWHJULU1sV21fTWFJRlI5OWFf?oc=5\" target=\"_blank\">Photos: Labor Day \"Workers ",
      "<p>Protests denounce Trump administration’s policies and call for the protection of social safety nets</p><p>As Labor Day rallies took place across the US, the Chicago mayor Brandon Johnson sharply denounced the Trump administration’s threat to deploy federal troops to the city as part of an immigra"
    ],
    "image_url": "",
    "titles": [
      "Over 1,000 Labor Day rallies held across US to protest Trump",
      "Photos: Labor Day \"Workers Over Billionaires\" protests held across U.S. - Axios",
      "Hundreds of ‘Workers Over Billionaires’ Labor Day rallies take place across US"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.791,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tens of thousands rallied across the US under the banner 'Workers Over Billionaires,' advocating for livable wages and economic justice. These protests also criticized the Trump administration's policies, particularly opposing the threat to send federal troops to Chicago, as stated by Mayor Brandon Johnson during Labor Day rallies. The gatherings called for the protection of social safety nets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Stampeders Triumph Over Edmonton Elks 28-7 in Labour Day Classic",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 02 Sep 2025 05:16:20 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Calgary Stampeders continued their impressive comeback season Monday with a 28-7 victory over the Edmonton Elks in the Labour Day Classic. Quarterback Vernon Adams Jr. threw a touchdown pass to Dominque Rhymes. Tailback Dedrick Mills quietly rushed for 106 yards on 17 carries. The diminutive Eri",
      "<p>The Calgary Stampeders continued their impressive comeback season Monday with a 28-7 victory over the Edmonton Elks in the Labour Day Classic.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/Elks-Stamps-Sept-1.jpg?quality=65&strip=all",
    "titles": [
      "Red-hot Stampeders show no mercy on defence in dominating Elks 28-7",
      "Stampeders stay red hot as defence steps up in dominating win over Elks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.693,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Calgary Stampeders secured a 28-7 win against the Edmonton Elks in the Labour Day Classic, highlighting their season's comeback. Quarterback Vernon Adams Jr. contributed with a touchdown pass to Dominque Rhymes, while tailback Dedrick Mills rushed for 106 yards on 17 carries, showcasing the team's strong offensive performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Deportation of Guatemalan Children by U.S. Government",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 11:02:29 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQTjhWc3lTc0cwU09qZDl0WWxENWFtbXlwdUwxVEZWeWk3dW5CemVJTjhfQXRjNllNeFBGb1lrTlhIM3VCbU9rbkNaNXVTeEZwYXlyTTJYWFlESUY2WVE1SndXVGpiZTdQeEpHVldKdHQyLVBmUGFhVGs5cTkybkh2Wjd6czdBYlBSZHc0RjUtbkk?oc=5\" target=\"_blank\">Judge halts deportation of hundr",
      "A federal judge rushed an emergency hearing after learning that the Trump administration was moving to deport children to Guatemala despite an order she had issued earlier Sunday.",
      "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
    ],
    "image_url": "",
    "titles": [
      "Judge halts deportation of hundreds of Guatemalan children - Axios",
      "Judge orders administration to halt deportation of hundreds of Guatemalan children",
      "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.631,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge issued a temporary restraining order, halting the U.S. government's attempt to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings. This decision, made by District Judge Sparkle Sooknanan, comes after a legal complaint on behalf of 10 children, temporarily preventing these deportations for at least 14 days as the legal process continues. This move interrupts the Trump administration's broader immigration crackdown efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 NFL Fantasy Insights: Breakouts, Busts, and Draft Strategy Revealed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 00:37:11 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Why wait to win? Use the Trade Chart to make post-draft deals and improve your team.",
      "SportsLine's 2025 Fantasy football draft guide includes Fantasy football auction values, keeper advice, top rookies, mock drafts and more",
      "SportsLine simulated the new NFL season 10,000 times and revealed its 2025 Fantasy football QB, RB, WR and picks and rankings",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football sleepers for 2025 Fantasy football draft prep",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football breakouts for 2025 Fantasy football draft prep",
      "SportsLine simulated the new NFL season 10,000 times and identified Fantasy football busts 2025 to fade during your Fantasy football draft prep",
      "Jamey Eisenberg guides Fantasy managers through the final TE ADP and early waiver wire adds"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football PPR rankings for Week 1",
      "Fantasy Football 2025: Week 1 Trade Chart and rest of season rankings help you win now before the games begin",
      "2025 Fantasy football draft prep: Elite NFL experts unveil rankings, strategy, rookie advice, top 150 picks",
      "Fantasy football 2025 rankings, draft prep: Best QB, RB, WR and TE picks, NFL cheat sheets, ADP, tiers",
      "Fantasy football rankings 2025: Sleepers, top picks from NFL model that called James Cook's huge year",
      "Fantasy football rankings 2025: Breakouts, top picks from model that called Jayden Daniels' big season",
      "Fantasy football rankings 2025: Busts from model that was all over Raheem Mostert's challenging season",
      "Fantasy Football final TE ADP: Draft sleepers and waiver wire tight end targets for Week 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine conducted 10,000 simulations of the new NFL season, providing insights for 2025 Fantasy football including breakouts, busts, and overall draft strategy. Additionally, weekly rankings for both PPR and IDP formats, along with Eric Karabell's superflex ranks, are available to assist with draft preparation and season planning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paul Merson Praises Jackson's Move to Bayern from Chelsea",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 07:18:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "Football pundit Paul Merson has shared his verdict on Nicolas Jackson's deadline day move to Bayern Munich.",
      "Bayern Munich has finally found the much-needed depth piece in the attack. The Bundesliga giants announced the signing of Senegalese forward Nicolas Jackson from Chelsea."
    ],
    "image_url": "",
    "titles": [
      "Paul Merson shares his verdict on Nicolas Jackson's move to Bayern Munich",
      "Nicolas Jackson Completes Dramatic Deadline Day Move To Bayern Munich"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Football pundit Paul Merson commented on Nicolas Jackson's move to Bayern Munich from Chelsea, highlighting it as a significant addition for Bayern. The Bundesliga club announced the signing of the Senegalese forward, aiming to bolster their attacking options.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ederson Leaves Manchester City for Fenerbahce After Trophy-Laden 8 Years",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 07:17:22 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "sports.yahoo.com",
      "onefootball.com"
    ],
    "snippets": [
      "Brazil goalkeeper Ederson makes a permanent move from Manchester City to Fenerbahce.",
      "Long-serving Manchester City goalkeeper Ederson has completed a move to Fenerbahce in Turkey, the Premier League club said Tuesday, ahead of the anticipated arrival of Italian international Gianluigi Donnarumma.Donnarumma's imminent arrival allowed Brazilian international Ederson to make the switch ",
      "Ederson has completed a permanent transfer to Turkish side Fenerbahce pending international clearance, Manchester City have confirmed.The 31-year-old has been the fulcrum of City’s success under Pep...",
      "Brazil goalkeeper Ederson Moraes has left Manchester City after eight years to join Turkish club Fenerbahce and is set to be replaced in the squad by Gianluigi Donnarumma.  Ederson won 18 trophies at City after joining from Benfica in 2017, and helped to revolutionize the goalkeeper position with hi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/260c/live/1dde9880-87d0-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Ederson leaves Man City to join Fenerbahce",
      "Ederson leaves City for Fenerbahce as Donnarumma waits in wings",
      "Manchester City confirm €14M Ederson departure to Fenerbahce",
      "Goalkeeper Ederson leaves City after 8 years to join Fenerbahce and could be replaced by Donnarumma"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Brazilian goalkeeper Ederson has transferred from Manchester City to Fenerbahce on a permanent basis, as confirmed by Manchester City. The move comes after Ederson's successful eight-year stint at City, where he won 18 trophies and was pivotal in evolving the goalkeeper role. His transfer is aligned with the expected signing of Gianluigi Donnarumma by Manchester City. The transfer awaits international clearance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Powerball Jackpot Hits $1.3 Billion, Largest Since April 2024",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 05:51:34 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9KbzdZU3A5Q0FtbTZlOVN6alg5OUtlQUpFZVB5ZWVSTHdORjYtWERaZVJkWF9qc2NzdWFnUkhkeWJmR0g4dGtvbGNQOHZrcFUtYlBDM0hxLVhkUThSS0d2RWt5SEg2QW5fWkFJdXB2U2hrWVlsSm1QakJVUnhMZw?oc=5\" target=\"_blank\">Powerball climbs to $1.3 billion after no winner in Labor",
      "The $1.3 billion Powerball jackpot has now risen to become the biggest lottery prize since April 2024."
    ],
    "image_url": "",
    "titles": [
      "Powerball climbs to $1.3 billion after no winner in Labor Day drawing - Axios",
      "Powerball Jackpot Hits $1.3 Billion After Labor Day Drawing—Here’s What The Winner Could Take Home"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Powerball jackpot has reached $1.3 billion, making it the largest lottery prize since April 2024. There was no winner in the recent draw, leading to the significant increase in the jackpot amount.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Commission Plane Lands with Maps Amid Suspected Russian GPS Jamming",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 14:28:05 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Fortune"
    ],
    "domains": [
      "www.nytimes.com",
      "fortune.com"
    ],
    "snippets": [
      "The Bulgarian authorities believe that Russia disrupted navigation signals that would have been used by a plane carrying Ursula von der Leyen, European officials said.",
      "The plane landed safely and Ursula von der Leyen will continue her planned tour of the European Union’s nations bordering Russia and Belarus, a spokesperson said."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/01/multimedia/01int-EU-plane-01-jwvb/01int-EU-plane-01-jwvb-mediumSquareAt3X.jpg",
    "titles": [
      "Russia Suspected of Jamming GPS for E.U. Leader’s Plane, Officials Say",
      "Russia suspected of jamming navigation on European Commission president’s plane, official says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.692,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The European Commission reported that a plane carrying President Ursula von der Leyen to Bulgaria experienced navigation disruption due to suspected GPS jamming on Sunday. The EU and Bulgarian authorities suspect Russia was behind the interference, which forced the aircraft to land using paper maps. The situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Sales Offer Big Discounts on TVs, School Supplies Ahead of Sports Seas",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-01T16:47:17-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Labor Day weekend marks the unofficial end of summer, which is a bit sad, but it’s a great time to get a deal on a fancy, new TV. The US holiday is happening just before the start of the 2025-2026 NFL season, the World Cup qualifiers, and the lead-up to the MLB post-season games. This [&#8230;]",
      "Labor Day has finally arrived, and after a week of early discounts trickling in, the sales are now in full swing. We’ve put together an expansive guide detailing nearly 100 deals we think are worth the money — including everything from big-screen OLED TVs to back-to-school essentials like the latest",
      "Labor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment for some, at least there is always a great selection of deals to combat the post-summer blues. Lucky for you, we’ve gone ahead and rounded up the best discounts you can g"
    ],
    "image_url": "",
    "titles": [
      "The best Labor Day TV sales",
      "The 28 best Labor Day deals you still can grab for $100 or less",
      "The 95 best Labor Day sales happening now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.789,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.426,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Labor Day weekend, marking the unofficial end of summer, brings a wave of sales on a wide range of products, including big-screen OLED TVs and back-to-school essentials. Coinciding with the lead-up to major sports events, such as the 2025-2026 NFL season, World Cup qualifiers, and MLB post-season games, the holiday offers extensive discounts. Comprehensive guides have been compiled to help shoppers navigate nearly 100 deals considered worth the investment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]