[
  {
    "title": "Crawford Defeats Alvarez, Makes History with 3 Division Titles in Vegas",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 14 Sep 2025 05:55:03 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "ESPN",
      "BBC",
      "The Guardian",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.mmamania.com",
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Terence Crawford stunned Saul 'Canelo' Alvarez on points in Las Vegas, becoming the first male fighter in the modern era to hold undisputed titles in three weight divisions.",
      "Terence Crawford defeated Canelo Alvarez for the undisputed super middleweight championship.",
      "Canelo Alvarez and Terence Crawford finally faced off last night (Sat., Sept. 13, 2025) inside a packed Allegiant Stadium in Las Vegas, Nevada in one of the most anticipated fights of the history of boxing, as Alvarez was out to prove he still had plenty to offer the fight game, while Crawford was o",
      "Terence Crawford stunned Saul 'Canelo' Alvarez on points in Las Vegas, becoming the first male fighter in the modern era to hold undisputed titles in three weight divisions.",
      "<ul><li><p>Crawford wins unanimous decision in Las Vegas</p></li><li><p>Official judges score it 116-112, 115-113, 115-113</p></li><li><p><a href=\"https://www.theguardian.com/sport/live/2025/sep/13/canelo-alvarez-v-terence-crawford-undisputed-super-middleweight-championship-live-buildup\">Round-by-ro",
      "Terence Crawford produced a masterclass performance against Canelo Alvarez to become the undisputed super-middleweight champion and make history in the process.",
      "<p>Terence Crawford became the first male boxer to capture three unified division titles when he defeated Canelo Alvarez by unanimous decision on Saturday night to win the super middleweight championship before an announced record crowd of 70,482.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6e4a/live/84cda810-9135-11f0-bcd1-793ab4f2094f.jpg",
    "titles": [
      "History-maker Crawford stuns Canelo in Vegas",
      "Round-by-round: Crawford tops Canelo, makes boxing history",
      "And New! Terence Crawford makes history, upsets Canelo Alvarez to become three-time undisputed champion | Highlights",
      "History-maker Crawford stuns Canelo in Vegas",
      "Terence Crawford stuns Canelo Álvarez to become undisputed super middleweight champion",
      "Crawford stuns Canelo to create history in Vegas",
      "Terence Crawford makes history with victory over Canelo Alvarez"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.935,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.832,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Terence Crawford defeated Saul 'Canelo' Alvarez by unanimous decision (116-112, 115-113, 115-113) in Las Vegas on September 13, 2025, becoming the first male fighter in the modern era to hold undisputed titles in three weight divisions. The fight took place at Allegiant Stadium before a record crowd of 70,482, where Crawford won the super middleweight championship.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Noche UFC 2025: Lopes vs. Silva Headline Mexico's Independence Celebration",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 14 Sep 2025 01:17:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.mmamania.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Lopes might have notched a KO and Fight of the Year contender against Silva",
      "Last night (Sat., Sept. 13, 2025), Ultimate Fighting Championship (UFC) ventured forth to Frost Bank Center in San Antonio, Texas. The card itself was better than the average “Fight Night” affair, but we have to admit that the 2025 Noche offering didn’t exactly live up to past years. Once the card c",
      "Niche UFC 2025 Results: Everything to know about tonight's Diego Lopes vs. Jean Silva fight card - full fight card results, bonuses, scorecards, and more.",
      "<p>The third annual Noche UFC event, meant to commemorate Mexico’s independence, features a pair of popular Brazilian featherweights in an anticipated main event Saturday in San Antonio.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/14/80c3edd5-7eaf-4a94-bdee-ad66567373d3/diego-lopes-silva-action.jpg",
    "titles": [
      "Noche UFC results, highlights: Diego Lopes knocks out Jean Silva with spinning elbow that causes massive gash",
      "Noche UFC 3 results: Sooo … About last night | Lopes vs. Silva",
      "Noche UFC 2025 Results: Diego Lopes Vs. Jean Silva Fight Card",
      "UFC Fight Night: Lopes vs. Silva official results"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.867,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.763,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The third annual Noche UFC event, celebrating Mexico's independence, features Diego Lopes vs. Jean Silva in the main event on September 13, 2025, in San Antonio. Silva aims for his sixth consecutive win in this featherweight bout. The event, including the Lopes vs. Silva fight, is broadcast live on ESPN+ and Sportsnet channels starting at 7 p.m. ET.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FAA Seeks $3.1M in Fines from Boeing for Safety Violations",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 13:45:16 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "CityNews",
      "Financial Post",
      "NPR"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "The FAA said it identified hundreds of quality system violations at Boeing's 737 factory in Renton, Wash., and Boeing subcontractor Spirit AeroSystems' 737 factory in Wichita, Kan.",
      "The FAA is seeking $3.1 million in fines from Boeing over safety violations, including ones related to a jetliner losing a door plug panel on its fuselage midflight.",
      "The Federal Aviation Administration is seeking $3.1 million in fines from Boeing over safety violations, including ones related to an Alaska Airlines jetliner losing a door plug panel on its fuselage in midflight. The proposed penalty is for safety violations that occurred from September 2023 throug",
      "The Federal Aviation Administration is seeking $3.1 million in fines from Boeing over safety violations, including ones related to an Alaska Airlines jetliner losing a door plug panel on its fuselage in midflight. The proposed penalty is for safety violations that occurred from September 2023 throug"
    ],
    "image_url": "",
    "titles": [
      "FAA seeks to fine Boeing $3.1 million for safety violations, door plug blowout",
      "FAA seeks $3.1 million in fines from Boeing over safety violations, 2024 midair panel blowout",
      "FAA seeks $3.1 million in fines from Boeing over safety violations, 2024 midair panel blowout",
      "FAA seeks $3.1 million in fines from Boeing over safety violations, 2024 midair panel blowout"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.741,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FAA has identified numerous quality system violations at Boeing's 737 factory in Renton, Washington, and at subcontractor Spirit AeroSystems' factory in Wichita, Kansas. As a result, the FAA is seeking $3.1 million in fines from Boeing for safety violations, including an incident where an Alaska Airlines jetliner lost a door plug panel midflight. These violations occurred from September 2023.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Plans Major Sanctions on Russia, Tariffs on China to End Ukraine War",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 10:05:36 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "Trump tells NATO members they need to cut off Russia energy purchases before he will take bigger steps to isolate Russia over its war in Ukraine.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1DTmpwX3h6SnRxN3BEMGNNWm9ZcU5ucVJzZ1MtUHZ4bzJLV3dDMFhQTkh0emdSeV9zV1hRdlBrelFkTE81Q2ZpMXZOWTNFaFJQYXYtY21lM3BKaldER1RtOXNpdHN3ay11aTVzYjA0TEF6bkd2QmVUbmRxdjBOSVE?oc=5\" target=\"_blank\">Trump ties new Russia sanctions to NATO tariffs on China",
      "President Donald Trump has repeatedly threatened to impose sanctions on Russia over its invasion of Ukraine, but has so far held off from doing so."
    ],
    "image_url": "",
    "titles": [
      "Trump tells NATO members they must move first on Russia sanctions over Ukraine",
      "Trump ties new Russia sanctions to NATO tariffs on China - Axios",
      "Trump says he's ready to put 'major sanctions' on Russia if NATO nations do the same"
    ],
    "score_components": {
      "magnitude": 0.927,
      "recency": 0.686,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump has stated he will impose major sanctions on Russia, aiming to isolate the country over its war in Ukraine, on the condition that all NATO allies cease purchasing Russian oil. He suggested that NATO's efforts in the conflict are insufficient and also proposed imposing tariffs of 50% to 100% on China for its purchases of Russian oil, believing these actions would help end the Russia-Ukraine war.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rubio Visits Israel Amid Tensions After Strike on Hamas Leaders in Qatar",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Sep 2025 05:11:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US secretary of state says Trump was &#039;not happy&#039; about the attack, but the incident will not change ties with Israel.",
      "<p>US secretary of state says Trump ‘not happy’ about Israel’s attack on Hamas leaders in Qatar, its first such strike against US ally</p><p>US secretary of state Marco Rubio headed to Israel on Sunday amid tensions with US allies in the Middle East over Israel’s strike on Hamas leaders in Qatar and",
      "The diplomat will consult with Israeli officials about their coming military offensive in Gaza City, as President Trump’s efforts to end the Gaza war appear stalled."
    ],
    "image_url": "",
    "titles": [
      "Rubio lands in Israel to discuss war on Gaza after Israeli strike on Qatar",
      "Rubio heads to Israel amid tensions over strike on Hamas leaders in Qatar",
      "Rubio Heads to a Defiant Israel After Qatar Strike"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.94,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US Secretary of State Marco Rubio visited Israel to discuss tensions following Israel's strike on Hamas leaders in Qatar, marking its first attack against a US ally. Despite President Trump's dissatisfaction with the incident, it is not expected to alter US-Israel relations. The visit aims to consult on Israel's planned military offensive in Gaza City, amidst challenges in ending the Gaza war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Plans Major Sanctions on Russia, Tariffs on China to End Ukraine War",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 19:46:49 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The US president has repeatedly threatened tougher measures against Moscow, but has so far failed to take action.",
      "The US president says it is &#039;shocking&#039; that members of the alliance continue to buy Russian oil.",
      "US President Donald Trump has said he is ready to sanction Moscow if all NATO allies halt purchases of Russian oil. Russian forces have used a pipeline to approach a front-line town in Ukraine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/304a/live/78769c30-90a8-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Trump 'ready' to sanction Russia if Nato nations stop buying its oil",
      "Trump urges NATO countries stop buying Russian oil before US sanctions",
      "Ukraine: Trump tells NATO allies to stop buying Russian oil"
    ],
    "score_components": {
      "magnitude": 0.927,
      "recency": 0.757,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump has stated he will impose major sanctions on Russia, aiming to isolate the country over its war in Ukraine, on the condition that all NATO allies cease purchasing Russian oil. He suggested that NATO's efforts in the conflict are insufficient and also proposed imposing tariffs of 50% to 100% on China for its purchases of Russian oil, believing these actions would help end the Russia-Ukraine war.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Far-Right London Protest by Tommy Robinson Injures 26 Police Officers",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 20:23:20 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The march, organized by far-right activist Tommy Robinson, drew more than 110,000 people on Saturday. At least 26 police officers were injured in clashes that broke out.",
      "Far-right protesters clash with police, injuring 26 officers, four of them seriously.",
      "London officers were attacked after a crowd of some 110,000 people gathered near Westminster for an anti-immigration protest led by far-right activist Tommy Robinson."
    ],
    "image_url": "",
    "titles": [
      "Over 100,000 attend London rally organized by far-right activist, clashes break out",
      "Clashes in London as 110,000 join far-right rally against immigration",
      "UK: Clashes with police reported at huge far-right rally"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.85,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A far-right protest led by activist Tommy Robinson in London attracted over 110,000 participants. The event turned violent, resulting in clashes with police that left 26 officers injured, four seriously. The demonstration was centered around anti-immigration sentiments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crawford Beats Alvarez, Becomes Undisputed Super Middleweight Champion",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 14 Sep 2025 07:00:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "www.mmamania.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Crawford became an undisputed champion in a third weight class with his win over Alvarez on Saturday",
      "One fighter is rumored to have made significantly more money than the other in this incredible matchup",
      "Everything you need to know in order to watch the massive Canelo vs. Crawford fight live in Las Vegas",
      "There's plenty of ways to get in on the action on Saturday night in Las Vegas",
      "SportsLine combat expert Josh Nagel has released his top boxing picks for Saturday's Canelo Alvarez vs. Terence Crawford fight on Netflix",
      "The pair of legendary fighters look to make history on Saturday night in Sin City",
      "Live updates, results, and reactions from Canelo Alvarez vs. Terence Crawford with full fight card and streaming details from Las Vegas.",
      "Two of the absolute best boxers in the world — pound-for-pound great and current undisputed Super Middleweight champion, Saul “Canelo” Alvarez, and undefeated (41-0) WBA and vacant WBO interim Light Middleweight champion, Terence Crawford — will lock horns TONIGHT (Sat., Sept. 13, 2025) inside Alleg",
      "Terence Crawford stuns Canelo Alvarez to win the undisputed super middleweight titles in Las Vegas. See reactions, scorecards, and full fight results."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/14/6a3db346-a152-413b-8d7f-f10578680d84/crawford-alvarez-celebrate.jpg",
    "titles": [
      "Canelo Alvarez vs. Terence Crawford fight: Results, winners, highlights, fight card, complete guide",
      "Canelo Alvarez vs. Terence Crawford fight purses, salaries: How much money did each fighter reportedly earn?",
      "Canelo Alvarez vs. Terence Crawford fight stream: Where to watch live online, start time, full card",
      "Canelo Alvarez vs. Terence Crawford fight predictions, best bets: Top picks to consider for massive showdown",
      "Canelo Alvarez vs. Terence Crawford prediction, odds, line, time: Picks from boxing expert who's up $1,500",
      "Canelo Alvarez vs. Terence Crawford fight predictions, expert picks for epic event in Las Vegas",
      "Canelo Alvarez Vs Terence Crawford Live Results, Highlights, Reactions",
      "Canelo vs. Crawford live streaming results, video highlights on Netflix",
      "Canelo Vs. Crawford Results: Boxing World Reacts To ‘Bud’s Big Win"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.976,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Terence Crawford defeated Saul \"Canelo\" Alvarez to become the undisputed super middleweight champion in Las Vegas on September 13, 2025. This victory marks Crawford's achievement as an undisputed champion in a third weight class. The fight, featuring two of the world's best boxers, was highly anticipated and available for live viewing, including options provided by SportsLine combat expert Josh Nagel. Despite rumors of a significant pay disparity between the fighters, the event concluded with Crawford's stunning win over Alvarez, detailed in live updates and reactions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Romania and Poland Deploy Jets Amid Drone Threats, Zelenskyy Cites War Expansion",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Sep 2025 03:52:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Romania scrambles fighter jets as Poland also deploys aircraft over threat of a drone attack.",
      "<p>Volodymyr Zelenskyy says drone incursions are ‘an obvious expansion of the war by Russia’ as neighbouring countries deploy air defences</p><ul><li><p><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></p></li></ul><p>Romania became the latest Nato member stat",
      "The brief incursion occurred days after Poland reported Russian drones in its territory. Romania said the drone did not fly over populated areas."
    ],
    "image_url": "",
    "titles": [
      "Romania reports drone incursion during Russian attack on Ukraine",
      "Romania reports Russian drone in its airspace as Poland scrambles jets again",
      "Romania Reports Russian Drone in Its Airspace"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Romania and Poland deployed fighter jets in response to a drone threat, with Romania experiencing a brief drone incursion. Ukrainian President Volodymyr Zelenskyy characterized these drone incursions as an expansion of the war by Russia. The incident in Romania did not affect populated areas. This follows similar events in Poland, highlighting increased tensions in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former NHLPA Executive Director Bob Goodenow Dies at 72",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 23:37:30 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOM3J6aXIwQXVqQldDTVFWMTZQRmRlcDJ1MWtPaGVQOVQyNWVYeXhlREV2VzVzMDVPT0s5UTQwbEpDVEo5eEM4TWZvZWE5eGE4VmVOZGlhQ0JuMzh0V2hfcTZsa1RTMXFUMHBvUUZoRnRucnV3cFNoZmtIdXNhalVwN3BGczg0TG8?oc=5\" target=\"_blank\">Goodenow, former NHLPA executive director, d",
      "<p>Former NHLPA executive director Bob Goodenow, who led the players&#8217; association through the 2004-05 lockout, passed away at age 72, the NHLPA announced in a statement. </p>",
      "One of hockey&#8217;s most important figures for over a decade passed away on Saturday. Former NHLPA executive director Bob Goodenow, who led the players&#8217; association through the 2004-05 lockout, passed away at age 72, the NHLPA announced in a statement. The lockout was resolved on July 13, 20"
    ],
    "image_url": "",
    "titles": [
      "Goodenow, former NHLPA executive director, dies at 72 - NHL.com",
      "Bob Goodenow, former NHLPA executive director, passes away at age 72",
      "Bob Goodenow, former NHLPA executive director, passes away at age 72"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.82,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bob Goodenow, the former executive director of the NHL Players' Association who played a pivotal role during the 2004-05 lockout, has died at the age of 72. The NHLPA confirmed his passing in a statement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland Deploys Aircraft, Boosts Defense Amid Drone Strike Threats",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 17:47:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>‘Preventive operations’ included putting air defence systems on high alert and followed serious Russian incursion earlier in the week</p><p>Polish and allied aircraft have been deployed in a “preventive” operation in Poland’s airspace because of a threat of drone strikes in neighbouring areas of ",
      "Polish and allied aircraft were deployed in a “preventive” operation in Poland's airspace Saturday because of a threat of drone strikes in neighboring areas of Ukraine.",
      "WARSAW, Poland (AP) — Polish and allied aircraft were deployed in a “preventive” operation in Poland&#8217;s airspace Saturday because of a threat of drone strikes in neighboring areas of Ukraine, and the airport in the eastern Polish city of Lublin was closed, authorities said. The alert lasted aro"
    ],
    "image_url": "https://i.guim.co.uk/img/media/4d968121085e3856e0cb0663a746634cf1819c98/1000_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=c66785b9f5a11fa0e5fbbae03e8d0823",
    "titles": [
      "Poland deploys planes due to threat of drone strikes in nearby Ukraine",
      "Poland deploys planes in its airspace because of threat of drone strikes in nearby Ukraine",
      "Poland deploys planes in its airspace because of threat of drone strikes in nearby Ukraine"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.726,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Polish and allied aircraft were deployed in a preventive operation in Poland's airspace due to a threat of drone strikes from neighboring Ukraine. The operation included putting air defense systems on high alert. Additionally, the airport in Lublin, eastern Poland, was temporarily closed. The alert was in response to a serious Russian incursion earlier in the week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canelo vs Crawford in Vegas, NFL Super Bowl Rematch, Chicago Leads NFC North",
    "domain": "business",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Sun, 14 Sep 2025 07:08:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.forbes.com"
    ],
    "snippets": [
      "Terence Crawford outpointed Canelo Alvarez to take the undisputed super-middleweight titles in a super-fight",
      "Canelo Alvarez vs. Terence Crawford start time, streaming details, fight card, and how to watch live from Las Vegas.",
      "Kansas City and Philadelphia square off in a rematch of two of the last three Super Bowls. Here's what's time the game starts and where to watch.",
      "The two franchises meet for the 191st time, with Chicago leading the series with a 105-80-5 record. Here's what time the NFC North matchup starts and where to watch."
    ],
    "image_url": "",
    "titles": [
      "Canelo vs Crawford official scorecards: Did the judges get it right?",
      "Canelo Vs. Crawford: What Time Does It Start & How To Watch",
      "What Time Is Chiefs Vs. Eagles? Here’s How To Watch",
      "What Time Is Bears Vs. Lions? Here’s How To Watch"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canelo Alvarez and Terence Crawford are set to fight in Las Vegas; details on start time and streaming are available for those interested in watching live. In the NFL, Kansas City and Philadelphia face each other in a Super Bowl rematch, with information on the game start time and viewing options provided. Additionally, the Chicago and NFC North matchup marks their 191st meeting, with Chicago leading the series 105-80-5; details on when and where to watch are also provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taliban and U.S. Agree on Prisoner Swap to Boost Relations",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 14:26:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "CityNews"
    ],
    "domains": [
      "abcnews.go.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The reported visit follows one in March 2025 which led to the release of a US citizen held for more than two years.",
      "It's part of an effort to normalize relations with the United States.",
      "KABUL, Afghanistan (AP) — The Taliban said Saturday they reached agreement with U.S. envoys on an exchange of prisoners as part of an effort to normalize relations between the United States and Afghanistan. They gave no details of a detainee swap and the White House did not comment on the meeting in"
    ],
    "image_url": "",
    "titles": [
      "Taliban official says US envoy agrees to prisoner swap in Kabul meeting",
      "Taliban claim agreement reached with US envoys on a prisoner swap",
      "Taliban claim an agreement is reached with US envoys on a prisoner swap as they seek better ties"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.691,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Taliban and U.S. envoys agreed on a prisoner exchange to help normalize U.S.-Afghan relations, announced in Kabul. This follows a successful visit in March 2025, leading to the release of a detained U.S. citizen. Details of the swap were not disclosed, and the White House has yet to comment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Blue Jays Set Franchise Record with 45th Comeback Win",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Sep 2025 23:40:33 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Forty-five times there has been magic in the Toronto Blue Jays dugout.",
      "<p>With Saturday&#8217;s latest thrilling walk-off win, the 2025 Blue Jays can now claim the title of comeback kings, surpassing the 1993 team for most in franchise history.</p>\n<p>David Singh has more on how Toronto flipped the script at Rogers Centre yet again.</p>",
      "<p>Alejandro Kirk joins Arden Zwelling after delivering the walk-off sac fly vs. the Baltimore Orioles, saying this team is &#8216;incredible&#8217; and they&#8217;re going to keep pushing down the stretch.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/dbcf8447cf78653002e626a5e8370e4d7c70133c0f9723cdd610566cafcff433.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays earn 45th comeback win of the year",
      "Comeback kings: Blue Jays make franchise history with latest walk-off win",
      "‘This team is incredible’: Kirk on Blue Jays 45th comeback win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The 2025 Toronto Blue Jays set a franchise record with their 45th comeback win, surpassing the 1993 team's record. This milestone was achieved with a walk-off victory against the Baltimore Orioles at Rogers Centre, highlighted by Alejandro Kirk's game-winning sacrifice fly. The team is celebrated for their resilience and determination throughout the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Fantasy Football Updates: Rankings, Projections, Expert Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 14 Sep 2025 01:58:57 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine's NFL DFS optimizer has revealed its top value picks for Sunday daily fantasy football in Week 2"
    ],
    "image_url": "",
    "titles": [
      "📈 Fantasy football rankings for NFL Week 2",
      "NFL DFS: Optimizer releases Week 2, 2025 daily fantasy football lineups, picks, advice for DraftKings, FanDuel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The latest fantasy football updates include weekly individual and composite rankings for PPR and IDP formats, with additional superflex ranks by Eric Karabell. SportsLine's model has released Week 2 projections, PPR rankings, and start-sit advice applicable to platforms such as CBS Sports, ESPN, and Yahoo. DFS expert Mike McClure has also provided his top picks and lineup suggestions for Week 2's NFL games. The analysis covers player matchups, including the performance outlook for Justin Fields, Daniel Jones, Nick Chubb, and the viability of starting players against the New England Patriots de",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kirk's Sacrifice Fly Seals Blue Jays' 5-4 Comeback Win Over Orioles",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Sep 2025 22:04:43 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Alejandro Kirk's sacrifice fly in the ninth inning completed yet another Blue Jays comeback as Toronto stunned the Baltimore Orioles 5-4 on Saturday.",
      "<p>Watch as Toronto Blue Jays catcher Alejandro Kirk hits a ball into centre field that gets deep enough for Ernie Clement to tag up and score the game-winning run in the ninth inning against the Baltimore Orioles.</p>",
      "<p>Alejandro Kirk’s sacrifice fly in the ninth capped off a three-run rally as the Toronto Blue Jays walked off the Baltimore Orioles 5-4. Addison Barger recorded his 20th home run of the season in the win.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/ad6e3b1f233591eb69e46ace94aa8d5db25df23af047c56f891cff260ec2a12f.jpg?quality=65&strip=all",
    "titles": [
      "Kirk’s late sac fly lifts Blue Jays over Orioles",
      "Gotta See It: Blue Jays’ Kirk walks off Orioles with sac fly to cap off comeback",
      "MLB Highlights: Blue Jays 5, Orioles 4"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk's sacrifice fly in the ninth inning allowed Ernie Clement to score the game-winning run, leading the Toronto Blue Jays to a 5-4 comeback victory over the Baltimore Orioles on Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Beats Israel in Davis Cup Amid Protests Over Gaza, West Bank",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Sep 2025 18:51:31 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "About 400 demonstrators opposing Israel's actions in Gaza and the West Bank held peaceful protests during Friday's matches.",
      "<p>Canada advanced to the 2026 Davis Cup Qualifiers after taking a 3-0 lead over Israel in a best-of-five tie played in an empty Halifax stadium amid protests.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5e79edaa18fb5e4c670c33616481037ea43ca0c51c425ba0d1f194599f5d88e5.jpg?quality=65&strip=all",
    "titles": [
      "Canada wins Davis Cup tie with Israel in empty Halifax stadium",
      "Canada wins Davis Cup tie with Israel in empty Halifax stadium"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.664,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Around 400 people protested against Israel's actions in Gaza and the West Bank during Friday's matches. In an empty Halifax stadium, Canada secured a spot in the 2026 Davis Cup Qualifiers by leading Israel 3-0 in a best-of-five tie, amidst these peaceful demonstrations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netflix Unveils Liam Hemsworth as New Geralt in Witcher Season 4 Clip",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 22:51:27 -0400",
    "source": "Forbes",
    "sources": [
      "The Verge",
      "Forbes"
    ],
    "domains": [
      "www.theverge.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Toss a coin to your new Witcher. Here's your first look at Liam Hemsworth as he takes over for Henry Cavill as Geralt of Rivia.",
      "It’s been a few years since Netflix confirmed that Liam Hemsworth would be taking over as Geralt of Rivia in the live-action Witcher series. And while we caught a brief glimpse of him in action last year, the first proper clip from season 4 of the show reveals just how Hemsworth will be inhabiting t"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c62936d422d4df25c21af6/0x0.jpg?width=960",
    "titles": [
      "‘The Witcher’ Season 4 Gets First Trailer With Liam Hemsworth And An October Release Date",
      "Liam Hemsworth is Geralt in the first Witcher season 4 trailer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Netflix has released the first official clip of Liam Hemsworth as Geralt of Rivia for season 4 of the live-action Witcher series. This follows the announcement a few years ago that Hemsworth would be replacing Henry Cavill in the role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Chair Seeks Support for Musk's $1T Compensation Plan",
    "domain": "technology",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 19:03:39 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "TechCrunch"
    ],
    "domains": [
      "www.nytimes.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Robyn Denholm, normally media shy, is campaigning to get shareholders to back the chief executive’s trillion-dollar compensation package.",
      "Tesla's board chair is defending a proposed 10-year, $1 trillion compensation package for CEO Elon Musk."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/12/multimedia/12biz-tesla-denholm-fjhq/12biz-tesla-denholm-fjhq-mediumSquareAt3X.jpg",
    "titles": [
      "Tesla Board Chair Defend’s Elon Musk’s Humongous Pay Proposal",
      "Tesla board chair calls debate over Elon Musk’s $1T pay package ‘a little bit weird’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.761,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla's board chair, Robyn Denholm, is actively seeking shareholder support for a proposed 10-year, $1 trillion compensation package for CEO Elon Musk. Denholm, usually avoiding the media, is campaigning for the substantial plan.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Gov. Cook's Condo Tagged \"Vacation Home,\" Counters Fraud Claim",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 13 Sep 2025 11:23:53 -0400",
    "source": "NPR",
    "sources": [
      "MarketWatch",
      "NPR"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.npr.org"
    ],
    "snippets": [
      "Fed Gov. Lisa Cook referred to a condo she bought in 2021 as a \"vacation home\" in a loan estimate, which could undermine claims by the Trump administration that she committed mortgage fraud.",
      "Federal Reserve governor Lisa Cook reportedly declared a condo she purchased in 2021 as a “vacation” and “second” home in loan filings and other documents — potentially undermining the Trump administration’s claims that she engaged in mortgage fraud, which the president used as grounds to fire Cook "
    ],
    "image_url": "",
    "titles": [
      "Fed's Cook claimed second residence as 'vacation home,' undercutting Trump fraud claims",
      "Fed governor Cook declared second residence as ‘vacation home,’ countering Trump’s claims"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.705,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Documents reveal Fed Gov. Lisa Cook labeled a condo purchased in 2021 as a \"vacation home\" on a loan estimate, conflicting with Trump administration accusations of mortgage fraud. Additionally, for security clearance, she referred to it as a “second home,” as per The Associated Press.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Launches Probes into U.S. Semiconductor Sector Ahead of Talks",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 15:10:50 +0000",
    "source": "Fortune",
    "sources": [
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "financialpost.com",
      "fortune.com"
    ],
    "snippets": [
      "The Ministry of Commerce said in a statement on Saturday that it’s opened an anti-dumping probe relating to certain American-made analog IC chips.",
      "TAIPEI, Taiwan (AP) &#8212; China launched two probes targeting the U.S. semiconductor sector Saturday ahead of talks between the two nations in Spain this week on trade, national security and the ownership of social media platform TikTok. China&#8217;s Ministry of Commerce announced an anti-dumping"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/GettyImages-1232588234-e1757775935497.jpg?w=2048",
    "titles": [
      "China starts probes targeting US semiconductor sector",
      "China launches probes targeting US semiconductors ahead of Madrid trade talks"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.702,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China's Ministry of Commerce has initiated two investigations into the U.S. semiconductor sector, including an anti-dumping probe into American-made analog IC chips. These actions come ahead of planned trade and national security talks between the U.S. and China in Spain, which will also cover issues related to the ownership of TikTok.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Solar Flares Far Hotter, Habitable Zone Larger Than Thought: Study",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 19:30:04 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/solar-flares-are-6-5-times-hotter-than-we-thought/\" rel=\"nofollow\" title=\"Solar Flares Are 6.5 Times Hotter Than We Thought\"><img alt=\"Solar Limb Flare and Scaled Earth\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/S",
      "<a href=\"https://scitechdaily.com/our-galaxys-sweet-spot-for-life-is-bigger-than-we-thought/\" rel=\"nofollow\" title=\"Our Galaxy’s Sweet Spot for Life Is Bigger Than We Thought\"><img alt=\"Rocky Habitable Planet Art Concept Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "Solar Flares Are 6.5 Times Hotter Than We Thought",
      "Our Galaxy’s Sweet Spot for Life Is Bigger Than We Thought"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.768,
      "consensus": 0.35,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.442,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Recent scientific findings reveal that solar flares are 6.5 times hotter than previously believed. Additionally, research indicates that the habitable zone within our galaxy is larger than once thought, suggesting a greater potential for life-supporting planets. These discoveries expand our understanding of both solar phenomena and the potential for life in the universe.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: research, support",
    "constructiveness_source": "heuristic"
  }
]