[
  {
    "title": "Air India Tragedy Strikes Amidst Brand Transformation Efforts",
    "domain": "general",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:50:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The tragedy happened as Air India was on the \"final climb phrase\" of its brand transformation after the Tata buyout"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6e2a/live/6222ce10-4bb4-11f0-885d-4db674103002.jpg",
    "titles": [
      "Devastating crash threatens Air India's ambitious turnaround"
    ],
    "summary": "An Air India tragedy occurred during what was described as the \"final climb phase\" of its brand transformation following acquisition by Tata. This incident marks a significant event amidst the airline's efforts to revamp its image and operations under new ownership.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful contextualization of the incident within the broader narrative of Air India's brand transformation. However, it lacks information on potential causes, impacts, or solutions to prevent such tragedies in the future.",
    "score_components": {
      "magnitude": 0.169,
      "recency": 0.84,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.435
  },
  {
    "title": "US Judge Overturns Biden Rule on Abortion Privacy",
    "domain": "general",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:45:42 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMizAFBVV95cUxOOV82WHJMdzJpa3lCLUthMjhlZ1prR0NGbjdrZ0pTdHVzWjBQSGlkMXRRUE96YmlQQVlLRzYyQlJJaUlXLUJ6c2g1cExrS2NsTjBfZTNtZFUxb2xfSWJjVGdWTjhGQ2lfN1AxNzhOcTE1UnNtbGxhQUkzS1RaQTB2TlhLZE80X2hOM1VMR1hwZ1NWb0FwRlZzQ05TSm9xSEYxWlhIMGU3VmpZcmx0RnZYY1daRHB5X0RCU3pnY0Rla1VlMEV0MG1JLVJ4d28?oc=5\" target=\"_blank\">US judge invalidates Biden rule protecting privacy for abortions</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
    ],
    "image_url": "",
    "titles": [
      "US judge invalidates Biden rule protecting privacy for abortions - Reuters"
    ],
    "summary": "A US judge has invalidated a Biden administration rule that was designed to protect the privacy of individuals seeking abortions. This decision marks a significant development in the ongoing legal and policy debates surrounding reproductive rights in the United States.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about a significant development in US reproductive rights policy, providing useful information for decision-making and understanding the current legal landscape. However, it does not report on potential solutions or responses to this decision.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.839,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Cambodia Bans Thai Produce Amid Escalating Border Dispute",
    "domain": "general",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:41:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>The border dispute has led to a surge in nationalist sentiment and tit-for-tat actions by both governments </p><p>Cambodia has banned imports of fruit and vegetables from Thailand, the latest escalation in a series of retaliatory actions sparked by a long-running border dispute between the South-east Asian neighbours.</p><p>Tensions flared in May when troops briefly exchanged fire at a contested area of the border, killing a Cambodian soldier.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7786190f2595f10054a0797588dda455a2dd8399/901_0_4560_3648/master/4560.jpg?width=140&quality=85&auto=format&fit=max&s=463c809234ac311f3365b7cfbda60869",
    "titles": [
      "Cambodia bans fruit imports and soap operas from Thailand as border dispute sours"
    ],
    "summary": "A long-standing border dispute between Cambodia and Thailand has escalated, resulting in increased nationalist sentiment and retaliatory measures by both countries. Recently, Cambodia banned imports of fruit and vegetables from Thailand, marking the latest action in the ongoing conflict. Tensions heightened in May when troops from both nations exchanged fire at the border, leading to the death of a Cambodian soldier.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story provides context about the ongoing border dispute between Cambodia and Thailand, it doesn't offer much in terms of solutions or progress towards resolving the conflict. It does, however, increase awareness about the impacts of such disputes on trade and regional relations.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.838,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.396
  },
  {
    "title": "US Created Over 1,000 New Millionaires Daily in 2022, Leads Global Wealth Growth",
    "domain": "general",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:36:33 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Investopedia"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiugFBVV95cUxQYW5FaWJzanZ5RG1fTjlraDgzalVqeV9ZY05NaXZOMFRFUnh2SzFMU0ZtRVJUQW1VR1ZacVg3TENqM3FINy1sZkpzMDh5cm8zVndlTjBzOFFpbWNHN2hGci1FN3dKbUlnWjMzbXo1Q215WGREM25QY1FHM0NnVWRPa1k5aUtCemRNRkxwcFBfOHFaMmhUUkxBQlM5d2M3U2NfUkR4d0FjWEJmRXNUMGgzUFhEX2FEVy1DMFE?oc=5\" target=\"_blank\">US added over 1,000 new millionaires a day last year, UBS report says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
      "<figure><img alt=\"wildpixel / iStock via Getty Images \" src=\"https://www.investopedia.com/thmb/opqF_C1tGFa9ZfYOKwBmI1Tsz6Y=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-84868420-9c4ca1a74ead4766a9b5255e24d3268f.jpg\" /><figcaption><i><p>wildpixel / iStock via Getty Images</p> \"In 2024 wealth growth was tilted strongly towards North America,\" UBS said.</i></figcaption></figure><br /><h3>KEY TAKEAWAYS</h3><ul><li>The U.S. added over 1,000 millionaires a day last year, more than in any other market globally, according to a UBS report out Wednesday. </li><li>The..."
    ],
    "image_url": "",
    "titles": [
      "US added over 1,000 new millionaires a day last year, UBS report says - Reuters",
      "US Added Over 1,000 Millionaires a Day Last Year—More Than Elsewhere, UBS Says"
    ],
    "summary": "In 2022, the United States saw the creation of over 1,000 new millionaires each day, leading the global market in wealth growth, as reported by UBS. This significant increase in millionaire population highlights North America's dominant position in wealth accumulation for that year.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about wealth growth trends in the United States, but it does not provide deeper insights into the causes or implications of this trend, nor does it empower readers with actionable insights or solutions.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.836,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.655
  },
  {
    "title": "Senate Briefing with Gabbard Postponed Amid Iran Tensions",
    "domain": "general",
    "location": "national",
    "published": "Wed, 18 Jun 2025 23:33:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNaHpKQWhjRjBZQS1Pc1hoYVVOZ0xzTm56em5WTFgzcWZrSFZaQnlLSXE0S3piazZETWUzWUtFdVlJbzlJdWNJbElRX1FjcmFXX2FEQXpqT2REZ0xORWRWQ1h4Q2JLYldFd19ZR3RQRWZzc2Uza0JZaXZfaXFFdEE2bVZxVEVYY2pxME8tSnJybFdvVDh6aDB0U1NQOA?oc=5\" target=\"_blank\">Scoop: Gabbard's Senate Intel briefing postponed amid Iran tensions</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>"
    ],
    "image_url": "",
    "titles": [
      "Scoop: Gabbard's Senate Intel briefing postponed amid Iran tensions - Axios"
    ],
    "summary": "A scheduled Senate Intelligence briefing with Tulsi Gabbard has been postponed due to rising tensions with Iran. The briefing was expected to address significant issues but has been delayed for unspecified reasons related to the escalating situation. The current status of the briefing and a new date have not been provided.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the postponement of a Senate Intelligence briefing due to rising tensions with Iran. However, it offers minimal depth or insight into the situation, the reasons for postponement, or the potential implications.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.836,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.359
  },
  {
    "title": "US President Hints at Potential Involvement in Israel-Iran Conflict",
    "domain": "general",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:26:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The US president has signalled he may get involved in Israel&#039;s fight against Iran but has not made a final decision."
    ],
    "image_url": "",
    "titles": [
      "‘Nobody knows what I’m going to do’: Trump embraces ambiguity towards Iran"
    ],
    "summary": "The US President has indicated a potential involvement in Israel's conflict with Iran, though a final decision has yet to be announced. This development suggests a possible shift in US foreign policy regarding the tensions between Israel and Iran, but the specifics of the involvement remain unclear pending a conclusive decision.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a potential shift in US foreign policy, which could affect international relations. However, it doesn't offer clear insights or actions for readers, nor does it highlight any solutions or progress towards resolving the conflict.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.833,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.395
  },
  {
    "title": "Juventus Visits White House, Wins 5-0, Amid Controversial Trump Remarks",
    "domain": "general",
    "location": "national",
    "published": "Wed, 18 Jun 2025 23:26:09 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian",
      "CBS Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "The president's comments came after workers erected two 88-foot-tall flagpoles, one on the north lawn and one on the south lawn, at the White House on Wednesday.",
      "Juventus are in Washington, D.C. for their Club World Cup opener against Al Ain on Wednesday",
      "<ul><li><p>Team are in Washington DC for Club World Cup</p></li><li><p>President asks if women could make Juve team</p></li></ul><p>Juventus players and staff were involved in an awkward encounter at the White House on Wednesday when Donald Trump attempted to get them to enter into a debate on transgender women in sport.</p><p>The Italian football giants are in the US for the Club World Cup, and defeated Al Ain of the United Arab Emirates 5-0 at Washington DC’s Audi Field hours after a selection of players, coaches and executives had been with Trump.</p> <a..."
    ],
    "image_url": "https://s.abcnews.com/images/Politics/trump-flagpole-installation_1750296693808_hpMain_4x3t_384.jpg",
    "titles": [
      "'Any illegal immigrants?' Trump questions workers installing White House flagpoles",
      "Donald Trump asks Juventus players about transgender athletes during White House visit",
      "Trump asks Juventus squad for views on transgender players during awkward White House visit"
    ],
    "summary": "On Wednesday, Juventus football team visited the White House before their Club World Cup match in Washington, D.C., where they later defeated Al Ain 5-0. During the visit, President Trump initiated a controversial conversation about transgender women in sports with the team. This occurred shortly after two 88-foot flagpoles were installed on the White House grounds.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Juventus' visit to the White House and their subsequent win, as well as President Trump's controversial remarks. However, it doesn't provide deeper understanding or actionable insights, nor does it report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.906,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.757
  },
  {
    "title": "Russian Athletes Barred from 2026 Olympics Luge Events Over Ukraine Actions",
    "domain": "general",
    "location": "national",
    "published": "Wed, 18 Jun 2025 23:21:52 GMT",
    "source": "Globe and Mail",
    "sources": [
      "Globe and Mail"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiugFBVV95cUxOR2pISVpQWmFfX1JfX2VQaXg3WUEtTkVBYTNNYjFuSTBmeFFGWkU2Wi15emh4eHJ0Wi1LWW4xMmRDdmI0NG1VYjFjcTk4VXlwTERkQlRnYTlkOWtFd2NlZmU3RmpSVlRWMW8wVXAzOTdzMWFWUnR6Q3RQYWpSUTdoVFFZaDUtdWtpSzlSNDZQZGV3d2FqM1VaLUdfU1M1SDl3VXFYN01HVGpBdkFzNWNBeEI3N2ZZcllrLXc?oc=5\" target=\"_blank\">Russian athletes excluded from luge at the 2026 Milan-Cortina Olympics</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Globe and Mail</font>"
    ],
    "image_url": "",
    "titles": [
      "Russian athletes excluded from luge at the 2026 Milan-Cortina Olympics - The Globe and Mail"
    ],
    "summary": "Russian athletes have been excluded from participating in the luge events at the 2026 Milan-Cortina Olympics. This decision is part of the ongoing international response to Russia's actions in Ukraine. The exclusion reflects a broader trend of sanctions and bans against Russian athletes in various international sports competitions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is informative, providing context about the exclusion of Russian athletes from the 2026 Olympics as part of the international response to Russia's actions in Ukraine. It offers useful insights into the broader trend of sanctions and bans against Russian athletes.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.832,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.402
  },
  {
    "title": "Walter Set to Become New L.A. Lakers Owner, Details Pending",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 23:38:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Walter is reportedly set to become the new owner of the L.A. Lakers"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/18/9217c6ed-acd5-45a8-8c83-048270aee909/mark-walter-magic-johnson-getty.png",
    "titles": [
      "Mark Walter's Dodgers became an MLB juggernaut -- and Lakers can use these lessons as he takes over NBA team"
    ],
    "summary": "Walter is reported to be the incoming owner of the L.A. Lakers. This development indicates a significant change in the ownership structure of the renowned basketball team. The current status of the transition is confirmed, but further details about the deal's terms or its completion timeline remain undisclosed.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a change in the ownership of the L.A. Lakers. However, it lacks depth and insight as it does not provide any further details about the deal or its implications for the team or the league.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.837,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.386
  },
  {
    "title": "NFL Unveils 2025 Joint Practice Schedule",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 23:14:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The NFL announced its full 2025 joint practice schedule on Wednesday"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/30/6bae908b-6e28-4a4a-8539-8756259489e1/nfl-footballs.jpg",
    "titles": [
      "2025 NFL joint practices schedule: Full list of dates, locations, teams, matchups during preseason"
    ],
    "summary": "The NFL officially released its complete joint practice schedule for the 2025 season on Wednesday. This announcement details the teams that will participate in shared training sessions ahead of the 2025 NFL season, marking a key moment in the league's pre-season preparations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the joint practice schedule for the 2025 NFL season. It provides useful information for fans and stakeholders, helping them understand the pre-season preparations. However, it does not report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.83,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "NFL Unveils Top 53 Players of the Past 25 Years",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 22:56:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "In honor of hitting the quarter-century mark, we built a 53-man roster of the best NFL players from the past 25 years. Who makes the team?"
    ],
    "image_url": "",
    "titles": [
      "The ultimate NFL team from past 25 years: Who makes the 53-man roster, practice squad and coaching staff?"
    ],
    "summary": "A 53-man roster comprising the best NFL players from the past 25 years has been created to celebrate the milestone of a quarter-century. This selection showcases the top talents and achievements in the NFL over the last 25 years, highlighting the players who have made significant impacts on the game during this period.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the top players in the NFL over the past 25 years, contributing to a deeper understanding of the game's history. However, it does not highlight any progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.897,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.426
  },
  {
    "title": "Five-Round Fight Scheduled for July 26 Co-Main Event",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 22:46:27 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The five-round fight will serve as the co-main event for the July 26 card"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/18/bcfd03ab-f6e3-4dd8-b41f-171c4b0ef071/pico-getty.png",
    "titles": [
      "Aaron Pico books UFC Fight Night debut: Former Bellator standout to face unbeaten Movsar Evloev in July"
    ],
    "summary": "A five-round fight has been scheduled as the co-main event for the July 26 card. This match is set to be one of the highlights of the event, attracting significant attention from fans and participants alike. The details about the fighters and the specific stakes of the match have not been disclosed, but the placement as a co-main event underscores its importance to the evening's lineup.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a scheduled event but lacks depth or insight. It does not provide any actionable insights or deeper understanding to the reader, nor does it report on solutions, improvements, or innovations. It also does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.822,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.363
  },
  {
    "title": "Grizzlies' Zach Edey Charged with Reckless Driving at 101 MPH",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 22:45:24 GMT",
    "source": "Bleacher Report",
    "sources": [
      "Bleacher Report"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMitAFBVV95cUxOSDh1dEdScXVIN01tUHB2Uk81Z2FKZlVpazVhNnhxMnNpb1dmbDRBVlNpMEM2ZGd3OEF4Z2FnM3B2WVItSnd0UFVLMkVGTkRoamQ3Q2pPaWRicm1oaHR0QzFiTHZaUFFEalBjcFBhX2FDakNyVElpZEpuYXZXZHdFMm04a0J5eTBualp5T2RUa0xjWnNTa1hLQ2kyeU9pNTQzTThETGdMem1kYzVBWTQzMVZsc2M?oc=5\" target=\"_blank\">Grizzlies' Zach Edey Charged with Reckless Driving for Going 101 MPH, Police Say</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bleacher Report</font>"
    ],
    "image_url": "",
    "titles": [
      "Grizzlies' Zach Edey Charged with Reckless Driving for Going 101 MPH, Police Say - Bleacher Report"
    ],
    "summary": "Zach Edey, a player for the Grizzlies, has been charged with reckless driving after police clocked him going 101 MPH. This incident has led to legal action against Edey, marking a significant issue off the court for the athlete.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an incident involving a sports player. However, it does not give the reader actionable insights or deeper understanding. It does not report on solutions, improvements, or innovations. The story also does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.822,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.356
  },
  {
    "title": "Trade Values Chart Aims to Optimize Trading Decisions",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 21:43:42 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The trade values chart aims to help you make the best value trades you can"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/02/29c950df-b42f-4d47-bb4a-7064a57326a9/hunter-goodman.jpg",
    "titles": [
      "2025 Fantasy Baseball Week 13 Trade Values: Exploring where Hunter Goodman, Wyatt Langford, and Seth Lugo land"
    ],
    "summary": "The trade values chart is designed to assist individuals in making the most advantageous trades possible by providing a structured framework for assessing the value of potential trade options. This tool is intended to guide users towards decisions that optimize their trading outcomes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights and deeper understanding to the reader about how to optimize trading decisions using a trade values chart. It reports on a solution (the chart) to a problem (making advantageous trades). It also increases clarity around the system of trading.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.804,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Alexander Joins Baltimore Team with One-Year Contract",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 18 Jun 2025 21:41:31 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Alexander lands in Baltimore on a one-year deal"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/18/055e97fd-8f54-4bbb-bec1-7352bdc281f8/jaire.jpg",
    "titles": [
      "Jaire Alexander signs with Ravens: Former Packers cornerback reunites with Louisville teammate Lamar Jackson"
    ],
    "summary": "Alexander has signed a one-year contract to play in Baltimore. This move marks his latest career development, bringing him to the city's team for at least the upcoming season. The agreement has been finalized, ensuring his participation with the Baltimore team for the duration of this contract.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's career move but does not provide any deeper insights or actionable information for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.804,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.353
  },
  {
    "title": "Bradley Predicts Spaun to Be \"Heartbeat\" of Team USA at Ryder Cup",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 18 Jun 2025 21:41:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Keegan Bradley says newly-crowned US Open champion JJ Spaun will not only feature at this year's Ryder Cup but will be the heartbeat of Team USA."
    ],
    "image_url": "https://e0.365dm.com/25/06/1920x1080/skysports-jj-spaun-golf-us-open_6943192.jpg?20250616011920",
    "titles": [
      "Bradley: Spaun will be Team USA 'heartbeat' at Ryder Cup"
    ],
    "summary": "Keegan Bradley has stated that JJ Spaun, after winning the US Open, is expected to not just participate in this year's Ryder Cup for Team USA but also play a central role. Bradley predicts Spaun will be the \"heartbeat\" of the team, indicating his significant impact and contribution expected at the event.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some awareness about the potential impact of a player in an upcoming event. However, it lacks depth and does not offer any substantial insights or solutions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.804,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.373
  },
  {
    "title": "Today's NYT Mini Crossword Hints and Answers Released",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:58:15 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/66ad93159698a3280d18584c/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Mini Crossword Clues And Answers For Thursday, June 19th"
    ],
    "summary": "Hints and answers for today's New York Times Mini Crossword puzzle have been provided for those seeking assistance. This update offers guidance for puzzle enthusiasts looking to solve the latest challenge.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is useful for readers who are interested in solving the crossword puzzle. It provides actionable insights and assistance, but it does not report on solutions, improvements, or attempts to solve broader problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.916,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.405
  },
  {
    "title": "Morgan Stanley to Close Electronic Equity Market-Making Unit",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:50:34 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxQYWpJRGRHTjU1cVdZdks2aWI1UHRfZlE3WnZjalRXTFIydzJKNm5CbkRRdmR5T2tqdVhjRUVKUXRRN205a3Jkb2duWEl3dTBoUG5KdDJvTk9XRVZhSkUzWFdMaGNrazFUUU0zRnlPOGYyd3BUUVV1cUZ5cUVpZ0I5aFNJZjd1Q1h3Ym1aMHFEbW1aWjRtTmk0NS1GRFJvNm9TQ29NNGI3emwzWHp6bTYxMzM4SQ?oc=5\" target=\"_blank\">Morgan Stanley to Shutter Electronic Equity Market-Making Unit</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Morgan Stanley to Shutter Electronic Equity Market-Making Unit - Bloomberg"
    ],
    "summary": "Morgan Stanley has announced the closure of its electronic equity market-making unit. This decision is part of the firm's strategic adjustments in its trading operations. The specific reasons for the shutdown or the exact timeline for the closure were not disclosed. This move is expected to impact the firm's trading strategy and could have implications for its clients and the broader market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a significant change in Morgan Stanley's operations, which could impact the firm's clients and the broader market. However, it lacks specific details about the reasons for the closure and the timeline, limiting its usefulness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.841,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "UK, US Discuss Response to Tehran Threats on British Assets",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:07:23 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Ministers in emergency meeting discuss working with American forces if Tehran threatens UK assets in the region"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F4c0ca3dc-3a42-46a0-a501-76c100186fc9.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Starmer puts UK cabinet on alert for potential US attack on Iran"
    ],
    "summary": "UK ministers convened in an emergency meeting to discuss collaboration with American forces in response to potential threats from Tehran against British assets in the region. The discussion underscores the UK's commitment to safeguarding its interests and enhancing security cooperation with the United States amidst concerns over regional stability.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful context about the UK's security cooperation with the US and the potential threats from Tehran. It increases awareness about the geopolitical situation, but it does not report on specific solutions or progress in handling the situation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.828,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Asian Universities Rise in QS Rankings, Australia Faces Mixed Results",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:01:08 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Chinese, Indian and south-east Asian institutions climb the annual list"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff259d704-82c8-41bb-95d8-85dcea34c59c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Majority of British universities slip down global rankings"
    ],
    "summary": "In the latest QS World University Rankings, Chinese, Indian, and South-East Asian universities have seen an improvement in their positions. Despite a challenging year for higher education globally, Australia maintains a presence in the top 20 with the University of Melbourne and the University of New South Wales. However, many Australian institutions have experienced a decline in their rankings, reflecting a turbulent period for the sector.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story offers empowering knowledge about the current state of higher education globally, highlighting the progress made by Asian universities and the challenges faced by Australian institutions. It provides a deeper understanding of the trends in the higher education sector, which can be useful for students, educators, and policymakers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.826,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Wealthy Foreign Buyers Lose Interest in High-End Properties",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:01:08 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Cooling of interest from wealthy international buyers, say estate agents"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F57298c62-5e66-49d8-a44a-7f216424efed.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Non-doms’ retreat hits London’s prime housing market"
    ],
    "summary": "Estate agents have reported a decrease in interest from wealthy international buyers. This trend indicates a shift in the real estate market, impacting the demand for high-end properties. The current status reflects a cooling phase in the previously robust market segment of affluent foreign investors.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides a deeper understanding of a shift in the real estate market, which could be useful for potential investors, real estate agents, and analysts. However, it doesn't provide solutions or improvements to this issue, hence it doesn't score higher.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.826,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Victims' Families Oppose Boeing Deal Amid New 737 Max Safety Warning",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 22:46:20 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMitAFBVV95cUxOU1ZYWHZJeTdvVDVXLTZPUC1HSmxEcU5VeHFGU2FPT2FlMTJWSlF1Vm4ydUx3Zms2Z3dGUEk3RVM4aEtSZE1JVEpBNExaSXU0QWNySzhCM3dyUXZIVU1kWDdjM0NMMzBHaHQ5TExnQ3htQVY1RHNqSjBKUFNLSnNNVUdqQWk2YTllRmhKRUpDdTRyckNOazVUb0twZHpnc1NwRHZuTU0wWU5RRlZjYjFhX052SjQ?oc=5\" target=\"_blank\">Families of 737 Max Crash Victims Urge Rejection of Boeing Deal</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMirwFBVV95cUxOckJOaFprV3g1cXZWYVNtX2hnaEQ1c1Nrb1dQR3NscTQ3SjhjbzRZaUswV2M3STFsLTYyZktWRlQtUm93cXg5ZHVuaGVDb2NSRXhuX1hESUxITE1OQXdVY3ZGemZzbFJnRmlNQkg3NFBHQjRkR3Rva2dRNHpob2hPa01wMm5jQmZLWGh0a1dMcmxZb2YtQnBjblBIZUM3S3BtLXhWcDVJWXN3MkI2dVNj?oc=5\" target=\"_blank\">NTSB Warns About Boeing 737 Max Engine Issue That Could Lead to Smoke in Cabin</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Families of 737 Max Crash Victims Urge Rejection of Boeing Deal - Bloomberg",
      "NTSB Warns About Boeing 737 Max Engine Issue That Could Lead to Smoke in Cabin - Bloomberg"
    ],
    "summary": "Families of the victims from the 737 Max crashes have urged for the rejection of a Boeing deal, expressing their concerns and seeking justice. Meanwhile, the National Transportation Safety Board (NTSB) has issued a warning about a potential engine issue in the Boeing 737 Max that could result in smoke filling the cabin. These developments highlight ongoing safety and legal challenges for Boeing related to the 737 Max aircraft.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story increases awareness about the ongoing safety and legal challenges for Boeing, which is of public interest. However, it doesn't provide deeper insights into the potential implications of these developments or any solutions to the identified issues.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.822,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.396
  },
  {
    "title": "UFC Abu Dhabi Fight Night Announces First Six Bouts, Whittaker vs. de Ridder",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 22:00:38 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The UFC officially announced the first six fights for the upcoming UFC Abu Dhabi fight card. The UFC Fight Night main event is Robert Whittaker vs. Renier de Ridder."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68535a5df9e349834718dc48/0x0.jpg?width=960",
    "titles": [
      "UFC Announces First Six Fights For July Abu Dhabi Fight Card"
    ],
    "summary": "The UFC has officially confirmed the first six bouts for the UFC Abu Dhabi Fight Night, headlined by the main event featuring Robert Whittaker versus Renier de Ridder. This announcement marks the beginning of the lineup for the upcoming event in Abu Dhabi.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an upcoming UFC event, including the main event fighters. However, it lacks depth or insight into the significance of the fights, the fighters' backgrounds, or the implications of the event for the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.879,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.368
  },
  {
    "title": "Amazon Requires Employees to Relocate to Seattle, Other Hubs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 18 Jun 2025 21:29:45 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMisgFBVV95cUxQVzRTcXZMa2lYT2JFdWprSThGS24tRU5xMUhDdmdLY0FGY0ZQY3NQb2g2QzYxNDB6TnBlNEpEazBONWU3TWd1U2NFcEI2ZGJHSm1hQzR4aE03eFdzNlVZc1dWTXBIQkZibVRCUUp1MEg2RTBQRG1ra1hqRk56d3BzY2ZJYXc5OWtpcnlYYW5fZEk1aTdDbmdtc2ZtbFJWM3NXSDlTbURGWG90SlFkeWRySEtB?oc=5\" target=\"_blank\">Amazon Orders Employees to Relocate to Seattle and Other Hubs</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Amazon Orders Employees to Relocate to Seattle and Other Hubs - Bloomberg"
    ],
    "summary": "Amazon has mandated that its employees relocate to Seattle and other designated hubs, as reported by Bloomberg. This directive is part of the company's broader strategy to consolidate its workforce in specific locations. The current status of this policy implementation and the reasons behind the decision were not detailed in the provided content.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness of Amazon's new policy but lacks depth or insight into why Amazon is making this decision, how it will impact employees, or what it means for the future of work at Amazon or in the tech industry generally.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.8,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.372
  },
  {
    "title": "First Observation of Anyons in Ultracold Quantum Gas Advances Quantum Tech",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:17:25 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-create-exotic-anyons-in-one-dimensional-quantum-gas/\" rel=\"nofollow\" title=\"Scientists Create Exotic “Anyons” in One-Dimensional Quantum Gas\"><img alt=\"One Dimensional Anyons\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/One-Dimensional-Anyons-777x777.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>In a stunning first, scientists observed anyons—exotic particles with in-between statistics—in a 1D ultracold gas. This discovery could pave the way for advanced quantum..."
    ],
    "image_url": "",
    "titles": [
      "Scientists Create Exotic “Anyons” in One-Dimensional Quantum Gas"
    ],
    "summary": "Scientists have successfully observed anyons, exotic particles with unique properties, in a one-dimensional ultracold quantum gas for the first time. This groundbreaking discovery holds significant potential for advancing quantum computing and technology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant scientific breakthrough in the field of quantum technology. It provides useful insights into the discovery of anyons in a one-dimensional ultracold quantum gas, which may contribute to advancements in quantum computing and technology. It increases awareness about the potential impacts of this discovery and the progress being made in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.831,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.418
  },
  {
    "title": "\"New '28 Days Later' Film Hailed as Series' Best by Critic Simon Ings\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 23:00:37 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The infected are back, over two decades since they first appeared in 2002's 28 Days Later — and this film is the best of the three, says film columnist Simon Ings"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/18153650/SEI_255957494.jpg",
    "titles": [
      "Danny Boyle's long-awaited zombie sequel 28 Years Later is a triumph"
    ],
    "summary": "Over two decades since their initial appearance in 2002's \"28 Days Later,\" the infected return in the latest installment of the series. Film columnist Simon Ings hails this movie as the best among the three in the franchise, marking a significant acknowledgment of its quality and impact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.331
  },
  {
    "title": "New Model Boosts OLED Lifespan and Brightness, Enhancing Screen Tech",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 22:52:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/revolutionizing-oleds-new-model-unlocks-longer-lifespan-and-brighter-displays/\" rel=\"nofollow\" title=\"Revolutionizing OLEDs: New Model Unlocks Longer Lifespan and Brighter Displays\"><img alt=\"Excitonic Energy Configuration Changes of a TADF Material\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/Excitonic-Energy-Configuration-Changes-of-a-TADF-Material-777x777.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers have developed a novel analytical model that reveals the..."
    ],
    "image_url": "",
    "titles": [
      "Revolutionizing OLEDs: New Model Unlocks Longer Lifespan and Brighter Displays"
    ],
    "summary": "Researchers have developed a new analytical model that significantly improves OLED technology, leading to longer lifespan and brighter displays. This advancement in the understanding of OLED mechanisms, particularly around thermally activated delayed fluorescence (TADF) materials, promises enhancements in screen technology across various devices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an improvement in OLED technology, which has widespread implications for various devices. It provides useful insights into the new analytical model and its impact on the lifespan and brightness of OLED displays. It also increases awareness about the progress in screen technology and the potential benefits of these advancements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.824,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Okra and Fenugreek Extracts Remove 90% of Water Microplastics: Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 22:27:10 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/natural-plant-extract-removes-up-to-90-of-microplastics-from-water/\" rel=\"nofollow\" title=\"Natural Plant Extract Removes up to 90% of Microplastics From Water\"><img alt=\"Water Pollution Sample Microplastics\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Water-Pollution-Sample-Microplastics-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers found that natural polymers derived from okra and fenugreek are highly effective at removing microplastics from water. The..."
    ],
    "image_url": "",
    "titles": [
      "Natural Plant Extract Removes up to 90% of Microplastics From Water"
    ],
    "summary": "Researchers discovered that natural polymers from okra and fenugreek can remove up to 90% of microplastics from water. This finding highlights a potential eco-friendly solution for reducing microplastic pollution in water sources.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a potential solution to the problem of microplastic pollution in water sources. It provides actionable insights by highlighting the use of natural polymers from okra and fenugreek, and contributes to the reader's understanding of eco-friendly methods to address environmental issues.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.817,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.415
  },
  {
    "title": "Trump's Asbestos Support Sparks Controversy Amid Health Risks",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 21:07:40 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "President Donald Trump has supported use of asbestos in the past and blamed the mob for its bad reputation."
    ],
    "image_url": "https://media.wired.com/photos/6852b9af543a343be2109a9c/master/pass/GettyImages-2046993639.jpg",
    "titles": [
      "The EPA Plans to ‘Reconsider’ Ban on Cancer-Causing Asbestos"
    ],
    "summary": "Former President Donald Trump has previously expressed support for the use of asbestos, attributing its negative reputation to the mob. This stance highlights Trump's controversial view on a substance widely recognized for its health risks, including causing cancer.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the controversial views of a public figure on a health-related issue, providing some context about the health risks associated with asbestos. However, it does not provide actionable insights or report on solutions or improvements, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.794,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.388
  },
  {
    "title": "Study Finds Best Non-Drug Therapies for Knee Osteoarthritis",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 20:00:21 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Knee osteoarthritis is often treated via non-drug therapies, and now we have an idea of which ones work best"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/18155409/SEI_255987611.jpg",
    "titles": [
      "The best non-drug therapies to relieve the pain of knee osteoarthritis"
    ],
    "summary": "Recent research has identified the most effective non-drug therapies for knee osteoarthritis. These include physical therapy, weight management, and specific exercises designed to reduce pain and improve mobility. The study provides a comprehensive comparison of various treatments, highlighting those that offer the greatest benefits for individuals suffering from this condition.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it provides readers with actionable insights and deeper understanding of non-drug therapies for knee osteoarthritis. It reports on the progress made in identifying effective treatments, empowering readers with knowledge that could potentially improve their health or decision-making.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.76,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.414
  },
  {
    "title": "Leaders Overlook Current AI Issues Amid Future Threat Focus",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Tech CEOs and politicians alike are preparing for the day that superintelligent AI takes over, whilst failing to deal with the issues in front of them – from copyright to autonomous killing machines"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/17164816/SEI_255746823.jpg",
    "titles": [
      "Forget superintelligence – we need to tackle 'stupid' AI first"
    ],
    "summary": "Tech CEOs and politicians are focusing on the potential future threat of superintelligent AI dominating, yet they are currently neglecting immediate concerns, including copyright issues and the development of autonomous killing machines. This indicates a gap in addressing present-day problems while preparing for future AI challenges.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insight into the current state of AI development and the overlooked problems. However, it does not report on any solutions or improvements, nor does it offer actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.744,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.378
  },
  {
    "title": "Study Unveils Key to Dogrose Reproduction Through Chromosome Research",
    "domain": "science",
    "location": "global",
    "published": "Wed, 18 Jun 2025 17:25:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "An international research team has achieved a significant breakthrough in research into the reproduction of dogrose. The study, which has now been published in Nature, shows how differences in the size of the centromeres—the central docking sites for chromosomes—play a decisive role in the extraordinary chromosome inheritance of these plants."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/the-seemingly-impossib-1.jpg",
    "titles": [
      "The seemingly impossible reproduction of dogroses hinges on a centromere trick"
    ],
    "summary": "An international research team published a study in Nature revealing a breakthrough in understanding dogrose reproduction. They discovered that variations in the size of centromeres, crucial for chromosome docking, significantly influence the plant's unique chromosome inheritance. This finding sheds light on the genetic mechanisms behind dogrose reproduction.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant scientific breakthrough, providing readers with a deeper understanding of dogrose reproduction. It highlights progress in the field of genetics and could potentially empower further research and innovation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.799,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.412
  }
]