[
  {
    "title": "EU-US Summit Sparks Talks on Ukraine Security; Trump Rules Out US Troops",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 14:56:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Financial Times",
      "Al Jazeera",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Foreign Minister Sergey Lavrov says discussing Ukraine security issues without Russia is a &#039;road to nowhere&#039;.",
      "As the possibility of direct talks between Ukraine's Volodymyr Zelenskyy and Russia's Vladimir Putin rises, European defense leaders discussed security guarantees and confirmed their support for Kyiv. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWVl3WkF0ekN3Sk9Sdk1wNDRwT2pSZC0wVXh6UmN1UFctWnMtVU9pWXJFWUFyZmNMcmlncDRTY1ZPNHhvUmQxb2RKMlVBU1ltdmdDQTJ2TWZUczRoRWhESTF5QUI4di1lRjF0UjhZMmZUYWZEb3VDODhlMF9JcjhSbDItNmU?oc=5\" target=\"_blank\">MAGA isolationists brace for details of Ukraine ",
      "Demand from foreign minister Sergei Lavrov would give Moscow an effective veto over efforts to defend Kyiv",
      "<p>Foreign minister Sergei Lavrov dismisses European diplomacy as ‘clumsy effort to sway Trump’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/20/donald-trump-ukraine-support-peace-deal-russia-nato-latest-updates-news\">Russia-Ukraine war – live updates</a></p></li></ul><p>Mos"
    ],
    "image_url": "",
    "titles": [
      "Russia says talks on Ukraine security guarantees must include Moscow",
      "Ukraine: NATO defense chiefs talk security guarantees",
      "MAGA isolationists brace for details of Ukraine security guarantees - Axios",
      "Russia says it must be included in any Ukraine security guarantees",
      "Russia says it must be part of international talks on Ukraine’s security"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.975,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.844,
    "summary": "After the EU-US summit on Russia's war against Ukraine, discussions are ongoing in Germany regarding its role in providing security guarantees to prevent future Russian aggression against Ukraine. Senator Marco Rubio is set to lead efforts on Ukraine's security guarantees. Amidst these developments, former President Donald Trump has indicated that European countries will provide security guarantees to Ukraine, in coordination with the U.S., but ruled out sending U.S. troops to enforce any potential peace deal with Russia. Trump also warned of a \"rough situation\" for Putin if he does not cooper",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 96 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump-Appointed Regulator Accuses Fed's Brainard of Mortgage Fraud",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 13:36:11 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "MarketWatch",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.ft.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5jUlRSVWNJZkQ0Vkl3QzgwcnluWVQxTU5xZDhjejc3eXpSSFZqVU9jQWxkYlVxOVhyd094WXptOVc2TW0wTXAxT2R5VmJ6WFJnRWstTDdIbHhFOXlmQ1BUTDBsYkFseDYyZndqOFRjQWNrSk02cHpJ?oc=5\" target=\"_blank\">Trump housing regulator accuses Fed governor Cook of mortgage fraud",
      "Trump has targeted the Federal Reserve and its chairman, Jerome Powell, as he pressures the central bank to slash interest rates.",
      "President’s ally Bill Pulte asked for a probe into the official over alleged wrongdoing on personal mortgages",
      "Cook is one of 12 voting members of the Federal Open Market Committee, which sets benchmark interest rates."
    ],
    "image_url": "",
    "titles": [
      "Trump housing regulator accuses Fed governor Cook of mortgage fraud - Axios",
      "Trump housing regulator Pulte says Fed's Cook should resign or be fired over mortgage fraud claims",
      "Trump calls on Fed governor Lisa Cook to resign",
      "Trump calls on Fed’s Cook to resign as administration heightens focus on mortgage fraud"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.928,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "A Trump-appointed housing regulator has accused Federal Reserve Governor Lael Brainard of mortgage fraud, amid broader pressure from Trump on the Federal Reserve to cut interest rates. Bill Pulte, an ally of Trump, requested an investigation into Brainard, who is a key figure in setting interest rates as one of the 12 voting members of the Federal Open Market Committee.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Julio César Chávez Jr. Deported to Mexico, Faces Crime Charges",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 11:54:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "LA Times",
      "Sportsnet"
    ],
    "domains": [
      "www.latimes.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Julio César Chávez Jr., 39, arrested days after his fight with Jake Paul, has been deported to Mexico, where he's wanted for alleged cartel ties, following his detention in the U.S. for allegedly overstaying his visa and lying on a green card application.",
      "<p>Julio César Chávez Jr., son of the legendary Mexican boxer, has been deported to Mexico, where authorities say he faces charges of organized crime affiliation and arms trafficking.</p>",
      "<p>Boxer Julio César Chávez Jr. has been deported to Mexico, where he&#8217;s wanted for alleged cartel ties, following his arrest in the U.S. for overstaying his visa and lying on a green card application.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chávez deported to Mexico for alleged cartel ties",
      "Boxer Julio César Chávez Jr. deported to Mexico",
      "Julio Cesar Chavez Jr. deported for alleged cartel ties, drug trafficking"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.995,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary": "Julio César Chávez Jr., 39, was deported to Mexico after being detained in the U.S. for visa issues and allegedly lying on a green card application. In Mexico, he faces charges related to organized crime, including arms and drug trafficking. This legal action follows shortly after his fight with Jake Paul.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/mexico.svg",
      "thumbnail": "icons/mexico.svg",
      "alt": "mexico flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hurricane Erin Triggers Emergency in North Carolina, Evacuations Ordered",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 20 Aug 2025 11:20:15 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The National Hurricane Center is urging beachgoers to stay out of the water. Parts of North Carolina's Outer Banks are under mandatory evacuation orders.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNdElRUm0xVnFORlNlQmNaQW5KblJlSjd6c081N2t0eUpiUTcwNlpybUZMVlBNVXBLT3J4dWptQU02OF8zUm9NYVBhVEtjWFRHTzZ5WEliOEF1c2IxNlJRYkxlaTJjNlRBX1VJaTg2MDY1aUNyYTI1NEl1MF9jZ3dZX3Q1MTFFT3RRNkE?oc=5\" target=\"_blank\">N.C., Virginia under Hurricane Erin stor",
      "Hurricane Erin has triggered a state of emergency in North Carolina, where residents and visitors along the Outer Banks are under evacuation orders."
    ],
    "image_url": "",
    "titles": [
      "Swimmers are warned to avoid East Coast beaches as Hurricane Erin moves north",
      "N.C., Virginia under Hurricane Erin storm alerts, some East Coast beaches shut - Axios",
      "Hurricane Erin live updates: NC under state of emergency, Northeast beaches close"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary": "Hurricane Erin has led to a state of emergency in North Carolina, specifically affecting the Outer Banks region. Authorities have issued mandatory evacuation orders for the area and are advising beachgoers to avoid entering the water. The National Hurricane Center is actively monitoring the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Israel Approves Major Settlement Expansion in West Bank's E1 Area",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 13:14:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "ottawa.citynews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "Location of E1 is significant because it is one of the last geographical links between Bethlehem and Ramallah.",
      "The plan aims to enlarge an Israeli settlement by building thousands of new apartments in the West Bank. Critics say this would essentially split the Palestinian territory and make any two-state solution untenable.",
      "TEL AVIV, Israel (AP) — Israel gave final approval Wednesday for a controversial settlement project in the occupied West Bank that would effectively cut the territory in two, and that Palestinians and rights groups say could destroy hopes for a future Palestinian state. Settlement development in E1,"
    ],
    "image_url": "",
    "titles": [
      "Israel approves illegal settlement plan that would split occupied West Bank",
      "Israel approves controversial West Bank settlement plan",
      "Israel approves settlement project that could divide the West Bank"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.095,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Israel has granted final approval for a significant settlement expansion in the E1 area of the occupied West Bank, planning to build thousands of new apartments. This development is controversial because it is located in a critical area that connects Bethlehem and Ramallah, and critics argue it could split Palestinian territory in two, undermining the feasibility of a two-state solution. This move has drawn criticism from Palestinians and human rights groups, who believe it could jeopardize the prospects for a future Palestinian state.",
    "constructiveness_score": 0.095,
    "constructiveness_reason": "2 constructive keywords out of 84 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Herat Bus Crash and Fire Kill About 80 in Afghanistan",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 15:41:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Around 80 people have been killed in a bus crash that caught fire in Afghanistan’s Herat province.",
      "Local authorities said the bus had returned from Iran when it collided with a motorbike and then a truck that was laden with fuel in western Afghanistan.",
      "Only two people survived the Afghanistan bus crash, an Interior Ministry official said. The highway in Herat is one of country’s most dangerous routes."
    ],
    "image_url": "",
    "titles": [
      "Bus crash fire kills dozens of Afghans deported from Iran",
      "Bus crash kills dozens of Afghans deported from Iran",
      "At least 79 dead after bus crashes carrying Afghans deported from Iran"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "In Afghanistan's Herat province, a bus crash involving a collision with a motorbike followed by a truck carrying fuel resulted in approximately 80 fatalities. The bus, returning from Iran, caught fire after the accidents. Only two individuals survived the incident, as confirmed by an Interior Ministry official. The highway in Herat, known for its danger, was the site of the tragic event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens",
    "image": {
      "src": "icons/afghanistan.svg",
      "thumbnail": "icons/afghanistan.svg",
      "alt": "afghanistan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Israel to Mobilize 80,000 for Offensive Amid Ceasefire Talks, ICRC Warns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 14:51:59 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Troops are already operating in some areas ahead of the planned operation, which the ICRC says will worsen \"an already catastrophic situation\".",
      "Israel&#039;s military says it will call up 60,000 reservists and lengthen the service of an additional 20,000 reservists.",
      "<p>Call-up notices sent as Israeli plans to increase its offensive; Israel studies Hamas’ response to proposal for 60-day ceasefire</p><p><strong>Israel is “killing all prospects” for peace in the Middle East, Jordan’s foreign minister has said amid escalating international outrage over Israel’s pla"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b217/live/389e9e70-7db4-11f0-a34f-318be3fb0481.jpg",
    "titles": [
      "Israel calls up 60,000 reservists ahead of planned Gaza City offensive",
      "Israel to call up 60,000 reservists in plan to expand war, seize Gaza City",
      "Israel to call up around 60,000 reservists before planned offensive on Gaza City, says Israeli military official – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.953,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary": "Israel's military is mobilizing for an increased offensive, planning to call up 60,000 reservists and extend the service of another 20,000. This move comes as Israel evaluates Hamas' response to a proposed 60-day ceasefire. The International Committee of the Red Cross (ICRC) warns that the operation will exacerbate an already dire humanitarian situation. Amidst these developments, Jordan's foreign minister accuses Israel of undermining peace prospects in the Middle East, reflecting growing international concern over the escalation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 81 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Red Roses Unchanged for 2025 World Cup Opener Against USA in Sunderland",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 13:00:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "England have named an unchanged starting XV for Friday's opening game of the Women's Rugby World Cup against the United States in Sunderland.",
      "<ul><li><p>Scarratt to win 119th cap at Stadium of Light in fifth World Cup</p></li><li><p>Mitchell’s side unchanged from warm-up win over France</p></li></ul><p>England have named a full-strength side to open their Rugby World Cup campaign against the USA on Friday, with Emily Scarratt in line to w",
      "England Red Roses head coach John Mitchell has revealed his side to begin their home 2025 Women's Rugby World Cup campaign against the USA in Sunderland on Friday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a1f9/live/aac0d650-7dc1-11f0-a512-25ed1ee64338.jpg",
    "titles": [
      "England name unchanged XV for World Cup opener",
      "England Women at full strength for Rugby World Cup opener against the USA",
      "Aldcroft to lead Red Roses from back row for Women's Rugby World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary": "England's Women's Rugby team, the Red Roses, will start their 2025 World Cup campaign with an unchanged lineup from their warm-up victory over France. The match against the United States will take place in Sunderland. Emily Scarratt is set to earn her 119th cap in what will be her fifth World Cup appearance. Head coach John Mitchell announced the full-strength side, signaling a confident approach to the tournament's opening game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "usa flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Bright Meteor Lights Up Night Sky Over Southern Japan",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 08:12:18 -0400",
    "source": "ABC News",
    "sources": [
      "Washington Post",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.washingtonpost.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A fireball was caught on multiple cameras lighting up the night skies in southern Japan on Tuesday evening.",
      "<p>Flash of light visible for hundreds of miles was an exceptionally bright meteor, say experts</p><p>A huge fireball dashed across the skies of western Japan, shocking residents and dazzling stargazers, though experts said it was a natural phenomenon and not an alien invasion.</p><p>Videos and phot",
      "The fireball, widely believed to be an exceptionally bright meteor, shot through the sky just after 11 p.m., turning the sky bright white for a moment."
    ],
    "image_url": "https://s.abcnews.com/images/International/250820_abc_social_japan_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Fireball streaks through skies over Japan",
      "Fireball lights up sky over western Japan",
      "Spectacular fireball streaks across western Japan, lighting up night sky"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary": "A fireball, identified as an exceptionally bright meteor by experts, illuminated the night skies in southern Japan on Tuesday evening, shortly after 11 p.m. The phenomenon, captured by multiple cameras, turned the sky bright white momentarily, causing excitement and shock among residents and stargazers. Despite the spectacle, experts confirmed it as a natural occurrence, dismissing any speculation of an alien invasion. The flash of light was visible for hundreds of miles, highlighting the meteor's significant brightness and impact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 80 tokens",
    "image": {
      "src": "icons/japan.svg",
      "thumbnail": "icons/japan.svg",
      "alt": "japan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Air Canada to Reimburse Passengers for Cancellations Amid Work Stoppage",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 15:39:39 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "Airline to cover transportation expenses of customers whose flights were cancelled",
      "Air Canada says it plans to announce a new &#8220;exceptional policy&#8221; in which the company will cover transportation expenses incurred by customers while getting to their destinations during the recent work stoppage. The airline said it would share details about the policy on Wednesday. Howeve"
    ],
    "image_url": "",
    "titles": [
      "Air Canada set to announce new expenses policy for disrupted passengers",
      "Air Canada restart continues to ramp up, announces new expenses policy for passengers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.095,
      "proximity": 1.0
    },
    "score": 0.719,
    "summary": "Air Canada has announced an upcoming \"exceptional policy\" to reimburse transportation expenses for customers affected by flight cancellations during a recent work stoppage. The airline will disclose the policy details on Wednesday, aiming to support passengers in reaching their destinations amidst disruptions.",
    "constructiveness_score": 0.095,
    "constructiveness_reason": "1 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Delays TikTok Ban Amid Claims of Election Benefit; White House Joins App",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-20T01:12:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "TechCrunch",
      "Global News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "globalnews.ca",
      "techcrunch.com"
    ],
    "snippets": [
      "The popular China-based video sharing app has been facing a US ban over security concerns, although President Donald Trump has continued to extend the deadline.",
      "The first video posted to the account shows footage of Trump declaring, 'Every day, I wake up determined to deliver a better life for the people all across this nation.'",
      "The White House joined TikTok, despite ongoing legal battles surrounding the use of the Chinese-owned app."
    ],
    "image_url": "",
    "titles": [
      "US: White House launches official TikTok account",
      "‘America we are BACK!’ White House launches official TikTok account",
      "The White House is on TikTok now, which is technically banned in the U.S."
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.732,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary": "Despite security concerns over its Chinese ownership, TikTok continues to operate in the U.S. after President Donald Trump delayed implementing a law signed by his predecessor, Joe Biden, which mandates ByteDance to sell its stake in TikTok or face a ban. Trump, who has postponed the decision three times, has softened his stance towards the app, believing it contributed to his 2024 election success. Meanwhile, the White House has launched an official TikTok account, indicating a further shift in the administration's approach to the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 87 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Richardson's Agent Disappointed After Colts Name Jones Starting QB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 11:54:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Anthony Richardson Sr.'s agent reacted with disappointment with the Colts' decision to name Daniel Jones the starting quarterback and said he's unsure of his client's future with the team.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQZU1MWHdHSlBnYTNVSnB4LUl2YlYyYVlsYXAwOUtTQWtyY0hJck9DRDBCeFI1V3FxcUNsM1FSV0FlNWNRRERuUGMzMTZfdmV6dXhDUTEyN2Q3cWt2cHpPMDRITjRBeldna0JiYmdkWUQ4R3k4U3BYREdkekZ6OEdPdDRRb01HT0FlM2IwdVZpRmlWbm9k?oc=5\" target=\"_blank\">Anthony Richardson's Agent "
    ],
    "image_url": "",
    "titles": [
      "Agent unsure of Richardson's future with Colts",
      "Anthony Richardson's Agent Sends Strong Message to Colts After Daniel Jones Decision - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary": "Anthony Richardson Sr.'s agent expressed disappointment following the Colts' decision to name Daniel Jones as the starting quarterback. He indicated uncertainty about Richardson's future with the team and mentioned that there is \"a lot to discuss\" with the Colts, as reported to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Pakistan, China, Afghanistan Boost Anti-Terrorism, Economic Ties",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 15:20:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "Mining, Belt and Road participation feature in trilateral meetings between China, Afghanistan and Pakistan in Kabul.",
      "ISLAMABAD (AP) &#8212; Top diplomats from Pakistan,China and Afghanistan committed their countries to stronger anti-terrorism cooperation during a meeting Wednesday in Kabul aimed at boosting political and economic partnership, Pakistan&#8217;s foreign ministry said. The three sides also &#8220;reaf"
    ],
    "image_url": "",
    "titles": [
      "China FM in Afghanistan, offers to deepen cooperation with Taliban rulers",
      "Pakistan, China and Afghanistan hold high-level meeting in Kabul to boost cooperation"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.163,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary": "During a trilateral meeting in Kabul, top diplomats from Pakistan, China, and Afghanistan agreed to enhance anti-terrorism cooperation and strengthen their political and economic partnerships. This commitment includes a focus on mining and participation in China's Belt and Road Initiative, aiming to boost regional stability and development.",
    "constructiveness_score": 0.163,
    "constructiveness_reason": "2 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "china flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Kai Havertz Injury Concerns Arsenal, Club Considers Striker Options",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 14:06:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Germany forward could be absent for extended period</p></li><li><p>Injury leaves Viktor Gyökeres as only fit striker at club</p></li></ul><p>Arsenal are assessing a knee injury suffered by Kai Havertz and could attempt to bring in a replacement if the Germany forward faces a lengthy spell",
      "Kai Havertz is currently being assessed over a knee injury"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f0763b4b67b72bd319eb9f2689d7fd508aeab8f3/201_1383_4917_3931/master/4917.jpg?width=140&quality=85&auto=format&fit=max&s=36eb5bc696cd8dd8a2fe94612ceb3824",
    "titles": [
      "Arsenal could attempt to sign striker after Kai Havertz picks up knee injury",
      "Arsenal's Havertz being assessed over knee injury"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Kai Havertz, a forward for Germany, is under assessment for a knee injury, potentially sidelining him for an extended period. This situation leaves Viktor Gyökeres as the only fit striker at their club. Arsenal is considering seeking a replacement if Havertz's injury leads to a lengthy absence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Brentford Declines Newcastle's £40M Bid for Striker Wissa",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 15:50:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Brentford turn down Newcastle's improved bid of £40m for DR Congo striker Yoane Wissa.",
      "Newcastle have made a new bid worth &#163;35m plus add-ons for Brentford's Yoane Wissa."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cb03/live/b4916630-7dd1-11f0-b91c-9f76f5e8e93d.jpg",
    "titles": [
      "Brentford reject new £40m Newcastle bid for Wissa",
      "Newcastle make initial £35m bid for Brentford's Wissa"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Brentford rejected Newcastle's enhanced offer of £40 million for DR Congo striker Yoane Wissa. This followed Newcastle's initial bid of £35 million plus add-ons. The current status is that Wissa remains a Brentford player as the latest bid was not accepted.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Google Unveils Pixel 10 Series with G5, Qi2 Upgrades; Starts at $799",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-20T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Google has formally announced the Pixel 10, 10 Pro, and 10 Pro XL, and their hardware upgrades can be summed up in two letter/number combinations: G5 and Qi2. Otherwise, there's not much to see on the outside of the phones. They mostly cost the same as last year's devices - $799 for the Pixel 10, [&",
      "The phone's new gearless hinge allows for a larger outer display with smaller bezels, and the hinge is two times more durable than the one of the Pixel 9 Pro Fold."
    ],
    "image_url": "",
    "titles": [
      "The Google Pixel 10 and 10 Pro come with magnets, a new chip, and AI everywhere",
      "Google unveils its $1,799 Pixel 10 Pro Fold"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "Google has launched the Pixel 10, 10 Pro, and 10 Pro XL, featuring hardware upgrades identified as G5 and Qi2, with minimal external changes. The devices are priced starting at $799, consistent with last year's models. A notable improvement includes a new gearless hinge on the Pixel 10 Pro XL, offering a larger outer display and enhanced durability, doubling that of the Pixel 9 Pro Fold's hinge.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Requests Fed Governor Lisa Cook's Resignation Amid Fraud Accusations",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 15:05:16 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Ally of the president has accused the first Black woman to sit on the central bank’s board of mortgage fraud</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates\">US politics live – late",
      "WASHINGTON (AP) &#8212; President Donald Trump on Wednesday called on Federal Reserve governor Lisa Cook to resign after a member of his administration accused Cook of committing mortgage fraud. Bill Pulte, director of the agency that oversees mortgage giants Fannie Mae and Freddie Mac, urged the Ju"
    ],
    "image_url": "https://i.guim.co.uk/img/media/e9cd3c74ea983950edbef75cf686be4b46c78831/499_0_5001_4000/master/5001.jpg?width=140&quality=85&auto=format&fit=max&s=69a0126ac824873946e24afdd1a5784b",
    "titles": [
      "Trump calls on Federal Reserve governor Lisa Cook to resign, renewing attack on central bank",
      "Trump calls on Federal Reserve official to resign after ally accuses her of mortgage fraud"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary": "President Donald Trump has requested the resignation of Federal Reserve governor Lisa Cook following accusations of mortgage fraud by Bill Pulte, a director overseeing Fannie Mae and Freddie Mac. Cook, the first Black woman on the central bank's board, faces allegations from a Trump administration ally, marking a significant controversy within US politics and the financial regulatory sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 59 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Blue Jays, Royals, Cardinals, and Others Clinch Wins; Key Players Shine",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 15:24:02 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Wednesday's 14-game schedule",
      "<p>George Springer and Alejandro Kirk crushed a pair of two-run HRs, and Max Scherzer delivered another quality start, allowing one run over six innings as the Toronto Blue Jays defeated the Pittsburgh Pirates 7-3.</p>",
      "<p>Vinnie Pasquantino hit a homer in the first inning and then scored the go-ahead run in the seventh when Jonathan India was hit by a pitch with the bases loaded, helping the Kansas City Royals to a 5-2 win over the Texas Rangers.</p>",
      "<p>Tyler Saggese went 3-for-4 and scored two runs, Ivan Herrera had three RBIs, and the St. Louis Cardinals defeated the Miami Marlins 7-4.</p>",
      "<p>Willi Castro hit a three-run bomb, Canadian Owen Caissie launched his first career MLB home run, and the Chicago Cubs took a 6-4 win over the Milwaukee Brewers.</p>",
      "<p>Michael Busch drove in a pair of runs, Jameson Taillon pitched six solid innings, and the Chicago Cubs took Game 2 of a doubleheader with the Milwaukee Brewers 4-1.</p>",
      "<p>Alex Call and Shohei Ohtani each hit solo shots, Emmet Sheehan struck out seven batters in six innings, and the Los Angeles Dodgers cruised to an 11-4 win over the Colorado Rockies.</p>",
      "<p>J.T. Realmuto hit a late go-ahead two-run shot, Kyle Schwarber smacked his 44th HR of the season, and Cristopher Sanchez struck out 12 over 6.1 innings as the Philadelphia Phillies defeated the Seattle Mariners 6-4.</p>",
      "<p>Nick Pivetta threw 10 strikeouts in six innings to lead the San Diego Padres to a 5-1 win against the San Francisco Giants.</p>",
      "<p>Ryan Mountcastle hit an RBI single and scored in a three-run fifth inning, and Sam Bassalo came off the bench to drive in the game-winning run in extras as the Baltimore Orioles edged the Boston Red Sox 4-3.</p>",
      "<p>Hunter Greene struck out 12 over 6.1 innings, and TJ Friedl and Gavin Lux drove in a pair of runs off Kenley Jansen in the ninth to lift the Cincinnati Reds past the Los Angeles Angels 6-4.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/20/37094f5a-8b51-4f07-aac9-0fb278dfd1ce/chris-bassitt.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Blue Jays starter against Pirates",
      "MLB Highlights: Blue Jays 7, Pirates 3",
      "MLB Highlights: Royals 5, Rangers 2",
      "MLB Highlights: Cardinals 7, Marlins 4",
      "MLB Game 1 Highlights: Cubs 6, Brewers 4",
      "MLB Game 2 Highlights: Cubs 4, Brewers 1",
      "MLB Highlights: Dodgers 11, Rockies 4",
      "MLB Highlights: Phillies 6, Mariners 4",
      "MLB Highlights: Padres 5, Giants 1",
      "MLB Highlights: Orioles 4, Red Sox 3 (F/11)",
      "MLB Highlights: Reds 6, Angels 4"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "The Toronto Blue Jays, Kansas City Royals, St. Louis Cardinals, Chicago Cubs, Los Angeles Dodgers, Philadelphia Phillies, San Diego Padres, Baltimore Orioles, and Cincinnati Reds all secured wins in their respective games. Key performances included George Springer and Alejandro Kirk's two-run homers for the Blue Jays, Vinnie Pasquantino's early homer and decisive run for the Royals, and strong pitching from Max Scherzer, Emmet Sheehan, Cristopher Sanchez, and Hunter Greene. The Cubs won both games of their doubleheader against the Brewers, with notable home runs from Willi Castro and Owen Cais",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 93 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "July Inflation Rise Dims Hopes for Bank of England Rate Cut",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 14:37:24 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Economists say figure casts doubt on prospect of further BoE rate cuts this year",
      "<p>Fuel and air fares also pushed up annual July rate, making interest rate cuts less likely this year</p><ul><li><p><a href=\"https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year\">Rail fares in England expected to rise by 5.8% next year</a></p></li><li><p><a href=\"https"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbea6e338-6475-4ca4-ad55-1fed1742deee.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK inflation rises more than expected to 3.8% in July",
      "UK inflation rises by more than expected to 3.8% amid higher food prices"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Economists believe the increase in the annual July rate, influenced by higher costs for fuel and air fares, casts doubt on the likelihood of the Bank of England reducing interest rates this year. Additionally, rail fares in England are projected to rise by 5.8% next year, further contributing to the economic outlook. This combination of factors suggests that interest rate cuts are less probable in the current year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "england flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Six Fighters Earn UFC Contracts in First Two Weeks of DWCS",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 02:07:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "In just two weeks six contracts have been handed out at 'DWCS.\"",
      "<p>Dana White was pleased with the results on Week 2 of the Contender Series, with four fights ending with a knockout and all five winners rewarded with UFC contracts.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Dana White's Contender Series' Week 2: Four KOs, five contracts awarded",
      "Four knockouts on Week 2 of Dana White’s Contender Series"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.642,
    "summary": "Over the first two weeks of the 'Dana White's Contender Series' (DWCS), six contracts have been awarded to fighters. In the second week, Dana White expressed satisfaction as four out of five fights concluded with knockouts. Consequently, all five winners from Week 2 were granted UFC contracts, highlighting a successful series of matches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Michael Fiddelke Named New CEO of Target Amid Sales Slump",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 13:39:38 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Fiddelke will take over as Target CEO as the big-box retailer tries to win back both customers and investors after roughly four years of stagnant sales.",
      "Michael Fiddelke joined Target as an intern while studying for an MBA. He's since worked in merchandising, finance, operations, and human resources."
    ],
    "image_url": "",
    "titles": [
      "Target names longtime insider Michael Fiddelke its next CEO as retailer tries to break sales and stock slump",
      "Who is the new Target CEO, Michael Fiddelke?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Michael Fiddelke has been appointed as the new CEO of Target, following a period of approximately four years of stagnant sales at the retail giant. Fiddelke, who began his career at Target as an intern while pursuing an MBA, has gained extensive experience across various departments including merchandising, finance, operations, and human resources. His appointment is part of Target's strategy to rejuvenate its business and attract both customers and investors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Arctic Sea Ice Melting Rate Slows, Stable Since 2005 Despite Warming",
    "domain": "science",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 08:00:17 GMT",
    "source": "The Guardian",
    "sources": [
      "Phys.org",
      "The Guardian"
    ],
    "domains": [
      "phys.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Natural climate variation is most likely reason as global heating due to fossil fuel burning has continued</p><p>The melting of sea ice in the Arctic has slowed dramatically in the past 20 years, scientists have reported, with no statistically significant decline in its extent since 2005.</p><p>T",
      "Arctic sea ice has been melting at a slower rate for the past 20 years, despite human-induced global warming."
    ],
    "image_url": "https://i.guim.co.uk/img/media/8f5facb401e0c30508ca2a636df0908cb12c42b8/429_0_4294_3435/master/4294.jpg?width=140&quality=85&auto=format&fit=max&s=595936715668b14d68cc1ef18755bc1e",
    "titles": [
      "Dramatic slowdown in melting of Arctic sea ice surprises scientists",
      "Study finds temporary slowdown in melting of Arctic sea ice"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.826,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary": "Scientists report that the rate of Arctic sea ice melting has significantly slowed over the past 20 years, with no notable decline in ice extent since 2005. This change is attributed to natural climate variations, despite ongoing global warming from fossil fuel emissions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/percent.svg",
      "thumbnail": "icons/percent.svg",
      "alt": "rate",
      "credit": "Feather",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Mariners' Robles Suspended 10 Games for Bat Incident, Plans to Appeal",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 20:42:15 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNaEI2cWtyYmNvWmdqaW1QWk55cUVJUW10cVhvN00tUm51RXlBbmJBSmczcDIxUDFtaDVnZFotbUhuc3pMcXFnd21UTW1jTzRuNmJpR3pib0VXa182OTJxeUpNdW5VcXdHeUVKOHV4RTlubUNKaEdpNVZHMU9nM29ROFA0aWNTTTBWckpkQUNXTW9ETERhWWROYw?oc=5\" target=\"_blank\">MLB Suspends Mariners",
      "<p>The Seattle Mariners outfielder was suspended 10 games by MLB on Tuesday for throwing his bat at a pitcher in a triple-A game on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "MLB Suspends Mariners' Victor Robles for Throwing Bat at Pitcher in Wild Ejection - Sports Illustrated",
      "Mariners’ Robles suspended 10 games for throwing bat at pitcher in rehab game"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.653,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary": "The Seattle Mariners outfielder, Robles, has been suspended for 10 games by Major League Baseball (MLB) for throwing his bat at a pitcher during a triple-A game on Sunday. Robles is expected to appeal the suspension, which is required to be served at the major league level.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Google Unveils Pixel 10 Lineup, Pixel Watch 4, and AI Updates at Event",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-20T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Google has just announced a bunch of shiny new devices to look at and AI features to yell about. As part of its Made by Google event, the company revealed an upgraded Pixel 10 lineup, a bubblier smartwatch with a brighter screen, and a ton of AI updates that extend across all of its new [&#8230;]",
      "Google&#8217;s annual hardware event kicks off today at 1PM ET, with announcements expected for four new Pixel 10 phones, the Pixel Watch 4, and a new budget pair of Buds 2A. We&#8217;ve already rounded up what to expect from the show, plus a deeper dive into the biggest Pixel 10 leaks and rumors so"
    ],
    "image_url": "",
    "titles": [
      "Google Pixel 10 launch event: the 8 biggest announcements",
      "Made by Google 2025: all the Pixel news and announcements"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.996,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "Google announced new products and AI features at its Made by Google event, including an upgraded Pixel 10 lineup, a new smartwatch with a brighter screen, and comprehensive AI updates. The event also previewed four Pixel 10 phones, the Pixel Watch 4, and budget-friendly Buds 2A, aligning with expectations from prior leaks and rumors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UCSF Scientists Identify Protein Linked to Brain Aging, Potential Treatment Path",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 11:27:58 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists at UCSF have uncovered a surprising culprit behind brain aging: a protein called FTL1. In mice, too much FTL1 caused memory loss, weaker brain connections, and sluggish cells. But when researchers blocked it, the animals regained youthful brain function and sharp memory. The discovery sug",
      "Researchers discovered two brain regions that work as a “neural compass,” keeping people oriented in virtual city navigation. These areas tracked direction consistently, hinting at new ways to detect and monitor neurological disorders that cause disorientation."
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a protein that reverses brain aging",
      "Scientists just found the brain’s secret GPS system"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.985,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "Scientists at UCSF identified a protein, FTL1, as a key factor in brain aging, causing memory loss and weaker brain connections in mice. Blocking FTL1 reversed these effects, suggesting a potential target for treating age-related cognitive decline. Additionally, researchers found two brain regions acting as a \"neural compass\" for orientation in virtual environments. This discovery could lead to new methods for diagnosing and monitoring neurological disorders that impair navigational skills.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "SportsLine, Bruce Marshall Release 2025 College Football Week 0 Picks",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 14:51:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 0 college football schedule",
      "SportsLine's model has revealed its 2025 Week 0 college football picks for Kansas State vs. Iowa State and every other game"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/20/9ed5741e-5124-42aa-af94-f0231c7220c1/bryson-donelson-fresno-getty-images.jpg",
    "titles": [
      "2025 college football Week 0 picks against the spread, odds, lines, trends: Betting expert unveils picks",
      "College football odds, picks, lines, predictions: Model releases top Week 0 best bets for Aug. 23, 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.973,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.463,
    "summary": "SportsLine's model and legendary Vegas handicapper Bruce Marshall have released their picks for Week 0 of the 2025 college football season, including the game between Kansas State vs. Iowa State. This provides bettors with expert insights and predictions for all the Week 0 matchups, aiming to identify the best betting values.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "football",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Space Mission Advances with Successful Data Downlink",
    "domain": "science",
    "source_domain": "science.nasa.gov",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:22:47 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science.nasa.gov"
    ],
    "snippets": [
      "Written by Lucy Thompson, Planetary Scientist and APXS Team Member, University of New Brunswick, Canada Earth Planning Date: Monday, Aug. 18, 2025 The downlink data from our weekend activities arrived on Earth as we started planning this morning. As the APXS payload uplink and downlink lead, I asses",
      "Written by Remington Free, Operations Systems Engineer at NASA’s Jet Propulsion Laboratory Earth planning date: Friday, Aug. 15, 2025 Today we uplinked a three-sol weekend plan with lots of exciting activities — to support both the science and engineering teams!  While usually our science activities"
    ],
    "image_url": "",
    "titles": [
      "Curiosity Blog, Sols 4634-4635: A Waiting Game",
      "Curiosity Blog, Sols 4631-4633: Radiant Ridge Revolution"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.648,
      "consensus": 0.35,
      "constructiveness": 0.141,
      "proximity": 0.5
    },
    "score": 0.412,
    "summary": "On August 15, 2025, NASA's Jet Propulsion Laboratory uplinked a three-sol weekend plan filled with activities aimed at supporting both the science and engineering teams of a space mission. Following this, on August 18, 2025, Lucy Thompson, a Planetary Scientist and APXS Team Member from the University of New Brunswick, Canada, reported the successful arrival of downlink data from these weekend activities. The data arrival marked the beginning of a new planning phase, indicating progress in the mission's operations and research objectives.",
    "constructiveness_score": 0.141,
    "constructiveness_reason": "3 constructive keywords out of 85 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]