[
  {
    "title": "Seahawks Expect Nick Emmanwori to Play in Super Bowl LX After Ankle",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 5 Feb 2026 14:30:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sky Sports",
      "Sportsnet",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "skysports.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "The Seahawks \"fully expect\" Nick Emmanwori to play in Super Bowl LX after he left practice yesterday with an ankle injury, coach Mike Macdonald said Thursday.",
      "Emmanwori was limited during Wednesday's practice",
      "The Seattle Seahawks are expected to have Nick Emmanwori available for Sunday's Super Bowl despite a late injury scare for the star defender.",
      "Safety Nick Emmanwori is expected to play in Super Bowl LX despite injuring his ankle in Wednesday’s practice.",
      "Seattle's star rookie suffered a low ankle sprain and is expected to miss practice. What coach Mike Madconald said about his Super Bowl 60 status.",
      "Seahawks rookie safety Nick Emmanwori injured his ankle at practice on Wednesday, but he downplayed any concern about it impacting his availability for Super Bowl LX when he spoke to reporters on Thursday.",
      "Emmanwori, whom the Seahawks selected out of South Carolina in the second round of last year's draft, has started the past 10 games for Seattle, including the playoffs.",
      "Asked about the availability of his versatile rookie defensive back for the Super Bowl, Bryant’s answer should put Seahawks fans at ease.",
      "Seahawks Safety Nick Emmanwori Injured at Practice Prior to Super Bowl LX Sports Illustrated",
      "Rest easy, Seahawks fans. It looks like Nick Emmanwori is in good shape to play in the Super Bowl."
    ],
    "image_url": "",
    "titles": [
      "Seahawks 'fully expect' Emmanwori to play in SB",
      "Nick Emmanwori injury: Seahawks rookie hurts ankle in practice, coach 'confident' he will play in Super Bowl",
      "Seahawks star expected to play at Super Bowl after injury scare",
      "Seahawks expect safety Nick Emmanwori to play in Super Bowl LX",
      "Nick Emmanwori injury update: Seahawks safety has low ankle sprain",
      "Nick Emmanwori: I'll be good to go on Sunday",
      "Seahawks S Nick Emmanwori suffered ankle sprain in practice but says he'll 'be good to go' for Super Bowl 60",
      "Seahawks Coby Bryant on Nick Emmanwori: ’He’s good’ for Super Bowl 2026",
      "Seahawks Safety Nick Emmanwori Injured at Practice Prior to Super Bowl LX - Sports Illustrated",
      "Super Bowl 2026: Mike Macdonald has positive news on Seahawks safety Nick Emmanwori"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47840494/seahawks-fully-expect-nick-emmanwori-ankle-play-sb-lx",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/nick-emmanwori-injury-seahawks-patriots-super-bowl-2026/",
      "https://www.skysports.com/nfl/news/12040/13503817/super-bowl-2026-nick-emmanwori-expecting-to-play-at-super-bowl-after-seattle-seahawks-star-suffers-injury-scare",
      "https://sports.yahoo.com/articles/nick-emmanwori-injury-seahawks-safety-191811873.html",
      "https://sports.yahoo.com/articles/nick-emmanwori-ill-good-sunday-195055110.html",
      "https://sports.yahoo.com/nfl/breaking-news/article/seahawks-s-nick-emmanwori-suffered-ankle-sprain-in-practice-but-says-hell-be-good-to-go-for-super-bowl-60-193917949.html",
      "https://sports.yahoo.com/articles/seahawks-coby-bryant-nick-emmanwori-172418055.html",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNOEtmRTFocW1YeHNCYXFXN1JwYVJMa0V6LVd5Y21Ya3JkNXA3YzNxTkp0UWVsM0Frazg0WGZXd004Q0xuMVgxSUstSS1abk1KbVZQem8zMzFDTHBaMklpYTVBVnN6YmVialgwTXVObVhnNjZIWVNGT1lVeEwtMXg3QzhLU1k5MjlPOUhmcWJYMTR6Q2NLaVhqUHVuSkFFc2dLSk9qR3pn?oc=5",
      "https://sports.yahoo.com/articles/super-bowl-2026-mike-macdonald-185207160.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47840494/seahawks-fully-expect-nick-emmanwori-ankle-play-sb-lx",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.927,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.879,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the player's status for a future game, but it lacks depth or insight into how this might impact the team's performance or strategy.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Seattle Seahawks safety Nick Emmanwori injured his ankle during Wednesday's practice but is expected to play in Super Bowl LX. Coach Mike Macdonald and Emmanwori both indicated there is little concern about his availability for Sunday's game.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Bucks Keep Giannis Antetokounmpo Through NBA Trade Deadline",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 5 Feb 2026 14:30:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports",
      "Bleacher Report",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The Milwaukee Bucks have indicated to teams that they are keeping Giannis Antetokounmpo through the trade deadline and have started making other trades.",
      "Giannis Antetokounmpo may be “ready for a new home,” but it appears his new residence is still in the pre-build phase. The Milwaukee Bucks have indicated to other teams that they are keeping the two-time MVP through the 3 p.m. ET trade deadline and will start making other trades, ESPN’s Shams Charania reported Thursday. Then they did exactly that, agreeing to trade Cole Anthony and Amir Coffey to the Phoenix Suns for Nigel Hayes-Davis and Ousmane Dieng from the Chicago Bulls, according to another report from Charania. The Bulls added Nick Richards from the Suns in the three-team deal. With...",
      "This saga will now continue into the offseason, when teams like the Knicks, Lakers and Heat can make better offers.",
      "After months of speculation, Giannis Antetokounmpo will remain in Milwaukee past the NBA trade deadline, but his long-term future remains uncertain.",
      "The Bucks are expected to again listen to offers for Antetokounmpo in the offseason.",
      "Giannis Antetokounmpo isn't going anywhere, and neither will the trade chatter",
      "The Sporting News is tracking all the latest NBA trade news and rumors before Thursday's 3 p.m. ET deadline. Here's the full list of completed deals and more from all 30 teams from this year's deadline.",
      "NBA Trade Idea To Send Giannis Antetokounmpo To a Dark-Horse Suitor Bleacher Report",
      "Report: Bucks Won’t Move Giannis Antetokounmpo Before NBA Trade Deadline Sports Illustrated",
      "The Bucks are holding onto Giannis Antetokounmpo through the deadline, making the Lakers are legit threat this summer."
    ],
    "image_url": "",
    "titles": [
      "Sources: Bucks to keep Giannis through deadline",
      "Report: Bucks to keep Antetokounmpo, trade Coffey and Anthony",
      "Milwaukee Bucks inform teams they will not trade Giannis Antetokounmpo before deadline",
      "Bucks take Giannis off the table as NBA trade deadline approaches",
      "Bucks reportedly keeping Giannis Antetokounmpo with hours to go before NBA trade deadline",
      "Giannis Antetokounmpo is staying with Bucks at trade deadline: Here's how sweepstakes will change this summer",
      "NBA trade deadline tracker: Latest news, rumors for Giannis Antetokounmpo, Ja Morant and more in 2026",
      "NBA Trade Idea To Send Giannis Antetokounmpo To a Dark-Horse Suitor - Bleacher Report",
      "Report: Bucks Won’t Move Giannis Antetokounmpo Before NBA Trade Deadline - Sports Illustrated",
      "The Bucks are keeping Giannis Antetokounmpo, which is a huge win for the Lakers"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47839083/sources-bucks-keep-giannis-antetokounmpo-deadline",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/milwaukee-bucks-inform-teams-not-175106193.html",
      "https://sports.yahoo.com/articles/bucks-giannis-off-table-nba-173920840.html",
      "https://sports.yahoo.com/nba/breaking-news/article/bucks-reportedly-keeping-giannis-antetokounmpo-with-hours-to-go-before-nba-trade-deadline-170438954.html",
      "https://www.cbssports.com/nba/news/giannis-antetokounmpo-staying-bucks-summer-next-team/",
      "https://sports.yahoo.com/articles/nba-trade-deadline-tracker-latest-133807734.html",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQbGNQZndmUGVrOTA2bEZDWVpVbDBodzVRQXZhWDhlcGVUeXdXX2F1R0wyX0lleTFNclB6eXRTQXgwMFVXckV5OW9KdkVRVkZnUGJFQU5VZGlCWTNHNE5rWG9fU3pwNW1EdURod2Jfb3ZwY0xRMzVLcEhtclp2cTRvLTlacTZnc0RYOHJzdTNGeVhpM1VoSFp5YWJvVVdCc2pWUVplWnA5SQ?oc=5",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZkhEWm5NTFRxTllqQXZyRXFQMmVST0RWemc3QUlOUy1vSktWazJmQ0NVQy1qR2lqQmU2WldRcGl0YlZqakcwMFhvbU9FUFF1WFM2b0JQcW43TGZlcHM5Y3o3RTRyZ2pucTk0Q3N1dDRTczd2Vk9TS19XTWZoZG1GSlREbXNBS0NDa2xTX3BGeVpJVC1wNzZudXZR?oc=5",
      "https://sports.yahoo.com/articles/bucks-keeping-giannis-antetokounmpo-huge-174921649.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47839083/sources-bucks-keep-giannis-antetokounmpo-deadline",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.927,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.879,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the player's status with the team, but it doesn't provide deeper insight into the implications for the team's future or the reasoning behind the decision.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Milwaukee Bucks have confirmed they will keep Giannis Antetokounmpo through the NBA trade deadline and have started making other trades. While speculation about his future continues, Antetokounmpo will remain with the Bucks for the rest of the season. The team completed a three-team trade involving Cole Anthony, Amir Coffey, Nigel Hayes-Davis, Ousmane Dieng, and Nick Richards.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Tarik Skubal Wins Record $32 Million in Arbitration With Tigers",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 5 Feb 2026 14:30:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "sportsnet.ca",
      "cbssports.com"
    ],
    "snippets": [
      "Two-time reigning AL Cy Young winner Tarik Skubal won his arbitration case over the Tigers and will make $32 million this year, sources told ESPN, giving the ace $13 million more than Detroit offered.",
      "Tarik Skubal won his salary arbitration hearing with the Detroit Tigers on Thursday, and the two-time Cy Young Award winner will be paid a record $32 million this year instead of the team's $19 million offer. Jeanne Charles, Walt De Treux and Allen Ponak made the decision one day after listening to",
      "After haggling with the Detroit Tigers ownership, Tarik Skubal was granted the largest salary through arbitration ever.",
      "This was a clever argument from Skubal's representatives.",
      "Tarik Skubal has set a new arbitration record. Skubal has been awarded a $32 million contract for 2026 through arbitration, ESPN’s Jeff Passan reported on Thursday. The hearing was held on Wednesday, as the Tigers and Skubal lobbied a panel made up of Jeanne Charles, Walt De Treux and Allen Ponak, which ultimately ruled in favour of the reigning Cy Young winner. The highest arbitration salary for a pitcher was given to David Price in 2015 ($19.75) million, and the highest salary in an arbitration case decided by a panel was given to Toronto Blue Jays first baseman Vladimir Guerrero Jr. ($19.9...",
      "Detroit Tigers ace wins landmark arbitration case to earn $32 million salary for 2026.",
      "The 29-year-old lefty is the back-to-back AL Cy Young Award winner.",
      "The Tigers filed at $19 million, a record gap of $13 million"
    ],
    "image_url": "",
    "titles": [
      "Sources: Skubal wins arbitration, to make $32M",
      "Tarik Skubal wins salary arbitration case, will be paid record $32 million",
      "Tarik Skubal wins arbitration case, will earn $32 million in 2026",
      "How Tigers' Tarik Skubal invoked Pedro Martinez to win $32 million arbitration hearing",
      "Report: Skubal to earn record $32 million after beating Tigers in arbitration case",
      "Tigers' Tarik Skubal smashes MLB contract record in landmark arbitration case",
      "Tarik Skubal reportedly wins arbitration case vs. Tigers, will earn arbitration-record $32 million in 2026",
      "Tarik Skubal wins arbitration case vs. Tigers, sets MLB record with $32 million salary for 2026 season"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47840462/sources-tarik-skubal-wins-arbitration-tigers-make-32m",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/tarik-skubal-wins-salary-arbitration-195711615.html",
      "https://sports.yahoo.com/articles/tarik-skubal-wins-arbitration-case-195554253.html",
      "https://sports.yahoo.com/articles/tigers-tarik-skubal-invoked-pedro-194611555.html",
      "https://sports.yahoo.com/articles/tigers-tarik-skubal-smashes-mlb-192843349.html",
      "https://sports.yahoo.com/mlb/breaking-news/article/tarik-skubal-reportedly-wins-arbitration-case-vs-tigers-will-earn-arbitration-record-32-million-in-2026-192139842.html",
      "https://www.cbssports.com/mlb/news/tarik-skubal-salary-tigers-arbitration-mlb-record/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47840462/sources-tarik-skubal-wins-arbitration-tigers-make-32m",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.927,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.852,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the player's arbitration outcome and salary, but it lacks depth or insight into how this might impact the team's budget, the player's performance, or the broader trends in player salaries.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tarik Skubal won his salary arbitration case against the Detroit Tigers and will receive a record $32 million for the 2026 season, surpassing previous arbitration salary records. The arbitration panel ruled in Skubal's favor after the Tigers had offered $19 million, resulting in a $13 million difference.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "UK PM Starmer Apologizes for Mandelson US Envoy Appointment Over",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 16:19:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "New York Times",
      "CBC News",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "ft.com",
      "nytimes.com",
      "cbc.ca",
      "theguardian.com"
    ],
    "snippets": [
      "UK PM Keir Starmer says he regrets appointing Peter Mandelson as US ambassador related to his ties to Jeffrey Epstein.",
      "UK questions leader's judgement amid revelations of envoy Mandelson's close ties to late sex offender Jeffrey Epstein.",
      "The PM says the depth of the pair's relationship was not known when he was appointed US ambassador.",
      "UK prime minister faces criticism from Labour MPs over Peter Mandelson affair but insists he is not about to quit",
      "Newly released documents detailed connections between the convicted sex offender Jeffrey Epstein and Peter Mandelson, who was picked to be the U.S. envoy by the British prime minister, Keir Starmer.",
      "British Prime Minister Keir Starmer apologized to the victims of Jeffrey Epstein on Thursday and said he ​was sorry for having appointed Peter Mandelson as U.S. ambassador, who was a close friend of the late sex offender.",
      "PM says he is sorry for believing ‘lies’ told by former Labour minister and that he too is ‘angry and frustrated’ Keir Starmer has attempted to reboot his faltering premiership, apologising for appointing Peter Mandelson as US ambassador and urging his MPs to unite behind him. The prime minister gav"
    ],
    "image_url": "",
    "titles": [
      "UK ex-envoy’s ties to Epstein spark political storm",
      "UK PM Starmer apologises to Epstein victims for appointing Mandelson",
      "Starmer apologises to Epstein victims for believing Mandelson's 'lies'",
      "Starmer apologises to victims of Epstein",
      "Starmer Apologizes for Ex-Ambassador Mandelson’s Epstein Ties",
      "British PM Starmer apologizes for appointing Mandelson, but says diplomat lied about Epstein ties",
      "Starmer apologises to Epstein victims as he seeks to weather Mandelson scandal"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/5/uk-ex-envoys-ties-to-epstein-spark-political-storm?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/2/5/uk-pm-starmer-apologises-to-epstein-victims-for-appointing-mandelson?traffic_source=rss",
      "https://www.bbc.com/news/articles/cp37v4kyv3eo?at_medium=RSS&at_campaign=rss",
      "https://www.ft.com/content/584aec03-6eaa-4aee-8751-88592253d3bc",
      "https://www.nytimes.com/2026/02/05/world/europe/epstein-files-mandelson-starmer-uk.html",
      "https://www.cbc.ca/news/world/uk-starmer-apology-ambassador-mandelson-epstein-9.7075084?cmp=rss",
      "https://www.theguardian.com/politics/2026/feb/05/peter-mandelson-scandal-keir-starmer-apologises-jeffrey-epstein-victims"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/5/uk-ex-envoys-ties-to-epstein-spark-political-storm?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.848,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.83,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a political controversy, but it doesn't offer deeper insights or actionable information for the reader. It also doesn't report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "UK Prime Minister Keir Starmer has apologized for appointing Peter Mandelson as US ambassador after newly released documents revealed Mandelson's close ties to Jeffrey Epstein. Starmer expressed regret over the decision, apologized to Epstein's victims, and stated he was unaware of the full extent of Mandelson's relationship with Epstein at the time of the appointment.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Trump Administration Finalizes Rule Easing Firing of Senior Federal",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 16:13:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "The OPM rule says that high ranking officials could be fired for 'intentionally subverting Presidential directives'.",
      "Trump administration to make it easier to fire senior federal workers, WSJ reports Reuters",
      "Office of Personnel Management says reclassification will allow agencies to quickly remove employees who ‘obstruct the democratic process by intentionally subverting Presidential directives’ Amid the various winding comments throughout Trump’s speech today, he said that the Department of Education w",
      "New rule would strip job safeguards for 50,000 federal employees and change how whistleblowers are protected The Trump administration is seeking to finalize its overhaul of the federal government’s civil service system through a rule issued this week by the office of personnel management (OPM) to st",
      "The Donald Trump administration on Thursday finalized its overhaul of the U.S. government's civil service system, ​according to a government statement, which would give the president the power to hire and fire an estimated 50,000 career federal employees.",
      "Trump administration to end job protections for up to 50,000 federal workers Reuters"
    ],
    "image_url": "",
    "titles": [
      "New Trump administration rule makes it easier to fire career civil servants",
      "Trump administration to make it easier to fire senior federal workers, WSJ reports - Reuters",
      "Trump administration issues rule making it easier to fire federal workers – live",
      "Trump administration issues rule that makes it easier to fire federal workers",
      "Trump administration moves to end job protections for about 50,000 federal workers",
      "Trump administration to end job protections for up to 50,000 federal workers - Reuters"
    ],
    "url": "https://www.aljazeera.com/economy/2026/2/5/new-trump-administration-rule-makes-it-easier-to-fire-career-civil-servants?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxNV0FNUTJ4UUlGOEZnNkNNd0dXUFhubXUtRzVLd2wxYU5rZWVRSC1Ya1FUb3U0UGpjUUZKekhfZ2RBNUxWZ3V6OEVoTTBEZW5WT3o5clZEMUtjeDVlalhfTGROMUU0WDV3YzE3ZlFfQkUtVnhSc3NoZE9Jcnk1ZHY0YjlhNk8wTzhuS2RoOFV3NzNHQndOelRFbzVzT2dPcjFuemJMdzYtdDRveDltYmdOd29fNXhaQUU5M2dZS2VXOVJ6eVFzdlJNamRBTXhsdw?oc=5",
      "https://www.theguardian.com/us-news/live/2026/feb/05/donald-trump-immigration-ice-minneapolis-jeffrey-epstein-save-act-politics-latest-news-updates",
      "https://www.theguardian.com/us-news/2026/feb/05/trump-administration-federal-workers",
      "https://www.cbc.ca/news/world/trump-opb-kupor-civil-service-changes-9.7075508?cmp=rss",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxQU25VOFdtTnhYY3UxV1prMWVha01PMF9UaC1DajA2ai1GTDAzZEJKMThJR0NjdkMwWWY3b25FREg0ODRyczN1MlZRU09LWEhidVpYZk15SmhBR195QW9nSENNR3ZZZmVyaG84eVR6d2doSmRIbGh5bzEySkYxQ2U5UXRGb194VnRKTnUtdm45QlY?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2026/2/5/new-trump-administration-rule-makes-it-easier-to-fire-career-civil-servants?traffic_source=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.846,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.819,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a new rule affecting career civil servants. However, it doesn't highlight any progress or solutions, nor does it empower the reader with knowledge on how this might impact them or what they can do about it.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Trump administration has finalized a rule that removes job protections for up to 50,000 federal employees, making it easier to hire and fire senior staff. The Office of Personnel Management stated the change targets officials who intentionally subvert presidential directives and alters protections for whistleblowers.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US and Iran to Hold Nuclear Talks in Muscat After Location Dispute",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 14:10:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "The Guardian",
      "Al Arabiya"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The talks had appeared to be in jeopardy, with the two countries at odds over the location and parameters.",
      "The White House confirmed a meeting would take place after days of conflicting reports on the talks’ timing, location and format.",
      "Talks that had been scheduled in Turkey salvaged after Arab states convince White House not to walk away from negotiations Talks between the US and Iran scheduled for Friday have been brought back from the brink of collapse after the US initially rejected Iran’s request to move them from Turkey to O",
      "Iran says nuclear talks with US to be held in Muscat on Friday Al Arabiya English"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/61cc/live/fe6c9710-0298-11f1-b5e2-dd58fc65f0f6.jpg",
    "titles": [
      "US and Iran agree to hold nuclear talks in Oman on Friday",
      "U.S. and Iran to Hold Talks in Oman on Friday",
      "US and Iran talks brought back from the brink after White House relents on move to Oman",
      "Iran says nuclear talks with US to be held in Muscat on Friday - Al Arabiya English"
    ],
    "url": "https://www.bbc.com/news/articles/cvgj2knp4d9o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/04/world/middleeast/iran-us-talks-oman.html",
      "https://www.theguardian.com/world/2026/feb/04/us-iran-talks-risk-collapse-oman-move-rejected",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxPeEQzMDdIVGFFYlkyUDhSbE9nUDBOdjBsOE1KOWFUeFpRQldmc3d6Z3BBcWFCOUdrWlNsWnB6ckxOSHN0V0ZURFpaekV6X1pVS1lCTk16b0JINzctR3RTRF9zeVNqZzE3Z1p2X2hFLXVFRnV5U2s5clFFQ0Iwbll4OFVVaXBLTnBEUjRrSjQ2aWNFdHRxaWh1NmZVeW1ndlZaYnJ1cVlPR01OOG5uT0xTd1Jkb0plZzBtRzlyedIBwgFBVV95cUxNaDQ0OXNaSHBya2hsTl9MNHRPMTZGSzA1dEN2dVZjVXRSUzJPTU81UnlJUFM5clI1Slk3VkhaUnFVcG5TZHV5eE13ZHI4U2taRnA3bi1QU2pxVUlSenNPZ3VMUFdQdDhhNXg2Unp6dGR0VDJxSWlxMkRFLVJNa0VpX3JGRF9oeXJrMDc5UDZwZnRsbVRZdzE4NVRXLU1ISG9OYV8ydWRwQnpPNWR6aE1QV0twWkk3c2E1V1I2SzVzMFllZw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvgj2knp4d9o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.799,
      "consensus": 0.908,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.819,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the ongoing diplomatic efforts between the US and Iran. It does not, however, provide detailed insights into the potential outcomes or impacts of these talks.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US and Iran have agreed to hold nuclear talks in Muscat on Friday, following days of uncertainty over the location and format. The White House confirmed the meeting after Arab states intervened to keep negotiations on track, salvaging the talks that were initially set for Turkey.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Softens Stance on Chagos Deal",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 19:49:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "It comes after the US president suggested last month he could withdraw his support for the deal.",
      "But US president says he retains right to ‘militarily secure’ American base on Diego Garcia",
      "US president says deal, which he previously described as act of ‘great stupidity’, was ‘best’ PM could make Donald Trump has watered down his criticism of the UK’s plan to hand the Chagos Islands back to Mauritius, saying the deal was the “best” Keir Starmer could make. The US president had describe"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/46da/live/7e236020-02c0-11f1-b65a-f71a35b8a90a.jpg",
    "titles": [
      "Trump signals US support for Chagos handover deal",
      "Trump rows back his criticism of UK’s Chagos Islands deal",
      "Trump waters down criticism of UK’s Chagos Islands deal after call with Starmer"
    ],
    "url": "https://www.bbc.com/news/articles/c5yx1wedww2o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.ft.com/content/86e4d2f7-87b5-4f6b-98e6-1f6031527c6d",
      "https://www.theguardian.com/world/2026/feb/05/trump-criticism-chagos-islands-starmer"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c5yx1wedww2o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.935,
      "consensus": 0.789,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.812,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs the reader about a significant political development, providing context and understanding. However, it doesn't provide actionable insights or delve into the potential impacts of this decision.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "It comes after the US president suggested last month he could withdraw his support for the deal.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Rams and 49ers to Play NFLs First Regular Season Game in Australia",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 5 Feb 2026 14:30:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The 49ers will be the Rams' opponent for the first NFL regular-season game in Melbourne, Australia, during the 2026 season.",
      "One of pro football's best rivalries will be etched in NFL history",
      "Rams Learn Who They'll Play in Australia in 2026 Sports Illustrated",
      "The San Francisco 49ers will be the team facing the division-rival Los Angeles Rams in the first-ever regular-season NFL game in Australia next season, the league said Thursday. The league had announced last year that it will be playing a game in 2026 in Melbourne at the Melbourne Cricket Ground, a",
      "The NFC West matchup Down Under will be one of a record nine international games on the 2026 schedule.",
      "The NFL's first game in Australia in 2026 will feature two division rivals in the Los Angeles Rams and San Francisco 49ers.",
      "The 49ers and Rams will meet in Melbourne, Australia, for a regular-season game in 2026.",
      "The 49ers will play the Rams in Melbourne, Austrailia next season.",
      "The Rams will play the San Francisco 49ers at Melbourne Cricket Ground in Australia next season in a contest that almost certainly will be played in Week 1.",
      "The Los Angeles Rams are set to host the 49ers in Australia in 2026"
    ],
    "image_url": "",
    "titles": [
      "49ers are Rams' opponent for 1st Australia game",
      "Rams, 49ers to play in NFL's first game in Australia during the 2026 season",
      "Rams Learn Who They'll Play in Australia in 2026 - Sports Illustrated",
      "The San Francisco 49ers will play the LA Rams in the first regular-season NFL game in Australia",
      "49ers, Rams to play NFL's first game in Melbourne, Australia next season",
      "Rams to face 49ers in NFL's first game in Australia",
      "Rams' 2026 &quot;home&quot; game against 49ers will be played in Melbourne, Australia",
      "The 49ers are headed down under to play the Rams next season",
      "Rams will play the San Francisco 49ers in Australia next season",
      "Rams to give up home game against 49ers in 2026"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47840040/49ers-named-rams-opponent-nfl-1st-game-australia",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/rams-49ers-australia-2026-season/",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcFNSejVKbHNfd3liN1ZjcUM1c0xEUG1HSmFRWEZqWWswTFBfWTh0Z1hUc0szcHdBYnlDVE1TaDd5N2xiOEJnSjI2Z29Xc2xaN0h4YXZqd1JYOFFWSTZIaHNlVnFzZmd2aGh2N09lUVpzcmRWbGlOYnNIUVhOQm93S1JBRmprOEE4?oc=5",
      "https://sports.yahoo.com/articles/san-francisco-49ers-play-la-193446292.html",
      "https://sports.yahoo.com/nfl/breaking-news/article/49ers-rams-to-play-nfls-first-game-in-melbourne-australia-next-season-192449874.html",
      "https://sports.yahoo.com/articles/rams-face-49ers-nfls-first-191925884.html",
      "https://sports.yahoo.com/articles/rams-2026-home-game-against-190720141.html",
      "https://sports.yahoo.com/articles/49ers-headed-down-under-play-190642009.html",
      "https://sports.yahoo.com/articles/rams-play-san-francisco-49ers-185418484.html",
      "https://sports.yahoo.com/articles/rams-home-game-against-49ers-192132435.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47840040/49ers-named-rams-opponent-nfl-1st-game-australia",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.927,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.802,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Los Angeles Rams will play the San Francisco 49ers in the first-ever NFL regular-season game in Australia. The matchup is scheduled for the 2026 season at Melbourne Cricket Ground in Melbourne and will be one of nine international games on the NFL's 2026 schedule.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "2026 Winter Olympics Open in Milan Amid Doping Scrutiny in Ski Jumping",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 10:54:27 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Yahoo Sports",
      "BBC",
      "The Guardian",
      "Sky Sports",
      "BBC Sport"
    ],
    "domains": [
      "abcnews.go.com",
      "sports.yahoo.com",
      "bbc.com",
      "theguardian.com",
      "skysports.com",
      "bbc.co.uk"
    ],
    "snippets": [
      "ABC News' Maggie Rulli speaks with U.S. Olympians about the excitement leading up to the games in Italy.",
      "Milan’s San Siro stadium is set for a final hurrah. The opening ceremony for the Milan Cortina Winter Olympics will likely be the last event of major global significance held at the iconic stadium before it is torn down in the next few years. The 99-year-old arena is home to soccer clubs Inter Milan",
      "The World Anti-Doping Agency could investigate if evidence emerges that male ski jumpers are injecting their penises in a bid to improve sporting performance.",
      "Bild claims acid injections used to alter jumpers’ suits ‘If anything was to come to the surface we’d look at it’ During its 26-year history, the World Anti-Doping Agency has faced thousands of questions about athletes using illicit substances. Thursday, however, surely marked the first time it was",
      "Fears of penis-based skulduggery have placed ski jumping under scrutiny at the start of the Winter Olympics in Milan.",
      "Coverage of the snowboard competition at the 2026 Winter Olympics."
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/260205_abcnl_930a_rulli_olympics_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  What to expect at the Winter Olympics",
      "San Siro: What to know about Milan's iconic stadium hosting the Winter Olympics opening ceremony",
      "How penis injections became a Winter Olympic talking point",
      "‘Penis injection’ claims in Winter Olympics ski jumping investigated by Wada",
      "Penis injection claims at Winter Olympics to be investigated",
      "Winter Olympics 2026"
    ],
    "url": "https://abcnews.go.com/Entertainment/video/expect-winter-olympics-129883645",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/san-siro-know-milans-iconic-153450392.html",
      "https://www.bbc.com/sport/articles/czej70jyg4eo?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/penis-injections-became-winter-olympic-165835403.html",
      "https://www.theguardian.com/sport/2026/feb/05/penis-injection-doping-claims-in-winter-olympics-ski-jumping-investigated-by-wada",
      "https://www.skysports.com/winter-olympics/news/12040/13503765/winter-olympics-penis-enhancement-mystery-under-scrutiny-as-world-anti-doping-agency-look-to-investigate",
      "https://www.bbc.co.uk/iplayer/episode/m002r336?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Entertainment/video/expect-winter-olympics-129883645",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.838,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The 2026 Winter Olympics began in Milan with the opening ceremony at San Siro stadium, which is expected to be demolished soon. The snowboard competition is underway, while ski jumping faces scrutiny over unproven doping allegations involving acid injections. The World Anti-Doping Agency stated it will investigate if credible evidence emerges.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US and Russia Resume Military Talks After Four Year Pause",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 17:23:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "Global News",
      "CBC News",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "ft.com",
      "globalnews.ca",
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Channels of communication were suspended in 2021 shortly before Russia's full-scale invasion of Ukraine.",
      "Announcement made despite lack of progress in Ukraine-Russia peace dialogue",
      "Communications between the U.S. and Russia were suspended in 2021 shortly before Russia launched its full-scale invasion of Ukraine.",
      "The U.S. and Russia has agreed to re-establish high-level military dialogue for the first time in more than four years in another sign of warming relations between the two countries since U.S. President Donald Trump returned to office and sought to end the war in Ukraine.",
      "US, Russia to reestablish military-to-military talks Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7fb3/live/8dc62d20-02b4-11f1-83b0-21555a6f44a1.jpg",
    "titles": [
      "US and Russia agree to resume regular military contact",
      "US and Russian militaries to resume high-level talks",
      "U.S., Russia to reestablish military talks after Abu Dhabi meetings",
      "U.S., Russia agree to re-establish military-to-military dialogue after 4-year pause",
      "US, Russia to reestablish military-to-military talks - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/cgjw30vx5z6o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.ft.com/content/295f90cd-8fcf-4440-8645-a9d04b4eb65d",
      "https://globalnews.ca/news/11653806/russia-us-military-talks/",
      "https://www.cbc.ca/news/world/united-states-russia-abu-dhabi-talks-ukraine-9.7075221?cmp=rss",
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxNdlFnWktJWmtoUDdjemdDdHpLdW5TM3p6aWNHdGVkRmFIOEluNm1KeVlxS3VHcGNQVm4xeVdNU2JONDZ0azdhN1ZMcnRXX0NSU0EtdUNWRGctYXlJZEU1Y2JpMjI2OS0yUEhaeTI5Q2w5QW0zd3ZjWS0zTzJwOUNlOXI0ek1HSnZ5ZU9DUkgxS2dnY3E3WExlTDYwTzh1ZVpvaVVZcC1sdm9NM3daR3V1MVNBS0hRZHJGS0N2YlpyU21wWGNwRFY3eWp5UjNFUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cgjw30vx5z6o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.874,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The United States and Russia have agreed to reestablish high-level military-to-military talks for the first time since 2021, despite ongoing challenges in Ukraine-Russia peace negotiations. Communication channels had been suspended prior to Russia's full-scale invasion of Ukraine.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "US and Russia Agree to Observe New START Treaty After Expiration",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 13:58:57 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration Axios",
      "US, Russia close in on deal to continue New START nuclear arms treaty, Axios reports Reuters",
      "US president says the two countries should seek a ‘modernised’ treaty instead of extending current agreement"
    ],
    "image_url": "",
    "titles": [
      "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
      "US, Russia close in on deal to continue New START nuclear arms treaty, Axios reports - Reuters",
      "Trump calls for new nuclear treaty with Russia as New Start expires"
    ],
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB5eUdzWFhsVTFZODh4RXpZMFJ6T0o1TEx1TU1kSWhNMjRwUWdVNHFldDI1T2c4UjUySzQzYjN4Tm4zYm9WNXUwMnBUcXItdGpDQlN2bk41R2p4amx2Vzl4dWhPNTdVeHJreTBKcl81bmJnZG5uczNpNFhBakw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPdExQeXJWQVVYZmVSeEpwSW1XVWhzZzB5NFFqWE5UUzllbGJwd0tTcFRNR1hERDhMczZnLUlDc3lHMGtCZGZNQ0JIX3k2anZQVjNXS2xRMUFBdXl5aDJsR2FzSXM1dmhCYkJPaG5fZVl5NE96cWFhemExNGlkUjdIS19YYlhIUDhTWUZsNVJuTXAzVXpGcEZySXhJcXVHNVhfN2NIb0pUTVRjYU1NOW5VQXFNMA?oc=5",
      "https://www.ft.com/content/99af4279-dabf-469d-bc4a-77579a73e393"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB5eUdzWFhsVTFZODh4RXpZMFJ6T0o1TEx1TU1kSWhNMjRwUWdVNHFldDI1T2c4UjUySzQzYjN4Tm4zYm9WNXUwMnBUcXItdGpDQlN2bk41R2p4amx2Vzl4dWhPNTdVeHJreTBKcl81bmJnZG5uczNpNFhBakw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.795,
      "consensus": 0.769,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.78,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant agreement between two major powers, highlighting progress in nuclear disarmament efforts. It would be even more constructive if it provided more context or analysis on the implications of this agreement.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The United States and Russia have agreed to continue observing the terms of the New START nuclear arms treaty after its expiration, while discussions continue on creating a modernized agreement.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Timberwolves Acquire Ayo Dosunmu From Bulls in Deadline Trade",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 17:32:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Chicago and Minnesota have linked up again",
      "Timberwolves Land Ayo Dosunmu From Bulls in Deadline Day Trade Sports Illustrated",
      "Pacers Intensify Pursuit of Ivica Zubac Ahead of Trade Deadline Sports Illustrated",
      "NBA Trade Deadline Live Updates on Every Deal, Rumors and Latest Intel Sports Illustrated",
      "New Potential Trade Target Emerges For Cavaliers Ahead of NBA Trade Deadline Sports Illustrated",
      "Memphis Grizzlies, Philadelphia 76ers Complete NBA Trade Deadline Deal Sports Illustrated",
      "The trade deadline has been as crazy as ever with some of the top stars already being dealt.",
      "Follow along and give us your takes on all the NBA trade deadline moves",
      "The 2026 NBA trade deadline offers a world of possibilities. The league is no longer as top heavy as it was 10 or 20 years ago. In this era, parity reigns supreme, and repeating as champions is almost impossible. With a big class of both buyers chasing the title and sellers chasing ping-pong balls i",
      "Timberwolves Have Reportedly 'Moved On' From Giannis Trade Talks Sports Illustrated",
      "How Cavaliers’ Lonzo Ball Trade Paves the Way for Giannis Antetokounmpo Trade Sports Illustrated",
      "Bucks Complete Trade With Suns After Deciding to Keep Giannis Antetokounmpo Sports Illustrated",
      "SI:AM | The Biggest NBA Deadline Trades Made Thus Far Sports Illustrated",
      "Pelicans' Embarrassing Loss to Bucks Highlights Unforgivable Trade Deadline Blunder Sports Illustrated",
      "The fire sale in Chicago continues. The Bulls have traded Ayo Dosunmu and Julian Phillips to the Minnesota Timberwolves in exchange for Rob Dillingham , Leonard Miller and four second-round picks, ESPN’s Shams Charania reported on Thursday. Dosunmu had been with the Bulls for his entire five-year career and now moves on to Minnesota. The 26-year-old is averaging 15 points, three rebounds and 3.6 assists over 45 games this season. Dosunmu has also been very efficient, shooting 51.4 per cent from the field and a career-best 45.1 per cent from three. He should slot nicely into the Timberwolves’...",
      "The Minnesota Timberwolves have acquired guard Ayo Dosunmu from the Chicago Bulls, adding a proven scorer to bolster their depth for the stretch run in the stacked Western Conference playoffs race, a person with knowledge of the deal told The Associated Press on Thursday. The person spoke to the AP",
      "The Wolves make a move for a scoring guard that fills a desperate need",
      "Knicks Trade Guerschon Yabusele to Bulls For Former First-Rounder Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/05/7d1ac794-0548-4fa8-b3b2-faab298f70f4/ayo-imagn.png",
    "titles": [
      "Ayo Dosunmu trade grades: Timberwolves finally upgrade the backcourt; Bulls still lack long-term vision",
      "Timberwolves Land Ayo Dosunmu From Bulls in Deadline Day Trade - Sports Illustrated",
      "Pacers Intensify Pursuit of Ivica Zubac Ahead of Trade Deadline - Sports Illustrated",
      "NBA Trade Deadline Live Updates on Every Deal, Rumors and Latest Intel - Sports Illustrated",
      "New Potential Trade Target Emerges For Cavaliers Ahead of NBA Trade Deadline - Sports Illustrated",
      "Memphis Grizzlies, Philadelphia 76ers Complete NBA Trade Deadline Deal - Sports Illustrated",
      "NBA Trade Deadline live thread",
      "NBA Trade Deadline (open thread)",
      "NBA trade deadline grades for every 2026 deal",
      "Timberwolves Have Reportedly 'Moved On' From Giannis Trade Talks - Sports Illustrated",
      "How Cavaliers’ Lonzo Ball Trade Paves the Way for Giannis Antetokounmpo Trade - Sports Illustrated",
      "Bucks Complete Trade With Suns After Deciding to Keep Giannis Antetokounmpo - Sports Illustrated",
      "SI:AM | The Biggest NBA Deadline Trades Made Thus Far - Sports Illustrated",
      "Pelicans' Embarrassing Loss to Bucks Highlights Unforgivable Trade Deadline Blunder - Sports Illustrated",
      "Report: Bulls trading Ayo Dosunmu to Timberwolves",
      "Timberwolves acquire Ayo Dosunmu for scoring depth in trade-deadline deal with Bulls, AP source says",
      "Timberwolves Trade for Bulls Guard Ayo Dosunmu",
      "Knicks Trade Guerschon Yabusele to Bulls For Former First-Rounder - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/nba/news/ayo-dosunmu-trade-grades-timberwolves-bulls/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxPUjF1eG1xd1V5UzV1M1dHY0VDbzBJR1cxQzJKMjEtLVlYa2c3cUw2NDZqVk1zZWhhTXhGUG5uQmVlU2dMV0ZaNzU5MHZ0S00xM2x3UWdtQm85d0ZJWDZjUjBpek1mUlJoQUtsSmVjZEJ2QUFzVGQ1YWFoZTFKblRYdEZqX1VsLU1aMS02SUF5cGxQMERKZ3pKNWNfVzAzRl9kVlhpV0hfWURJWWlnUlVuRTIta2EyOWJidURBR293Wm5OQjdtekU4?oc=5",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxOMDhqcGFiRVlFeTZLTnR0elE3QW9TajBJVlJsbVJSOWw5YlBOTFo4c1RKSEVWQjFZRUZMYjQ0QXFpaWNQWDlMZEl3QXFUTzBFWV9Yd1hsZmxEQkd4aFdRWFotMGhneU1RcldobnRKLVZ5RGd3MExLdzdWNDhDbHQ3bnhQNHNNSXNJREdnZFFqbWlEVEZJTEpwNUxNa1VXWVdMbVE4M2VKRjNxbDZ4WGNya19fQ1JsZ0N3bGc?oc=5",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNZ2ZLc1dGcGsyTF9TQk1JUnVjNHpYQ2RUakUzck1FZjhqeXIwU3Z5WjAyMHpMSTNvaVJEYWs0SjFuM2RrTEhEaWtFZ0thRGJlYm14TXRGbDFNSjlCWktXVEZuaEF1SGNmUHdIVDA0bnBZMU81TkViRWJSUmVQeU9ZRkQwTnl6eldGbUZZelp6cm9aaS1FWWdqb1FaYWdtMHAxTHVDZGROdXBSbE0?oc=5",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxQZHpMYVRwWE9jSDl5RzBQMnpfeFFBb3VJUTMybnl1Zkh3c0pEdWVxMmpsVHBUMEVkVTlrSWNpTURJMldncG5WTGtwTENWcDdtd19Bekt5MnBVVWF6NnEzX3FkcksyMVJZM3daVHNxcUdyZGY4cDdaSk13MFRySkRqeGhQdHJjYThUZk5sM0xKU05YMUNTejlsM1R3S3ZJNFdiWE9uREhEaE9rbHVZbG85RkRheEtoa0V0Y2cxZ042MUsxRzJheVgwVUlfQm4?oc=5",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPNmhaMWZ6d0YyWE9EMU44dW9ELUx6eTUzZDRvMHVaeVR2T3hIUTF2OHg1SWcyLWNiVXdYdHpqRzI2OUdIWDZZczBQeGE2OU9BelpkSnBDMk1Ed2hCYU05cWl1cGVjT2xFVXVnNnhYdEJVNGFFMkxVRWxLTHVZWlItYXBZczU2bUVFRjNfX0Y3SDlNdDVhbVVSTXBPdmxUbS0yU2IzQWhIQkM3cHJBWUV6TjhyR1Z1RDFLY3VHbEN1blF2eEU?oc=5",
      "https://sports.yahoo.com/articles/nba-trade-deadline-live-thread-163445639.html",
      "https://sports.yahoo.com/articles/nba-trade-deadline-open-thread-160000091.html",
      "https://sports.yahoo.com/articles/nba-trade-deadline-grades-every-160000459.html",
      "https://news.google.com/rss/articles/CBMiywFBVV95cUxQRmUzaG5DZDNtZEZnS1BhdnJETkVldUh0VXZVVV9oLW11OVV2OVdSLUVIc2dKRU0yUDA5SlpRc3Q0M3RENGUtRTEtZWc0cTA2WjJQTEV6RDdZSVpfR2d4V29aWU45MzBKLUY1RTY4R2VsMElHVDJmSHYyZ0c3bl9HdEpzejU0QnVHaVVPZDNFRmtFWHRpVWZPVEhOdlZ0Y0RISmEwZUh4MEROQndzdkFEU3pLLUMxc00wMFdyNnJVOXYxN2ZweHZaOGYzbw?oc=5",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxQWG9BR0pFWmtITDNvZkpUWVRvdDQwRmlsRGQ2OXU4eXdaeUxsZnVqNjM5OGlWekJxS2laUFBRWFNNYXoxSUNGQ2Rpa0lkamRBbFFuUC1wRkFxckRRWGpCZ0l3YXpIcmFDdjBJSURBOVZyRlhQaFFzOUExNVRIRklyRXY2bUxpd1hDTGZtUl9mdkZhUzVtbHZMc3BfcjE3VUtScEtJaEJNa1h6VmI5QWh3TXh2cVRhSUdJcE9kakRQYmxiT09xU3ZOamRubFM?oc=5",
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxONGxxamFzRUtlbG1VYVRlY2U4RzdBZHIzOGJhWHBHNFd4c3F3OWRBVWtUaFlEcUtyRzdkOUNjX0NJQ0RackxkR1U0UjRFSXNvcUdxazcyZlZFR1JpNlliUjZDWTM1UW50MGZqdDJGTml3V3FyV0xzYlJqeU0wVEZHcDVZcGNTa2s4QUxYMUdLTlloWDc2TUU2UA?oc=5",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSlltaHM0OTNSek9SZTA3bGgzdkUxQkdmcGxNRUZTWUlScW5GSG55QzFZR0dXNVJBMm83dnB0Y1ZpQm9mZ3NsWVo5ZGJCanAzemZVM1l6Ukt1LVVHd2wyOEtsQkFaSDM5LXdQeXRRZFRmOGpPYThJTTBWbnM3NjBxdXNrdzZKcWlz?oc=5",
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxPS19nbUdhVV9JNzNMUml4anR5NTlxV2k2NjdWMkxlNC1lY2ZLTVB0a0drbFpwR0RBX2dMbTQ3Wk0tNzY4YVVaYnk3bjBjRzU5a1l0dW9DYl85X1o4WE9kQ25tTTg4NGVPVEJLaXRSVHJjWFJZbnNVWXV1Q05IYXBqY0hEdk9KWnhDX25vOUVkWUJRU1RFNWw1WkpTaDZyVTV6eTdnRjFtRU9FODRjUlJ5bTJlV0pMM290TmxxVC1TSFp0TU5wOFRqN3Rkcmp5V1U?oc=5",
      "https://sports.yahoo.com/articles/timberwolves-acquire-ayo-dosunmu-scoring-163925530.html",
      "https://sports.yahoo.com/articles/timberwolves-trade-bulls-guard-ayo-161019091.html",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxNb01LSE1CNFlYdW0zcE5EQm1feU82YnU4S1VQRTlPR2RsRHNSVXpycnAydm5ubmhTQ3JWczU2OW9pS1lSdkRaY3VmNEhsYnYzcXFfZDFILTJXWGRkNklMVFdjZ3JuWVF5MDNpdkZ0VnRVRnZRdmo2eUtrZDY1eV9wNy1QR3BEZXVvRUZVVEFlQWx0MVdEVHVUWHRQUTlDMUk?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nba/news/ayo-dosunmu-trade-grades-timberwolves-bulls/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.877,
      "consensus": 0.908,
      "constructiveness": 0.095,
      "proximity": 0.5
    },
    "score": 0.772,
    "constructiveness_score": 0.095,
    "constructiveness_reason": "keywords (1): upgrade; actions: upgrade; semantic: pos_sim=0.14, neg_sim=0.00; semantic_boost=0.03; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Minnesota Timberwolves acquired guard Ayo Dosunmu and Julian Phillips from the Chicago Bulls in exchange for Rob Dillingham, Leonard Miller, and four second-round picks. Dosunmu is averaging 15 points, 3 rebounds, and 3.6 assists this season. The move aims to strengthen the Timberwolves' roster for the playoff race.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Brad Karp Resigns as Paul Weiss Chairman After Epstein Email Release",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 17:39:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Brad Karp’s company, Paul Weiss, previously said he did not participate in any misconduct.",
      "Epstein emails lead Brad Karp to resign as Paul Weiss law firm chairman Reuters",
      "The Department of Justice last week released millions of documents related to the notorious sex offender Jeffrey Epstein.",
      "Karp Steps Down as Paul Weiss Chairman After Epstein Emails Bloomberg"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2dbf/live/83a2a7d0-028f-11f1-9e0e-291cedfbaca5.jpg",
    "titles": [
      "Chairman of major US law firm steps down after Epstein files release",
      "Epstein emails lead Brad Karp to resign as Paul Weiss law firm chairman - Reuters",
      "Paul Weiss Chairman Brad Karp resigns after Jeffrey Epstein email disclosures",
      "Karp Steps Down as Paul Weiss Chairman After Epstein Emails - Bloomberg"
    ],
    "url": "https://www.bbc.com/news/articles/c7v02m633mjo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZjlWenM1bmJwMnMyREIwcU1MNU1ZTjNYV3NxeUZqcmdZTUtaMHk5ZHBsaHhDV1g5alV2V193LWRLdlRUakNUMjZWdGx6U3Jiem5VRjluanotRjNOMkliUE9PeTlWcS1sTlY3Qm5vaW5WdkE3Z1NGNHJrSnBMTzdSMVhGYjdlZ2t6cHdWV1ZfRWtrcGNn?oc=5",
      "https://www.cnbc.com/2026/02/05/paul-weiss-brad-karp-resigns-jeffrey-epstein.html",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPY3FMeTU0OGVDOHJOclR1ay1hOWZ2OFpVWXV2Q3BkcXNBZ2xJOUYxU1Z6R1lSMVRlNUd3cXBGS01wMWE3eUZOWG13eEs2N2hQWC1iSHJkOWhaR0tqVUpjUWN4ZGRFa0NsbTZpR280a3RTQVNmMThDQUhtM3dsT1JqdHkwcW9kblk1bUFldkxwYi05YXA2WVZjOHdyaVN4LTNFcHA3WkdROXQ3RDEwclFjZVppSjVpUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c7v02m633mjo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.88,
      "consensus": 0.888,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.768,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: release; semantic: pos_sim=0.00, neg_sim=0.09; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Brad Karp has resigned as chairman of the law firm Paul Weiss following the release of emails linking him to Jeffrey Epstein. Paul Weiss stated that Karp did not participate in any misconduct. The resignation comes after the Department of Justice released documents related to Epstein.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Patriots and Seahawks to Meet in Super Bowl 60 on February 8",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 18:03:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Today's best bets + Last NHL action before Olympics + Super Bowl cross-sport parlays",
      "SportsLine's model reveals its Golden State Warriors vs. Phoenix Suns NBA picks today",
      "Warriors vs. Suns Prediction, Odds and Best NBA Prop Bets for Thursday, Feb. 5 Sports Illustrated",
      "Wizards vs. Pistons Prediction, Odds and Best NBA Prop Bets for Thursday, Feb. 5 Sports Illustrated",
      "SportsLine's model reveals its Washington Wizards vs. Detroit Pistons picks for their Thursday matchup",
      "SportsLine's model reveals its Chicago Bulls vs. Toronto Raptors NBA picks today",
      "SportsLine's model reveals its Brooklyn Nets vs. Orlando Magic picks for their Thursday matchup",
      "SportsLine's model reveals its San Antonio Spurs vs. Oklahoma City Thunder NBA picks today as the Spurs are now favored thanks to a lengthy Thunder injury list",
      "SportsLine's model reveals its New York Knicks vs. Denver Nuggets picks for their Wednesday matchup",
      "SportsLine expert Brady Kannon has revealed his Super Bowl picks for the New England Patriots vs. Seattle Seahawks in The Big Game on Sunday",
      "SportsLine's top NFL experts reveal their best bets for Seahawks vs. Patriots in Super Bowl 2026 on Sunday",
      "SportsLine expert Emory Hunt has revealed his picks for the Seattle Seahawks vs. New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8",
      "SportsLine expert Bruce Marshall has revealed his picks for the Seattle Seahawks vs. New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8",
      "DFS multimillionaire Mike McClure shares his top daily Fantasy football picks for Seahawks vs. Patriots in the Super Bowl 2026 on Sunday",
      "SportsLine's model has revealed its New England vs. Seattle picks for their Super Bowl 60 matchup on Sunday, Feb. 8",
      "Here are the conditions Seattle and New England will be playing in during Super Bowl LX",
      "SportsLine AI evaluated the Super Bowl 60 odds and revealed its NFL score predictions and best NFL picks",
      "New England and Seattle will meet in Santa Clara, California, on Feb. 8.",
      "CBS Sports expert R.J. White shares his MVP betting picks for Super Bowl 60",
      "CBS Sports writers Jordan Dajani and Jared Dubin break down the final game of the 2025 season",
      "How to bet New England Patriots vs. Seattle Seahawks in Super Bowl 60 on Sunday, Feb. 8",
      "Here's your Super Bowl 60 cheat sheet, including halftime show details and everything else you need to know",
      "SportsLine's model has simulated Seahawks vs. Patriots 10,000 times and revealed the 10 best 2026 Super Bowl parlay picks",
      "A look at who will be performing ahead of the big game",
      "A look at who will perform for the Santa Clara crowd",
      "The Patriots and Seahawks will once again go toe-to-toe in the Super Bowl. Here is a look at the numbers that will define Sunday’s matchup.",
      "Ohio State vs. Maryland Prediction, Odds for College Basketball on Thursday, Feb. 5 Sports Illustrated",
      "The best bet in my Bulls vs. Raptors predictions for Thursday, February 5, is a Brandon Ingram player prop pick.",
      "Tonight's Jazz vs Hawks predictions and NBA picks are high on Lauri Markkanen clearing his 25.5-point total.",
      "Get the best Hornets vs. Rockets predictions ahead of Thursday's matchup in Houston. Free NBA picks for February 5.",
      "76ers vs Lakers predictions and NBA picks. Kelly Oubre Jr. does a little bit of everything on Thursday, February 5."
    ],
    "image_url": "",
    "titles": [
      "SportsLine Newsletter Thursday, February 5, 2026",
      "Warriors vs. Suns odds, prediction, time: 2026 NBA picks for Thursday, February 5 from proven model",
      "Warriors vs. Suns Prediction, Odds and Best NBA Prop Bets for Thursday, Feb. 5 - Sports Illustrated",
      "Wizards vs. Pistons Prediction, Odds and Best NBA Prop Bets for Thursday, Feb. 5 - Sports Illustrated",
      "Wizards vs. Pistons odds, prediction, spread, time: 2026 NBA picks for Thursday, February 5 from proven model",
      "Bulls vs. Raptors odds, prediction, time: 2026 NBA picks for Thursday, February 5 from proven model",
      "Nets vs. Magic odds, prediction, spread, time: 2026 NBA picks for Thursday, February 5 from proven model",
      "Thunder vs. Spurs odds, prediction, time: 2026 NBA picks for Wednesday, February 4 from proven model",
      "Nuggets vs. Knicks odds, prediction, spread, time: 2026 NBA picks for Wednesday, February 4 from proven model",
      "2026 Super Bowl predictions, NFL picks this week: Patriots vs. Seahawks bets by expert on 29-15 roll",
      "NFL picks this week, Patriots vs. Seahawks odds: 2026 Super Bowl expert predictions against the spread, props",
      "Seahawks vs. Patriots prediction, odds, spread, time: 2026 Super Bowl picks from expert on 28-16 roll",
      "Super Bowl 60 prediction, odds, spread, time: Seahawks vs. Patriots picks from expert on 59-38 roll",
      "NFL DFS, 2026 Super Bowl: Daily Fantasy football picks for Patriots vs. Seahawks on FanDuel, DraftKings",
      "Patriots vs. Seahawks prediction, odds, date, time: 2026 Super Bowl picks from 10,000 model simulations",
      "Super Bowl 2026 weather forecast: Conditions for Patriots vs. Seahawks at Levi's Stadium",
      "Self-learning AI generates 2026 Super Bowl picks, score prediction for Seahawks vs. Patriots",
      "Super Bowl 2026: Where to watch Seahawks vs. Patriots with TV channel, live stream and kickoff time",
      "Super Bowl MVP picks, props, odds: Expert backing Sam Darnold in Seahawks vs. Patriots best bets",
      "Super Bowl 2026 picks, predictions: Why both our experts think the Seahawks are too much for the Patriots",
      "Patriots vs. Seahawks: Where to watch Super Bowl 60, score prediction, picks, betting odds, same-game parlay",
      "Super Bowl 2026 casual fan's guide: Everything to know for Patriots vs. Seahawks",
      "Super Bowl betting: 10 best Super Bowl 60 picks, player props for Patriots vs. Seahawks",
      "Super Bowl 2026: Who is performing America the Beautiful ahead of Patriots vs. Seahawks at Super Bowl LX",
      "Super Bowl 2026: Who is performing the national anthem ahead of Seahawks vs. Patriots in Super Bowl LX?",
      "Patriots vs. Seahawks: Super Bowl LX by the numbers",
      "Ohio State vs. Maryland Prediction, Odds for College Basketball on Thursday, Feb. 5 - Sports Illustrated",
      "Bulls vs Raptors Prediction, Picks & Odds for Tonight’s NBA Game",
      "Jazz vs Hawks Prediction, Picks & Odds for Tonight’s NBA Game",
      "Hornets vs Rockets Prediction, Picks & Odds for Tonight’s NBA Game",
      "76ers vs Lakers Prediction, Picks & Odds for Tonight’s NBA Game"
    ],
    "url": "https://www.cbssports.com/",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/warriors-suns-odds-prediction-time-2026-nba-picks-thursday-february-5/",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxOanNiR1pZdVV0Vm9nYkx6RFN5QWpXTjk0bU1GdDIyQ2xGWHJDZ2ZkRTczV0FreGZGZUcxVktPUDRka0RBOUZJaUNuYktqR1JqTnhxSXhBelRvNHJIWDNaMnk2NFBOTmY2TzFuQUJaaGtBbHdtbWdaY2tNaWdUdEZwOW9zTDgwendPbW4yTnZvcXlFZDJhRWk2RWxmRUlZYUREWlNv?oc=5",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxOcE9HZGRsR1J2elpNYUFGSW9jSG1Hd05WOWlXZzYzTVM0eVpHbkU3cEs0S0R2MTBpQTdHMHF0amlQWDUzc2JOMHItckpPUXNYZmNweEpmcEJMdWg3SlRHMEFzVW1uelhDMTg2OXJJY19peUo4MnRULXpVbHg0YWlpZWNNY2xPaW9CYUxSaWpKQ2lLUjJjTFc0Nm9HRTBCM3hUXzlWZ2h3?oc=5",
      "https://www.cbssports.com/nba/news/wizards-pistons-odds-prediction-spread-time-2026-nba-picks-thursday-february-5/",
      "https://www.cbssports.com/nba/news/bulls-raptors-odds-prediction-time-2026-nba-picks-thursday-february-5/",
      "https://www.cbssports.com/nba/news/nets-magic-odds-prediction-spread-time-2026-nba-picks-thursday-february-5/",
      "https://www.cbssports.com/nba/news/thunder-spurs-odds-prediction-time-line-movement-2026-nba-picks-february-4/",
      "https://www.cbssports.com/nba/news/nuggets-knicks-odds-prediction-spread-time-2026-nba-picks-wednesday-february-4/",
      "https://www.cbssports.com/nfl/news/2026-super-bowl-betting-line-nfl-picks-this-week-patriots-seahawks-predictions-bets/",
      "https://www.cbssports.com/nfl/news/nfl-picks-patriots-seahawks-odds-2026-super-bowl-expert-predictions-spread-props/",
      "https://www.cbssports.com/nfl/news/seahawks-patriots-prediction-odds-spread-start-time-2026-super-bowl-60-expert-picks/",
      "https://www.cbssports.com/nfl/news/super-bowl-60-prediction-odds-spread-time-date-seahawks-patriots-expert-picks/",
      "https://www.cbssports.com/nfl/news/nfl-dfs-2026-super-bowl-patriots-seahawks-daily-fantasy-football-picks-fanduel-draftkings-lineups-advice/",
      "https://www.cbssports.com/nfl/news/patriots-seahawks-prediction-odds-line-spread-time-2026-super-bowl-60-picks-best-bets/",
      "https://www.cbssports.com/nfl/news/super-bowl-2026-weather-forecast-patriots-seahawks-levi-stadium/",
      "https://www.cbssports.com/nfl/news/super-bowl-2026-seahawks-patriots-picks-score-predictions-nfl-best-bets/",
      "https://www.cbssports.com/nfl/news/how-to-watch-super-bowl-2026-patriots-seahawks/",
      "https://www.cbssports.com/betting/news/super-bowl-mvp-picks-props-odds-sam-darnold-seahawks-patriots-best-bets/",
      "https://www.cbssports.com/nfl/news/super-bowl-2026-picks-predictions-expert-head-to-head/",
      "https://www.cbssports.com/nfl/news/patriots-seahawks-where-to-watch-super-bowl-60-score-prediction-picks-betting-odds-same-game-parlay/",
      "https://www.cbssports.com/nfl/news/super-bowl-2026-cheat-sheet-patriots-seahawks/",
      "https://www.cbssports.com/nfl/news/super-bowl-betting-10-best-super-bowl-60-picks-player-props-for-patriots-vs-seahawks/",
      "https://www.cbssports.com/nfl/news/super-bowl-2026-america-the-beautiful-brandi-carlile/",
      "https://www.cbssports.com/nfl/news/charlie-puth-super-bowl-2026-national-anthem/",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOemtMbEZOVjl1UUpxNFBGczZFS1JhRVZwSFdMeUgtQVFDV21fenJZT1VIRVlScWlpajZqc3VIMzA4MU5ldFJPaGhIRERCM3Z6U0R1aHJwUGJQQzdJQklReGl0Yko4UndwVGVXWjd5Q2NwZEFmN0lEVVJ3cmdrYjJXUXpIUEprMDZ5aEFwRndtbnlKc1B2dzZuQU5BV2M4RXprQ2hqcE1qY0NLQQ?oc=5",
      "https://sports.yahoo.com/articles/bulls-vs-raptors-prediction-picks-184100626.html",
      "https://sports.yahoo.com/articles/jazz-vs-hawks-prediction-picks-174500009.html",
      "https://sports.yahoo.com/articles/hornets-vs-rockets-prediction-picks-171500968.html",
      "https://sports.yahoo.com/articles/76ers-vs-lakers-prediction-picks-145800786.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.89,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The New England Patriots and Seattle Seahawks are set to face each other in Super Bowl 60 on Sunday, February 8, 2026, in Santa Clara, California. Sports analysts and models have released their predictions and betting picks for the matchup. Details about pregame performances and halftime entertainment have also been announced ahead of the event.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Lakers Trade Gabe Vincent and Pick to Hawks for Luke Kennard",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 5 Feb 2026 14:25:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Lakers have acquired guard Luke Kennard from the Hawks in exchange for guard Gabe Vincent and a 2032 second-round pick, sources told ESPN's Shams Charania on Thursday.",
      "ATLANTA — The Atlanta Hawks remained busy before Thursday’s NBA trade deadline by acquiring point guard Gabe Vincent and a 2032 second-round draft pick from the Los Angeles Lakers for shooting guard Luke Kennard , a person with knowledge of the move told The Associated Press. Vincent adds depth at point guard in the deal, said the person, who spoke to the AP on condition of anonymity Wednesday night because the trade had not yet received the required league approval. Atlanta’s busy trade season began with the deal which sent All-Star point guard Trae Young to Washington for a package...",
      "ATLANTA (AP) — The Atlanta Hawks remained busy before Thursday's NBA trade deadline by acquiring point guard Gabe Vincent and a 2032 second-round draft pick from the Los Angeles Lakers for shooting guard Luke Kennard, a person with knowledge of the move told The Associated Press. Vincent adds depth at point guard in the deal, said the person, who spoke to the AP on condition of anonymity Wednesday night because the trade had not yet received the required league approval. Atlanta's busy trade season began with the deal which sent All-Star point guard Trae Young to Washington for a package...",
      "The Lakers finally made a move at the deadline, swapping Gabe Vincent for Luke Kennard.",
      "The Lakers are trading Gave Vincent and a 2032 second-round pick to the Hawks for Luke Kennard, according to ESPN's Sham Charania.",
      "So long, cool hand Luke.",
      "The Lakers acquired Luke Kennard from Atlanta in exchange for Gabe Vincent, providing support for stars Luka Doncic, LeBron James and Austin Reaves."
    ],
    "image_url": "",
    "titles": [
      "Lakers acquire Kennard from Hawks, sources say",
      "AP source: Lakers acquire Kennard from Hawks for Vincent, pick",
      "Lakers acquire 3-point shooter Kennard from busy Hawks for point guard Vincent, AP source says",
      "Lakers trade Gabe Vincent to Hawks for Luke Kennard",
      "Lakers reportedly acquire Luke Kennard from Hawks for Gabe Vincent",
      "Report: Hawks flip Kennard for Lakers guard and second, waive Reath",
      "Lakers trade Gabe Vincent to Atlanta for Luke Kennard, no further trades expected"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47838401/sources-lakers-get-shooting-help-trade-hawks-luke-kennard",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/lakers-acquire-3-point-shooter-180948139.html",
      "https://sports.yahoo.com/articles/lakers-trade-gabe-vincent-hawks-154551126.html",
      "https://sports.yahoo.com/nba/breaking-news/article/lakers-reportedly-acquire-luke-kennard-from-hawks-for-gabe-vincent-154206128.html",
      "https://sports.yahoo.com/articles/report-hawks-flip-kennard-lakers-164213071.html",
      "https://sports.yahoo.com/articles/lakers-trade-gabe-vincent-atlanta-162255143.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47838401/sources-lakers-get-shooting-help-trade-hawks-luke-kennard",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Los Angeles Lakers have acquired guard Luke Kennard from the Atlanta Hawks in exchange for guard Gabe Vincent and a 2032 second-round draft pick. The trade was made ahead of the NBA trade deadline and is pending league approval.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Ukraine and Russia Agree to Exchange 314 Prisoners After Talks",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 17:21:57 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The swap - the first since October - sees 157 Ukrainians and 160 Russians returned home.",
      "US, Ukraine, Russia delegations agree to exchange 314 prisoners, Witkoff says Reuters",
      "Ukraine, Russia end second round of peace talks with agreement on prisoner swap, new meeting Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1b55/live/a209eac0-02ae-11f1-83b0-21555a6f44a1.png",
    "titles": [
      "Russia and Ukraine exchange prisoners as peace talks end without breakthrough",
      "US, Ukraine, Russia delegations agree to exchange 314 prisoners, Witkoff says - Reuters",
      "Ukraine, Russia end second round of peace talks with agreement on prisoner swap, new meeting - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/c62np09q7l1o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNNWQ5cHRSQ0RBLTNmQmVkTFlVLTNtNzU5Qm5xc2d3U01WSDFhX0k3TEc1YzNtaXdpY3FOSUY3ai1kX1BOVTQ5eTZydzBUT3FyMG9QaXRfUnZGRXNhc18wRG83a19UbDVUTFdSMmp5MzR5X0MwcHNNNUhjXzNHMFo3cUhrQjhabXhDX19zUkY4Z1F3WEo1R29FY3FhT0t6S1hzRERvemVRSjNJRTF6aldvSEJDMkkxRXhLdG1tTg?oc=5",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUW5XekVHRXo3SS1iMzJ1dkRtNFM1ZkRySmdvOFpUMWxuYzZmUjd3MTdnTlZzNWt4SUdYSEoxWTdkT1lVaXN5WUswLTNWZEdGZXE2Y0lVLXJrbWM3bjZvQ3FuT1F5b2Z3VHJiRk9RaTJndXJMUWhRLTQzOWRnTnQyTW5sSFMxMjQ4WG5TTV84dkVDa19fbTM4aUlhOA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c62np09q7l1o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.733,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about ongoing peace talks and a prisoner exchange between Russia and Ukraine. Although it doesn't report a breakthrough in talks, it does inform about the attempts being made to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukraine and Russia have agreed to exchange 314 prisoners, with 157 Ukrainians and 160 Russians returning home. The agreement was reached during the second round of peace talks, and both sides plan to meet again.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Novo Nordisk Sues Hims & Hers Over Compounded Wegovy Sales",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 16:11:17 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "ft.com"
    ],
    "snippets": [
      "Novo Nordisk to take legal action against Hims & Hers for Wegovy compounding Reuters",
      "Hims said it would sell a copy of the newly launched weight loss pill for $49, far less than the $149 Novo sells the branded pill for.",
      "US telehealth group will sell product for $49 a month, a third that of its Danish competitor"
    ],
    "image_url": "",
    "titles": [
      "Novo Nordisk to take legal action against Hims & Hers for Wegovy compounding - Reuters",
      "Novo Nordisk says it will take legal action after Hims & Hers reveals $49 copy of Wegovy pill",
      "Novo Nordisk hits out at rival Hims & Hers over cheaper weight-loss pill"
    ],
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOZm0yQkFKelpSYU5FcGp6YzFTWTNDdjFXY0NHU3lPRUNCWFJ6eG5MUlJDUFFWZjJoZVJGV3lKbjRDaFdtLVh1VnJVd3N1cGZsRmcxY2dUbkt6RXBHbHdJSEJEeHZsaTNZMDVhZ1VTaUpQc09SOGdwbXdNbkRRNWpndi1vUG1SeHQzeENSRXJDQUhPYm1UNVR2OWZpZTcyM0dLN3BxUjI4R083aG0yTVlQUzVzUGJ6OGxiVll6TQ?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2026/02/05/eli-lilly-novo-nordisk-stock-wegovy-hims-hers-pill.html",
      "https://www.ft.com/content/3a1deeee-f097-4841-9b93-a4293ddba7c6"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOZm0yQkFKelpSYU5FcGp6YzFTWTNDdjFXY0NHU3lPRUNCWFJ6eG5MUlJDUFFWZjJoZVJGV3lKbjRDaFdtLVh1VnJVd3N1cGZsRmcxY2dUbkt6RXBHbHdJSEJEeHZsaTNZMDVhZ1VTaUpQc09SOGdwbXdNbkRRNWpndi1vUG1SeHQzeENSRXJDQUhPYm1UNVR2OWZpZTcyM0dLN3BxUjI4R083aG0yTVlQUzVzUGJ6OGxiVll6TQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.845,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Novo Nordisk has announced it will take legal action against Hims & Hers over the sale of compounded versions of its weight loss drug Wegovy. Hims & Hers recently began offering a similar pill for $49 per month, compared to Novo Nordisk's $149 price for the branded product.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Says Bondi Told Gabbard to Attend Georgia Raid",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 17:15:09 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump says Bondi directed Gabbard to attend Georgia raid Axios",
      "Shifting explanations of Gabbard’s presence at election center intensifies scrutiny of role she played in operation Donald Trump on Thursday offered a new and shifting account of why Tulsi Gabbard, the director of national intelligence, was present last week at an FBI raid of an election center in G"
    ],
    "image_url": "",
    "titles": [
      "Trump says Bondi directed Gabbard to attend Georgia raid - Axios",
      "Trump offers contradictory account of Tulsi Gabbard presence at FBI raid in Georgia"
    ],
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNLWUxeG9xdzJYSkpFc1pwOGdPYVNSbGV3TTE0N3NLcjlScS16eHhISDJTSjhNTGJiazIyTy1fbDJ0UGhXd3hKNy10VURYdDVWOGcyRFlLSGtWdk15RUFTMGo4V085WEJXSktkTGVSUmpDNlJVUlRYNy1RUXVWendYdg?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2026/feb/05/trump-tulsi-gabbard-fbi-raid"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNLWUxeG9xdzJYSkpFc1pwOGdPYVNSbGV3TTE0N3NLcjlScS16eHhISDJTSjhNTGJiazIyTy1fbDJ0UGhXd3hKNy10VURYdDVWOGcyRFlLSGtWdk15RUFTMGo4V085WEJXSktkTGVSUmpDNlJVUlRYNy1RUXVWendYdg?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a political event but doesn't offer in-depth analysis or actionable insights for the reader. The story does not discuss solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Trump stated that Bondi instructed Gabbard to be present at the Georgia raid.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Job Cuts in January 2026 Reach Highest Level Since 2009",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 15:57:40 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "ft.com",
      "news.google.com"
    ],
    "snippets": [
      "With the recent narrative centering on a no-hire, no-fire labor market, the data suggests that the layoff part of the equation could be stepping up.",
      "Numerous new data points to further weakness in labour market",
      "US Companies Announced Most Job Cuts for Any January Since 2009 Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "Layoffs in January were the highest to start a year since 2009, Challenger says",
      "US job cuts surge to highest January total since 2009",
      "US Companies Announced Most Job Cuts for Any January Since 2009 - Bloomberg"
    ],
    "url": "https://www.cnbc.com/2026/02/05/layoff-and-hiring-announcements-hit-their-worst-january-levels-since-2009-challenger-says.html",
    "alternate_urls": [
      "https://www.ft.com/content/378fb2e9-6575-4da2-9769-13cf6bc499ad",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNZXZaWEdlclF3dzJDS0QxTkhHZC02akFMOG9mTHhTbHpjX0ZrY2l6T2MtdHBTLTliOV9kTTdMcVMzdG5IVndHZ0pzaEd2SDdmV2hTd3pqSUlpNW1YYUUyenVCLWdmMHdMQUJ0NUNkbWZwQXdIZXVGY2kxV3c3UTZPUUFySVBXUVVuUUItZktROTJLRU1ETWZKM0VFeDBTdzRZSlB3Y0JjYzE4RWg0WktTOFVHcw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/05/layoff-and-hiring-announcements-hit-their-worst-january-levels-since-2009-challenger-says.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.711,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: start; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "US companies announced more job cuts in January 2026 than in any January since 2009, according to new data, indicating increased layoffs and signs of further weakness in the labor market.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Inquiry Finds Systemic Failures Led to 2021 Channel Boat Tragedy",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 16:37:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "Inquiry chair Sir Ross Cranston said \"systemic failures\" by authorities had led to the deadliest Channel small-boat incident on record.",
      "The report blamed people smugglers and “systemic failure” on the part of the authorities after about 30 people drowned as they tried to reach Britain from France in 2021."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0b5b/live/d2f761d0-0290-11f1-b7e1-afb6d0884c18.jpg",
    "titles": [
      "Deaths were avoidable in UK's worst small boat disaster, inquiry finds",
      "Deaths in Boat Disaster in English Channel Were Avoidable, Inquiry Finds"
    ],
    "url": "https://www.bbc.com/news/articles/cvgp2w95n93o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/05/world/europe/uk-migrants-boat-drowning-inquiry.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvgp2w95n93o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.705,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the boat disaster and the findings of the inquiry. It may help readers understand the importance of safety measures and the consequences of negligence. However, without more details, it's unclear whether it offers solutions or actionable insights.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "An inquiry led by Sir Ross Cranston found that systemic failures by authorities contributed to the 2021 Channel small-boat disaster, in which about 30 people died while attempting to reach Britain from France. The report also blamed people smugglers for the incident.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ilia Topuria Set to Face Justin Gaethje After Return to Training",
    "domain": "politics",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 19:02:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Topuria is expected to fight interim lightweight champion Justin Gaethje next",
      "It appears Ilia Topuria’s temporary hiatus is about to come to an end after the UFC champion teased a return to training."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/05/ec542857-b5b3-4f8b-b9a4-e874f8a4ea85/ilia-topuria-cbs-sports-return-mma-feb-5-2026.jpg",
    "titles": [
      "UFC lightweight champion Ilia Topuria posts 'the champ is back' after reportedly settling dispute with ex-wife",
      "UFC champion Ilia Topuria teases return to training: ‘The champ is back’"
    ],
    "url": "https://www.cbssports.com/ufc/news/ilia-topuria-ufc-lightweight-champion-return-justin-gaethje/",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.cbssports.com/ufc/news/ilia-topuria-ufc-lightweight-champion-return-justin-gaethje/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.693,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a personal event in the life of a public figure. It does not, however, offer any deeper understanding or insight, nor does it report on any solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Ilia Topuria is expected to fight interim lightweight champion Justin Gaethje next, following news that Topuria is preparing to return to training.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ukraine and Russia Swap Prisoners but Make No Progress Toward Peace",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 13:43:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Warring sides exchange 157 prisoners of war each but fail to break deadlock on bringing Russia's war to a close.",
      "Prisoner exchange agreed at most significant contact between Kyiv and Moscow in months, but ‘work remains’ Ukraine and Russia concluded a second day of US-led talks in Abu Dhabi on Thursday without a breakthrough towards ending Europe’s most deadly conflict since the second world war. The two sides"
    ],
    "image_url": "",
    "titles": [
      "Russia-Ukraine talks conclude without breakthrough on ending war",
      "Second day of Ukraine-Russia peace talks in UAE end without breakthrough"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/5/russia-ukraine-talks-end-with-agreement-on-prisoner-swap?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/feb/05/second-day-of-ukraine-russia-peace-talks-in-uae-end-without-breakthrough"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/5/russia-ukraine-talks-end-with-agreement-on-prisoner-swap?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.789,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the ongoing conflict between Russia and Ukraine, and the efforts to resolve it. However, it lacks depth or insight into the reasons behind the conflict, the potential solutions, or the impacts of the war.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukraine and Russia exchanged 157 prisoners of war each during talks in Abu Dhabi, marking their most significant contact in months. Despite the exchange, negotiations ended without progress toward ending the conflict.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Ends Contact With Polish Speaker Over Trump Remarks",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 17:15:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "US Ambassador Tom Rose says: 'We will not permit anyone to harm US-Polish relations, nor disrespect' President Trump.",
      "US cuts contact with Polish parliament speaker over Trump 'insults' Reuters"
    ],
    "image_url": "",
    "titles": [
      "US envoy shuns Polish parliament speaker over Trump remarks",
      "US cuts contact with Polish parliament speaker over Trump 'insults' - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/5/us-envoy-shuns-polish-parliament-speaker-over-trump-remarks?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNcFRzR3pNMG4yclFxSzI0SXlPWUREbl9mLUIydjNIN2k1NzlxVmswQi1rSkhlUkswUFUyNzBUbVpqejE5UE4zRVRkb2lFbHdjRVZIcTNVNlliMWwxUXZMV1ZzbEo0dnljcFdNZmk2S2JzWThhMG8xQjQwNVoweUh3SDBBX2ZtNE9wRUtCOFQ1NWw2OU5yT0ZEeFQwQllTM0lvQ0F4TjV0LVQ1djg?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/5/us-envoy-shuns-polish-parliament-speaker-over-trump-remarks?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.686,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a diplomatic incident but lacks depth and does not provide the reader with actionable insights or a deeper understanding of the situation. It does not highlight progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US has cut contact with the Polish parliament speaker after remarks described as insulting to President Trump. US Ambassador Tom Rose stated that the US will not allow harm to US-Polish relations or disrespect toward President Trump.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Airstrikes Kill at Least 21 in Gaza",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 12:00:42 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Gaza officials said the Israeli airstrikes killed at least 21 Palestinians. Israel said one of its soldiers was critically wounded in the attack by Palestinian gunmen.",
      "Israel strikes across Gaza, killing 24, and says militants attacked its soldiers AP News"
    ],
    "image_url": "https://static01.nyt.com/images/2026/02/04/multimedia/04vid-gaza-strikes-hqtj/04vid-gaza-strikes-hqtj-mediumSquareAt3X.jpg",
    "titles": [
      "Israel Launches Deadly Strikes on Gaza, Saying Militants Attacked Its Soldiers",
      "Israel strikes across Gaza, killing 24, and says militants attacked its soldiers - AP News"
    ],
    "url": "https://www.nytimes.com/2026/02/04/world/middleeast/israel-gaza-strikes-palestinian-deaths.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxQUGRFSGhYbndfTjJGMmpLSDNHMC1jUmRiRnVZeTVyVS1Ubkdjb1l3NlB5RWRXOHJlWVVzWjVKWEstT1dzU3RvcUUwSU9GeUZCSURBZUFETzhDcmtING9yTV9MMG5FTmVITzhwcUFHeGdjdnJUSGluQkVUUWJVVmFNRE5CXzAtcjl5Rm51U1NwS015Tks5ZTJXYmZRUmc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2026/02/04/world/middleeast/israel-gaza-strikes-palestinian-deaths.html",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.752,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.676,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story reports on an ongoing conflict, it doesn't provide enough context or analysis to help readers understand the underlying causes, potential solutions, or broader impacts. It does, however, raise awareness about the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israeli airstrikes in Gaza killed at least 21 Palestinians, according to Gaza officials. Israel reported that one of its soldiers was critically wounded after an attack by Palestinian gunmen. The violence follows continued clashes in the region.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Anthropic Launches Opus 4.6 AI Model With Enhanced Business Features",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 17:53:50 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "cnbc.com",
      "ft.com"
    ],
    "snippets": [
      "Anthropic's latest AI model is better at coding, sustaining tasks for longer and creating high-quality professional work.",
      "Start-up describes Opus 4.6 as its ‘most capable’ model for businesses and knowledge work"
    ],
    "image_url": "",
    "titles": [
      "Anthropic launches Claude Opus 4.6 as AI moves toward a 'vibe working' era",
      "Anthropic launches new Claude model as AI fears rattle markets"
    ],
    "url": "https://www.cnbc.com/2026/02/05/anthropic-claude-opus-4-6-vibe-working.html",
    "alternate_urls": [
      "https://www.ft.com/content/a0cd0281-8367-4ed3-9f18-038e4a9f79e0"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/05/anthropic-claude-opus-4-6-vibe-working.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.08,
      "proximity": 0.5
    },
    "score": 0.668,
    "constructiveness_score": 0.08,
    "constructiveness_reason": "keywords (1): launch; actions: launch; semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Anthropic has released Opus 4.6, describing it as its most capable AI model for businesses and knowledge work. The company says the model offers improved coding, can sustain tasks for longer periods, and produces high-quality professional output.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bank of England Holds Rates at 3.75%",
    "domain": "business",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 15:56:25 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "theguardian.com",
      "ft.com"
    ],
    "snippets": [
      "Bank indicates anti-inflation measures in Rachel Reeves’s budget likely to pave way for rate cuts in months ahead Business live – latest updates UK inflation rises for first time in five months to 3.4% in December Bank of England policymakers have left interest rates unchanged at 3.75%, but indicate",
      "Central bank awaits stronger evidence that inflation is on track to fall to 2% target"
    ],
    "image_url": "https://i.guim.co.uk/img/media/68297ea121df1eb5130289797e137e3c0a869051/355_0_6814_5451/master/6814.jpg?width=140&quality=85&auto=format&fit=max&s=5bea1ef75d1ad7464809244c32fdf440",
    "titles": [
      "Bank of England keeps interest rates at 3.75% as inflation concerns persist",
      "Bank of England holds rates steady at 3.75% in knife-edge vote"
    ],
    "url": "https://www.theguardian.com/business/2026/feb/05/bank-of-england-interest-rates-held-inflation-concerns",
    "alternate_urls": [
      "https://www.ft.com/content/99e4bcbc-cea5-40e6-b9f5-c0eed8fcaa69"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/business/2026/feb/05/bank-of-england-interest-rates-held-inflation-concerns",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: concern); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Bank of England has kept interest rates unchanged at 3.75%, stating it needs stronger evidence that inflation will fall to its 2% target. The bank noted that anti-inflation measures in Rachel Reeves’s budget could support rate cuts in the coming months. UK inflation rose to 3.4% in December, marking its first increase in five months.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. Job Openings Fall to Lowest Level Since 2020",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 10:41:49 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Bloomberg"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "U.S. job openings fell to the lowest level in more than five years, another sign that the American labor market remains sluggish",
      "US Job Openings Drop to Lowest Since 2020, Layoffs Edge Up Bloomberg"
    ],
    "image_url": "https://s.abcnews.com/images/US/wirestory_1304701fb238015de750a931c4175579_4x3_384.jpg",
    "titles": [
      "US job openings fall to 6.5M, fewest since 2020, as labor market remains sluggish",
      "US Job Openings Drop to Lowest Since 2020, Layoffs Edge Up - Bloomberg"
    ],
    "url": "https://abcnews.go.com/Business/wireStory/us-job-openings-fall-65-million-fewest-2020-129884814",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQaE93a1BITk1ISVpIZmFqZmVNYl9xNDMxMmdlLW90Qmlpb3dqOWR4ckYzOVBySVB3LW1Lc0x4M1I2SlJXQ3NjeDFXczM2aGtxM21YTklSaTBwY19icVRtaFJWQWRwS0laVG1YWG5FOWFOU0xueFZidERFMHdMODJvSVR6Q1FaUlQ4UUpOelZld291WUU4SlNNUE5MZ3RDeU1jLTFOZmFQSXFZbkZNR1lfRXZfd1Y?oc=5"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Business/wireStory/us-job-openings-fall-65-million-fewest-2020-129884814",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. job openings have dropped to their lowest level since 2020, according to new data. Layoffs have also slightly increased, indicating continued weakness in the American labor market.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bitcoin Falls Below $70",
    "domain": "business",
    "source_domain": "ft.com",
    "location": "global",
    "published": "Thu, 05 Feb 2026 15:48:30 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "ft.com",
      "news.google.com"
    ],
    "snippets": [
      "Cryptocurrency returns to November 2024 level as it is swept up in tech stock sell-off",
      "Bitcoin Drops Below $70,000, Wiping Out Gain Since Trump’s Win Bloomberg"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F24b5db10-0488-4e94-b125-5ebdb229aaf5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Bitcoin falls below $70,000 to wipe out ‘Trump rally’",
      "Bitcoin Drops Below $70,000, Wiping Out Gain Since Trump’s Win - Bloomberg"
    ],
    "url": "https://www.ft.com/content/f0184274-1ece-4827-add1-e96a870efa53",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNMFhrYXlUeWhjZG05T0ktUW1TLU5CYXcxcnkyeWxFaWFBaFlGSVNuSjRiZnpQeGdvdjNUcWF3MzJaczhSVW5FZ2h0VWMtb09Vdkg4V2ExUlhVQW1xcHVOMFNqeE1oODc4eDVQYnpSN2MyTmtSR3o2NmFGWkU4YTV6Zks5SGhQNjEwSEtZa1Flb1R0NkwxUFp2TGVpN0hmRmpPRDJUZ1Nyd1lOZ3p1M2R2ZzFn?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.ft.com/content/f0184274-1ece-4827-add1-e96a870efa53",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bitcoin fell below $70,000, erasing gains made since Trump's win. The cryptocurrency's value returned to its November 2024 level amid a broader sell-off in tech stocks.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hubble Captures Sharpest Image Yet of Galaxy NGC 7722",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Thu, 05 Feb 2026 16:40 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "This NASA/ESA Hubble Space Telescope image of NGC 7722, a lenticular galaxy located about 187 million light-years away, features concentric rings of dust and gas that appear to swirl around its bright nucleus.",
      "This new Hubble image, released on Jan. 30, 2026, is the sharpest taken of NGC 7722, a lenticular galaxy located about 187 million light-years away in the constellation Pegasus. A lenticular, meaning “lens-shaped,” galaxy is a type whose classification sits between more familiar spiral galaxies and"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2026/02/hubble-ngc7722-potm2601b.jpg",
    "titles": [
      "Hubble Spots Lens-Shaped Galaxy"
    ],
    "url": "https://www.nasa.gov/image-detail/hubble-ngc7722-potm2601b/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/hubble-spots-lens-shaped-galaxy/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/hubble-ngc7722-potm2601b/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.856,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NASA and ESA released the sharpest Hubble Space Telescope image of NGC 7722, a lenticular galaxy about 187 million light-years away in the constellation Pegasus. The image, published on January 30, 2026, highlights concentric rings of dust and gas around the galaxy's bright center.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Administration Withdraws 700 Immigration Officers from Minnesota",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 07:06:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Associated Press"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Trump administration pulling 700 immigration agents from Minnesota Axios",
      "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately AP News"
    ],
    "image_url": "",
    "titles": [
      "Trump administration pulling 700 immigration agents from Minnesota - Axios",
      "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxORUg5THZGdEpkV3ZSM0h5RFhPOThaMnUzVkFWZk9IN0xCNldZcDZDN0o0RlVNbDBxQjN4Y3VKM0kzNkg5aFJ4RV8yYmc2T1M1aUZOYWJ4NmZ1SGlNWVoySXFrRW9rTXA4UURpTzhEbi1MaEk4bVh4NTlrSkEteXEtS1hibTZqak9WZUs5TDNGQWRsd3NiOHdfRw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNd094S2hfeUdZWTFsMkRTZjh0LVhSZDQzVi11STZYT2g5WEdKQ1AxdnQyekhkQmRycXlDV2EwOXFMazZtV3FOQWFuUTRwZUZVRktsRjZzSmdydDBEQzJOSFlzX0VqZS1rWmdFaUNDU0JpWUVPcnlWRF8yaE1MRjBCdXVfVW83WE1mSzZHdHd0RlBuRzU0am5TME5OQVN2OGxTajNFMlY5Q25nZ3lP?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxORUg5THZGdEpkV3ZSM0h5RFhPOThaMnUzVkFWZk9IN0xCNldZcDZDN0o0RlVNbDBxQjN4Y3VKM0kzNkg5aFJ4RV8yYmc2T1M1aUZOYWJ4NmZ1SGlNWVoySXFrRW9rTXA4UURpTzhEbi1MaEk4bVh4NTlrSkEteXEtS1hibTZqak9WZUs5TDNGQWRsd3NiOHdfRw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.657,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.588,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "The Trump administration is withdrawing 700 immigration officers from Minnesota effective immediately, as confirmed by multiple sources.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Andrew Mountbatten Windsor Moves to King Charles IIIs Estate",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Wed, 04 Feb 2026 21:09:17 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Andrew Mountbatten-Windsor was stripped of his titles last year and told to give up his grand residence because of growing concern over his links to Jeffrey Epstein.",
      "The former Prince Andrew moves to King Charles III's private estate after Epstein document uproar AP News"
    ],
    "image_url": "https://static01.nyt.com/images/2026/02/04/multimedia/04xp-prince-andrew-01-hjvm/04xp-prince-andrew-01-hjvm-mediumSquareAt3X.jpg",
    "titles": [
      "Former Prince Andrew Moves Out of Royal Home Amid Fresh Epstein Revelations",
      "The former Prince Andrew moves to King Charles III's private estate after Epstein document uproar - AP News"
    ],
    "url": "https://www.nytimes.com/2026/02/04/world/europe/andrew-epstein-uk-home-windsor-sandringham.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNTYwSGlGT19pcWxTMldYbnd5MDBxMktnQUg1b2JGS2lHME1WaE1SYXUzT0RXdHFuZVNsZkFJd296ajJYcXh2dzNlaXY0ai15c3QzcURqSHllUjBCbG1jeHlhSHFrYnlXcThOcW9XOXV4WndNU0tpTnpMak9uai10RmhweUtPdWFwSWJvMktVQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/andrew-epstein-uk-home-windsor-sandringham.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.498,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.568,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the ongoing Epstein scandal and its impact on Prince Andrew, but it doesn't seem to provide actionable insights, deeper understanding, or report on solutions or attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Andrew Mountbatten-Windsor has relocated to King Charles III's private estate after losing his titles and residence last year, following increased scrutiny over his connections to Jeffrey Epstein.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Democrats Issue Ten Demands in ICE Funding Negotiations",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 05 Feb 2026 04:46:32 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Dems outline 10 demands in letter to GOP leaders in ICE funding fight Axios",
      "Dems embrace \"law and order\" in ICE shutdown fight Axios"
    ],
    "image_url": "",
    "titles": [
      "Dems outline 10 demands in letter to GOP leaders in ICE funding fight - Axios",
      "Dems embrace \"law and order\" in ICE shutdown fight - Axios"
    ],
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOb182ZnVxQUkxdi16YWtRWFpXLS1OZmJSTEQzdE5haHc1X2JGbmNrbHM4NnNvS2kxbWsyWmVtclIzVTBiajFSVUVKdHNOenJ1YngyR3hlaW1YWlphNFg5V3hOVWhSQU5EOF9HTlVvYXpXY3NyamwtMk1CVnpCU3NITnBQanlPWkkyU3pYcFYya1RGa3Vt?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiigFBVV95cUxQeUFzSGd1bjNGa2d5eUFMZWtOMG5TZlQwS0tMUVNLOVpOUFdVMFk4THRJLVBia3pOaTdfMmVRSldncERzMHBzQXpVOWNfRHZ6TnpUM0pNNjNnRlN3N3cwek56eDFkWUdiRmRwOVpFcThDQTFSdUM0RDNDZ3FobTdfNUthdEFDN2ZQaFE?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOb182ZnVxQUkxdi16YWtRWFpXLS1OZmJSTEQzdE5haHc1X2JGbmNrbHM4NnNvS2kxbWsyWmVtclIzVTBiajFSVUVKdHNOenJ1YngyR3hlaW1YWlphNFg5V3hOVWhSQU5EOF9HTlVvYXpXY3NyamwtMk1CVnpCU3NITnBQanlPWkkyU3pYcFYya1RGa3Vt?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.615,
      "consensus": 0.35,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story offers useful context about the political debate over ICE funding. It provides information about the demands of the Democrats, which could help readers understand their position and the potential implications for immigration policy. However, without more detail, it's unclear whether it provides a balanced view or discusses potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Democrats have sent a letter to Republican leaders outlining ten demands as part of ongoing negotiations over funding for Immigration and Customs Enforcement (ICE), emphasizing a 'law and order' approach in the debate over a potential ICE shutdown.",
    "is_trending": false,
    "trending_score": 0.0
  }
]