[
  {
    "title": "China Marks WWII Anniversary with Military Parade, Showcases New Missile",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 00:20:32 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Deutsche Welle",
      "ABC News",
      "New York Times",
      "Financial Times",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.dw.com",
      "www.ft.com",
      "www.npr.org",
      "abcnews.go.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "It was a grand display of China's ambitions as thousands of goose-stepping soldiers marched through Tiananmen Square in the heart of Beijing, as Chinese President Xi Jinping looked on from above.",
      "The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons.",
      "It's the first time the three world leaders have been seen together in public.",
      "During the parade, China unveiled an intercontinental strategic nuclear missile known as the DF-5C.",
      "Beijing holds a grand military parade, showcasing new hardware before world leaders at Tiananmen Square.",
      "China has held a massive military parade to commemorate 80 years since Japan surrendered at the end of World War II. North Korea's Kim and Russia's Putin were at the event hosted by China's Xi. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFByYkJtMVo1Rko5TWlueXY1VDIxY2JNS0ZKQUNibU9fSHlJQU1kNHlHUWNvNjVMM2stVHpUNHI4YnN1aGdMR1ZjUkxuR2ZQLTRNZUVnT09peWc1Q1ZUZlU3WG5SaDVZeEpoalEyeHdxMDNyeWRjYkZydjUxT2FaRFE?oc=5\" target=\"_blank\">Photos: Xi, flanked by Putin and Kim, hosts China's larg",
      "Trump took to social media as China's Xi Jinping, North Korean leader Kim Jong Un and Russian President Vladimir Putin appeared together in Beijing.",
      "Beijing sends ‘peace or war’ warning while Trump accuses leaders of ‘conspiring’ against US",
      "China used a parade of fighter jets, missiles and goose-stepping troops to honor the country’s wartime sacrifice and issue a defiant warning to rivals.",
      "China will mark Japan’s defeat in World War II with a parade of missiles, soldiers and leaders like Kim Jong-un of North Korea and Vladimir Putin of Russia."
    ],
    "image_url": "",
    "titles": [
      "China's Xi displays military might, global ambitions at elaborate parade",
      "Watch: Key moments from China's military parade",
      "Moment Xi, Putin and Kim pose with world leaders at China's military parade",
      "Watch: New ICBM missile on display at China's military parade",
      "Xi Jinping leads Beijing parade displaying China’s military power",
      "China's Xi hosts Putin, Kim at Beijing military parade",
      "Photos: Xi, flanked by Putin and Kim, hosts China's largest-ever military parade - Axios",
      "Trump reacts as Putin, Kim Jong Un and Xi appear together at China's military parade",
      "Xi hails ‘unstoppable’ China at landmark military parade with Putin and Kim",
      "China’s Military Spectacle",
      "Xi’s Parade to Showcase China’s Military Might and Circle of Autocrats"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.923,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China held a significant military parade in Tiananmen Square, Beijing, commemorating 80 years since Japan's WWII surrender, attended by President Xi Jinping, North Korea's Kim Jong Un, and Russia's Vladimir Putin. This marked the first public appearance together for the three leaders. The event showcased China's military capabilities, including the unveiling of the DF-5C intercontinental strategic nuclear missile. The parade served both as a remembrance of wartime sacrifices and a demonstration of China's growing military strength.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 11 in Caribbean, Escalating Tensions with Venezuela",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 19:07:53 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Axios",
      "Deutsche Welle",
      "New York Times",
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "President Trump says the U.S. military has struck a drug-laden vessel in the southern Caribbean after it left Venezuela. The strike comes a week after Washington deployed warships to the region.",
      "The US military attack comes as the US surges military presence in the Caribbean, risking an escalation with Venezuela.",
      "Donald Trump has previously claimed Venezuela's Nicolas Maduro is a drug-trafficking threat to the US. Washington recently announced plans to boost its presence in the waters off Venezuela to combat drug cartels.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOQ0xqSVlJTVlxMW85dkY5U1F5LWdYY0phT0l3Q1JEakRJNUNmNl9Od2xDVFdLTVd5VElTV0RSMVQyWmZFdFBMTHhuTksydTVFTUlCdmVqdnBJdHZoOEY0dEF2VzdYbl94LTRLTUVsS1I5dTdfNEhpTWZVX0RRVjRvMWRkdzc?oc=5\" target=\"_blank\">Trump: U.S. killed 11 \"narcoterrorists\" in strik",
      "<p>Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions </p><p>The US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between",
      "The attack is a dramatic escalation that coincides with the administration’s growing counternarcotics focus and its intensifying feud with the Venezuelan leader, Nicolas Maduro.",
      "The vessel was transporting illegal narcotics through international waters to the United States, the president said."
    ],
    "image_url": "",
    "titles": [
      "Trump confirms U.S. strike on alleged Venezuelan drug boat",
      "Trump says 11 killed in strike on alleged drug-carrying boat from Venezuela",
      "US says it struck drug-carrying vessel that left Venezuela",
      "Trump: U.S. killed 11 \"narcoterrorists\" in strike off Venezuela - Axios",
      "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "U.S. kills 11 in strike on alleged drug vessel from Venezuela, Trump says",
      "Trump Says U.S. Attacked Boat Carrying Venezuelan Gang Members, Killing 11"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.828,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. military conducted a strike on a drug-laden vessel in the southern Caribbean, killing 11 \"narcoterrorists\" as it left Venezuela, according to President Trump. This action, described by Trump as taking out the vessel in international waters, escalates tensions between the U.S. and Venezuela. It follows the recent deployment of U.S. warships to the region, aligning with the administration's increased focus on counternarcotics efforts and its ongoing feud with Venezuelan leader Nicolas Maduro.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Djokovic Beats Fritz to Reach US Open Semis, Faces Alcaraz Next",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 04:10:01 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "CBS Sports",
      "ESPN",
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.espn.com",
      "www.cbssports.com",
      "www.bbc.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "Novak Djokovic sets up a blockbuster US Open semi-final encounter with Carlos Alcaraz after battling past American Taylor Fritz.",
      "Novak Djokovic beat local favourite Taylor Fritz to set up a blockbuster semifinal clash with No 2 seed Carlos Alcaraz.",
      "Novak Djokovic engaged in some back-and-forth with those in the crowd pulling for the last American man in the field as he advanced to a record-extending 53rd Grand Slam semifinal.",
      "Djokovic, unbeaten vs. Fritz, saved 11 of the 13 break points he faced",
      "Djokovic denied Fritz on a series of break points as he escaped with a 6-4 7-5, 3-6, 6-4 win to reach the semi-finals"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/aa21/live/27064cb0-8879-11f0-9fde-235874aa714e.jpg",
    "titles": [
      "'Lucky' Djokovic to face Alcaraz after battling past Fritz",
      "Djokovic to play Alcaraz in US Open semifinal after defeating Fritz",
      "Djokovic spars with US Open crowd, ousts Fritz",
      "US Open 2025: Novak Djokovic beats Taylor Fritz in four sets, advances to face Carlos Alcaraz in semifinals",
      "How Novak Djokovic tormented and embarrassed Taylor Fritz to extend US Open nightmare"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.901,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Novak Djokovic defeated Taylor Fritz with scores of 6-4, 7-5, 3-6, 6-4 to advance to the US Open semi-finals, setting up a match against the No. 2 seed Carlos Alcaraz. During the match, Djokovic saved 11 out of 13 break points and engaged with the crowd supporting Fritz, the last American man in the tournament. This victory marks Djokovic's record-extending 53rd Grand Slam semi-final appearance.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Releases 33,000 Pages on Epstein, Full Disclosure Demanded",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 01:12:07 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "But Republicans and Democrats alike say the files, including jail CCTV, contain little new information.",
      "Committee on Oversight and Government Reform publishes documents but two lawmakers push for &#039;full release&#039; of files.",
      "A US Congressional committee has released over 33,000 pages of files on notorious sex offender Jeffrey Epstein. Democrats said most of the information was already public.",
      "<p>This blog has now closed. You can read more of our US politics coverage <a href=\"https://www.theguardian.com/us-news/us-politics\">here</a></p><p>Donald Trump’s “exciting announcement” expected at 2pm ET will be “related to the Department of Defense”, White House press secretary Karoline Leavitt s",
      "<p>Files appear to contain information already in public domain as calls grow for release of all pertinent documents </p><p>The US House of Representatives oversight committee on Tuesday released thousands of pages of records related to the disgraced financier and convicted sex offender Jeffrey Epst",
      "It is not yet clear what share of the files released Tuesday contained previously unknown information."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0dcc/live/03b4ef40-8861-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "US House panel releases 33,000 pages of Epstein files",
      "US House committee releases over 33,000 pages of Epstein-related records",
      "US House committee releases thousands of Epstein files",
      "US House committee releases batch of Epstein records as White House fights release of all files – as it happened",
      "US House committee releases more than 33,000 pages of Jeffrey Epstein files",
      "House Committee Releases First Set Of Subpoenaed Epstein Files"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.847,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US House of Representatives oversight committee released over 33,000 pages of files on Jeffrey Epstein, with most information already public. Despite the release, calls for the full disclosure of all relevant documents continue, as both Republicans and Democrats note the lack of new insights in the disclosed files. The current status focuses on the demand for complete transparency, with some lawmakers advocating for the full release of all pertinent documents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Won't Sell Chrome, Faces Deal Restrictions After Antitrust Ruling",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 23:03:45 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Business Insider",
      "The Verge",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com",
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE42Ymk1ZG1rOFFTQnFtWHNIWUplalVqdnZBQUoyeXJPMHk4Q2tycWhBcklrY082V3Rnb0podGpuYmNhR3hucFJnaXBTbGV1Z2tlTkpPQ0s4R0h2WlRfckZoMm90aUJ0MVZ2TG1aYQ?oc=5\" target=\"_blank\">Google won't have to sell Chrome in antitrust win</a>&nbsp;&nbsp;<font color=\"#6f",
      "Google is barred from having exclusive contracts for its search, Chrome, Google Assistant, and Gemini app products, but doesn't have to sell Chrome.",
      "Google will not have to sell its Chrome browser in order to address its illegal monopoly in online search, DC District Court Judge Amit Mehta ruled on Tuesday. Over a year ago, Judge Mehta found that the search giant had violated the Sherman Antitrust Act; his ruling now determines what Google must ",
      "Google's penalty for being a search monopoly does not include selling Chrome."
    ],
    "image_url": "",
    "titles": [
      "Google won't have to sell Chrome in antitrust win - Axios",
      "Google can keep Chrome &mdash; but it can't have exclusive search deals, judge rules in antitrust case",
      "Google gets to keep Chrome, judge rules in search antitrust case",
      "Google won’t have to sell Chrome, judge rules"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.81,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge ruled that Google, previously found to violate the Sherman Antitrust Act, will not have to sell its Chrome browser. However, the company is prohibited from making exclusive deals for its search engine and other products like Chrome, Google Assistant, and the Gemini app on devices. This decision by U.S. District Court Judge Amit Mehta comes after considering the impact of generative AI on the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company to Launch Teen Mental Health Feature Amid Lawsuit",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 04:09:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "www.aljazeera.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "AI company announces changes amid growing concern over the effect of chatbots on young people&#039;s mental health.",
      "OpenAI said Tuesday it plans to route sensitive conversations to reasoning models like GPT-5 and roll out parental controls within the next month – part of an ongoing response to recent safety incidents involving ChatGPT failing to detect mental distress.",
      "Promised protections follow reports of vulnerable users misled in extended chats."
    ],
    "image_url": "",
    "titles": [
      "OpenAI announces parental controls for ChatGPT after teen’s suicide",
      "OpenAI to route sensitive conversations to GPT-5, introduce parental controls",
      "OpenAI announces parental controls for ChatGPT after teen suicide lawsuit"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "An upcoming feature aimed at monitoring the mental health of teenagers will be launched by a company within the month. This announcement comes after a lawsuit was filed by a U.S. couple against OpenAI, blaming the firm for their son's suicide. The initiative seeks to address concerns about the safety of vulnerable users in extended chats.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Moves US Space Command HQ to Alabama, Reversing Biden's Decision",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 16:09:54 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "President Trump announced he intends to move U.S. Space Command headquarters to Huntsville, Ala., after a protracted battle over whether it would stay in Colorado, as former President Joe Biden advocated.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQRm1nU3A1NmxPd3dtaXFVem1FTnFTOWlBa0Q5cml6Zkd1c0V0aExTTFlGS2ZnckNjaDR4c1pXU2JBQmVGQWZEaWVCazlUbGllOTQ3MDZHVDd4TEROMGRzWXplMkJ6bXBBVmN4RGkxWjhTcHFZYUp2S2s5TVdyOVRhYUVGOEpmdlVOVTFCbHRnYWNpRUdpNXN3Sg?oc=5\" target=\"_blank\">Colorado vows to chal",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQMWNVQXhmLVhrd01FMmR6aEFoT2FWTFFDZ2RCUWNXaGliencxc1IzQ2lqRUZueUpOeGFodUdQN0Yza04xX3BHdHMya3RCNThWVGRmVWhxSG1KQk9YSVFNa1lLWmNfMHVIMF9OenVnQ200cHQ4bmJ1TkJSUHJIekdqaVhmUzdOdw?oc=5\" target=\"_blank\">Trump will move U.S. Space Command from Color",
      "WASHINGTON (AP) — President Donald Trump announced on Tuesday that U.S. Space Command will be located in Alabama, reversing a Biden-era decision to keep it at its temporary headquarters in Colorado. The long-expected decision from Trump caps a four-year tug of war between two states and opposing adm"
    ],
    "image_url": "",
    "titles": [
      "Trump says Space Command will move to Alabama, after long battle over its HQ",
      "Colorado vows to challenge Space Command move to Alabama - Axios",
      "Trump will move U.S. Space Command from Colorado Springs to Alabama - Axios",
      "Trump announces that Space Command is moving from Colorado to Alabama"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced the relocation of U.S. Space Command headquarters from Colorado to Huntsville, Alabama, reversing a decision by former President Joe Biden to keep it in Colorado Springs. This move concludes a four-year dispute between the two states over the command's location. The announcement was made during Trump's first public appearance in a week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Criticizes China's Military Parade Attended by Putin, Kim Jong Un",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 03:45:58 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "Russian President Vladimir Putin and North Korea's Kim Jong Un are among the leaders from more than 20 countries attending the \"Victory Day\" military parade in Beijing.",
      "<p>Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to west</p><p>Xi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance to "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f29c/live/0334e570-8843-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Trump accuses Xi of conspiring against US with Putin and Kim",
      "China's Xi says the world faces 'peace or war' as Trump claims Beijing conspiring against U.S.",
      "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.893,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump criticized China's \"Victory Day\" military parade, which was attended by Russian President Vladimir Putin and North Korean leader Kim Jong Un, among leaders from over 20 countries. The event, described as China's largest-ever military parade, was seen as a display of defiance to the West. Chinese President Xi Jinping framed the occasion as a choice between peace or war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Devers' Home Run Sparks Brawl, Multiple Ejections in Giants-Rockies Game",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 05:16:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Devers had to wait until after the fight to finish his home run trot",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPblFESXU4My1qajNYYngwYmhOMDhxSEdwNTc3dlQzelljU3VFR1FtdC1TbWRPTTZobWc5T01wNFhCc1lKeUVHNDdzWlJfdmxBdEF2d2RLeUY0bGs3amp1NENnZENHemJsOTJuclI2b0ViMkV0Wmx2NExKZTZ5WVIxd282R2pUZHV0dGJjT0YxdEVlQWxNUDhGXzNB?oc=5\" target=\"_blank\">Punches Thrown By R",
      "<p>Watch as San Francisco Giants star Rafael Devers hits a two-shot home run vs. the Colorado Rockies, triggering a bench-clearing brawl with multiple players being ejected.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/03/2f0f9598-aaa0-4c9a-bd3b-6d55b435bdb9/giants-rockies-brawl-getty.png",
    "titles": [
      "WATCH: Giants, Rockies get into benches-clearing brawl after Rafael Devers admires home run off Kyle Freeland",
      "Punches Thrown By Rockies, Giants in Heated Altercation After Rafael Devers Home Run - Sports Illustrated",
      "Devers home run trot turns into bench-clearing brawl vs. Rockies"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rafael Devers, a player for the San Francisco Giants, hit a two-run home run against the Colorado Rockies, which led to a bench-clearing brawl. Following the incident, multiple players were ejected from the game. The altercation delayed Devers' completion of his home run trot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Advances to US Open Semi-Finals, Dominates Lehecka",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 02:56:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "Sky Sports"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Alcaraz dominated Czech player Jiri Lehecka in the quarters, with the Spaniard yet to lose a set at this year&#039;s event.",
      "Carlos Alcaraz has been spending his days off in New York practicing more than just his tennis. The Spaniard has taken to the golf course for a little off-court fun.",
      "Carlos Alcaraz is through to the semi-finals of the US Open after a clinical 6-4 6-2 6-4 victory over&#160;Jiri Lehecka at Arthur Ashe Stadium in New York."
    ],
    "image_url": "",
    "titles": [
      "US Open: Carlos Alcaraz cruises into 2025 semifinals",
      "Carlos Alcaraz Swings Between Tennis And Golf At U.S. Open",
      "Alcaraz clinically dispatches Lehecka to make US Open semi-finals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlos Alcaraz advanced to the semi-finals of the US Open with a decisive 6-4, 6-2, 6-4 win against Jiri Lehecka at Arthur Ashe Stadium in New York. Demonstrating exceptional skill, Alcaraz impressed the crowd with a stunning backhand winner during a 21-shot rally. He reached the last four without dropping a set, showcasing his dominance in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Court Orders Google to Share Search Data, Retain Chrome and Android",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 23:51:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Fortune"
    ],
    "domains": [
      "www.dw.com",
      "fortune.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "A US court ruled the company must share certain information with rival companies to increase competition. Google said the move could result in its rivals having access to its technology.",
      "In a 230-page ruling, U.S. District Court Judge Amit Mehta wrote that \"the emergence of generative AI has changed the course of this case.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5e51/live/ac363ff0-8890-11f0-aed1-db23423f7cc8.jpg",
    "titles": [
      "Google avoids break-up but must share data with rivals",
      "Google must share search data with competitors, judge rules",
      "Judge rules Google must share some search data and end exclusive distribution deals, but won’t force Google to sell Chrome"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.823,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A US court has ruled that Google must share specific search data with its competitors to boost competition, while allowing the tech giant to retain its Chrome web browser and Android operating system. Google expressed concerns that this decision might lead to rivals accessing its technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ohtani Hits 100th Homer at 120 mph; Kershaw to Pitch in Dodgers-Pirates Series",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 02:01:08 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Shohei Ohtani hit his 100th home run with the Dodgers in his 294th game with the team, the fastest in franchise history.",
      "<p>Watch as Los Angeles Dodgers&#8217; Shohei Ohtani hits his 100th homer since joining the club vs. the Pittsburgh Pirates at a scorching 120 m.p.h. cutting into the lead. </p>"
    ],
    "image_url": "",
    "titles": [
      "Ohtani belts 100th HR with Dodgers in record time",
      "Ohtani crushes his 100th home run in a Dodgers uniform vs. Pirates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Shohei Ohtani hit his 100th homer with the Los Angeles Dodgers at a speed of 120 mph against the Pittsburgh Pirates. Meanwhile, Clayton Kershaw is set to pitch in the opening of a three-game series between the Dodgers and the Pirates, with live coverage starting at 6:30 p.m. ET / 3:30 p.m. PT on Sportsnet and Sportsnet+.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deion Sanders Defends Timeout Decision Amid Criticism",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 02:01:08 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "A feisty Deion Sanders is pushing back against anyone second-guessing his clock management or calling out his coaching staff.",
      "Colorado elected not to use its final two timeouts against Georgia Tech"
    ],
    "image_url": "",
    "titles": [
      "Sanders bites back over Buffs' clock management",
      "Colorado's Deion Sanders doubles down on controversial clock management decisions in Georgia Tech loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Deion Sanders, responding to criticism, defends his decision not to use Colorado's last two timeouts in a game against Georgia Tech. Critics questioned his clock management and coaching staff choices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Deports Tren de Aragua Gang Members to El Salvador Prison",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 01:10:08 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "The administration deported people designated as Tren de Aragua members to a notorious prison in El Salvador where, it argued, U.S. courts could not order them freed.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQamIzWGlocnFkdjgtdnlJTXYyUjNzVmpqX24tdnRZODI5TlNtR01KbEJOVkNVWTR3QnVQdDhUeE15MnFGa1FKeEFwbE41NEpwX19DS1ljMlNvRF9nMDA2YkhMTDBxeXRzbmktNUhpbnBJS1JNVTFQcU1ZamFpUFoxX1VRQVFDUlhsc3hmTDVxUQ?oc=5\" target=\"_blank\">Appeals court blocks Trump from d"
    ],
    "image_url": "",
    "titles": [
      "Trump cannot use Alien Enemies Act to deport Venezuelan gang members, appeals court rules",
      "Appeals court blocks Trump from deporting Venezuelans under Alien Enemies Act - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. administration deported individuals identified as members of the Tren de Aragua gang to a high-security prison in El Salvador, arguing that this action places them beyond the reach of U.S. courts, which cannot demand their release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Landslide in Sudan's Darfur Kills 1,000; Sole Survivor Found",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 12:28:19 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor</p><p>More than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.</p><p>The landslide on Sunday, which followed heavy rain, destroy",
      "A landslide in a remote area of Darfur destroyed an entire village, a rebel group holding the territory said. Heavy rains are hampering rescue efforts.",
      "The landslide leveled a village in the remote Marra mountains, a local rebel group said. Its leader appealed for urgent help, saying, “This is a nightmare.”"
    ],
    "image_url": "https://i.guim.co.uk/img/media/03dc5a6b2c751338fd52cd91f110b6655f8e0e57/528_0_1440_1152/master/1440.jpg?width=140&quality=85&auto=format&fit=max&s=57101a89b9bedbe72cc519aec322f861",
    "titles": [
      "Sudan landslide kills at least 1,000 people, rebel group says",
      "Sudan landslide may have killed scores, U.N. says",
      "Landslide Kills Hundreds in Sudan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.649,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A landslide in Sudan's Darfur region, caused by heavy rain, destroyed a village in the Marra Mountains, leaving over 1,000 people dead with only one survivor. The Sudan Liberation Movement/Army, which controls the area, has called for international assistance to recover bodies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Usyk Not Expected to Fight Parker in 2023, Says Promoter",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Wed, 03 Sep 2025 07:38:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "Usyk is set to fight mandatory WBO title challenger Parker next",
      "Oleksandr Usyk is not expected to fight again this year, says promoter Frank Warren."
    ],
    "image_url": "",
    "titles": [
      "Oleksandr Usyk not expected to fight again this year as Joseph Parker waits on",
      "Usyk back in 2026? Warren doubts he will fight again this year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oleksandr Usyk is scheduled to fight mandatory WBO title challenger Parker next, according to recent reports. However, Usyk's promoter, Frank Warren, has stated that Usyk is not expected to fight again this year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros' Valdez Apologizes for Hitting Catcher Salazar After Grand Slam Incident",
    "domain": "sports",
    "source_domain": "clutchpoints.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 07:21:42 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "clutchpoints.com"
    ],
    "snippets": [
      "Astros All-Star Framber Valdez crossed up catcher Cesar Salazar after allowing a grand slam to Yankees' Trent Grisham",
      "<p>Houston Astros starter Framber Valdez said he apologized to catcher César Salazar after hitting him in the chest with a pitch Tuesday night, but he insisted that he didn’t hit his teammate on purpose.</p>"
    ],
    "image_url": "",
    "titles": [
      "Did Astros’ Framber Valdez intentionally hit own catcher with pitch?",
      "Astros starter Valdez says he did not intentionally hit catcher Salazar"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Astros pitcher Framber Valdez apologized to catcher César Salazar for accidentally hitting him with a pitch after allowing a grand slam to Yankees' Trent Grisham. Valdez insists the incident was not intentional.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Marc Guehi's Move to Liverpool Falls Through Before Deadline",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 07:00:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Defender should still end up at Anfield despite deadline drama, but the manager’s hardline stance may worry the club board</p><p>“Marc and me, we have the same fate,” Oliver Glasner said with a smile. It was the eve of Crystal Palace’s meeting with Liverpool in the Community Shield and – not for ",
      "Marc Guehi remains a Crystal Palace player after his Deadline Day move to Liverpool collapsed."
    ],
    "image_url": "https://i.guim.co.uk/img/media/e66e307ad34fab7f1e7683a37d4c920ec924c034/616_0_6159_4927/master/6159.jpg?width=140&quality=85&auto=format&fit=max&s=1ee377b14b7a8bc23e3941ad09cd919d",
    "titles": [
      "Guéhi’s cancelled Liverpool move puts heat on Palace to keep Glasner happy | Ed Aarons",
      "Guehi's failed Liverpool move: Views from inside Palace explained"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Marc Guehi's transfer from Crystal Palace to Liverpool failed to materialize before the deadline, despite expectations of a move. The collapse may raise concerns within Liverpool's management due to the firm stance taken by their manager, Oliver Glasner, who had linked his fate to the player's potential transfer. Guehi remains with Crystal Palace following the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India to Face Pakistan in T20 Cricket Tournament",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 06:56:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "www.aljazeera.com"
    ],
    "snippets": [
      "When will India play Pakistan, and where? Which teams are in? Al Jazeera&#039;s lowdown on the T20 tournament&#039;s schedule.",
      "When will India play Pakistan, and where? Which teams are in? Al Jazeera’s lowdown on the T20 tournament’s schedule."
    ],
    "image_url": "",
    "titles": [
      "Asia Cup 2025: Full match schedule, teams, format and India vs Pakistan",
      "Asia Cup 2025: Full match schedule, teams, format and India vs Pakistan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "India is scheduled to play Pakistan in an upcoming T20 cricket tournament. The match's location and the list of participating teams have been detailed in Al Jazeera's coverage of the event's schedule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Won't Sell Chrome, Faces Deal Restrictions After Antitrust Ruling",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 17:15:23 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Business Insider"
    ],
    "domains": [
      "www.npr.org",
      "www.businessinsider.com"
    ],
    "snippets": [
      "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "Judge Amit Mehta's ruling in the Google antitrust case drew mixed reactions, with some disappointed that the search giant wasn't broken up."
    ],
    "image_url": "",
    "titles": [
      "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "Business and tech leaders respond to the Google antitrust ruling after a judge spared it from a Chrome sell-off"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.796,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge ruled that Google, previously found to violate the Sherman Antitrust Act, will not have to sell its Chrome browser. However, the company is prohibited from making exclusive deals for its search engine and other products like Chrome, Google Assistant, and the Gemini app on devices. This decision by U.S. District Court Judge Amit Mehta comes after considering the impact of generative AI on the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Judge Rules National Guard's ICE Raid Involvement in LA Illegal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 00:41:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE8zaHF1QU9SMnFGeFR6bENuTDBOYW02SFFMU3kyRUJQVzRpSUIwYnVZa3hFMjRDVjdqX0ZVQ1lEbElDVEtzQ083WHZOcU5qRG9wZmhCU0xpay1Kcjh1YnQ4THc1X0hGRThpZzlfQ2ZGVQ?oc=5\" target=\"_blank\">National Guard illegally performed law enforcement in LA, judge rules</a>&nbs",
      "The ruling from federal Judge Charles Breyer in San Francisco comes as President Trump mulls deploying National Guard troops to Chicago and other cities."
    ],
    "image_url": "",
    "titles": [
      "National Guard illegally performed law enforcement in LA, judge rules - Axios",
      "Trump can’t use National Guard, military in California to enforce laws, Judge Breyer rules"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge in San Francisco, Charles Breyer, ruled that the National Guard's involvement in law enforcement activities in Los Angeles, specifically accompanying ICE agents on immigration raids, was illegal under federal law. This decision comes amid considerations by the Trump administration to deploy National Guard troops to various cities to address crime.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Governor Lisa Cook Sues Trump to Block Dismissal Over Fraud Claims",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 21:59:42 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Federal Reserve Governor Lisa Cook is suing President Donald Trump to block him from firing her, saying that his mortgage fraud allegations are not true.",
      "Lawyers for Fed Governor Lisa Cook said the alleged contradictions in her mortgage records were already disclosed to the government."
    ],
    "image_url": "",
    "titles": [
      "Fed Governor Lisa Cook 'did not ever commit mortgage fraud,' her lawyer says",
      "Fed Governor Lisa Cook 'did not ever commit mortgage fraud,' attorneys say"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Federal Reserve Governor Lisa Cook has filed a lawsuit against President Donald Trump, aiming to prevent her dismissal over accusations of mortgage fraud, which she denies. Cook's legal team asserts that the supposed discrepancies in her mortgage documents had been previously disclosed to authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Can Keep Chrome, Must End Exclusive Search Deals: Court Ruling",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 23:38:35 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The ruling comes nearly a year after a U.S. judge ruled that Google holds an illegal monopoly in its core market of internet search.",
      "Google can keep its Chrome browser and continue to enter in revenue-sharing agreements for Apple, but must end exclusive contracts in search and some other businesses."
    ],
    "image_url": "",
    "titles": [
      "Google stock jumps 8% after search giant avoids worst-case penalties in antitrust case",
      "Alphabet and Apple stocks rally after Google antitrust ruling avoids the worst-case scenario"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nearly a year after a U.S. judge found Google had an illegal monopoly in internet search, a new ruling allows Google to retain its Chrome browser and maintain revenue-sharing deals with Apple. However, Google is required to cease exclusive contracts in search and certain other sectors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elon Musk Introduces AI-Powered \"Cyber Piano\" with Artist Mimicry Capability",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 16:58:50 GMT",
    "source": "Bloomberg",
    "sources": [
      "Ars Technica",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPRVI1bjJVRzkwQzhRSmx5REc2TXRmOWNyLWN3SUI2bF8zeFBjVW1GN0tRU2VCNjVyR2NwRUZ1QVRFSm4zUFhtX0NYRmJCd2w0c0hYWXdTWXJvb0NZQkdJWll4SENYazlEeGkyNXRpMlBTSUxjX202SDJ6R0dLRk41Y3BFakg4X3VyTXdqaHdWT0o0QjRyWVJaVjZGT0c?oc=5\" target=\"_blank\">Musk Has a New M",
      "Did an AI write this? Because it reads like an AI wrote this."
    ],
    "image_url": "",
    "titles": [
      "Musk Has a New Master Plan for Tesla. Uh Oh. - Bloomberg.com",
      "Tesla has a new master plan—it just doesn’t have any specifics"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.713,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elon Musk unveiled a new music synthesizer called \"Cyber Piano.\" The instrument uses AI to generate music and can mimic different artists' styles. The Cyber Piano is part of Musk's broader Neuralink project. The synthesizer is still in development, and no release date has been announced yet.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin, Kim Attend WWII Parade in Beijing After Xi-Modi-Putin Summit",
    "domain": "business",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Tue, 02 Sep 2025 19:52:00 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Russia’s Vladimir Putin and North Korean leader Kim Jong Un head to Beijing.",
      "The World War II memorial parade in Beijing with high-profile guests comes just days after the Chinese leader welcomed India’s Narendra Modi and Russia’s Vladimir Putin for a summit."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "The Big Putin, Xi and Kim Jong Un meeting",
      "Xi Poses With Putin And Kim Jong Un—Trump Says They Are Gathering To ‘Conspire Against’ America"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russian President Vladimir Putin and North Korean leader Kim Jong Un traveled to Beijing to attend a World War II memorial parade. This event occurred shortly after Chinese President Xi Jinping hosted a summit with India's Prime Minister Narendra Modi and Putin.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk: 80% of Tesla's Future Value in Optimus Robots",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 18:38:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiYEFVX3lxTE8yaDlpUGc3RFFFRWgxazBGQlhZOXBaN2FQdzlNTGJxLWNQZFpUTnIwcVdKUUhGejdHdktFalpfLXBYWDhGQmx5a0g5Y2d6U0NUTUR5VFNvaWlNVGlCOUE1bw?oc=5\" target=\"_blank\">Musk: 80% of Tesla value will be Optimus robots</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "Tesla CEO Elon Musk said on X that about 80% of his automaker's value will come from Optimus humanoid robots, which have yet to hit the market."
    ],
    "image_url": "",
    "titles": [
      "Musk: 80% of Tesla value will be Optimus robots - Axios",
      "Musk looks past Tesla sales slump, says 80% of value will come from Optimus"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.738,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk stated on X that he anticipates approximately 80% of Tesla's future value will be derived from its yet-to-be-released Optimus humanoid robots, signaling a significant shift in the company's valuation focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]