[
  {
    "title": "Shabana Mahmood considers chemical castration for serious sex offenders",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 23:19:43 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Justice secretary expected to back radical sentencing reforms, including use of libido-suppressing drugs in England and Wales</p><p>Shabana Mahmood, the lord chancellor, is considering mandatory chemical castration for the most serious sex offenders, according to government sources.</p><p>The minister’s department is planning to expand a pilot to 20 regions as part of a package of “radical” measures to free thousands of prisoners and ease prison overcrowding in England and Wales.</p> <a href=\"https://www.theguardian.com/society/2025/may/22/shabana-mahmood-considers-chemical-castration-for-serious-sex-offenders\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/2f29ec98cf49c3a54fbf1c90e917a6ff495f0c4d/414_0_4185_3348/master/4185.jpg?width=140&quality=85&auto=format&fit=max&s=1860a12fe03e2e372d4f4d45cef341ba",
    "titles": [
      "Shabana Mahmood considers chemical castration for serious sex offenders"
    ],
    "summary": "The Justice Secretary, Shabana Mahmood, is reportedly considering implementing mandatory chemical castration for severe sex offenders as part of broader sentencing reforms in England and Wales. This move aims to address prison overcrowding by expanding a pilot program to 20 regions, indicating a significant shift towards \"radical\" measures within the criminal justice system.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about a significant shift in the criminal justice system and attempts to solve the problem of prison overcrowding. However, it lacks in-depth analysis or discussion about the effectiveness and ethical implications of such measures.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.767,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.496,
    "normalized_score": 7.74
  },
  {
    "title": "U.S. Is Reviewing Impossible Metals Proposal to Mine the Seabed",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 23:04:44 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The Interior Department said it would review a new proposal for operations off the coast of American Samoa."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/21/multimedia/21CLI-SEABED-MINING-vqlp/21CLI-SEABED-MINING-vqlp-mediumSquareAt3X.jpg",
    "titles": [
      "U.S. Is Reviewing Impossible Metals Proposal to Mine the Seabed"
    ],
    "summary": "The Interior Department announced plans to review a new proposal concerning operations off the coast of American Samoa. This review aims to assess the potential impacts and benefits of the proposed operations in the region, ensuring they align with environmental and regulatory standards.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the government's efforts to balance economic interests with environmental concerns. It provides useful context about the proposal and its potential impacts, but does not provide specific details about the proposed operations or the potential solutions to mitigate any negative impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.505,
    "normalized_score": 8.58
  },
  {
    "title": "The History of Sound review – Paul Mescal and Josh O’Connor romance is full-bodied but tin-eared",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 22:40:48 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p><strong>Cannes film festival</strong> <br />A love story of two folk song aficionados in the early days of recorded music is told with tiresomely mournful awe at its own sadness</p><p>Oliver Hermanus’s The History of Sound has admirers in Cannes; but I couldn’t help finding it an anaemic, laborious, achingly tasteful film, originally a short story by Ben Shattuck which has become a quasi-Brokeback Mountain film whose tone is one of persistent mournful awe at its own sadness.</p><p>Hermanus has made great movies in the past including <a href=\"https://www.theguardian.com/film/2012/apr/19/beauty-review\">Beauty</a> and <a href=\"https://www.theguardian.com/film/2022/jan/21/living-bill-night-kurosawa-ikiru-remake\">Living</a> but this is a film that is almost petrified by its own upmarket values, paralysed under the varnish of classiness.</p> <a href=\"https://www.theguardian.com/film/2025/may/21/the-history-of-sound-review-paul-mescal-josh-oconnor-cannes\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/24427c0e6af87cbaceeef443c00ea69afb290546/570_0_2700_2160/master/2700.jpg?width=140&quality=85&auto=format&fit=max&s=efd7a9f25ae0aacc718e0861245cf1c0",
    "titles": [
      "The History of Sound review – Paul Mescal and Josh O’Connor romance is full-bodied but tin-eared"
    ],
    "summary": "At the Cannes Film Festival, \"The History of Sound,\" directed by Oliver Hermanus and based on a short story by Ben Shattuck, presented a love story between two folk song enthusiasts in the early days of recorded music. Despite some admiration, the film faced criticism for its overly mournful tone and lack of vitality, described as anaemic and laborious. Critics noted it as a tasteful yet emotionally distant work, comparing its tone to \"Brokeback Mountain\" but criticizing its execution as stiff and overly refined. Hermanus, known for acclaimed films like \"Beauty\" and \"Living,\" received mixed fe",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While it offers basic awareness about the film, its director, and its reception at the Cannes Film Festival, it does not provide deeper insights into the film's themes, its significance within the broader film landscape, or the reasons behind the criticism it received.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.758,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.473,
    "normalized_score": 5.57
  },
  {
    "title": "Trucks carrying aid enter Gaza for the first time in 80 days",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 22:32:51 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "The vehicles were loaded with baby food, medical supplies and sacks of flour, the Israeli military said."
    ],
    "image_url": "",
    "titles": [
      "Trucks carrying aid enter Gaza for the first time in 80 days"
    ],
    "summary": "Israeli military vehicles, loaded with baby food, medical supplies, and sacks of flour, were deployed as part of a relief operation. This initiative indicates a response to a specific need for essential goods, highlighting the military's involvement in humanitarian efforts.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a solution to a problem (lack of essential goods in Gaza), thus providing useful information. It also increases awareness about the role of the military in humanitarian efforts.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.756,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.52,
    "normalized_score": 10.0
  },
  {
    "title": "Thursday Briefing: Trump Lectures South Africa’s Leader",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 21:48:45 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Plus, everyone is moving to Chengdu."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/21/multimedia/22ambriefing-asia-trump-sa/22ambriefing-asia-trump-sa-mediumSquareAt3X-v4.jpg",
    "titles": [
      "Thursday Briefing: Trump Lectures South Africa’s Leader"
    ],
    "summary": "A significant trend has emerged, with a large number of people relocating to Chengdu. This movement highlights Chengdu's growing appeal as a destination for residents. The current status indicates a continuous influx of individuals choosing Chengdu as their new home, pointing to the city's attractiveness and potential benefits for newcomers.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a trend of people relocating to Chengdu, which can help readers understand the city's growing appeal. However, the title does not match the summary, and it lacks information on why this trend is happening or its potential impacts.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.746,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.487,
    "normalized_score": 6.89
  },
  {
    "title": "IN FULL! Amorim's press conference following Europa League final defeat",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 21 May 2025 23:16:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Ruben Amorim's press conference following Europa League final defeat against Tottenham Hotspur in Bilbao."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-amorim-man-utd_6923738.png?20250521232028",
    "titles": [
      "IN FULL! Amorim's press conference following Europa League final defeat"
    ],
    "summary": "Following the Europa League final defeat against Tottenham Hotspur in Bilbao, Ruben Amorim conducted a press conference. He addressed the outcome, discussing the performance and implications of the loss. While specific details of his commentary are not provided, it's clear that Amorim publicly reflected on the match's results and his team's efforts during the final.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the outcome of a sports event and the coach's reflections. However, without specific details or insights from the press conference, it provides minimal depth or insight.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.766,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.455,
    "normalized_score": 3.87
  },
  {
    "title": "Transfer rumors, news: Arsenal make first move for €80m Real Madrid star Rodrygo",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 21:31:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Arsenal have held the first exploratory discussions to sign Rodrygo from Real Madrid. Transfer Talk has the latest news, gossip and rumors."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Arsenal make first move for €80m Real Madrid star Rodrygo"
    ],
    "summary": "Arsenal have initiated preliminary talks to potentially sign Rodrygo from Real Madrid, according to Transfer Talk reports. These early discussions are part of Arsenal's efforts to explore the possibility of bringing Rodrygo to their team, though no agreement has been reached yet.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a potential player transfer in football. However, it doesn't offer deeper insights into the implications of this move for both teams or the player's career. It also doesn't report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.742,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.448,
    "normalized_score": 3.21
  },
  {
    "title": "'I've never seen anything like it!' | Grimmond run out in bizarre fashion!",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 21 May 2025 19:13:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Realeanna Grimmond is run out  as she is completely unaware of where the ball and wanders out the crease!"
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-cricket-england_6923548.jpg?20250521191509",
    "titles": [
      "'I've never seen anything like it!' | Grimmond run out in bizarre fashion!"
    ],
    "summary": "Realeanna Grimmond was run out during a cricket match after losing track of the ball's location and wandering out of her crease. This incident highlights a moment of misjudgment in the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story merely describes an unusual incident in a cricket match. It does not provide any actionable insights or deeper understanding. Neither does it report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.71,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.419,
    "normalized_score": 0.47
  },
  {
    "title": "West Indies hammered by Ireland ahead of England series",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 21 May 2025 18:35:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Paul Stirling became Ireland's first batter to reach 10,000 runs and Andy Balbirnie made a century during a dominant 124-run win over the West Indies in the opening one-day international in Dublin on Wednesday."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-ireland-cricket-west-indies_6923522.jpg?20250521185403",
    "titles": [
      "West Indies hammered by Ireland ahead of England series"
    ],
    "summary": "Paul Stirling became the first Irish batter to surpass 10,000 runs, and Andy Balbirnie scored a century, leading Ireland to a 124-run victory over the West Indies in the first one-day international in Dublin. This win highlights significant individual and team achievements for Ireland in cricket.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is informative as it reports on a significant achievement for an Irish player and the overall team performance. It provides a deeper understanding of the current state of Irish cricket. However, it doesn't offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.701,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.446,
    "normalized_score": 3.02
  },
  {
    "title": "Manny Pacquiao's boxing success relies on the things he has probably lost",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 18:06:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Manny Pacquiao has won titles in eight divisions, but even for him, Father Time could be a tough opponent to beat."
    ],
    "image_url": "",
    "titles": [
      "Manny Pacquiao's boxing success relies on the things he has probably lost"
    ],
    "summary": "Manny Pacquiao, a boxer who has won titles in eight different divisions, faces challenges due to advancing age, suggesting that age might impact his performance in the sport.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the impact of age on athletic performance, but it doesn't delve into the science behind it or offer any actionable insights for readers.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.695,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.414,
    "normalized_score": 0.0
  },
  {
    "title": "What Trump’s ‘big, beautiful’ budget bill means for the US economy",
    "domain": "business",
    "location": "global",
    "published": "Wed, 21 May 2025 23:58:29 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "The president has staked his second-term agenda on the sprawling tax-and-spend legislation"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F0daf8342-3d64-4d7b-af1c-813570d1c5a3.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What Trump’s ‘big, beautiful’ budget bill means for the US economy"
    ],
    "summary": "The president has centered his agenda for a second term on comprehensive legislation focused on taxes and spending. This legislative effort is key to advancing his policy goals during his tenure.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about the potential impacts of the proposed budget bill on the US economy. However, it does not detail the specific provisions of the bill or how they might affect individuals or businesses.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.776,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.516,
    "normalized_score": 9.62
  },
  {
    "title": "White House crypto czar David Sacks says stablecoin bill will unlock 'trillions' for U.S. Treasury",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 23:23:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Trump’s top crypto advisor David Sacks says the administration’s stablecoin bill is poised to pass with bipartisan support."
    ],
    "image_url": "",
    "titles": [
      "White House crypto czar David Sacks says stablecoin bill will unlock 'trillions' for U.S. Treasury"
    ],
    "summary": "David Sacks, the top cryptocurrency advisor to Donald Trump, has stated that the administration's stablecoin bill is expected to pass with support from both major political parties.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the potential impact of the stablecoin bill on the US economy. However, it lacks depth in explaining how this bill will unlock 'trillions' for the U.S. Treasury and what the implications might be for the average citizen or investor.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.768,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.486,
    "normalized_score": 6.79
  },
  {
    "title": "CSX CEO says industrial projects are growing amid push for domestic manufacturing",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 23:11:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "In an interview with CNBC's Jim Cramer, CSX Joe Hinrichs detailed how government action is affecting the railroad company company."
    ],
    "image_url": "",
    "titles": [
      "CSX CEO says industrial projects are growing amid push for domestic manufacturing"
    ],
    "summary": "In an interview with CNBC, CSX President Joe Hinrichs discussed the impact of government actions on the railroad company. He highlighted specific government policies and regulations that are influencing CSX's operations, though the summary does not detail these policies. The conversation with Jim Cramer focused on the direct effects of these governmental decisions on the company's performance and strategic planning.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about how government policies and regulations are impacting CSX's operations and strategic planning. However, without specifics on what these policies are, the depth of understanding is limited. The story does not report on solutions or improvements, but it does increase awareness about the relationship between government actions and corporate operations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.765,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.495,
    "normalized_score": 7.64
  },
  {
    "title": "Nike to resume selling directly on Amazon for first time since 2019",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 22:42:19 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Nike confirmed to CNBC that its shoes are returning to Amazon."
    ],
    "image_url": "",
    "titles": [
      "Nike to resume selling directly on Amazon for first time since 2019"
    ],
    "summary": "Nike has officially confirmed to CNBC that it will be restocking its shoes on Amazon, marking a return of its products to the online retail giant's platform. This decision comes after a period of absence, indicating a renewed partnership between Nike and Amazon.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the renewed partnership between Nike and Amazon. However, it lacks depth or insight into why Nike decided to resume its partnership with Amazon, or what this means for consumers, making its usefulness and progress minimal.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.758,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.473,
    "normalized_score": 5.57
  },
  {
    "title": "Cigna announces new deal for copay caps on Eli Lilly and Novo Nordisk weight loss drugs",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 22:15:54 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Cigna's pharmacy benefits unit Evernorth said the deal will bring prices down for employers and their workers."
    ],
    "image_url": "",
    "titles": [
      "Cigna announces new deal for copay caps on Eli Lilly and Novo Nordisk weight loss drugs"
    ],
    "summary": "Cigna's pharmacy benefits division, Evernorth, announced a deal aimed at reducing drug prices for employers and their employees. The agreement is part of Evernorth's efforts to make medications more affordable and accessible, indicating a potential decrease in healthcare costs for both employers and workers involved.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a solution to the problem of high drug prices. It provides useful information about how the deal could potentially decrease healthcare costs for employers and workers. It also increases awareness about efforts within the healthcare industry to make medications more affordable and accessible.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.752,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.511,
    "normalized_score": 9.15
  },
  {
    "title": "Intel’s Memory Leak Nightmare: 5,000 Bytes per Second in the Hands of Hackers",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 23:22:32 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/intels-memory-leak-nightmare-5000-bytes-per-second-in-the-hands-of-hackers/\" rel=\"nofollow\" title=\"Intel’s Memory Leak Nightmare: 5,000 Bytes per Second in the Hands of Hackers\"><img alt=\"Intel Processor Vulnerability\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Intel-Processor-Vulnerability-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Computer scientists at ETH Zurich have uncovered a serious flaw in Intel processors that could let attackers steal sensitive information by exploiting how modern chips predict upcoming actions. Using specially designed sequences of instructions, hackers can bypass security boundaries and gradually read the entire memory of a shared processor. This vulnerability affects a wide range [...]"
    ],
    "image_url": "",
    "titles": [
      "Intel’s Memory Leak Nightmare: 5,000 Bytes per Second in the Hands of Hackers"
    ],
    "summary": "Researchers at ETH Zurich have discovered a significant vulnerability in Intel processors, allowing hackers to exploit the chips' predictive actions to steal sensitive data at a rate of 5,000 bytes per second. This flaw enables attackers to circumvent security measures and access the entire memory of a shared processor, posing a substantial risk to information security.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a significant vulnerability in Intel processors, which can deepen readers' understanding of information security risks. However, it does not offer any solutions or ways to address the problem, thus limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.768,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.486,
    "normalized_score": 6.79
  },
  {
    "title": "This Tiny Robot Can Jump 10 Feet High – Without Legs",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 22:57:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-tiny-robot-can-jump-10-feet-high-without-legs/\" rel=\"nofollow\" title=\"This Tiny Robot Can Jump 10 Feet High – Without Legs\"><img alt=\"The Nematode Inspired Soft Robot\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/The-Nematode-Inspired-Soft-Robot-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>By studying a slender, leaping parasite thinner than a human hair, engineers at Georgia Tech developed a soft robot capable of hopping both forward and backward. Inspired by the jumping movements of a tiny parasitic worm, engineers at Georgia Tech have developed a 5-inch soft robot capable of leaping as high as a basketball hoop. [...]"
    ],
    "image_url": "",
    "titles": [
      "This Tiny Robot Can Jump 10 Feet High – Without Legs"
    ],
    "summary": "Engineers at Georgia Tech have created a 5-inch soft robot inspired by a parasitic worm, capable of jumping up to 10 feet high without legs. This advancement mimics the worm's ability to leap both forward and backward, achieving heights comparable to a basketball hoop.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story reports on an innovative development in robotics, providing insights into the capabilities of this new technology. However, it falls short of fully explaining its potential applications or impacts, which would have made it more constructive.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.762,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.504,
    "normalized_score": 8.49
  },
  {
    "title": "Watch This Robot Solve a Rubik’s Cube in 0.1 Seconds — It’s a Guinness World Record",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 22:32:21 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/watch-this-robot-solve-a-rubiks-cube-in-0-1-seconds-its-a-guinness-world-record/\" rel=\"nofollow\" title=\"Watch This Robot Solve a Rubik’s Cube in 0.1 Seconds — It’s a Guinness World Record\"><img alt=\"Rubik&#039;s Cube Robot Solver\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Rubiks-Cube-Robot-Solver-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A team of Purdue engineering students built a lightning-fast robot—Purdubik’s Cube—that now holds the Guinness World Record for solving a Rubik’s Cube in just 0.103 seconds. Fueled by co-op experiences, personal inspiration, and university support, the students combined machine vision, custom algorithms, and industrial hardware to create a robotic system so fast it finishes before [...]"
    ],
    "image_url": "",
    "titles": [
      "Watch This Robot Solve a Rubik’s Cube in 0.1 Seconds — It’s a Guinness World Record"
    ],
    "summary": "A team of engineering students from Purdue University has set a new Guinness World Record by creating a robot, named Purdubik’s Cube, that can solve a Rubik’s Cube in just 0.103 seconds. This achievement was made possible through their use of machine vision, custom algorithms, and industrial hardware, showcasing a significant advancement in robotic speed and efficiency.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights progress in the field of robotics, specifically in terms of speed and efficiency. It provides empowering knowledge about the use of machine vision and custom algorithms, which can be applicable in various technological contexts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.756,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.512,
    "normalized_score": 9.25
  },
  {
    "title": "Why taping your mouth shut at night probably isn't a good idea",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 20:00:18 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Social media is awash with videos claiming that taping your mouth closed will improve your sleep – but the evidence doesn't stack up"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/21105736/SEI_252314605.jpg",
    "titles": [
      "Why taping your mouth shut at night probably isn't a good idea"
    ],
    "summary": "Videos circulating on social media suggest that taping one's mouth shut can enhance sleep quality. However, current evidence does not support these claims, indicating a lack of scientific backing for the practice's effectiveness in improving sleep.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information debunking a potentially harmful trend circulating on social media. It increases awareness about the lack of scientific backing for this practice, contributing to the reader's understanding and potentially influencing their decisions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.707,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.468,
    "normalized_score": 5.09
  },
  {
    "title": "The Enhanced Games Has a Date, a Host City, and a Drug-Fueled World Record",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 20:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "The Enhanced Games, where athletes are allowed to take performance-enhancing drugs, will host its first event in May. One “enhanced” former Olympic swimmer has already broken the 50-meter freestyle record."
    ],
    "image_url": "https://media.wired.com/photos/682cfbd29f36acb81c1e4fc7/master/pass/Science_EnhancedGames_Press.jpg",
    "titles": [
      "The Enhanced Games Has a Date, a Host City, and a Drug-Fueled World Record"
    ],
    "summary": "The Enhanced Games, an event permitting the use of performance-enhancing drugs, is set to hold its inaugural competition in May. A former Olympic swimmer participating in these games has broken the 50-meter freestyle record. This marks the first time such an event has been officially organized.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a new event and its implications, but it does not delve into the potential impacts, ethical considerations, or systemic issues related to the use of performance-enhancing drugs in sports. It lacks depth and insight that could contribute to the reader's understanding or decision-making.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.721,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.462,
    "normalized_score": 4.53
  }
]