[
  {
    "title": "Steelers Reach Agreement With Mike McCarthy to Be Next Head Coach",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 14:55:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Pittsburgh native and former Dallas Cowboys coach will take over a team with questions starting with QB.",
      "Steelers, Mike McCarthy Contract Details Emerge Sports Illustrated",
      "Steelers Made Big Mistake Hiring Mike McCarthy Sports Illustrated",
      "Three OC Candidates Steelers Could Hire After Mike McCarthy Sports Illustrated",
      "Rodgers won a Super Bowl with the Packers under McCarthy",
      "The former Steelers All-Pro didn’t hide his frustration.",
      "The Steelers have a verbal agreement with former Cowboys and Packers coach Mike McCarthy to become their next head coach, the team announced Saturday.",
      "The Pittsburgh native will replace Tomlin after his 19-year run as coach"
    ],
    "image_url": "",
    "titles": [
      "Steelers to hire Mike McCarthy: Six questions on the new coach, plus a grade",
      "Steelers, Mike McCarthy Contract Details Emerge - Sports Illustrated",
      "Steelers Made Big Mistake Hiring Mike McCarthy - Sports Illustrated",
      "Three OC Candidates Steelers Could Hire After Mike McCarthy - Sports Illustrated",
      "How Steelers' coaching hire of Mike McCarthy could affect Aaron Rodgers' NFL future",
      "Le’Veon Bell bashes Steelers for hiring Mike McCarthy",
      "Steelers verbally agree with McCarthy as coach",
      "Steelers hire Mike McCarthy: Former Cowboys, Packers coach to succeed Mike Tomlin in Pittsburgh"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47716099/pittsburgh-steelers-hire-head-coach-mike-mccarthy-answering-six-big-questions-faq-aaron-rodgers-hiring",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxOeFc2d1huS2dQNzM2ajFNYXNaQTZGLVNnUWM2UkdMZDFnc0t4eGV0bFdtMmticDY4VHFNTlZCVzVLbGM0SjV5eDRZRzc4YlMyd3dzaU1qN3F1NHJEd19ld0d4eFhNVXZGb2NTdjZLNjNsSWRwMnJhUTlyeVNRX2JaeWNzSmhXSEVWVjRlSmY5RDRtTXJudDA0S0FkQlNsczVw?oc=5",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxOeDREeUJsYTB1TnRHci01OHBTdHNNa1dyY0JhVEFacTMyQVYzbVBjcGpCSGVXZnhBclE4N3JmNWZOTGJSMk9JYXM5UDlzMTNtMWNWRXZCbWhDNVJRWTdDcmVpNUVXWUpoSGZsTXY0dm1vcmNQMkRZRTh2cFdnbFNrR21tZ0N1TzBKcEdCcVQ2U1VuOHdQdlVNbFpB?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOMkFuSjgzMExGcVBGWTdxbGYteVJkYW1fQjFfWk1aZnlGSGo5b2pBV2M4Qk5BWUc3LUYzdFA3d2h5ajBYNGhIaGkwdi0weG5Sb1RMa3BLS2lnNFd2d1d0RU1GaEpXbUVMYjRxZTNxUDZCQjBPWkp6QWF4ZEwyQ1h6QTFIOFNuUmowbTZNSVJNNTkzWDJXcFdpNFBzcUNua25DVDVRSjF5UUl4ODlyYUg4LVlJSU0?oc=5",
      "https://www.cbssports.com/nfl/news/steelers-aaron-rodgers-mike-mccarthy-hire-nfl-2026-season/",
      "https://sports.yahoo.com/articles/le-veon-bell-bashes-steelers-173319519.html",
      "https://www.espn.com/nfl/story/_/id/47715749/sources-steelers-planning-hire-mike-mccarthy-head-coach",
      "https://www.cbssports.com/nfl/news/mike-mccarthy-hired-pittsburgh-steelers-coach-mike-tomlin/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47716099/pittsburgh-steelers-hire-head-coach-mike-mccarthy-answering-six-big-questions-faq-aaron-rodgers-hiring",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.979,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.878,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for fans and stakeholders of the Steelers, offering insights into the new coach. However, it does not highlight any progress, solutions or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Pittsburgh Steelers have reached a verbal agreement with Mike McCarthy to become their next head coach, replacing Tomlin after his 19-year tenure. McCarthy, a Pittsburgh native and former coach of the Cowboys and Packers, will lead the team as they address key roster questions.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Patriots and Broncos Compete for Super Bowl LX Berth in AFC",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 13:17:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports",
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com",
      "theguardian.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The four teams in the conference championship games will be suited accordingly on the field.",
      "CBS Sports writers Jordan Dajani and Jared Dubin predict this weekend's games",
      "Pete Prisco reveals his Championship Sunday picks, as the two No. 1 seeds punch their ticket to the Super Bowl",
      "Join us live to follow and discuss this afternoons NFL Conference Championship games.",
      "Bet365 offers $200 bonus for New England Patriots vs. Denver Broncos",
      "Sub-freezing temperatures and possible snow is on tap for Denver, while Seattle should be mild",
      "Join Mile High Report to discuss the action from the AFC Championship Game between the Denver Broncos and New England Patriots.",
      "The Sporting News is tracking live scoring updates and highlights for Patriots vs. Broncos in the 2026 AFC championship game on Sunday. Follow for complete results with a trip to Super Bowl 60 on the line.",
      "Winner earns Super Bowl LX spot | Message Graham Updates from 3pm ET/8pm GMT kickoff Can you believe it has been seven years since the Patriots last won a Super Bowl? New England have a golden opportunity to return to the top table after the end of Tom Brady’s dynastic control of the NFL. It has bee",
      "The AFC Championship and a trip to Super Bowl LX is on the line when Drake Maye’s Patriots take on the Bo Nix-less Broncos. Follow every play with our NFL live tracker.",
      "Come join our live chat for the NFC and AFC Championship Games!",
      "New England looks to get back to the Super Bowl.",
      "Browns fans can use this to discuss the game.",
      "Here are the gameday inactives for both the Denver Broncos and New England Patriots for the AFC Championship Game.",
      "Join Neil Parker as he shares his favorite NFL player props for the Patriots vs. Broncos AFC Championship Game!",
      "The pivotal players for the Patriots’ game against Broncos on Sunday.",
      "Find best bets for the biggest games in sports on Sunday from the SportsLine Inside the Lines team's model and top CBS Sports experts",
      "Find best bets and props for the biggest games in sports on Saturday from the SportsLine Projection Model and top CBS Sports experts"
    ],
    "image_url": "",
    "titles": [
      "Uniforms for conference championship games: Broncos-Pats, Seahawks-Rams",
      "NFL conference championship picks: Experts square off on Patriots at Broncos, Rams vs. Seahawks",
      "Prisco's AFC, NFC Championship picks: Jarrett Stidham does enough for Broncos, Seahawks lean on defense",
      "NFL Conference Championship Games Live Discussion & Game Information: NE Patriots @ Denver Broncos/LA Rams @ Seattle Seahawks",
      "bet365 bonus code CBSBET365: Get $200 bonus for Patriots vs. Broncos AFC Championship",
      "Weather factors in Broncos vs. Patriots AFC Championship and Seahawks vs. Rams NFC Championship",
      "Denver Broncos vs. New England Patriots - Live Discussion",
      "Patriots vs. Broncos live score, updates, highlights from 2026 AFC championship game",
      "AFC Championship game in the NFL: New England Patriots v Denver Broncos – live",
      "NFL Live Tracker: Patriots vs. Broncos",
      "NFCC, AFCC live discussion: Patriots vs. Broncos; Rams vs. Seahawks",
      "Patriots vs. Broncos: Live updates, score, news from AFC Championship Game",
      "New England Patriots vs. Denver Broncos – AFC Championship, Browns’ fans open thread",
      "Broncos vs. Patriots Gameday Inactives for AFC Championship Game",
      "Patriots vs Broncos Props & Best Bets for Today's AFC Championship Game",
      "6 Patriots to watch against the Broncos",
      "Today's top games to watch, best bets, odds: Patriots vs. Broncos, Rams vs. Seahawks, NBA and more",
      "Today's top games to watch, best bets, odds: Knicks-76ers tops NBA slate, ranked college hoops action and more"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47696085/nfl-conference-championship-uniforms",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/nfl-conference-championship-picks-experts-square-off-on-patriots-at-broncos-rams-vs-seahawks/",
      "https://www.cbssports.com/nfl/news/priscos-nfl-championship-pick-odds-best-bets-seahawks-broncos/",
      "https://sports.yahoo.com/articles/nfl-conference-championship-games-live-193000740.html",
      "https://www.cbssports.com/nfl/news/bet365-bonus-code-cbsbet365-get-200-bonus-for-patriots-vs-broncos-afc-championship/",
      "https://www.cbssports.com/nfl/news/weather-broncos-patriots-afc-championship-seahawks-rams-nfc/",
      "https://sports.yahoo.com/articles/denver-broncos-vs-england-patriots-193000053.html",
      "https://sports.yahoo.com/articles/patriots-vs-broncos-live-score-150001776.html",
      "https://www.theguardian.com/sport/live/2026/jan/25/afc-championship-game-new-england-patriots-v-denver-broncos-live",
      "https://sports.yahoo.com/articles/nfcc-afcc-live-discussion-patriots-193000887.html",
      "https://sports.yahoo.com/articles/patriots-vs-broncos-live-updates-192546314.html",
      "https://sports.yahoo.com/articles/england-patriots-vs-denver-broncos-191812392.html",
      "https://sports.yahoo.com/articles/broncos-vs-patriots-gameday-inactives-183330373.html",
      "https://sports.yahoo.com/articles/patriots-vs-broncos-props-best-164700853.html",
      "https://sports.yahoo.com/articles/6-patriots-watch-against-broncos-163531893.html",
      "https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-patriots-vs-broncos-rams-vs-seahawks-nba-and-more/",
      "https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-knicks-76ers-tops-nba-slate-ranked-college-hoops-action-and-more/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47696085/nfl-conference-championship-uniforms",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.935,
      "consensus": 0.995,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.868,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the uniforms for specific games but doesn't provide deeper understanding or insights. It doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The New England Patriots and Denver Broncos faced off in the 2026 AFC Championship Game on Sunday, with a spot in Super Bowl LX at stake. The game featured Drake Maye leading the Patriots against the Broncos, who played without Bo Nix. Live coverage and updates tracked the action, but the final outcome is not specified in the available sources.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Packers Hire Jonathan Gannon as Defensive Coordinator",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 14:51:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The Packers have agreed to terms with former Cardinals coach Jonathan Gannon to be their defensive coordinator, sources told ESPN.",
      "Gannon previously delivered a successful run as defensive coordinator of the Philadelphia Eagles",
      "Green Bay Packers head coach Matt LaFleur has picked Jonathan Gannon to be his new defensive coordinator.",
      "Packers Hire Former Cardinals Coach Jonathan Gannon As Defensive Coordinator Sports Illustrated",
      "Packers Hire Ex-Cardinals Coach Jonathan Gannon as Defensive Coordinator Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Sources: Gannon agrees to become Packers DC",
      "Packers to hire ex-Cardinals coach Jonathan Gannon as defensive coordinator",
      "Packers Pick Jonathan Gannon To Lead Their Defense",
      "Packers Hire Former Cardinals Coach Jonathan Gannon As Defensive Coordinator - Sports Illustrated",
      "Packers Hire Ex-Cardinals Coach Jonathan Gannon as Defensive Coordinator - Sports Illustrated"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47724577/sources-packers-agree-hire-jonathan-gannon-dc",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/jonathan-gannon-packers-defensive-coordinator-cardinals/",
      "https://www.forbes.com/sites/robreischel/2026/01/25/packers-pick-jonathan-gannon-to-lead-their-defense/",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxNYTVXQW5IRHZpek1EMy1qbFNKTDN2ekNrNmZ1YVdKckw3OEl4elF1S214Z3FRRjF6UlJoVnJhZGN3OURCQXZMU1Y3TFR4TGJveEpiT1JNWlpITnROZGNENTB1RzdWU3k3NmZSdVNiWnU1bnRvaFpYeVlRdkgyZXo3Q3RfUThfQm1XV3Q0VlZpbEwtdTdENkR2RW9CZ1dJNHo2ZHEzOXZUOA?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNby1POEllZXB5U3FEY2llVzhyWm9GUWtSQVotLUFyUi1zeEhmOWxHVS14eDVBdWZvaVlCdHFPLV9JS0pYRkdZZ196SVJmSFdqbklNeWZKZXFfYmlsZjVncE1iTUhFN1BLbEdjVnN5aGF1SGROWm5Pd2RIZXR6ZkplYW1Sb0xGOHRzcDNHT2N0X0JydXRNVVRYenQyZjF3NWdZMnBuNnU0bk92VC1W?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47724577/sources-packers-agree-hire-jonathan-gannon-dc",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.977,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.847,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a new development in the Packers' team. However, it lacks depth and insight about what this change means for the team, the strategies Gannon might bring, or how this might affect future games.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Green Bay Packers have hired Jonathan Gannon, previously with the Arizona Cardinals, as their new defensive coordinator. Head coach Matt LaFleur selected Gannon for the position, and the team has agreed to terms with him, according to multiple sources.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Federal Agents Fatally Shoot Man in Minneapolis",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 14:24:21 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "ESPN",
      "Axios",
      "CBS Sports",
      "Financial Times",
      "CNBC",
      "The Economist",
      "Al Jazeera",
      "BBC",
      "NPR"
    ],
    "domains": [
      "abcnews.go.com",
      "espn.com",
      "news.google.com",
      "cbssports.com",
      "ft.com",
      "aljazeera.com",
      "bbc.com",
      "npr.org"
    ],
    "snippets": [
      "24/7 coverage of breaking news and live events",
      "The second fatal shooting this month of an American citizen in Minneapolis at the hands of a federal agent has ratcheted up tensions in the city once again.",
      "A 37-year-old Minneapolis man was killed after he was shot by a federal agent, the police.",
      "The NBA has postponed Saturday's game between the Timberwolves and Warriors in Minneapolis amid growing unrest after a Saturday morning confrontation with federal immigration officers ended in a man being shot and killed.",
      "Tensions continued over the weekend in Minneapolis, as protesters clashed in the streets with law enforcement.",
      "Federal agents fatally shoot man in confrontation in South Minneapolis Axios",
      "The league cited the safety and security of the Minneapolis community in announcing the decision",
      "Protests spread across US after second fatal shooting by law enforcement during immigration crackdown",
      "Video shows moments before federal immigration agents fatally shoot man in Minnesota CNBC",
      "Another horrifying shooting by federal agents in Minneapolis The Economist",
      "Two witnesses said in court filings that the victim did not brandish a gun, refuting claims by the Trump administration.",
      "He has been described as an avid outdoorsman who loved mountain biking.",
      "Federal officials described the fatal shooting of a 37-year-old U.S. citizen by a federal agent as an act of self-defense. The video evidence that has surfaced so far contradicts that assertion.",
      "Bystander footage has captured the seconds before the killing of 37-year-old Alex Pretti.",
      "Trump officials says federal agents shot in self-defence, as Pretti's parents accuse them of \"sickening lies\"."
    ],
    "image_url": "https://s.abcnews.com/images/Live/abc_news_live-abc-ml-250210_1739199021469_hpMain_4x3t_384.jpg",
    "titles": [
      "LIVE:  ABC News Live: Minneapolis shooting update",
      "What we know about the latest Minneapolis shooting by federal agents",
      "Minneapolis shooting live updates: Witness describes shooting in court filing",
      "Warriors-Wolves ppd. after Minneapolis shooting",
      "WATCH:  Growing protests in Minneapolis after another deadly shooting",
      "Federal agents fatally shoot man in confrontation in South Minneapolis - Axios",
      "Timberwolves vs. Warriors game postponed by NBA after man fatally shot by federal agents in Minneapolis",
      "Federal agents shoot man dead in Minneapolis",
      "Video shows moments before federal immigration agents fatally shoot man in Minnesota - CNBC",
      "Another horrifying shooting by federal agents in Minneapolis - The Economist",
      "Who was Alex Pretti, the nurse shot dead by federal agents in Minneapolis?",
      "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
      "Watch: Videos refute DHS account of fatal shooting in Minneapolis",
      "Video shows moments around fatal shooting of Alex Pretti in Minneapolis",
      "What we know about the fatal shooting"
    ],
    "url": "https://abcnews.go.com/Live/video/abcnews-live-41463246",
    "alternate_urls": [
      "https://abcnews.go.com/US/latest-minneapolis-shooting-federal-agents/story?id=129540435",
      "https://abcnews.go.com/US/live-updates/minneapolis-ice-shooting-live-updates-doj-investigating-apparent/?id=129340693",
      "https://www.espn.com/nba/story/_/id/47716472/warriors-timberwolves-postponed-amid-minneapolis-unrest",
      "https://abcnews.go.com/US/video/growing-protests-minneapolis-after-deadly-shooting-129533411",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxOVXMwSmItcm9lYUVOOUh5cTlGV2dZWmN0eXJtam1PWVpQTkJoRFBtVmp4Snhhd3FHMEZGOF9JS3RobGVYOWVKcGZuVFdyellkVzAzWXRkeE1rNVQtRnRaUTZERkRDTkI3Nm1BUTRTdU52X0dPVWtfdVpJanVnSzl5VGs5SUVOY2pqQm00MDFR?oc=5",
      "https://www.cbssports.com/nba/news/timberwolves-warriors-game-postponed-nba-minneapolis-shooting/",
      "https://www.ft.com/content/3d855ba7-3e96-4512-b34c-6ff87ade6c12",
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxOVDU1NVozanpVeVJwSHAySVlxellKWm1LQjNtckxtaE9lWEh0YUh6M3ltcDdxQUN3bXFhOExTaFFBbGNGM0lqR0ZrRHZNNTRiSnlxWnVtbUp2eVd0Mzk4T2hBMEpheU9ncTJNSkRyNUtDeE1rZUJ4SnNqN2RVbDNaZGZVY09LOTF3Z2Z2Y24yR0Q5WF9UajZXUnNGcWVjNFBhLUNqUkNKeEVKQ1I3SGVzakFoR1dLWFVqTnAzelFFUms1b2xFRkE?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNNXY1aWpnV0otTmtxOW9iNmtubnBsRHFmSU9RVnlqa0lPMlU5cHhlUlNaMnRNblY3d0hueDRnRFp0T2FyX1F3aGZxWU4zQUFLa2k0eHdFTVNwQWp4UEVxVmZxRk9qMGhxeDhfTmwxQjZEX0NSNGtCY21KSHh2T0c3RmMwQkRXTmZvZFBwaVNnNDVlc3l0clRwQ0hGX0loek1hREJiSVJFRjhxTzVuRk1ESA?oc=5",
      "https://www.aljazeera.com/news/2026/1/25/who-was-alex-pretti-the-nurse-shot-dead-by-federal-agents-in-minneapolis?traffic_source=rss",
      "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2026/01/25/nx-s1-5687384/minneapolis-minnesota-shooting-video-dhs",
      "https://www.bbc.com/news/videos/cp372pqq2rlo?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/news/articles/c20zjyxep99o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Live/video/abcnews-live-41463246",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.965,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.839,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.10; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Federal immigration agents fatally shot 37-year-old Alex Pretti in Minneapolis during a confrontation on Saturday. Video and witness accounts contradict federal claims of self-defense, stating Pretti did not brandish a weapon. Protests have erupted in response, prompting the NBA to postpone the Timberwolves-Warriors game in Minneapolis due to safety concerns.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Alex Honnold Scales Taipei 101 Without Ropes in Historic Climb",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 25 Jan 2026 07:33:57 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Associated Press",
      "BBC",
      "New York Times",
      "Yahoo Sports",
      "Bloomberg",
      "The Guardian"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "bbc.com",
      "nytimes.com",
      "sports.yahoo.com",
      "theguardian.com"
    ],
    "snippets": [
      "Cheers erupted from a street-level crowd as Alex Honnold reached the top of the spire of the 508-meter (1,667-foot) tower, about 90 minutes after he started.",
      "US climber scales Taiwan's tallest building Taipei 101 without ropes Reuters",
      "American rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes AP News",
      "Alex Honnold has become the first person to climb the Taiwanese building alone without safety equipment.",
      "Alex Honnold, who climbed a 1,667-foot-tall skyscraper in Taiwan on Sunday, is one of a dozen or so known skyscraper climbers worldwide.",
      "Famed rock climber made history as the first person to climb the skyscraper with safety gear or ropes",
      "Free-Solo Climber Honnold Conquers Taipei 101 Live on Netflix Bloomberg",
      "US climber takes an hour and half to scale one of Asia’s tallest buildings without ropes or a harness The US rock climber Alex Honnold climbed one of Asia’s tallest skyscrapers without ropes or a harness on Sunday, fulfilling an ambition that began more than a decade ago and which he hoped would ins"
    ],
    "image_url": "",
    "titles": [
      "U.S. rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes",
      "US climber scales Taiwan's tallest building Taipei 101 without ropes - Reuters",
      "American rock climber Alex Honnold reaches top of Taipei 101 skyscraper without ropes - AP News",
      "Watch: Climber Alex Honnold scales 101-floor skyscraper without safety gear",
      "Alex Honnold Climbs Taipei 101 Skyscraper in Taiwan",
      "Alex Honnold says he was paid an ‘embarrassing amount’ for Tapei 101 climb",
      "Free-Solo Climber Honnold Conquers Taipei 101 Live on Netflix - Bloomberg",
      "Alex Honnold free solos Taipei 101 skyscraper in live Netflix climb"
    ],
    "url": "https://www.npr.org/2026/01/25/nx-s1-5687809/american-rock-climber-alex-honnold-reaches-top-of-taipei-skyscraper",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxNYmtWM1EtbVhCWnVwSVg2TnhPWnludGliNFlPeDJLaFJtMmdWeDJKRi1mS2t4RjBtRENON01wNnhqZUNTdElBXzgzbmJtdmVkTThaNWw1Z1NWMWN3MEpSYk5UaHQ4OElINE5JRzd1MV9lbmIxZ3B3bFJRX0Z6ck54bnpGYUxRVzRuQ0lMQ0Q1eGhwZHZFcU5WMVNvcWpYdjhRVFBnSUl5dTNnb0NxTE1BOUpnQkRCU2V2SXlESGxEajhONVYx?oc=5",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxPbVhJQTQ2cVItNFo3NnhqamRQU3hLZGhRMnNrX2N3ckJ3dXBENGtRTk5yaDJKRTNwVTRjUHpQVDQ5ZHNMaWE0eWU5WmxrWm9KVmVTbXBMdUpfVXhnS19CQzd4NmhVTnBxLWlmcjhFbWxwZGNzcWdfdmJYR0hoeHNaNUlERXV3NC1lVW5XbXI3enRiRGNoVGM3QnVCV2dhQlRmQ1I4Tg?oc=5",
      "https://www.bbc.com/news/articles/c4gl0njzxjdo?at_medium=RSS&at_campaign=rss",
      "https://www.nytimes.com/2026/01/23/world/asia/climbing-buildings-skyscrapers-alex-honnold.html",
      "https://sports.yahoo.com/articles/alex-honnold-says-being-paid-200235718.html",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQRFR6RXA4MkliOGZUaG1fT1E4aVJ4a1RmeE85TDdGZkRrZFR6c1ViQ3FMQnZlb1I4eHVqd1BvWlo5cm1NNUlUeDdYb2VYcDhHZ0dwNDQ5NUJ2djM2OWU4NXE3NlRfQW9WYzlsdUo3d0pheFJjcEJUMDJZZ2RHT1hwWDBuN0pZek9GQURCR3JvdnBrV01qUWlYX0tCOG5kaXFUWmZWaHJhdGxOUTFJVEVqUWRtSGI?oc=5",
      "https://www.theguardian.com/sport/2026/jan/24/alex-honnold-free-solo-taipei-101-netflix"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/01/25/nx-s1-5687809/american-rock-climber-alex-honnold-reaches-top-of-taipei-skyscraper",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.798,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.814,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Alex Honnold became the first person to climb Taipei 101 without ropes or safety equipment, reaching the top of the 508-meter skyscraper in about 90 minutes on January 25, 2026. The climb was broadcast live and drew cheers from a crowd gathered below.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Cunhas Late Goal Secures 3 2 Win for Manchester United Over Arsenal",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 19:05:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "BBC Sport",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "skysports.com",
      "theguardian.com"
    ],
    "snippets": [
      "Matheus Cunha scores a dramatic late winner for Manchester United as they beat Premier League leaders Arsenal in a thrilling match at Emirates Stadium.",
      "Matheus Cunha scores a brilliant goal for Manchester United to put them 3-2 up in their Premier League clash with Arsenal.",
      "Matheus Cunha scored a sensational 87th-minute winner to clinch a 3-2 victory for Michael Carrick's Manchester United and cut Arsenal's lead at the top of the Premier League to four points.",
      "Two sensational second-half strikes give Manchester United a huge win that takes them above Chelsea and Liverpool into fourth.",
      "The Emirates Stadium was a sea of anxiety. Arsenal fans are acutely aware that a first Premier League title since 2004 is within their grasp and when it is so tantalising, it will be fraught. Especially when matches such as this become a grind. When the attacking patterns do not work. When the team",
      "Matheus Cunha's superb strike saw Manchester United snatch a dramatic 3-2 win at Arsenal."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3882/live/0b67a080-fa25-11f0-a422-4ba8a094a8fa.jpg",
    "titles": [
      "Cunha scores dramatic winner as Man Utd beat Arsenal",
      "Another BEAUTY! Cunha wins it for Man Utd with STUNNING strike!",
      "Cunha's stunner seals Man Utd win over leaders Arsenal",
      "Cunha scores stunning late winner as Man Utd beat Arsenal",
      "Cunha’s stunner earns Manchester United thrilling late win at Arsenal",
      "Cunha breaks Arsenal hearts with dramatic late winner"
    ],
    "url": "https://www.bbc.com/sport/articles/c2lgrw7v5w7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/watch/video/13498971/goal-m-cunha-87-arsenal-2-3-manchester-utd",
      "https://www.skysports.com/football/arsenal-vs-manchester-united/report/531349",
      "https://www.bbc.com/sport/football/videos/c3wz3x78d29o?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/football/2026/jan/25/arsenal-manchester-united-premier-league-match-report",
      "https://www.skysports.com/watch/video/13498970/manchester-united-matheus-cunha-breaks-arsenal-hearts-with-dramatic-late-winner"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/articles/c2lgrw7v5w7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.956,
      "consensus": 0.888,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.812,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the result of a specific match. However, it doesn't provide deeper insights or analysis about the game, the performance of the players, or the implications of the result on the teams' standings.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Matheus Cunha scored an 87th-minute winner as Manchester United defeated Arsenal 3-2 at Emirates Stadium. The victory moves Manchester United above Chelsea and Liverpool into fourth place in the Premier League and reduces Arsenal's lead at the top of the table to four points.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Justin Gaethje Wins Interim Lightweight Title at UFC 324",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 14:57:11 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Justin Gaethje and Sean O'Malley picked up big wins on Saturday, but will the victories earn them a shot at undisputed glory?",
      "“The Highlight” made sure of it on Saturday, securing victory over Paddy Pimblett via unanimous decision (49-46, 49-46, 48-47) to claim the interim lightweight title at UFC 324."
    ],
    "image_url": "",
    "titles": [
      "Title paths for Gaethje, Pimblett and O'Malley after UFC 324",
      "Gaethje outlasts Pimblett, captures interim lightweight title at UFC 324"
    ],
    "url": "https://www.espn.com/mma/story/_/id/47722059/ufc-324-next-justin-gaethje-paddy-pimblett-sean-omalley-others",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/mma/story/_/id/47722059/ufc-324-next-justin-gaethje-paddy-pimblett-sean-omalley-others",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.768,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the future paths of Gaethje, Pimblett, and O'Malley after UFC 324. However, it does not report on solutions, improvements, or innovations, nor does it significantly increase awareness about systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Justin Gaethje defeated Paddy Pimblett by unanimous decision at UFC 324, winning the interim lightweight title. The judges scored the fight 49-46, 49-46, and 48-47 in Gaethje's favor.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Australia to Euthanize Dingoes Found Near Canadian Womans Body",
    "domain": "general",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sun, 25 Jan 2026 05:30:04 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Global News",
      "Globe and Mail"
    ],
    "domains": [
      "cbc.ca",
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "In an online statement, a spokesperson from the government's Ministry of Environment and Tourism said it was aware of initial autopsy findings suggesting dingo bites were likely not James's immediate cause of death.",
      "Environment Minister Andrew Powell said in the same statement that while euthanizing the animals was a tough decision, it's the \"right call.\"",
      "Australia to cull dingoes found circling young Canadian woman’s body The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Dingoes that circled Piper James's body on Australian beach to be culled",
      "Dingoes found circling B.C. teen to be culled, Australia says",
      "Australia to cull dingoes found circling young Canadian woman’s body - The Globe and Mail"
    ],
    "url": "https://www.cbc.ca/news/world/piper-james-dingoes-culled-9.7059986?cmp=rss",
    "alternate_urls": [
      "https://globalnews.ca/news/11636991/dingoes-circling-bc-teen-to-be-culled-australia/",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeXFkYVVXRGtqV05fNWlfbG5BYUlOdUh4cXZrc3ZmWTlSZUdvTElpUi1vcEpUVkVWRWJGUjJvdnVuLVdqVkdHNnR4cjFqaktTQVRXVERGWk9wcjM5Q0hnX3RuY0JfVVFadFZKdjFZOEN4VEJ0b2hSYmNiN3YxVjJNYnB6dFFYUzV3WHpLOW9MTm9TN2dZTG9PUzczaw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/world/piper-james-dingoes-culled-9.7059986?cmp=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.753,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.762,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises basic awareness about the potential danger of dingoes in certain areas, but it doesn't provide much depth or insight into the broader context or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Australian authorities have decided to euthanize dingoes found near the body of a young Canadian woman, despite initial autopsy findings suggesting dingo bites were likely not the immediate cause of death. The Ministry of Environment and Tourism confirmed awareness of the autopsy results.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Threatens 100% Tariff on Canada",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 18:33:31 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Reuters"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "PM says recent agreement just cuts tariffs on a few sectors, as Trump threatens 100% tariffs on Canadian imports Canada’s prime minister, Mark Carney, said on Sunday his country had no intention of pursuing a free trade deal with China, responding to Donald Trump’s threat to impose a 100% tariff on",
      "Trump threatens Canada with 100% tariff over pending trade deal with China Reuters"
    ],
    "image_url": "https://i.guim.co.uk/img/media/5edbf90e903da652b1a5990098265424e3c01f15/469_0_6928_5541/master/6928.jpg?width=140&quality=85&auto=format&fit=max&s=8214bf911df3f7391bc9a3ba978dbea7",
    "titles": [
      "Canada has no intention of pursuing free trade with China, says Carney",
      "Trump threatens Canada with 100% tariff over pending trade deal with China - Reuters"
    ],
    "url": "https://www.theguardian.com/world/2026/jan/25/canada-has-no-intention-of-pursuing-free-trade-with-china-says-carney",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxNWDBacnoyYmpjSnlQUVpnSS1pNS1Dd2ItaU9GX085TUhMUzJaWWZxc2RXX1BfaEFDQkpzdmZmMTNwcXdhS0FqcExRRHczaWllQVB6SHFiYmY4UjFuVjFqaFo5bXdhLW1ibkVGdXRJLUF5X2JCRkRGU0M3N05ZaFY3M1dnU1BUb2NEOTFhN0FfcFk0bVhzZW1XTVNZbFlxcnhqSXFjS09aTnpUTWU0ckJZWXV6dG1UdTQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2026/jan/25/canada-has-no-intention-of-pursuing-free-trade-with-china-says-carney",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.757,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about Canada's stance on trade with China, contributing to their understanding of international trade relations. However, it doesn't seem to highlight any progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump has threatened to impose a 100% tariff on Canadian imports over a pending trade deal with China. Canadian Prime Minister Mark Carney stated that Canada is not seeking a free trade agreement with China and that a recent agreement only reduces tariffs in a few sectors.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Estêvão Shines as Chelsea Defeat Crystal Palace Without Palmer",
    "domain": "sports",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 16:34:14 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sports Illustrated",
      "BBC Sport"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com",
      "bbc.com"
    ],
    "snippets": [
      "If this was a taste of what life on the road under Liam Rosenior might be like for Chelsea fans, then anyone who doubted his appointment may have to think again. A brilliant performance from Estêvão, who scored the first after a mistake from his fellow teenager Jaydee Canvot before setting up João P",
      "Why Cole Palmer Is Not Playing for Chelsea vs. Crystal Palace Sports Illustrated",
      "Crystal Palace vs Chelsea: Starting XIs, confirmed team news for Premier League clash Sports Illustrated",
      "Estevao Willian replaces the injured Cole Palmer to inspire Chelsea to a comfortable win over Crystal Palace at Selhurst Park.",
      "Chelsea XI vs. Crystal Palace: Crucial Palmer Call Required—Injury News, Predicted Lineup Sports Illustrated",
      "Barcelona XI vs. Real Oviedo: Flick Picks Pedri Replacement—Injury News, Lineup Prediction Sports Illustrated"
    ],
    "image_url": "https://i.guim.co.uk/img/media/95ff66ccaae94887f042e7c7dc0a1ff531031c76/207_0_2917_2333/master/2917.jpg?width=140&quality=85&auto=format&fit=max&s=4ae84233d56d0b614025427b1c623cbd",
    "titles": [
      "Estêvão and Fernández power Chelsea past Crystal Palace as Wharton sees red",
      "Why Cole Palmer Is Not Playing for Chelsea vs. Crystal Palace - Sports Illustrated",
      "Crystal Palace vs Chelsea: Starting XIs, confirmed team news for Premier League clash - Sports Illustrated",
      "Estevao-inspired Chelsea beat Crystal Palace",
      "Chelsea XI vs. Crystal Palace: Crucial Palmer Call Required—Injury News, Predicted Lineup - Sports Illustrated",
      "Barcelona XI vs. Real Oviedo: Flick Picks Pedri Replacement—Injury News, Lineup Prediction - Sports Illustrated"
    ],
    "url": "https://www.theguardian.com/football/2026/jan/25/crystal-palace-chelsea-premier-league-match-report",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxOem96WE5lSlpVeFRYUFFCQlA4Q0JSN09xbVJWRDNWbEtqQ2hvUnZ1aWdXMEhuZ25LRDJSRlRjX1U1eEJySkxfcExLZlR2YW9LV0UxdnMxQ0JPZzN1TFlnMnJTTHBQNzUtU191SW9PNm5nZmhTSEdiSVA5M0VzWUVCZnhIX0gwdw?oc=5",
      "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNNlhiTjV3YmRZclUwSkY3YjlCS0ozMk9GWHJEYzdtdEVzQjNyTVJHS0dYUzNkS1RrLWZybTNxMlhkUVpJblo1SWN5dGxNbmRaYlVFckdvbTlOMmJYY01mVy1FOVVNZ3lUWmt5aVhLb0NDZnpXYzZQWHY0WVB2Q0Fmc0U1XzVyLS0zVVdORzRYU3d1NWRmTVBVM0t5aDd5RjZYNVZ4NHUxbkllWkppSDNJaE9KeDM3NUVPeDJsY1Q4d2czRWFYRjgxSHU1UkNNMUhyeFAzR3lSMk12NXhxakFrdU5nYkg?oc=5",
      "https://www.bbc.com/sport/football/videos/c78vl6zx3wpo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxPQWFSaEs5V2RGNWFGbWJ2b3B0LUc1a3ZveDJiWTc4dnRLa3ZMX1lMbVpKeDZwOTdSVGpQcklORklHMnhzOHlOTUJpVlZFY2dNaWZuTGNqbDlkSzdMbV9qZTRMT1JMSnFPR0Q0UzJmbnpuVUI2ck9LRTVUWF9sTWtnN203dW9HRm1oWk1mSkRiOE4tdnkzQnc?oc=5",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxPUG1KaVpmQmFEVEtrcGk3N3JlQVJnWVdncENBcmM5alk4d3hJUUV6R3RNRG5TRlp4OUxGdm9SSU02YzYxa1ZzNGJmdHlHWVFPamowTjByZ3diY0w3WlNMU24wNDlNZVVlc1JJSFRGUlZTR3pNbGpfVUI5NXBvZDNSbHBVT2tISUxHaFZiLWJTOTF4Vm1JdWc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/football/2026/jan/25/crystal-palace-chelsea-premier-league-match-report",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.892,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.754,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the result of a specific match and the players who made significant contributions. However, it lacks deeper analysis about the game, the performance of the players, or the implications of the result on the teams' standings.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Cole Palmer missed Chelsea's match against Crystal Palace due to injury. Estêvão Willian started in his place, scoring the opening goal and assisting another as Chelsea secured a comfortable win at Selhurst Park.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "J.B. Bickerstaff Named 2026 NBA All Star Game Coach for Pistons",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 13:51:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "J.B. Bickerstaff was named a coach for the 2026 NBA-All Star Game after his Pistons clinched the East's best record.",
      "The Pistons will have the No. 1 seed in the East on Feb. 1, the cut-off day to decide the coaches."
    ],
    "image_url": "",
    "titles": [
      "Pistons clinch All-Star selection for Bickerstaff",
      "Pistons' J.B. Bickerstaff named NBA All-Star Game coach for first time"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47721367/pistons-jb-bickerstaff-named-all-star-game-coach",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/pistons-j-b-bickerstaff-named-164853043.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47721367/pistons-jb-bickerstaff-named-all-star-game-coach",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.749,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Bickerstaff's All-Star selection. It does not offer actionable insights or a deeper understanding of the situation. It also does not report on solutions, improvements, or innovations, nor does it significantly increase awareness about systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "J.B. Bickerstaff has been named a coach for the 2026 NBA All-Star Game after the Pistons secured the No. 1 seed in the Eastern Conference as of February 1.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Newcastle Winless in League Without Bruno Guimaraes Since 2022",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 20:01:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Newcastle United have yet to win a league game without Bruno Guimaraes since he made his debut for the club in 2022."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0151/live/17531890-fa1e-11f0-a735-ffb020766df2.jpg",
    "titles": [
      "Why can't Newcastle win without Guimaraes?"
    ],
    "url": "https://www.bbc.com/sport/football/articles/czejxd0p7e7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/why-cant-newcastle-win-without-190651986.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/czejxd0p7e7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.733,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a specific issue in a football team, but there's no depth or insight into the broader context or implications. It doesn't provide actionable insights or report on solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Since Bruno Guimaraes joined Newcastle United in 2022, the team has not won any league matches in his absence.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Manchester United Beat Arsenal",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 13:30:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "aljazeera.com",
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "All the updates as United shock Arsenal with stunning second-half goals from Patrick Dorgu and ⁠Matheus Cunha.",
      "Man United are 12 points behind league-leading Arsenal, but after beating the Gunners on Sunday, can the Red Devils pull off an unlikely title push?",
      "Emiliano Buendia and Ollie Watkins scored in each half at St James' Park to move third-place Villa level on points with Manchester City in second on 46 points. Buendia fired Villa ahead with a dipping shot from outside of the area in the 19th minute and Watkins doubled the lead in the 88th."
    ],
    "image_url": "",
    "titles": [
      "Arsenal vs Manchester United 2-3: Premier League – as it happened",
      "Beating Arsenal puts Man United into Premier League title race",
      "Aston Villa beats Newcastle to keep pressure Arsenal and Man City at the top of the Premier League"
    ],
    "url": "https://www.aljazeera.com/sports/liveblog/2026/1/25/live-arsenal-vs-manchester-united-premier-league-2?traffic_source=rss",
    "alternate_urls": [
      "https://www.espn.com/soccer/story/_/id/47726339/beating-arsenal-puts-manchester-united-premier-league-title-race",
      "https://sports.yahoo.com/articles/aston-villa-beats-newcastle-keep-164115732.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/liveblog/2026/1/25/live-arsenal-vs-manchester-united-premier-league-2?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.819,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.732,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the result of the Premier League match between Arsenal and Manchester United. However, it lacks depth or insight and does not contribute to the reader's understanding, decision-making, or sense of agency.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Manchester United defeated Arsenal with second-half goals from Patrick Dorgu and Matheus Cunha. Aston Villa moved level on points with Manchester City in second place after a 2-0 win over Newcastle, with goals from Emiliano Buendia and Ollie Watkins.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Winter Storm Triggers Power Emergency and Widespread Disruptions in US",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 17:51:15 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Reuters",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Power Outages Cascade as Big Winter Storm Reaches US East Coast Bloomberg",
      "US Declares Power Emergency in Texas as Storm Boosts Demand Bloomberg",
      "US Winter Storm Prompts Power Grid Emergencies, Travel Chaos Bloomberg",
      "Sprawling US Winter Storm Strains Power Grids, Snarls Travel Bloomberg",
      "Power prices surge as winter storm spikes demand in US data center alley Reuters",
      "A massive winter storm reached the US Atlantic Coast on Sunday, dropping heavy snow and ice that left electric grids strained and grounded thousands of flights at levels not seen since the pandemic.",
      "Winter storm, sub-freezing cold descend on US, from Rockies to Atlantic Coast Reuters"
    ],
    "image_url": "",
    "titles": [
      "Power Outages Cascade as Big Winter Storm Reaches US East Coast - Bloomberg",
      "US Declares Power Emergency in Texas as Storm Boosts Demand - Bloomberg",
      "US Winter Storm Prompts Power Grid Emergencies, Travel Chaos - Bloomberg",
      "Sprawling US Winter Storm Strains Power Grids, Snarls Travel - Bloomberg",
      "Power prices surge as winter storm spikes demand in US data center alley - Reuters",
      "Power Outages Cascade as Big Winter Storm Reaches US East Coast",
      "Winter storm, sub-freezing cold descend on US, from Rockies to Atlantic Coast - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQZklvTWs5dW45UVNwX2VVaTZSeFFfVkpDYWNrZW9sMDhTa0FZdkZPelFfbjhjbFo5QTBzN0tlbUFsazItV0hBcml0aEFsbXowQ1NkNkR3RFc3OEhLV0IzcWE1M3FqYjZPRWhsX1FBZmdWcXQ3RFMxV3RIVm5seE5PZWYwemM4cDdIX180V1JmRllLNXBHWVg3RVdJRGZtTkpScVB2OWREYzZROXZmWEE0aUVXZ1Q4QQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxNZzBPSXhMQU1EVUowOW1zNGtjNHZ4LXZyUll6OGYzUm5ScGIzWTg2NDgzcW5meVlLZlJSaU5sbVNXaVpYYkg3bm1KM0ItcFVFaVRyZ2phdEhPMHYyQ1U0V3dMdWlsNWRDbnVTcUhMZ0E2TUZoMkhITmRQU2pfdGRoX0dSMHNWQVNpRENJWjZLTUljNjVuZ18zRUdvY2ttbUdqeTBrMUNNY0tYYTlieG0w?oc=5",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNbkYzbGtxWnlZbjcyNDdpSTJzMDI5R3BlUWFtZXNYdEc2dDdKNFczQ3FheUxyZGd4UDF2cEp0SDF3eHlMTDlNNGg4Q1VaVEtjTG82bWNaUGswX1JhejFSeFNXNlFOam5vV2NueXh4WHBZYTBYN0gwV0JFQXNvemh0S29JaUhrRlFjTi1OMmprTTVrS1U5b0oway0taWluQlU2NXNtMWZpS3BWZw?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRjFlazh4a2dJQndjTlJNQUc5MFNZQjdaSGVRampjMGVNSjJOZ01ib01CaHRsWklvVzRDZ2wtaG5Oc3FoX213TFRsbnR6Nm9iTk9lWDRITkZiY2hITE01aXpHZkhxMDRLMF9XMTVXOWg4NmpSMHpFZTQ4R2w5YUJoVV9XNUxJM1hTVzVzRWNkT1BmR3N5aFJFS2RROTlYaXU0ZGtWc0VWb1pZbkR3Z3JxZE5R?oc=5",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxQQjRncFYyWFczUzl6RnJjOTlDTUhJUFMwb0R1YVM0UEVrOUdlY3pHRXAxbmEzTWlNRTlqQ0F6MWdmRXNxNFlGQnhqcmc3OFJlaFZ3MEd5NGxMdFI3d0xCdjNDTEswTjJtdEx2SkMwM3ljOEdVMjJFbHhkWVdpS2ZWaHNmSkV6TEtZVVV0dXdIdTZwRXVTN1AyMHA2bHpEbUtVVmhGSWRnTnZGcjhERUlKVXhuZzhidFUzZ1E?oc=5",
      "https://financialpost.com/pmn/business-pmn/power-outages-cascade-as-massive-winter-storm-reaches-east-coast",
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxPdkhiQk9jVlVxTm9Eenlla0JENl9nMEtoeWNIU2J6b2w4bEg5VVZwdkpGSnBGSFY1Snp6MmNTNUxKMDkzU1EyeWlybzNBVHphaDJRRUM0aVNzaFlubkhzMl9iN2tTZjlXQk4wdWFGZDRNMG8wNjhFeVcxTkhWSzFCZWU1S1RnVG5LMy1rVjE0N1l1cmVhR0RpaU9qZGlXZUU0Szdrb3QwVHBBT3hyZVlwNTJNN0tjZlp4UGtyZzFqMA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQZklvTWs5dW45UVNwX2VVaTZSeFFfVkpDYWNrZW9sMDhTa0FZdkZPelFfbjhjbFo5QTBzN0tlbUFsazItV0hBcml0aEFsbXowQ1NkNkR3RFc3OEhLV0IzcWE1M3FqYjZPRWhsX1FBZmdWcXQ3RFMxV3RIVm5seE5PZWYwemM4cDdIX180V1JmRllLNXBHWVg3RVdJRGZtTkpScVB2OWREYzZROXZmWEE0aUVXZ1Q4QQ?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.769,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A major winter storm reached the US Atlantic Coast, bringing heavy snow and ice that strained power grids, triggered a federal power emergency in Texas, and caused widespread power outages and flight disruptions across multiple states.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Severe Winter Storm Cancels Flights and Causes Fatalities Across U.S",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 24 Jan 2026 20:19:07 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "NPR",
      "CNBC",
      "Associated Press",
      "MarketWatch",
      "Business Insider",
      "Al Jazeera",
      "BBC",
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "abcnews.go.com",
      "npr.org",
      "cnbc.com",
      "news.google.com",
      "marketwatch.com",
      "businessinsider.com",
      "aljazeera.com",
      "bbc.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "More than 180 million people are on alert for a massive weekend storm that stretches from New Mexico to Maine, and is expected to paralyze the South with dangerous ice and snow.",
      "A look at the extreme winter storm impacting two-thirds of the U.S.",
      "U.S. airlines canceled tens of thousands of flights and waived change fees for travelers as a massive winter storm swept across the country.",
      "More than 10,500 flights canceled Sunday as massive winter storm sweeps across US AP News",
      "Airlines have canceled nearly 15,000 flights due to a winter storm expected to wallop two-thirds of the U.S. over the weekend — with hubs in Dallas and Atlanta among the most affected.",
      "Thousands of flights canceled as major winter storm moves across the US AP News",
      "A severe winter storm has prompted US airlines to cancel flights, issue travel waivers, and advise passengers on refund and rebooking options.",
      "From Texas to New England, the monster storm brings hazardous conditions, prompting warnings to stay off roads.",
      "A powerful winter storm swept across the country, with heavy snow, ice and dangerously low temperatures affecting millions.",
      "Snow, sleet and perilously cold temperatures sweep eastern two-thirds of country as thousands of flights grounded Snowstorms strike the US: in pictures At least seven people are dead as the result of a monster winter storm that has brought heavy snowfall and ice from the Gulf coast to the north-east",
      "Forecasters said snow, sleet, freezing rain and dangerously frigid temperatures would sweep the eastern two-thirds of the United States on Sunday and into the week."
    ],
    "image_url": "https://s.abcnews.com/images/US/260124_abc_social_norwood_storm_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  More than half of US on watch for massive winter storm",
      "Photos: Massive winter storm sweeps across the U.S.",
      "Flight disruptions from massive winter storm will linger Monday",
      "More than 10,500 flights canceled Sunday as massive winter storm sweeps across US - AP News",
      "Nearly 15,000 U.S. flights have been canceled due to the winter storm — and counting",
      "Thousands of flights canceled as major winter storm moves across the US - AP News",
      "More flights canceled as huge winter storm grips the US. Here's what to do if your trip is impacted.",
      "Winter storm leaves over a million customers without power across US",
      "Watch: Winter storm grips US as millions face power outages and disruption",
      "US winter storm leaves seven people dead as more than 700,000 lose power",
      "Massive winter storm across U.S. brings snow, frigid temperatures, widespread power outages"
    ],
    "url": "https://abcnews.go.com/US/video/half-us-watch-massive-winter-storm-129528137",
    "alternate_urls": [
      "https://www.npr.org/2026/01/24/nx-s1-5685163/photos-massive-winter-storm-sweeps-u-s",
      "https://www.cnbc.com/2026/01/23/winter-storm-fern-flight-cancellations.html",
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxOOWlKRVVPNlZzWlExMk05V1NhSTlWeF9UVTEwWHNJemMyYkRjcGMyRWZ5Mk0tYnVZQ2RpM0FYNFFHcUJaM1ViZzRJcUlPd085ZXVoUlg5MXFfSzh2QjFaSUwxanhSb3VVYmwxNGc1NFlmSmhVeVlSUkx5V0hMR2RiLXMtU3J5Q2pXTENsejQwTGcwZnJtb1BtZg?oc=5",
      "https://www.marketwatch.com/story/nearly-2-000-u-s-flights-have-already-been-canceled-ahead-of-winter-storm-b2f46de3?mod=mw_rss_topstories",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxQNnJ6ckVaODFqY2tTZEtJcjZpdE05VUdqUWk5Ykw4V0ttZjVTb3N1RDlWdFhQekRBQm45aEVYeWJZejhjX1N0MENqNkYxalFaa0xVYnBDeXFaY0xYQXRPdHY1MmhzZG5vTG9EaE9ybm1lZ0Q5T05iZ2o2YVkzdF95Z2RuZTBqbWRyQ3hXM3QxVVJKb0E?oc=5",
      "https://www.businessinsider.com/flights-delayed-canceled-travel-plans-what-to-do",
      "https://www.aljazeera.com/news/2026/1/25/us-storm-causes-widespread-power-outages-thousands-of-flights-cancelled?traffic_source=rss",
      "https://www.bbc.com/news/videos/cpqyxlqwqqlo?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/us-news/2026/jan/25/us-storm-cuts-power-cancels-thousands-flights",
      "https://www.cbc.ca/news/world/us-storm-thousands-without-power-9.7060090?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/video/half-us-watch-massive-winter-storm-129528137",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.584,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A massive winter storm has swept across two-thirds of the U.S., bringing heavy snow, ice, and dangerously low temperatures from Texas to New England. Airlines have canceled nearly 15,000 flights, especially in Dallas and Atlanta, and issued travel waivers. At least seven people have died as a result of the storm, and over 180 million people remain under weather alerts.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "France Detains Indian Captain After Seizing Suspected Shadow Tanker",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 15:25:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "French officials seized the tanker, named the Grinch, in the Mediterranean Sea on Thursday.",
      "France detains Indian captain of suspected shadow fleet tanker Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/68ad/live/5bd25b00-f9fd-11f0-a24b-df29ade509fc.png",
    "titles": [
      "Captain of suspected Russian shadow tanker in French custody",
      "France detains Indian captain of suspected shadow fleet tanker - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/c62vke5dly2o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNUC1HaW1ZZGFyNm8zcmloMldEWW5aSENWTmVpTjRNYm1ZdUl3bDdIVGk1eFpHSW1mMXRJem9vYnJlZGRiOE4xUkxhRjh1bGtERTFiTzhHdVNlRGs1Zk1HdzAzdmJxSVZiN0JiLUNQTTR1cUtHbmkycnBMNF9wRlpNZzlGRHNqZkpGWnJsRFhJYjJ2M204MWZ5MTVLbGtLMDVZOGdWdk1WWXltcU0?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c62vke5dly2o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.864,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.714,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The article informs about a specific incident related to international maritime law enforcement. However, without more details on the broader context, implications, or potential solutions, its usefulness is somewhat limited.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "French authorities detained the Indian captain of the tanker Grinch after seizing the vessel in the Mediterranean Sea on Thursday. The tanker is suspected of being part of a shadow fleet.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Eighty Six Arrested After Protest at Wormwood Scrubs Prison",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 12:49:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Videos show police officers shoving protesters to the ground and herding them outside Prison Wormwood Scrubs.",
      "Police say group breached HMP Wormwood Scrubs grounds where Umer Khalid is being held Eighty-six people have been arrested on suspicion of aggravated trespass after they breached prison grounds while protesting in support of a Palestine Action prisoner on hunger strike, the Metropolitan police have"
    ],
    "image_url": "",
    "titles": [
      "Dozens supporting Palestine hunger strikers arrested at London prison",
      "Met arrests 86 on suspicion of trespass at prison holding Palestine Action hunger striker"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/25/dozens-arrested-in-support-of-palestine-hunger-strikers-at-london-prison?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2026/jan/24/protesters-supporting-palestine-action-hunger-striker-arrested-outside-prison"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/25/dozens-arrested-in-support-of-palestine-hunger-strikers-at-london-prison?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.804,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.686,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a specific protest and the response by law enforcement, but it doesn't provide much depth or insight into the broader issues at stake or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Eighty-six protesters were arrested for aggravated trespass after breaching the grounds of HMP Wormwood Scrubs, where Umer Khalid is being held. Videos show police officers removing demonstrators who were protesting in support of a Palestine Action prisoner on hunger strike.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Republicans Split on Trump Immigration Policy After Minneapolis",
    "domain": "business",
    "source_domain": "ft.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 18:13:30 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "ft.com",
      "news.google.com"
    ],
    "snippets": [
      "Some Republicans break ranks while Democrats threaten a shutdown over latest death in Minneapolis",
      "GOP Wavers on Trump Immigration Crackdown After Latest Killing Bloomberg"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1e4c23c7-f8e0-48fb-9325-cd09f698eb85.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump faces growing backlash against immigration crackdown after shooting",
      "GOP Wavers on Trump Immigration Crackdown After Latest Killing - Bloomberg"
    ],
    "url": "https://www.ft.com/content/ceace997-eb6d-43ac-8a64-7a2c6a19e54b",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTjJhUFdTa180aVFFS0xRMTVENUMyZjF5Ti1hSkM3Nmw1TnBUbnp1X0JCNFZsdXNYOUFsVTZCQVoxWkJNR1dZRTdKbEtTUG4xam9IczRSeTBFRl9lNm0zbnRwTkhiUkRKejdQdUozQjBTU21RSGlJT0NEMEFUMHV2WXRPdGtDNTYwQU90WWxDT2ktSnZWeC1WT1QtanIxYTZzdEhTZVhlWmczUWVJUVdvRkllcw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.ft.com/content/ceace997-eb6d-43ac-8a64-7a2c6a19e54b",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.681,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Some Republicans have distanced themselves from Trump's immigration policies following a recent killing in Minneapolis, while Democrats are threatening a government shutdown in response to the incident.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Praises UK Troops After Criticism Over Afghanistan Remarks",
    "domain": "politics",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 13:35:14 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "Reuters"
    ],
    "domains": [
      "washingtonpost.com",
      "news.google.com"
    ],
    "snippets": [
      "President Donald Trump’s comments belittling the role of NATO allies in Afghanistan sparked outrage in Britain, which lost 457 soldiers in the U.S.-led war.",
      "Trump praises UK troops as brave warriors after widespread condemnation Reuters"
    ],
    "image_url": "",
    "titles": [
      "Trump, in retreat, praises U.K. troops after royal family expresses hurt",
      "Trump praises UK troops as brave warriors after widespread condemnation - Reuters"
    ],
    "url": "https://www.washingtonpost.com/world/2026/01/25/trump-british-troops-afghanistan-charles/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNWEo3bkhhcTBTeVhBazRYM2dNWXEtZ0VXRFcwdm1aTXl4OENqWjgwWWw4MDV4bFpnMUF6aWs4RXJCSXFQNkFranAxcXNQLUVNMFBFOFhkR2lWRm8tWDRiek1wbVRKVUJCbl9IVlhLRjI0T2d0Wlk4SE9jbkhMYXhIcExGUnFmVVpTTTA2alVvTERJVnRSUjN3Q3RkZUxMd20tcjlFRHlWWFppVHA4VlpHTkhfVQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.washingtonpost.com/world/2026/01/25/trump-british-troops-afghanistan-charles/",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.677,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a recent event involving Trump and the U.K. troops, but it lacks depth or insight. It doesn't provide actionable insights, report on solutions, or increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump praised UK troops as brave warriors after facing widespread criticism in Britain for comments that downplayed the role of NATO allies in Afghanistan, where the UK lost 457 soldiers.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bessent Says Carney Shifted Position With China Trade Deal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 16:22:12 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Bessent Sees Canada’s Carney Making ‘About-Face’ on China Trade Bloomberg",
      "Treasury Secretary Scott Bessent suggested that Prime Minister Mark Carney did an “about-face” by striking a deal with China to lower some trade barriers, reinforcing President Donald Trump’s latest tariff threat against Canada."
    ],
    "image_url": "",
    "titles": [
      "Bessent Sees Canada’s Carney Making ‘About-Face’ on China Trade - Bloomberg",
      "Bessent Sees Canada’s Carney Making ‘About-Face’ on China Trade"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPbHVKSEFvdThhVEpVRGVkOWZXcU1obk1oemNwTHhTTGNDbVBsN3lQNGk4dVBUbkhBdnFUTEhnRjVvcFEzcURqM3pORW9nWVJtT3I3b3o5WHlPVXNqa1FFZkFfNEp5V3V1bEdSQnVWczhUby1seGdyQ1hVLS16YUhMVF9GdzhwMFhmVnh4RFFIQ2NtWTNmN2VqaUttcDBmeFRFRzktS29sUFVBcC1qUm1ScXp3?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/bessent-sees-canadas-carney-making-about-face-on-china-trade"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPbHVKSEFvdThhVEpVRGVkOWZXcU1obk1oemNwTHhTTGNDbVBsN3lQNGk4dVBUbkhBdnFUTEhnRjVvcFEzcURqM3pORW9nWVJtT3I3b3o5WHlPVXNqa1FFZkFfNEp5V3V1bEdSQnVWczhUby1seGdyQ1hVLS16YUhMVF9GdzhwMFhmVnh4RFFIQ2NtWTNmN2VqaUttcDBmeFRFRzktS29sUFVBcC1qUm1ScXp3?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.887,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Bessent Sees Canada’s Carney Making ‘About-Face’ on China Trade Bloomberg",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Christian Horner Leads Group Interested in Buying Stake in Alpine",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 16:54:31 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "Former Red Bull boss Christian Horner is among a group of investors interested in purchasing a stake in Alpine, the French team confirms.",
      "Christian Horner is in talks about an F1 comeback, with the former Red Bull team principal's consortium interested in buying a minority stake in Alpine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ebd9/live/a63bcfc0-fa0a-11f0-b8ce-0fa566ac6f07.jpg",
    "titles": [
      "Horner part of group interested in Alpine stake",
      "Alpine confirm Horner consortium in talks to buy stake in team"
    ],
    "url": "https://www.bbc.com/sport/formula1/articles/ce3e5l0jle7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/f1/news/12040/13498813/f1-christian-horner-and-fellow-investors-in-talks-to-buy-stake-in-alpine"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/formula1/articles/ce3e5l0jle7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Christian Horner is part of a group interested in buying a minority stake in Alpine, as confirmed by the French team. Talks are ongoing regarding the potential investment and Horner's possible return to Formula 1.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "BBC Correspondent Mark Tully",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 12:12:08 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Sir Mark covered some of the defining moments in India's history in a career that spanned decades.",
      "BBC correspondent and author whose sensitive reporting from India made him a revered public figure in the subcontinent In 2017 Mark Tully was making a documentary for the BBC World Service to coincide with the 70th anniversary of partition – the moment that marked the end of British colonial rule in"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4121/live/0ed9ada0-1c21-11ef-80aa-699d54c46324.jpg",
    "titles": [
      "Sir Mark Tully, the BBC's 'voice of India', dies aged 90",
      "Sir Mark Tully obituary"
    ],
    "url": "https://www.bbc.com/news/articles/c4nnp4d064do?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/media/2026/jan/25/sir-mark-tully-obituary"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c4nnp4d064do?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.79,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.656,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the death of a notable figure, but it doesn't offer much depth or insight beyond that. It doesn't contribute to the reader's understanding, decision-making, or sense of agency.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "BBC correspondent and author Mark Tully, known for his extensive reporting on India's history and his respected work in the subcontinent, has died. Tully's career included coverage of major events such as the 70th anniversary of India's partition.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Japan PM Takaichi Signals Readiness to Address Market Speculation",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 25 Jan 2026 05:58:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Reuters",
      "CNBC"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Takaichi Warns Japan Is Ready to Act on Speculative Moves Bloomberg",
      "Japan PM vows to act against speculative market moves after yen spike Reuters",
      "Japan PM vows to act against speculative market moves after yen spike CNBC"
    ],
    "image_url": "",
    "titles": [
      "Takaichi Warns Japan Is Ready to Act on Speculative Moves - Bloomberg",
      "Japan PM vows to act against speculative market moves after yen spike - Reuters",
      "Japan PM vows to act against speculative market moves after yen spike - CNBC"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMGJtbUJhWnFhdEJQUXhhOGZOM3djd3VlSk9sX1Z4anFrMS1XbjllSGJOdVBzVF9MZG5sVjdPNlBtOUZJdzNHamRnVXJ6a01qVlY3V2pQLVRCejNUXzA3aVBLdXdtdk53QklHeEdjUENZdEk3ZDM1LUVhOWlKYzFucWlaVVJRSGRFRy0xRS04Nkd1YUdJMHp3ZFZSQzd3TzlkdkJaLWRjN3UxT1cwYnROMEYzT0s?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxQNmNOWXdLdGprVGJzYWswcGtsUmwxM2tUVW02cWxVaHE4QV94NHBhbFlYeUt0UkdZQkxrZk1VYXRjZWZBeWFJSy1KWmZrZndseEIwb3NXeml3bG9iZVFFcFNqMnB4NmhLT2tzT1RIcmR1T1lZY01DZnRyeHJQT2x1SGFqWFRRaFVlc25DM1VOQmpkUDFpTXNQWlhrOHdmT3NMdWVFMEJwa1JBenhBc3hNVUhaelotTk1tYnFGZA?oc=5",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOMnE2dEltZ2Rfc2EtcktnTU9QZlhxekRZQUdDZDhSVTJGWUNKZFVOTFRkQUpMS2U1SnZvWE5Qa0g0cFBRYjBuTExBSkpKZjl0RkFzRXpFZW92U0F2QmRSWDdDYmNfTnZsOUd5Wk5feENTS09vTzgtbXkyc3duUWs3Mzk4MmdzSWJtTE8tbTN1VkNaaDRGckRXM0NXMEVIY2lsMUFxYl9OUHNuZ9IBrwFBVV95cUxOdmJjVkpXSC1rTFdGSS1tSTZyNVZQTVNleF8zSU5KSDdONGJMSFlNbUFhT0hCcUJ6YU05bV9QTlBNa3M5cmxqZ19LWkQwajF3MDJHQWRsSnR0eEgyZm1ENzhfQ0Qzc19IS2Z6VUg0UHcwUGRVNzdmbDAxNUZVVWt1T29wanBnMXNSYXdLRUFPY1M1NlRxbFFVWVcybkRZem1ZZ3hLeTF3TTdXWkxpS1VJ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMGJtbUJhWnFhdEJQUXhhOGZOM3djd3VlSk9sX1Z4anFrMS1XbjllSGJOdVBzVF9MZG5sVjdPNlBtOUZJdzNHamRnVXJ6a01qVlY3V2pQLVRCejNUXzA3aVBLdXdtdk53QklHeEdjUENZdEk3ZDM1LUVhOWlKYzFucWlaVVJRSGRFRy0xRS04Nkd1YUdJMHp3ZFZSQzd3TzlkdkJaLWRjN3UxT1cwYnROMEYzT0s?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.664,
      "consensus": 0.749,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: warn); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Japan's Prime Minister Takaichi stated that the government is prepared to take action against speculative movements in financial markets following a recent spike in the yen.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK Announces Plan to Create National British FBI Police Force",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 24 Jan 2026 22:32:13 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Associated Press"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "UK to create new 'British FBI' police service Reuters",
      "UK plans to create ‘British FBI’ to bring national investigations under single police force AP News"
    ],
    "image_url": "",
    "titles": [
      "UK to create new 'British FBI' police service - Reuters",
      "UK plans to create ‘British FBI’ to bring national investigations under single police force - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQdHpHWHRNZDdOMWVSNHMxVzJxRjJveHljMW5QWnUxNFlRRnktNFQ4U2FEWE5iS0NwZWlMLXNiVGM1aFBzeE51a19BZ2toRDEwUFRKdXZpN3I4VWFTWlpGT1cwbW1tcHRwS2hnSjdzVTRkYkxyb1dWSHBuUEd2ZTQwSmR6Mm1WaVhUVmRaeG13?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxOSWhGRWtRbzFSWDloSHA1Y0Rsa2ZPWVZGbzloZ3F0cTZad1NaeWlEZTQ0MV9KTngyenRlYjdqaUVYV2RTY3FRZi1uZ3VPWHduVDRQUU00ZHJacHAtT2ktMWV1YnZXS2kwV2stUm5nbGlUQVNJZXB4WWhSSDIzWm05RzFmZTJ0akZzQm5RcVdvcDJCZUEzRjBYNHRqaWI?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQdHpHWHRNZDdOMWVSNHMxVzJxRjJveHljMW5QWnUxNFlRRnktNFQ4U2FEWE5iS0NwZWlMLXNiVGM1aFBzeE51a19BZ2toRDEwUFRKdXZpN3I4VWFTWlpGT1cwbW1tcHRwS2hnSjdzVTRkYkxyb1dWSHBuUEd2ZTQwSmR6Mm1WaVhUVmRaeG13?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.54,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.627,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about a new development in the UK's law enforcement system. It could potentially impact the reader's understanding of the country's security and law enforcement landscape. However, without more context or detail about the implications of this new service, it falls short of being fully constructive.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The UK government has announced plans to establish a new national police force, referred to as a 'British FBI', which will consolidate national investigations under a single agency.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "National Guard Activated After Man Killed by Border Patrol Agent in",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 25 Jan 2026 03:18:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Man is shot and killed during Minneapolis immigration crackdown, National Guard activated AP News",
      "National Guard activated in Minneapolis after Border Patrol agent kills man AP News"
    ],
    "image_url": "",
    "titles": [
      "Man is shot and killed during Minneapolis immigration crackdown, National Guard activated - AP News",
      "National Guard activated in Minneapolis after Border Patrol agent kills man - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQbzdoM01UZGsyeXdoYWljWk9SNnZDUXBxZ1B6a2thNUlFN3ZfckkyeU1WSW9KSlMxVC0xTEI0YmxKTVBYTFVkYmx2aFVCdlVYdXVFaXdDYzJ0RlBKMTRnaFVVQUtGcjdONmNXWGdqb05uVkhHVFdTdWhhUmRzT1ZZcko0c24xd1NfVG03bzh1S21lRUs5a2M0cA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMidEFVX3lxTFBpa2xDZTcwaXhzRVBhREF6NlFVRGdVWFROMUlYbVVwOEtMTGtITUUzVEM2N3J3dHF1emthVzBLYlk4RDhQdEFYT3RwLXNCOUtyX1FZV0dFTU9nX2l5OUZjX0daTVlTTWhMRG1NRlh4bERRcHVY?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQbzdoM01UZGsyeXdoYWljWk9SNnZDUXBxZ1B6a2thNUlFN3ZfckkyeU1WSW9KSlMxVC0xTEI0YmxKTVBYTFVkYmx2aFVCdlVYdXVFaXdDYzJ0RlBKMTRnaFVVQUtGcjdONmNXWGdqb05uVkhHVFdTdWhhUmRzT1ZZcko0c24xd1NfVG03bzh1S21lRUs5a2M0cA?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.617,
      "consensus": 0.35,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is reactive and focuses on a negative event. It provides basic awareness about the situation but does not provide any deeper understanding or insight into the issue at hand.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A man was shot and killed by a Border Patrol agent during an immigration crackdown in Minneapolis. In response, the National Guard has been activated in the city.",
    "is_trending": false,
    "trending_score": 0.0
  }
]