[
  {
    "title": "Family of American-Palestinian teen killed by Israel demands justice",
    "domain": "general",
    "location": "global",
    "published": "Wed, 09 Apr 2025 12:54:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The family of 14-year-old American-Palestinian Amer Mohammad Rabea is demanding justice"
    ],
    "image_url": "",
    "summary": "The family of 14-year-old American-Palestinian Amer Mohammad Rabea is seeking justice for his death. They have publicly called for accountability, though specific details of the incident leading to Rabea's death were not disclosed in the provided information. The current status of their demand and any response from authorities remain unspecified.",
    "titles": [
      "Family of American-Palestinian teen killed by Israel demands justice"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.957,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48524999999999996,
    "normalized_score": 10.0
  },
  {
    "title": "Soya beans: China and EU’s secret weapon against Trump’s tariff wars?",
    "domain": "general",
    "location": "global",
    "published": "Wed, 09 Apr 2025 12:58:47 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soya beans - the top US agricultural export - could be Washington&#039;s vulnerable spot in the ongoing tariff spat."
    ],
    "image_url": "",
    "summary": "Soya beans, as the leading agricultural export of the United States, have emerged as a potential weak point for Washington in the midst of the ongoing tariff dispute.",
    "titles": [
      "Soya beans: China and EU’s secret weapon against Trump’s tariff wars?"
    ],
    "score_components": {
      "magnitude": 0.28,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47350000000000003,
    "normalized_score": 9.49
  },
  {
    "title": "China retaliates against Trump's 'trade tyranny' with 84% tariffs",
    "domain": "general",
    "location": "global",
    "published": "Wed, 09 Apr 2025 12:43:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Manufacturers and exporters are scrambling after 104% tariff on China-made goods comes into effect."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9df6/live/46b704d0-1503-11f0-a0c4-0d08556af5ee.jpg",
    "summary": "Manufacturers and exporters are facing challenges due to a new 104% tariff imposed on goods made in China. This significant increase in tariffs has prompted them to urgently seek solutions to mitigate the impact on their businesses.",
    "titles": [
      "China retaliates against Trump's 'trade tyranny' with 84% tariffs"
    ],
    "score_components": {
      "magnitude": 0.28,
      "recency": 0.954,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47250000000000003,
    "normalized_score": 9.44
  },
  {
    "title": "Trump tariffs spark US government debt sell-off",
    "domain": "general",
    "location": "global",
    "published": "Wed, 09 Apr 2025 15:30:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The cost of borrowing for the US government rose as confidence in the economy waned."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e4c/live/1d4d0e70-1533-11f0-bc17-dfa4f8dfee61.jpg",
    "summary": "The US government experienced an increase in borrowing costs due to reduced confidence in the economy. This development indicates a shift in market sentiment, where investors are possibly demanding higher interest rates to lend money to the government amidst economic uncertainties.",
    "titles": [
      "Trump tariffs spark US government debt sell-off"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.34
  },
  {
    "title": "Trump’s tariff war: What’s at stake for China’s economy?",
    "domain": "general",
    "location": "global",
    "published": "Wed, 09 Apr 2025 13:48:34 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As other countries scramble to renegotiate new tariffs with Washington, China is unlikely to back down."
    ],
    "image_url": "",
    "summary": "Amidst global efforts to renegotiate tariffs with Washington, China stands firm, indicating no inclination to modify its stance on the matter. This situation highlights a distinct approach by China compared to other nations actively seeking new tariff agreements with the United States.",
    "titles": [
      "Trump’s tariff war: What’s at stake for China’s economy?"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.34
  },
  {
    "title": "Division III baseball teams with combined 141-game losing streak end massive skids by splitting doubleheader",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 09 Apr 2025 15:37:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lehman College and Yeshiva University have finally entered the win column -- against each other"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/09/218873c8-bb95-48f0-afd1-660485824d63/gettyimages-71484382-1-1.jpg",
    "summary": "Lehman College and Yeshiva University, both having previously faced losses, recently competed in a match where they each had the opportunity to secure their first win of the season. The outcome was that one of these institutions finally achieved its first victory, marking an end to its losing streak. The specific winner of the match was not mentioned.",
    "titles": [
      "Division III baseball teams with combined 141-game losing streak end massive skids by splitting doubleheader"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37850000000000006,
    "normalized_score": 5.33
  },
  {
    "title": "Grizz's Wells awake, alert but has broken wrist",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 9 Apr 2025 10:57:22 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Grizzlies rookie Jaylen Wells is awake, alert and moving his extremities but sustained a broken wrist after a scary fall against the Hornets."
    ],
    "image_url": "",
    "summary": "Jaylen Wells, a rookie for the Grizzlies, is conscious and can move his limbs following a severe fall during a game against the Hornets. However, he has suffered a broken wrist due to the incident.",
    "titles": [
      "Grizz's Wells awake, alert but has broken wrist"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36250000000000004,
    "normalized_score": 4.63
  },
  {
    "title": "Is Deion Sanders using the Saints to boost Shedeur Sanders' NFL draft stock?",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 09 Apr 2025 15:37:51 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Is Deion Sanders using the Saints to help Shedeur Sanders' draft stock? It doesn't matter if they're interested so long as that's the perception."
    ],
    "image_url": "",
    "summary": "There are speculations that Deion Sanders might be using the New Orleans Saints to boost the draft stock of Shedeur Sanders. The strategy hinges on creating a perception of interest from the Saints, regardless of their actual intent. This approach might influence other teams' views on Shedeur's value in the draft.",
    "titles": [
      "Is Deion Sanders using the Saints to boost Shedeur Sanders' NFL draft stock?"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.995,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35475,
    "normalized_score": 4.29
  },
  {
    "title": "Brazil to play in US group at 2026 World Baseball Classic, Taiwan in Japan's pool",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 09 Apr 2025 15:34:58 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil will join the United States, Mexico, Italy and Britain in Group B of the first round of next year's World Baseball Classic at Houston’s Minute Maid Park.  Major League Baseball and the players’ association on Wednesday allocated the four qualifiers for the 20-nation tournament, which runs from March 5-17.  Taiwan was added to Group C at the Tokyo Dome, where it will meet defending champion Japan, Australia, South Korea and the Czech Republic."
    ],
    "image_url": "",
    "summary": "Brazil is set to compete in Group B alongside the United States, Mexico, Italy, and Britain in the first round of the World Baseball Classic at Houston’s Minute Maid Park. This announcement was made by Major League Baseball and the players’ association, placing Brazil in the 20-nation tournament scheduled for March 5-17. Additionally, Taiwan has been placed in Group C, joining defending champion Japan, Australia, South Korea, and the Czech Republic at the Tokyo Dome for their matches.",
    "titles": [
      "Brazil to play in US group at 2026 World Baseball Classic, Taiwan in Japan's pool"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 4.28
  },
  {
    "title": "Italy Superstar Wingback Training Individually – Iran Striker Could Play Inter Milan Vs Cagliari Clash",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 09 Apr 2025 15:32:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Inter Milan star wingback Federico Dimarco returned to training today but worked separately from the rest of the squad.According to Sky Sport Italia via FCInter1908, the 27-year-old continues with per..."
    ],
    "image_url": "",
    "summary": "Inter Milan's Federico Dimarco, 27, has resumed training but is working separately from the main squad, as reported by Sky Sport Italia via FCInter1908. His current training regimen indicates a phase of recovery, although specific details regarding his condition or expected return to full team activities were not provided.",
    "titles": [
      "Italy Superstar Wingback Training Individually – Iran Striker Could Play Inter Milan Vs Cagliari Clash"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35425000000000006,
    "normalized_score": 4.27
  },
  {
    "title": "Prada cuts Versace purchase price by $200mn after Trump tariffs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 09 Apr 2025 15:29:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Italian fashion group set to announce $1.38bn tie-up with Capri-owned house as soon as Thursday"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2da68899-2c68-4150-b737-9cce2d000c4b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "An Italian fashion group is expected to announce a partnership with a house owned by Capri, valued at $1.38 billion, as early as Thursday. This collaboration marks a significant development in the fashion industry, combining the strengths and resources of both entities.",
    "titles": [
      "Prada cuts Versace purchase price by $200mn after Trump tariffs"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.34
  },
  {
    "title": "Which Countries Are Retaliating and Which Are Negotiating Trump's Tariffs?",
    "domain": "business",
    "location": "global",
    "published": "Wed, 09 Apr 2025 14:51:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Kent Nishimura / Bloomberg via Getty Images President Donald Trump holds a poster listing the tariffs that are set to be imposed, during an event Wednesday at the White House.\" src=\"https://www.investopedia.com/thmb/8aStWKDiSTRbk3RS2tCNcTZB7UQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207587804-8427404b130c43cdbf76608c381b17e6.jpg\" title=\"US President Donald Trump holds a reciprocal tariffs poster during a tariff announcement in the Rose Garden of the White House in Washington, DC, US, on Wednesday, April 2, 2025. \" /><figcaption><i><p>Kent Nishimura / Bloomberg via Getty Images</p> President Donald Trump holds a poster listing the tariffs that are set to be imposed, during an event Wednesday at the White House.</i></figcaption></figure><p>Countries are reacting to widespread tariffs implemented by the U.S. in the early hours of Wednesday—and there are two distinct approaches.</p><p>Some countries are retaliating, enforcing their own additional tariffs on U.S. goods. President Donald Trump has said he will respond to any retaliation by raising America's <a href=\"https://www.investopedia.com/terms/i/import-duty.asp\">import duties</a>.</p><p>Numerous others are attempting to negotiate deals with the U.S. in hopes of lowering tariffs. While none has been successful yet, Trump and his advisors have said they are looking for deals that lower trade deficits.</p><p>Here are the countries taking these different approaches.</p><h2><strong>Retaliating</strong></h2><p>Several countries are responding to Trump's tariffs with additional import taxes on U.S. products. Trump has said that if countries retaliate, he will increase the \"reciprocal\" tariffs on that country.</p><h3>China</h3><p>China had already planned a <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">34% retaliatory tariff</a> last week. In response, Trump ratcheted up tariffs on Chinese goods to 104% and those went into effect early Wednesday morning.</p><p>The Chinese government responded by <a href=\"https://www.investopedia.com/china-imposes-84-percent-retaliatory-tariff-on-us-goods-11711781\">raising its levy</a> on U.S. goods to 84%.<br /><br />\"The U.S.'s practice of escalating tariffs on China is a mistake on top of a mistake, which seriously infringes on China's legitimate rights and interests and seriously damages the rules-based multilateral trading system,\" China's Ministry of Finance said.</p><p>China has said it will \"<a href=\"https://www.investopedia.com/global-stocks-rebound-even-as-china-pledges-to-fight-to-the-end-on-tariffs-11711018\">fight to the end</a>\" in the tariff war.</p><h3>European Union</h3><p><a href=\"https://www.investopedia.com/terms/e/europeanunion.asp\">European Union</a> officials voted Wednesday to implement retaliatory tariffs on U.S. goods.</p><p>The bloc's tariffs will affect around $23.2 billion in U.S. exports, according to <em>Bloomberg</em>, and are in response to the <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/trump-imposes-more-tariffs-this-time-on-steel-and-aluminum-8789116\">steel and aluminum tariffs</a> previously implemented, according to a statement released by officials.<span class=\"ql-inline-citation\"></span><span class=\"ql-inline-citation\"></span></p><p>\"The EU considers U.S. tariffs unjustified and damaging, causing economic harm to both sides, as well as the global economy,\" the statement said. \"The EU has stated its clear preference to find negotiated outcomes with the U.S., which would be balanced and mutually beneficial.\"</p><p>The tariffs will be implemented on April 15 and could be suspended should the two governing bodies reach a deal.</p><p>The EU is also reportedly considering some concessions to encourage Trump to lessen tariffs. Officials have said they would be willing to eliminate tariffs on certain goods if the U.S. agreed to do the same. Automobiles are one of the categories that are being considered.</p><h2><strong>Negotiating</strong></h2><p>Treasury Secretary Scott Bessent said 70 countries had <a href=\"https://www.investopedia.com/tariffs-are-hours-away-from-going-into-effect-how-long-will-they-last-11711413\">called to negotiate trade deals</a> at the beginning of the week. Trump has posted on Truth Social that he has met with or had calls with several countries.</p><p>Below are some countries that are confirmed to be making an attempt to negotiate lower tariffs.</p><h3>Japan</h3><p>Japanese government officials have been in talks with Trump since the beginning of the week, according to reports.</p><p>The country seeks to negotiate down the 24% tariff that the U.S. is charging on Japanese imports. Japan has long been an economic ally, with the U.S. importing $148.2 billion of goods from Japan last year.<span class=\"ql-inline-citation\"></span></p><p>Bessent has said Japan will likely \"get priority\" because they came forward quickly.<span class=\"ql-inline-citation\"></span></p><h3>Vietnam</h3><p>Vietnam's first attempt at a deal was dismissed by Trump's trade adviser Peter Navarro early in the week but it reportedly is still attempting to negotiate with the administration.<span class=\"ql-inline-citation\"></span></p><p>Many companies moved their manufacturing out of China in recent years as wages have increased and tariffs put on China in Trump's first administration increased costs. Nike, for example, sources <a href=\"https://www.investopedia.com/manufacturing-already-moved-out-of-china-now-where-will-it-go-11711407\">large portions of its shoes and appare</a>l from Vietnam, according to its most recent annual report.</p><p><em>Bloomberg</em> reported that a top Vietnamese official has headed to Washington for negotiations.</p><h3>South Korea</h3><p>On Tuesday, Trump wrote on the social media site Truth Social that he had \"a great call\" with South Korean Acting President and Prime Minister Han Duck-soo.<span class=\"ql-inline-citation\"></span></p><p>\"We have the confines and probability of a great DEAL for both countries,\" Trump wrote. \"Their top TEAM is on a plane heading to the U.S., and things are looking good.\"</p><p>The U.S. levied a 25% tariff on South Korean goods when widespread tariffs went into effect in the early hours Wednesday.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/8aStWKDiSTRbk3RS2tCNcTZB7UQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207587804-8427404b130c43cdbf76608c381b17e6.jpg",
    "summary": "Following the implementation of widespread tariffs by the U.S. early Wednesday, countries have adopted differing responses. Some, including China and the European Union, are retaliating with their own tariffs on U.S. goods. China increased its levy to 84% in response to the U.S. setting tariffs at 104% on Chinese products, while the EU plans to implement retaliatory tariffs affecting $23.2 billion in U.S. exports. On the other hand, countries like Japan, Vietnam, and South Korea are seeking negotiations to lower these tariffs. The U.S. Treasury Secretary reported that 70 countries had reached ",
    "titles": [
      "Which Countries Are Retaliating and Which Are Negotiating Trump's Tariffs?"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46799999999999997,
    "normalized_score": 9.25
  },
  {
    "title": "China hits US imports with additional retaliatory tariff of 50%",
    "domain": "business",
    "location": "global",
    "published": "Wed, 09 Apr 2025 14:49:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Beijing to match new duties imposed by Donald Trump with effect from Thursday as trade war escalates"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F040840d5-b0b2-476d-9116-039b99c5aef6.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "Beijing announced it will implement new tariffs in response to duties imposed by Donald Trump, escalating the trade war. These measures will take effect starting Thursday.",
    "titles": [
      "China hits US imports with additional retaliatory tariff of 50%"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46775,
    "normalized_score": 9.23
  },
  {
    "title": "Pharma Stocks Sink as Trump Says 'Major' Tariffs Coming to Industry",
    "domain": "business",
    "location": "global",
    "published": "Wed, 09 Apr 2025 14:28:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Getty Images President Donald Trump speaks at the National Republican Congressional Committee dinner on April 8, 2025\" src=\"https://www.investopedia.com/thmb/ghpo64A0f_xfruexRrBUxPPTkk4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209261511-9b7347da039a42a88128a9ff2197c224.jpg\" title=\"Donald Trump speaks in a black tuxedo in front of a podium and microphone.\" /><figcaption><i><p>Anna Moneymaker / Getty Images</p> President Donald Trump speaks at the National Republican Congressional Committee dinner on April 8, 2025</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Shares of several drugmakers fell Wednesday as the threat of tariffs on the industry loomed.</li><li>President Donald Trump said at an event Tuesday that \"a major tariff\" was coming to the pharmaceutical industry.</li><li>The sector was exempted from the sweeping tariffs that were announced last week and largely went into effect Wednesday.</li></ul><br /><br /><p>Shares of several major pharmaceutical companies slumped Wednesday morning as President Donald Trump threatened tariffs on the industry.</p><p>Speaking at a Tuesday event hosted by the National Republican Congressional Committee, Trump said his administration will \"be announcing very shortly a major tariff on pharmaceuticals\" in an attempt to force companies to shift manufacturing to the U.S.<span class=\"ql-inline-citation\"></span></p><p>\"We're going to tariff our pharmaceuticals, and once we do that they're going to come rushing back into our country because we're the big market,\" Trump said Tuesday. \"The advantage we have over everybody is that we're the big market. So we're going to be announcing very shortly a major tariff on pharmaceuticals, and when they hear that, they will leave China, they will leave other places because they have to sell, most of their product is sold here.\"</p><p>Shares of AstraZeneca (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AZN\">AZN</a>), Pfizer (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;PFE\">PFE</a>), Eli Lilly (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;LLY\">LLY</a>), Novo Nordisk (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVO\">NVO</a>), Johnson &amp; Johnson (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;JNJ\">JNJ</a>), GSK (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;GSK\">GSK</a>), and Sanofi (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;SNY\">SNY</a>) all declined Wednesday morning.</p><p></p><p>Pharmaceuticals were one sector exempted from the wide-ranging <a href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">tariffs announced last week</a>, along with semiconductors.<br /></p><p>Trump has cited a desire to motivate companies to shift manufacturing back to the United States. <a href=\"https://www.investopedia.com/liberation-day-tariffs-go-into-effect-11711517\">Experts have said</a> the rise in prices and <a href=\"https://www.investopedia.com/economists-see-greater-chance-of-recession-with-trump-tariffs-11710261\">potential recession</a> could cause many jobs to be lost before those potential manufacturing job gains are realized, however.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/ghpo64A0f_xfruexRrBUxPPTkk4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209261511-9b7347da039a42a88128a9ff2197c224.jpg",
    "summary": "On April 8, 2025, President Donald Trump announced the forthcoming implementation of a major tariff on the pharmaceutical industry, aimed at encouraging companies to relocate manufacturing back to the United States. This announcement led to a decline in the shares of several leading pharmaceutical companies, including AstraZeneca, Pfizer, Eli Lilly, Novo Nordisk, Johnson & Johnson, GSK, and Sanofi. The pharmaceutical sector had been exempt from previous tariffs introduced by the Trump administration. The president's strategy is to leverage the U.S. market's size to compel pharmaceutical compan",
    "titles": [
      "Pharma Stocks Sink as Trump Says 'Major' Tariffs Coming to Industry"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.979,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46675,
    "normalized_score": 9.19
  },
  {
    "title": "Big Bank Stocks Fall as Jamie Dimon Says Recession Is 'Likely Outcome' of Tariffs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 09 Apr 2025 15:31:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Noam Galai / Getty Images JPMorgan Chase CEO Jamie Dimon speaks with Maria Bartiromo on \" src=\"https://www.investopedia.com/thmb/dhxuhx_YsVRvDxcrvTz7vzrgXJo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-22093679121-4c85890e29624e979eae1f58c652ae32.jpg\" /><figcaption><i><p>Noam Galai / Getty Images</p> JPMorgan Chase CEO Jamie Dimon speaks with Maria Bartiromo on \"Mornings With Maria\" on April 9, 2025</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Big bank stocks fell Wednesday as JPMorgan Chase CEO Jamie Dimon said a recession would be a \"likely outcome\" as the Trump administration’s sweeping tariffs rattle markets.</li><li>In a televised Fox Business appearance, Dimon said markets are pricing in uncertainty amid the Trump administration's ongoing trade war.</li><li>Several major U.S. banks are scheduled to report quarterly earnings on Friday.</li></ul><br /><br /><p>Big bank stocks fell Wednesday as JPMorgan Chase (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;JPM\">JPM</a>) CEO <a href=\"https://www.investopedia.com/jamie-dimon-6361587\">Jamie Dimon</a> said the economy could be headed toward a recession as the Trump administration’s tariffs rattle markets. </p><p>“I think probably it’s a likely outcome,” Dimon said in a televised appearance Wednesday on Fox Business' \"Mornings with Maria.\"<span class=\"ql-inline-citation\"></span></p><p>“Markets aren’t always right, but sometimes they are right, and I think this time they are right because they’re just pricing uncertainty.” The <a href=\"https://www.investopedia.com/terms/d/djia.asp\">Dow Jones Industrial Average</a> is down about 10% since President Donald Trump announced sweeping tariffs last week. </p><p>Shares of Bank of America (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BAC\">BAC</a>) dropped over 4%, while Wells Fargo (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;WFC\">WFC</a>) and Citigroup (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;C\">C</a>) shares each fell about 3% in intraday trading Wednesday. Shares of JPMorgan and other banks were also lower. (Read <em>Investopedia's</em> live coverage of <a href=\"https://www.investopedia.com/dow-jones-today-04092025-11711763\">today's market action here</a>.)</p><p>Several major U.S. banks including JPMorgan are set to <a href=\"https://www.investopedia.com/here-are-three-things-to-watch-for-in-big-bank-earnings-trump-dimon-11711177\">report quarterly earnings</a> on Friday, with investors likely to be watching whether worries about tariffs are hampering clients’ borrowing appetites and ability to repay loans.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/dhxuhx_YsVRvDxcrvTz7vzrgXJo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-22093679121-4c85890e29624e979eae1f58c652ae32.jpg",
    "summary": "On April 9, 2025, JPMorgan Chase CEO Jamie Dimon warned of a likely recession due to the impact of the Trump administration's tariffs, causing big bank stocks to fall. In his appearance on Fox Business' \"Mornings with Maria,\" Dimon highlighted market uncertainty fueled by the ongoing trade war. The Dow Jones Industrial Average dropped about 10% following the tariff announcement. Shares of major banks, including Bank of America, Wells Fargo, and Citigroup, saw declines of over 3%. This comes as several major U.S. banks are preparing to report their quarterly earnings on Friday, with the financi",
    "titles": [
      "Big Bank Stocks Fall as Jamie Dimon Says Recession Is 'Likely Outcome' of Tariffs"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46425000000000005,
    "normalized_score": 9.08
  },
  {
    "title": "Groundbreaking study reveals changes in brain cell composition and gene activity in Tourette syndrome",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 12:13:27 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the first comprehensive, cell-by-cell analysis of brain tissue from individuals with Tourette syndrome, researchers have pinpointed exactly which cells are perturbed and how they malfunction, revealing how different types of brain cells are affected by the condition. Findings from this groundbreaking study provide unprecedented insights into the interplay of different brain cell types in Tourette syndrome, suggesting new therapeutic directions."
    ],
    "image_url": "",
    "summary": "Researchers have conducted the first detailed, cell-by-cell analysis of brain tissue from individuals with Tourette syndrome, identifying specific cells that are disrupted and their malfunctions. This groundbreaking study offers new insights into how various brain cell types interact in the condition, paving the way for potential new treatments.",
    "titles": [
      "Groundbreaking study reveals changes in brain cell composition and gene activity in Tourette syndrome"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.614,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39949999999999997,
    "normalized_score": 6.25
  },
  {
    "title": "Space could emerge from time",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 22:00:03 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An investigation of the changing behaviour of a single quantum bit through time has uncovered a tantalising similarity to the geometry of three-dimensional space"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/08172006/SEI_246653054.jpg",
    "summary": "An investigation into a single quantum bit's behavior over time revealed a notable similarity to the geometry of three-dimensional space. This discovery could enhance our understanding of quantum mechanics and its relationship to the universe's structure.",
    "titles": [
      "Space could emerge from time"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.736,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.394,
    "normalized_score": 6.01
  },
  {
    "title": "Life recovered rapidly at site of dino-killing asteroid: A hydrothermal system may have helped",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 19:16:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "About 66 million years ago, an asteroid slammed into the planet, wiping out all non-avian dinosaurs and about 70% of all marine species. But the crater it left behind in the Gulf of Mexico was a literal hotbed for life enriching the overlying ocean for at least 700,000 years, according to new research."
    ],
    "image_url": "",
    "summary": "Approximately 66 million years ago, an asteroid impact resulted in the extinction of all non-avian dinosaurs and around 70% of marine species. However, new research indicates that the crater formed in the Gulf of Mexico fostered a rich environment for life, enriching the ocean above it for over 700,000 years.",
    "titles": [
      "Life recovered rapidly at site of dino-killing asteroid: A hydrothermal system may have helped"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.712,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.388,
    "normalized_score": 5.74
  },
  {
    "title": "Simultaneously burying broadband and electricity could be worth millions to people in MA towns",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 19:16:43 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "When it comes to upgrading electrical and broadband infrastructure, new research shows that a 'dig once' approach is nearly 40% more cost effective than replacing them separately. The study also found that the greatest benefit comes from proactively undergrounding lines that are currently above ground, even if lines haven't reached the end of their usefulness."
    ],
    "image_url": "",
    "summary": "New research indicates that upgrading electrical and broadband infrastructure simultaneously, known as the 'dig once' method, is almost 40% more cost-effective than updating them separately. The study highlights that the most significant savings come from moving existing above-ground lines underground proactively, before they are due for replacement. This approach not only reduces costs but also potentially enhances the longevity and reliability of the infrastructure.",
    "titles": [
      "Simultaneously burying broadband and electricity could be worth millions to people in MA towns"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.712,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.388,
    "normalized_score": 5.74
  },
  {
    "title": "New research finds fluorescence in feathers of long-eared owls",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 19:14:57 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers report their discovery of fluorescent pigments in the feathers of Long-eared Owls, that can only be seen by humans with the help of ultraviolet light."
    ],
    "image_url": "",
    "summary": "Researchers have discovered fluorescent pigments in the feathers of Long-eared Owls, which are visible to humans only when illuminated with ultraviolet light. This finding adds to the understanding of owl biology and suggests the presence of visual signals in these birds that are not perceivable by humans without technological assistance.",
    "titles": [
      "New research finds fluorescence in feathers of long-eared owls"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.711,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.38775000000000004,
    "normalized_score": 5.73
  }
]