[
  {
    "title": "ICC Issues Arrest Warrants for Taliban Leaders Over Women's Rights Violations",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 14:16:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Global News",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Judges say Taliban officials have &#039;severely deprived&#039; girls and women of rights, including education.",
      "The International Criminal Court has issued arrest warrants for two top Taliban leaders",
      "The warrants were issued against Taliban supreme leader Hibatullah Akhunzada and the head of the Supreme Court, Abdul Hakim Haqqani.",
      "On July 8, 2025, Pre-Trial Chamber II of the International Criminal Court (ICC) has issued warrants of arrest for Mr Haibatullah Akhundzada, Supreme Leader...."
    ],
    "image_url": "",
    "titles": [
      "ICC seeks arrests of Taliban leaders over alleged persecution of women",
      "ICC issues arrest warrants for Taliban leaders over persecution of women and girls",
      "Taliban leaders face ICC warrants over persecution of women and girls",
      "ICC Issues Arrest Warrants Against Taliban Leaders Over Gender Persecution"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.961,
      "consensus": 0.985,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.858,
    "summary": "On July 8, 2025, the International Criminal Court (ICC) issued arrest warrants for Taliban supreme leader Hibatullah Akhunzada and head of the Supreme Court, Abdul Hakim Haqqani. The ICC judges stated that these officials have significantly violated the rights of girls and women in Afghanistan, particularly in depriving them of education. This action by the ICC marks a significant international legal step against the Taliban's treatment of women and girls.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in international efforts to hold the Taliban accountable for women's rights violations. It provides empowering knowledge about the role of the International Criminal Court and increases awareness about the ongoing human rights issues in Afghanistan. The story could be more constructive if it provided more context or potential solutions to the problem."
  },
  {
    "title": "Portuguese Footballer Diogo Jota, Brother Killed in Spain Crash",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 14:21:31 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "The Guardian",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "The Liverpool player was killed with his brother when their Lamborghini car had a suspected tyre blowout.",
      "All the evidence so far suggests Portuguese footballer Diogo Jota was driving when his car crashed on a Spanish motorway, and he probably speeding, say police.",
      "The Liverpool player is believed to have been driving at high speed when he and his brother Andre Silva died last week.",
      "<ul><li><p>Police say it appears Liverpool player was driving</p></li><li><p>Jota and his brother died when Lamborghini crashed</p></li></ul><p>Spanish police believe Diogo Jota was driving over the speed limit when <a href=\"https://www.theguardian.com/football/2025/jul/03/diogo-jota-liverpool-portu",
      "<p>Spanish police believe Liverpool player Diogo Jota was driving over the speed limit when he and his brother died in a car crash last week.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ee87/live/01a2d690-5c0b-11f0-9d64-1b7197dd7c07.jpg",
    "titles": [
      "Diogo Jota's car was likely speeding before fatal crash, Spanish police say",
      "Jota's car probably speeding before fatal crash, say Spanish police",
      "Diogo Jota: Speeding likely cause of footballer’s car crash, police say",
      "Spanish police believe Diogo Jota was speeding when he and his brother died",
      "Jota was driving above speed limit before crash, Spanish police believe"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.962,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary": "Portuguese footballer Diogo Jota and his brother Andre Silva died in a car crash on a Spanish motorway, reportedly caused by a tyre blowout on their Lamborghini. Investigations suggest Jota was driving at high speed, potentially over the speed limit, at the time of the accident. Spanish police are handling the case, focusing on the speed factor as a significant cause of the crash.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a tragic event and contextualizes it by mentioning the possible cause of the accident, which is useful for readers to understand the potential dangers of speeding. However, it doesn't provide solutions or improvements, nor does it significantly increase awareness about broader issues related to road safety."
  },
  {
    "title": "Rishi Sunak Rejoins Goldman Sachs as Adviser After Political Career",
    "domain": "business",
    "location": "national",
    "published": "Tue, 08 Jul 2025 15:19:08 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Former U.K. Prime Minister Rishi Sunak is set to rejoin Goldman Sachs as a senior adviser, the bank said Tuesday.",
      "Former UK prime minister returns to bank he worked at before entering politics",
      "<p>Conservative former PM to be restricted from lobbying government for another year and will give salary to charity</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/jul/08/norman-tebbit-emmanuel-macron-horizon-post-office-scandal-uk-politics-live\">UK politics live – latest upda",
      "The man who led the U.K.’s Conservative Party to its worst-ever electoral defeat in 2024 is returning to Goldman Sachs after a 20-year hiatus."
    ],
    "image_url": "",
    "titles": [
      "Former UK Prime Minister Rishi Sunak returns to Goldman Sachs",
      "Rishi Sunak joins Goldman Sachs as senior adviser",
      "Rishi Sunak takes advisory role with Goldman Sachs while serving as MP",
      "Return of the Rishi: Sunak back at Goldman Sachs"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.982,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.833,
    "summary": "Former U.K. Prime Minister Rishi Sunak is returning to Goldman Sachs as a senior adviser after a 20-year break from the bank where he worked before his political career. This move comes after leading the Conservative Party to a significant electoral defeat in 2024. Sunak has agreed not to lobby the government for a year and plans to donate his salary to charity.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Rishi Sunak's career move, which could have implications for Goldman Sachs and the UK's political landscape. However, it does not delve into the potential impacts, solutions, or improvements related to this change, limiting its constructiveness."
  },
  {
    "title": "Taylor Fritz Reaches First Wimbledon Semifinal Since 2018",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:20:10 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "Sportsnet",
      "BBC",
      "ESPN"
    ],
    "domains": [
      "sports",
      "general",
      "business"
    ],
    "snippets": [
      "American number one Taylor Fritz overcomes an unexpected third-set capitulation to beat Karen Khachanov and reach the semi-finals of Wimbledon for the first time.",
      "Taylor Fritz defeated No. 17 seed Karen Khachanov 6-3, 6-4, 1-6, 7-6 (4) to advance to his first Wimbledon semifinal Tuesday, becoming the first American man to reach that stage of the grass-court Slam since John Isner in 2018.",
      "American Taylor Fritz Marches Into First Wimbledon Semifinal Appearance",
      "<p>Taylor Fritz recovered from a mid-match lull during which he was treated by a trainer for a foot problem and reached the Wimbledon semifinals for the first time with a 6-3, 6-4, 1-6, 7-6 (4) victory over Karen Khachanov on Tuesday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3316/live/95852d10-5bfa-11f0-9142-41d59aceb1f6.jpg",
    "titles": [
      "Fritz recovers to reach first Wimbledon semi-final",
      "Fritz's grass-court roll reaches Wimbledon semis",
      "Top-Ranked American Taylor Fritz Marches Into First Wimbledon Semifinal",
      "Taylor Fritz beats Karen Khachanov to reach his first Wimbledon semifinal"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.982,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.823,
    "summary": "Taylor Fritz defeated Karen Khachanov 6-3, 6-4, 1-6, 7-6 (4) to reach his first Wimbledon semifinal, becoming the first American man to do so since John Isner in 2018. Despite a third-set drop and a foot issue requiring medical attention, Fritz overcame these challenges to secure his victory on Tuesday.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Taylor Fritz's achievement in reaching the Wimbledon semifinals, but it doesn't offer deeper insights or actionable knowledge for the reader. It doesn't report on solutions, improvements, or innovations, and it doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Netanyahu Pledges to Nominate Trump for Nobel Amid Gaza Talks",
    "domain": "general",
    "location": "global",
    "published": "2025-07-08T14:56:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Forbes",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu told Donald Trump that he was putting the US president's name forward. The pair hailed their recent strikes on Iran's key nuclear facilities. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOWEw1YVhKdUVBRXlaSkxYaXd1VWhPS3RVMUIybjV4RHg4TWlUVUllT3lkdE03M1BLSmZnUm8tajMzRlhvTmlvM19PT21YMGJ6RjFZYnBHaHR4Qkl2aUJpeTFIcGUyS1dUdDZoVTFvWnR6Rk9pR2d3TlRsYng1Rnd6UXhGSWd5aFcxa1F1Qg?oc=5\" target=\"_blank\">Israeli PM Netanyahu nominates Trump ",
      "Israeli Prime Minister Benjamin Netanyahu nominated Trump on Monday for the coveted award."
    ],
    "image_url": "",
    "titles": [
      "Middle East: Netanyahu nominates Trump for Nobel Peace Prize",
      "Israeli PM Netanyahu nominates Trump for Nobel Peace Prize - Axios",
      "Could Trump Get A Nobel Peace Prize? Here's What We Know As Now Netanyahu Nominates Him"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.974,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary": "Israeli Prime Minister Benjamin Netanyahu has promised to nominate Donald Trump for the Nobel Peace Prize, highlighting their first meeting since undisclosed events. This commitment was made amidst discussions on Gaza ceasefire prospects, which Trump views positively, though without divulging further details. Concurrently, right-wing influencers are criticizing the Trump administration for allegedly concealing evidence related to the Justice Department's investigation into Epstein.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about current political dynamics and ongoing negotiations related to the Gaza ceasefire. However, it doesn't offer in-depth insights into the implications of these events or potential solutions to the conflict."
  },
  {
    "title": "Jim Cramer Suggests Trump's New Tariffs on Asian Imports May Not Last",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 12:45:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "LA Times",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Trump sent tariff letters to 14 countries including South Korea, Japan, Malaysia and Bangladesh.",
      "Plus, the beautiful chaos of Rio’s beaches.",
      "President Trump has told 14 countries that they will face tariffs of at least 25 percent on Aug. 1 if they don’t reach agreements by then.",
      "<p>Japan, South Korea, Malaysia and Kazakhstan will face 25% import duties starting Aug. 1, while goods from Laos and Myanmar will face a 40% tariff.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump’s new tariffs: Who is hit, what’s next, how is the world responding?",
      "Tuesday Briefing: Trump’s New Tariff Threats",
      "Here Are Trump’s New Tariff Threats",
      "Markets recoil on Trump's latest tariff moves in Asia"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.931,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.767,
    "summary": "Jim Cramer, a CNBC commentator, suggested that the new tariffs announced by President Trump may not be permanent. Starting August 1, imports from Japan, South Korea, Malaysia, and Kazakhstan will be subject to a 25% tariff, whereas goods from Laos and Myanmar will face a 40% tariff.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the new tariffs and their potential impacts on international trade. However, it lacks depth in terms of how these tariffs will affect the economy and consumers. It also does not report on any solutions or improvements to the situation."
  },
  {
    "title": "Kirk Cousins Feels \"Misled\" by Falcons After Penix Draft Pick",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:03:56 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "QB Kirk Cousins said in an episode of the Netflix series \"Quarterback,\" which premiered Tuesday, that he felt \"a little bit misled\" when the Falcons drafted Michael Penix Jr. in the first round of the 2024 draft.",
      "Cousins addressed the situation publicly for the first time in an episode of 'Quarterback'",
      "The Atlanta Falcons selected Michael Penix Jr. with the eighth overall pick just weeks after signing Kirk Cousins to a"
    ],
    "image_url": "",
    "titles": [
      "Cousins felt 'misled' after Falcons drafted Penix",
      "Falcons QB Kirk Cousins opens up about Atlanta's decision to draft Michael Penix Jr. in 2024",
      "Kirk Cousins reveals how he really felt about Atlanta Falcons drafting Michael Penix Jr"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.977,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary": "Kirk Cousins expressed feeling \"a little bit misled\" by the Atlanta Falcons after they drafted Michael Penix Jr. eighth overall in the 2024 draft. This came shortly after Cousins signed with the team. His sentiments were shared publicly for the first time in an episode of the Netflix series \"Quarterback,\" which premiered Tuesday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a conflict between a player and a team, but it doesn't provide any deeper insights or actionable information. It doesn't report on solutions or attempts to solve the problem, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Sabalenka Defeats Siegemund, Advances to Wimbledon Semis",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:56:32 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "World number one Aryna Sabalenka fights back to beat Laura Siegemund and claw her way into the Wimbledon semi-finals.",
      "Aryna Sabalenka completed a hard-fought comeback against Laura Siegmund to avoid elimination and move on to the semifinals at Wimbledon. The pair met at center court on Tuesday morning as Siegmund looked for another upset win after eliminating Madison Keys in the third round.",
      "<ul><li><p>Updates from men’s and women’s last-eight ties in SW19</p></li><li><p><a href=\"mailto:katy.murrells.casual@theguardian.com\">Email Katy</a> | <a href=\"https://www.theguardian.com/sport/2025/jul/07/tension-and-tedium-welcome-to-the-wimbledon-press-conference-room\">Tension and tedium in pres"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/75ee/live/45d9ccf0-5c0c-11f0-960d-e9f1088a89fe.jpg",
    "titles": [
      "Sabalenka claws past Siegemund to reach semi-finals",
      "Aryna Sabalenka completes comeback against Laura Siegmund to advance to semis at Wimbledon",
      "Wimbledon 2025 quarter-finals: Sabalenka battles past Siegemund, Fritz through, Norrie v Alcaraz – live"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.995,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary": "World number one Aryna Sabalenka successfully overcame Laura Siegemund in a challenging match to advance to the Wimbledon semi-finals. The victory came after Siegemund had previously ousted Madison Keys in the third round. Sabalenka's win marks her progression in the prestigious tournament, securing her spot in the last four.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of an event in the sports world, but it doesn't provide deeper insights or understanding. It also doesn't report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Men Convicted in Arson Attack on UK Ukraine Aid Warehouse, Linked to Wagner Grou",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:30:58 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Around £1m worth of damage was caused in the arson attack on an industrial unit in Leyton, east London, last year.",
      "Attack targeted warehouse units of a company shipping humanitarian aid to Ukraine",
      "<p>Arsonists acting for Russian group found guilty after 2024 fire targeting building used to supply humanitarian aid</p><p>A group of men have been convicted for their roles in an arson attack ordered by the Wagner Group on an east London warehouse linked to Ukraine, in the first case to result in "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f7ff/live/b30ff7e0-5c07-11f0-960d-e9f1088a89fe.png",
    "titles": [
      "Three men guilty of arson attack on London warehouse on behalf of Russian mercenary group",
      "Three men found guilty of Wagner-linked arson attack on London warehouse",
      "Men acting for Wagner Group convicted of arson on Ukraine-linked London warehouse"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.986,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary": "In an arson attack on an industrial unit in Leyton, east London, last year, approximately £1m worth of damage was inflicted. The warehouse, which was targeted, was involved in shipping humanitarian aid to Ukraine. A group of men have been found guilty of conducting the arson, acting under orders from the Russian Wagner Group. This marks the first conviction related to an attack orchestrated by the Wagner Group on a facility linked to Ukraine aid in the UK.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  },
  {
    "title": "Asteria and Moonvalley Launch AI Model Marey for Filmmakers",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Jul 2025 09:58:07 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "TechCrunch"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Marey, a new AI video model from Asteria and Moonvalley, offers Hollywood filmmakers clean, licensed, production-ready tools with full creative control.",
      "Moonvalley's Marey AI video generation model is open to the public. The monthly subscription is available for $14.99, $34.99, or $149.99."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/686c534bb68465549f723b7a/0x0.jpg?width=960",
    "titles": [
      "Asteria And Moonvalley Release Marey, A Clean, Production-Grade AI Video Model",
      "Moonvalley’s ‘ethical’ AI video model for filmmakers is now publicly available"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.955,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary": "Asteria and Moonvalley have launched Marey, an AI video model designed for Hollywood filmmakers, providing them with clean, licensed, and production-ready tools along with full creative control. Marey is now publicly accessible through a subscription model, with pricing tiers at $14.99, $34.99, and $149.99 per month.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it informs readers about a new AI tool that could revolutionize the filmmaking industry. It provides actionable insights for filmmakers and highlights an innovative solution. However, it could have been more constructive if it had discussed the potential impacts and trends in more depth."
  },
  {
    "title": "2025 NBA Free Agency Begins: No Major Stars Move Yet, Drama Ensues",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 09:39:57 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Which deals will impact the title race? Which will leave teams in regret by Christmas? Insiders make their picks.",
      "Our updated list features details on every player signed beginning on June 30.",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTFBkQ0lpdFF0clFjVExrZXZBNzdWUWdGUE1sWlJaRmVPTTRCWE15TElNYm0zVXpZSk8wX2FZWTYyUm5Hem5JaDRac3Buc2duQnp3cE5kSVVfYkVLNnVtcFh0WFNCZ0JwMGxjbGc?oc=5\" target=\"_blank\">2025 NHL Free Agency Winners and Losers</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sports "
    ],
    "image_url": "",
    "titles": [
      "Free agency superlatives: Best, worst, underrated moves",
      "NHL free agency tracker: Updated list of the summer signings",
      "2025 NHL Free Agency Winners and Losers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.949,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.713,
    "summary": "The 2025 NBA free agency period began on Monday evening, marking the start of offseason movements and signings detailed since June 30. Tim Bontemps and Brian Windhorst provided a comprehensive update, highlighting the outcomes of the initial week which, despite lacking major star relocations, still introduced significant drama to the league. The coverage includes a list of every player signed and an analysis of the winners and losers during this negotiating window, reflecting on how the league maintains interest even in a quieter free agency period.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the NBA free agency period, including an analysis of the winners and losers. However, it doesn't highlight any solutions, improvements, or innovations in the league, nor does it empower readers with actionable insights."
  },
  {
    "title": "Toronto Raptors Sign Jakob Poeltl to $104M Four-Year Extension",
    "domain": "general",
    "location": "national",
    "published": "Tue, 08 Jul 2025 15:46:42 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "The Toronto Raptors have signed centre Jakob Poeltl to a multiyear contract extension, the NBA club announced Tuesday.",
      "<p>The Raptors made their multi-year contract extension with Jakob Poeltl official on Tuesday. Terms of the deal were not disclosed, but the contract was reported to come in at four years for $104 million.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/72a00f9749063168b37b4fbcf6d965893933fe10108df4eb18939ea9cef935b9.jpg?quality=85&strip=all",
    "titles": [
      "Raptors sign centre Poeltl to multiyear extension",
      "Raptors make Jakob Poeltl’s multi-year contract extension official"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.991,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.709,
    "summary": "The Toronto Raptors have officially signed centre Jakob Poeltl to a four-year contract extension worth $104 million, as announced by the NBA club on Tuesday. The specifics of the multiyear deal were confirmed following the team's announcement, with the terms of the agreement now public.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a transaction in the sports industry. There's no deeper insight or understanding provided, nor does it report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "DeWanna Bonner Set to Rejoin Phoenix Mercury After Fever Waiver",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Jul 2025 00:54:42 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Bonner was expected to be a key addition for Caitlin Clark and the Fever",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPX0p2QXd5SWZkZDRsbnNzUmRXLVlHX2lkUk1sTmNKT0RCTjNRZUtQX3pEWFBBZk9TRm1ycE9aRVJuaWNlbnIyR2QybmxUd2hYeURfazdTWWhUWHg4U2h3U2w3eEZXNnJNMmU0SE5zUU1zNzJyaHVVZHFnSzRUWHJQM2tYOA?oc=5\" target=\"_blank\">DeWanna Bonner Expected to Land With Former Team ",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQZTZkWFB4SkZoM1pUcVdxNW45LTJPMFBDZUhPYXNXV0NBUEJFM1dwVllRWjVSUEJQTENFbzExTWxOXzl0TDQ3dnlvOUtUY2s2S1AxWE1hQ1ZWc0V2U3UxSml5M21wQTZtWkYxdXQ2Rkdqc0g4bm1MTEZiZWJsYVZCWmI0MkdtR2c?oc=5\" target=\"_blank\">‘Best Decision for Me’—Luis Diaz Delivers Up",
      "<p>The six-time WNBA All-Star is close to signing with the Phoenix Mercury, the team that drafted her in 2009, ESPN&#8217;s Michael Voepel reported Monday. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/08/1203d969-c91b-42e2-8c8d-a374ab039b4a/gettyimages-2212663036-1.jpg",
    "titles": [
      "DeWanna Bonner expected to sign with Mercury after messy departure from Fever, per report",
      "DeWanna Bonner Expected to Land With Former Team After Fever Exit - Sports Illustrated",
      "‘Best Decision for Me’—Luis Diaz Delivers Update on Liverpool Future - Sports Illustrated",
      "Report: DeWanna Bonner expected to sign with Mercury"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.727,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary": "DeWanna Bonner, a six-time WNBA All-Star, is anticipated to rejoin the Phoenix Mercury after being waived by the Fever. Bonner, who previously won two titles with the Mercury, was initially seen as a significant addition for the Fever alongside Caitlin Clark. Her return to the Mercury, the team that drafted her in 2009, marks a notable move in her professional career.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a significant move in DeWanna Bonner's professional career. However, it doesn't provide deeper insights into the implications of this move for the teams involved or the broader trends in the sport."
  },
  {
    "title": "Mbappé Drops Legal Case Against PSG for Moral Harassment",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:24:45 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Kylian Mbappé has dropped the legal proceedings he started this year against Paris Saint-Germain for moral harassment, according to AP sources.",
      "<p>Kylian Mbappé has dropped the legal proceedings he started this year against Paris Saint-Germain for moral harassment, a person with knowledge of the situation told the Associated Press.</p>"
    ],
    "image_url": "",
    "titles": [
      "Kylian Mbappé drops PSG harassment claim",
      "Mbappe drops legal harassment case against PSG, seeks reconciliation"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.707,
    "summary": "Kylian Mbappé has discontinued the legal case he initiated against Paris Saint-Germain (PSG) for moral harassment earlier this year. This decision was confirmed by a source familiar with the matter to the Associated Press. The proceedings have been officially dropped, ending the legal dispute between Mbappé and the football club.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the resolution of a legal dispute between a player and a team. It provides useful information about the current state of the relationship between Mbappé and PSG. However, it doesn't report on solutions or improvements beyond the dropping of the case, and it doesn't provide a deeper understanding of the causes or impacts of the dispute."
  },
  {
    "title": "U.S. Solar Stocks Fall After Trump Ends Renewable Tax Credits",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:08:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "Financial Post",
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The maker of solar-power components saw its stock downgraded after Trump’s executive order enforcing a phaseout of tax credits.",
      "Shares of US solar companies fell after President Donald Trump called for new rules that would limit access to tax incentives for renewable energy projects that had already been pared back by a $3.4 trillion budget bill."
    ],
    "image_url": "https://images.mktw.net/im-770663",
    "titles": [
      "Here’s why Enphase and other solar stocks are tanking after Trump’s latest move",
      "Solar Stocks Fall After Trump Orders Limit to Green Tax Credits"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary": "Shares of U.S. solar companies dropped following President Trump's executive order to phase out tax credits for renewable energy, intensifying the impact of a recent $3.4 trillion budget bill that had already reduced incentives. This move led to a downgrade in the stock of a major solar-power components maker.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant policy change and its immediate impact on the solar industry. It increases awareness about the relationship between government policy and industry performance. However, it does not provide enough insight into potential solutions or long-term impacts to score higher on constructiveness."
  },
  {
    "title": "Trump Imposes New Tariffs on 14 Countries, Including Allies Japan and S. Korea",
    "domain": "business",
    "location": "national",
    "published": "Tue, 08 Jul 2025 11:46:51 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "President Donald Trump, in social media posts, shared screenshots of signed form letters dictating new tariff rates to the leaders of 14 countries.",
      "President Trump said Japan and South Korea would face tariffs of 25 percent unless they reached an agreement with the United States. Other countries received notice of higher levies."
    ],
    "image_url": "",
    "titles": [
      "Trump announces steep tariffs on 14 countries starting Aug. 1",
      "Trump Revives Trade War, Threatening Steep Aug. 1 Tariffs on Allies"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.912,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary": "US President Donald Trump announced the imposition of new tariffs on goods from 14 countries, including close allies like Japan and South Korea, starting August 1. The tariffs vary, with Japan facing a 25% rate, South Africa 30%, and others up to 40%. The decision, conveyed through form letters and social media, aims to escalate his trade wars, although he paused the increase on goods from key economies until next month. Japanese Prime Minister Ishiba expressed a desire to negotiate a mutually beneficial deal in response.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story gives readers a useful context about the ongoing trade wars and the US's strategy. It also provides some insight into the reactions of affected countries. However, it lacks depth in explaining the potential impacts of these tariffs or possible solutions to the trade conflicts."
  },
  {
    "title": "The best laptop deals we’ve found for Prime Day (so far)",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-08T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon has solid discounts on laptops during its four-day Prime Day sales event. One of the nice things about shopping during Prime Day, even if you don’t have the requisite Prime subscription, is that Best Buy and others often follow suit with their own competing deals. We found deals on models The",
      "Prime Day, Amazon’s four-day thunderdome of exclusive deals, is here. Outside of Black Friday and Cyber Monday, we anticipate this to be the best moment of the year to score discounts on headphones, laptops, TVs, gaming gear, and really anything else that might be on your wishlist — or someone else’",
      "Summer heat got you down? Perhaps some retail therapy is in order!"
    ],
    "image_url": "",
    "titles": [
      "The best laptop deals we’ve found for Prime Day (so far)",
      "The 181 best Prime Day 2025 deals that we found",
      "It’s Prime Day, and these are the best deals we could hunt down"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.697,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers looking to purchase a laptop. It may help them make an informed decision about when and where to buy to get the best deal."
  },
  {
    "title": "Newcastle United Signs Anthony Elanga from Nottingham for £55M",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:24:45 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Newcaslte have agreed a £55 million deal with Nottingham Forest for winger Anthony Elanga, a source has told ESPN.",
      "Anthony Elanga is flying into Newcastle on Tuesday afternoon to undergo his medical after a &#163;52m fee was agreed with Nottingham Forest."
    ],
    "image_url": "",
    "titles": [
      "Source: Newcastle agree $75M deal for Elanga",
      "Elanga flying in for Newcastle medical with striker next on list"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary": "Newcastle United has finalized a deal to acquire winger Anthony Elanga from Nottingham Forest for £55 million, as reported by ESPN. Elanga is set to undergo a medical examination on Tuesday afternoon following the agreement. This move marks a significant transfer for Newcastle, securing Elanga's services for the reported fee.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a significant transfer in the football world. However, it lacks depth or insight into the implications of this transfer for the teams involved or the player's career."
  },
  {
    "title": "UEFA Rejects Real Madrid Appeal, Upholds Sanctions on Rüdiger, Mbappé, Ceballos",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:24:45 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "UEFA has rejected Real Madrid's appeal to overturn the disciplinary sanctions handed to Antonio Rüdiger, Kylian Mbappé and Dani Ceballos for \"improper conduct.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxONjNtdWtGSUwxcmFKaHZ5cXNDMjlpZFJ1R3dPTWliczhzZ0dyd0xleFZiYzNfVHpxTDRaV1MwTklLSVlnek1IYlN4LWE4b19yNjc4aE9Mc21QZldsYjZjOTRsbWRzaFhCSDl1eE5EdktfRlpfaUlWV0xTT1BFd05iLU52bHY0Y3h0OXlXeVAxNEtPbVRs?oc=5\" target=\"_blank\">UEFA Rule on Real Madrid’s ",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPUWpLUXEyZ2FlaUhsbjlpUm11VWVEX0dyTlEydVRxZUJiRDRYTnhSdXE1RU1scWk1cHNua0t2N01HLTQyWkFjbmV3cUtVdFVJLTJaOEVPa1dLdlpuT2lac1Z6el9tVklrcUVmQU1WYXpzZkNEVHQtTkl3cmsxY21TZ24tOA?oc=5\" target=\"_blank\">Four Possible Destinations for Real Madrid Star R",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQMzZ0VHRVR0Y0NjNhMnB6WWxwQjRKbC1qRGtwV09fbHpnZWRxc2JiYmhmQ1M2SURZNjJaOU56c3pOczlielBiQUg2Ulo0MmIxb3VrTnV3d0tLQlBaZDJZcFJETXh4eGdJNE1oVkRteEdZbnJITjdiT2Y1aDFYdTlOMzh1VHJaYmdyX0ZTSVhsdDFERXNCTl9QLWdBNA?oc=5\" target=\"_blank\">NBA Legend Dwyane"
    ],
    "image_url": "",
    "titles": [
      "UEFA snub Madrid over Mbappé, Rüdiger appeal",
      "UEFA Rule on Real Madrid’s Kylian Mbappe, Antonio Rudiger Suspension Appeal - Sports Illustrated",
      "Four Possible Destinations for Real Madrid Star Rodrygo - Sports Illustrated",
      "NBA Legend Dwyane Wade Reacts To Heat-Clippers Trade - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary": "UEFA has upheld disciplinary sanctions against Real Madrid players Antonio Rüdiger, Kylian Mbappé, and Dani Ceballos for \"improper conduct,\" rejecting the club's appeal to overturn the penalties. This decision confirms the players will face the consequences previously determined by UEFA for their actions.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story informs the reader about the outcome of an appeal, but it does not provide any deeper understanding of the context or the reasons behind the initial sanctions or the appeal. It also doesn't offer any insight into the potential impacts of this decision."
  },
  {
    "title": "Speculating on Hypothetical Trades of Unavailable Star Players",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:45:28 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "You won't be seeing these stars available via trade this year -- but what would it take to land them if they were?",
      "Would the two teams be able to pull this off?"
    ],
    "image_url": "",
    "titles": [
      "Potential MLB trade proposals for Paul Skenes, Ronald Acuña Jr. and Byron Buxton",
      "Wild blockbuster trade proposal sends Pirates Paul Skenes to Tigers"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary": "This article discusses the hypothetical trade scenarios involving certain star players who are not expected to be available for trade this year. It speculates on what it might take for teams to acquire these players if they were on the trading block, questioning the feasibility of such trades between two teams.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is based on speculation and hypothetical scenarios, offering little actionable insights or deeper understanding for the reader. It doesn't report on actual progress, solutions, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts. The value of this story is mostly entertainment rather than constructive information."
  },
  {
    "title": "Mexican Company Grows Amid U.S. Tariffs on Chinese Goods",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Jul 2025 05:30:09 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "And that might become a problem",
      "A small company in northern Mexico had faced steep competition from China in making straps, plugs, fasteners, grommets, zip ties and clamps. Now, U.S. tariffs have driven a spike in his business."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F68e839ce-e803-4ccc-9b2f-faae9364b6e7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "The markets just don’t believe Trump on tariffs",
      "The Mexican Businessman Grateful for Trump’s Tariffs"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.8,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "A small company in northern Mexico, specializing in the production of items like straps, plugs, fasteners, grommets, zip ties, and clamps, experienced a significant increase in business due to U.S. tariffs. These tariffs, aimed at Chinese competitors, have reduced the competition, benefiting the Mexican company.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of the impacts of U.S. tariffs on global trade dynamics. It doesn't offer solutions or improvements but it does increase awareness about the effects of economic policies on businesses in different countries."
  },
  {
    "title": "Joe Burrow Rethinks Batmobile Buy After Home Burglary Revelation",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 8 Jul 2025 11:03:56 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Bengals QB Joe Burrow said on the latest season of the Netflix show \"Quarterback,\" released Tuesday, that last December's home burglary made him change his mind about purchasing a replica Batmobile.",
      "Burrow had to think twice about a high-profile splurge following a home burglary last December"
    ],
    "image_url": "",
    "titles": [
      "Burrow: Home burglary altered Batmobile plans",
      "Bengals QB Joe Burrow canceled Batmobile purchase after home burglary"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.977,
      "consensus": 0.632,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary": "Cincinnati Bengals quarterback Joe Burrow revealed on the Netflix show \"Quarterback\" that a home burglary in December influenced his decision against buying a replica Batmobile. Burrow expressed that the incident led him to reconsider making such a noticeable purchase. This revelation came to light in the latest season of the series, which was released on Tuesday.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is more sensational and gossip-oriented than constructive. It doesn't provide any actionable insights or deeper understanding, nor does it report on solutions, improvements, or attempts to solve problems. It also doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Atlanta Airport Reclaims World's Busiest Title; Milan Bergamo Halts Flights",
    "domain": "business",
    "location": "national",
    "published": "Tue, 08 Jul 2025 10:05:13 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Hartsfield-Jackson Atlanta International Airport is, once again, the busiest airport in the world. But even it hasn't fully returned to 2019 levels.",
      "Flights were suspended at Italy's third-busiest airport after a person was sucked into the engine of a Volotea plane at Milan Bergamo Airport."
    ],
    "image_url": "",
    "titles": [
      "Here are the 15 busiest airports in the world",
      "A person was sucked into a plane's engine at one of Italy's busiest airports after getting onto the tarmac"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.88,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Hartsfield-Jackson Atlanta International Airport has regained its status as the world's busiest airport, though its traffic has not yet reached 2019 levels. Meanwhile, operations were halted at Milan Bergamo Airport, Italy's third-busiest, following a tragic incident where an individual was sucked into the engine of a Volotea plane, leading to a suspension of flights.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the status of two airports but lacks depth or insight. It does not offer actionable insights for the reader, nor does it report on solutions or improvements. The tragic incident at Milan Bergamo is reported without any discussion of potential safety measures or changes."
  },
  {
    "title": "Fortnite maker Epic Games settles antitrust case against Samsung",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 07 Jul 2025 20:22:22 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Epic had alleged in the lawsuit that Samsung's \"Auto Blocker\" feature, which blocked downloads outside of the Google Play Store and Samsung Galaxy Store, was a coordinated effort to block competition in app distribution.",
      "Epic's Tim Sweeney says Samsung will make changes, but no one has specifics."
    ],
    "image_url": "",
    "titles": [
      "Fortnite maker Epic Games settles antitrust case against Samsung",
      "Samsung and Epic Games call a truce in app store lawsuit"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.662,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.627,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the resolution of a significant legal case in the tech industry, which could influence reader's understanding of antitrust issues. However, it doesn't seem to offer insights into solutions, improvements, or empowering knowledge."
  },
  {
    "title": "Trump Tariffs Fail to Spark Feared Inflation Surge",
    "domain": "business",
    "location": "national",
    "published": "Tue, 08 Jul 2025 15:00:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Fears earlier this year that President Donald Trump's tariffs would result in a sharp inflation spike have completely receded."
    ],
    "image_url": "",
    "titles": [
      "Inflation expectations drift back down to pre-tariff levels, New York Fed survey shows"
    ],
    "score_components": {
      "magnitude": 0.119,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Earlier this year, there were concerns that tariffs introduced by President Donald Trump would cause a significant increase in inflation. However, these fears have now fully subsided, indicating that the anticipated sharp rise in inflation did not materialize.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the impact of tariffs on inflation, providing useful context and debunking previous fears. It doesn't highlight progress or solutions but it does contribute to the reader's understanding of economic trends and policies."
  },
  {
    "title": "AI and Extra Credit Boost Physics Grades, Reduce Inequities: Study",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 12:00:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A team of researchers from the University of California, Los Angeles and the University of California, San Diego have discovered positive uses for AI and extra credit assignments to help improve student performance in introductory physics courses, including reducing the impacts of inequities, as fea"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/unique-strategies-use.jpg",
    "titles": [
      "Unique strategies use AI and extra credit to improve student performance on physics exams"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "Researchers from the University of California, Los Angeles, and the University of California, San Diego have found that incorporating AI and extra credit assignments in introductory physics courses can enhance student performance and mitigate educational inequities. This discovery opens up new avenues for applying technology in education to support diverse learning needs and improve overall academic outcomes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution (AI and extra credit) that has been found to improve student performance and reduce educational inequities. It provides actionable insights and increases awareness about the potential of technology in education."
  },
  {
    "title": "UNL and UN Report Highlights Global Drought Impacts Since 2023",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 10:41:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The University of Nebraska–Lincoln's National Drought Mitigation Center and the United Nations' Convention to Combat Desertification have released a report outlining the impacts of drought around the world since 2023."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-report-details-glo.jpg",
    "titles": [
      "New report details global drought impacts"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary": "The University of Nebraska–Lincoln's National Drought Mitigation Center, in collaboration with the United Nations' Convention to Combat Desertification, published a report detailing global drought impacts since 2023. This comprehensive analysis highlights the significant effects of drought conditions across various regions worldwide, underscoring the urgency of addressing this environmental challenge.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It increases awareness about the global impacts of drought, a significant environmental issue. The report could serve as a valuable resource for decision-makers, researchers, and the public, highlighting the urgency of addressing this challenge."
  },
  {
    "title": "Wayve CEO Alex Kendall brings the future of autonomous AI to TechCrunch Disrupt 2025",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:15:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "TechCrunch Disrupt 2025 hits Moscone West in San Francisco from October 27–29, bringing together more than 10,000 startup and VC leaders for a deep dive into the future of technology. One of the most compelling conversations on one of the AI Stages will feature a panel of innovators redefining what ",
      "We’re excited to welcome Mati Staniszewski, co-founder and CEO of ElevenLabs, to the AI stage at TechCrunch Disrupt 2025, taking place October 27–29 in San Francisco. In a featured fireside chat, Staniszewski will dive into how AI-powered voice technology is transforming digital communication and in"
    ],
    "image_url": "",
    "titles": [
      "Wayve CEO Alex Kendall brings the future of autonomous AI to TechCrunch Disrupt 2025",
      "Exploring the future of voice AI with Mati Staniszewski at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.455,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on innovations in the field of autonomous AI. It could increase readers' understanding of this technology and its potential impacts."
  },
  {
    "title": "Study Sheds Light on Prairie Dogs' Plague Immunity, Aids Wildlife Conservation",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 10:56:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A study of the genetic basis of plague immunity in prairie dogs has broad implications for conservation. From white-nose syndrome in bats to avian malaria in Hawaiian birds, introduced pathogens are a major cause of population declines in native species. Many prairie dog populations in North America"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/genes-for-surviving-pl.jpg",
    "titles": [
      "Prairie dog genes reveal secrets of plague survival"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "A study on prairie dogs' genetic immunity to plague reveals significant insights for wildlife conservation, highlighting the impact of introduced pathogens like white-nose syndrome in bats and avian malaria in Hawaiian birds on native species populations. This research could aid in understanding and mitigating population declines across various species in North America.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides readers with a deeper understanding of the impact of pathogens on native species and the importance of wildlife conservation. It also reports on the progress made in research, which could be useful in mitigating population declines across various species."
  },
  {
    "title": "The best iPad to buy",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-08T11:56:10-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Editor’s note:&#160;Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the&#160;best Prime Day deals&#160;you can get. There are no bad iPads. That’s the best news about Apple’s tablet lineup: 15 years",
      "Editor’s note:&#160;Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the&#160;best Prime Day deals&#160;you can get. Robot vacuums that can both mop and sweep your floors have improved significantly ",
      "Editor’s note: Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the best Prime Day deals you can get. Today’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy tr"
    ],
    "image_url": "",
    "titles": [
      "The best iPad to buy",
      "The best robot vacuum and mop to buy right now",
      "The best budget robot vacuums"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive as it provides actionable insights to the reader about which iPad to buy. It can help in decision-making, especially for those planning to purchase an iPad."
  },
  {
    "title": "I tested a bunch of gaming laptops and these are the best",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-08T11:53:45-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Editor’s note: Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the best Prime Day deals you can get. Gaming laptops come in various shapes and sizes, though many of the heavy hitters remain thick an",
      "Editor’s note:&#160;Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the&#160;best Prime Day deals&#160;you can get. Buying the right laptop can be stressful. It’s likely one of the bigger tech purch"
    ],
    "image_url": "",
    "titles": [
      "I tested a bunch of gaming laptops and these are the best",
      "The best laptops you can get"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it provides valuable information to readers who are interested in buying a gaming laptop. It gives insights into the best options available in the market, which can guide the reader's decision-making process."
  },
  {
    "title": "CERN Experiments Confirm Novel Phenomenon in Proton Collisions",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 10:59:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "An unforeseen feature in proton-proton collisions previously observed by the CMS experiment at CERN's Large Hadron Collider (LHC) has now been confirmed by its sister experiment ATLAS."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/elusive-romance-of-top.jpg",
    "titles": [
      "Elusive romance of top-quark pairs observed at Large Hadron Collider"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "An unexpected phenomenon in proton-proton collisions, initially detected by the CMS experiment at CERN's Large Hadron Collider, has been verified by the ATLAS experiment, its counterpart. This confirmation adds credibility to the initial findings, marking a significant advancement in our understanding of particle physics.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in our understanding of particle physics. It provides empowering knowledge and contributes to the reader's understanding of the subject matter."
  },
  {
    "title": "Kerry Washington Leads $550K Investment in Wedding Startup",
    "domain": "business",
    "location": "national",
    "published": "Tue, 08 Jul 2025 15:54:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Amy Shack Egan started planning weddings at 23. Now, she's raised $550,000 for her wedding coordination startup — with Kerry Washington as lead investor."
    ],
    "image_url": "",
    "titles": [
      "At 23, she became a wedding planner. A decade later, she's raised $550,000 for her nuptials startup—with Kerry Washington as lead investor"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.446,
    "summary": "Amy Shack Egan, who began her career in wedding planning at the age of 23, has successfully raised $550,000 for her wedding coordination startup. Notably, actress Kerry Washington has taken the lead as the primary investor in Egan's business venture.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the investment in a startup and the involvement of a well-known actress. However, it lacks depth on how this investment might impact the wedding industry, or what innovative solutions the startup offers."
  },
  {
    "title": "The best smartwatches for Android",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-08T11:42:40-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Editor’s note:&#160;Amazon Prime Day 2025 is officially underway. If you’re looking to make the most of the four-day shopping extravaganza, we’ve put together a guide to the&#160;best Prime Day deals&#160;you can get. After a long stretch of slim pickings, the last couple of years have been huge for"
    ],
    "image_url": "",
    "titles": [
      "The best smartwatches for Android"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information to readers who are looking to purchase a smartwatch for their Android device. However, it doesn't report on solutions, improvements, or innovations, nor does it increase awareness around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Cough Syrup Ingredient May Slow Parkinson's Dementia, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 14:54:21 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/cough-syrup-slows-brain-damage-in-parkinsons-dementia-study-finds/\" rel=\"nofollow\" title=\"Cough Syrup Slows Brain Damage in Parkinson’s Dementia, Study Finds\"><img alt=\"Pouring Cough Syrup Cold Medicine Spoon\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518"
    ],
    "image_url": "",
    "titles": [
      "Cough Syrup Slows Brain Damage in Parkinson’s Dementia, Study Finds"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary": "A study has discovered that a common cough syrup ingredient can slow brain damage in Parkinson's dementia. This finding offers potential for developing new treatments for the condition.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides a deeper understanding of a potential breakthrough in the treatment of Parkinson's dementia. However, it does not detail the specific impacts this finding could have on patients, or the next steps in research and development."
  },
  {
    "title": "Neanderthal Genes Linked to Modern Headaches and Dizziness",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 10:42:56 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "If you regularly experience headaches, dizziness, balance problems and blurred vision, our Neanderthal cousins could be to blame."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/neanderthal-dna-could.jpg",
    "titles": [
      "Neanderthal DNA could be the cause of some modern brain malformations"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary": "Recent studies suggest that individuals who frequently suffer from headaches, dizziness, balance issues, and blurred vision may have inherited these conditions from Neanderthal ancestors. Researchers have found genetic links that trace back to our prehistoric cousins, indicating a possible connection between our genetic heritage and these symptoms.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The article offers useful insights into the genetic links between Neanderthal genes and modern health issues. While it doesn't necessarily provide actionable insights or solutions, it does contribute to the reader's understanding of human genetic heritage and its impacts."
  },
  {
    "title": "Species Move Unexpectedly in Response to Climate Change",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 11:02:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As the climate warms, scientists expect animals and plants to move to cooler areas—uphill, toward the poles, or into deeper waters. But in a surprising twist, scientists have found that over a third of species are doing the opposite and instead heading downhill, toward the equator, or into shallower"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/not-all-species-flee-t.jpg",
    "titles": [
      "Not all species flee heat: New hypothesis explains surprising movements in nature"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "Scientists have observed that over a third of species are moving contrary to expectations amid climate change, heading downhill, toward the equator, or into shallower waters, rather than moving to cooler areas such as uphill, toward the poles, or deeper waters. This unexpected behavior challenges previous assumptions about how species would respond to global warming.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful insights into the unexpected behavior of species in response to climate change, which can help in further research and understanding of the impact of global warming on biodiversity. However, it doesn't highlight any solutions or improvements."
  },
  {
    "title": "Nissan feels the effect of US-China trade war",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 08 Jul 2025 15:48:40 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The automaker will build fewer 3rd-gen Leafs and is postponing two US-made EVs."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/250326-01_US-Nissan-Range-Teaser-source-1152x648.jpg",
    "titles": [
      "Nissan feels the effect of US-China trade war"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a deeper understanding of the impacts of the US-China trade war on global businesses. However, without more details, it's unclear if it offers solutions or highlights progress."
  },
  {
    "title": "Marks & Spencer chair refuses to say if retailer paid hackers after ransomware attack",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 08 Jul 2025 14:18:23 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The retail giant's chair confirmed the breach was caused by ransomware."
    ],
    "image_url": "",
    "titles": [
      "Marks & Spencer chair refuses to say if retailer paid hackers after ransomware attack"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about the issue of ransomware attacks and their impact on businesses. However, it does not provide any solutions or insights into how such attacks can be prevented or dealt with, hence the lower score."
  },
  {
    "title": "Radar Systems Could Alert Aliens to Human Presence, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Jul 2025 11:00:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Radar systems used by civilian airports and military operations are inadvertently revealing our existence to potential advanced alien civilizations, new research shows."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-airports-like-heat.jpg",
    "titles": [
      "How airports like Heathrow and Gatwick could help aliens spot Earth"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407,
    "summary": "New research indicates that radar systems, utilized by both civilian airports and military operations, may unintentionally signal our presence to advanced alien civilizations. This finding sheds light on the potential for extraterrestrial awareness of human activity on Earth through technological means.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness about the potential for extraterrestrial awareness of human activity, it lacks depth or actionable insights. It doesn't report on any solutions, improvements, or attempts to solve problems."
  }
]