[
  {
    "title": "Selfies From the Front: Inside the ‘V.I.P.’ Brigade for Ambitious Russian Officials",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 15:56:24 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "After a stint with a drone unit led by a member of Parliament, Russian officials return to work, and promotions, garlanded as war veterans. Most soldiers are stuck in indefinite deployments."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/25/world/25int-russia-vip-brigade/25int-russia-vip-brigade-mediumSquareAt3X.png",
    "titles": [
      "Selfies From the Front: Inside the ‘V.I.P.’ Brigade for Ambitious Russian Officials"
    ],
    "summary": "Russian officials, after serving with a drone unit headed by a Parliament member, have resumed their positions and received promotions, being celebrated as war veterans. Meanwhile, the majority of soldiers remain in prolonged deployments without a clear end.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a deeper understanding of the political dynamics within Russia's military and how service is perceived and rewarded. However, it does not offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 5.6
  },
  {
    "title": "At Least 12 Killed and Dozens Injured After Russia’s Air Strike In Ukraine",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 15:50:31 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The attack involved nearly 370 missiles and drones, according to the Ukrainian Air Force. At least 12 people were killed."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/25/multimedia/25int-ukraine-attack-gvql/25int-ukraine-attack-gvql-mediumSquareAt3X-v2.jpg",
    "titles": [
      "At Least 12 Killed and Dozens Injured After Russia’s Air Strike In Ukraine"
    ],
    "summary": "An attack in Ukraine, involving nearly 370 missiles and drones as reported by the Ukrainian Air Force, resulted in the death of at least 12 people.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.639,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.595,
    "normalized_score": 10.0
  },
  {
    "title": "Nottingham Forest v Chelsea: Premier League final day – live",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 15:46:57 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li><p>Premier League updates from the 4pm BST kick-off</p></li><li><p><a href=\"https://preview.gutools.co.uk/football/live\">Live scores</a> | <a href=\"https://preview.gutools.co.uk/football/premierleague/table\">Table</a> | <a href=\"https://preview.gutools.co.uk/football/2025/jan/14/premier-league-top-scorers-2024-25-who-is-leading-race-for-golden-boot\">Golden Boot race</a> | <a href=\"mailto:scott.murray.casual@theguardian.com\">Email Scott</a></p></li></ul><p><strong>4 min:</strong> Gibbs-White barges his way down the inside-left channel … but James makes up ground and barges him off the ball. Elanga picks up the loose ball and tries to keep things going but Cucurella gets in the road and puts a stop to his gallop.</p><p><strong>2 min:</strong> Chelsea are on the front foot quickly, though, and Palmer wins a corner down the left. It’s played short before being swung in, and it causes no danger to the hosts. What an atmosphere, though!</p> <a href=\"https://www.theguardian.com/football/live/2025/may/25/nottingham-forest-v-chelsea-premier-league-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/74e7d36cbf99c3818f02dc757b981e12447fd01f/323_0_4307_3446/master/4307.jpg?width=140&quality=85&auto=format&fit=max&s=1cd15f46044208f75709346f2452b2ad",
    "titles": [
      "Nottingham Forest v Chelsea: Premier League final day – live"
    ],
    "summary": "During a Premier League match that kicked off at 4pm BST, Chelsea started aggressively, earning a corner early in the game but failing to convert it into a goal. The atmosphere was noted to be electric. In the fourth minute, Gibbs-White of Nottingham Forest attempted an advance but was stopped by Chelsea's James, with Elanga then trying to push forward only to be halted by Cucurella. Live updates, league tables, and information on the Golden Boot race are available through provided links.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the progress of a live soccer match, providing useful context and detail. However, it does not highlight progress, solutions, or empowering knowledge beyond the sports context.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 7.69
  },
  {
    "title": "Sussex thrash Hampshire, Somerset beat Durham, and more: county cricket day three – live",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 15:45:54 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li><p>Updates from day three of the latest round of matches</p></li><li><p><a href=\"https://www.theguardian.com/sport/2016/aug/18/sign-up-to-the-spin\">Sign up to The Spin</a> | <a href=\"mailto:tanya.aldred.freelance@theguardian.com\">Email Tanya</a> or comment BTL</p></li></ul><p><strong>A missive from the Grace Road scorebox:“So, will today be the day</strong> that an upwardly mobile Midlands team beat an entitled, underperforming Manchester-based team? We hope so.</p><p>“Anyway, enough about Villa v Man U. Here at Grace Road, Leicestershire’s strong overnight position looks like being a platform for a win if the weather allows for enough play in the next couple of days. I’ve brought a book just in case, though.”</p> <a href=\"https://www.theguardian.com/sport/live/2025/may/25/durham-v-somerset-surrey-v-essex-and-more-county-cricket-day-three-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/fac4c3cd2038b43749597a82800ed48be900ccdc/192_0_2213_1771/master/2213.jpg?width=140&quality=85&auto=format&fit=max&s=015bff1e150f451109a2d75af222bea6",
    "titles": [
      "Sussex thrash Hampshire, Somerset beat Durham, and more: county cricket day three – live"
    ],
    "summary": "Leicestershire is in a strong position on day three of the latest round of county cricket matches, potentially heading towards a win against an unnamed opponent at Grace Road, weather permitting. The update humorously references a football match between Aston Villa and Manchester United, drawing a parallel with the cricket match's dynamics. The outcome of the cricket match depends on the weather allowing enough play in the coming days.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful updates on the ongoing cricket matches, which can aid readers in understanding the current dynamics of the games. However, it doesn't delve into any significant depth or offer insights into strategies, player performances, or potential impacts of the outcomes.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 5.49
  },
  {
    "title": "Newcastle v Everton, Fulham v Manchester City, and more: Premier League final day – live",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 15:45:15 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li><p>Premier League season final day, kick-offs at 4pm BST</p></li><li><p><a href=\"https://www.theguardian.com/football/live\">Live scores</a> |  <a href=\"https://www.theguardian.com/football/premierleague/table\">Premier League table</a> | <a href=\"https://www.theguardian.com/football/2025/jan/14/premier-league-top-scorers-2024-25-who-is-leading-race-for-golden-boot\">Golden Boot race</a></p></li></ul><p><strong>Kevin De Bruyne</strong> starts on the bench. Jack Grealish does not, and he’s not in the XI either. That’s a pretty sad end to his Manchester City career.</p><p><strong>Fulham (4-2-3-1)</strong> Leno; Tete, Andersen, Cuenca, Robinson; Cairney, Lukic; Traore, Andreas Pereira, Wilson; Jimenez.<br />\n Subs: Benda, Bassey, Vinicius, Berge, Iwobi, Willian, King, Sessegnon, Smith Rowe.</p> <a href=\"https://www.theguardian.com/football/live/2025/may/25/fulham-manchester-city-newcastle-everton-liverpool-trophy-premier-league-finale-gary-lineker-match-of-the-day-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/449e0ed36ae4171ef04b2497a0d28689feb88f2e/81_0_1577_1261/master/1577.jpg?width=140&quality=85&auto=format&fit=max&s=6597b2654b011f4e0becfa83edfb9b8e",
    "titles": [
      "Newcastle v Everton, Fulham v Manchester City, and more: Premier League final day – live"
    ],
    "summary": "On the final day of the Premier League season, with matches kicking off at 4pm BST, key developments include Kevin De Bruyne starting on the bench for Manchester City, marking a disappointing conclusion to Jack Grealish's time with the team. Fulham's lineup against Manchester City is announced, featuring Leno, Tete, Andersen, Cuenca, Robinson, Cairney, Lukic, Traore, Andreas Pereira, Wilson, and Jimenez, with a bench that includes Benda, Bassey, Vinicius, Berge, Iwobi, Willian, King, Sessegnon, and Smith Rowe. For more details, live scores, and updates on the Premier League table and Golden Bo",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The news piece provides useful information about the final day of the Premier League season, including team lineups and key developments. This could influence readers' understanding and decision-making, especially those involved in sports betting or fantasy leagues. However, it lacks a broader context or analysis of the potential impacts of these matches.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.564,
    "normalized_score": 6.59
  },
  {
    "title": "Sosie given Eclipse assignment after winning Prix d'Ispahan",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 16:53:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "After producing a wicked turn of foot to win the Prix d'Ispahan, Sosie is set for a tilt at the Eclipse next"
    ],
    "image_url": "https://e1.365dm.com/25/05/1920x1080/image_6926986.jpg?20250525165316",
    "titles": [
      "Sosie given Eclipse assignment after winning Prix d'Ispahan"
    ],
    "summary": "Sosie, after showcasing an impressive performance by winning the Prix d'Ispahan with a remarkable turn of speed, is now scheduled to compete in the upcoming Eclipse race.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Sosie's success in the Prix d'Ispahan and the subsequent assignment to the Eclipse race. However, it lacks depth or insight into the significance of this development, the performance of Sosie, or the potential implications for the upcoming race.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.011,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.529,
    "normalized_score": 2.75
  },
  {
    "title": "Lake Victoria blitzes field to win Irish 1,000 Guineas",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 16:22:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Lake Victoria put in a special performance to land the Irish 1,000 Guineas at the Curragh becoming Aidan O'Brien's 11th winner of the Group One contest."
    ],
    "image_url": "https://e1.365dm.com/25/05/1920x1080/skysports-lake-victoria-curragh_6926932.jpg?20250525163029",
    "titles": [
      "Lake Victoria blitzes field to win Irish 1,000 Guineas"
    ],
    "summary": "Lake Victoria won the Irish 1,000 Guineas at the Curragh, marking trainer Aidan O'Brien's 11th victory in the Group One contest. This performance highlights Lake Victoria's exceptional ability and O'Brien's continued success in premier horse racing competitions.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the outcome of a horse race, but it doesn't provide any deeper insight or context. It doesn't give the reader actionable insights, report on solutions or improvements, or increase clarity around systems or trends.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.004,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.507,
    "normalized_score": 0.33
  },
  {
    "title": "Norris fends off Leclerc to win unusual Monaco GP",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 15:53:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Lando Norris held off Charles Leclerc to win an unusual Monaco Grand Prix that was dictated by new pit stop requirements."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-f1-lando-norris-zak-brown_6926876.jpg?20250525163240",
    "titles": [
      "Norris fends off Leclerc to win unusual Monaco GP"
    ],
    "summary": "Lando Norris won the Monaco Grand Prix, successfully keeping Charles Leclerc behind him in a race marked by new pit stop rules. These regulations significantly influenced the competition's outcome.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant event in the world of Formula 1 racing, with the added context of the new pit stop rules. It provides a deeper understanding of the race's outcome, but it doesn't necessarily offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 3.41
  },
  {
    "title": "Mercer walk off field and player’s mother ejected after home-run taunt",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 25 May 2025 15:51:44 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Mercer were so incensed by an opposing player’s home run celebration that they walked off the field during their Southern Conference tournament defeat"
    ],
    "image_url": "",
    "titles": [
      "Mercer walk off field and player’s mother ejected after home-run taunt"
    ],
    "summary": "During their Southern Conference tournament game, the Mercer baseball team walked off the field in protest after being upset by an opposing player's home run celebration. This incident led to their defeat in the tournament.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an incident in a baseball game. It doesn't provide deeper insights or context, and it doesn't report on solutions or improvements. However, it does increase clarity around the impact of sportsmanship and behavior in sports.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.31
  },
  {
    "title": "Premier League top scorers 2024-25: who is leading race for Golden Boot?",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 25 May 2025 15:49:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Which sharp-shooting players are in the running for the Golden Boot? Our standings will update through the season"
    ],
    "image_url": "",
    "titles": [
      "Premier League top scorers 2024-25: who is leading race for Golden Boot?"
    ],
    "summary": "The Golden Boot race features players competing for the title of top scorer. Standings will be updated throughout the season to reflect the leading sharp-shooting players.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides some basic awareness about the Premier League and the Golden Boot race, it doesn't offer any actionable insights or deeper understanding. It doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "U.S. risks losing ‘reliable investment’ status, Allianz GI manager says",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 15:25:46 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "If passed by the Senate, a repeal of the IRA “would mark a sharp reversal in US clean-tech policy,” Bibani said."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2215816830-e1748186278839.jpg?w=2048",
    "titles": [
      "U.S. risks losing ‘reliable investment’ status, Allianz GI manager says"
    ],
    "summary": "The proposed repeal of the IRA, if approved by the Senate, would significantly alter the direction of U.S. clean technology policy, according to Bibani. This change indicates a major shift away from current strategies aimed at promoting clean technologies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about potential changes in U.S. clean technology policy and its potential impact on investment status. It informs and contextualizes the topic, even though the topic is negative. However, it doesn't clearly highlight progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.991,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.573,
    "normalized_score": 7.58
  },
  {
    "title": "House Speaker Johnson downplays deficit concerns as budget bill faces skeptics in Senate",
    "domain": "business",
    "location": "national",
    "published": "Sun, 25 May 2025 15:06:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Speaker Mike Johnson rejected concerns that the \"big, beautiful bill\" will add to the federal deficit."
    ],
    "image_url": "",
    "titles": [
      "House Speaker Johnson downplays deficit concerns as budget bill faces skeptics in Senate"
    ],
    "summary": "Speaker Mike Johnson dismissed worries about the impact of a significant legislative proposal on the federal deficit, referring to it as a \"big, beautiful bill.\" Despite concerns raised, Johnson stands firm in his position, indicating no change in stance or policy as a result of these concerns.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant legislative proposal and the concerns it raises. It provides some context and insight into the political dynamics surrounding the bill. However, it doesn't report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.987,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.552,
    "normalized_score": 5.27
  },
  {
    "title": "U.S. military spent $6 billion in the past 3 years to recruit and retain troops amid enlistment shortfalls",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 14:56:36 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The financial incentives to reenlist in the Army, Navy, Air Force and Marines increased dramatically from 2022 through last year."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25143521885791-e1748184550148.jpg?w=2048",
    "titles": [
      "U.S. military spent $6 billion in the past 3 years to recruit and retain troops amid enlistment shortfalls"
    ],
    "summary": "The financial incentives for reenlisting in the U.S. military branches, including the Army, Navy, Air Force, and Marines, saw a significant rise from 2022 through the previous year.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the financial incentives for reenlisting in the U.S. military and the challenges they face in recruitment. However, it doesn't provide deeper insights into the causes, potential solutions, or impacts of these enlistment shortfalls.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.984,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.559,
    "normalized_score": 6.04
  },
  {
    "title": "A crypto investor is charged with kidnapping and torturing a man for weeks to get his Bitcoin password",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 14:45:46 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "John Woeltz, 37, was arrested Friday night after the victim escaped from the eight-bedroom town house and flagged down a traffic officer for help."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2214746056-e1748183897720.jpg?w=2048",
    "titles": [
      "A crypto investor is charged with kidnapping and torturing a man for weeks to get his Bitcoin password"
    ],
    "summary": "John Woeltz, 37, was arrested on Friday night following an incident where the victim managed to escape from an eight-bedroom townhouse and sought help by flagging down a traffic officer.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises awareness about the potential risks and crimes associated with cryptocurrency, it doesn't provide actionable insights or deeper understanding for the reader. It also lacks a focus on solutions or progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.982,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.52,
    "normalized_score": 1.76
  },
  {
    "title": "Poland’s presidential race goes down to the wire",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 14:36:06 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Rafał Trzaskowski and Karol Nawrocki hold rival rallies as polls show them tied ahead of June 1 vote"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc7f28843-d82e-4f65-b485-f64301fad54e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Poland’s presidential race goes down to the wire"
    ],
    "summary": "Rafał Trzaskowski and Karol Nawrocki, political opponents in an upcoming election, conducted competing rallies as recent polls indicate a tie in their race. The election is scheduled for June 1.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about the current political situation in Poland, providing useful context about the upcoming election. However, it doesn't highlight any specific solutions, improvements, or empowering knowledge that would elevate it to a higher score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.98,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.57,
    "normalized_score": 7.25
  },
  {
    "title": "Chocolate + Tea = Better Blood Pressure? Scientists Reveal Surprising Results",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 15:45:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/chocolate-tea-better-blood-pressure-scientists-reveal-surprising-results/\" rel=\"nofollow\" title=\"Chocolate + Tea = Better Blood Pressure? Scientists Reveal Surprising Results\"><img alt=\"Tea Chocolates\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Tea-Chocolates-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Tea, dark chocolate, apples, and grapes could do more than satisfy cravings—they might help lower blood pressure. A major review from the University of Surrey reveals that flavan-3-ols, natural compounds in these foods, can improve blood pressure and vascular health. The effects were especially notable in those with high blood pressure and, in some cases, [...]"
    ],
    "image_url": "",
    "titles": [
      "Chocolate + Tea = Better Blood Pressure? Scientists Reveal Surprising Results"
    ],
    "summary": "A study from the University of Surrey found that flavan-3-ols, compounds in tea, dark chocolate, apples, and grapes, can lower blood pressure and improve vascular health. The benefits were most significant in individuals with high blood pressure.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it provides actionable insights for readers about how certain dietary choices can impact their health. It also increases awareness about the role of flavan-3-ols in vascular health.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.584,
    "normalized_score": 8.79
  },
  {
    "title": "New Obesity Pill Mimics Gastric Bypass Without Surgery",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 15:20:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-obesity-pill-mimics-gastric-bypass-without-surgery/\" rel=\"nofollow\" title=\"New Obesity Pill Mimics Gastric Bypass Without Surgery\"><img alt=\"Fit Young Woman Weight Loss Results Loose Jeans\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Fit-Young-Woman-Weight-Loss-Results-Loose-Jeans-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>SYNT-101 introduces an innovative method for weight loss by temporarily redirecting nutrient absorption in the small intestine. A groundbreaking new obesity treatment in pill form is showing exciting early promise. In a first-of-its-kind human study, researchers tested SYNT-101, a once-daily oral medication designed to safely and effectively shift nutrient absorption to the lower intestine. This [...]"
    ],
    "image_url": "",
    "titles": [
      "New Obesity Pill Mimics Gastric Bypass Without Surgery"
    ],
    "summary": "Researchers have developed SYNT-101, a new oral medication aimed at treating obesity by mimicking the effects of gastric bypass surgery without the need for an actual procedure. This pill works by altering nutrient absorption in the small intestine, redirecting it to the lower intestine, which can lead to weight loss. Initial human studies have shown promising results, indicating that SYNT-101 could offer a safe and effective alternative for obesity treatment.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant innovation in obesity treatment. It provides readers with a deeper understanding of the new medication, how it works, and its potential benefits, contributing to their decision-making regarding obesity treatment.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.99,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 8.68
  },
  {
    "title": "Everything Evaporates: From Neutron Stars to You, the Universe Is on a Clock",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 11:29:28 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/everything-evaporates-from-neutron-stars-to-you-the-universe-is-on-a-clock/\" rel=\"nofollow\" title=\"Everything Evaporates: From Neutron Stars to You, the Universe Is on a Clock\"><img alt=\"Evaporating Neutron Star\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"466\" src=\"https://scitechdaily.com/images/Evaporating-Neutron-Star-777x466.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>What if black holes weren’t the only things slowly vanishing from existence? Scientists have now shown that all dense cosmic bodies—from neutron stars to white dwarfs—might eventually evaporate via Hawking-like radiation. Even more shocking, the end of the universe could come far sooner than expected, “only” 1078 years from now, not the impossibly long 101100 [...]"
    ],
    "image_url": "",
    "titles": [
      "Everything Evaporates: From Neutron Stars to You, the Universe Is on a Clock"
    ],
    "summary": "Scientists have discovered that dense cosmic bodies, such as neutron stars and white dwarfs, could evaporate over time due to Hawking-like radiation, similar to black holes. This process suggests the universe could end much sooner than previously thought, potentially in about 10^78 years, challenging earlier estimates of 10^100 years. This finding indicates that everything in the universe is subject to a finite lifespan.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about recent scientific discoveries, contributing to the reader's understanding of the universe and its potential lifespan. However, it does not provide actionable insights or report on solutions or improvements, which limits its constructiveness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.936,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.536,
    "normalized_score": 3.52
  },
  {
    "title": "Jupiter’s Colossal Secret: Tiny Moons Reveal a Planet Twice Its Size",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 11:04:48 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/jupiters-colossal-secret-tiny-moons-reveal-a-planet-twice-its-size/\" rel=\"nofollow\" title=\"Jupiter’s Colossal Secret: Tiny Moons Reveal a Planet Twice Its Size\"><img alt=\"Jupiter&#039;s Magnetic Field Lines\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/Jupiters-Magnetic-Field-Lines-777x777.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Jupiter may have once been more than twice its current size, with a magnetic field 50 times stronger, say scientists who analyzed its tiny inner moons. These new findings offer a rare and powerful window into how Jupiter—and by extension, the entire Solar System—first formed. Jupiter has long been known as the heavyweight champion of [...]"
    ],
    "image_url": "",
    "titles": [
      "Jupiter’s Colossal Secret: Tiny Moons Reveal a Planet Twice Its Size"
    ],
    "summary": "Scientists analyzing Jupiter's tiny inner moons suggest the planet may have once been more than twice its current size, possessing a magnetic field 50 times stronger than it is now. This research provides insight into Jupiter's formation and, by extension, the formation of the Solar System.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the formation of Jupiter and the Solar System, contributing to the reader's understanding of astronomy and planetary science. However, it does not report on solutions or improvements, and its impact on the reader's decision-making or sense of agency is limited.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.931,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 5.6
  },
  {
    "title": "A root development gene that's older than root development",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "A gene that regulates the development of roots in vascular plants is also involved in the organ development of liverworts—land plants so old they don't even have proper roots. The Kobe University discovery, published in New Phytologist, highlights the fundamental evolutionary dynamic of co-opting, evolving a mechanism first and adopting it for a different purpose later."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-root-development-gen.jpg",
    "titles": [
      "A root development gene that's older than root development"
    ],
    "summary": "Researchers from Kobe University have discovered a gene that plays a crucial role in root development in vascular plants, also influences organ development in liverworts, some of the oldest land plants lacking proper roots. Published in New Phytologist, this finding underscores an evolutionary process where mechanisms evolve initially for one function and are later repurposed for another. This highlights the deep evolutionary connections among plant species and the adaptability of genetic functions over time.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the progress in understanding the evolutionary process and the adaptability of genetic functions over time. It provides empowering knowledge about the deep evolutionary connections among plant species, which can be useful for researchers and students in the field of biology.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.929,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.564,
    "normalized_score": 6.59
  }
]