[
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features a wide range of deals that are available to all customers, not just Amazon Prime members. A comprehensive roundup includes over 100 deals on popular gear, and there is also a focus on offering low-cost alternatives for shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.991639802662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4579099506655092,
    "summary": "Amazon's Big Spring Sale is happening now through Monday, March 31st, offering a broad selection of deals accessible to all customers, not exclusively Amazon Prime members. The sale includes over 100 deals on popular items, with an emphasis on providing affordable options for consumers."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has bought the social media platform formerly known as Twitter, now called X, in an all-stock deal. xAI is valued at $80 billion and X at $33 billion, with X carrying $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9856585471643519,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45641463679108796,
    "summary": "Elon Musk's AI company, xAI, acquired the social media platform previously known as Twitter, now renamed X, through an all-stock transaction. xAI holds a valuation of $80 billion, while X is valued at $33 billion and has $12 billion in debt."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has initiated testing for Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653), aimed at enabling IT professionals to remotely recover Windows 11 devices that are unable to boot. This feature was first announced last year, following the Crowdstrike incident, as a measure to enhance device recovery capabilities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9782629708680556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4545657427170139,
    "summary": "Microsoft has started testing Quick Machine Recovery in the newest Windows Insider Preview build (6120.3653) for Windows 11. This feature, designed for IT professionals, allows for the remote recovery of devices that can't boot. It was introduced as a response to improve recovery options after the Crowdstrike incident last year."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google, which acquired Fitbit in early 2021, initially required Fitbit users to migrate their accounts to Google accounts by 2025. However, in a recent email to Fitbit users, Google announced it has extended this deadline to next year, allowing more time for the account migration process."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9621413363078704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45053533407696755,
    "summary": "Google has extended the deadline for Fitbit users to migrate their accounts to Google accounts until next year, beyond the initial 2025 deadline. This decision, communicated through an email to Fitbit users, allows additional time for the account migration process following Google's acquisition of Fitbit in early 2021."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep sea mining, has sought closer ties with the Trump administration following obstacles in global talks. Initially backed by Nauru, TMC's ambitions in 2021 accelerated efforts to establish mining regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9516890040509259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44792225101273153,
    "summary": "The Metals Company (TMC), focused on starting deep sea mining, sought stronger connections with the Trump administration after facing challenges in international discussions. Supported initially by Nauru, TMC aimed to speed up the creation of mining rules in 2021."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale for 2025, which started recently and will end on Monday, March 31st. The sale offers significant discounts on a variety of products, including gardening supplies and bedding, to coincide with the beginning of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9426399755324074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44565999388310185,
    "summary": "Amazon's Big Spring Sale for 2025 began recently and is set to conclude on Monday, March 31st. This event features substantial discounts on a wide range of items, notably gardening supplies and bedding, aligning with the onset of warmer weather."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are co-writing a thriller novel with elements similar to \"Squid Game.\" The untitled book, which involves players fighting to survive deadly tests, has attracted eight-figure bids for its publishing rights, as reported by Deadline."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9323317216087963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44308293040219904,
    "summary": "MrBeast and James Patterson are collaborating on a thriller novel inspired by \"Squid Game,\" featuring players in lethal survival challenges. The publishing rights for the untitled book have received bids exceeding ten million dollars, according to Deadline."
  },
  {
    "title": "Lenovo’s upcoming SteamOS handheld will cost $50 more than expected",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:16:01-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lenovo unveiled its Legion Go S handheld gaming PC powered by SteamOS at CES 2025, priced at $499.99. This positions it as a competitor to Valve's Steam Deck, fitting between the $399 LCD and $549 OLED models in terms of cost."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9242967355439815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4410741838859954,
    "summary": "At CES 2025, Lenovo introduced the Legion Go S, a handheld gaming PC running on SteamOS, with a price tag of $499.99. This device competes directly with Valve's Steam Deck, slotting between its $399 LCD version and the $549 OLED model in terms of price."
  },
  {
    "title": "Side Quest’s creators wanted to tell stories about why people love games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T15:50:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Halfway through its first season, Apple's Mythic Quest introduced \"A Dark Quiet Death,\" an episode that diverged from its usual comedy to tell a dramatic story about another video game development team's rise and fall. This marked the first significant shift in the show's storytelling approach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9062159936458334,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43655399841145837,
    "summary": "Midway through its debut season, Apple's \"Mythic Quest\" aired \"A Dark Quiet Death,\" an episode that shifted from the show's comedic tone to explore the dramatic journey of a different video game development team's success and decline. This episode represented the series' first major change in narrative style."
  },
  {
    "title": "ChatGPT’s Ghibli filter is political now, but it always was",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T15:11:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "OpenAI's new image generator, as covered by Kylie Robison, has sparked interest and discussion, particularly around the ethical implications of generative AI images. Despite these concerns, the technology has been found to be entertaining by some, including staff at The Verge who have extensively tested ChatGPT, showcasing its capabilities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8796411090740741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4299102772685185,
    "summary": "OpenAI has released a new image generator that has generated discussions about the ethical implications of AI-generated images. Despite these concerns, some find the technology entertaining, as noted by The Verge staff who have also tested ChatGPT, highlighting its capabilities."
  },
  {
    "title": "Trump and Carney hold first call amid ongoing trade war",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:25:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting between the two leaders after Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and announced intentions for a meeting with Canadian leaders following the forthcoming elections in Canada."
  },
  {
    "title": "Over 150 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 21:18:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, with tremors also felt in southwest China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, with its impact also felt in regions of southwest China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building has collapsed in Thailand's capital, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers might be trapped in the debris."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. The events unfolded within hours of each other."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah location after two rockets were fired from southern Lebanon towards northern Israel. These incidents occurred in close succession."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey this week following their coverage of mass protests occurring throughout the nation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey after reporting on widespread protests across the country."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco song \"Wiggle and Giggle All Night.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is viewed as an effort to question the legitimacy of the authorities currently in power in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event has been interpreted as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests demanding the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, calling for the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has instructed his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though specific details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children are among those who died in a recent incident. Details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any details regarding her son's situation after he was transferred to a prison in El Salvador by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son's condition following his transfer from the United States to a prison in El Salvador."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The killer's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The murderer's first parole request in Texas has been denied."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case involving the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in connection to the death of Clare Nowland."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but stated they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the Arctic, Russian President remarked on Donald Trump's plans, calling them \"serious\" but clarified that they have no connection to Moscow."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck a region already facing challenges from a civil war, food shortages, and a declining economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake hit a region already struggling with a civil war, food shortages, and an economic downturn."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescue efforts in Mandalay. One rescuer reported digging through the rubble with bare hands to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage in Mandalay. Rescue operations are underway, with teams, including individuals using their bare hands, searching through debris to locate survivors."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her lack of fear in her career, citing inspiration from artists Charli XCX and Sabrina Carpenter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed confidence in her career, attributing her fearlessness to the influence of artists Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local issues has made the government's efforts for re-election more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government is facing increased challenges in its bid for re-election due to a combination of international and local issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India has seen growth due to affluent, urban Indians spending more on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is experiencing growth as wealthier, urban residents increase their spending on pets, particularly dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments from across Africa and beyond, capturing the continent's vibrant culture, daily life, and significant events."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's notable photographs from Africa highlight the continent's rich culture, everyday life, and key events, showcasing a variety of compelling moments."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the entire day playing golf with the US President if it would bring advantages to Vietnam, highlighting a commitment to fostering beneficial relations between the two countries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated he is open to spending a whole day playing golf with the US President to enhance relations and secure benefits for Vietnam, showing a dedication to improving ties between the two nations."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to a baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered a baby shortly after being evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The top part of Myanmar's Shwe Sar Yan Pagoda, located southeast of Mandalay, fell due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The top section of the Shwe Sar Yan Pagoda in Myanmar, situated southeast of Mandalay, collapsed following an earthquake."
  },
  {
    "title": "Geno: Idea for two-host system 'ruined the game'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UConn coach Geno Auriemma criticized the two-host regional system for the women's NCAA tournament, stating it \"ruined the game.\" He expressed strong disdain for the change, directly attributing it to specific individuals, although not naming them publicly."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UConn coach Geno Auriemma criticized the women's NCAA tournament's two-host regional system, claiming it \"ruined the game.\" He strongly opposed the change and blamed certain individuals for it, though he did not publicly identify them."
  },
  {
    "title": "Diggs: ACL, 1,000-yard history affected Pats deal",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Stefon Diggs confirmed that his contract with the Patriots, valued at $69 million as reported by ESPN's Adam Schefter, met his expectations. This agreement comes after Diggs suffered a torn ACL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Stefon Diggs has agreed to a $69 million contract with the Patriots, as reported by ESPN's Adam Schefter. This deal was confirmed after Diggs experienced a torn ACL, yet it still met his expectations."
  },
  {
    "title": "Okananwa leads Duke past UNC and into Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Oluchi Okananwa achieved her third double-double of the season, guiding Duke to a victory over North Carolina and advancing them to the Elite Eight in the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Oluchi Okananwa secured her third double-double of the season, leading Duke to a win against North Carolina, which propelled them into the Elite Eight of the women's NCAA tournament."
  },
  {
    "title": "Prime Deal: Sanders lands $54M Buffs extension",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deion Sanders and Colorado have finalized a five-year contract extension worth $54 million, as confirmed by a contract copy ESPN obtained."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Deion Sanders and the University of Colorado have agreed on a five-year contract extension, valued at $54 million, according to a contract document acquired by ESPN."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday the dismissal of head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) dismissed head coach Dorival Júnior following the team's defeat by Argentina on Tuesday, as announced on Friday."
  },
  {
    "title": "Hornets' Ball to have procedures, out for season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Charlotte Hornets player LaMelo Ball is set to miss the remainder of the season due to two minor surgeries on his right ankle and wrist."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Charlotte Hornets' LaMelo Ball will miss the rest of the season due to undergoing minor surgeries on his right ankle and wrist."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his position as the coach of the Grizzlies, who are presently ranked 5th in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies, who are currently 5th in the Western Conference standings."
  },
  {
    "title": "Hundred hunt: Djokovic is 1 win from 100th title",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 17:55:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Novak Djokovic advanced to the Miami Open final, defeating Grigor Dimitrov, and is now one victory away from achieving his 100th career singles title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Novak Djokovic reached the Miami Open final by beating Grigor Dimitrov. He is now one win away from securing his 100th career singles title."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unusual series of events. Since his arrival, he has fully embraced his experience at the university."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue was characterized by a unique set of circumstances. Since joining the university, he has completely immersed himself in the experience."
  },
  {
    "title": "Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:48:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight in the basketball tournament has been determined after Thursday's four games. These matches have finalized the first half of the teams competing in the next round."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight of the basketball tournament has been set following Thursday's games, determining the first half of teams that will compete in the upcoming round."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in just four days. This quick turnaround showcases the flexibility and adaptability of the venue to host major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was converted into the Tampa Bay Rays' Opening Day ballpark within four days, demonstrating the venue's ability to quickly adapt for major league games."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "There's a debate on whether the style of play in sports is becoming cleaner or if referees are less inclined to enforce rules, based on perspectives from players, executives, and analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A discussion is ongoing about the evolution of sports play, with opinions divided on whether it's becoming cleaner or if referees are becoming more lenient in enforcing rules. This debate involves players, executives, and analysts."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as the panel has cast their votes on team standings. Each team's schedule up until April 17 has also been outlined to provide a comprehensive view of their path as the playoffs approach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff lineup is becoming more defined after the panel's recent vote on team standings. Additionally, the schedules for each team leading up to April 17 have been released, offering insight into their journey to the playoffs."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a game against Travis Hunter, showcasing his potential for an NFL future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, highlighting his prospects for an NFL career."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After experiencing depression, a snowboarder has regained her happiness and is now aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder who overcame depression is now targeting qualification for the 2026 Olympics at the upcoming World Championships on Saturday."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, playing for Fulham, has had a standout season, establishing himself as one of the top left backs globally. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has been recognized for his exceptional performance this season, earning him a reputation as one of the leading left backs worldwide. He aims to attain major successes with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:58:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The UFL season begins on Friday night, with all teams aiming to compete against Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The UFL season is set to start on Friday night, featuring all teams competing, with a shared goal of challenging Birmingham's top spot in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A year ago, Helen Hu, previously retired from gymnastics, was working at a hostel in Ecuador. Recently, she achieved a significant comeback by winning the SEC beam title this past weekend."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, who had retired from gymnastics and was working at a hostel in Ecuador a year ago, made a notable comeback by winning the SEC beam title recently."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:22 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves, as announced on Friday."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has expressed that transfer speculation linking him with a move to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States and Real Betis midfielder Johnny Cardoso stated that rumors about a potential transfer to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid LAFC links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain with Atlético Madrid for the next season, according to sources reported by ESPN. This decision comes despite his previous expressions of interest in joining Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, as reported by ESPN. This decision follows despite his earlier interest in moving to Major League Soccer (MLS)."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 16:53:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is exploring legal action against the Canadian Soccer Federation after Alphonso Davies sustained a significant knee injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation due to a serious knee injury suffered by Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça: 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:41:12 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm for competing against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and expressed excitement about facing Barcelona in the upcoming UEFA Women's Champions League semifinals."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:43:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona's coach, Hansi Flick, stated the team suffered a significant setback despite their 3-0 victory over Osasuna, as Dani Olmo was injured during the Thursday match."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona's coach, Hansi Flick, reported a significant setback for the team due to Dani Olmo's injury, despite a 3-0 win against Osasuna on Thursday."
  }
]