[
  {
    "title": "Jerusalem Shooting: 5 Dead, 12 Injured in Attack at Bus Stop",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 05:27:11 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "NPR",
      "New York Times",
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Paramedics said at least five people were killed in a shooting attack in Jerusalem after two attackers opened fire at a bus stop at a busy intersection in north Jerusalem.",
      "Israeli police say two gunmen were killed after the attack, which was one of the deadliest in the city in years.",
      "Paramedics say at least 12 people are injured in the morning attack with six in &quot;serious condition&quot;.",
      "Israeli authorities identified the two gunmen, who were killed at the scene, as Palestinians from the West Bank.",
      "The Israeli police described the shooting as a terrorist attack and said that the perpetrators had been killed at the scene.",
      "JERUSALEM (AP) — Palestinian attackers opened fire at a bus stop at during the morning rush hour in Jerusalem on Monday, killing six people and wounding another 12, according to Israeli officials. An Israeli soldier and civilians who were at the scene shot and killed the two attackers, said police, "
    ],
    "image_url": "",
    "titles": [
      "Shooting attack at Jerusalem bus stop kills at least 5",
      "Six killed by Palestinian gunmen at Jerusalem bus stop",
      "Shooting in occupied East Jerusalem kills six, Israeli authorities say",
      "Gunmen kill 6 in shooting attack at Jerusalem bus stop, police say",
      "Gunmen Attack Bus Stop in Jerusalem, Killing at Least 6",
      "Palestinian gunmen kill 6 people in attack on Jerusalem bus stop"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.869,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.844,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Jerusalem, a shooting at a bus stop by two Palestinian attackers from the West Bank resulted in at least five deaths and 12 injuries, with six in serious condition. The incident, occurring during the morning rush hour, is among the deadliest in the city in recent years. Israeli police and civilians at the scene responded, killing the two gunmen. Authorities are treating the event as a terrorist attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Wins Second US Open, Regains World No. 1 Ranking",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 10:58:44 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 win Sunday in the US Open final -- the third Grand Slam tournament in a row in which these rivals met to decide a champion -- for his second title at Flushing Meadows.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPU0lVeThuNXFSbHBFTkJxMmVBaWJiYUYxRDB0cWx5RHNBeXZaSUxwblFUc0s3MHJfWjI3VWlYTFdGbXFRZzZCVEhuZU9uYkNOQ3U0aDM4U2NwYUF2YW5PZktuNGpCYy1mVXY2RjE0MkVMem5EUGw5cTIzeGVXS2Y2eEdIZW1MSXJKaVdCSGFTSkw?oc=5\" target=\"_blank\">Carlos Alcaraz Wins Trilogy Matc",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFBLcGtSOTJ0U2UxeGRPOC11ZjhCSV9jTk5Da0pXckM2d3JDNi1lTlNPZ1YwSWxGREM0bkNLYWtWcHBScVA1ZzBrdTRZWE1QbVFQdVZTdHBoUnhNaktNUG5MdE4wT25YSldMR05BZG9zQzU4WFpmVVE?oc=5\" target=\"_blank\">Carlos Alcaraz Dropped Hilarious Line About Jannik Sinner After Winn",
      "<p>Watch as Carlos Alcaraz serves an ace vs. Jannik Sinner to win his second US Open title in four sets and claim his sixth career Grand Slam victory.</p>",
      "Carlos Alcaraz dethroned Jannik Sinner in sensational fashion to seal his second US Open title and become new world No 1 after security delays frustrated fans."
    ],
    "image_url": "",
    "titles": [
      "Alcaraz bests Sinner to win US Open, sixth Slam",
      "Carlos Alcaraz Wins Trilogy Match vs. Jannik Sinner at U.S. Open - Sports Illustrated",
      "Carlos Alcaraz Dropped Hilarious Line About Jannik Sinner After Winning U.S. Open - Sports Illustrated",
      "Alcaraz wins US Open with perfect ace vs. Sinner",
      "Alcaraz dethrones Sinner to win second US Open and become world No 1"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.975,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.816,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlos Alcaraz defeated Jannik Sinner in four sets (6-2, 3-6, 6-1, 6-4) to win his second US Open title and his sixth Grand Slam. This victory in New York also returned Alcaraz to the world number one ranking. The final, which marked the third consecutive Grand Slam final between Alcaraz and Sinner, experienced delays due to heightened security measures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Upholds $83.3M Defamation Judgment Against Trump",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 11:48:07 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "Forbes",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "A federal appeals court has upheld the $83.3 million judgment imposed on President Trump for defaming former magazine columnist E. Jean Carroll in 2019.",
      "Carroll has accused Trump of defaming her in statements denying her accusation that he raped her decades earlier in a New York City department store.",
      "<p>Federal appeals court upholds defamation judgment against Trump, rejecting the administration’s argument that he’s protected by supreme court immunity ruling</p><p>Intent on vindication after spending four months in prison last year, <strong>Peter Navarro</strong> asked a federal appeals court on",
      "The judgment has now ballooned to more than $89 million with interest."
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-2-gty-gmh-250908_1757334465762_hpMain_4x3t_384.jpg",
    "titles": [
      "Appeals court upholds $83 million judgment against Trump for defaming E. Jean Carroll",
      "Trump loses bid to overturn $83.3 million judgment in E. Jean Carroll defamation case",
      "Trump loses appeal and must pay E Jean Carroll $83m in defamation case – live",
      "Appeals Court Upholds E. Jean Carroll’s $83 Million Win Against Trump"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.992,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.802,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal appeals court upheld an $83.3 million judgment against former President Trump for defaming E. Jean Carroll, who accused him of rape. The court rejected Trump's immunity claim. With interest, the judgment exceeds $89 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Erin Patterson Gets Life for Murdering 3 Relatives with Poisonous Mushrooms",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 07:41:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Global News",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "globalnews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "Australian mother Erin Patterson has been sentenced to a minimum of 33 years in prison for murdering three of her former",
      "The judge handed out a non-parole period of 33 years to Erin Patterson for poisoning four of her estranged husband's relatives with death cap mushrooms.",
      "Erin Patterson was convicted of killing three relatives with a lunch laced with death cap mushrooms. The judge called her actions “an enormous betrayal of trust.”",
      "<p>Triple murderer sentenced in Victorian supreme court after killing relatives with a beef wellington lunch laced with death cap mushrooms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-mo",
      "Erin Patterson was convicted in July of murdering Don and Gail Patterson and Gail’s sister, Heather Wilkinson, with a lunch of foraged death cap mushrooms.",
      "<p>A Victorian supreme court judge has sentenced Erin Patterson to life imprisonment with a non-parole period of 33 years. A jury had previously found Patterson guilty of three counts of murder and one count of attempted murder by serving beef wellingtons laced with deadly death cap mushrooms. She h",
      "<p>Erin Patterson has been sentenced to life in prison with a non-parole period of 33 years after murdering three people and attempting to murder a fourth with a lunch laced with death cap mushrooms. Patterson, 50, was found guilty of murdering Don and Gail Patterson – the parents of her estranged h"
    ],
    "image_url": "",
    "titles": [
      "Australia mushroom murderer sentenced to life imprisonment",
      "Australia: 'Mushroom murderer' sentenced to life in prison",
      "Australian woman gets life in prison for ‘mushroom murders’",
      "Australia mushroom murderer Erin Patterson sentenced to life in prison with a non-parole period of 33 years",
      "Mushroom murderer Erin Patterson given 3 consecutive life sentences",
      "Watch in full: Erin Patterson sentenced to life in prison for Australian mushroom murders – video",
      "Erin Patterson: Australia's mushroom murderer sentenced to life in prison – video"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.838,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Erin Patterson was sentenced to life in prison with a minimum non-parole period of 33 years by an Australian court for murdering three of her estranged husband's relatives and attempting to murder a fourth by serving them a meal containing death cap mushrooms. The judge noted Patterson showed no remorse for her actions, which were described as a significant betrayal of trust.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal Protests: 19 Dead as Citizens Rally Against Corruption, Social Media Ban",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 14:18:24 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Young protesters are demanding the government lift its social media ban and tackle corruption.",
      "A Kathmandu District Administration Office spokesperson says police used water cannon, batons and rubber bullets.",
      "Protesters are agitating against corruption and a ban on major social media platforms.",
      "<p>Many demonstrators say they are also on the streets over corruption and nepotism they allege is rampant</p><p>At least 19 people have been killed during protests in Nepal over a government ban on dozens of online platforms including Facebook, Instagram, WhatsApp and X.</p><p>The government has fa",
      "Demonstrators stormed the Parliament complex days after the government banned most social media platforms. At least 200 people were injured, local news media reported."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4c3c/live/2b141cc0-8cab-11f0-84c8-99de564f0440.png",
    "titles": [
      "At least 19 dead in Nepal after Gen Z protests at corruption and social media ban",
      "At least 19 killed in Nepal protests over social media ban, corruption",
      "Nepal Gen Z protests amid social media ban, clashes kill 19: All to know",
      "At least 19 killed in ‘gen Z’ protests against Nepal’s social media ban",
      "At Least 12 Are Killed in Nepal in Protests Over Social Media Ban"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.942,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Nepal, protests erupted against government corruption and the ban of major social media platforms, including Facebook, Instagram, WhatsApp, and X. Demonstrators, demanding the lifting of the ban and addressing corruption, clashed with police who used water cannons, batons, and rubber bullets. The unrest led to at least 19 deaths and over 200 injuries. Protesters also stormed the Parliament complex, highlighting widespread frustration with nepotism and governance issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester City, Premier League Settle Dispute Over Sponsorship Rules",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 14:43:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Manchester City and the Premier League reach a settlement in their dispute over the rules that govern commercial deals.",
      "The settlement comes after City launched a third legal challenge against the league earlier this year, with the with an outcome on the financial case with City concerning more than 100 charges yet to reach a verdict",
      "<ul><li><p>Dispute over associated party transaction rules ends</p></li><li><p>Club still face charges of breaching financial rules</p></li></ul><p>Manchester City and the Premier League have settled their dispute over rules that limit the ability of top-flight clubs to sign sponsorship deals with c",
      "Manchester City and the Premier League have reached a settlement in their dispute over the rules governing Associated Party Transactions (APTs)."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cc68/live/d0917e40-8cc4-11f0-b6ff-bfdd1f9c1014.jpg",
    "titles": [
      "Man City & Premier League end sponsor rules dispute",
      "Man City reach settlement over legal challenge with Premier League",
      "Manchester City settle with Premier League and accept sponsorship rules are valid",
      "Man City and Premier League settle dispute over APT rules"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.95,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Manchester City and the Premier League have settled a dispute regarding Associated Party Transactions rules, which limit clubs' sponsorship deal capabilities. While this specific disagreement has been resolved, Manchester City still faces charges related to breaching other financial regulations, with the outcome of those charges still pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Missing Man Since 2021 Killed by NZ Police, Children Found Safe",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 09:35:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Tom Phillips disappeared with his three children in 2021 after losing a custody battle.",
      "<p>Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said</p><p>A fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four yea",
      "<p>This blog is now closed. Our full report is here: <a href=\"https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police\">Tom Phillips shot dead after attempted burglary, NZ police confirm</a></p><p>The mayor of Waitomo, <strong>John Robertson</strong>",
      "Tom Phillips went missing with his children in 2021, sparking a New Zealand search. His children were found unharmed.",
      "Tom Phillips, who vanished with his three children in 2021, was killed after he shot a police officer on Monday, the authorities said. His children were found safe and unharmed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/344f/live/911309e0-8ca2-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "New Zealand dad shot dead by police after years on the run with children",
      "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "Fugitive father shot dead by police – as it happened",
      "Fugitive dad killed in police shootout after years on the run with 3 kids",
      "New Zealand Police Kill Man Who Disappeared With His Children"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.854,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tom Phillips, missing since 2021 with his three children after a custody battle, was shot dead by New Zealand police during a burglary investigation in Piopio. He fired at officers, prompting the response. The children were found safe. This incident marks the end of a four-year search for Phillips, who had been hiding in New Zealand's wilderness.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Regrets Shoving Fan After Helmet Slap Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 10:58:44 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "During Sunday night's 41-40 loss to the Buffalo Bills in the season opener, Baltimore Ravens quarterback Lamar Jackson shoved a fan who slapped Jackson on the helmet. \"I just let my emotions get the best of me,\" Jackson later told reporters.",
      "DeAndre Hopkins also got slapped on the helmet by the same fan just before Jackson did",
      "<p>Watch as a Bills fan hits DeAndre Hopkins and Lamar Jackson as they celebrate their touchdown, and the Ravens&#8217; QB responds with a shove of his own in the stands.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jackson shoves fan in retaliation in Ravens' loss",
      "Lamar Jackson shoves Bills fan in retaliation for getting slapped on helmet following Ravens TD in Buffalo",
      "Bills fan, Ravens’ Jackson trade shoves after Hopkins TD"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During the season opener against the Buffalo Bills, Baltimore Ravens quarterback Lamar Jackson and teammate DeAndre Hopkins were slapped on the helmet by a fan while celebrating a touchdown. Jackson responded by shoving the fan. Jackson later expressed regret, stating his emotions got the best of him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SpaceX Buys EchoStar Spectrum for $17B, Boosts Mobile with Starlink",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 10:07:27 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Verge",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.theverge.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The deal will allow Boost Mobile subscribers to access direct-to-cell service from SpaceX’s Starlink.",
      "Dish parent company EchoStar is selling wireless spectrum licenses to SpaceX for around $17 billion, the companies announced on Monday. SpaceX says it will use the spectrum to create the “next generation” of Starlink’s cellular satellite service, which customers of the EchoStar-owned Boost Mobile wi",
      "EchoStar’s stock soars further into record territory after a $17 billion deal to sell spectrum to Elon Musk’s SpaceX."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68bee2be00f1ed1f166bcf76/0x0.jpg",
    "titles": [
      "SpaceX Purchasing Wireless Spectrum Licenses From EchoStar For $17 Billion",
      "EchoStar offloads satellite spectrum to SpaceX for $17 billion",
      "SpaceX deal sends EchoStar’s stock soaring. Why Musk is buying $17 billion in wireless spectrum."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SpaceX has acquired wireless spectrum licenses from EchoStar for $17 billion, enabling Boost Mobile subscribers to access Starlink's direct-to-cell service. This move is part of SpaceX's plan to develop the next generation of its cellular satellite service. Following the announcement, EchoStar's stock surged into record territory.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thousands Rally Across Brazil Amid Bolsonaro Trial Countdown",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 14:37:59 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The ex-president is accused of trying to overturn his election loss but his supporters say it is a witch hunt.",
      "Thousands gathered to show their support for Jair Bolsonaro in the cities of Sao Paulo, Rio de Janeiro, Porto Alegre and Brasilia. The former Brazilian president is accused of trying to overturn the 2022 election result.",
      "Tensions are heating up in Brazil as the nation enters the final week of former President Jair Bolsonaro’s trial on attempted coup charges."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ff50/live/501617c0-8cc0-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "How the coup trial of Jair Bolsonaro has divided Brazil",
      "Brazil: Bolsonaro backers rally ahead of coup trial verdict",
      "Brazilians Protest as Bolsonaro Coup Trial Nears Verdict"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.948,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Thousands rallied in Sao Paulo, Rio de Janeiro, Porto Alegre, and Brasilia, both supporting and opposing former Brazilian President Jair Bolsonaro, as his trial for attempting to overturn the 2022 election result approaches its final week.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korea to Repatriate 300 Workers Detained in ICE Raid at Hyundai-LG in Geor",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-08T09:11:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "LA Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.latimes.com"
    ],
    "snippets": [
      "South Korea arranged for workers detained in an immigration raid in Georgia to be released and flown home. Foreign Minister Cho Hyun is flying in the opposite direction to deal with the political and economic fallout.",
      "South Korea said it intends to repatriate the more than 300 of its nationals who were detained during an immigration raid on a Hyundai factory in Georgia.",
      "<p>South Korea says it has a deal for release of those caught in Hyundai Georgia raid.</p>"
    ],
    "image_url": "",
    "titles": [
      "South Korea minister heads to US following Hyundai ICE raid",
      "South Korea announces deal to repatriate workers detained in Hyundai raid",
      "South Korea, irked at U.S. raid at Hyundai plant, announces deal for detainees' release"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.864,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Over 300 South Korean workers were detained in the largest ICE raid of Trump's administration at a Hyundai-LG site in Georgia. South Korea announced plans to repatriate the workers, stating a charter plane will be sent to the U.S. once administrative procedures are completed. The South Korean government's action follows the significant immigration enforcement operation, highlighting its commitment to assisting its nationals abroad.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Quebec Aluminum Sector to Get Major Boost from $5B Fund Against US Tariffs",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 08 Sep 2025 15:42:08 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Minister of Innovation, Science and Industry Mélanie Joly says the Quebec aluminum sector will receive \"hundreds of millions of dollars\" in funding as a result of tariff impacts.",
      "Industry Minister Mélanie Joly says Quebec&#8217;s aluminum sector is likely to receive &#8220;hundreds of millions of dollars&#8221; from a $5 billion fund to help sectors slammed by U.S. tariffs. Nearly all of Canada&#8217;s aluminum is produced in Quebec. Joly says the federal government hasn&#82"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/99b5054614dff31e76707d8c2f49fd1632cc92d6ccf25670ea014497220eefc8.jpg?quality=65&strip=all",
    "titles": [
      "Joly expects aluminum sector to receive ‘hundreds of millions’ in tariff relief",
      "Joly expects aluminum sector to receive ‘hundreds of millions’ in tariff relief"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Industry Minister Mélanie Joly announced that Quebec's aluminum sector will receive \"hundreds of millions of dollars\" in support from a $5 billion fund designed to aid industries affected by U.S. tariffs. This funding aims to mitigate the impact of these tariffs, with Quebec being a major producer of aluminum in Canada.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Great North Run Apologizes for Incorrect Sunderland Image on Medals",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 12:48:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Medals given to participants use an image of Sunderland, which has no connection to the event.",
      "<p>Finisher T-shirts also feature outline of River Wear, as organisers spin medals as ‘most unique’ in event’s history</p><ul><li><p><a href=\"https://www.theguardian.com/lifeandstyle/2025/sep/08/when-maps-go-wrong-from-the-great-north-run-to-a-phantom-aldi\">When maps go wrong: from the Great North R",
      "Great North Run organisers have issued an apology, saying \"Wear sorry!\" after medals awarded to finishers of Sunday's event featured the incorrect city and river."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8ed6/live/b8ece990-8ca2-11f0-a721-a79c3c3eadc7.jpg",
    "titles": [
      "Great North Run medals show wrong city and river",
      "Great North Run apologises over ‘Newcastle map’ medals that actually show Sunderland",
      "'Wear sorry!' - Great North Run organisers apologise for Newcastle-Sunderland mix-up"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Organisers of the Great North Run apologized for mistakenly featuring Sunderland's image and the River Wear on the event's medals and finisher T-shirts, describing them as the \"most unique\" in the event's history. This error has no direct connection to the actual location of the run.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick Allowed to Visit Patriots Facility, Says Coach Vrabel",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 10:58:44 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mike Vrabel said Bill Belichick is welcome at the Patriots' facility \"to the best of my knowledge.\"",
      "<p>If Bill Belichick wants to visit the New England Patriots&#8217; facility, the current coach of the team doesn&#8217;t see it as a problem.</p>"
    ],
    "image_url": "",
    "titles": [
      "Vrabel says Belichick welcome at Patriots facility",
      "New England coach Mike Vrabel: Bill Belichick not banned from Patriots facility"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mike Vrabel, the current coach of the New England Patriots, stated that Bill Belichick is allowed to visit the team's facility, indicating there are no known restrictions against such a visit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCLA QB Pierce Clarkson Arrested on Felony Charge, Suspended from Team",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 10:58:44 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "UCLA backup quarterback Pierce Clarkson was arrested on an unspecified felony charge Friday and has been indefinitely suspended from the team.",
      "The transfer from Louisville and Ole Miss was booked ahead of the team's Week 2 game vs. UNLV"
    ],
    "image_url": "",
    "titles": [
      "UCLA suspends backup QB Clarkson after arrest",
      "UCLA suspends Pierce Clarkson, son of QB guru Steve Clarkson, following arrest prior to Week 2 game vs. UNLV"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UCLA backup quarterback Pierce Clarkson was arrested on a felony charge and indefinitely suspended from the team. The arrest occurred before UCLA's Week 2 game against UNLV. Clarkson, a transfer from Louisville and Ole Miss, is now facing legal proceedings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Newly Appointed Mahmood Focuses on UK Border Security",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 15:27:45 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Shabana Mahmood, who was appointed in last week's reshuffle, says her top priority is to 'secure' the UK's borders.",
      "Threat by Shabana Mahmood is latest effort by Labour government to tackle small-boat crossings"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed8b/live/c5ab4100-8ca6-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "UK could suspend visas for countries with no migrant return deals, new home secretary says",
      "Countries that fail to ‘play ball’ on migrant returns could lose UK visas, warns home secretary"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shabana Mahmood, recently appointed in a government reshuffle, has declared her primary focus to be on securing the UK's borders. This statement is part of the Labour government's ongoing efforts to address the issue of small-boat crossings.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ravens vs. Bills Week 1 Game Marred by Poor Play",
    "domain": "sports",
    "source_domain": "www.baltimorebeatdown.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 15:41:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.baltimorebeatdown.com"
    ],
    "snippets": [
      "A whole lot of bad and ugly to talk to about after Week 1 between the Baltimore Ravens and Buffalo Bills.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNdzFXbm9yTjQ4bmtMX2ZMSGp2T09CNC1xbG1sSWV4OXZ6U19ET203SHBna2RLUVZaMF81VkVlREJ5MlBySThZOEVIUFlCckhXZ1o5VUVPM3JvSFB6LVFpbjFVSWNsVElHZFlHazkwQXNBeTZXSXY4MEI1ZVhEa1hUUm8yQlQzZw?oc=5\" target=\"_blank\">The Good, Bad and Ugly From NFL Week 1 Includ"
    ],
    "image_url": "",
    "titles": [
      "Ravens vs Bills: The Good, The Bad, and The Ugly",
      "The Good, Bad and Ugly From NFL Week 1 Includes an Epic Finish by the Bills - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the NFL Week 1 matchup, the game between the Baltimore Ravens and Buffalo Bills was noted for its negative aspects. The specific details of what made the game \"a whole lot of bad and ugly\" were not provided, but the commentary suggests a game filled with errors or unsatisfactory play. The outcome or specifics regarding the game's score or key incidents were not mentioned in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Wins 6th Grand Slam, Draws Comparisons to Legends",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 15:16:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "BBC Sport explores Carlos Alcaraz's stunning record compared to tennis' biggest legends after his sixth Grand Slam triumph.",
      "BBC Sport explores Carlos Alcaraz's stunning record compared to tennis' biggest legends after his sixth Grand Slam triumph."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ac70/live/e06ae770-8cbf-11f0-b391-6936825093bd.jpg",
    "titles": [
      "'Playing perfectly' - how does Alcaraz rank vs tennis legends at 22?",
      "'Playing perfectly' - how does Carlos Alcaraz rank vs tennis legends at 22?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Alcaraz's impressive tennis performance has drawn comparisons to legends after winning his sixth Grand Slam. BBC Sport delves into his remarkable record, highlighting his potential to join the ranks of tennis greats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Uber to Test Driverless Cars in Germany Next Year with Momenta",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-08T02:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Uber and one of its many robotaxi partners, Momenta, will test fully driverless cars in Germany next year. The news comes as Europe continues to lag behind the US and China in the number of commercially operational robotaxi services. The companies say they will test Level 4 autonomous vehicles in Mu",
      "Momenta is one of 20 global AV partners that Uber has scooped up across its ridehail, delivery, and freight businesses. Uber says those partnerships have already generated an annualized rate of 1.5 million mobility and delivery."
    ],
    "image_url": "",
    "titles": [
      "Uber and Momenta will test fully driverless cars in Germany",
      "Uber and Momenta to test autonomous vehicles in Germany in 2026"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.809,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Uber, in partnership with Momenta, plans to test fully driverless, Level 4 autonomous vehicles in Germany next year, marking a step towards catching up with the US and China in commercial robotaxi services. This initiative is part of Uber's broader strategy, involving 20 global AV partners, aimed at enhancing its ride-hail, delivery, and freight services, which have already achieved an annualized rate of 1.5 million mobility and delivery operations.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: initiative, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Threatens Retaliation After Deadly Attack in Jerusalem Kills Six",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 11:51:40 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "PM threatens retaliation over deadliest incident in almost a year amid growing violence in occupied West Bank and Gaza",
      "<p>Two attackers shot dead by police at scene</p><p><a href=\"https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot\">Palestinian gunman kill six people at Jerusalem bus stop</a></p><p></p><p><em>Sam Jones is Madrid correspondent for the Guardian</em></p><p>Spain’s pri"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe0b53f96-2ff2-4958-b875-2cdfe23a7734.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Netanyahu vows harsh response after six killed in Jerusalem shooting",
      "Spaniard among six killed in Jerusalem shooting – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the deadliest incident in nearly a year, the Prime Minister has threatened retaliation amid escalating violence in the occupied West Bank and Gaza. In the recent attack, a Palestinian gunman killed six people at a Jerusalem bus stop. The two attackers were subsequently shot dead by police at the scene.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Japanese Prime Minister Ishiba Resigns, Signaling Leadership Crisis",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 07:21:20 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Japanese Prime Minister Shigeru Ishiba over the weekend announced he will resign.",
      "Japan, one of the world’s most stable democracies, is experiencing unusually rapid change. Shigeru Ishiba’s departure could herald a leadership crisis."
    ],
    "image_url": "",
    "titles": [
      "Japanese stocks jump as Prime Minister Ishiba set to step down",
      "Japan’s Prime Minister, Shigeru Ishiba, Resigns: What to Know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Japanese Prime Minister Shigeru Ishiba announced his resignation over the weekend, indicating a potential leadership crisis in Japan, known for its stable democracy. This marks a period of unusually rapid change for the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Top 25 Rankings Updated After Week 2 Games",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 11:20:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "www.espn.com"
    ],
    "snippets": [
      "As Week 2 has come to an end, what are the areas of concern for our Top 25?",
      "A look at the new Top 25 after Week 2."
    ],
    "image_url": "",
    "titles": [
      "Power Rankings: How did each Top 25 team look in Week 2?",
      "AP Week 2 poll reaction: What's next for each Top 25 team"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.983,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.49,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After Week 2, the new Top 25 rankings have been updated, reflecting changes based on the performances of teams. Specific areas of concern for these top-ranked teams have been identified, although the summary does not detail these concerns. The update indicates shifts in rankings due to the outcomes of Week 2 games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fall Foliage in Door County Transforms Skeptic's View on Midwest",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-08T13:42:13Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Visiting the Midwest never appealed to me until I saw photos of Door County, Wisconsin, during the fall. A trip there changed everything for me.",
      "A fall trip to Door County, Wisconsin, in the fall was so incredible and had amazing foliage. It changed my perspective on traveling to the Midwest."
    ],
    "image_url": "https://i.insider.com/66bb644d5da406397bf55370?format=jpeg",
    "titles": [
      "I never had any desire to visit the Midwest until a fall trip to Wisconsin changed my entire outlook on travel",
      "I never had any desire to visit the Midwest until a fall trip to Door County changed my entire outlook on travel"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.95,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A person who initially had no interest in visiting the Midwest changed their perspective after a trip to Door County, Wisconsin. The fall foliage in Door County was cited as the pivotal factor for this change, making the trip an incredible experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Visible Time Crystal Created; CRISPR Efficiency Tripled",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 17:09:24 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Physicists at the University of Colorado Boulder have created the first time crystal that humans can actually see, using liquid crystals that swirl into never-ending patterns when illuminated by light. This breakthrough builds on Nobel laureate Frank Wilczek’s 2012 theory of time crystals—structures",
      "Northwestern scientists have developed a new nanostructure that supercharges CRISPR’s ability to safely and efficiently enter cells, potentially unlocking its full power to treat genetic diseases. By wrapping CRISPR’s tools in spherical DNA-coated nanoparticles, researchers tripled gene-editing succ"
    ],
    "image_url": "",
    "titles": [
      "Scientists just made the first time crystal you can see",
      "Scientists just made CRISPR three times more effective"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.673,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.413,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Physicists at the University of Colorado Boulder have developed the first visible time crystal, which forms endless patterns in liquid crystals under light, advancing Frank Wilczek's 2012 theory. Concurrently, Northwestern scientists have enhanced CRISPR's efficiency and safety in gene editing by encapsulating its components in DNA-coated nanoparticles, tripling its success rate. These innovations mark significant advancements in physics and genetic engineering.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  }
]