[
  {
    "title": "France's PM Lecornu Resigns After Less Than 24 Hours Amid Political Crisis",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 06:07:55 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Financial Times",
      "New York Times",
      "BBC",
      "NPR",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Facing criticism from all sides, France's new prime minister Sébastien Lecornu resigned less than 24 hours after naming his government and after less than a month in office, plunging the country into a deep political crisis.",
      "He criticised the \"partisan appetites\" of political factions, who he said had refused to compromise.",
      "French Prime Minister Sebastien Lecornu has stepped down, blaming deep divisions in parliament.",
      "President Emmanuel Macron accepts resignation of newly appointed prime minister after criticism over cabinet lineup.",
      "Sébastien Lecornu quits after rightwing allies indicated they could withdraw from his government",
      "<p>Sébastien Lecornu quits, blaming political “egos”, after Emmanuel Macron unveiled largely unchanged cabinet lineup</p><p>France’s political crisis has deepened after the new prime minister dramatically resigned within hours of appointing a government.</p><p>Sébastien Lecornu was the third French ",
      "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor.",
      "Sébastien Lecornu stepped down less than 24 hours after he had formed his cabinet."
    ],
    "image_url": "",
    "titles": [
      "France's prime minister resigns after less than a month in office",
      "French Prime Minister Sébastien Lecornu resigns after less than a month",
      "France’s prime minister resigns over divisions after just weeks in office",
      "France’s new Prime Minister Lecornu resigns hours after naming cabinet",
      "France’s prime minister resigns less than a month after appointment",
      "France’s PM resigns after less than a month amid widespread criticism of new cabinet",
      "Prime minister of France resigns hours after naming new government",
      "French Prime Minister Sébastien Lecornu Resigns"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.957,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.876,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's newly appointed Prime Minister, resigned less than 24 hours after forming his government and less than a month in office, citing deep political divisions and criticism from various factions, including threats from rightwing allies to withdraw support. His resignation, accepted by President Emmanuel Macron, follows criticism over the largely unchanged cabinet lineup and plunges the country into a political crisis. Lecornu, a former defense minister, had assumed the role after a no-confidence vote ousted his predecessor.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 05:55:46 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "The Guardian",
      "New Scientist",
      "Deutsche Welle",
      "Phys.org",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.newscientist.com",
      "phys.org",
      "www.ft.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi were honored for research into how the body helps the immune system avoid attacking your own tissues instead of foreign invaders.",
      "The international team discovered how the immune system is kept in check to prevent it attacking the body.",
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control",
      "Three scientists honoured for research on what prevents immune cells from attacking the body",
      "<p>Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi worked on how the immune system can be prevented from harming the body</p><p>The Nobel prize in physiology or medicine 2025 has been awarded to three scientists for their work on how the immune system is kept in check and prevented from attacking",
      "A US-Japanese trio on Monday won the Nobel Prize in Medicine for research into how the immune system is kept in check by identifying its \"security guards,\" the Nobel jury said."
    ],
    "image_url": "",
    "titles": [
      "The medicine Nobel Prize goes to 3 scientists for work on peripheral immune tolerance",
      "Nobel Prize for medicine awarded to immune system researchers",
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance",
      "Nobel Prize in medicine awarded for immune system breakthroughs",
      "Nobel prize in medicine awarded to scientists for immune system research",
      "Medicine Nobel to trio who identified immune system's 'security guards'"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.953,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.876,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Deploys National Guard to Chicago, Faces Legal Challenge Over Portland",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 08:39:54 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "LA Times",
      "Axios",
      "Deutsche Welle",
      "BBC",
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.latimes.com",
      "www.bbc.com",
      "news.google.com",
      "www.aljazeera.com",
      "fortune.com",
      "www.forbes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The decision late on Sunday comes a day after the same judge barred the deployment of troops from the state of Oregon.",
      "The deployment would mark the latest escalation of Donald Trump’s use of US federal intervention in Democrat-led cities.",
      "A judge has issued a ruling temporarily blocking Donald Trump's effort to send the National Guard to Portland. Trump says troops are needed to clamp down on protests against federal immigration operations in the city.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQSU83ZkFnMmR4eDlDN2l1Rk1DbVNjclFRaHM4VWZWcG1UWUJkbERQTE13MDBHTWVNRFRDcE1tWTc3NGx2TFJJTHRHN2pGQXROZ3FzR2I5Ny13eGpHSkZwVnBnOTA0YXU2bl9NUDdCbGtYZzRoS1Rvb05MMGVWYVJqQjRRNTJ1aUpIZG9WRFRaN3o?oc=5\" target=\"_blank\">Judge temporarily blocks Trump f",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SNEQwYU1yYjl5Z2JlOXhkTWVGR0V1QXVXNTZXZTlOdEhPNU50MXlkOHNBcE5hVDBKeV9uYmJaUGxjLVZjdjFoaVUwbk91WTZvSkY0QjlSR0VINGF3R0tXZTNWZjFSempoclpWblNGcktuNERETmVJZw?oc=5\" target=\"_blank\">Newsom says Trump sent California National Guard troops to Oregon",
      "<p>A federal judge barred Trump from deploying National Guard troops to Oregon after the California Guard was sent to the state Sunday.</p>",
      "Trump attempted to deploy the California and Texas National Guard in Portland after a judge halted his bid to send Oregon National Guard troops to the city.",
      "“This action circumvents the court’s decision and threatens to inflame a community that has remained peaceful,” Portland's mayor said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4846/live/fcbf6450-a245-11f0-98b7-cdc4bf2f32f3.jpg",
    "titles": [
      "Judge blocks Trump from sending troops from California to Portland",
      "Gov Newsom says Trump is sending California National Guard troops to Oregon",
      "Judge blocks Trump's attempts to deploy troops to Portland",
      "Judge temporarily blocks Trump from any sending National Guard troops to Oregon - Axios",
      "Newsom says Trump sent California National Guard troops to Oregon - Axios",
      "Judge blocks Trump from deploying California National Guard — or any Guard troops — in Oregon",
      "Judge Blocks Trump’s Deployment Of National Guard Troops From Any State In Oregon",
      "Trump sends California National Guard to Oregon after judge blocks him from using that state’s troops in Portland"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.909,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.842,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump authorized the deployment of 300 Illinois National Guard members to Chicago as part of his immigration and crime crackdown, while also attempting to send troops to Portland, Oregon. However, the deployment to Portland was blocked by a federal judge. In response, Trump is trying to send 300 California National Guard members instead, leading California Governor Newsom to announce plans to sue the White House. This marks an escalation in Trump's use of federal intervention in Democrat-led cities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Optimistic on Israel-Hamas Talks Amid Gaza Violence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "German Foreign Minister Johann Wadephul is heading to Egypt and Israel as negotiations over US President Donald Trump's plan for Gaza kick off. DW has the latest.",
      "<p>Negotiators from the US, Israel and Hamas are set to begin talks, as the US president said the first phase should be completed this week</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/05/israel-continues-gaza-bombardment-trump-plan-negotiators-arrive-in-cairo\">Israel continues ",
      "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arri",
      "<p>Discussions in Egypt expected to focus on path to peace and release of hostages, after Israel killed dozens of people in just over 24 hours. Plus, why are young Americans eating so early?</p><p>Good morning.</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release o",
      "Israel and Hamas are set to gather in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock.",
      "Though significant issues remain to be hashed out between Israel and Hamas, some are saying that after two years of death and destruction, a breakthrough may be near."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Gaza ceasefire talks to start in Egypt",
      "Gaza ceasefire talks live: Israeli airstrikes continue with negotiations due to begin in Egypt",
      "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "Trump urges negotiators to ‘move fast’ in run-up to Gaza ceasefire talks | First Thing",
      "Gaza ceasefire talks to begin in Egypt, as Israel strikes enclave",
      "Gaza Peace Talks Are Set to Take Place in Egypt"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.903,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump expressed optimism about the speed of negotiations between Israel and Hamas, focusing on the release of hostages and ending the conflict. This comes as talks are set to begin, following a deadly day in Gaza where 63 people were killed by Israeli forces. Trump has urged for quick action in these discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots Upset Unbeaten Bills in Week 5 NFL Action",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 07:07:10 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Our NFL Nation reporters answer the biggest questions out of each game. Here's what we learned from Week 5.",
      "Here are the Week 5 grades for every team that played",
      "<p>Week 5 was a good one for statement wins, but none bigger or louder than the Patriots&#8217; gutsy 23-20 effort over the Bills. Emily Sadler has more takeaways from a busy Sunday of football. </p>"
    ],
    "image_url": "",
    "titles": [
      "Questions, takeaways off every NFL Week 5 game: Patriots shock Bills; Bucs and Titans win thrillers",
      "NFL Week 5 grades: Patriots earn 'A-' for upset win over Bills, Ravens get a big 'F' for ugly loss",
      "NFL Week 5 Takeaways: Maye delivers statement performance as Patriots top Bills"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 5 of the NFL, the New England Patriots defeated the previously unbeaten Buffalo Bills, marking a significant upset. NFL Nation reporters provided insights and grades for every team that played during the week, highlighting key performances and outcomes from the games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Carmaker Blames Shortfall on Economy, Trump Policies, Cyber-Attack",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 10:53:04 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Britain’s Aston Martin on Monday warned of a steeper full-year loss than market consensus, citing U.S. tariff turbulence.",
      "British carmaker blames global economic slowdown and Donald Trump’s trade policies for shortfall",
      "<p>Carmaker blames weaker demand on Trump policies amid supply chain pressures after Jaguar Land Rover cyber-attack</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news\">B"
    ],
    "image_url": "",
    "titles": [
      "Aston Martin shares fall 10% as luxury carmaker issues fresh profit warning on tariff turmoil",
      "Aston Martin issues profit warning citing US tariff impact",
      "Aston Martin warns on profits amid US tariffs and seeks ‘proactive support’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.709,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A British carmaker attributes its financial shortfall to the global economic slowdown and Donald Trump's trade policies, citing weaker demand and supply chain pressures exacerbated by a cyber-attack on Jaguar Land Rover.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia School Collapse Death Toll Hits 50; Search for Missing Continues",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 22:21:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Rescue teams search for survivors in Indonesia as the boarding school collapse death toll rises to at least 40.",
      "A week after a school building collapsed in Indonesia, rescuers are still searching for missing people. So far, at least 50 bodies have been recovered.",
      "<p>Excavators used to remove rubble while 14 people reportedly still unaccounted for and police allege building work was being carried out without a permit</p><p>Indonesian rescuers searching for missing students after a prayer hall at an <a href=\"https://www.theguardian.com/world/2025/oct/04/indone"
    ],
    "image_url": "",
    "titles": [
      "Parents see tragedy, not fault, in Indonesia school collapse",
      "Death toll from Indonesia school collapse climbs to at least 50",
      "Indonesia school collapse death toll reaches 54 as search for missing students continues"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.749,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The collapse of the Al Khoziny Islamic boarding school in Indonesia has become the country's deadliest disaster this year, with the death toll rising to at least 50. Rescue teams continue their search for survivors, with 14 people still missing. The collapse occurred while building work, reportedly conducted without a permit, was underway. Excavators are being used to remove rubble as the search for missing students persists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yesavage's No-Hit Game and Guerrero's Slam Propel Blue Jays to 2-0 ALDS Lead",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:55:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Global News",
      "CBS Sports"
    ],
    "domains": [
      "globalnews.ca",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Yesavage allowed no hits and struck out 11 of the 18 batters he faced on Sunday",
      "Trey Yesavage said he was built for this kind of opportunity. On Sunday afternoon, he went out and proved it.",
      "Vladimir Guerrero Jr. hit a grand slam, Daulton Varsho hit two of Toronto's five homers and Trey Yesavage was masterful in his fourth career big-league start as the Blue Jays defeated the New York Yankees 13-7 on Sunday to take a 2-0 lead in the American League Division Series.",
      "<p>Trey Yesavage recorded a franchise-best 11 strikeouts through 5.1 hitless innings, Vladimir Guerrero Jr. hit a grand slam, and Daulton Varsho recorded two homers and two doubles to lead the Toronto Blue Jays to a 13-7 win over the New York Yankees.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/b507578d-88bc-4ab1-a6b8-1e7cd3ce0061/yesavage-getty-1.png",
    "titles": [
      "Trey Yesavage shuts down Yankees in ALDS Game 2 as Blue Jays rookie sets franchise strikeout record",
      "Blue Jays outscore Yankees 13-7 in Game 2 of ALDS",
      "Blue Jays beat Yankees 13-7 in Game 2 of ALDS",
      "MLB Game 2 Highlights: Blue Jays 13, Yankees 7"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Trey Yesavage delivered a no-hit performance with 11 strikeouts in his fourth big-league start, leading the Toronto Blue Jays to a 13-7 victory over the New York Yankees. This win gave the Blue Jays a 2-0 lead in the ALDS. Vladimir Guerrero Jr. contributed with a grand slam, while Daulton Varsho hit two of Toronto's five home runs. The team's performance has been historically significant, matching their home run tally (eight) with fewer strikeouts (seven) across two games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's National Guard Deployment to Portland; SCOTUS Eyes Presiden",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 07:25:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "A judge issues an order to stop Trump's latest attempt to deploy the National Guard to Oregon. And, the Supreme Court opens a new term with justices tackling cases testing presidential power.",
      "<p>Ruling by US District Judge Karin Immergut blocks any deployment to Portland for two weeks as legal wrangling continues</p><p><strong>In 1999, Bill Clinton ascended one of the highest summits in <a href=\"https://www.theguardian.com/us-news/virginia\">Virginia</a> to announce that “the last, best u"
    ],
    "image_url": "",
    "titles": [
      "Judge blocks deployment of National Guard to Oregon. And, the Supreme Court's new term",
      "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A US District Judge, Karin Immergut, issued an order halting Trump's attempt to deploy the National Guard to Portland, Oregon, for two weeks amid ongoing legal disputes. Concurrently, the Supreme Court began a new term focusing on cases related to presidential power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nico O'Reilly Replaces Injured Reece James in England Squad",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 10:57:27 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "sportsview.co.uk",
      "www.bbc.com",
      "footballtoday.com"
    ],
    "snippets": [
      "Manchester City defender Nico O'Reilly receives his first call up to the England squad following the withdrawal of Reece James.",
      "Reece James has withdrawn from the England squad after sustaining an injury during Chelsea’s dramatic 2-1 win over Liverpool at Stamford Bridge, with Manchester City’s Nico O’Reilly earning his ...",
      "Chelsea defender Reece James has withdrawn from the England national team after picking up an injury in the weekend clash against Liverpool.The 25-year-old sustained the issue during Chelsea’s 2-1 v..."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/20a7/live/8d4546c0-a2a0-11f0-94eb-2d0a64a6f1c0.jpg",
    "titles": [
      "O'Reilly replaces injured James in England squad",
      "Reece James withdraws from England squad due to injury, replaced with City’s O’Reilly",
      "Reece James pulls out of England squad after injury setback"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.611,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nico O'Reilly of Manchester City has been called up to the England squad for the first time, replacing Chelsea's Reece James, who withdrew due to an injury sustained in a 2-1 victory over Liverpool.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 5 Picks and Fantasy Insights Released",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 11:14:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "jaguarswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Mike Tierney has revealed his Kansas City vs. Jacksonville picks for the Week 5 NFL matchup on 'Monday Night Football'",
      "The SportsLine projection model has revealed its Kansas City vs. Jacksonville picks for the 2025 NFL Week 5 Monday Night Football game",
      "Jimmie Kaylor shares his top NFL DFS picks, daily fantasy optimal lineups, and NFL DFS stacks for Jaguars vs. Chiefs on 'Monday Night Football'",
      "SportsLine expert Mike Tierney has revealed his New England vs. Buffalo picks for the Week 5 NFL matchup on 'Sunday Night Football'",
      "As the Jaguars vs. Chiefs Monday Night game unfolds, here are the three big storylines to watch for."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/06/5e6e86d8-4c13-49c8-8406-87f0bf1e4062/trevor-lawrence-jacksonville-jaguars-imagn-images-1.jpg",
    "titles": [
      "Monday Night Football prediction, odds, line, spread: Jaguars vs. Chiefs picks by expert on 33-17 run",
      "Chiefs vs. Jaguars prediction, odds, start time: 2025 NFL Week 5 Monday Night Football picks from proven model",
      "NFL DFS, Monday Night Football: Chiefs vs. Jaguars daily fantasy picks, lineups, advice on DraftKings, FanDuel",
      "Sunday Night Football prediction, odds, spread, time: Patriots vs. Bills picks by Buffalo expert on 26-14 roll",
      "3 big storylines for Jaguars vs. Chiefs Monday Night matchup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine expert Mike Tierney and the SportsLine projection model have released their picks for the NFL Week 5 matchups, including Kansas City vs. Jacksonville on Monday Night Football and New England vs. Buffalo on Sunday Night Football. Additionally, Jimmie Kaylor provides DFS advice for the Jaguars vs. Chiefs game. The focus is on predictions and fantasy football insights for these key games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Term Begins, Presidential Power Limits in Focus",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 10:50:46 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Today, we look ahead at the potential consequences of the Supreme Court term that begins today.",
      "<p>As a new term begins, the justices have continually failed to provide a check on presidential power – with disastrous consequences</p><p>Two 0f the world’s best-known authoritarian leaders – Viktor Orbán, <a href=\"https://www.theguardian.com/world/hungary\">Hungary</a>’s prime minister, and Recep "
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/06/multimedia/06themorning-nl-lede-qczf/06themorning-nl-lede-qczf-mediumSquareAt3X.jpg",
    "titles": [
      "President Trump and the Supreme Court",
      "Why does the supreme court keep bending the knee to Trump? | Steven Greenhouse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Supreme Court's new term starts today, amid concerns over its failure to limit presidential power, which critics argue has had negative consequences. This term's outcomes could have significant implications, especially in the context of global authoritarian trends highlighted by leaders like Hungary's Viktor Orbán and Turkey's Recep Tayyip Erdoğan.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acclaimed Author Jilly Cooper Passes Away After Fall",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 09:49:14 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>The author of 18 ‘bonkbuster’ novels including Riders, Rivals and Bella has died following a fall</p><p><a href=\"https://www.theguardian.com/global/2025/oct/06/share-your-tributes-and-memories-of-rivals-author-jilly-cooper\">Share your memories of Jilly Cooper</a></p><p>Jilly Cooper has died at th",
      "A prolific writer and keen observer, she sold millions of copies of her juicy, sometimes racy “Rutshire Chronicles” series."
    ],
    "image_url": "https://i.guim.co.uk/img/media/2ba9d10a6674a76cf56a5aa7802bf090fbfcabff/0_2574_4400_3519/master/4400.jpg?width=140&quality=85&auto=format&fit=max&s=2d7099e8bb526c29534524dc18934bb8",
    "titles": [
      "Jilly Cooper, author of Rivals and Riders, dies aged 88",
      "Jilly Cooper, British Romance Novelist, Is Dead at 88"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jilly Cooper, the acclaimed author known for her \"Rutshire Chronicles\" series, including popular novels such as \"Riders\" and \"Rivals,\" has passed away following a fall. Cooper was celebrated for her engaging storytelling and vibrant characters, selling millions of copies worldwide. Fans and readers are invited to share their memories and tributes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fifth Third Bancorp to Acquire Comerica in $10.9B All-Stock Deal",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 11:35:33 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Fifth Third Bancorp said Monday it will acquire fellow regional bank Comerica in an all-stock deal worth $10.9 billion.",
      "Fifth Third said combined company will operate in some of the fastest-growing areas of the country such as Texas."
    ],
    "image_url": "",
    "titles": [
      "Fifth Third Bancorp to buy Comerica for $10.9 billion in all-stock deal",
      "Fifth Third paying $10.9 billion for Comerica as wave of bank mergers builds"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Fifth Third Bancorp said Monday it will acquire fellow regional bank Comerica in an all-stock deal worth $10.9 billion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Host UFC Fight at White House on 80th Birthday",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 08:15:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "US President Donald Trump announces the &#039;big UFC fight&#039; on the White House grounds will now take place on June 14.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQbC10Z3g4dkctYWdWVHFsLTd3ckszOVhjVlRSVWItZ1FEMEhwb0ppMjZTQk96ZGFGbnpoaDdwaUprbE5XTVdMOHluakJubFdGbmRPak1QNjZ4NEN3ZEdLUExTcFNpZVQ5bzNSTWlsZWVxNTJkQThEWnFmZmw4WlJ5T1BXalBtRlNEaEE?oc=5\" target=\"_blank\">Trump to host UFC fight at White House o"
    ],
    "image_url": "",
    "titles": [
      "Trump says UFC fight at White House to be staged on his 80th birthday",
      "Trump to host UFC fight at White House on his 80th birthday - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.92,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced that an Ultimate Fighting Championship (UFC) fight will be hosted at the White House on his 80th birthday. This event was previously scheduled for July 4 but has been confirmed for Trump's birthday by both him and UFC president Dana White.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Best-Selling Author Jilly Cooper Dies at 88",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 10:34:01 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The best-selling author of novels including Rivals wrote glamorous tales of love, lust, and horses.",
      "<p>Author whose bestselling novels, including Riders and Rivals, were set deep in an English countryside where the natives pursued land, sports, and each other, with lust and gusto</p><p>The writer Jilly Cooper, who has died aged 88, was a Georgian at heart, with all the 18th century’s preference fo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1589/live/cdcadfd0-a29f-11f0-94eb-2d0a64a6f1c0.jpg",
    "titles": [
      "Dame Jilly Cooper: Undisputed queen of the joyous British bonkbuster",
      "Dame Jilly Cooper obituary"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jilly Cooper, the best-selling author known for her novels such as \"Riders\" and \"Rivals,\" which depicted love, lust, and equestrian themes set in the English countryside, has passed away at the age of 88. Her work was celebrated for its vibrant portrayal of the Georgian era's indulgences.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former England Rugby Captain Lewis Moody Diagnosed with MND at 47",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 07:10:05 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Former World Cup winner, 47, tells BBC he has been diagnosed with motor neurone disease</p><p>Lewis Moody, the former England rugby captain and 2003 World Cup winner, has been diagnosed with motor neurone disease.</p><p>The 47-year-old told the BBC he was having trouble accepting what the news me",
      "Former England captain Lewis Moody has revealed he has been diagnosed with motor neurone disease."
    ],
    "image_url": "https://i.guim.co.uk/img/media/eb675fc9b4071bf391b36c26ac8ee946e4119851/166_0_2902_2324/master/2902.jpg?width=140&quality=85&auto=format&fit=max&s=9d025d31227783c9eacdbcde18e3c657",
    "titles": [
      "Former England rugby captain Lewis Moody reveals MND diagnosis",
      "Former England captain Moody diagnosed with motor neurone disease"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lewis Moody, the former England rugby captain and 2003 World Cup winner, has announced in an interview with BBC Breakfast that he has been diagnosed with motor neurone disease (MND) at the age of 47.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "French Court to Rehear Rape Case After Convict Appeals Sentence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:35:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The rape trial that shocked the world will be discussed in a French court once again, after one of the men convicted of raping Gisele Pelicot appealed, insisting that he is \"not a rapist.\"",
      "The Frenchwoman who became a feminist icon will confront one of the men convicted after her husband drugged her and invited them to rape her over nearly 10 years."
    ],
    "image_url": "",
    "titles": [
      "France: Gisele Pelicot to face court again due to appeal",
      "What to Know as Gisèle Pelicot Returns to Court for Man’s Appeal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A French court is set to revisit a high-profile rape case after a convicted man appealed his sentence, claiming innocence. The case, which gained global attention, involves a Frenchwoman, Gisele Pelicot, who was raped over nearly a decade after her husband drugged her and allowed other men to assault her. Pelicot, now a feminist icon, will face one of the convicted individuals in court again due to his appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots Beat Bills 23-20, End NFL's Undefeated Streak",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 06:27:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The New England Patriots defeated the Buffalo Bills to leave the NFL without an unbeaten team just five weeks into the season.",
      "<p>Drake Maye led the Patriots on a 37-yard drive to set up Andy Borregales&#8217; 52-yard field goal with 15 seconds left, and New England beat the Buffalo Bills 23-20 on Sunday night, leaving the NFL without an undefeated team five weeks into the season.</p>"
    ],
    "image_url": "https://e2.365dm.com/25/10/1920x1080/skysports-new-england-patriots_7043586.jpg?20251006080030",
    "titles": [
      "Patriots upset Bills to leave NFL without an unbeaten team",
      "Drake Maye leads Patriots to win over Bills, leaving NFL without an unbeaten team"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.868,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New England Patriots won against the Buffalo Bills 23-20, with Andy Borregales scoring a 52-yard field goal with 15 seconds remaining. This victory, led by Drake Maye's 37-yard drive, marked the end of the NFL having an undefeated team just five weeks into the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seattle Ties Series 1-1 Against Detroit, Rodríguez Clutch in Game 2",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 03:19:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Seattle and Detroit are meeting for the first time ever in the postseason",
      "New York and Toronto will continue their best-of-five series on Tuesday",
      "<p>Julio Rodríguez hit a tiebreaking RBI double in the eighth inning and the Seattle Mariners beat the Detroit Tigers 3-2 in Game 2 of their AL Division Series on Saturday to even the series.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/06/0aaa92c9-7c37-4d89-a4e4-dc20bea2e88e/100525-jorgepolanco.jpg",
    "titles": [
      "Mariners vs. Tigers ALDS schedule, prediction, odds, TV channel as Seattle evens up series with Game 2 win",
      "Yankees vs. Blue Jays ALDS schedule, prediction, odds, TV channel as AL East foes face off",
      "Mariners beat Tigers, Skubal to tie series"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.831,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Seattle and Detroit faced off in the postseason for the first time, with their series now tied 1-1 after Seattle's 3-2 win in Game 2 of the AL Division Series. Julio Rodríguez delivered a tiebreaking RBI double in the eighth inning. The series continues with RHP Logan Gilbert starting for Seattle against Detroit's RHP Jack Flaherty in Game 3. New York and Toronto are also set to continue their best-of-five series on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nikkei 225 Surges 4.6% on Fiscal Spending Hopes; Yen Declines",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T03:27:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "The Nikkei 225 Index was up 4.6% while the yen slumped. Takaichi is considered to have an expansionary fiscal agenda for the world's fourth-largest economy.",
      "Investors expect more fiscal spending and pressure on central bank to keep interest rates low"
    ],
    "image_url": "",
    "titles": [
      "Japan's stocks surge after Takaichi wins party vote",
      "Japanese stocks soar and yen tumbles after Takaichi wins ruling party leadership"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Nikkei 225 Index rose by 4.6% amid expectations of increased fiscal spending and continued low interest rates, following indications of an expansionary fiscal agenda by Takaichi for Japan, the world's fourth-largest economy. Concurrently, the yen experienced a decline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Titans Score Unusual TD After Cardinals Fumble Interception",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:47:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The football gods looked favorably upon Tennessee multiple times in Week 5",
      "<p>Watch as Tennessee Titans quarterback Cam Ward throws an interception which is fumbled by the Arizona Cardinals and then recovered by Tyler Lockett in the end zone for a wild touchdown score.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/9f5be22a-2729-45d7-ba10-f346e7359c5d/titans.jpg",
    "titles": [
      "Titans turn Cardinals' interception into Tennessee touchdown in one of the wildest plays of the year",
      "Titans score TD after Cardinals interception turns into fumble recovery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.772,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 5, the Tennessee Titans experienced a remarkable play when quarterback Cam Ward's interception was fumbled by the Arizona Cardinals and subsequently recovered by Tyler Lockett in the end zone, resulting in an unexpected touchdown for the Titans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown May Impact Wall Street, NHL Season Begins with Key Storyline",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 16:11:13 GMT",
    "source": "CNBC",
    "sources": [
      "Sportsnet",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The longer the shutdown drags on, the more impact it may have on Wall Street.",
      "<p>A fresh NHL season is set to begin — and with it comes plenty of questions. Sportsnet&#8217;s Emily Sadler breaks down nine storylines worth keeping an eye on.</p>"
    ],
    "image_url": "",
    "titles": [
      "Here are the 3 big things we're watching in the stock market this week",
      "Nine NHL storylines we’re watching this season"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.645,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.591,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The ongoing government shutdown is expected to increasingly affect Wall Street the longer it continues. Meanwhile, a new NHL season is starting, with Sportsnet's Emily Sadler highlighting nine key storylines to watch.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Advisor Hopes for Deal to End Shutdown Amid Tax Credit Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:39:36 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNU0pXd1FFQ2xva1lRY3Y5WGNlbjkyekVyY184TGdRZjNiMmxEajk2ZFdUcFRqYmtpQ1gxb1QxYVd4akVnMUluUC1GWDBuckdpQ2ZLQ016eGJxOExQSnJBVThjUHAwdGdHcnhiWVduc0xuV3hnSEd0SG54QzV3bEI4VlA5ZTFiZ00?oc=5\" target=\"_blank\">Trump adviser: Layoffs will start if shutdow",
      "Democrats are holding firm on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in funding legislation."
    ],
    "image_url": "",
    "titles": [
      "Trump adviser: Layoffs will start if shutdown negotiations are \"going nowhere\" - Axios",
      "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.638,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.59,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top White House economic advisor Kevin Hassett expressed hope for an agreement to end the government shutdown and prevent layoffs. The deadlock persists as Democrats demand a permanent extension of enhanced premium tax credits in the funding legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rockets' Substitute Awaits Contract, Center Enhances Scoring Skills",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 21:42:32 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "The Rockets super sub still remains without a contract extension.",
      "The Rockets big man made major improvements defensively last season; now he must regain his scoring touch."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e312076d88942d9ec2cfd7/0x0.jpg?width=960",
    "titles": [
      "What’s Ahead For Tari Eason In 2025-2026?",
      "What’s Ahead For Alperen Sengun In 2025-2026?"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.803,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Rockets' key substitute player has not yet secured a contract extension. Meanwhile, the team's prominent center has shown significant defensive improvement last season and is now focused on improving his scoring abilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]