[
  {
    "title": "UN Report Accuses Israel of Genocide in Gaza, Calls for Action",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 10:26:15 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The report issued Tuesday by experts commissioned by the United Nations' Human Rights Council calls on the international community to end the genocide and take steps to punish those responsible.",
      "The panel finds that four of the five genocidal acts defined under international law have been carried out against Palestinians during the war.",
      "UN inquiry Chairwoman Navi Pillay explains why Israel’s war on Gaza meets the legal definition of genocide.",
      "A UN report has accused Israel of genocide against Palestinians, citing bombings of civilians and starvation.",
      "A UN commission of inquiry concluded that Israel has committed genocide against Palestinians in Gaza. Israel slammed the report as \"false and fabricated\" and accused the commission members of being Hamas proxies.",
      "<p>Report cites scale of killings and aid blockages, and calls on member countries to punish those responsible</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Middle",
      "In earlier reports, the commission found that Israel had committed war crimes and crimes against humanity in its conflict with Hamas, but stopped short of calling it genocide. Israel denounced the accusation as “fake.”"
    ],
    "image_url": "",
    "titles": [
      "A U.N. inquiry accuses Israel of genocide in Gaza, joining a rising chorus",
      "Israel has committed genocide in Gaza, UN commission of inquiry says",
      "UN: Israel’s war on Gaza is genocide",
      "What the UN inquiry says about Israel’s genocide on Gaza",
      "Israel has committed genocide in Gaza, UN commission says",
      "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "Israel Is Committing Genocide in Gaza, U.N. Inquiry Says"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.964,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.868,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A UN Human Rights Council-commissioned report has accused Israel of committing genocide against Palestinians in Gaza, finding that four out of five genocidal acts defined under international law have occurred. The report, which Israel has denounced as \"false and fabricated,\" calls for international action to punish those responsible. This marks an escalation from previous findings that identified war crimes and crimes against humanity but did not label the actions as genocide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Sues NY Times for $15B, Alleging Defamation in Epstein Note Coverage",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 06:00:40 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Global News",
      "CNBC",
      "The Guardian",
      "ABC News",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "globalnews.ca",
      "www.theguardian.com",
      "www.dw.com",
      "www.cnbc.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "President Trump filed a $15 billion defamation lawsuit against <em>The New York Times</em> and four of its journalists, accusing them of harming his business and personal reputation.",
      "US President Donald Trump has filed a multibillion-dollar lawsuit against the newspaper. The filing comes a week after it published a suggestive note that Trump reportedly wrote to Jeffrey Epstein.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPM2lFVERwWjdFa2JBZlAzcy0wclBzdzVLY3hvSjJreDBKRmJhMXhKdGZqYjk5d0JUQmRXQ05vU0pSVDBpWGw5MGxkTjlMNzk4djRjdElNUno4TWtmN2d5ekpjYXVfcW1HYVJncFBOa1dES2RodGhmQUM2U0hjcFpHdFNoMnNQSHJRNmc?oc=5\" target=\"_blank\">Trump files $15B lawsuit against the New",
      "President Trump has sued The New York Times and Penguin Random House for $15 billion, claiming they sought to damage his reputation ahead of the 2024 election.",
      "Trump has initiated a flurry of defamation lawsuits against media companies, accusing them of false or misleading coverage.",
      "<p>Title says it will not be ‘deterred by intimidation tactics’ after US president announces latest legal action </p><p>Donald Trump has filed a $15bn defamation lawsuit against the New York Times in his latest use of legal action targeting a major media outlet.</p><p>The US president accused it of ",
      "Trump has gone after other media outlets, including filing a $10 billion defamation lawsuit against the The Wall Street Journal and media mogul Rupert Murdoch."
    ],
    "image_url": "",
    "titles": [
      "Trump files $15 billion defamation lawsuit against 'New York Times'",
      "Trump sues The New York Times for defamation",
      "Trump files $15B lawsuit against the New York Times - Axios",
      "Trump files $15B defamation suit against New York Times, Penguin Random House",
      "Trump sues The New York Times for $15 billion, alleging defamation and libel",
      "Donald Trump files $15bn lawsuit against the New York Times",
      "Donald Trump sues New York Times for $15 billion in defamation lawsuit"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.879,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump has filed a $15 billion defamation and libel lawsuit against The New York Times and four of its journalists in Florida, accusing the newspaper of being a \"mouthpiece\" for the Democratic party. This legal action follows a recent publication by the newspaper of a note Trump allegedly wrote to Jeffrey Epstein, which Trump claims is false. This lawsuit is part of Trump's broader campaign of litigation against media organizations over their coverage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Drops Terrorism Charges Against CEO's Accused Killer, Murder Trial Proceed",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 14:27:27 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "Financial Times",
      "The Guardian",
      "Global News",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "www.forbes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Judge Gregory Carro also ruled a second-degree murder charge against Mangione could stand during a hearing on Tuesday.",
      "Mangione will still be charged with the murder of UnitedHealthcare CEO Brian Thompson, who was gunned down outside a Manhattan hotel in December.",
      "US court rules evidence on terrorism counts is ‘legally insufficient’ but murder trial can go ahead",
      "<p>Man accused in killing of Brian Thompson will not face state charges of first- and second-degree murder but will still face other charges</p><p>Luigi Mangione scored a major legal victory on Tuesday with a judge dismissing the two top state charges against him: first-degree murder and second-degr",
      "Luigi Mangione has become a folk hero to some Americans who decry steep healthcare costs.",
      "The man accused of killing UnitedHealthcare CEO Brian Thompson will still face other charges on the indictment, including second degree murder."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a978/live/5eeb3990-930c-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Judge dismisses terrorism charges against Luigi Mangione",
      "Luigi Mangione has state terrorism charges dropped",
      "Judge dismisses state terrorism charges against Luigi Mangione",
      "Judge dismisses two top charges against Luigi Mangione in UnitedHealthcare CEO shooting",
      "Judge drops terrorism charges against Luigi Mangione in Brian Thompson killing",
      "Judge Dismisses Murder Charges For Luigi Mangione Related To Terrorism—But Allows Second Degree Murder Charge To Stand"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.945,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.849,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A judge ruled that Luigi Mangione, accused of killing UnitedHealthcare CEO Brian Thompson, will not face terrorism charges due to insufficient evidence but will still be tried for second-degree murder. The incident occurred outside a Manhattan hotel in December. Despite the dismissal of the top state charges, the murder trial against Mangione will proceed. Mangione has gained some public support amid debates over healthcare costs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robert Redford, Iconic Actor and Sundance Founder, Dies at 89",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 09:14:36 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "ABC News",
      "NPR",
      "Business Insider",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "www.businessinsider.com",
      "www.dw.com",
      "ottawa.citynews.ca",
      "abcnews.go.com"
    ],
    "snippets": [
      "A movie star to his core, Robert Redford has died after a visionary career in cinema, including founding the Sundance Institute that transformed the market for independent films.",
      "Robert Redford, the director, actor, and activist has died at his home in Utah. Redford rose to fame in films like \"Butch Cassidy and the Sundance Kid\" and \"All the President's Men.\"",
      "Robert Redford, film icon, Oscar-winning director and activist, has died at age 89.",
      "Robert Redford's publicist told Business Insider he died at home \"at Sundance in the mountains of Utah &mdash; the place he loved, surrounded by those he loved.\"",
      "Robert Redford, the Hollywood golden boy who became an Oscar-winning director, liberal activist and godfather for independent cinema under the name of one of his best-loved characters, died Tuesday at 89. Redford died “at his home at Sundance in the mountains of Utah — the place he loved, surrounded"
    ],
    "image_url": "",
    "titles": [
      "Movie star and visionary Robert Redford has died at age 89",
      "Film icon Robert Redford dies at 89",
      "Robert Redford, film icon, Oscar-winning director and activist, dead at 89",
      "Robert Redford has died at 89. See his career in photos.",
      "Robert Redford, Oscar-winning actor, director and indie patriarch, dies at 89"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.941,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robert Redford, an esteemed actor, director, and founder of the Sundance Institute, has passed away at the age of 89. He died at his home in Utah, surrounded by loved ones. Redford was celebrated for his roles in \"Butch Cassidy and the Sundance Kid\" and \"All the President's Men,\" as well as his contributions to independent cinema and activism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Launches Ground Offensive in Gaza, Evacuations Underway Amid Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 14:59:41 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "LA Times",
      "New York Times",
      "CNBC",
      "Washington Post",
      "The Guardian",
      "Global News",
      "Al Jazeera",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "globalnews.ca",
      "www.latimes.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "www.cnbc.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "news.google.com"
    ],
    "snippets": [
      "It comes as a UN commission of inquiry found that Israel was committing genocide in Gaza.",
      "Israel has launched a ground offensive to occupy Gaza City, forcing thousands of residents to flee.",
      "Israeli forces have labeled Gaza City a \"dangerous combat zone.\" A UN probe has concluded that Israel is committing genocide in the Palestinian enclave, a finding Israel has rejected. DW has the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPNHBLcm1aT2xqWjh0Yi1Tay1GbGg2WU05bHhoS0VUU0pvYnB4elB4N01pUFNONUdwZHZ2NHJJQng4Tm5EWVFkVExOeXpacEppZXdTRTAwM2Q4RU1lVjl4X2R3YmNiYnJwa256UThlcW9WaVBiU1pkdHFQWGUzZ1c5RmR5QQ?oc=5\" target=\"_blank\">Israel launches ground offensive to occupy Gaza C",
      "Increasingly isolated on the international stage over its Gaza campaign, Israel has now launched a ground incursion in the strip's largest city.",
      "<p>Palestinian foreign ministry accuses IDF of deliberately targeting civilians</p><p>Wafa, the Palestinian news agency, <a href=\"https://english.wafa.ps/Pages/Details/161389\">has been told</a> by medical sources that at least 38 Palestinian people, including women and children, have been killed by ",
      "<p>Overnight advance aimed at ‘dismantling Hamas’s grip’ as Israel accused of genocide in UN human rights report</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Midd",
      "Palestinians in Gaza City reported a night of heavy bombardment. A U.N. commission said Israel was committing genocide in Gaza; Israel rejected it as “falsehoods.”",
      "Some of Israel’s oldest allies criticized its latest military assault in Gaza and warned of a deepening humanitarian crisis.",
      "“I scream all the time,” said one Palestinian living in the city in northern Gaza. Others said they felt terrified as tanks and ground troops rolled in.",
      "The long-planned take over of the city began early Tuesday, according to officials, despite hundreds of thousands of people still sheltering there.",
      "<p>Weeks of intense bombardment that all but leveled the Gaza Strip's largest urban center made way for what Israeli military officials said was the ground maneuver phase of the operation to occupy the city.</p>",
      "The operation marks yet another escalation in a conflict that has roiled the Middle East for nearly two years and likely pushes any ceasefire farther out of reach.",
      "In the coming days, additional troops are expected to gradually advance into the city."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3bb1/live/7b58ecb0-92fa-11f0-ba89-ad7477f3387f.jpg",
    "titles": [
      "Israel launches ground offensive on Gaza City",
      "Desperate Palestinians flee Gaza City as Israel launches ground offensive",
      "Israel says 'Gaza is burning' as it starts ground offensive",
      "Israel launches ground offensive to occupy Gaza City - Axios",
      "‘Gaza is burning’: Israel launches ground invasion of strip's largest city",
      "Israel turning Gaza City into mass graveyard, Palestinian foreign ministry says, as IDF launches ground offensive - latest updates",
      "Israel launches ground offensive deep inside Gaza City",
      "Israeli military begins ground invasion of Gaza City",
      "European Countries Condemn Israel’s Ground Offensive in Gaza City",
      "Panic Grips Gaza City as Israel Launches New Ground Operation",
      "Israel Launches Gaza City Ground Offensive, Officials Say",
      "Israel says it has begun ground offensive in Gaza City, moving in thousands of troops",
      "Israel begins ground offensive in Gaza City, thousands of residents flee",
      "Israel’s Ground Offensive in Gaza City Capped Months of Strikes and Threats"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.956,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.841,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel has initiated a ground offensive to occupy Gaza City, declaring it a \"dangerous combat zone\" and prompting the evacuation of thousands. This action follows a UN commission's conclusion that Israel is committing genocide in Gaza, a claim Israel disputes. The offensive has led to international criticism and warnings of a worsening humanitarian crisis. Reports indicate heavy bombardment in Gaza City and at least 38 Palestinian casualties, including women and children. The operation, aimed at dismantling Hamas's control, has significantly escalated the conflict, with further troop advanceme",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.T. Miller Named 29th Captain of New York Rangers",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 15:46:39 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "NHL",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.nbcsports.com"
    ],
    "snippets": [
      "New York did not have a captain for much of last season after trading Jacob Trouba to Anaheim in December.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQZXVGeU51Ul9lZ2xXSl9NNmdVS1dmUzJac3BvLXZuMzY1SXd6azMxaDJVQ2JOaDRXVWZIV2J2TkNmZGRua3pFWERGdWdYbmRJQ1pmNnMyOE55OEpmS202RkpfWUhVY1RKZ0dLRmRqdWlNV2FQbWlYT2hubmptS25xdy1ROFpmalh5WURKT3pHd0NfLTll?oc=5\" target=\"_blank\">Rangers Name J.T. Miller 29",
      "<p>J.T. Miller has a new title. The New York Rangers forward was named the 29th captain in franchise history on Tuesday, the team announced.</p>"
    ],
    "image_url": "",
    "titles": [
      "New York Rangers name J.T. Miller captain on the eve of training camp",
      "Rangers Name J.T. Miller 29th Captain In Franchise History - NHL.com",
      "Rangers name J.T. Miller as 29th captain in franchise history"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Rangers named J.T. Miller as their new captain, making him the 29th captain in the franchise's history. This announcement came after the team spent much of the previous season without a captain following the trade of Jacob Trouba to Anaheim in December.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Strikes Drug Cartel Vessel, 3 Dead; Trump Signals More Actions Ahead",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 12:05:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US carries out attacks as tensions mount between the Trump and Maduro administrations.",
      "<p>President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Monday that the United States had carried out a strike on a second <a href=\"https://www.theguardia",
      "The president also signaled that his administration was preparing to take military action against Latin American cartels that move narcotics over land."
    ],
    "image_url": "",
    "titles": [
      "Trump says US strikes second Venezuelan boat: All to know",
      "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "U.S. kills 3 in strike on alleged drug boat from Venezuela, Trump says"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.918,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US conducted a strike against a vessel in international waters, which President Trump described as targeting \"extraordinarily violent drug trafficking cartels\" bound for the US. This action follows a recent operation against a drug vessel from Venezuela and comes amidst tensions with Venezuelan President Maduro, who has promised to defend against US \"aggression.\" The strike resulted in the deaths of three individuals. Additionally, President Trump has indicated plans for further military actions against Latin American cartels involved in narcotics trafficking.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paige Bueckers Named WNBA Rookie of the Year",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 15:36:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.theuconnblog.com"
    ],
    "snippets": [
      "The former UConn star had a stellar first season in the WNBA",
      "Bueckers is the seventh Husky to win the award all-time.",
      "<p>Paige Bueckers is leaving her first WNBA season with some hardware. The Dallas Wings star was named rookie of the year on Tuesday, just six months after she was the No. 1 pick in the draft.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/5e1c1225-d5ad-4c07-99a4-c906dc048735/paige-bueckers-getty.png",
    "titles": [
      "Paige Bueckers named WNBA Rookie of the Year as Wings' No. 1 draft pick caps impressive season",
      "Paige Bueckers named 2025 WNBA Rookie of the Year",
      "Wings star Paige Bueckers named WNBA’s rookie of the year"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Paige Bueckers, a former UConn star and the No. 1 pick in the WNBA draft, was named Rookie of the Year after her first season with the Dallas Wings. She becomes the seventh Husky to win the award.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Begins Second UK State Visit, Hosted by King Charles and Queen Camilla",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 14:07:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The visit comes at a sensitive time for the UK, which plans to lay on a display of royal pageantry for the US president.",
      "The president and the first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also travel to the prime minister’s country residence, Chequers.",
      "<p>Visit comes at sensitive time for UK government, which is laying on display of royal and military pageantry</p><p>Donald Trump arrives in the UK on Tuesday for a <a href=\"https://www.theguardian.com/politics/2025/sep/15/donald-trump-uk-state-visit-keir-starmer-peter-mandelson\">historic second sta"
    ],
    "image_url": "",
    "titles": [
      "Trump’s UK visit: What’s on the agenda, schedule, what to expect",
      "President Trump’s State Visit to the UK: What to Know",
      "Donald Trump’s state visit to the UK: what’s on the agenda?"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump arrived in the UK for a historic second state visit, during a sensitive time for the UK government. He and the First Lady are hosted by King Charles III and Queen Camilla at Windsor Castle, and will also visit the Prime Minister's residence, Chequers. The visit features displays of royal and military pageantry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Champions League Season Starts with New Teams, Times; Follow Live Updates",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-16T14:12:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Sports Illustrated",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The new Champions League season is here and with it new teams, new kick-off times and a new chance for the Bundesliga.",
      "<ul><li><p>Champions League latest updates, 5.45pm BST kick-off</p></li><li><p><a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://bsky.app/profile/sport.theguardian.com\">Follow us over on Bluesky</a> | And <a href=\"mailto:Barry.Glendenning@theguardian.com\">email B",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxORWN2Vk14UmxSdlUyOEI3bkdYSWVYVTdsYXN6dTMtYkFIdUhaTHpfcWN5RmNWdjlJRnZ1OVBPN1p2VFBNSHNCT2M0dmsyaUlGRU5RRmFyY1dKNTJmcG83ZVZ3N1d0NFgyZzNrekpUT19QSjlFeUZvQnBDZGlyMzNIdw?oc=5\" target=\"_blank\">Arsenal Predicted Lineup vs. Athletic Club: Arteta Ro"
    ],
    "image_url": "",
    "titles": [
      "What to know about the 2025-26 Champions League",
      "Athletic Bilbao v Arsenal: Champions League – live",
      "Arsenal Predicted Lineup vs. Athletic Club: Arteta Rotates in Champions League Opener - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The new Champions League season has commenced, introducing fresh teams, altered kick-off times, notably at 5.45pm BST, and presenting a renewed opportunity for the Bundesliga. Concurrently, live scores and updates are available, with options to follow on Bluesky or contact via email for more engagement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robert Munsch Chooses MAID Amid Dementia Battle",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 16 Sep 2025 14:02:30 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The beloved Canadian author said that he watched one of his brothers die slowly from amyotrophic lateral sclerosis (ALS), and doesn't want the same fate for himself.",
      "Robert Munsch, the Canadian storyteller whose picture books have been read aloud to generations of children, has revealed he intends to access medical assistance in dying (MAID) as his health declines from dementia. The 79-year-old author, best known for classics such as Love You Forever, The Paper "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/robert-munsch_2cfa5f.jpg?quality=65&strip=all",
    "titles": [
      "Robert Munsch, Canadian children’s author, says he’s been approved for MAID",
      "Canadian children’s author Robert Munsch chooses MAID amid dementia action"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.713,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canadian author Robert Munsch, known for children's books like \"Love You Forever,\" has announced he plans to use medical assistance in dying (MAID) due to his declining health from dementia. Munsch, 79, made this decision after witnessing his brother's slow death from ALS, aiming to avoid a similar fate.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Brady Spotted in Coaching Booth During Raiders-Chargers Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 11:08:43 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Raiders minority owner Tom Brady was seen wearing a headset in the team's coaching booth during Monday's game vs. the Chargers.",
      "<ul><li><p>Some have raised conflict of interest concerns over role</p></li><li><p>Brady is a broadcaster and part-owner of Raiders</p></li></ul><p>Tom Brady drew ire from fans on Monday night as the minority owner of the Las Vegas Raiders appeared in his team’s coaching booth during a home loss to "
    ],
    "image_url": "",
    "titles": [
      "Brady shown in Raiders' coaching booth on MNF",
      "Tom Brady draws online ire as he appears in Las Vegas Raiders coaching booth"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tom Brady, a minority owner of the Raiders, was observed wearing a headset in the coaching booth during the team's Monday game against the Chargers. This action highlights his dual role as both a broadcaster and a minority owner of the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.T. Miller Named Rangers Captain After Impressive Scoring Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 11:08:43 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "J.T. Miller, who was reacquired by the Rangers in January and became one of their leading scorers, was named captain Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE1MeUhTT3doQVpXdTdEcklIVDFFZ2FaSWoxS0Z2Q3hSdDdKMHZJVDdBaGFCVWhvOHQ3Q3hTemUzY3o5UFR1ZEZhVVRfWDR5Yk42TnlqVlR4M3plV1VHRi1zMUdFZzlkbVc2eTg4YU5JbFF0Zllz?oc=5\" target=\"_blank\">Miller named Rangers captain, replaces Trouba</a>&nbsp;&nbsp;<font colo"
    ],
    "image_url": "",
    "titles": [
      "Miller to captain Rangers in first full season back",
      "Miller named Rangers captain, replaces Trouba - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "J.T. Miller, who was reacquired by the Rangers in January and became one of their leading scorers, was named captain Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies Clinch NL East Title Again with 6-5 Win Over Dodgers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 11:08:43 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Kyle Schwarber, Weston Wilson and Bryce Harper homered, and the Phillies wrapped up their second straight National League East title with a thrilling 6-5 victory over the Dodgers on Monday night.",
      "<p>A trip around the majors sees Kyle Schwarber blast home run No. 53 to help lead the Phillies to clinch the NL East, meanwhile Blue Jays top pitching prospect Trey Yesavage strikes out 9 in his MLB debut, Twins tame the Yankees, and much more.</p>",
      "<p>J.T. Realmuto drove in the go-ahead run on a sacrifice fly in the 10th inning, capping a wild 6-5 comeback victory by the Philadelphia Phillies over the Los Angeles Dodgers that clinched the NL East title in the series opener between division leaders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies clinch NL East with wild win vs. Dodgers",
      "Schwarber and Phillies clinch NL East, Jays’ Yesavage K’s 9 in MLB debut",
      "Phillies clinch NL East title in wild 10th-inning comeback against Dodgers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Philadelphia Phillies clinched their second consecutive National League East title with a 6-5 win over the Los Angeles Dodgers, highlighted by home runs from Kyle Schwarber, Weston Wilson, and Bryce Harper. The victory, secured by J.T. Realmuto's go-ahead sacrifice fly in the 10th inning, marked a significant comeback in the series opener between the division leaders. This win also solidified the Phillies' position ahead of the Mets in September.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Buccaneers Clinch 20-19 Victory Over Texans in Final Seconds",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 10:33:12 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Tampa Bay put together an 11-play drive to steal the win, with Rachaad White punching in the winner.",
      "<p>Baker Mayfield led an 11-play, 80-yard drive capped by Rachaad White’s two-yard touchdown run with six seconds left, and the Tampa Bay Buccaneers rallied past the Houston Texans 20-19 on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Baker Mayfield leads late drive as Buccaneers stun Texans in Houston",
      "Baker Mayfield, Rachaad White rally Buccaneers to win over Texans"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Baker Mayfield led the Tampa Bay Buccaneers on an 11-play, 80-yard drive, culminating in a two-yard touchdown run by Rachaad White with six seconds remaining, to secure a 20-19 victory over the Houston Texans on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Develops Teen-Focused ChatGPT and Age Prediction Tool",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 13:01:23 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1fOThRZE1lOGhQbzdQWE9Sb1FjOXlNdWt4c2dWZ01qOW1TcDVwVlhHbjlaUV9fN0tta2duZVdFTmVDMXZuY2JYeldPaWJrRU4wby00OEF4S1Y2dnRxS1pTMzYwdW5DVXU0TEZZWXZ4Nm1feFE?oc=5\" target=\"_blank\">OpenAI is building a ChatGPT for teens</a>&nbsp;&nbsp;<font color=\"#6f6f",
      "OpenAI is also developing a technology to better predict a user's age."
    ],
    "image_url": "",
    "titles": [
      "OpenAI is building a ChatGPT for teens - Axios",
      "OpenAI to launch ChatGPT for teens with parental controls as company faces scrutiny over safety"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI is working on a ChatGPT model specifically for teenagers and is developing a tool to predict users' ages more accurately. The project aims to enhance interactions and tailor experiences for younger audiences. The current status of the development and implementation of these technologies is ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Raiders' Rookie Jeanty Gains 43 Yards in Loss to Chargers",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 13:26:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jeanty had just 43 yards on 11 carries in the Raiders' loss to the Chargers",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE9iMmlrRmFOZk9WcVlUcnNJZ2lmY0ZGMTJCNmJ0c09HQVhaeWNUTG5Sc1JQMDAwNVo0VnYtYmt4and3NktxMFd3NnlUdjhaMVJNSmtJcmdValZ6TkZNNkx1blF2eHUxa2JjRDRtRnQxems0Ums?oc=5\" target=\"_blank\">Ashton Jeanty, Pete Carroll Preach Same Message About Raiders Rookie's S"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/d529eb23-3485-4a5f-8968-174aca69e083/jeanty.jpg",
    "titles": [
      "Ashton Jeanty, Pete Carroll discuss the rookie's slow start as Raiders continue to struggle to run the ball",
      "Ashton Jeanty, Pete Carroll Preach Same Message About Raiders Rookie's Struggles - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ashton Jeanty, a rookie for the Raiders, gained 43 yards from 11 carries in a game where the Raiders were defeated by the Chargers. Both Jeanty and Raiders' coach Pete Carroll emphasized the same perspective on the performance and outcome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Map Plant Stem Cell Genes, Link to Crop Size",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 02:28:36 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists at Cold Spring Harbor Laboratory have cracked open the secrets of plant stem cells, mapping key genetic regulators in maize and Arabidopsis. By using single-cell RNA sequencing, they created a gene expression atlas that identifies rare stem cell regulators, links them to crop size and pro",
      "<a href=\"https://scitechdaily.com/scientists-just-found-a-way-to-simulate-the-universe-on-a-laptop/\" rel=\"nofollow\" title=\"Scientists Just Found a Way to Simulate the Universe on a Laptop\"><img alt=\"Large-Scale Structure of the Universe\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src="
    ],
    "image_url": "",
    "titles": [
      "Scientists just found the “master switch” for plant growth",
      "Scientists Just Found a Way to Simulate the Universe on a Laptop"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists at Cold Spring Harbor Laboratory have successfully mapped the genetic regulators of plant stem cells in maize and Arabidopsis using single-cell RNA sequencing. This research has led to the creation of a gene expression atlas, which not only identifies rare stem cell regulators but also establishes a connection between these regulators and crop size. This breakthrough could have significant implications for crop improvement strategies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Rover Finds \"Leopard Spots\" Rock on Mars, Hints at Ancient Life",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 03:31:04 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "NASA’s Perseverance rover has delivered its most compelling clue yet in the search for life on Mars. A rock sample called “Sapphire Canyon,” taken from the Bright Angel formation in Jezero Crater, shows unusual mineral patterns known as “leopard spots” that may have formed through microbial activity",
      "<a href=\"https://scitechdaily.com/strange-mars-mudstones-may-hold-the-strongest-clues-yet-of-ancient-life/\" rel=\"nofollow\" title=\"Strange Mars Mudstones May Hold the Strongest Clues Yet of Ancient Life\"><img alt=\"Cheyava Falls Rock Leopard Spots\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\""
    ],
    "image_url": "",
    "titles": [
      "Strange ‘leopard spots’ in a Mars rock could be the strongest hint of life yet",
      "Strange Mars Mudstones May Hold the Strongest Clues Yet of Ancient Life"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA's Perseverance rover has collected a rock sample named \"Sapphire Canyon\" from the Bright Angel formation in Jezero Crater on Mars, revealing unusual \"leopard spots\" mineral patterns. These patterns might indicate microbial activity, marking a significant clue in the search for ancient life on Mars.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RFK Jr. Appoints New CDC Vaccine Advisers Ahead of Key Meeting",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 19:50:59 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE9TbThBd3I1QTV3aEdEcXg3YXRVR1JNQXpwckNMSlI0dmdWYXI3OUtiS2JJc2lURWNTYzZ3YkMtN0RzUjJHcFgxeWJ1QmdGbjZlLTNwZFVoUjJWWURyRWRJOHBGWnFKbXNKRmhR?oc=5\" target=\"_blank\">RFK Jr. appoints five more members to vaccine panel</a>&nbsp;&nbsp;<font color=\"#6f",
      "The panel will meet this week and could limit access to measles, Hep B, COVID vaccines."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. appoints five more members to vaccine panel - Axios",
      "RFK Jr. adds more anti-vaccine members to CDC vaccine advisory panel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.641,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.583,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Health Secretary Robert F. Kennedy Jr. appointed new vaccine advisers to the CDC ahead of a meeting to discuss COVID and hepatitis B vaccines. The panel, meeting this week, may consider changes to the availability of measles, Hepatitis B, and COVID vaccines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "The Weeknd's Hits Resurge in UK Charts on Album's 10th Anniversary",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 10:45:28 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "The Weeknd’s Beauty Behind the Madness marks 10 years as his singles and albums surge back onto U.K. charts, led by “The Hills” and “Die for You.”",
      "The Weeknd claims four U.K. charting albums this week, as After Hours, Starboy, The Highlights, and Hurry Up Tomorrow all return together."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c95c6541dfa1ba511850b9/0x0.jpg?width=960",
    "titles": [
      "The Weeknd’s Career-Defining Singles Return Together",
      "Several Of The Weeknd’s Biggest Albums Return To The Charts Together"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.971,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.462,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Celebrating the 10th anniversary of \"Beauty Behind the Madness,\" The Weeknd sees a resurgence in the U.K. charts with singles such as \"The Hills\" and \"Die for You.\" Additionally, four of his albums - \"After Hours,\" \"Starboy,\" \"The Highlights,\" and \"Hurry Up Tomorrow\" - have re-entered the U.K. charts simultaneously.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]