[
  {
    "title": "Pete Alonso set to join Orioles with five year contract",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 14:36:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports",
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "sportsnet.ca",
      "cbssports.com",
      "forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "First baseman Pete Alonso and the Baltimore Orioles are finalizing a five-year, $155 million contract, sources told ESPN's Jeff Passan.",
      "The Baltimore Orioles agreed to a five-year contract with free agent first baseman Pete Alonso. Alonso hit 264 home runs over his first seven seasons.",
      "What the heck is a polar bear doing in Baltimore? Pete Alonso has agreed to a five-year, $155-million contract with the Orioles, ESPN’s Jeff Passan reported on Wednesday. The deal gives Alonso the highest average annual value ever for a first baseman. It is also the second richest contract ever handed out by the Orioles, trailing only Chris Davis’s $161-million deal signed in 2016. Alonso spent the first seven years of his career with the New York Mets. The Athletic ‘s Will Sammon reported that New York was not comfortable matching the length and value of Alonso’s offer from the Orioles. In...",
      "The five-time All-Star opted out of his Mets contract this winter",
      "Free Agent Pete Alonso is receiving a similar contract from the Baltimore Orioles as Kyle Schwarber got from the Philadelphia Phillies.",
      "Pete Alonso Spurns Mets for Orioles on Massive Five-Year Contract Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Sources: O's, Alonso finalizing 5-year, $155M deal",
      "Orioles agree to $155 million deal with ex-Mets star Pete Alonso",
      "Report: Pete Alonso agrees to five-year, $155-million deal with Orioles",
      "Pete Alonso signing with Orioles: Mets slugger bolts for Baltimore on five-year, $155 million contract",
      "Free Agent Pete Alonso Departs The Mets For Baltimore Orioles",
      "Pete Alonso Spurns Mets for Orioles on Massive Five-Year Contract - Sports Illustrated"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47267529/sources-alonso-finalizing-5-year-155m-deal-orioles",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/orioles-agree-155-million-deal-194400527.html",
      "https://www.cbssports.com/mlb/news/pete-alonso-orioles-free-agency-contract-five-years-155-million/",
      "https://www.forbes.com/sites/berniepleskoff/2025/12/10/free-agent-pete-alonso-departs-the-mets-for-baltimore-orioles/",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxPT3Z0RjRTWE12enVsMG9jOHVwdXhMSVJ5VzBJc09nWUtGZUZGcV9BbmpXNnpMTWVXTXNzamZ4c1lDdkF2TVRYc0NXejd6azFYTUZFXzFZMzBRdzNRMXlIZWZ4Tnd6Y1N6aTNCcWpOTUFwcHJTY3dqZVE2R1JDX3BPZDN6WlRQYWo2YU5CTjA2d25qUQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47267529/sources-alonso-finalizing-5-year-155m-deal-orioles",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.973,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.893,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a sports transaction, but it doesn't offer much in the way of deeper understanding or actionable insights. It's primarily of interest to fans of the team or the player.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Free agent first baseman Pete Alonso is finalizing a five-year, $155 million contract with the Baltimore Orioles, according to multiple reports. The deal gives Alonso the highest average annual value for a first baseman and is the second largest in Orioles history. Alonso, a five-time All-Star, spent his first seven MLB seasons with the New York Mets.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US forces take oil tanker near Venezuela",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 19:27:49 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "The Guardian",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "Trump administration seizes oil tanker off Venezuela coast, US officials say Reuters",
      "The White House has undertaken a large military buildup in the Caribbean and launched deadly strikes against boats that it claims were trafficking drugs.",
      "If confiirmed, move would be major escalation of US pressure campaign against South American country’s dictator, Nicolás Maduro US politics live – latest updates US forces have reportedly seized an oil tanker off the coast of Venezuela in what would be a major escalation of Donald Trump’s four-month",
      "US Seizes Oil Tanker Off the Coast of Venezuela Bloomberg.com",
      "US forces have intercepted and seized a sanctioned oil tanker off the coast of Venezuela, according to people familiar with the matter, a move that marks a serious escalation of tensions between the two countries."
    ],
    "image_url": "",
    "titles": [
      "Trump administration seizes oil tanker off Venezuela coast, US officials say - Reuters",
      "U.S. seizes oil tanker off the coast of Venezuela: Report",
      "US forces reportedly seize oil tanker off Venezuela coast",
      "US Seizes Oil Tanker Off the Coast of Venezuela - Bloomberg.com",
      "US Seizes Sanctioned Oil Tanker Off the Coast of Venezuela"
    ],
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPT0xNMXBtNV9weEpST2hOZWF3YXp6V0JuSEJ3RlV4RGpMaUpUV3VoUUJfb1JudFVEaXFFdXYtcW1XUzdXRmF2dzFjNVo5UllqSjIzcFJEZmM2NDM0R1YzbUlaVHNXMkNoNWIxc2NkNFJKa0huNmFVZWhVai1MZWFWVmUzeU1FdlFUMkVmcjByQ250RmpiWlh5d0xOdktlb3V4T3g1aWp5WTFuTWRWMkt4UzFiS29vWG1KMVdBUzlCRG5telVf?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/12/10/us-venezuela-oil-tanker-seize.html",
      "https://www.theguardian.com/us-news/2025/dec/10/us-forces-reportedly-seize-oil-tanker-off-venezuela-coast",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM200SmN3dGpxbTZsMW5RUWctN2dIOUxqUFFTLWtWeXVpblgwRTVLQWVFM19DNkw3VUYxWGJkR25EeHlJdFhaYkhhMFdxeUtJcVAtc0hCSXhhbFRoZXM2U3lYUUs1MVFhV3BWcE5NaXZKcndTX3hkd0tBZWhtcndmdWtzLXRBMk14UFFOTHhQLWhrZU9rZGZ4NG1rVHlBMWM?oc=5",
      "https://financialpost.com/pmn/business-pmn/us-seizes-sanctioned-oil-tanker-off-the-coast-of-venezuela"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPT0xNMXBtNV9weEpST2hOZWF3YXp6V0JuSEJ3RlV4RGpMaUpUV3VoUUJfb1JudFVEaXFFdXYtcW1XUzdXRmF2dzFjNVo5UllqSjIzcFJEZmM2NDM0R1YzbUlaVHNXMkNoNWIxc2NkNFJKa0huNmFVZWhVai1MZWFWVmUzeU1FdlFUMkVmcjByQ250RmpiWlh5d0xOdktlb3V4T3g1aWp5WTFuTWRWMkt4UzFiS29vWG1KMVdBUzlCRG5telVf?oc=5",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.969,
      "consensus": 0.975,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.875,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the geopolitical tensions between the US and Venezuela, but it doesn't provide deeper insights or potential implications, nor does it report on any solutions or attempts to resolve the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "US forces have seized a sanctioned oil tanker off the coast of Venezuela, according to officials and media reports. The action is part of a broader US military buildup in the Caribbean and efforts targeting drug trafficking and sanctions enforcement. This marks a significant escalation in tensions between the US and Venezuela’s government under Nicolás Maduro.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Venezuelan leader María Corina Machado misses Nobel Peace Prize event",
    "domain": "politics",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Wed, 10 Dec 2025 08:03:12 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "Business Insider"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "dw.com",
      "theguardian.com",
      "nytimes.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Machado — who has been in hiding for nearly a year — was still expected in Oslo later in the day.",
      "Venezuelan opposition leader María Corina Machado, who lives in hiding, is reportedly on her way to Oslo.",
      "Maria Corina Machado was unable to accept her Nobel Peace Prize in person on Wednesday. But the Venezuelan is not the only winner unable to attend the ceremony, with incarceration a common historical thread.",
      "Daughter delivers speech, with Nobel Institute saying María Corina Machado still expected in Oslo after journey of ‘extreme danger’ Venezuela’s most prominent opposition leader, María Corina Machado , has vowed to continue her struggle to free the country from years of “obscene corruption”, “brutal",
      "María Corina Machado, the Venezuelan opposition leader, said she was on her way to Norway after living in hiding in her country, where officials have threatened her with arrest.",
      "Since 1901, the Nobel Peace Prize has been awarding global strides in peace-making. The 2025 ceremony took place today."
    ],
    "image_url": "",
    "titles": [
      "Machado's daughter accepts Nobel Peace Prize in Venezuelan opposition leader's absence",
      "Nobel Peace Prize winner's daughter accepts award on her behalf",
      "Nobel Peace Prize: The winners forced to stay away",
      "Venezuelan Nobel peace prize winner misses ceremony but vows to continue struggle",
      "Venezuela’s Nobel Peace Prize Winner Says She Will Appear in Oslo After Missing Ceremony",
      "Every Nobel Peace Prize winner in history"
    ],
    "url": "https://www.npr.org/2025/12/10/nx-s1-5639764/machado-nobel-peace-prize-ceremony",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cwyv5gw95ypo?at_medium=RSS&at_campaign=rss",
      "https://www.dw.com/en/nobel-peace-prize-the-winners-forced-to-stay-away/a-75092835?maca=en-rss-en-top-1022-rdf",
      "https://www.theguardian.com/world/2025/dec/10/venezuelan-nobel-peace-prize-winner-maria-corina-machado-not-attend-ceremony-oslo",
      "https://www.nytimes.com/2025/12/10/world/europe/machado-nobel-venezuela-ceremony.html",
      "https://www.businessinsider.com/nobel-peace-prize-winners-through-the-years"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/10/nx-s1-5639764/machado-nobel-peace-prize-ceremony",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.811,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.874,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant event and provides some context about the political situation in Venezuela. However, it doesn't offer much in the way of actionable insights or a clear sense of progress.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Venezuelan opposition leader María Corina Machado, who has been living in hiding due to threats of arrest, was unable to attend the 2025 Nobel Peace Prize ceremony in Oslo. Her daughter delivered her speech at the event. The Nobel Institute stated that Machado was still expected to arrive in Oslo after a dangerous journey. The ceremony took place on December 10, 2025.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Iceland and four countries will not join Eurovision in 2026",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 18:35:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Reuters",
      "CBC News",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "news.google.com",
      "cbc.ca",
      "theguardian.com"
    ],
    "snippets": [
      "Iceland joins four other nations in a boycott, after the organiser declined to hold a vote over Israel's involvement.",
      "Iceland joins Spain, Ireland, Slovenia and the Netherlands in saying it will boycott the 2026 contest.",
      "Iceland to boycott 2026 Eurovision in protest of go-ahead for Israel Reuters",
      "Spain, the Netherlands, Ireland and Slovenia have also announced their plans to boycott the event, citing Israel's conduct in its war against Hamas in Gaza. This comes after the European Broadcasting Union, made up of a number of European public broadcasters, cleared Israel to participate last week.",
      "Iceland joins Spain, Slovenia, the Netherlands and Ireland in neither participating in nor broadcasting event Iceland has become the fifth country to boycott next year’s Eurovision song contest after Israel was given the go-ahead to compete, deepening the crisis facing the competition. The board of"
    ],
    "image_url": "",
    "titles": [
      "Iceland to join boycott of Eurovision in protest at Israel’s involvement",
      "Iceland becomes fifth country to boycott Eurovision",
      "Iceland to boycott 2026 Eurovision in protest of go-ahead for Israel - Reuters",
      "Iceland will boycott Eurovision in protest of Israel's participation",
      "Iceland becomes fifth country to boycott Eurovision 2026 over Israel"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/10/iceland-to-join-boycott-of-eurovision-in-protest-at-israels-involvement?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cjwy9n786n0o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNVllRUkxCTXhhLWJJVDFOc1Nhc1lYY1d5SVRJMXEya1NtT25Ta25DaV8yeDhoUmc1OTU2QU9RNjFKNktPR0owQzJjS3EyMWVjZ2Zrc2RzRzA1YzNldnlxUHd3WDlxWkJOTlZDcHdpSHhSUEY2YkQzTFBibFhvWGduQW1XdjRuVTRvQXdKSDc5Y3loeTMzaC12VW1IbV82cGdHcDFYWm9CM3l5bUtURm5udnNaSEE?oc=5",
      "https://www.cbc.ca/news/entertainment/iceland-eurovision-boycott-9.7010516?cmp=rss",
      "https://www.theguardian.com/tv-and-radio/2025/dec/10/iceland-becomes-fifth-country-to-boycott-eurovison-2026-over-israel"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/10/iceland-to-join-boycott-of-eurovision-in-protest-at-israels-involvement?traffic_source=rss",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.945,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.872,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a political protest, but it doesn't provide much depth or insight into the underlying issues or potential impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Iceland has announced it will boycott the 2026 Eurovision Song Contest, joining Spain, Ireland, Slovenia, and the Netherlands. The decision follows the European Broadcasting Union's approval of Israel's participation despite calls for a vote on the issue. All five countries cited concerns over Israel's actions in the Gaza conflict and will neither participate in nor broadcast the event.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US Federal Reserve lowers interest rates as economy slows",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 19:19:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "abcnews.go.com",
      "theguardian.com"
    ],
    "snippets": [
      "The central bank cut rates for the third time in 2025 as limited government data clouds economic outlook.",
      "Fed cuts interest rates amid internal dissent Axios",
      "Inflation has picked up in recent months alongside a hiring slowdown.",
      "Divisive vote to lower rates highlights uncertainty in the Fed as economy absorbs major shakeups, including tariffs The US Federal Reserve announced on Wednesday that it was cutting interest rates by a quarter point for the third time this year, as the embattled central bank appeared split over how"
    ],
    "image_url": "",
    "titles": [
      "US Federal Reserve cuts interest rates in final decision of the year",
      "Fed cuts interest rates amid internal dissent - Axios",
      "Fed cuts interest rates for 3rd time this year",
      "Fed cuts interest rates by a quarter point amid apparent split over US economy"
    ],
    "url": "https://www.aljazeera.com/economy/2025/12/10/us-federal-reserve-cuts-interest-rates-in-final-decision-of-the-year?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMibEFVX3lxTE1IX3Q3eGFzenNRRGVtNTAzSE5EVms2S0ppcm9sR0ZtamxPSURhZjVZMkczZjYxSWJrd0w3X3hNNVNrZFoyMjBLR1luQ2d5TjZZNHdiWVNiWGFPVWJPQUtHQ3NUNTkxSUdGdGRlVg?oc=5",
      "https://abcnews.go.com/Business/divided-fed-set-announce-decision-interest-rates/story?id=128204427",
      "https://www.theguardian.com/business/2025/dec/10/fed-interest-rates-us-economy"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/12/10/us-federal-reserve-cuts-interest-rates-in-final-decision-of-the-year?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.965,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.849,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant economic decision, which could be useful for people interested in finance or economics. However, it doesn't explain the reasons behind the decision or its potential impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US Federal Reserve cut interest rates by a quarter point for the third time in 2025, amid internal divisions among policymakers. The decision comes as inflation has risen and hiring has slowed, with the economic outlook uncertain due to limited government data and recent tariffs.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Shopaholic author Sophie Kinsella dies at age 55",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Wed, 10 Dec 2025 09:48:23 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Reuters",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "news.google.com",
      "washingtonpost.com",
      "theguardian.com"
    ],
    "snippets": [
      "The author, whose real name was Madeleine Sophie Wickham, was diagnosed with an aggressive form of brain cancer in late 2022.",
      "The author of the Shopaholic series of novels had been diagnosed with an aggressive form of brain cancer.",
      "Sophie Kinsella, author of Shopaholic book series, dies aged 55 Reuters",
      "Her books sold more than 50 million copies and made her a “chick-lit goddess.” Some were published under her given name, Madeleine Wickham.",
      "The ‘queen of romantic comedy’ has died 18 months after announcing her brain cancer diagnosis Madeleine Wickham, known for writing the bestselling novel Confessions of a Shopaholic under her pen name Sophie Kinsella, has died aged 55. Wickham, dubbed “the queen of romantic comedy” by novelist Jojo M"
    ],
    "image_url": "",
    "titles": [
      "Author Sophie Kinsella, who penned the 'Shopaholic' books, has died at 55",
      "Author Sophie Kinsella remembered as a 'wonderful, warm woman'",
      "Sophie Kinsella, author of Shopaholic book series, dies aged 55 - Reuters",
      "Sophie Kinsella, hit author of ‘Shopaholic,’ dies of brain cancer at 55",
      "Confessions of a Shopaholic novelist Sophie Kinsella dies aged 55"
    ],
    "url": "https://www.npr.org/2025/12/10/nx-s1-5639788/sophie-kinsella-dead-confessions-of-a-shopaholic",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/ce91d2m1gg7o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNcEFNdTUzVVUzNFQ2MGtkWXg3VVQ3emx3UmNMRWlqTlZoaGhNaXFhM3BhWkxORUY2SHhPOVFUcElncVBabkx6TFlhT3dVV3pTUlhfRHN2NWZ0OUhiQW9TS2F6RmdFV24tTlItSkNyS1VyUjkxR29kSFdLX3Z2TVJhT0xkbGZmdVV3ZWpjWUJ5YmxqLTVaQTgzZjVraW9rMGsyWTZnVFRR?oc=5",
      "https://www.washingtonpost.com/obituaries/2025/12/10/sophie-kinsella-dead-shopaholic/",
      "https://www.theguardian.com/books/2025/dec/10/madeleine-wickham-aka-shopaholic-novelist-sophie-kinsella-dies-aged-55"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/10/nx-s1-5639788/sophie-kinsella-dead-confessions-of-a-shopaholic",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.851,
      "consensus": 0.995,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.843,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the death of a notable author. However, it does not provide any deeper insights or value to the reader beyond the basic information.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Sophie Kinsella, the pen name of Madeleine Sophie Wickham and author of the bestselling Shopaholic series, has died at age 55. She was diagnosed with aggressive brain cancer in late 2022. Wickham sold over 50 million books, some under her real name, and was widely recognized for her impact on romantic comedy fiction.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Judge tells Trump administration to return National Guard to",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 17:49:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "California Governor Newsom celebrates court victory against Trump’s extended National Guard presence in Los Angeles.",
      "In the latest in a series of legal setbacks for Trump's deployments, a judge ruled the administration must end its deployment to Los Angeles and return control of National Guard troops to California.",
      "US judge says Trump must end National Guard deployment in Los Angeles Reuters",
      "Judge ordered the guard, deployed to the city in June, returned to the control of the California governor US politics live – latest updates A US judge on Wednesday morning blocked the deployment by the federal government of national guard troops in Los Angeles and ordered the guard returned to the c"
    ],
    "image_url": "",
    "titles": [
      "US federal judge halts Trump’s National Guard operations in California",
      "Judge blocks Trump's National Guard deployment in LA with sharp rebuke",
      "US judge says Trump must end National Guard deployment in Los Angeles - Reuters",
      "Judge blocks Trump administration’s deployment of national guard troops in Los Angeles"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/10/us-federal-judge-halts-trumps-national-guard-operations-in-california?traffic_source=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/12/10/nx-s1-5639822/national-guard-la-court-judge-trump",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNNkVNWWt4X3p5VzVjTXItU2U1aEhnUTlvSXptclhjY1JqSHRUYnNiZkEzN1EtTVV2UFlLcGFlaVJ0UkpodVRWTGpvTDBmZmRzYUI1U1l2OUJ6N1A4Q3dNWFllT0sxZnZaQ3JhOGRWTHpMQ2dkdVhsYmVPZW1aTWlUU1dYemI2U0JQYjBIbGlzRzU1UUo3bGFvRWQ3Z0liVG9wdlRldw?oc=5",
      "https://www.theguardian.com/us-news/2025/dec/10/national-guard-los-angeles-deployment-blocked"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/10/us-federal-judge-halts-trumps-national-guard-operations-in-california?traffic_source=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.926,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.833,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a legal decision and its immediate implications, but it doesn't provide much depth or insight into the broader context or potential consequences.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A US judge has ordered the Trump administration to end its National Guard deployment in Los Angeles and return control of the troops to California. The ruling, celebrated by California Governor Newsom, marks a legal setback for Trump’s efforts to extend federal control over the Guard. The troops were originally deployed to Los Angeles in June.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Philip Rivers may play in NFL playoffs again",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 14:36:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "NASA"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "nasa.gov"
    ],
    "snippets": [
      "Philip Rivers hasn't taken a snap since 2020, but he might be about to enter a playoff race against elite defenses.",
      "The league has already approved this, as 'it does not present a competitive issue'",
      "Retirement Information for NASA Employees The NSSC provides general administrative, advisory, and transactional support for federal benefits programs to all NASA employees, calculates retirement estimates, and processes retirement packages. In consideration of retiring employees on administrative le"
    ],
    "image_url": "",
    "titles": [
      "🏈 How Colts signed Philip Rivers out of retirement",
      "New Colts QB Philip Rivers to take Daniel Jones' jersey number as he comes out of retirement, per report",
      "Retirement"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47262315/indianapolis-colts-philip-rivers-daniel-jones-quarterback-44-years-old",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/colts-philip-rivers-daniel-jones-jersey-number/",
      "https://www.nasa.gov/general/retirement/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47262315/indianapolis-colts-philip-rivers-daniel-jones-quarterback-44-years-old",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.833,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about how the Colts managed to sign Philip Rivers out of retirement. However, it doesn't highlight any progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former NFL quarterback Philip Rivers, who last played in 2020, may return to participate in an upcoming playoff race. The league has approved his potential involvement, stating it does not present a competitive issue. No official announcement on his return has been made.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Egypt and Iran to play World Cup game on Seattle Pride day",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Wed, 10 Dec 2025 14:01:27 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "npr.org",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Local organizers had planned to include the June 26 game with Seattle's Pride celebrations. Then, FIFA announced the match would include Egypt and Iran, two countries where gay rights are nil.",
      "Seattle’s plan for the June 26 game to be a “Pride Match” was made before the World Cup draw. Egypt said the move may “provoke cultural and religious sensitivities.”",
      "The two countries, which criminalize homosexuality and impose severe punishments for it, were picked to play on a day celebrating L.G.B.T.Q. communities."
    ],
    "image_url": "",
    "titles": [
      "Egypt and Iran object to playing in a Seattle 'Pride' match in next year's World Cup",
      "Egypt and Iran protest being drawn to play in World Cup ‘Pride Match’",
      "Seattle’s Plans for a Pride Match at World Cup Infuriates Iran and Egypt"
    ],
    "url": "https://www.npr.org/2025/12/10/nx-s1-5639958/egypt-iran-seattle-pride-match-fifa-world-cup",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/10/world-cup-pride-match-egypt-iran/",
      "https://www.nytimes.com/2025/12/09/world/middleeast/iran-egypt-world-cup-seattle-pride.html"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/10/nx-s1-5639958/egypt-iran-seattle-pride-match-fifa-world-cup",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.957,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.818,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the issues of diversity and inclusion in sports, but it lacks depth or insight into why these objections are happening, what the implications are, or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Seattle organizers had planned to align the June 26 FIFA World Cup match with local Pride celebrations. After the tournament draw paired Egypt and Iran—countries with strict anti-LGBTQ laws—for that game, Egypt objected, citing cultural and religious concerns. The match is now set to feature both teams on a day marking LGBTQ Pride in Seattle.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Dereck Lively II will have foot surgery and miss the season",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 14:36:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Mavericks center Dereck Lively II will undergo season-ending surgery on his right foot to address lingering discomfort, the team announced Wednesday.",
      "The Dallas Mavericks lose a big man with Dereck Lively set to undergo foot surgery",
      "DALLAS — Dallas Mavericks centre Dereck Lively II is set for season-ending surgery on his ailing right foot, another setback for the promising but oft-injured player. The team said Wednesday the surgery will be performed by Dr. James Calder in London. The Mavericks previously said Lively was seeking multiple medical opinions as discomfort in the foot lingered. He had a procedure on the same foot in the off-season. Lively’s final game of the season was a 118-115 victory over New Orleans on Nov. 21. He then sat the second night of a back-to-back after missing 10 of the previous 14 games because..."
    ],
    "image_url": "",
    "titles": [
      "Mavs' Lively to have season-ending foot surgery",
      "Mavericks' big man Dereck Lively II to have season-ending foot surgery",
      "Mavericks’ Dereck Lively II out for season with foot injury"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47267194/mavericks-dereck-lively-ii-season-ending-foot-surgery",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/dereck-lively-injury-mavericks-season-ending-foot-surgery/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47267194/mavericks-dereck-lively-ii-season-ending-foot-surgery",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.803,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a sports injury, but it doesn't provide deeper understanding or actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Dallas Mavericks center Dereck Lively II will undergo season-ending surgery on his right foot due to ongoing discomfort, the team announced on Wednesday. The procedure will be performed in London by Dr. James Calder. Lively last played on November 21 and had previously missed multiple games this season. This marks his second procedure on the same foot, following an off-season surgery.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Two buildings fall in Fez at least 22 people die",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 18:40:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Almost two dozen people are confirmed dead after two buildings collapsed in the Moroccan city of Fez.",
      "Two buildings collapse in Morocco's Fez killing 22 people Reuters",
      "At least 22 killed after two buildings collapse in Morocco’s Fez Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Anger after deadly dual building collapse in Morocco",
      "Two buildings collapse in Morocco's Fez killing 22 people - Reuters",
      "At least 22 killed after two buildings collapse in Morocco’s Fez - Al Arabiya English"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/10/anger-after-deadly-dual-building-collapse-in-morocco?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNU0VQOWNjUkZiNHBUTDU4QURsanpCZklMdDZIWGQ4QUlwSDN5bFhYaGVLZWRlSmFCOEZJQkMwd0tZdEpvNWRIZzg4NTVteEU2Rk9SM24yYUZTeTVJajI0d0taODRZNzZ0WkdMXzVRc2pmWEEwdEN2TThwNlVyN1ZhZmxlek9HWDloNFo2X2dZWWJaeGZzdnVYNVZTbGhTQ0ZEM21jTkpFUTl3S0FWYkNYaWRlMGwxR0JDbENtREJ2aDk?oc=5",
      "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPdjQ0OHRYX0ZWUXMwSUJoSnd3SThhSW5CczFidXZsTUVkVm9Tb2d0clhwZV9pS1pvNmtLejR4SUcydEVpSmpzQkdVUHFuV2JlVjVRMWQwSllPZ1lQSF9EYmVMQ3lFZzlSU2JOemZ5RmhKNFNiWF9iOFVFNzlqRzNKbW54cGN2b0xIXy15dDljYjNOWWhCOXdscXJrbmxUa2N0V01FS3c3eVhCWEJOcTA0eUFLNmI1bk9Jclhvc3dyU1M4VzN2eGlkNHVoUmJXSXhWNmpTNThPbWF2QdIB3wFBVV95cUxPaVJNSEFkVFpRbnM0ZXhKWlowU1czZHdJTmVyTW1xcktoNW9RUk5DRk13eDl3MVcwb1Y5eTBfSGdRR1R4WU5Oa0FjbVpvLTBqc2ZYMG5qM0U4Xzg0UUtwbWRtMk9Ca3htczdkWjFLakl3MDZyeG55SUlYcGNNUXdBemI0bzROeEJTYldSMkhORFk1YXFXZVgzRE5WeXA0aTJyNmQ5Q1ZzWHk2bTdxSzJYRHhjVWJYUUREYlpkZGZFb3VFNnRlWS1uUHp3OXFLTXNGRV9udkZDeUpocWlEYndZ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/10/anger-after-deadly-dual-building-collapse-in-morocco?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.948,
      "consensus": 0.769,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.792,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a tragic event, but it doesn't provide much depth or insight. It doesn't discuss potential causes, impacts, or solutions to prevent similar incidents in the future.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Two buildings collapsed in the Moroccan city of Fez, resulting in at least 22 confirmed deaths, according to multiple reports. Rescue operations are ongoing as authorities search for survivors and assess the cause of the collapse.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Australia bans social media for kids under sixteen years old",
    "domain": "science",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 17:07:21 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "New York Times",
      "CBC News",
      "The Guardian",
      "New Scientist"
    ],
    "domains": [
      "abcnews.go.com",
      "nytimes.com",
      "cbc.ca",
      "theguardian.com",
      "newscientist.com"
    ],
    "snippets": [
      "Children younger than 16 years old will be banned from using social media in Australia starting Wednesday.",
      "The measure, which affects anyone under 16, is one of the most sweeping efforts in the world to safeguard young people from the potential harms of the platforms.",
      "Eyes around the world are turned to Australia as its world-first ban on social media for users under age 16 takes effect. The tough new law aims to block Australian children and younger teens from addictive platforms and harmful content online.",
      "Will the world follow suit? Plus: The best books of 2025 • Get 1/3 off a gift subscription of Guardian Weekly Millions of teenagers in Australia woke up on Wednesday to find themselves locked out of social media accounts after the government introduced a ban for under-16s – the first of its kind – o",
      "As Australian teenagers lose access to social media, observers say there are still many unknown questions about the ban, which came into force on 10 December",
      "We asked you to share your views on your children’s use of social media and how the ban is affecting your family. Here is what you told us For some parents, social media sucks up their children’s time and steals them away from family life, instilling mental health issues along the way. For others, i"
    ],
    "image_url": "https://s.abcnews.com/images/International/251209_abc_social_australia_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Australia bans social media for children under 16",
      "Australia’s Social Media Ban for Children Takes Effect",
      "Australia's social media ban for users under 16 starts now",
      "Australia’s social media ban: inside the 12 December Guardian Weekly",
      "Australia's social media ban faces challenges and criticism on day one",
      "‘Already had a profound effect’: parents react to Australia’s social media ban"
    ],
    "url": "https://abcnews.go.com/International/video/australia-bans-social-media-children-16-128255614",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/09/world/asia/australia-social-media-ban-under-16.html",
      "https://www.cbc.ca/news/world/au-social-ban-begins-9.7007357?cmp=rss",
      "https://www.theguardian.com/news/2025/dec/10/australias-social-media-ban-inside-the-12-december-guardian-weekly",
      "https://www.newscientist.com/article/2507948-australias-social-media-ban-faces-challenges-and-criticism-on-day-one/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "https://www.theguardian.com/australia-news/ng-interactive/2025/dec/10/parents-react-to-australias-under-16s-social-media-ban-interactive"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/International/video/australia-bans-social-media-children-16-128255614",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.535,
      "consensus": 0.995,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.773,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about a significant policy change in Australia, which could be useful for readers, especially parents and educators. However, it doesn't seem to delve into the reasons behind this decision, potential impacts, or alternative solutions for the issues it seeks to address.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Australia has implemented a nationwide ban on social media use for anyone under 16 years old, effective December 10, 2025. The new law, described as one of the strictest globally, aims to protect children and young teenagers from online harms and addictive content. Millions of Australian teens have lost access to their accounts as the ban takes effect.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Real Madrid will play Manchester City in Champions League match",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 18:55:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "The Guardian",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Alonso's side have won just one in their last five LaLiga games and were booed following Sunday's loss to Celta Vigo",
      "Elsewhere on the Golazo Starting XI newsletter, UEFA Women's Champions League returns on Tuesday",
      "⚽ Updates from the 8pm GMT kick-off at the Bernabéu ⚽ Live scores | Football Daily | Clockwatch | Email Scott Pre-match postbag. Gotta say, it’s not exactly teeming over. But quality always trumps quantity. “Pep usually seems to overthink Real even more than his other big adversaries. City, who shou",
      "Real Madrid vs Manchester City: Predicted Lineup for the Champions League Clash Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/10/4b7af9bf-1ed7-4a2b-bd52-9d0839505da4/untitled-design-2025-12-10t193851-274.png",
    "titles": [
      "Kylian Mbappe doesn't start as Real Madrid's Xabi Alonso faces Manchester City in huge Champions League clash",
      "Footy Fix: Real Madrid vs. Manchester City headlines huge day for men and women in Champions League action",
      "Golazo 12/10/2025",
      "Real Madrid v Manchester City: Champions League – live",
      "Real Madrid vs Manchester City: Predicted Lineup for the Champions League Clash - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/soccer/news/real-madrids-xabi-alonso-man-city-make-or-break-ucl/",
    "alternate_urls": [
      "https://www.cbssports.com/soccer/news/footy-fix-real-madrid-vs-manchester-city-headlines-huge-day-for-men-and-women-in-champions-league-action/",
      "https://www.cbssports.com/",
      "https://www.theguardian.com/football/live/2025/dec/10/real-madrid-v-manchester-city-champions-league-live",
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxQYTNIOHgzZUNRU21xVE5IOGNVa2tNWXJsTUJINEszNkFIUkpqTm4xX0ZTUnFRNDh4aVZNSVg5VHN4VG4tYlRpbndmMmZVRk42Nk82U0tlWDRKZjAzbFE5TUIySjBaOXFvVDJNSXNSRk92MF9xTWNnRlk1VE1mTzRrTi1idzF2UDNrU2dqWFduNzZTTWo1eVhPbnBiVWE3MmhUMERJc3JXUW93Rm82OGhMXzc4UVh4UHlpYlZXZ2RMdzdKY0J3aU90eXhR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/soccer/news/real-madrids-xabi-alonso-man-city-make-or-break-ucl/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.954,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.772,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a sports event, but it does not offer any deeper understanding, actionable insights, or highlight any progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Alonso's team has won only one of their last five LaLiga matches and faced boos after losing to Celta Vigo on Sunday. The UEFA Women's Champions League resumes on Tuesday. Real Madrid is set to play Manchester City in the Champions League, with predicted lineups discussed ahead of the match.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "US may ask visitors for five years of social media history",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 16:48:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "dw.com",
      "cnbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "The plan would affect people from countries, including the UK, who can fill out a form in lieu of a visa.",
      "The Trump administration wants to force foreign visitors to give border agents access to their social media accounts before they are allowed into the country. The proposal applies to all visa-free travelers.",
      "Tourists from countries including Britain, Japan, France, and Australia will now be expected to provide their social media history to visit to the U.S.",
      "Even visitors from countries like Britain and France, whose citizens don’t need visas, would be required to share five years’ worth of social media."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/db84/live/472b9460-d5e9-11f0-a892-01d657345866.jpg",
    "titles": [
      "US could ask UK tourists for five-year social media history before entry",
      "US demands access to tourists' social media histories",
      "U.S. to mandate checks of some tourists' social media history from past 5 years",
      "U.S. Plans to Scrutinize 5 Years of Social Media History for Foreign Tourists"
    ],
    "url": "https://www.bbc.com/news/articles/c1dz0g2ykpeo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.dw.com/en/us-demands-access-to-tourists-social-media-histories/a-75096949?maca=en-rss-en-top-1022-rdf",
      "https://www.cnbc.com/2025/12/10/us-to-inspect-tourists-social-media-history-from-past-5-years-.html",
      "https://www.nytimes.com/2025/12/09/travel/social-media-tourists-visa-border-patrol.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c1dz0g2ykpeo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.9,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.769,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: could); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "The Trump administration has proposed requiring all visa-free travelers, including those from countries like the UK, Japan, France, and Australia, to provide five years of social media history before entering the U.S. This plan would make foreign visitors give border agents access to their social media accounts as a condition for entry.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Federal Reserve lowers interest rates to make loans cheaper",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 19:00:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "cnbc.com",
      "businessinsider.com"
    ],
    "snippets": [
      "From credit cards and car loans to mortgage rates, student loans and savings accounts, here's a look at the ways a Fed rate cut could affect your finances.",
      "The Fed cut interest rates at its December meeting. Here's how it affects your money — from mortgages and auto loans to credit cards and savings."
    ],
    "image_url": "",
    "titles": [
      "What December's Fed rate cut means for your mortgage, credit card, auto loan, student debt and savings",
      "What the Fed's December interest rate cut means for your wallet"
    ],
    "url": "https://www.cnbc.com/2025/12/10/fed-december-rate-cut-mortgages-loans-savings-impact.html",
    "alternate_urls": [
      "https://www.businessinsider.com/interest-rate-cut-impacts-mortgates-auto-loans-credit-cards-2025-12"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/12/10/fed-december-rate-cut-mortgages-loans-savings-impact.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.766,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for readers on how the Fed's rate cut could affect their personal finances. It increases clarity around the impacts of economic policy decisions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Federal Reserve cut interest rates at its December 2025 meeting. This rate cut is expected to lower borrowing costs for credit cards, car loans, mortgages, and student loans, while also reducing returns on savings accounts. The change aims to make borrowing more affordable for consumers.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Reddit tests gray checkmarks for famous people profiles",
    "domain": "science",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-12-10T14:33:26-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Reddit is starting to test verified profiles, the company announced today. Users who are verified as part of this \"limited alpha test\" will have a gray checkmark next to their username \"across profiles, communities, feeds, post detail pages, and search results.\" For this \"initial test,\" Reddit says",
      "Verified users will actually be notable figures, not just people who paid for the checkmark."
    ],
    "image_url": "",
    "titles": [
      "Reddit is testing verification",
      "Reddit is testing verification badges"
    ],
    "url": "https://www.theverge.com/news/841879/reddit-verification-test",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/10/reddit-is-testing-verification-badges/"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/news/841879/reddit-verification-test",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.76,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about a new feature on a popular platform that could impact their user experience. It provides useful context about the ongoing issue of user verification on social media. However, it doesn't highlight any specific progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Reddit has begun a limited alpha test of verified profiles, marked by a gray checkmark next to usernames. The verification is currently reserved for notable figures, not for users who pay for the feature. The checkmark will appear across profiles, communities, feeds, post detail pages, and search results.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Leon to close some restaurants and cut jobs after buyback",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 19:34:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The \"healthier\" fast food chain confirmed there would be job losses, as it appointed administrators.",
      "The 54-outlet chain was recently bought back by its co-founder, who says Leon must downsize as more customers work from home Fast food chain Leon is planning to close restaurants and cut jobs, less than two months after it was bought back from Asda by its co-founder John Vincent. The chain said on W"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8c11/live/10030ae0-d5e4-11f0-ab62-eb598af64ced.jpg",
    "titles": [
      "High Street food chain Leon to close stores and cut jobs in restructure",
      "Leon to cut jobs and close fast food restaurants"
    ],
    "url": "https://www.bbc.com/news/articles/c33mp5rem05o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/business/2025/dec/10/leon-to-cut-jobs-and-close-fast-food-restaurants"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c33mp5rem05o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.746,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the business decision of a food chain, which may affect employees and customers. It provides useful context about the economic situation, but does not suggest any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Fast food chain Leon will close some restaurants and cut jobs after appointing administrators, following its recent buyback from Asda by co-founder John Vincent. The company cited a drop in in-person customers due to more people working from home as a key reason for the downsizing.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Jayden Daniels will not play in next Commanders game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 14:36:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Commanders QB Jayden Daniels aggravated his elbow injury on a hit against the Vikings and will not play in Week 15 against the Giants.",
      "Quarterback Jayden Daniels will sit out the Washington Commanders’ game at the New York Giants on Sunday after aggravating his injured left elbow last weekend."
    ],
    "image_url": "",
    "titles": [
      "QB Daniels (elbow) shelved again, out vs. Giants",
      "Commanders’ Jayden Daniels out vs. Giants with elbow injury"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47267354/commanders-jayden-daniels-vs-giants-elbow-reinjury",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47267354/commanders-jayden-daniels-vs-giants-elbow-reinjury",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.742,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about QB Daniels' injury status but lacks depth or insight.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Washington Commanders quarterback Jayden Daniels will miss the team’s Week 15 game against the New York Giants after aggravating a left elbow injury during last weekend’s game against the Vikings. Daniels' status for future games has not been announced.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Farmers worry new aid may not cover their losses",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 15:52:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Trump says funds will be made available from tariff revenues and promises trade policies will make US farmers 'strong’.",
      "US farmers say Trump's $12 billion aid package won't cover losses Reuters"
    ],
    "image_url": "",
    "titles": [
      "Trump’s $12bn aid package: Are tariffs bleeding US farmers?",
      "US farmers say Trump's $12 billion aid package won't cover losses - Reuters"
    ],
    "url": "https://www.aljazeera.com/economy/2025/12/10/trumps-12bn-aid-package-are-tariffs-bleeding-us-farmers?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPYWpodGtVZTNHdW5kckUxU3o3eXRDLV8tN3RHVTR4eDFJZ3cxWjM3ZzZhTzZDTWFDajFqcUNkYWpUa3Yxb0ppWHFIbmJfV0xFRUZ2M2VHZVhQaEJDTS1wY2ppMlRVczNoQzFGZndjcmJYdUw5Y2pUQ0lXVDlFNUJrTlowZEQwNEVkRThydE0ycDhOSXRWa2dMa2pIZEwtaWs2MTd2SF9iTEl6MW8?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/12/10/trumps-12bn-aid-package-are-tariffs-bleeding-us-farmers?traffic_source=rss",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.74,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the impact of tariffs on US farmers and the government's response. However, it could be more constructive if it offered more in-depth analysis or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Former President Donald Trump stated that funds from tariff revenues will support U.S. farmers and pledged that new trade policies will strengthen the sector. However, U.S. farmers have expressed concerns that the announced $12 billion aid package will not fully offset their financial losses. The effectiveness of the aid remains in question.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Leaders talk with Donald Trump about Ukraine conflict peace efforts",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 18:15:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "\"Intensive work\" is continuing, the leaders of Britain, France and Germany say after a joint call with Donald Trump.",
      "Europeans discuss Ukraine with Trump at 'critical moment' for peace Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/babc/live/6b869110-d5ea-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "Ukraine at critical moment, European leaders say after Trump call",
      "Europeans discuss Ukraine with Trump at 'critical moment' for peace - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/c5y20p7xweko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOWWZFYzN5U2RLZ2dIRmNENGZGLWhjS3BfLXBrVnZYQ1RzcThVU3ZtWmJ1THRCZXI1dmZCc0NGN3V2eTdzcjcwOEhMY01SUmN3ZW83dFFVblB1amFyZTNXVjdlbGFWcG12Nm81bHI2R1VFOUsxWjlLSTVMeUJObk1xSmMwbDZKMUVCTmh3dUs2MXplRDl6cHBWOXRoU1JoRFF5NWY3QjFNejBSN0U?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c5y20p7xweko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.738,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the geopolitical situation involving Ukraine, the US, and European leaders. However, it lacks depth or insight into the implications of the situation or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Leaders of Britain, France, and Germany held a joint call with Donald Trump to discuss the situation in Ukraine. They described it as a \"critical moment\" for peace and stated that \"intensive work\" is ongoing. The discussions focused on efforts to resolve the conflict, but no specific agreements or outcomes were announced.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Leaders plan video call to talk about peace in Ukraine",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 15:13:04 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Leaders of 'Coalition of the Willing' on Ukraine to meet on Thursday Reuters",
      "Keir Starmer, Emmanuel Macron and others to discuss peace plan as US tries to push through peace deal Leaders of the “coalition of the willing” group of nations will hold a video call on Thursday as chaotic American efforts to push through a peace deal to end the war in Ukraine reach a crunch moment"
    ],
    "image_url": "",
    "titles": [
      "Leaders of 'Coalition of the Willing' on Ukraine to meet on Thursday - Reuters",
      "‘Coalition of the willing’ nations to hold call on ending war in Ukraine"
    ],
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSVh3M3FnTXdBdFRnTWdFek4ydVFaM1g3djVodDAwZC1sc0ZfUHgyeHlwekpNSU83MUpNenZVNXc3czZlM2VJWFZlcklUNF9tVFNkNHJEZWk5b25tUVVaVzgtci1OdVVmeDZ5OTJVUl9NT1lSbUMxTTBLa19VRDVGQ2I0OEhrRzQ2U1ZURFhpOEJGQTQ?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/10/coalition-willing-nations-war-ukraine-keir-starmer-emmanuel-macron"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSVh3M3FnTXdBdFRnTWdFek4ydVFaM1g3djVodDAwZC1sc0ZfUHgyeHlwekpNSU83MUpNenZVNXc3czZlM2VJWFZlcklUNF9tVFNkNHJEZWk5b25tUVVaVzgtci1OdVVmeDZ5OTJVUl9NT1lSbUMxTTBLa19VRDVGQ2I0OEhrRzQ2U1ZURFhpOEJGQTQ?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.861,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.719,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story, while not providing a lot of detail, does inform readers about an upcoming meeting related to the Ukraine crisis. It could potentially provide useful context or insights, depending on the outcome of the meeting.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Leaders of the \"coalition of the willing,\" including Keir Starmer and Emmanuel Macron, will hold a video call on Thursday to discuss a peace plan for Ukraine. The meeting comes as the US intensifies efforts to secure a peace deal to end the war. The talks aim to coordinate international approaches amid ongoing negotiations.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "M23 rebels take control of eastern Congo town Uvira",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 18:09:50 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CBC News"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "Congo rebels enter strategic town as peace deal crumbles Reuters",
      "Rwanda-backed M23 rebels enter east Congo town of Uvira, sources say Reuters",
      "Rwanda-backed rebel group M23 said that it's taken control of the strategic city of Uvira in eastern Congo on Wednesday afternoon, following a rapid offensive since the start of the month."
    ],
    "image_url": "",
    "titles": [
      "Congo rebels enter strategic town as peace deal crumbles - Reuters",
      "Rwanda-backed M23 rebels enter east Congo town of Uvira, sources say - Reuters",
      "Rwanda-backed M23 rebels say they've seized strategic city of Uvira in east Congo"
    ],
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNWdveUxvemlKUFdLRF9Wbno2dTg1TmotbFRZbHNtTWRpV3RIUG01dGlGYmNPYnhZT3p4NXR1S1g5Z0pvZ2JYYU9rQVg5Z3B6ZjJNZFY4dUM0NnFyRHJnalFNUDlTMFgydlZ5SEY0bjNOWW5oWXk5MXE5eWVQWmFDVm9fRDNxWjg5RVNlWFFFRTRiclczSW5Ta3NWYm1OVENjbllfaWVrWEx3cllHY1JqOFEycVVFSFE?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxQalUwOFN4WWRuUXlqdEgxSVc2cEJhTjJudjB2Zlc1VXRzTU1iN0JwSGhOTTFSTFY2OEswVmc5QXV0ajlKYlZpZER3cnk0YVh1N0UwZ2pENkhLWlRlZG1hdkpyTHlqOHZBX3FVYW04UUpnNDFCNVRQZVNhVkgtU25lbkw5UG8yYVd0Y0VPOHloTVFEcG5Yb0ZmQ251OEZSUFVBTWJRa2RiOFRWQzY4MVp2OHdSUQ?oc=5",
      "https://www.cbc.ca/news/world/rwanda-backed-m23-rebels-east-congo-uvira-9.7010033?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNWdveUxvemlKUFdLRF9Wbno2dTg1TmotbFRZbHNtTWRpV3RIUG01dGlGYmNPYnhZT3p4NXR1S1g5Z0pvZ2JYYU9rQVg5Z3B6ZjJNZFY4dUM0NnFyRHJnalFNUDlTMFgydlZ5SEY0bjNOWW5oWXk5MXE5eWVQWmFDVm9fRDNxWjg5RVNlWFFFRTRiclczSW5Ta3NWYm1OVENjbllfaWVrWEx3cllHY1JqOFEycVVFSFE?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.719,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the ongoing conflict in Congo, but it doesn't provide much depth or insight into the causes, impacts, or potential solutions to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Rwanda-backed M23 rebels have taken control of the strategic eastern Congolese town of Uvira, according to multiple sources. The advance follows a rapid offensive by M23 since early December 2025. The development comes as a peace deal in the region collapses.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canada adds four groups to foreign terrorist list",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 17:49:18 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Canada lists four extremist, insurgent groups as foreign terrorist entities Reuters",
      "The move marks the first time any country has listed one of those IMVE groups, 764, as a terrorist organization, a statement from Public Safety Canada said Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Canada lists four extremist, insurgent groups as foreign terrorist entities - Reuters",
      "Canada lists 4 new terrorist entities, including online extremist groups"
    ],
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOSW50OHdYZEZEcV9IYXhDOE4zSVh2NEt4QWtvN3ktbnVwcV9ya20zdDRhdkE3ZktFM21SVHZpOHpDNmp3WHFIYVRac0I0RGlFVXBTQTJUa1JqbWNHSExlZ0x4ekQzcFd5OTQ2WTBLdlY0V3hxakRoczhnT3Q3azNmcFRVczJucy03NUlzX2xQV3VaUHZHTldRTl9YQ2xLMEdWcEtqTkRXVVc5OTMtQkJtMEI3OXNqOS1SZHJ6TWVzSGdRVGRvN0I5elln?oc=5",
    "alternate_urls": [
      "https://globalnews.ca/news/11572033/canada-terrorist-list-764-online-extremism/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOSW50OHdYZEZEcV9IYXhDOE4zSVh2NEt4QWtvN3ktbnVwcV9ya20zdDRhdkE3ZktFM21SVHZpOHpDNmp3WHFIYVRac0I0RGlFVXBTQTJUa1JqbWNHSExlZ0x4ekQzcFd5OTQ2WTBLdlY0V3hxakRoczhnT3Q3azNmcFRVczJucy03NUlzX2xQV3VaUHZHTldRTl9YQ2xLMEdWcEtqTkRXVVc5OTMtQkJtMEI3OXNqOS1SZHJ6TWVzSGdRVGRvN0I5elln?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.716,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about Canada's efforts to combat terrorism. However, it doesn't provide enough depth or insight into the nature of these groups, their activities, or the broader implications of this decision.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Canada has designated four extremist and insurgent groups as foreign terrorist entities, according to Public Safety Canada on Wednesday. This marks the first time any country has listed the IMVE group \"764\" as a terrorist organization. The decision aims to strengthen national security measures against these groups.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Toronto Blue Jays pick pitcher Spencer Miles in Rule 5 Draft",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 19:46:43 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Minnesota adds and subtracts a catcher.",
      "For the second straight year, the Toronto Blue Jays are taking a shot on a pitcher returning from injury in the Rule 5 Draft. The Blue Jays selected 25-year-old Spencer Miles with the 27th pick in Wednesday’s draft at the Winter Meetings in Orlando, Fla. Miles, a six-foot-three right-hander from the San Francisco Giants organization, spent the 2025 season recovering from Tommy John surgery that he underwent in the summer of 2024. A native of Columbia, Mo., Miles has worked into the upper 90s with his sinker and four-seam fastball, which headline an arsenal rounded out by a curveball, changeup..."
    ],
    "image_url": "",
    "titles": [
      "Twins select catcher Daniel Susac in Rule 5 Draft, trade him to Giants",
      "Blue Jays select RHP Spencer Miles from Giants in Rule 5 Draft"
    ],
    "url": "https://sports.yahoo.com/articles/twins-select-catcher-daniel-susac-194643606.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/twins-select-catcher-daniel-susac-194643606.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a player trade in baseball. However, it does not provide any deeper understanding, actionable insights, or highlight any progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Toronto Blue Jays selected pitcher Spencer Miles from the San Francisco Giants organization with the 27th pick in the 2025 Rule 5 Draft. Miles, 25, missed the 2025 season while recovering from Tommy John surgery performed in 2024. He is known for a fastball that reaches the upper 90s and a varied pitching arsenal.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US State Department changes its official font to Times New Roman",
    "domain": "science",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-12-10T11:54:04-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The US State Department is turning back to an old typeface in its latest quest to tear up anything related to diversity or accessibility. In an internal document seen by Reuters and The New York Times, US Secretary of State Marco Rubio said that the Biden-era decision to switch to Calibri typeface i",
      "Calibri, which could make documents easier to read for the vision impaired, was apparently installed in 2023 by the department’s then-DEI office. Rubio’s memo has designated Times New Roman as his tenure’s official font, stating it will “restore decorum and professionalism” to documents."
    ],
    "image_url": "",
    "titles": [
      "Calibri is too woke for the State Department",
      "Marco Rubio bans Calibri font at State Department for being too DEI"
    ],
    "url": "https://www.theverge.com/news/841664/calibri-is-too-woke-for-the-state-department",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/10/marco-rubio-bans-calibri-font-at-state-department-for-being-too-dei/"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/news/841664/calibri-is-too-woke-for-the-state-department",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.689,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a change in the State Department's policy regarding the use of the Calibri font, but it does not offer any deeper understanding, actionable insights, or solutions. The story does not provide enough context or explanation to be useful to the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "US Secretary of State Marco Rubio has directed the State Department to switch its official font from Calibri, adopted in 2023 for accessibility, back to Times New Roman. In an internal memo, Rubio stated the change aims to \"restore decorum and professionalism\" to department documents.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "China group uses Nvidia chips despite US export ban",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 19:02:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The U.S. has blocked the export of Nvidia's Blackwell chips to China in an effort to stay ahead in the AI race.",
      "China’s DeepSeek Uses Banned Nvidia Chips for AI Model, Report Says Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Nvidia responds to report that China's DeepSeek is using its banned Blackwell AI chips",
      "China’s DeepSeek Uses Banned Nvidia Chips for AI Model, Report Says - Bloomberg.com"
    ],
    "url": "https://www.cnbc.com/2025/12/10/nvidia-report-china-deepseek-ai-blackwell-chips.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxNVGE1bUVLeVk2TTRZMUI0Ukhoa2dpVW0yVl9kamVabkhPbGppWXlwUG4xbEx5LWhvT1hrdzg5T2VucHdWa3kwd1RLZzhUYXVaVkhOUWFsOUpXZVd6N080LUlhUS12ZzZxMXZDZnJYRWltbGpRTTRsb19jTEJCMGVoc19mbWs0R0JLSzhJRGpHYU42NU8wMFladGItLUNaN0xLbVVwYkgzcXUyS3JQTDBGMC1pSjV4Y1VJb0UzQ3NMaV9GSm40?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/12/10/nvidia-report-china-deepseek-ai-blackwell-chips.html",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "The U.S. has blocked exports of Nvidia's Blackwell chips to China to maintain a technological edge in artificial intelligence. Despite these restrictions, a Bloomberg report states that China's DeepSeek has used Nvidia chips that are subject to the ban for developing its AI model. The current status of enforcement or potential consequences was not detailed.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Cowboys kicker Brandon Aubrey makes five field goals in game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 10:47:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Connecting on all five of his field goal attempts last week, including one from 63 yards, the Cowboys' Brandon Aubrey is almost a fantasy cheat code.",
      "Take the latest Ravens Reacts survey to share your thoughts about the team’s direction!"
    ],
    "image_url": "",
    "titles": [
      "Rankings for Week 15",
      "Week 15 fantasy football kicker rankings: Best starts at kicker",
      "Ravens Reacts Survey Week 15"
    ],
    "url": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/week-15-fantasy-football-kicker-194244563.html",
      "https://sports.yahoo.com/articles/ravens-reacts-survey-week-15-193802079.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Brandon Aubrey of the Dallas Cowboys made all five of his field goal attempts last week, including a 63-yarder, boosting his status in fantasy football rankings. Eric Karabell’s superflex and positional rankings reflect these performances. Ravens fans are invited to participate in a new survey about the team's direction.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Ukraine may hold elections soon if it gets security help",
    "domain": "politics",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 09:34:18 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "The Ukrainian leader has argued elections in wartime are impossible. But with U.S. and European help, he said Tuesday, a vote could be held within three months.",
      "The Ukrainian president told reporters that a vote could be held in 60 to 90 days if the country received security protections from the United States."
    ],
    "image_url": "",
    "titles": [
      "After Trump criticism, Zelensky says he’s ready to hold elections",
      "Ukraine Could Be ‘Ready for Elections,’ Zelensky Says"
    ],
    "url": "https://www.washingtonpost.com/world/2025/12/09/ukraine-election-zelensky-trump/",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/09/world/europe/zelensky-ukraine-russia-elections.html"
    ],
    "location_scope": "global",
    "link": "https://www.washingtonpost.com/world/2025/12/09/ukraine-election-zelensky-trump/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.736,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the political situation in Ukraine and the influence of foreign criticism. However, it would be more constructive if it delved deeper into the potential impacts of these elections or the systemic issues at play.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "The Ukrainian president stated that national elections could take place within 60 to 90 days if Ukraine receives security guarantees from the United States and European partners. He previously argued that holding elections during wartime is not possible, but indicated that international support could make a vote feasible.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Amazon plans to spend 35 billion dollars in India by 2030",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 15:47:11 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Amazon to invest over $35 billion in India on AI, exports Reuters",
      "Amazon has committed to investing $$35 billion in India’s cloud and AI space by 2030, as hyperscalers race to get a foothold in the market."
    ],
    "image_url": "",
    "titles": [
      "Amazon to invest over $35 billion in India on AI, exports - Reuters",
      "Amazon pledges massive $35 billion worth of investments in India with focus on AI"
    ],
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQc1FtTG9DbGdkeGtic2g3SE1jMWZyS3lKUmYzWGlUTXZId19BTWdUS2N4bVhpd0EyR2Z1SDl4dmhUcDNVUWY5aWlnaFRjbVprOFVLMGhldWNTdTBlWDJsWlJnRkoyRUVjbXdOVGgxUmZyNmJLb2Q5dWxxXy1yZEg3WEJ5N0E3SFFIUElvSWpMYnVQcF9mN1l0bWhkNEVHbXRUMkhhNDZBWDVRZlhaVjJpWjdlSmdSTVdFV0ppcjRERm9FMFVjdTExank3OA?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/12/10/amazon-pledges-35-billion-investments-in-indias-ai-space-through-2030-million-jobs.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQc1FtTG9DbGdkeGtic2g3SE1jMWZyS3lKUmYzWGlUTXZId19BTWdUS2N4bVhpd0EyR2Z1SDl4dmhUcDNVUWY5aWlnaFRjbVprOFVLMGhldWNTdTBlWDJsWlJnRkoyRUVjbXdOVGgxUmZyNmJLb2Q5dWxxXy1yZEg3WEJ5N0E3SFFIUElvSWpMYnVQcF9mN1l0bWhkNEVHbXRUMkhhNDZBWDVRZlhaVjJpWjdlSmdSTVdFV0ppcjRERm9FMFVjdTExank3OA?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.66,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "keywords (1): invest; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Amazon has announced plans to invest over $35 billion in India by 2030, focusing on cloud computing and artificial intelligence. The move is part of a broader effort by major technology companies to expand their presence in India's growing digital economy.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Coupang CEO leaves after large data breach in South Korea",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 06:34:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Coupang CEO resigns after online retailer hit by massive data breach Reuters",
      "Coupang CEO Resigns After South Korea’s Largest-Ever Data Breach Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Coupang CEO resigns after online retailer hit by massive data breach - Reuters",
      "Coupang CEO Resigns After South Korea’s Largest-Ever Data Breach - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNeHc5eTNua3FlQXJQTkJvLUR5ZVowUnR5eGRfWDdRTVNkVEFXU0ZiSkxjSkNoRVpTM002TnFsUTNEVXFTajJQem1nZ0xUdzlGb3V2YXNnQk1uS0NsRGRqOEo3WXlhN3RNeEVxMzh3MjFjX2gtel83aS0zMTRjN09EUC1rOW9hTlI4WF9LOTRadC1lSlZyLWFWck1Hc1A3eXF2b09pbldibm9oRmpQaGtmMlFId2RPeFVlUDRzVHAwMkY?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdmlXLU9paC1ob2c1dzZCcDJNT2dsWHlFTW9FbVhGeXNiTGFndVlhTFd4Q3A4b3VjVjMtVkdzTDNWQU0xY0loVThuQ29ZVTE5Vnd3V3RUTFJKaTZIcWY4N0VmcXBFWFRXNlBLRUdrWVZaTkN6dGRQWU9FdVRfN3BNLTdDTHlrWHlMVFpUYklxVGhLQUNmWFJNeFBNUldEMG81NWlVZGN0UnpVcXZpX3BqVWVVQk5hQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNeHc5eTNua3FlQXJQTkJvLUR5ZVowUnR5eGRfWDdRTVNkVEFXU0ZiSkxjSkNoRVpTM002TnFsUTNEVXFTajJQem1nZ0xUdzlGb3V2YXNnQk1uS0NsRGRqOEo3WXlhN3RNeEVxMzh3MjFjX2gtel83aS0zMTRjN09EUC1rOW9hTlI4WF9LOTRadC1lSlZyLWFWck1Hc1A3eXF2b09pbldibm9oRmpQaGtmMlFId2RPeFVlUDRzVHAwMkY?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.677,
      "consensus": 0.571,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.654,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant event in the tech industry, potentially influencing decisions about data security and trust in online platforms. However, it doesn't offer solutions or deeper insights into the causes or impacts of data breaches.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Coupang's CEO has resigned following a major data breach that affected the South Korean online retailer. The incident is described as the largest data breach in South Korea's history. The company is currently addressing the breach, but further details about the scope and impact have not been disclosed.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Tony Dokoupil becomes new anchor of CBS Evening News",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 15:46:18 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Tony Dokoupil named 'CBS Evening News' anchor in Weiss' network revamp Reuters",
      "Tony Dokoupil has been named the new anchor of CBS Evening News, taking over from co-anchors John Dickerson and Maurice DuBois."
    ],
    "image_url": "",
    "titles": [
      "Tony Dokoupil named 'CBS Evening News' anchor in Weiss' network revamp - Reuters",
      "Tony Dokoupil Named New Anchor Of ‘CBS Evening News’"
    ],
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQZUVCY2xObkpUcDBweXIxOVM4MVdaSWRQVWdNTWhmZmtPZ2M0bkdHVWE4aXpBQzF2blFnV2VSazVWRG44ZXFlajdQejVUV1ZDeG1IeGg2Mk02WXFUMHZPdEExZ2VWcWJCWUQwbmpsVFZ4cXV2dURVVXNFNUhYMDBtSEEtcTNpMldsTC1iR29vckZOYTZFbFNWVXh4Rjc?oc=5",
    "alternate_urls": [
      "https://www.forbes.com/sites/marcberman1/2025/12/10/tony-dokoupil-named-new-anchor-of-cbs-evening-news/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQZUVCY2xObkpUcDBweXIxOVM4MVdaSWRQVWdNTWhmZmtPZ2M0bkdHVWE4aXpBQzF2blFnV2VSazVWRG44ZXFlajdQejVUV1ZDeG1IeGg2Mk02WXFUMHZPdEExZ2VWcWJCWUQwbmpsVFZ4cXV2dURVVXNFNUhYMDBtSEEtcTNpMldsTC1iR29vckZOYTZFbFNWVXh4Rjc?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Tony Dokoupil has been appointed as the new anchor of \"CBS Evening News,\" replacing former co-anchors John Dickerson and Maurice DuBois. The change is part of a network revamp led by Weiss.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Soyuz spacecraft brings three astronauts back to Earth safely",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Wed, 10 Dec 2025 16:03 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "The Soyuz MS-27 spacecraft is seen as it lands in a remote area near the town of Zhezkazgan, Kazakhstan with Expedition 73 NASA astronaut Jonny Kim, and Roscosmos cosmonauts Sergey Ryzhikov and Alexey Zubritsky aboard, Tuesday, Dec. 9, 2025.",
      "The Soyuz MS-27 spacecraft is seen as it lands in a remote area near the town of Zhezkazgan, Kazakhstan on Dec. 9, 2025, with Expedition 73 NASA astronaut Jonny Kim, and Roscosmos cosmonauts Sergey Ryzhikov and Alexey Zubritsky aboard. The trio returned to Earth after logging 245 days in space as me"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/12/54972913396-65ce210d10-o.jpg",
    "titles": [
      "NASA Astronaut Jonny Kim Returns to Earth"
    ],
    "url": "https://www.nasa.gov/image-detail/expedition-73-soyuz-landing-4/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/nasa-astronaut-jonny-kim-returns-to-earth/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/expedition-73-soyuz-landing-4/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.881,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Soyuz MS-27 spacecraft landed safely near Zhezkazgan, Kazakhstan, on December 9, 2025, carrying Expedition 73 NASA astronaut Jonny Kim and Roscosmos cosmonauts Sergey Ryzhikov and Alexey Zubritsky. The crew returned to Earth after spending 245 days in space.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump says he will make a call to end hostilities as Thailand and Cambodia ‘at it again’",
    "domain": "business",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 04:27:51 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "After a ceasefire deal he brokered collapsed, Trump told a rally in Pennsylvania that he would ‘make a call’ to ‘stop a war’ between Thailand and Cambodia US president Donald Trump said on Tuesday that he will make a call regarding reignited hostilities on the Thai-Cambodia border, where fighting ha",
      "Trump Says He’ll Call Thailand, Cambodia Over Renewed Conflict Bloomberg.com"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c682b5afb06f14e27d08f52ed16cbde735558907/518_0_5040_4032/master/5040.jpg?width=140&quality=85&auto=format&fit=max&s=0257cacb7e573bdba6adf6a3d28970e6",
    "titles": [
      "Trump says he will make a call to end hostilities as Thailand and Cambodia ‘at it again’",
      "Trump Says He’ll Call Thailand, Cambodia Over Renewed Conflict - Bloomberg.com"
    ],
    "url": "https://www.theguardian.com/world/2025/dec/10/trump-says-end-hostilities-thailand-cambodia",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNd0ZVM0dBbWNta3pRVGxiTE13ZVJNaUV4TkhQTS1hX1NKVEVEM19RWU5DcTM4WlNsbVA0TFZ6RURXdXpOR1lMUVlreExwUGZJcUd4OVE5S3MwT3RQZ3BYZDZJOW0tMlU5WF9XRXRBclAtLWNQMVFOa0VXYVNjUExqckZoTjVkZDRKT05RMXRoNm1WWGl5WG1EUEwxOW0yVHVUcnUtbXdfQ2kxM05Qano5eW5B?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2025/dec/10/trump-says-end-hostilities-thailand-cambodia",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.639,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.642,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of an international conflict and a potential intervention, but lacks depth or insight into the causes, implications, or potential solutions to the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Adobe plugs Photoshop, Acrobat tools into ChatGPT - Reuters",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 14:00:23 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Adobe plugs Photoshop, Acrobat tools into ChatGPT Reuters",
      "The company on Wednesday said it is adding features from Photoshop, Express, and Acrobat to ChatGPT, letting users ask the chatbot to use these apps to edit images, modify PDFs, or animate elements."
    ],
    "image_url": "",
    "titles": [
      "Adobe plugs Photoshop, Acrobat tools into ChatGPT - Reuters",
      "Adobe brings Photoshop, Express, and Acrobat features to ChatGPT"
    ],
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOMHEwVjBYWnl4NFJjVUhwNjRyRThkV3RqWUU5azM3bG1INjZiTEc1MkFzb3FqVDBySi1icmNTNnpxdEF4TjlhYVdiWFRIdzBuWjU5ekpDc1FmMnNKY0Y4RGg4LXBqVjVGbzlMOTYyRHRjaHRFNE03dVZWeDNSTEtMZVg3Vk8weFdWLWNteGk3Snd0V041TnR1RjJHRQ?oc=5",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/10/adobe-brings-photoshop-express-and-acrobat-features-to-chatgpt/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOMHEwVjBYWnl4NFJjVUhwNjRyRThkV3RqWUU5azM3bG1INjZiTEc1MkFzb3FqVDBySi1icmNTNnpxdEF4TjlhYVdiWFRIdzBuWjU5ekpDc1FmMnNKY0Y4RGg4LXBqVjVGbzlMOTYyRHRjaHRFNE03dVZWeDNSTEtMZVg3Vk8weFdWLWNteGk3Snd0V041TnR1RjJHRQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.832,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Supreme Court poised to strike down Watergate-era campaign finance limits",
    "domain": "politics",
    "source_domain": "latimes.com",
    "location": "national",
    "published": "Tue, 9 Dec 2025 22:50:28 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times",
      "Bloomberg"
    ],
    "domains": [
      "latimes.com",
      "news.google.com"
    ],
    "snippets": [
      "The conservative justices signaled they are likely to rule for Republicans and President Trump. It would allow parties to enlist the help of wealthy donors.",
      "The Supreme Court Might Actually Simplify Campaign Finance Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court poised to strike down Watergate-era campaign finance limits",
      "The Supreme Court Might Actually Simplify Campaign Finance - Bloomberg.com"
    ],
    "url": "https://www.latimes.com/politics/story/2025-12-09/supreme-court-poised-to-strike-down-watergate-era-campaign-finance-limits",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNU2JrNUh1SERjWklJdlNGV0dLa05xR3dONXlMbXZ6TlhXZTJFQTNJLWd2bENGWlFUdDVnYWxIbXlLajRqZWNSWG90TXVfNEtNMFE0cGRPeEZOMFZSU3dtdGVXUTBJajc0OXJQaFhXTUlnTXRnVFVITHFxSWxKVWlCOU9mUnpRd0NPYUd3OXNJMHdLa3Z3VnNxMHh6Q1Y1M0hGbUNOdnh0b3luckxa?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.latimes.com/politics/story/2025-12-09/supreme-court-poised-to-strike-down-watergate-era-campaign-finance-limits",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.546,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.625,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about a significant development in campaign finance laws, which could have wide-ranging implications for future elections. However, without additional context or analysis, it doesn't provide actionable insights or a deeper understanding of the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sperm from donor with cancer-causing gene was used to conceive almost 200 children",
    "domain": "science",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 05:06:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Ars Technica"
    ],
    "domains": [
      "bbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Some children have already died and only a minority who inherit the mutation will escape cancer in their lifetimes.",
      "Children with the mutation have up to a 90% chance of developing cancer by age 60."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/906d/live/ff8d66c0-d4ed-11f0-8c06-f5d460985095.jpg",
    "titles": [
      "Sperm from donor with cancer-causing gene was used to conceive almost 200 children",
      "Sperm donor with rare cancer mutation fathered nearly 200 children in Europe"
    ],
    "url": "https://www.bbc.com/news/articles/ckgmy90z991o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://arstechnica.com/health/2025/12/sperm-donor-with-rare-cancer-mutation-fathered-nearly-200-children-in-europe/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/ckgmy90z991o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.65,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.584,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Musk says DOGE was only \"somewhat successful,\" wouldn't do it again - Axios",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 00:45:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Musk says DOGE was only \"somewhat successful,\" wouldn't do it again Axios",
      "Elon Musk says DOGE 'somewhat successful' but would not do it again Reuters"
    ],
    "image_url": "",
    "titles": [
      "Musk says DOGE was only \"somewhat successful,\" wouldn't do it again - Axios",
      "Elon Musk says DOGE 'somewhat successful' but would not do it again - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE43dnlCYVY5VkpYcmpDOHI0a1J0WGF6ZFpETDZfY0cwdVdveE5pU2JFVWZtNEh1SUVwckNoZ1o4Qnh5X1g1enZGZGc5QTlxZTBUWjBMMGw1al9jZGdBYXpiSFdZa1QyR1NyRmFHWXl5NWNRM3Bn?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOYzVQb2IzeWJvM3RBcHlja0NId0twT05relV4RWV2WGtvbWxKTVFnbHRwQWtxZUtmajNzUWg1TTEzVE9mWEMzenlFcGJoOE43eENtb254SS1JVkJzS29RUXg4eGNDWmZWSVZNc1YyRUtKU0wzRnppVVdFaEdlclJqMndHR0hqenJkU3B4TWhJR3hRNW5MZHdJa01lTlcwTGdUbXkyRzZjNmRTdw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE43dnlCYVY5VkpYcmpDOHI0a1J0WGF6ZFpETDZfY0cwdVdveE5pU2JFVWZtNEh1SUVwckNoZ1o4Qnh5X1g1enZGZGc5QTlxZTBUWjBMMGw1al9jZGdBYXpiSFdZa1QyR1NyRmFHWXl5NWNRM3Bn?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.576,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.564,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "The deep ocean is fixing carbon in ways no one expected",
    "domain": "science",
    "source_domain": "sciencedaily.com",
    "location": "global",
    "published": "Wed, 10 Dec 2025 11:23:29 EST",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "sciencedaily.com"
    ],
    "snippets": [
      "Researchers have uncovered surprising evidence that the deep ocean’s carbon-fixing engine works very differently than long assumed. While ammonia-oxidizing archaea were thought to dominate carbon fixation in the sunless depths, experiments show that other microbes—especially heterotrophs—are doing f",
      "Humans don’t just recognize each other’s voices—our brains also light up for the calls of chimpanzees, hinting at ancient communication roots shared with our closest primate relatives. Researchers found a specialized region in the auditory cortex that reacts distinctly to chimp vocalizations, but no"
    ],
    "image_url": "",
    "titles": [
      "The deep ocean is fixing carbon in ways no one expected",
      "Human brains light up for chimp voices in a way no one expected"
    ],
    "url": "https://www.sciencedaily.com/releases/2025/12/251210092024.htm",
    "alternate_urls": [
      "https://www.sciencedaily.com/releases/2025/12/251209043042.htm"
    ],
    "location_scope": "global",
    "link": "https://www.sciencedaily.com/releases/2025/12/251210092024.htm",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.889,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.499,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "WATCH:  Plane crash lands on I-95 in Florida, hits car",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 10 Dec 2025 06:40:22 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com"
    ],
    "snippets": [
      "The small plane experienced a \"loss of power in both engines,\" according to the NTSB.",
      "Eyewitnesses are speaking out after video captured a small plane apparently losing power before descending quickly to make an emergency landing and crashing on top of a car on I-95."
    ],
    "image_url": "https://s.abcnews.com/images/WNT/251209_wn_oquendo_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Plane crash lands on I-95 in Florida, hits car",
      "WATCH:  Video captures plane landing on Florida highway, crashing into car"
    ],
    "url": "https://abcnews.go.com/WNT/video/plane-crash-lands-95-florida-hits-car-128263433",
    "alternate_urls": [
      "https://abcnews.go.com/US/video/video-captures-plane-landing-florida-highway-crashing-car-128287616"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/WNT/video/plane-crash-lands-95-florida-hits-car-128263433",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.78,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story seems to be more sensational and fear-based. It does not provide any useful insights or deeper understanding, nor does it report on solutions or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]