[
  {
    "title": "Hundreds mourn Palestinian-American teen killed by Israeli forces",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:44:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Footage shows the moment 14-year-old Palestinian teen Omar Mohammad Rabea was allegedly fatally shot by Israeli forces."
    ],
    "image_url": "",
    "summary": "Video evidence has surfaced depicting the incident where Omar Mohammad Rabea, a 14-year-old Palestinian, was reportedly killed by Israeli troops. This development adds to the ongoing tensions and violence in the region.",
    "titles": [
      "Hundreds mourn Palestinian-American teen killed by Israeli forces"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.977,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.49024999999999996,
    "normalized_score": 10.0
  },
  {
    "title": "Trump threatens new 50% tariffs on China",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 21:47:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president says he will introduce the additional tax unless Beijing withdraws its own 34% counter-tariff on American goods."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3835/live/dad0ce70-13d3-11f0-8735-97934b501932.jpg",
    "summary": "The US President announced plans to impose an additional tariff on China if it does not remove its 34% counter-tariff on American goods. This statement escalates the trade tensions between the two countries.",
    "titles": [
      "Trump threatens new 50% tariffs on China"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.991,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47575,
    "normalized_score": 9.36
  },
  {
    "title": "Targeted, killed, burned alive: Journalists in Gaza attacked by Israel",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 15:37:38 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In latest attack on reporters in Gaza, a journalist burns alive and others are wounded in strike on media tent."
    ],
    "image_url": "",
    "summary": "In a recent strike on a media tent in Gaza, a journalist was killed by being burned alive, and several others sustained injuries. This incident marks the latest attack targeting reporters in the region.",
    "titles": [
      "Targeted, killed, burned alive: Journalists in Gaza attacked by Israel"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.906,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47250000000000003,
    "normalized_score": 9.21
  },
  {
    "title": "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 12:45:21 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian servicemen and civilian survivors of deadly attacks say a ceasefire seems a distant prospect."
    ],
    "image_url": "",
    "summary": "Ukrainian servicemen and civilians affected by deadly attacks express skepticism about the likelihood of a ceasefire, indicating ongoing violence and conflict in the region. Their experiences suggest that peace negotiations or a halt in hostilities are not currently anticipated.",
    "titles": [
      "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks"
    ],
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.866,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4685,
    "normalized_score": 9.03
  },
  {
    "title": "Billionaire Trump backer warns of 'economic nuclear winter' over tariffs",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 19:31:13 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bill Ackman says the US president should pause his planned import taxes - or risk shattering investors' confidence."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/39c5/live/31eb8cd0-1399-11f0-b234-07dc7691c360.jpg",
    "summary": "Bill Ackman, a prominent investor, has publicly urged the U.S. President to reconsider implementing planned import taxes, warning that proceeding with these tariffs could significantly undermine investor confidence.",
    "titles": [
      "Billionaire Trump backer warns of 'economic nuclear winter' over tariffs"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.96,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46799999999999997,
    "normalized_score": 9.01
  },
  {
    "title": "Ranking the top 20 goals in Alex Ovechkin's record-breaking career",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 18:21:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Which of his 895 make the list? Here's a countdown chronicling the future Hall of Famer's highlights."
    ],
    "image_url": "",
    "summary": "This article presents a countdown of the top highlights from a future Hall of Famer's career, who has made 895 notable achievements. The focus is on identifying which of these accomplishments are most significant, offering readers a curated look at the athlete's most memorable moments.",
    "titles": [
      "Ranking the top 20 goals in Alex Ovechkin's record-breaking career"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.944,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.366,
    "normalized_score": 4.48
  },
  {
    "title": "Kompany: Total 'faith' in Bayern amid injury crisis",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 16:31:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich will be missing several key players in Tuesday's Champions League quarterfinal first leg clash at home to Inter Milan, but manager Vincent Kompany has complete faith in those that are available."
    ],
    "image_url": "",
    "summary": "Bayern Munich faces Inter Milan in the Champions League quarterfinal first leg without several key players. Despite these absences, manager Vincent Kompany has expressed full confidence in the available squad for Tuesday's home match.",
    "titles": [
      "Kompany: Total 'faith' in Bayern amid injury crisis"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.918,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36550000000000005,
    "normalized_score": 4.46
  },
  {
    "title": "Jurić exits Southampton after PL relegation record",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 17:16:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Southampton have sacked manager Ivan Jurić after the club's relegation from the Premier League, the club confirmed on Monday."
    ],
    "image_url": "",
    "summary": "Southampton FC announced on Monday that they have dismissed manager Ivan Jurić following the team's relegation from the Premier League. This decision comes as a direct consequence of the club's performance, leading to their drop from England's top football division.",
    "titles": [
      "Jurić exits Southampton after PL relegation record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.928,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3620000000000001,
    "normalized_score": 4.3
  },
  {
    "title": "Geno Smith grateful to play for Pete Carroll again, says he has 'unfinished business' with Raiders",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 22:19:41 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pete Carroll came to Geno Smith's rescue once before, salvaging what was an NFL career seemingly headed nowhere.  Smith's career wasn't at a point where he needed to be rescued again, but his future in Seattle had reached an impasse, creating uncertainty where the 34-year-old quarterback would go next.  Las Vegas turned out to be that place, a chance for Smith to reunite with his former coach as Carroll begins a new stint with the Raiders."
    ],
    "image_url": "",
    "summary": "Pete Carroll, previously instrumental in reviving Geno Smith's NFL career, is set to reunite with the 34-year-old quarterback as he begins a new coaching role with the Las Vegas Raiders. This move comes after Smith's future in Seattle reached an uncertain point, signaling a significant shift for both the player and coach. This transition offers Smith a fresh opportunity in Las Vegas under Carroll's guidance.",
    "titles": [
      "Geno Smith grateful to play for Pete Carroll again, says he has 'unfinished business' with Raiders"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.999,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35575,
    "normalized_score": 4.02
  },
  {
    "title": "Tai 'honored' to be first Singaporean to play in the Masters",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 22:08:20 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hiroshi Tai will make history as the first Singaporean golfer to play in the Masters this week, but the 23-year-old can count on a strong Georgia connection to buoy his bid for low amateur honors at Augusta National.&quot;So there's a lot of history at Georgia Tech and connected with the Masters."
    ],
    "image_url": "",
    "summary": "Hiroshi Tai, a 23-year-old Singaporean golfer, will make history as the first from his country to compete in the Masters. With strong ties to Georgia, where he has connections through Georgia Tech, Tai aims for low amateur honors at Augusta National.",
    "titles": [
      "Tai 'honored' to be first Singaporean to play in the Masters"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.99
  },
  {
    "title": "Trump Tariff Uncertainty Could Make for a Bumpy Q1 Earnings Season",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:13:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/oqNFBguft5nyUofQh5M1aoXG-98=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208451972-a1e95bd5bd09471eade522883a48fc6b.jpg\" title=\"raders work on the floor of the New York Stock Exchange.\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p></i></figcaption></figure><p>Tariff uncertainty continued to wreak havoc on global markets as businesses and investors braced for tariffs that are expected to lift the U.S. tariff rate to <a href=\"https://www.investopedia.com/trump-s-trade-policy-turns-back-the-clock-to-the-days-of-hawley-smoot-11708706\">its highest level in more than a century</a>. </p><p>That uncertainty is likely to remain high when S&amp;P 500 companies begin reporting first-quarter results later this week. Wall Street analysts have been increasingly <a href=\"https://www.investopedia.com/a-new-earnings-season-is-almost-here-analysts-are-growing-cautious-11709586\">cautious with their outlooks</a>, and some market watchers are forecasting a sharp drop in the number of companies issuing guidance for the current quarter and the remainder of the year. </p><p>The tariff outlook remained murky Monday, with U.S. stocks <a href=\"https://www.investopedia.com/dow-jones-today-04072025-11710097\">wavering between gains and losses</a> as Trump threatened to slap <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">an additional 50% tariff</a> on Chinese goods in response to <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">China's retaliatory tariffs</a>. The White House also today quashed rumors that Trump was mulling a 90-day pause on reciprocal tariffs.</p><p>The tariffs outlined by Trump last week could <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">scramble global supply chains</a>, <a href=\"https://www.investopedia.com/economists-see-greater-chance-of-recession-with-trump-tariffs-11710261\">raise the risk of a recession</a>, and stoke inflation. In a sign of the times, 421 sell-side broker reports published last week mentioned the word “chaos,” more than twice the prior week’s total, according to AlphaSense. In just the last two days, “chaos” has cropped up in more than 100 such reports.</p><p>Companies may choose caution as they report results; ones that have already offered first-quarter guidance have been <a href=\"https://www.investopedia.com/more-s-and-p-500-companies-are-giving-downbeat-outlooks-11706496\">increasingly wary</a>.</p><p>“We will see an upcoming earnings season for 1Q in which it would not surprise us if many companies/mgmt teams did not give guidance,” Wedbush analysts wrote last week.<span class=\"ql-inline-citation\"></span> They expect this coming earnings season to resemble early 2020 when uncertainty about the spread of Covid-19 and the longevity of lockdowns caused the number of S&amp;P 500 companies issuing guidance to plummet by more than 50% year-over-year, according to data from FactSet Research.</p><p>Market participants are already struggling to make sense of Trump’s tariffs and the impact they could have on their investments. Less guidance would likely reduce investors’ visibility even further, making it more difficult to model earnings growth and, thus, value debt and equity. </p><p>\"At a minimum, we will likely see companies give more conservative guidance or wider ranges than normal for guidance,\" said John Butters, Vice President and Senior Earnings Analyst at FactSet.</p><p>White House National Economic Council Director Kevin Hassett on Sunday said more than 50 countries had initiated talks with the administration, seeking relief from the tariffs set to take effect on Wednesday.<span class=\"ql-inline-citation\"></span> </p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/oqNFBguft5nyUofQh5M1aoXG-98=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208451972-a1e95bd5bd09471eade522883a48fc6b.jpg",
    "summary": "Tariff uncertainty is impacting global markets as the U.S. prepares to implement tariffs that could push its tariff rate to the highest in over a century. This uncertainty is expected to affect the upcoming S&P 500 companies' first-quarter earnings reports, with analysts predicting cautious outlooks and a potential decrease in companies issuing guidance. The tariffs, threatened by Trump in response to China's retaliatory measures, risk scrambling global supply chains, increasing recession chances, and stoking inflation. Recent reports show a significant mention of \"chaos\" in financial analyses",
    "titles": [
      "Trump Tariff Uncertainty Could Make for a Bumpy Q1 Earnings Season"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.11
  },
  {
    "title": "Apple Plans To Ship More iPhones From India Amid Steep China Tariffs, Report Says",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 21:23:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"CFOTO / Getty Images\" src=\"https://www.investopedia.com/thmb/od_FGA59_KgUG63OKa--Na5w00s=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208409846-8e2bcd391e694d5cbc2c45315c286771.jpg\" title=\"Person interacts with iPhone display.\" /><figcaption><i><p>CFOTO / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Apple intends to send more iPhones to the U.S. from India in response to high tariffs on goods from China, according to a <em>Wall Street Journal</em> report Monday.</li><li>The measure is thought to be temporary while the company tries to win a tariff exemption from the Trump administration.</li><li>Apple shares have lost about a fifth of their value since the Trump administration announced sweeping new tariffs last Wednesday.</li></ul><br /><br /><p>Apple (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AAPL\">AAPL</a>) plans to send more iPhones to the U.S. from India in response to the Trump administration’s steep tariffs on goods from China, according to a <em>Wall Street Journal </em>report Monday.<span class=\"ql-inline-citation\"></span></p><p>The move is reportedly considered a short-term measure as Apple works to secure an exemption from the tariffs, like the one it received from the tariffs President Trump imposed during his first administration. </p><p>Apple did not immediately respond to a request for comment. </p><p>Trump announced a 34% tariff on goods from China <a href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">last week</a>, on top of a 20% import tax imposed earlier in the year. Tariffs on Chinese goods could also rise further, <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">Trump warned Monday</a>, if the administration responds to China’s decision Friday to institute a <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">34% tariff</a> on U.S. goods with a higher rate. Trump had announced a <a href=\"https://www.investopedia.com/how-much-reciprocal-tariff-will-be-for-each-country-trump-trade-11708072\">26% tariff</a> on goods from India, by comparison. </p><p>Apple manufactures 90% of its hardware in China, and the company would need to <a class=\"pseudoStyle\" href=\"https://www.investopedia.com/apple-leads-magnificent-7-stocks-lower-as-higher-than-expected-trump-tariffs-land-11708306\">raise prices</a> 6% in order to offset the impact of tariffs if it isn't granted an exemption, JPMorgan analysts said last week. Potentially helping Apple's case is an announcement in February that it plans to invest more than <a href=\"https://www.investopedia.com/apple-plans-investment-in-us-in-next-four-years-on-texas-ai-factory-11685001\">$500 billion</a> in the U.S. over the next four years, the analysts said.</p><p>Shares of the iPhone maker dropped close to 4% in Monday's session and have lost about a fifth of their value since the tariffs were announced last Wednesday through Monday’s close.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/od_FGA59_KgUG63OKa--Na5w00s=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208409846-8e2bcd391e694d5cbc2c45315c286771.jpg",
    "summary": "Apple is increasing iPhone shipments from India to the U.S. as a short-term response to avoid high tariffs on Chinese goods imposed by the Trump administration. The company is seeking a tariff exemption, similar to one it previously received. This move comes after Apple's shares fell by approximately 20% following the announcement of new tariffs. Apple, which produces 90% of its hardware in China, might have to raise prices by 6% without an exemption. The company announced plans to invest over $500 billion in the U.S. over the next four years, potentially supporting its case for an exemption.",
    "titles": [
      "Apple Plans To Ship More iPhones From India Amid Steep China Tariffs, Report Says"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.986,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4685,
    "normalized_score": 9.03
  },
  {
    "title": "Trump says he is ‘not looking’ at a pause in tariffs to allow trade negotiations",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 21:03:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Markets swing as Washington says it will kick off trade talks with Japan"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fee54ac38-df7c-423f-86f8-7dd058a4e954.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The U.S. government announced the initiation of trade negotiations with Japan, leading to fluctuations in the financial markets. This decision marks a significant step in international trade relations between the two countries.",
    "titles": [
      "Trump says he is ‘not looking’ at a pause in tariffs to allow trade negotiations"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.981,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46724999999999994,
    "normalized_score": 8.98
  },
  {
    "title": "EU drops bourbon, wine and dairy products from tariffs list against US",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:31:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "‘We are not in the business of tit-for-tat or penny for penny’, says EU commissioner Maroš Šefčovič"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff147a979-c0f6-4d7c-9fb8-8d95d12baee0.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "EU Commissioner Maroš Šefčovič stated that the European Union does not engage in retaliatory or equivalent exchange tactics, emphasizing a commitment to not participating in actions described as \"tit-for-tat or penny for penny.\" This declaration underlines the EU's approach to diplomacy and negotiations, focusing on principles other than direct retaliation.",
    "titles": [
      "EU drops bourbon, wine and dairy products from tariffs list against US"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.974,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4655,
    "normalized_score": 8.9
  },
  {
    "title": "Billionaire financiers lambast Trump tariffs",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 18:39:34 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alarm at market turmoil prompts even allies of the president to speak out"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F77894eed-c44d-4edd-a235-ed482fb35989.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "Market turmoil has led to widespread concern, prompting even allies of the president to publicly express their unease. The situation reflects growing alarm over financial instability, indicating significant discontent within the president's own circle. This development suggests a notable shift in support amidst ongoing economic challenges.",
    "titles": [
      "Billionaire financiers lambast Trump tariffs"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.948,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46499999999999997,
    "normalized_score": 8.88
  },
  {
    "title": "Experimental medication helps treat cocaine addiction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:30:08 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recently developed medication encourages people with cocaine use disorder to reduce their intake of the stimulant – a step towards the first approved drugs to treat the problem"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07172220/SEI_246656352.jpg",
    "summary": "A new medication has been developed to help individuals with cocaine use disorder cut down on their stimulant consumption. This marks a significant advancement towards the creation of the first officially approved drugs aimed at treating this condition.",
    "titles": [
      "Experimental medication helps treat cocaine addiction"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.959,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45575,
    "normalized_score": 8.47
  },
  {
    "title": "No, the dire wolf has not been brought back from extinction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:45:32 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colossal Biosciences claims three pups born recently are dire wolves, but they are actually grey wolves with genetic edits intended to make them resemble the lost species"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07192142/sei246690536.jpg",
    "summary": "Colossal Biosciences recently announced the birth of three pups, claiming they are dire wolves. However, these animals are genetically edited grey wolves, modified to mimic the extinct species' characteristics. This revelation clarifies the true nature of the pups as part of the company's efforts to recreate the appearance of dire wolves through genetic engineering.",
    "titles": [
      "No, the dire wolf has not been brought back from extinction"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45075,
    "normalized_score": 8.24
  },
  {
    "title": "DOGE ditching tape storage could put data at risk, say experts",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 18:49:22 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "President Trump's DOGE team, headed by Elon Musk, claims to have saved $1 million by ditching 70-year-old tape data storage. But experts say the move will likely end up costing more in the long term and could put data at risk"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07173657/SEI_246690152.jpg",
    "summary": "President Trump's DOGE team, led by Elon Musk, announced a $1 million saving by replacing 70-year-old tape data storage. However, experts warn this decision may result in higher long-term costs and potential data security risks.",
    "titles": [
      "DOGE ditching tape storage could put data at risk, say experts"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.936,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44400000000000006,
    "normalized_score": 7.94
  },
  {
    "title": "Bacteria-inspired robot uses 12 spinning flagella to roam underwater",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 17:35:58 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An underwater drone with long, spinning arms like the flagella of bacteria could survey the seas without endangering marine life, its creators claim"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/03155756/SEI_246037261.jpg",
    "summary": "Researchers have developed an underwater drone designed with long, spinning arms resembling bacterial flagella. This innovative design aims to conduct oceanic surveys while minimizing harm to marine life. The creators assert that this drone offers a safer alternative for marine exploration compared to traditional methods.",
    "titles": [
      "Bacteria-inspired robot uses 12 spinning flagella to roam underwater"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.919,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43975,
    "normalized_score": 7.76
  },
  {
    "title": "We're finally uncovering fibre's remarkable benefits for body and mind",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 17:05:00 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "From dampening inflammation to boosting mental health, the many types of dietary fibre have a surprisingly large impact throughout the body. Here's how to get your fill"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07123716/SEI_246663136.jpg",
    "summary": "Dietary fiber is recognized for its extensive health benefits, including reducing inflammation and enhancing mental health. It plays a significant role in overall bodily health. The article emphasizes the importance of incorporating various types of fiber into one's diet to achieve these health benefits.",
    "titles": [
      "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.912,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43800000000000006,
    "normalized_score": 7.68
  }
]