[
  {
    "title": "Trump Supports Releasing Unclassified Epstein Files, Reversing Stance",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 07:34:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "NPR",
      "Axios",
      "ABC News",
      "Reuters",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "Forbes",
      "Bloomberg",
      "CityNews",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com",
      "npr.org",
      "news.google.com",
      "abcnews.go.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "forbes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "US president backs bipartisan push to release documents amid tensions within his Republican base.",
      "US President Donald Trump says he backs the release of more files related to sex offender Jeffrey Epstein. He was previously opposed to doing so.",
      "\"We have nothing to hide,\" the US president writes after previously resisting publishing the documents.",
      "Members of the House, including some Republicans, have forced a vote as early as Tuesday to release unclassified files held by the government.",
      "In a shift, Trump says House GOP should vote for Epstein files' release Axios",
      "House vote on a bill to compel the release of the Epstein could be a rare example of Republican lawmakers openly breaking with President Donald Trump.",
      "Trump reverses stance on Epstein files, urges Republicans to vote for releasing them Reuters",
      "U.S. President Donald Trump has called on Congressional Republicans to vote to release files related to deceased convicted sex offender Jeffrey Epstein.",
      "US president’s U-turn comes as Republicans prepare to defy him over documents related to late sex offender",
      "The US president has said he backs US lawmakers efforts to release the files, ahead of an expected House vote this week US president Donald Trump has urged his fellow Republicans in Congress to vote for the release of files related to the late convicted sex offender Jeffrey Epstein, reversing his ea",
      "The president had earlier dismissed the issue as a “Democratic Hoax” and publicly feuded with Republicans pushing for the release of these files.",
      "Trump Urges House to Vote for Epstein Files Release in Reversal Bloomberg.com",
      "WASHINGTON (AP) — President Donald Trump said House Republicans should vote to release the files in the Jeffrey Epstein case, a startling reversal after previously fighting the proposal as a growing number of those in his own party supported it. “We have nothing to hide, and it’s time to move on fro",
      "In reversal, Trump says House Republicans should vote to release Epstein files AP News"
    ],
    "image_url": "",
    "titles": [
      "Trump backs full release of Epstein files in sharp reversal",
      "Trump calls on Republicans to vote to release Epstein files",
      "Trump reverses position and urges own party to vote for release of Epstein files",
      "In a shift, Trump says House Republicans should vote to release Epstein files",
      "In a shift, Trump says House GOP should vote for Epstein files' release - Axios",
      "Trump calls for Republicans to vote to release Epstein files",
      "Trump reverses stance on Epstein files, urges Republicans to vote for releasing them - Reuters",
      "Trump reverses stance on Epstein records, presses Republicans to support release",
      "Trump backs vote to release Epstein files",
      "Trump tells Republicans to vote to release Epstein files, in a reversal of his previous stance",
      "Trump Now Says Republicans Should Vote To Release Epstein Files: ‘I Don’t Care’",
      "Trump Urges House to Vote for Epstein Files Release in Reversal - Bloomberg.com",
      "In reversal, Trump says House Republicans should vote to release Epstein files",
      "In reversal, Trump says House Republicans should vote to release Epstein files - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/trump-backs-full-release-of-epstein-files-in-sharp-reversal?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/trump-calls-on-republicans-to-vote-to-release-epstein-files/a-74771084?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/cvgv653v1vjo?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/11/16/nx-s1-5610552/trump-house-republicans-epstein-files",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdk96T3JqLVByaUxYYXdId29sR2JCSFR1Wlp5b3VrVUhmRkl5U01oc3BkSUdJRWxCbmJBa2Yxekdab2JhRTBBb3BKbkNOckpXVXFINjQtWWRDOVVPMlFmdkxTTmRjc2lXaVhzV3RCWDc0Z25DTjlaaXA3b1YyMHpGVnRlR0NZbWRzQXZ2aWhKc0c?oc=5",
      "https://abcnews.go.com/Politics/vote-epstein-files-rare-republican-break-trump/story?id=127575911",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxNZkl4eHpRNm03TVc1N2NSUmdCVmRXS0VHUnh6NzBsQXZIUno3c0FNQ25BQjAxV21MRk5OWm9kWjdfaU5Lc0F5NzluME0tS2N4ZzRxRkU5Q0tqVXRKUy1UdXJSeldtZzN4SFY5ZjFob2VHM20yREVtd3FsVk02ZzdoWktHZ0FCX1VraXFBWFBHX2VGOW5DWlM4RkNuYTlmUEwyLVhwNk5UTQ?oc=5",
      "https://www.cnbc.com/2025/11/17/trump-reverses-stance-on-epstein-records-presses-republicans-to-support-release.html",
      "https://www.ft.com/content/017744aa-b1d3-49fa-aac3-620264c0aca7",
      "https://www.theguardian.com/us-news/2025/nov/17/trump-tells-republicans-to-vote-to-release-epstein-files-saying-we-have-nothing-to-hide",
      "https://www.forbes.com/sites/siladityaray/2025/11/17/trump-now-says-republicans-should-vote-to-release-epstein-files-i-dont-care/",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNRnE1dXRVLXd4V2tFTVdOa19icXh3N2YzYmttd0M5UFBvVW5lVmRCVlF6ZHI2a211OFVYNWlQOWxsNjhEU3cwUDdXZzAzX3JwSjZLcXc2ODhicWhOcnlQaTd3bUdvM0draGQ0UmQxZzl6UGdFMTFaeXYzVTNKb2FndjZLcllqUlRRQzJVN08zaVN5QXdHNXpDSjRGdVp4dXcxX3RZQmRkU05oOGxHY0xRSTZSQQ?oc=5",
      "https://ottawa.citynews.ca/2025/11/16/many-house-republicans-will-back-a-bill-to-release-epstein-files-leaders-of-the-effort-say/",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxONTN4ZVpKb2tVNDBmTnNMY21rZjAyVHNDSkl0ZmJta3lSUklGVzZyNkFLU3dHeDFpNDg5eU9XMlVsd2dKSTI1d2l5MTh0SGZkaThibjNJbFFWdFJiYUR0dTMtNzlNS1YtVzljYVhtZUdzSnJWOXczdmt1bGxnbVVWSmk2Zjh2dTZMQzRNLW4tYkFGT2c1di1ITVBsOFRYdEJTQk9IT1ZSNXRuNmd3dEE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/trump-backs-full-release-of-epstein-files-in-sharp-reversal?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.947,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.899,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump has reversed his previous stance and now supports the release of unclassified files related to Jeffrey Epstein. He stated on Truth Social that \"we have nothing to hide,\" aligning with House Republicans, some of whom had already pushed for a vote to release these files. This marks a notable shift as Trump had previously opposed making more of the Epstein files public. A vote in the House is expected to take place as early as Tuesday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a change in stance by a prominent political figure, which could influence public understanding and discourse on the Epstein case. However, it does not offer insights into solutions or improvements, nor does it significantly increase clarity around systems, causes, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Saskatchewan Roughriders Win Fifth Grey Cup, Defeat Montreal 25-17",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 17 Nov 2025 05:12:50 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet",
      "Globe and Mail",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Trevor Harris was named the Grey Cup MVP after the Roughriders won their fifth Grey Cup with a 25-17 victory over Montreal at Princess Auto Stadium.",
      "The Roughriders won their fifth Grey Cup title with a clutch late defensive stand to defeat the Alouettes 25-17 in Winnipeg.",
      "Trevor Harris put together a historic performance that helped Saskatchewan Roughriders earn their fifth Grey Cup title and their first since 2013.",
      "Sean Reynolds and Justin Dunk discuss the 112th edition of the Grey Cup after Trevor Harris led the Saskatchewan Roughriders to victory over the Montreal Alouettes.",
      "Roughriders win Grey Cup with 25-17 victory over Alouettes The Globe and Mail",
      "Trevor Harris threw for 302 yards en route to MVP honours and the Saskatchewan Roughriders defence forced four turnovers to defeat the Montreal Alouettes 25-17 in the 112th Grey Cup.",
      "The Saskatchewan Roughriders are Grey Cup Champions for the fifth time in their long history. The Riders would dominate the Alouettes for the majority of the game, scoring 24 straight points before the Alouettes attempted a late rally, which would come up short on a fumble that was forced by Tevaugh",
      "Saskatchewan Roughriders’ Trevor Harris reflects on the team’s overcoming adversity to win the Grey Cup and touches on why he’s happy to take home the championship to a much-deserving fanbase.",
      "Saskatchewan Roughriders running back A.J. Ouellette joins Sean Reynolds after his team’s 25-17 win in the 112th Grey Cup, discussing the poise displayed by the group and how they approached the big game.",
      "The Saskatchewan Roughriders are presented the 2025 Grey Cup after defeating the Montreal Alouettes 25-17.",
      "WINNIPEG — The Saskatchewan Roughriders’ first Grey Cup win in 12 years had green confetti raining down on the field at Winnipeg’s Princess Auto Stadium and green-and-white clad fans spilling out onto the street in pure merriment. The Prairie team beat the Montreal Alouettes 25-17 to take the cup on"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/1d6523d1b423d363f1b9b5af7b029e07356c87ef324aa9f85ab6c8264e4f1e25.jpg?quality=65&strip=all",
    "titles": [
      "Roughriders beat Alouettes 25-17 to give MVP Trevor Harris his first Grey Cup as a starter",
      "Saskatchewan Roughriders beat Montreal Alouettes for fifth Grey Cup",
      "Trevor Harris, Roughriders achieve long-awaited Grey Cup glory",
      "Roughriders’ Harris cements legacy with Grey Cup win as starter",
      "Roughriders win Grey Cup with 25-17 victory over Alouettes - The Globe and Mail",
      "112th Grey Cup Highlights: Roughriders 25, Alouettes 17",
      "Riders win 112th Grey Cup 25-17 over Alouettes",
      "‘I love this group’: Roughriders’ Harris reflects on path to Grey Cup",
      "Ouellette on Roughriders’ poise in Grey Cup: ‘Came out fast and finished strong’",
      "Roughriders lift Grey Cup for first time since 2013",
      "‘Fan-demonium:’ Saskatchewan Roughriders celebrate ending 12-year Grey Cup drought"
    ],
    "url": "https://globalnews.ca/news/11528930/roughriders-beat-alouettes-25-17-to-give-mvp-trevor-harris-his-first-grey-cup-as-a-starter/",
    "alternate_urls": [
      "https://globalnews.ca/news/11528671/roughriders-beat-alouettes-fifth-grey-cup/",
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNUmZXVnNETmNIdVE0NUdDTkVGaUNqdl9rbTZWcnlyYWdENGJ3OHNEdXBiNWFqRHA2QmRITWVUVnNzelZ2YVVkZDFiakUwVkJ3QmNNQkJ4V0VhUUpOcFNYai1DZ2hkbl9Ob2RCbVBJZWRGYUV6R3haMFM0TmJDeGg0eGozZ3lDUEhGSldhY2t5Y2FhSkpmcHdsOUVROU9ZX3BBNWJXYmdjQ1Jxeml6ZGlOaTJHTmxWYlNj?oc=5",
      "https://ottawa.citynews.ca/2025/11/16/112th-grey-cup-coverage/",
      "https://ottawa.citynews.ca/2025/11/16/prime-minister-mark-carney-met-with-cheers-and-boos-at-112th-grey-cup-game/"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11528930/roughriders-beat-alouettes-25-17-to-give-mvp-trevor-harris-his-first-grey-cup-as-a-starter/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.902,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.88,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Saskatchewan Roughriders won their fifth Grey Cup title, defeating the Montreal Alouettes 25-17. Dominating for most of the game and scoring 24 straight points, their victory marks their first championship since 2013. Trevor Harris, named MVP, led the team with his first Grey Cup win as a starting quarterback, contributing to the victory with 23-of-27 passes for 302 yards.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Saskatchewan Roughriders' victory in the Grey Cup, including details about the game and the performance of the team's quarterback. However, it does not provide deeper insights into the significance of the victory or its impact on the team and the league.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Sinner Defeats Alcaraz to Win ATP Finals, Defends Title in Turin",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 00:30:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "skysports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Jannik Sinner beat Carlos Alcaraz for just the second time this year and defended his ATP Finals crown in Turin.",
      "Sinner wins Alcaraz battle to retain ATP Finals title Reuters",
      "Italian wins 7-6 (4), 7-5 in Turin final Sinner finishes year with six titles On his favourite surface and before a rowdy home crowd, Jannik Sinner closed out his immense season with a statement victory against his great rival Carlos Alcaraz, putting together a supreme performance to defeat the Span",
      "Jannik Sinner saw off close rival Carlos Alcaraz to clinch the ATP Finals title with a 7-6 (7-4) 7-5 victory after the Spaniard struggled with a hamstring injury.",
      "The final installment of the “Sincaraz” rivalry for 2025 went to Jannik Sinner. The second-ranked Sinner beat the top-ranked Carlos Alcaraz 7-6 (4), 7-5 for the ATP Finals trophy on Sunday in the sixth meeting this year between the two players who are dominating men’s tennis."
    ],
    "image_url": "",
    "titles": [
      "Sinner defeats Alcaraz to repeat as ATP Finals champion",
      "Sinner wins Alcaraz battle to retain ATP Finals title - Reuters",
      "Jannik Sinner sees off Carlos Alcaraz in straight sets to defend ATP Finals title",
      "Sinner clinches ATP Finals title as Alcaraz toils with hamstring injury",
      "Sinner beats Alcaraz to defend ATP Finals title before home fans"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/17/sinner-defeats-alcaraz-to-repeat-as-atp-finals-champion?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcHhmVHNpeEVtVXdBSVNIYV93a2JDdTBVNTdEaDg1aXVqT3o2dEd6cjlLWXdoU1BXTFZXVWJlLVFDcXYyRjVuenljc3NqTlNWei1pQy1mZ043MDNxTHNCMUluZU5zSXludjVTT0VYTFh0bnI5dVowNzBkaGhKME1kTnpHYmhCMWpDc0NoeFBjRUswa29kS0RibHVpdTA3UnM?oc=5",
      "https://www.theguardian.com/sport/2025/nov/16/jannik-sinnner-carlos-alcarez-atp-finals-turin-match-report",
      "https://www.skysports.com/tennis/news/12040/13471332/atp-finals-finale-jannik-sinner-clinches-title-as-carlos-alcaraz-toils-with-hamstring-injury-in-turin"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/17/sinner-defeats-alcaraz-to-repeat-as-atp-finals-champion?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.818,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.843,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jannik Sinner defeated world number one Carlos Alcaraz 7-6 (7-4), 7-5 to win the ATP Finals in Turin, defending his title in their sixth matchup of 2025. Alcaraz struggled with a hamstring injury during the match, marking a significant moment in the \"Sincaraz\" rivalry.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the event but does not offer deep insights or actionable information. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shedeur Sanders Debuts as Browns QB Against Ravens, Completes First Pass",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 16 Nov 2025 23:44:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Sports Illustrated",
      "Sportsnet",
      "Associated Press"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Sanders completed his first NFL pass",
      "Shedeur Sanders Makes NFL Debut for Browns vs. Ravens After Dillon Gabriel Concussion Bleacher Report",
      "How Shedeur Sanders Performed in NFL Debut With Browns Sports Illustrated",
      "Browns quarterback Shedeur Sanders made his NFL debut in the second half of Sunday’s game against the Baltimore Ravens.",
      "Browns QB Shedeur Sanders has a rough NFL debut after relieving the injured Dillon Gabriel AP News"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/16/5f24c63d-06b3-4ff1-b64b-2513a18c4683/shedeur-sanders-browns.jpg",
    "titles": [
      "Shedeur Sanders makes NFL debut: Former Colorado star QB enters after Dillon Gabriel exits with concussion",
      "Shedeur Sanders Makes NFL Debut for Browns vs. Ravens After Dillon Gabriel Concussion - Bleacher Report",
      "How Shedeur Sanders Performed in NFL Debut With Browns - Sports Illustrated",
      "Browns QB Shedeur Sanders has rough debut after Dillon Gabriel exits",
      "Browns QB Shedeur Sanders has a rough NFL debut after relieving the injured Dillon Gabriel - AP News"
    ],
    "url": "https://www.cbssports.com/nfl/news/shedeur-sanders-nfl-debut-cleveland-browns-qb/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPMlh0TFAtLXROdG5sSlRLbVZWY2tRODNIel9yOFdITGJPYW1PUWZUbVdJYjd6WnBYNmZRU2FkcmNST1FHUFppOERvWmRKOVNCOWZOMm9qWUR6aFNMd1c3RzhQY0lZbDdXS2ZzZGVZaS1OazlVR09zUGhTeXRtYldKWTlXOWprdDVTT2lHZHVFZklyZnpqMVFCQ1gxRVlGYmhIbHE0RG9ZWFVMQ191MXFLLWRQdF94Y1p3Tkltb2g1WE5DUzg?oc=5",
      "https://news.google.com/rss/articles/CBMieEFVX3lxTFBNYlUzWDN5ZGhzVmFGS3ZOVVd2U0pRb1FzanBUODFwZUVocl9UdklMQllpZWhzbWhhQm5OTzNkTDBLdy04RE5hNzdMamI0cjdZa3NzUC1HYXRRU1RoaVhTWm95YnIwQUxJMVBibXMyYUZJaEdyM2g0Uw?oc=5",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxPUUMzU0VPNnRKOHk4eEpTdFotR0o2RmQ3Qm02bVBRTnZvWm1nZVQydm00V0M1d0lUOHQ4elAxdnJpMWVSeGp5a0tTNjN4NzZxRlhsaHJyTF9iRE9mNDRQTTFSR09TZjl5QzVLclZucEQ2UnBfUkpXcFpWRGJtRzdiVE52UElVbE1RRFdjclBKSlJSZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/shedeur-sanders-nfl-debut-cleveland-browns-qb/",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.804,
      "consensus": 0.955,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Shedeur Sanders made his NFL debut as quarterback for the Cleveland Browns in a game against the Baltimore Ravens, following Dillon Gabriel's concussion. Sanders completed his first NFL pass during the second half of the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic information about Shedeur Sanders' debut as a quarterback for the Cleveland Browns. It lacks depth or insight into his performance beyond the completion of his first pass, or the implications of his debut for the team.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Japan's Economy Contracts, Exports Hit by US Tariffs",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 07:31:15 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Japan's economy contracts for first time in six quarters on tariff hit Reuters",
      "On an annualized basis, private demand fell 1.8%, dragged lower by a more than 32% drop in residential investments.",
      "Japan’s economy contracts as exports get hit by US tariffs AP News"
    ],
    "image_url": "",
    "titles": [
      "Japan's economy contracts for first time in six quarters on tariff hit - Reuters",
      "Japan's economy contracts for the first time in six quarters as exports, residential investment drag",
      "Japan’s economy contracts as exports get hit by US tariffs - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQekZhal83eU5qSl9qVnlkSmdqemdETVlJaDlpT1dNcUVCLWNZUi1rNTg5ZkxFY1FCek9CbjZmOWNNZEQxekV4aXhGV0psbVkyV1JfN2p0MjY0ckFQM01qaUNBaTV1ZVVYRmlVcUEwVjNuc3V1cWtZM2RUMl91aDVsaGI4TWMtZEJ5cFh4VFlZbHVWVWxkUXluYlFESFBUNWJoWV9XUW5B?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/17/japan-gdp-q3-economy-september-quarter-contraction.html",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxPVE9wcE9aUnFWWXpyWktkRkpqLTk2UHBPeDJ3WU9aWGswSnUtN0RMYkJuajBVWjc2TUEydmpsV1ZHOVE0ZVJSV0Q5Q2hzRFVXSndnbFRIUjEwdkJzZ19nWkZPSXk3VC03VXZyNjMzLU5tMzNzVmRDUWxTNXZjc051NUl1OXBBWGVuZzJQVHBhT0ZueFZ6eUFrYnU5Sm9EMFAy?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQekZhal83eU5qSl9qVnlkSmdqemdETVlJaDlpT1dNcUVCLWNZUi1rNTg5ZkxFY1FCek9CbjZmOWNNZEQxekV4aXhGV0psbVkyV1JfN2p0MjY0ckFQM01qaUNBaTV1ZVVYRmlVcUEwVjNuc3V1cWtZM2RUMl91aDVsaGI4TWMtZEJ5cFh4VFlZbHVWVWxkUXluYlFESFBUNWJoWV9XUW5B?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.946,
      "consensus": 0.769,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.808,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Japan's economy shrank for the first time in six quarters, primarily due to a significant decline in exports impacted by US tariffs. Private demand decreased by 1.8% on an annualized basis, with residential investments dropping over 32%.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This article provides useful information about the current state of Japan's economy and the impact of US tariffs. It provides a deeper understanding of the economic trends and impacts, but it doesn't report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "USS Gerald R Ford in Caribbean for \"Operation Southern Spear\" Near Venezuela",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 16 Nov 2025 22:09:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "Fortune",
      "Axios"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "USS Gerald R Ford arrives in Caribbean as US President Donald Trump raises pressure on Caracas.",
      "The large-scale buildup of U.S. military forces and assets in the Caribbean suggests that the Trump administration is preparing to expand operations.",
      "“Operation Southern Spear\" already includes nearly a dozen Navy ships and about 12,000 sailors and Marines.",
      "Ford carrier adds to U.S. military buildup near Venezuela Axios"
    ],
    "image_url": "",
    "titles": [
      "US boat strike kills 3, as aircraft carrier arrives near Venezuela",
      "These are the U.S. ships and aircraft massing off Venezuela",
      "The most advanced U.S. aircraft carrier arrives in the Caribbean as Trump adds to the growing fleet of warships near Venezuela",
      "Ford carrier adds to U.S. military buildup near Venezuela - Axios"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/16/major-us-carrier-arrives-in-caribbean-as-trump-puts-venezuela-in-crosshairs?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/01/venezuela-us-militarty-aircraft-carrier-ships-strikes-caribbean-trump-maduro/",
      "https://fortune.com/2025/11/16/aircraft-carrier-gerald-ford-caribbean-sea-trump-military-buildup-venezuela/",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxPSUFTX3dDS2Q3S0RldnR6QXc0TjBIa1Q3Mk1SVklfLWdncVNPVFpVR0UtclFFVzZTVXRXeklDTGxybTZ3aWx2LWtMZjh3ejFVQ3VsYmNSNmczWnByLURLejhJWXdfcGVqMlRwczd3ZHJ4Q2l3cmxFTk9WNTV0eHd0VHhRcmlCdWV4Y1F4MVg4OVBfU3c?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/16/major-us-carrier-arrives-in-caribbean-as-trump-puts-venezuela-in-crosshairs?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.778,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The USS Gerald R Ford has arrived in the Caribbean, signaling an increase in U.S. military presence near Venezuela as part of \"Operation Southern Spear.\" This operation involves nearly a dozen Navy ships and approximately 12,000 sailors and Marines, indicating the Trump administration's heightened pressure on Caracas.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant military operation, providing context about the US's increased military presence near Venezuela. However, it doesn't clearly highlight progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "China Issues Travel Warning to Japan, Affecting Stocks Amid Rising Tensions",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 08:16:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Relations between Tokyo and Beijing have plummeted over Japanese leader's recent remarks on Taiwan.",
      "Japan's tourism shares slump as diplomatic rift with China worsens Reuters",
      "Japan’s Tourism Shares Drop After China Warning on Travel, Study Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Japan’s tourism stocks plunge amid spat with China",
      "Japan's tourism shares slump as diplomatic rift with China worsens - Reuters",
      "Japan’s Tourism Shares Drop After China Warning on Travel, Study - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/economy/2025/11/17/japans-tourism-linked-stocks-plunge-amid-spat-with-china?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNN1F0QlFJSXJWMHF5dVVjOURTd2o3b1IwWXY5TVF2NklXZ1pEYk5xWGE0SUJHVXM1RHItNlgtZEJVSzg2OXF2b202dHd2MFFPeU51c01CeFd4S3YtYTQ1Q0Y5QnpBRkNQbGdmTE9fYUhvclU1N0tKUkxwU2QxMnk5SC1ub1BmZW53VDRvQWJQMkZmMlNxb0dBVlB4TkV3Y3lYWEtjUklMYmpRUnp6eGZzTzYyVHlpT3l2?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOdFJvckJCeW1YV0prOUVSV2JqQ1BZZWtYdnFScG5GWlNNcmdIeng3TC1KeWxlX0ZsclJ6QWYtVk9oWEYzQ2lfV0hVVUZmZHdlOUhCb2w4aW9RNXJyU1RsQ1ZIa0lCUDNiRWRBLVVDQ05BQ1l4NmtZNjJIbm1CeklDMm9CaHJCdmNXcDl4MUthS3RzdF9iU2xHNFJjNTUycGZrakVTdERyWkJiek5ZRWpBNHhyRGI?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/11/17/japans-tourism-linked-stocks-plunge-amid-spat-with-china?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.961,
      "consensus": 0.769,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Following remarks by Japanese Prime Minister Sanae Takaichi regarding Taiwan, China issued a travel warning to its citizens against visiting Japan. This led to a significant decline in shares for Japanese tourism and retail companies. The situation has escalated tensions between Tokyo and Beijing.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant geopolitical event and its immediate impact on the stock market, contributing to a deeper understanding of the current relations between China and Japan. However, it does not highlight progress or solutions, and the increase in awareness around systems and impacts is limited.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Chile to See Leftist Jara vs. Far-Right Kast in Presidential Runoff",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 00:30:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Bloomberg",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Leftist former Labour Minister Jeannette Jara and far-right leader Jose Antonio Kast set to face off in December run-off",
      "A closely fought first-round vote on Sunday has set up a showdown between a member of the Communist Party and an ultraconservative veteran politician, sharply polarizing the country.",
      "Chile Communist, Conservative Heading to Presidential Runoff Bloomberg.com",
      "Chile's presidential race heads to a runoff between a communist and a pro-Trump conservative AP News"
    ],
    "image_url": "",
    "titles": [
      "Chile heads to a presidential run-off between Jara and Kast",
      "Chile's presidential race heads to a polarizing runoff after Sunday vote",
      "Chile Communist, Conservative Heading to Presidential Runoff - Bloomberg.com",
      "Chile's presidential race heads to a runoff between a communist and a pro-Trump conservative - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/chile-faces-presidential-runoff-between-leftist-jara-and-far-rights-kast?traffic_source=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/11/17/g-s1-98075/chiles-presidential-race-runoff",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNWGVOaURVT3oySEtwUTRRMDgzdU0yVlFxMHRpOURCS095RmFzSGZ5cWJmLVVvbkhqZUxZeGNWUy1oaDdpMmNuODIzNGZNUm5VcXQ3SV9acEtuVkFCYlV4OUkydlNYSU9hbjFGMlJfXzJIRFpiYWZSenFQckxldDhITzhOTWJHS0ZLUlg1TDNybWt2M2g1eC1fUWJBTU9jemxfdll4czdB?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQdzZNdW1pMnRwQnkwcV81blJNZFBfb0pqajNUcmtDaFJjVElYdHVNUVlfWEoyM2J3Skt3YlFUZ2RnZFdNVnhOYkxGNUtEZ3FpZzFyWmtQQzFBYWJGampBZUp4N2RQYk5XQlJTNko3QURudmJESHdwS3lxWFlUSjJZQ1hWWDJha2E3Q2V1eGhlX2I3WTh6X1BrelZOQWl5a3R3SGlSYjc2Nl93M083?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/chile-faces-presidential-runoff-between-leftist-jara-and-far-rights-kast?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.817,
      "consensus": 0.888,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Chile, leftist former Labour Minister Jeannette Jara and far-right leader Jose Antonio Kast will compete in a presidential runoff on December 14. President Gabriel Boric has acknowledged both candidates' progression to the second round, marking a significant political contest between communist and conservative ideologies.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about an upcoming political event in Chile, but it does not provide in-depth insights or actionable knowledge for the reader. It does not report on solutions or improvements, and it only minimally increases clarity around systems or trends.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Asbestos in Sand Prompts School Closures in NZ and Australia",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 04:56:34 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "Asbestos contamination forces schools in Australia, New Zealand to close Reuters",
      "Six coloured sand products recalled in New Zealand after testing in Australia found asbestos in similar items Multiple schools have temporarily closed in New Zealand and hundreds of education facilities are seeking advice from officials after asbestos was detected in several brands of widely used co",
      "Three-quarters of the schools in the area around the capital will be closed, although officials say the health risk from asbestos found in colored sand is low."
    ],
    "image_url": "",
    "titles": [
      "Asbestos contamination forces schools in Australia, New Zealand to close - Reuters",
      "Schools close in New Zealand after play sand recalled over asbestos fears",
      "Dozens of Australian Schools Close Over Asbestos Fears"
    ],
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNX2MxYVd5UXBMOEl2eGM4UVRFYWtJcTBweURMLWZ0Sjd4OE1VS2V5eG8xWlBQeHp6azZMMzFUN0NSX2hmWFdhRFFDRTRpVXpsMFV1N1MwVWxjdlh2eWJ0bE1Ibm1UT19QdllLVzFsTHlCVThTTG9fdVh1QmFaS1FGMXBCckFITWMyeU1nNG5KYUJUQXZRVV9LanJoQjM4SUNGbXBQbnoxd2VWeENFRGhXbWcyRnNFOFptRV9kTA?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/17/schools-close-in-new-zealand-after-play-sand-recalled-over-asbestos-fears",
      "https://www.nytimes.com/2025/11/16/world/australia/schools-asbestos-sand.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNX2MxYVd5UXBMOEl2eGM4UVRFYWtJcTBweURMLWZ0Sjd4OE1VS2V5eG8xWlBQeHp6azZMMzFUN0NSX2hmWFdhRFFDRTRpVXpsMFV1N1MwVWxjdlh2eWJ0bE1Ibm1UT19QdllLVzFsTHlCVThTTG9fdVh1QmFaS1FGMXBCckFITWMyeU1nNG5KYUJUQXZRVV9LanJoQjM4SUNGbXBQbnoxd2VWeENFRGhXbWcyRnNFOFptRV9kTA?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.897,
      "consensus": 0.789,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.796,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Schools in New Zealand and Australia have closed after asbestos was found in several brands of colored sand products. The contamination led to a recall of six sand products in New Zealand. Despite the closures, officials have stated that the health risk from the asbestos is low. Hundreds of education facilities are now seeking guidance on how to proceed.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about a significant health issue and the steps taken to address it, which is useful for the reader. It also raises awareness about the potential risks of asbestos contamination. However, it lacks information on potential solutions or innovations to prevent such incidents in the future.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bangladesh Ex-PM Sheikh Hasina Sentenced to Death in Absentia",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 09:02:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "Hasina - currently in exile in India - convicted over 2024 crackdown on protests that killed hundreds.",
      "A special tribunal in Bangladesh’s Dhaka has found former Prime Minister Sheikh Hasina guilty of crimes against humanity",
      "Hasina is being tried in absentia for crimes against humanity for a violent crackdown on student protests last year.",
      "Hasina sentenced in abstentia by court in Dhaka over deadly crackdown on student-led uprising last year Bangladesh’s deposed prime minister Sheikh Hasina has been sentenced to death in abstentia by a court in Dhaka for crimes against humanity over a deadly crackdown on a student-led uprising last ye",
      "The former prime minister, who fled to India last year, was tried in absentia for ordering the use of lethal weapons during the uprising that drove her from power."
    ],
    "image_url": "",
    "titles": [
      "Tension high as Bangladesh tribunal convicts ex-PM Hasina",
      "Bangladesh court convicts Sheikh Hasina of crimes against humanity",
      "Live: Bangladesh’s Hasina sentenced to death for crimes against humanity",
      "Ousted Bangladesh PM Sheikh Hasina sentenced to death for crimes against humanity",
      "Bangladesh Court Sentences Former Leader Sheikh Hasina to Death"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/17/tension-high-as-bangladesh-tribunal-convicts-ex-pm-hasina?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/11/17/bangladesh-court-convicts-sheikh-hasina-of-crimes-against-humanity?traffic_source=rss",
      "https://www.aljazeera.com/news/liveblog/2025/11/17/bangladesh-live-court-verdict-against-toppled-ex-pm-sheikh-hasina-expected?traffic_source=rss",
      "https://www.theguardian.com/world/2025/nov/17/ousted-bangladesh-pm-sheikh-hasina-found-guilty-of-crimes-against-humanity",
      "https://www.nytimes.com/2025/11/17/world/asia/bangladesh-sheikh-hasina-death-sentence.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/17/tension-high-as-bangladesh-tribunal-convicts-ex-pm-hasina?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.976,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.792,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Prime Minister of Bangladesh, Sheikh Hasina, has been sentenced to death in absentia by a Dhaka tribunal for crimes against humanity. This verdict is linked to her role in a violent crackdown on a student-led uprising last year, which resulted in numerous deaths. Hasina, currently in exile in India, was tried for ordering the use of lethal force during the protests that ultimately led to her ousting from power.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides important information about a significant event in Bangladesh's political landscape, thereby increasing the reader's understanding of the situation. However, it doesn't offer solutions or improvements, nor does it provide a deep analysis of the causes or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Poland PM Confirms Sabotage in Railway Explosion, Army to Inspect Tracks",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 08:29:25 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Explosion on Polish railway track was caused by sabotage, PM says Reuters",
      "Donald Tusk says ‘worst fears confirmed’ over damage on route used to ferry aid deliveries to Ukraine Meanwhile, Poland’s defence minister, Władysław Kosiniak-Kamysz, has said the army will now inspect the safety of the remaining 120km track going towards the border with Ukraine. Meanwhile, EU defen",
      "Polish Railway Incident May Be Sabotage, Prime Minister Says Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Explosion on Polish railway track was caused by sabotage, PM says - Reuters",
      "Explosion on Polish railway was ‘unprecedented act of sabotage,’ says PM – Europe live",
      "Polish Railway Incident May Be Sabotage, Prime Minister Says - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQVkdXTDlkX1NhcmlTSWQyQ3VkaFN6VTdFdFB3MmhVMlR4TzhPMkRPZ0t3T2xRZFNjY1FQWGZCUWRBbDRaVlllaV85TVJNMlhsTGE5emtZWXpOTGwwV0c1RjlPSnB5Y3M2clFCMERFbmpRc1JRTmxsQ3E0X09Lckl6MzBDSjJBU3lxbXNfMV9UbmFHUTV4c1JuRk5lYlphemtISDZtbnhR?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/world/live/2025/nov/17/ukraine-russia-france-poland-zelenskyy-macron-eu-europe-news-latest-updates",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPc0tqNHNiQjhDZTNCcG1iMDlrY1NMUjc4R212dkdSd1YyOXhoWF9oU0xzVUV1QVBVbWVRSHA1cHotUnF3ZDZaY3NTZklwNEJDSW1nLVp3WTZJUUliR2tFeWlxTGpxWVdCVWF2X3ZRaVIwczNzZGxaNk91aktjS3VFMlNxbmZDNXo4YmdUTWVHYUhTWWtjYmZUSzhsM2txRTdCdTJWdmUwZmx2NDZfSnM4?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQVkdXTDlkX1NhcmlTSWQyQ3VkaFN6VTdFdFB3MmhVMlR4TzhPMkRPZ0t3T2xRZFNjY1FQWGZCUWRBbDRaVlllaV85TVJNMlhsTGE5emtZWXpOTGwwV0c1RjlPSnB5Y3M2clFCMERFbmpRc1JRTmxsQ3E0X09Lckl6MzBDSjJBU3lxbXNfMV9UbmFHUTV4c1JuRk5lYlphemtISDZtbnhR?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.965,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.792,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An explosion on a Polish railway track, which is used to transport aid to Ukraine, has been confirmed as sabotage by Poland's Prime Minister. Following this incident, the country's defense minister announced that the army would inspect the remaining 120km of track towards the Ukraine border to ensure its safety.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story is constructive in that it provides useful information about the security measures being taken in response to the sabotage. However, it doesn't provide much depth or insight into the broader implications or causes of the incident.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Trump Proposes $2,000 Checks Funded by Tariffs; Awaits Congress Approval",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 16 Nov 2025 16:26:29 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "fortune.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Bessent Says Trump’s $2,000 Checks Would Need Congressional Vote Bloomberg.com",
      "Trump, who has touted the billions raised in US tariff revenue this year, has talked about the checks as public frustration mounts over the cost of living.",
      "Donald Trump has proposed sending $2,000 tariff checks to many Americans. Treasury Secretary Scott Bessent says that might need a congressional OK."
    ],
    "image_url": "",
    "titles": [
      "Bessent Says Trump’s $2,000 Checks Would Need Congressional Vote - Bloomberg.com",
      "Bessent says Trump’s $2,000 checks would need congressional vote",
      "Treasury Secretary Scott Bessent says Trump's $2,000 tariff checks might need a congressional OK"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNSzdoZVk5WEIwUnp0NVFrRldDWDd5UnRwQmp0ZUJGeHczeEItOENyMXgzOEdkdnFkTEZmTmppR0wtMi1pYlFLdXJmM2FhQ0tveVZ1WEd3c21TYWpXWTBEbWFvZTRicXdON1NTNHNXY0ZTMTRwTlNzQV9VLVptTm1NbmxmeE40NlFRU09XMkd1b3IyVEpjM1QyZkJJbEJNZUtvMVE3dTdNdkRicDFmYTJvRWxRSl8?oc=5",
    "alternate_urls": [
      "https://fortune.com/2025/11/16/bessent-trump-2000-tariff-dividend-check-congressional-vote/",
      "https://www.businessinsider.com/tariff-rebate-dividend-checks-donald-trump-scott-bessent-congressional-approval-2025-11"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNSzdoZVk5WEIwUnp0NVFrRldDWDd5UnRwQmp0ZUJGeHczeEItOENyMXgzOEdkdnFkTEZmTmppR0wtMi1pYlFLdXJmM2FhQ0tveVZ1WEd3c21TYWpXWTBEbWFvZTRicXdON1NTNHNXY0ZTMTRwTlNzQV9VLVptTm1NbmxmeE40NlFRU09XMkd1b3IyVEpjM1QyZkJJbEJNZUtvMVE3dTdNdkRicDFmYTJvRWxRSl8?oc=5",
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.691,
      "consensus": 0.789,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump has proposed issuing $2,000 checks to Americans, funded by tariffs. However, Treasury Secretary Scott Bessent stated that this plan would require approval from Congress. The current support from Congress for this proposal remains unclear.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a proposed financial policy that could directly impact many Americans. It also contextualizes the proposal by explaining the need for congressional approval. However, it does not report on a solution or progress, as the proposal is still awaiting approval.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Carney's Government Faces Crucial Budget Vote Monday",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 17 Nov 2025 09:00:23 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CBC"
    ],
    "domains": [
      "globalnews.ca",
      "cbc.ca"
    ],
    "snippets": [
      "Prime Minister Mark Carney faces a crucial confidence vote on his budget on Monday, but it's not known yet if Canada will be heading to another election or not.",
      "The House of Commons is set for one final vote on the main budget motion that will determine if the fiscal policy can go ahead and if the Liberals can keep governing."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/c1c40d008559939e4374786e547502672ffb36c9c805bbcc630f7940be39628e.jpg?quality=65&strip=all",
    "titles": [
      "Carney faces crucial confidence vote as MPs set to vote on budget",
      "Budget, government’s fate up in the air as MPs prepare for crucial vote"
    ],
    "url": "https://globalnews.ca/news/11528568/budget-2025-confidence-vote/",
    "alternate_urls": [
      "https://www.cbc.ca/news/politics/budget-canada-liberal-government-final-vote-carney-champagne-9.6979533?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11528568/budget-2025-confidence-vote/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Minister Mark Carney and his Liberal government face a critical confidence vote on their budget in the House of Commons on Monday. The outcome will decide both the future of the proposed fiscal policy and whether the government can continue to govern. The possibility of a new election hinges on this vote.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about an upcoming significant political event, which could impact the reader's decision-making. However, it doesn't report on solutions or improvements, nor does it provide a deep analysis of the potential impacts of the vote.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US Border Patrol Arrests 81 in Charlotte Immigration Crackdown",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 16 Nov 2025 21:54:10 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Border Patrol operation rocks Charlotte with dozens arrested Axios",
      "US Border Patrol arrests 81 on first day of Charlotte immigration crackdown Reuters",
      "Trump administration has made Democratic-led city its latest target despite fierce objections from local leaders A top border patrol commander touted dozens of arrests in North Carolina ’s largest city on Sunday as Charlotte residents reported a surge of encounters with federal immigration agents ne",
      "Dozens arrested in North Carolina immigration enforcement surge, Border Patrol official says AP News"
    ],
    "image_url": "",
    "titles": [
      "Border Patrol operation rocks Charlotte with dozens arrested - Axios",
      "US Border Patrol arrests 81 on first day of Charlotte immigration crackdown - Reuters",
      "Dozens reportedly arrested in Charlotte, North Carolina, amid immigration crackdown",
      "Dozens arrested in North Carolina immigration enforcement surge, Border Patrol official says - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPMVhQSG92VUt1Tm9oTDlIb0xqbEtUbzRyMjQwd3I3WjFxNHJDNkE5bE1hNDU2RURaLWdBWDRhcDBzb3dVYWluRFJZMGVRakV3bVhpYmI3WTMxRnpKUFJ0VkVyc1E0RWFrcEktQlhyV1labHN5ekRNTld0Wk5rYlktMHRn?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQVlF1M2xKd3JrM2VoZGkzbDE3bHlUX3hQcU5EellZNmxGVEtmQ0hxMTRscVhMR0I3WEhpQ1RJb2xPbzZWejliQWpoN2VLcmxZLTE0THpYUE54V0lVUFlONlM3NGRtUVdGMEYtWk85YnJMcFBqMGlqcnNrSnhaR2NKNFF3MWJGZnRBckVxZnViYjhPTkRaOVE1YkU4YXhRRVVlYnlIcEZDR2x4YzZGeUV5UWRzN2w?oc=5",
      "https://www.theguardian.com/us-news/2025/nov/16/charlotte-north-carolina-immigration-crackdown",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxOU2g2Z3NoZXlhRkFYaFlPVWZ2RjJldG1lS05sN0dMWWVhOXpsZFF6d3dIdEVHOTdza0dURXZfd1MybWZlRVBkTjEwNTNtaEtPNHNpMHBJVnpCSlFVbExSVGFfbTZVQVBUdUFnLXRjeklVaWdsNlRkNGNsLVRMY2puTTl3dzJfdmRrWEZ1VFdMUWVfZVpmcDlSZUxHSXVpZW1Ca2c?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPMVhQSG92VUt1Tm9oTDlIb0xqbEtUbzRyMjQwd3I3WjFxNHJDNkE5bE1hNDU2RURaLWdBWDRhcDBzb3dVYWluRFJZMGVRakV3bVhpYmI3WTMxRnpKUFJ0VkVyc1E0RWFrcEktQlhyV1labHN5ekRNTld0Wk5rYlktMHRn?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.774,
      "consensus": 0.868,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.764,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US Border Patrol arrested 81 individuals in Charlotte, North Carolina, on the first day of an immigration crackdown, targeting the Democratic-led city despite local leaders' objections. This enforcement surge has led to increased encounters between Charlotte residents and federal immigration agents.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the immigration crackdown in Charlotte, it does not provide deeper insights into the reasons behind the crackdown, the perspectives of the arrested individuals, or the broader implications for immigration policy.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Germany Cancels Holocaust Artifacts Auction Amid Outrage",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-16T17:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "An auction of items and documents from victims of the Holocaust has been called off following an international outcry. The Auschwitz Committee called auctioning such items as worn Stars of David \"cynical and shameless.\"",
      "Survivors group had called on firm Felzmann to ‘show some basic decency’ and halt ‘cynical and shameless’ event Poland’s foreign minister said on Sunday that an “offensive” auction of Holocaust artefacts in Germany has been cancelled, relaying information from his German counterpart, after complaint",
      "Germany cancels auction of Holocaust artifacts after backlash AP News"
    ],
    "image_url": "",
    "titles": [
      "Auction of Holocaust items canceled after outrage",
      "German auction house cancels sale of Holocaust artefacts after outcry",
      "Germany cancels auction of Holocaust artifacts after backlash - AP News"
    ],
    "url": "https://www.dw.com/en/auction-of-holocaust-items-canceled-after-outrage/a-74761373?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/16/german-auction-house-urged-to-cancel-sale-of-holocaust-artefacts",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxOLThfVHltRTU0TlBIRmZwbU94OGpMUmhxVTBfNTE2U2JQNFFBb1doeUxyN0tGNzZHMHJ1ZDRfRFN0RW16WkR6dlhGZlNjSzRGZ0lGdGp6cXViSVZrRVFOOVdTZUE5RnZiX0lqV3JLM19tX1BkdURyMHVxaUY5alVDYXVHNkNxLWtRMUZqZUlTZ0pNdl9hREllWjB2WGlLd0NWQTNJNWx3WQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/auction-of-holocaust-items-canceled-after-outrage/a-74761373?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.709,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An auction in Germany featuring Holocaust artifacts, including worn Stars of David, was canceled after international backlash and criticism for being \"cynical and shameless.\" The Auschwitz Committee and survivors urged Felzmann, the auction firm, to halt the event, calling for basic decency. Poland's foreign minister confirmed the cancellation following complaints, highlighting the offensive nature of the auction.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive in the sense that it raises awareness about the sensitivity of certain historical artifacts and the importance of treating them with respect. However, it doesn't provide actionable insights or report on solutions to prevent such incidents in the future.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Kashmir Man Arrested for Alleged Role in Delhi Blast Killing 8",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-16T16:01:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CityNews",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "ottawa.citynews.ca",
      "news.google.com"
    ],
    "snippets": [
      "India's anti-terror agency called the arrest of an \"accomplice\" to the driver in the car explosion \"a breakthrough.\"",
      "SRINAGAR, India (AP) — India’s anti-terror investigating agency said Sunday it arrested a man from Indian-controlled Kashmir on suspicion of conspiring with a suicide bomber to carry out a deadly car blast in the capital New Delhi. The National Investigating Agency said in a statement that the car t",
      "India arrests Kashmir resident over Delhi car blast Reuters"
    ],
    "image_url": "",
    "titles": [
      "Delhi Red Fort car blast suspect arrested",
      "India arrests suspect in New Delhi car blast that killed 10",
      "India arrests Kashmir resident over Delhi car blast - Reuters"
    ],
    "url": "https://www.dw.com/en/delhi-red-fort-car-blast-suspect-arrested/a-74767318?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/11/16/india-arrests-suspect-in-new-delhi-car-blast-that-killed-10/",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxQRFJnS3Z1cjVLLTlpOHJxaWkwcl9UTkhpMDRoWGJmYzMtMWFrTDlQSUdMSU5BM1Bla0dZWFdZSzJnQXhkQWQ1VFctRVl2a1d2cHFtLTgzMUxLS0p6dnpXN0lURERQd3lLSFRTRnBBdVhNT1dzb0c3RHliNERXWDE0ODdWTHMwZlphOGFhTjJJT0NlalJvWEhXVFBsUGd0M0dtUUNHMk1icW81Z1B3Y3ZvS3FmUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/delhi-red-fort-car-blast-suspect-arrested/a-74767318?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.685,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "India's National Investigating Agency arrested a man from Kashmir, accused of conspiring with a suicide bomber in a car blast in New Delhi near the Red Fort, resulting in eight deaths and twenty injuries. The man allegedly owned the car used in the attack.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant event, but it doesn't go beyond reporting the facts of the arrest. There is no exploration of the broader context, causes, or potential impacts of the situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NFL Probes Ramsey-Chase Fight; Second Ejection in Two Weeks",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 01:43:27 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The NFL is going to investigate what exactly led to the altercation",
      "Steelers' Jalen Ramsey Ejected for Punching Bengals' Ja'Marr Chase on Video Bleacher Report",
      "For the second straight week, a defensive star has been ejected for unsportsmanlike conduct."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/16/d584ca1a-8926-44a6-a54c-69161d71c7f5/ramseychase.jpg",
    "titles": [
      "Steelers' Jalen Ramsey ejected after throwing punch at Ja'Marr Chase; accuses Bengals WR of spitting on him",
      "Steelers' Jalen Ramsey Ejected for Punching Bengals' Ja'Marr Chase on Video - Bleacher Report",
      "Steelers’ Ramsey says he punched Bengals’ Chase after receiver spit on him"
    ],
    "url": "https://www.cbssports.com/nfl/news/bengals-steelers-fight-jalen-ramsey-ejected-jamarr-chase-aaron-rodgers/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxQR0tCTG50dEtNVlhXSlJSblQxVkMwVTlKUzM3V1pEQnh4a2JNVlhxcWZpZG1KYnFaQXpCY1hORlVhcHBMdm1xSGFMTjgyUGVhcVZrbjNzRzlhQnRDbVpKM1dITU0xd1NRRmk0MlpZWV9PY1hwM0hyQ0ZZa1JwcExkOXQtQjZQMkUxUWh0WHQ4akZmVnFyNmlBU3N6ZWVXbFdkMVZpUno5OUtSVTcyS0VB?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/bengals-steelers-fight-jalen-ramsey-ejected-jamarr-chase-aaron-rodgers/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.838,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL is launching an investigation into an altercation that resulted in Steelers' Jalen Ramsey being ejected for punching Bengals' Ja'Marr Chase, as captured on video. This incident marks the second consecutive week a defensive player has been ejected for unsportsmanlike conduct.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about an incident in the NFL but lacks depth or insight. It doesn't provide any actionable insights for the reader or report on solutions to prevent such incidents. The story also doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bernie Kosar to Undergo Liver Transplant on Monday",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 02:42:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Associated Press"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Bernie Kosar is scheduled to receive a liver transplant Monday morning.",
      "Bernie Kosar says he will receive a liver transplant Monday morning AP News"
    ],
    "image_url": "",
    "titles": [
      "Ex-QB Kosar says he will receive liver transplant",
      "Bernie Kosar says he will receive a liver transplant Monday morning - AP News"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/46995723/bernie-kosar-says-receive-liver-transplant-monday",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPaEJqUXZjOWoycEV6VGZtYVA0Mk9kNmtSNWh3eEloNzRON2hJV2xpempVWEJTcE1NUS13YnJWX0l4YWptSG1JU0VfeDRMQlFFQmhzSUw5TlFNTThFQTc0R3k4aEVVazNKeGM5OXF3UER4dUNQS0tBSU9yMWFMUUFFNk5zYnhqdzBCSlBSQk1mOUZfNXNzZmJFUHREeWNDV1h3a0s5TFFMOC1zZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/46995723/bernie-kosar-says-receive-liver-transplant-monday",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.7,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bernie Kosar, a former professional football player, announced he is scheduled to undergo a liver transplant on Monday morning, as reported by AP News.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a former football player's health situation but lacks depth or insight. It doesn't provide actionable insights for the reader or report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Linn Grant Wins Second LPGA Title at The Annika Tournament in Florida",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 16 Nov 2025 18:50:18 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Linn Grant closed with a 5-under 65 on Sunday for a three-shot victory over Jennifer Kupcho in The Annika. It was Grant's second LPGA title, and the second time she received a trophy from Swedish great and tournament host Annika Sorenstam.",
      "Highlights from the final round of The Annika at the Pelican Golf Club, Florida."
    ],
    "image_url": "",
    "titles": [
      "Grant breezes to second LPGA title at The Annika",
      "Grant captures The Annika title after winning by three shots"
    ],
    "url": "https://www.espn.com/golf/story/_/id/46992521/linn-grant-breezes-second-lpga-title-annika",
    "alternate_urls": [
      "https://www.skysports.com/watch/video/13471471/the-annika-day-four-highlights"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/golf/story/_/id/46992521/linn-grant-breezes-second-lpga-title-annika",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.806,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.691,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Linn Grant won her second LPGA title by finishing with a 5-under 65, securing a three-shot victory over Jennifer Kupcho at The Annika tournament in Florida. Grant was presented the trophy by the event's host, Swedish golf legend Annika Sorenstam.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of Linn Grant's achievement but does not offer deeper insights or contextualization. It doesn't provide actionable insights or solutions, nor does it increase clarity around the systems, causes, trends, or impacts in the sport.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Week 12 College Football: Alabama Falls, Georgia and Oklahoma Rise in AP Poll",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 16 Nov 2025 18:36:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Nothing came easily in the SEC on a Saturday that had so much unexpected drama.",
      "Forde: College Football Playoff Projected Bracket After Week 12 Sports Illustrated",
      "2025 NFL Playoff Picture, Week 11: Who’s In and Who’s Out Sports Illustrated",
      "College Football Playoff and Bowl Projections After Week 12: Is Alabama Top SEC Team? Sports Illustrated",
      "AP Top 25 Poll Shakeup After a Chaotic Saturday of College Football Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "The SEC offered a dose of playoff football in Week 12",
      "Forde: College Football Playoff Projected Bracket After Week 12 - Sports Illustrated",
      "2025 NFL Playoff Picture, Week 11: Who’s In and Who’s Out - Sports Illustrated",
      "College Football Playoff and Bowl Projections After Week 12: Is Alabama Top SEC Team? - Sports Illustrated",
      "AP Top 25 Poll Shakeup After a Chaotic Saturday of College Football - Sports Illustrated"
    ],
    "url": "https://www.espn.com/college-football/story/_/page/gamedayfinal111525/college-football-week-12-highlights-top-plays-games-takeaways-2025",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxQWUJvb0ZrOFcyMEE3OUNhdi1kZkNSVmFJZWhhVXVVWVl6eEc3YUFYLTBrT09ibkxXQ2RJR0ZVUTROdzJISjJwTTQ2Zm9TUlIzYjduTGFTWU5nRmJXOE93eVJaejl5RmVXZWhua3RnX2xvTVZHSFNRWUR0NEgtSGZzT09EVDlXUVN4d3NfQkE1emMwX3hZcUVGWG9RM0p1RWs?oc=5",
      "https://news.google.com/rss/articles/CBMiZkFVX3lxTE4tV3BfRlN3b3pzVkRhMUlIYjFKVEJCWnFIb3ROSmVZQzNSUVJzZVQ5RmJPSWJIZnpQQ0REOVk4ZU5TZ0FrQ1loYzlMcHlYRTdOZldCTjlkcEM2NThKWlVqcWloVHlOdw?oc=5",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPaEsxcFJkWTZqNXBRcEVqVG42MV96ODgzTk95WFVhZ0V1Tnd4bUttd2h6aEdXWmtYM3FrVXh3RXZKOTgyenBCclB0UFZGakE0WHAwcFdtSm1FcDc5X0c1Zm9yMGNNNE9EVmt4TjZkRVhWWVBuVlFyMWFROGhGVnJuTEM0dTZIS2I1Tjcwclk2ZUx6b0xjTmJBQVU0VWF0Vm9PU1hUYi16VndjRE1aRW5nVW56MzJ2ejJuMzRv?oc=5",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxNQXdGSmREd295QmdiRFdNOWJHZ2EwRWU3NnlNZjU4M010YmFtRXZBbDAxaHA4SXIxUzFhM3ZhcEFEOHFQYXBLZ014NTRPWmN3UjVvMXBXT1ZUc3BDdEVmNHBEeWhMT3NIN3R2NXB4eGphYWlUV0RQWXNNS3o1SXJvQXo5MGw5bFpRT2ZhbzFTaVVvM3NWb3lsQmQwMUZ4eHhFNHBTeHBDWVZrYnhjcl83d1RJNV9nZ2NoNjV4SS13?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/page/gamedayfinal111525/college-football-week-12-highlights-top-plays-games-takeaways-2025",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.69,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After Week 12 of college football, significant changes occurred in the AP Top 25 Poll, highlighted by Alabama's drop after a narrow loss to Oklahoma and notable wins for Georgia and Oklahoma. The updates also reveal where teams like Vanderbilt and Miami stand in both the Coaches Poll and AP Top 25 following the week's outcomes.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the changes in the AP Top 25 Poll of college football. However, it does not offer any deeper insights or actionable information for the reader, nor does it highlight any progress or solutions.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bangladesh Ex-PM Sheikh Hasina Sentenced to Death for 2024 Protest Suppression",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-17T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Bangladeshi judges have found former Prime Minister Sheikh Hasina guilty of crimes against humanity for the violent repression of anti-government protests in 2024. DW has the latest.",
      "Bangladesh's ousted PM Hasina sentenced to death for students crackdown Reuters",
      "Bangladesh tense ahead of ousted PM Hasina's verdict Reuters"
    ],
    "image_url": "",
    "titles": [
      "Bangladesh: Hasina sentenced to death over protest crackdown",
      "Bangladesh's ousted PM Hasina sentenced to death for students crackdown - Reuters",
      "Bangladesh tense ahead of ousted PM Hasina's verdict - Reuters"
    ],
    "url": "https://www.dw.com/en/bangladesh-hasina-sentenced-to-death-over-protest-crackdown/live-74771291?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPc0twWlNPZHRTemhBRUprWVNHWWt3RDhtRW5XWWZZbXpuc2o5UlVJNGZyOE1la0QtV1dVNjQ4elJHWDhha2E5OVFRY2RXZ1FYRmE1dXZlTzNYWVp0QkI0d2VHZExxQkJ6dXM3djA0Skx2RkRrLVd1NU5adTBob0dDTW9PSVNIbjV1bWVPZFVaYi16VnpUanNvNmxyWjRRbHNqYjVyZExuTW5UQ2hpMFMyd191aFZlTmFS?oc=5",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxOYlpjVVU4NER0dnVLY2FiR2x4bDl1Yi1HOGRYdUQxSHRlSVN3eEhMVFNwcXE1STRweWRCNFp1VGRiUUVadEtHcE8xZ1FXd1lLeVRfcnFDN3ZMTG5sV1ZFMS1kMHM3QV9ael9lb09vNmhicENVXzFpbmFPNlVYdVlVTG9qNmw1RHZ3S0RYc0pYMVFJaWpmbGJPZ0RiaFEtdWd2ZlZrdC1R?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/bangladesh-hasina-sentenced-to-death-over-protest-crackdown/live-74771291?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Prime Minister Sheikh Hasina of Bangladesh has been found guilty of crimes against humanity related to the violent suppression of anti-government protests in 2024. She has been sentenced to death. The country is currently experiencing tension ahead of the verdict's formal announcement.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This news informs about a significant event in Bangladesh's political landscape, but it doesn't provide enough context or depth about the underlying issues that led to the protests or the implications of the verdict. It also doesn't report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Hurts Leads Eagles to 16-9 Victory Over Lions",
    "domain": "sports",
    "source_domain": "skysports.com",
    "location": "global",
    "published": "Mon, 17 Nov 2025 06:14:00 GMT",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "skysports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Jalen Hurts scored the crucial touchdown in the Philadelphia Eagles' 16-9 win over the Detroit Lions on Sunday night.",
      "Jalen Hurts scored the only touchdown in an otherwise feeble effort from the Philadelphia Eagles’ offence, and it was enough to lead them to a 16-9 win over the Detroit Lions, who failed on every fourth-down try Sunday night."
    ],
    "image_url": "https://e2.365dm.com/25/11/1920x1080/skysports-nfl-jalen-hurts-philadelphia-eagles_7083766.jpg?20251117072715",
    "titles": [
      "Hurts scores decisive touchdown as Eagles beat Lions",
      "Hurts’ lone touchdown leads Eagles over Lions in lacklustre offensive game"
    ],
    "url": "https://www.skysports.com/nfl/news/12040/13471514/nfl-philadelphia-eagles-beat-detroit-lions-16-9-as-jalen-hurts-scores-decisive-touchdown",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.skysports.com/nfl/news/12040/13471514/nfl-philadelphia-eagles-beat-detroit-lions-16-9-as-jalen-hurts-scores-decisive-touchdown",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jalen Hurts scored the decisive touchdown in a low-scoring game, leading the Philadelphia Eagles to a 16-9 victory over the Detroit Lions. The Eagles' offense struggled throughout, but Hurts' contribution and the Lions' failure on fourth-down attempts were key to the Eagles' win.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a sports event, providing details on the game's outcome. However, it doesn't provide deeper understanding or actionable insights for the reader, nor does it report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "FAA to End All Flight Cuts from Shutdown on Monday",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 17 Nov 2025 02:43:08 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Flight cuts imposed amid shutdown will end Monday, FAA says Axios",
      "FAA Lifts All Remaining Flight Cuts Imposed During Shutdown Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Flight cuts imposed amid shutdown will end Monday, FAA says - Axios",
      "FAA Lifts All Remaining Flight Cuts Imposed During Shutdown - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBrOHZBbldacTR2VUQxRmdfQUJGRnRKV1RuQ1lITGhqVjZtQmVyWWd0d2dQZ3NPOVNhT3NGQ3AxUXkteUpxa2NqYzlvQmFuX0VLRzh6NnplQ1FYUmVCTFJKdWNFbzJPYnFaTkZUa2pEa0ZlclFFUWsyejdn?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPQkpCR1R1blVXUUIwejJZLTF6S2RDMTFsZ1g4NUp1NjRDLVE0Skc5XzBxYlFBNUxwbzNqSUlRZHpzMWRVdkZWOGsyYzdFZ29tVkg3eDNEdWJJdEdUa0hBTkZDdVFURWVqSE01NkhrTDBCQ2txQTdwbVR2ei1PSFktc1d4UDYwR1JUSk9Cc1FFMnljTVIxMjlybGpfTnh3LVFOVmFzSEhOa292R3NPcHVz?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBrOHZBbldacTR2VUQxRmdfQUJGRnRKV1RuQ1lITGhqVjZtQmVyWWd0d2dQZ3NPOVNhT3NGQ3AxUXkteUpxa2NqYzlvQmFuX0VLRzh6NnplQ1FYUmVCTFJKdWNFbzJPYnFaTkZUa2pEa0ZlclFFUWsyejdn?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.856,
      "consensus": 0.571,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Federal Aviation Administration (FAA) announced that all remaining flight cuts imposed during the shutdown will end on Monday. This decision marks the conclusion of restrictions that had affected air travel.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the end of flight restrictions, which can inform decision-making for those planning to travel. However, it doesn't provide much context or insight into the reasons for the shutdown or its broader impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Calgary Man Dies, Daughter Missing After Wave Hits in California Beach",
    "domain": "general",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sun, 16 Nov 2025 14:14:23 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Globe and Mail"
    ],
    "domains": [
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Investigators in California say a Calgary man is dead and his five-year-old daughter is missing after the pair were swept off the shoreline by a tall ocean wave on Garrapata State Beach.",
      "Calgary father dead, five-year-old daughter missing after California wave sweeps them out to sea The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Calgary father dead, 5-year-old girl missing after California ocean wave sweeps them away",
      "Calgary father dead, five-year-old daughter missing after California wave sweeps them out to sea - The Globe and Mail"
    ],
    "url": "https://www.cbc.ca/news/canada/calgary/calgary-father-dead-5-year-old-girl-missing-after-california-ocean-wave-sweeps-them-away-9.6980908?cmp=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxOMi1rNWo3dEEzTmFLem9ZTkNMbklnZUJDdjZpeXFBeTlzVzJFVXVWQmFEQm5qRDc5Z1VQcUNSNU5WSjlKTV9XUEROOFpqbnE1YmtPenIxSHFpdUxxZFFmYTZCOVJ3bUU0NjItbG5zZ3hCcVJ5LS0teTZ2WGoxeWsySGNTT3h4RzJ4aUhqc3E3aVlQUGFydjF2VE9Xcks3SC12WFBTYTBB?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/canada/calgary/calgary-father-dead-5-year-old-girl-missing-after-california-ocean-wave-sweeps-them-away-9.6980908?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.732,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.681,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A Calgary man, Yuji Hu, died and his five-year-old daughter is missing after they were swept into the Pacific Ocean by a six-metre-tall wave at Garrapata State Beach in California. The incident occurred while Hu was with his family on the shoreline.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a tragic event but does not offer any deeper understanding or actionable insights. It does not report on solutions, improvements or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  }
]