[
  {
    "title": "FBI Hunts Suspect in Fatal Shooting of Activist Charlie Kirk at Utah Event",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 10:29:50 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "CityNews",
      "Deutsche Welle",
      "NPR",
      "Forbes",
      "Global News",
      "Business Insider",
      "The Guardian",
      "LA Times",
      "Financial Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.npr.org",
      "www.theguardian.com",
      "globalnews.ca",
      "www.ft.com",
      "abcnews.go.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.businessinsider.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Utah Gov. Spencer Cox opened a press briefing Friday morning by saying: \"We got him.\" He named the suspect as Tyler Robinson and said he was turned in to authorities on Thursday night.",
      "Robinson is believed to have acted alone in what Utah Governor Spencer Cox called a &#039;political assassination&#039;.",
      "The shooter of Charlie Kirk is still at large and unidentified.",
      "According to US President Donald Trump, someone close to the suspect in the killing of Charlie Kirk turned him in, and he is currently in police custody. Trump said he hopes the suspect receives the death penalty.",
      "Authorities have taken into custody the person they suspect of shooting and killing conservative activist Charlie Kirk on Wednesday at a Utah university campus event.",
      "Tyler Robinson was identified as the alleged shooter of Charlie Kirk.",
      "NEW: A suspect has been arrested in the fatal shooting of conservative activist Charlie Kirk, officials announced.",
      "ABC News' Aaron Katersky reports on the casings that Utah Gov. Spencer Cox says were found on the scene.",
      "A person is in custody in the fatal shooting of conservative activist Charlie Kirk, President Trump said.",
      "22-year-old in police custody after manhunt that began on Wednesday following killing of conservative activist",
      "<p>Spencer Cox identifies the suspect as 22-year-old Tyler Robinson, as FBI faces scrutiny for its response to shooting</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\">Charlie Kirk shooting – follow lates",
      "<p>On Wednesday night, Charlie Kirk, an influential rightwing activist and Donald Trump ally, <a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-death-political-violence-aftermath\">was shot dead</a> at a university campus in Utah. The US president immediately blamed the ‘radical l",
      "A Robinson family member interviewed by investigators after the shooting alleged that the suspect had become 'more political' in recent years.",
      "Charlie Kirk, a close Trump ally and conservative activist, was fatally shot while on stage speaking at a college campus in Utah on Wednesday.",
      "President Trump said the arrest was made after authorities received a tip off from a minister who recognized the suspect from his photos.",
      "The suspect in Kirk's shooting was turned in by someone \"very close\" to him, President Trump said in a Fox News appearance on Friday.",
      "<p>The suspected shooter was taken into custody shortly before midnight in St. George, Utah, after a family member contacted authorities.</p>",
      "The suspect in custody in connection with the assassination of Charlie Kirk has been identified as a 22-year-old from Utah. Utah Gov. Spencer Cox identified the man as Tyler Robinson. Cox was joined by FBI Director Kash Patel and other officials at a news conference announcing the arrest, and author"
    ],
    "image_url": "",
    "titles": [
      "Authorities say suspect in the Charlie Kirk shooting is in custody",
      "Suspect in Charlie Kirk shooting in custody, named as Tyler Robinson",
      "Fact-checking claims about sniper’s identity in Charlie Kirk shooting",
      "Charlie Kirk shooting: Suspect in custody, to be charged",
      "What to know about Tyler Robinson, Charlie Kirk shooting suspect: How he was caught",
      "Suspect arrested, identified in shooting of Charlie Kirk, officials say",
      "WATCH:  Utah governor says suspect in killing of Charlie Kirk is in custody",
      "WATCH:  Suspect in killing of Charlie Kirk in custody, officials say",
      "WATCH:  Person in custody in shooting of Charlie Kirk, Trump says",
      "US authorities name Charlie Kirk shooting suspect as Tyler Robinson",
      "Charlie Kirk shooting: Utah governor confirms arrest of suspect",
      "Where does the US go after the Charlie Kirk shooting? - podcast",
      "Tyler Robinson: What we know about the Charlie Kirk shooting suspect",
      "Charlie Kirk shooting: U.S. authorities say suspect is now in custody",
      "Charlie Kirk Shooting: Suspect Tyler Robinson Detained, Authorities Say (Live Updates)",
      "Charlie Kirk shooting suspect in custody",
      "'Hey fascist, catch': Authorities nab suspect in Charlie Kirk shooting, reveal ammo messages",
      "22-year-old Utah man in custody in connection with Charlie Kirk shooting"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.965,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.878,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is actively searching for a person of interest in the fatal shooting of conservative activist Charlie Kirk, which occurred during a political event at Utah Valley University. Authorities have released photos of the suspect and recovered a high-powered, bolt-action rifle near the scene. Despite these developments, the shooter remains at large. Officials are offering a reward for information leading to the identification and arrest of the individual responsible for Kirk's death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince Harry Makes Surprise Visit to Ukraine to Support Wounded Soldiers",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 05:37:35 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR",
      "New York Times",
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com",
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Britain's Prince Harry has arrived in Ukraine for a surprise visit in support of wounded service members.",
      "The Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia.",
      "Prince Harry has arrived in Ukraine for a surprise visit to support wounded service members",
      "“We cannot stop the war but what we can do is do everything we can to help the recovery process,” Harry told the Guardian newspaper of his second visit to Ukraine.",
      "The prince arrived in Kyiv on his second trip to the country this year. The visit comes after his charity supporting wounded soldiers said it would expand post-conflict rehabilitation."
    ],
    "image_url": "",
    "titles": [
      "Prince Harry makes surprise visit to Ukraine in support of wounded troops",
      "Prince Harry makes surprise Ukraine visit to support war wounded",
      "Prince Harry makes surprise visit to Ukraine in support of wounded service members",
      "Prince Harry makes surprise visit to Kyiv to see wounded veterans",
      "Prince Harry Meets War Veterans in Surprise Visit to Ukraine"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.872,
      "consensus": 0.995,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.873,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince Harry has made a surprise second visit to Ukraine, aiming to support the recovery of wounded service members. During his trip, he emphasized the importance of aiding the rehabilitation process for military personnel injured in the conflict with Russia. His charity, which focuses on assisting wounded soldiers, announced plans to expand post-conflict rehabilitation efforts.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: effort, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bolsonaro Convicted of Coup Attempt, Sentenced to 27 Years",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 13:27:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "New York Times",
      "Washington Post",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "news.google.com"
    ],
    "snippets": [
      "Brazil’s Supreme Court has sentenced former President Jair Bolsonaro to 27 years in prison for plotting a coup.",
      "The majority of a panel of Supreme Court justices voted to convict the far-right former Brazilian leader of trying to overturn his election defeat to Lula da Silva in 2022. He was sentenced to 27 years in prison.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNcjU5cFFFU0QwWlBWSENibWZGNzlRZVVNc2JqR2VOOHNCRGZ5NmZBNlVqSmt2MzFsZUdqbmhjZDlUOUhwNTdScVpNRU9YQjIzZmNxbE91RG1wa3lUY1BMNUJRbS1hV21TMXRKR0NNZk55SXotX3NYTVp5NFY3WHZhSA?oc=5\" target=\"_blank\">Brazil's Bolsonaro gets 27-year jail sentence for cou",
      "Brazil’s Supreme Court ruled the former president tried to reverse his 2022 election loss with a plot that included plans to assassinate President Luiz Inácio Lula da Silva.",
      "Brazil’s Supreme Court convicted the former president of trying to cling to power after losing the 2022 election, including a plan to assassinate his opponent."
    ],
    "image_url": "",
    "titles": [
      "Brazil’s Bolsonaro gets 27-year prison sentence for ‘attempted coup’",
      "Brazil: Bolsonaro sentenced to 27 years for attempted coup",
      "Brazil's Bolsonaro gets 27-year jail sentence for coup plot - Axios",
      "Bolsonaro sentenced to over 27 years in prison for coup plot in Brazil",
      "Bolsonaro Convicted of Attempting a Coup in Brazil, Sentenced to 27 Years in Prison"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.944,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Brazilian President Jair Bolsonaro has been convicted by the country's Supreme Court for attempting a coup to stay in power after losing the 2022 election to Luiz Inácio Lula da Silva. The court found him guilty of plotting to overturn the election results, including plans to assassinate President Lula. Bolsonaro has been sentenced to 27 years and three months in prison.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Send National Guard to Memphis, Prefers Chicago Deployment",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 15:35:55 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOTkxqS3lhSTRmMW10REdRVWRQRUtMYm1jeThOMTZRbEZxLVBqaFZMenFLVWtVeTJYbFhEdERpSzJaTkNHWm0ybE5OWEhCTmFHS3ZVeldOY3Q1XzFBYlluYWNQenctNkxTU3JYMnB1VVRXYmVWcXYtU3lpR09kQUR2Tl9jdXVvZFU5eEZfWg?oc=5\" target=\"_blank\">Trump backs off Chicago National Guar",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNd3FWM1owM1pDd0ZVUTMzS3ZXSFM3b1lsdS1CUGZrUkNnS2lXSmZhQ0FRZm1ESnFkTmpacGVneHFYNkVOazdEcWZER1ZjT0xRb0ZaMzR5SVpaSGU0SG1PZ29BTnE1QUs5ZFZ2MC1XcUwyd25mcERWbGQ1OWo2cm5aT0xtcG53Zw?oc=5\" target=\"_blank\">Trump to deploy National Guard to Memphis ove",
      "The president called Memphis \"deeply troubled.\"",
      "<p>President makes remark on Fox &amp; Friends after Memphis mayor said he requested financial resources instead</p><p>Donald Trump said on Friday that he will send national guard troops to Memphis as part of his administration’s expanding military-led response to urban crime in Democratic-run citie",
      "Trump said he would have “preferred going to Chicago.”"
    ],
    "image_url": "",
    "titles": [
      "Trump backs off Chicago National Guard threats - Axios",
      "Trump to deploy National Guard to Memphis over crime rate - Axios",
      "Trump says National Guard will deploy to Memphis next, sidestepping Chicago for now",
      "Trump says he will send national guard to Democratic-run Memphis",
      "Trump Says He’s Sending National Guard To Memphis"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.967,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump announced plans to send National Guard troops to Memphis, citing the city's \"deeply troubled\" state. This decision is part of his administration's broader strategy to address urban crime in Democratic-led cities. However, Trump also mentioned a preference for deploying the National Guard to Chicago instead. The announcement came after the Memphis mayor requested financial assistance, not military intervention.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Packers' Jayden Reed Suffers Broken Collarbone in Uncounted Play",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 09:16:35 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Packers wide receiver Jayden Reed broke his collarbone on a play that didn't count during the opening drive of Thursday's 27-18 win against the Commanders.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM0tRdjgyU01ndjNQbm9sa3FIZ3RXc1JOV3dZNnpJZTV0Q3M3QTFvZTdCWjJrTmdacU1pWHF6RkZlcGdZSUZFeExHU1AxSVdNV2tGaTRYOWt0OTF2Zmt5NTNYemFWWXp1QnVVb3dkamEyWVlhRU1LTDNxR2ZIRFFVSWQya0xIQ01f?oc=5\" target=\"_blank\">Jayden Reed Injury: Packers WR to Miss Sign",
      "<p>The Green Bay Packers will be without wide receiver Jayden Reed for the foreseeable future.</p>"
    ],
    "image_url": "",
    "titles": [
      "WR Reed breaks collarbone in Packers' victory",
      "Jayden Reed Injury: Packers WR to Miss Significant Time With Broken Collarbone - Sports Illustrated",
      "Packers’ Jayden Reed suffers fractured collarbone vs. Commanders"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.75,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jayden Reed, a wide receiver for the Green Bay Packers, suffered a broken collarbone during a play that was ultimately not counted in Thursday's game against the Commanders at Lambeau Field. The injury occurred during the opening drive, leading to a 27-18 victory for the Packers. Reed will be sidelined for an indefinite period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Supports UN Condemnation of Israel's Attack on Hamas Office",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 13:52:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The US traditionally blocks actions against its close ally Israel at the United Nations.",
      "In a rare move, the US backed a UN Security Council statement condemning Israel’s attack on Hamas’s Doha office.",
      "The United States, ordinarily a protector of Israel at the United Nations, signed on to a statement condemning its attack on Hamas in the Qatari capital."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3902/live/4e880f60-8fce-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "US joins UN Security Council condemnation of Israeli strikes on Qatar",
      "UN Security Council unite in condemning Israeli bombing of Qatar",
      "U.S. Joins U.N. Security Council’s Criticism of Israeli Strike in Qatar"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In an unusual action, the United States supported a UN Security Council statement that condemns Israel's attack on Hamas's office in Doha, Qatar. This marks a rare instance of the US not shielding its ally Israel at the United Nations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Hunts Suspect in Fatal Shooting of Activist Charlie Kirk at Utah Event",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 08:02:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The FBI released CCTV video showing what they said was the moment the suspect in the shooting of Charlie Kirk escaped.",
      "The FBI released images of a person of interest sought in connection with the fatal shooting of Charlie Kirk during an event at Utah Valley University on Wednesday.",
      "The F.B.I. released two grainy images of a person of interest, but the gunman remained at large more than a day after the shooting."
    ],
    "image_url": "",
    "titles": [
      "FBI releases CCTV video of Charlie Kirk’s alleged killer escaping",
      "WATCH:  FBI releases images of person of interest amid manhunt for Charlie Kirk's killer",
      "The Manhunt for Charlie Kirk’s Killer"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.844,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is actively searching for a person of interest in the fatal shooting of conservative activist Charlie Kirk, which occurred during a political event at Utah Valley University. Authorities have released photos of the suspect and recovered a high-powered, bolt-action rifle near the scene. Despite these developments, the shooter remains at large. Officials are offering a reward for information leading to the identification and arrest of the individual responsible for Kirk's death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korean Workers Detained in US Over Visa Issues Spark Outrage",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 08:38:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Images of arrested workers in handcuffs and chains have caused outrage over what many see as a betrayal of an ally.",
      "<p>As Hyundai-LG workers fly home after visa ordeal, Koreans bristle at ‘humiliation’ and sense of betrayal by Seoul’s ally</p><p>More than 300 South Korean workers arrived at Incheon international airport on Friday afternoon, ending a week-long ordeal that began with the US Department of Homeland S",
      "The workers, whose detention in a workplace immigration sweep set off outrage in South Korea, expressed both relief and anger."
    ],
    "image_url": "",
    "titles": [
      "More than 300 South Korean workers return home after US immigration raid",
      "South Korea outraged at 300 workers treated as ‘prisoners of war’ in US raid",
      "Freed South Korean Workers Return From the U.S. to Tearful Cheers"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.854,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 300 South Korean Hyundai-LG workers returned home after a week-long detention in the US over visa issues, sparking widespread outrage in South Korea. Images of the workers in handcuffs and chains during their arrest led to public outcry, with many feeling betrayed by a key ally. The incident has caused a diplomatic stir, highlighting tensions over immigration practices and the treatment of foreign workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Utah Man Arrested in Connection with Charlie Kirk's Assassination",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 10:42:15 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The suspect has been identified as Tyler Robinson of Utah. Utah Gov. Spencer Cox said Robinson's family members reached out to a friend, who contacted the Washington County sheriff's office on Thursday.",
      "A suspect is in custody in connection with the assassination of conservative activist Charlie Kirk.",
      "Utah Governor Spencer Cox and FBI Director Kash Patel reveal details of the alleged gunman at a briefing."
    ],
    "image_url": "",
    "titles": [
      "The suspect in Charlie Kirk killing has been arrested. Here's what we know",
      "Suspect in Charlie Kirk’s killing arrested, Utah Governor says",
      "Charlie Kirk shooting suspect identified as Tyler Robinson, 22: All we know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyler Robinson of Utah has been taken into custody as the suspect in the assassination of conservative activist Charlie Kirk. The arrest followed after Robinson's family members contacted a friend who then informed the Washington County sheriff's office. Utah Governor Spencer Cox and FBI Director Kash Patel provided details of the case at a briefing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crawford vs. Alvarez: Anticipated Boxing Match Set for Saturday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 10:37:36 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "Terence Crawford wanted the fight he wasn't supposed to win. He gets that opportunity Saturday after a yearslong chase.",
      "Everything you need to know about Saturday's Canelo Alvarez vs. Terence Crawford boxing card, including the main event ring walk time."
    ],
    "image_url": "",
    "titles": [
      "How Terence Crawford landed Canelo Alvarez",
      "Canelo Alvarez Vs. Terence Crawford Ring Walk Times"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Terence Crawford will face Canelo Alvarez in a highly anticipated boxing match on Saturday, following years of pursuit for this challenging fight. The event includes a full card, with details on the main event's ring walk time available for those interested.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Hunts Suspect in Fatal Shooting of Activist Charlie Kirk at Utah Event",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 06:28:00 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Police shared photos and a video of a person fleeing from the scene after Charlie Kirk was fatally shot. Plus, inflation is rising, and the job market is weakening. So why are stocks soaring?",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNRWpQY3RqQ0VJa0RjMExFOFpNN3N1aEsyQjZRb0otNlFxVUJxdHRwZUVwaHZwazFDcnRhMHNjdV93amJmbElIclBxYUdXQWJfSXhDNHhTQXd3bllzdTl2ZDA3dTQ1TmYwUzQtYkNTWlpoTk1pbVJqVE1oSW1IOVR4SjVWYzBpaWM4Rk5CeWdGaw?oc=5\" target=\"_blank\">Police release photo of person of",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE84NHlabDJMTFp5ZGwxX18wamhGSEhwOG5tSFY2c2lhaGhHVDMxdk83cVhuTjA0VXF0ZE5DXzg2b2ladWNSZGJmSWxkRmJxQ0lYcVNrWjNoX1RyOWlIVTBFRWtUSEpXVUtEZWUtWko3MjdZZi1RMVIwSWVkd1VRY2c?oc=5\" target=\"_blank\">Roblox removes \"over 100 experiences\" tied to Charlie Ki"
    ],
    "image_url": "",
    "titles": [
      "Police share video of Charlie Kirk shooting person of interest. And, prices rise",
      "Police release photo of person of interest in Charlie Kirk shooting death - Axios",
      "Roblox removes \"over 100 experiences\" tied to Charlie Kirk shooting - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is actively searching for a person of interest in the fatal shooting of conservative activist Charlie Kirk, which occurred during a political event at Utah Valley University. Authorities have released photos of the suspect and recovered a high-powered, bolt-action rifle near the scene. Despite these developments, the shooter remains at large. Officials are offering a reward for information leading to the identification and arrest of the individual responsible for Kirk's death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Delays iPhone Air Release Over eSIM Regulatory Approval",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 14:56:06 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Wireless carriers in China must obtain regulatory approval before they can sell devices with an eSIM, the company said.",
      "The eSIM-only iPhone Air's release is being delayed in China, likely due to regulatory issues around the approval of the embedded SIM."
    ],
    "image_url": "",
    "titles": [
      "Apple iPhone Air's China release delayed",
      "Apple delays release of iPhone Air in China due to pending approval of eSIM"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The release of the eSIM-only iPhone Air in China is delayed as wireless carriers need regulatory approval to sell devices with an eSIM. This delay is likely due to issues related to obtaining approval for the embedded SIM.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Micah Parsons' Message to Ravens Cheers Packers Fans",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 15:47:05 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "news.google.com"
    ],
    "snippets": [
      "The star pass rusher send a very clear message to the Ravens.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9Yd0Q3R1I5Z1I3b1hsS0xJZGJpMlFKNzVFalhUc3hUMDJ1NWdzX2lCX2tlWXB1ZmFGbW5uajZjQVlZaDVoel8xR01ueS1La01OWUgzVWxPa2UyUFJsdjhJVjFtd0ptQnlpbTdfY2V0UUxIa2N3YWJIUnMydw?oc=5\" target=\"_blank\">Micah Parsons Recycles Classic Quote After Packers' Dominant ",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5NUGc3OUlNQkU3N3B5d0VIU0pTWlJ2YTljVUl4ZVJlaVdJSEd1a0lBSVMwSW9tRk96QmhMeXZIOElXWExseG82clRWWHB3RGNXNzNpbXU5c3ZOdzY4Nmtha0N1ejNOQXB2SW0ydndpa3RJQ2JR?oc=5\" target=\"_blank\">Packers Fans Loved Micah Parsons’s Simple Three-Word Message</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOV2phcUN6WUtUcXRYRFRvaFZIYktPZGRmc21xMXNhT01OdDZ2VDBSSGZ3X3FmaUk3UTNreU9oS0VXR2hDZUdOWDdVcllqcXlsTkxoOXU4VXpjdXhMZmNZX0ZPV2xpdW9yWHNqZVl4WjdKcDZ1UzFDNTJlRXlGMW1aeWhiWV90UUUxdXRzRFpOTkRBVkZ4ZEE?oc=5\" target=\"_blank\">Where Biggers Fits on De"
    ],
    "image_url": "",
    "titles": [
      "Micah Parsons sends loud message to Baltimore Ravens after dominant performance",
      "Micah Parsons Recycles Classic Quote After Packers' Dominant Defensive Performance - Sports Illustrated",
      "Packers Fans Loved Micah Parsons’s Simple Three-Word Message - Sports Illustrated",
      "Where Biggers Fits on Defensive Line - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Micah Parsons, a star pass rusher, sent a clear three-word message to the Ravens following a game, which was well-received by Packers fans. This concise message, though not specified in the provided content, underscores Parsons's impactful performance and the reaction it garnered from both fans and media. The outcome of the game or the specifics of Parsons's performance were not detailed in the content provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tether Launches USAT Stablecoin, Names Bo Hines CEO of U.S. Division",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 15:49:36 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Tether has revealed its domestic stablecoin, USAT, and named former White House advisor Bo Hines CEO of its U.S. business.",
      "Tether tapped the crypto bank Anchorage Digital and its longtime partner Cantor Fitzgerald to issue the token."
    ],
    "image_url": "",
    "titles": [
      "Tether reveals USAT stablecoin, appoints Bo Hines, former White House advisor, to lead U.S. business",
      "Tether to launch U.S. stablecoin, appoints former Trump crypto guru Bo Hines as CEO of American expansion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tether introduced a new domestic stablecoin, USAT, and appointed ex-White House advisor Bo Hines as CEO of its U.S. operations. The company is partnering with crypto bank Anchorage Digital and its longstanding ally Cantor Fitzgerald to issue the token.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "BBC Weather Presenter Jay Wynne Dies at 56 After Illness",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 15:22:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Jay Wynne joined BBC Weather in October 2000 and was a regular forecaster on BBC News at Ten.",
      "<p>Fellow forecasters pay tribute to Wynne, described as a ‘great broadcaster’ with a ‘wicked sense of humour’</p><p>The weather presenter Jay Wynne has died at the age of 56 after a long illness, his family have said.</p><p>Wynne, who joined the BBC Weather team in 2000, died in June, his brother M"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8ee6/live/26a38ce0-8fc4-11f0-bfd7-a51a4cf13c94.jpg",
    "titles": [
      "Jay Wynne, former BBC weather presenter, dies aged 56",
      "BBC weather presenter Jay Wynne dies aged 56 after long illness"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jay Wynne, a prominent BBC Weather presenter since October 2000, has passed away at 56 after a long illness, according to his family. Known for his role on BBC News at Ten, Wynne was remembered by colleagues as a great broadcaster with a wicked sense of humor. His death was confirmed in June by his brother.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tiana Mangakahia Sets NCAA, ACC Assist Records in 2020-21 Season",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 14:08:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sbnation.com"
    ],
    "snippets": [
      "Mangakahia led all of Division I in assists during the 2020-21 campaign",
      "Tiana Mangakahia was one of the best passers of her generation at Syracuse, setting NCAA and ACC assists records."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/12/aad2d65e-6096-473a-9d4c-5da511a5a4b5/tiana.jpg",
    "titles": [
      "Tiana Mangakahia dies at 30: Former Syracuse women's basketball star fought lengthy cancer battle",
      "Former women’s college basketball star dies after cancer battle"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tiana Mangakahia, a standout player at Syracuse, led Division I in assists during the 2020-21 season and set NCAA and ACC records for assists. She is recognized as one of her generation's best passers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zoe Aldcroft Returns as Captain for England in Rugby World Cup Quarter-Final",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 12:30:35 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>Captain back as Red Roses make four changes to team</p></li><li><p>Aitchison starts first game of tournament at fly-half</p></li></ul><p>Zoe Aldcroft returns for England’s Rugby World Cup quarter-final against Scotland in one of four changes made to the Red Roses starting XV for Sunday’s ",
      "Zoe Aldcroft will return to captain England for their Women's Rugby World Cup quarter-final against Scotland on Sunday after missing the final two group games through injury."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d50b6d3c6064d4f7b8ca27baafb9b47e3fc83516/491_201_4001_3201/master/4001.jpg?width=140&quality=85&auto=format&fit=max&s=81f6fc5a110c069a3b3d1aaa64e70e93",
    "titles": [
      "Zoe Aldcroft returns for England’s quarter-final rugby World Cup clash with Scotland",
      "Aldcroft back to captain Red Roses in World Cup quarter-final with Scotland"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.907,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Zoe Aldcroft returns as captain for England's Women's Rugby World Cup quarter-final against Scotland, marking one of four changes to the Red Roses' starting lineup. Aldcroft, who missed the final two group games due to injury, will start the match on Sunday. Aitchison is set to start his first game of the tournament at fly-half.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Suspect in Shooting of Influencer at Utah University Arrested",
    "domain": "sports",
    "source_domain": "www.lemonde.fr",
    "location": "global",
    "published": "Fri, 12 Sep 2025 14:26:41 +0200",
    "source": "Le Monde",
    "sources": [
      "Le Monde",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.lemonde.fr"
    ],
    "snippets": [
      "Le suspect a été interpellé vendredi, a précisé le gouverneur de l’Utah, Spencer J. Cox, au cours d’une conférence de presse. Donald Trump avait annoncé, vendredi sur Fox News, que le tueur présumé de l’influenceur conservateur avait été dénoncé par « quelqu’un de très proche ».",
      "Kirk, an ally of President Donald Trump, was shot during an event at Utah Valley University, kicking off a multi-day manhunt."
    ],
    "image_url": "https://img.lemde.fr/2025/09/12/500/0/6000/3000/644/322/60/0/c18433f_ftp-import-images-1-chxjoaqshbqd-5866150-01-06.jpg",
    "titles": [
      "Assassinat de Charlie Kirk : le suspect, identifié comme Tyler Robinson, a été arrêté",
      "Charlie Kirk shooter: Officials identify Tyler Robinson as suspect after arrest"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The suspect in the shooting of conservative influencer Kirk at Utah Valley University was arrested on Friday, as confirmed by Utah Governor Spencer J. Cox. The arrest followed a multi-day manhunt after the incident. Donald Trump revealed on Fox News that the suspect was identified by someone close to the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Probes Microsoft Over Slack Complaint on Unfair Bundling",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 09:13:31 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The European Commission last year accused Microsoft of breaching competition rules with the \"abusive\" bundling of its Teams and Office products.",
      "EU probe came after complaint by Slack in 2020."
    ],
    "image_url": "",
    "titles": [
      "Microsoft sidesteps hefty EU fine with Teams unbundling deal",
      "Microsoft dodges EU fine by unbundling Teams from Office"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.847,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In 2020, Slack filed a complaint against Microsoft, leading to an EU investigation in 2021. The European Commission accused Microsoft of violating competition laws by unfairly bundling its Teams and Office software.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Meet Qatar PM in NY Amid Gulf Crisis",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 02:13:46 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE00M1B1RXVSQWRQS080b0dfa2hxUzNfX2tvVWtlMEJhYkRiZDdERkJNZFUxdnRqU0xaU29oM2pQaDc0Q2tEdTZYTVpsMjVRWG9iUGtnZG9OYTY1MjNfbV9MaHMybXd6QWdQTnFlS1FvSGlVQ29kUXZ4dmRpZw?oc=5\" target=\"_blank\">Trump to meet Qatar's PM Friday in aftermath of Israeli strik",
      "President Trump is said to be planning a meeting with Sheikh Mohammed bin Abdulrahman al-Thani in New York on Friday, after an attack that has rattled Persian Gulf states."
    ],
    "image_url": "",
    "titles": [
      "Trump to meet Qatar's PM Friday in aftermath of Israeli strike in Doha - Axios",
      "Qatar Prime Minister to Meet Trump Officials After Israeli Strikes in Doha"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.732,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump is scheduled to meet with Qatar's Prime Minister, Sheikh Mohammed bin Abdulrahman al-Thani, in New York on Friday. This meeting comes in the wake of an attack that has significantly impacted Persian Gulf states.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Microsoft Update Partnership for AI Collaboration",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 22:51:04 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE55bEFNZFUxcW11SV9kTGxiQ0h1NDIxLW1FLVY0RVdTcnZKTy1EYmZCRHVfdElLQzB4REd5VDVKaWhfVjdHZzFQbDNoOHYxLVdYUWlvd3lKNk1uV2lVWkgtOTMyQlJTcllHc0hPR2J2WEFHOFk?oc=5\" target=\"_blank\">OpenAI and Microsoft reach tentative deal to revise partnership</a>&nbsp",
      "Companies work to finalize terms as OpenAI pursues for-profit restructuring."
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Microsoft reach tentative deal to revise partnership - Axios",
      "OpenAI and Microsoft sign preliminary deal to revise partnership terms"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.682,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI and Microsoft have tentatively agreed to update their partnership terms, advancing their collaboration in artificial intelligence. Both parties are in the process of finalizing the agreement as OpenAI seeks to restructure into a for-profit entity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Announces Key Speakers, Side Event Deadline Tonight",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 15:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Planning your Series C and beyond? Hear from IVP’s Zeya Yang, Generation’s Lila Preston, and Diligent Robotics’ Andrea Thomaz on the Builders Stage at TechCrunch Disrupt 2025, October 27–29 in San Francisco.",
      "The application to host a Side Event at TechCrunch Disrupt 2025 closes tonight at 11:59 p.m. PT. Boost your brand during Disrupt Week in October. Apply now."
    ],
    "image_url": "",
    "titles": [
      "Preparing for your later-stage raise: Insider strategies from top investors at TechCrunch Disrupt 2025",
      "Last day to amplify your brand: Host your Side Event at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.986,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025, happening in San Francisco from October 27-29, will feature speakers like IVP's Zeya Yang, Generation's Lila Preston, and Diligent Robotics' Andrea Thomaz on the Builders Stage, focusing on Series C planning and beyond. Additionally, the deadline to apply for hosting a Side Event during Disrupt Week is tonight at 11:59 p.m. PT, offering an opportunity to enhance brand visibility.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]