[
  {
    "title": "Leicester Tigers Dominate Scrums in Twickenham Victory Over Bath",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:48:41 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<ul><li><p>Live updates from the 3pm kick-off at Twickenham</p></li><li><p><a href=\"https://www.theguardian.com/sport/2025/jun/11/rugby-union-bath-premiership-brian-ashton\">How Brian Ashton led Bath to the double in 1995-96</a></p></li><li><p>You can <a href=\"mailto:&quot;Lee Calvert (Casual)&quot; &lt;lee.calvert.casual@guardian.co.uk&gt;\">email Lee</a> with your thoughts</p></li></ul><p><strong>4 mins</strong>. Leicester win said scrum and there’s another one a minute later after more poor Batch handling. This second one brings down the full malevolence of the Tigers pack to crumble the..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7527fb9597355680592b80f6c25e881d8f8576a3/818_0_4543_3634/master/4543.jpg?width=140&quality=85&auto=format&fit=max&s=6fd1d761a9da27a11facb871cefcb645",
    "titles": [
      "Bath v Leicester: Premiership final – live"
    ],
    "summary": "In a rugby match at Twickenham, which started at 3pm, Leicester Tigers demonstrated their dominance by winning a scrum against Bath, followed by a subsequent scrum that showcased the full strength of their pack. This match is part of the coverage that includes a retrospective on how Brian Ashton led Bath to a double victory in the 1995-96 season. Readers are invited to share their thoughts via email with Lee Calvert.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some useful information about the rugby match and the performance of Leicester Tigers. It also provides some context about past victories. However, it doesn't offer actionable insights or deeper understanding about the sport or the teams involved, nor does it report on solutions or improvements. It does, however, invite reader engagement.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Day 1,206: Key Developments in Russia-Ukraine War, Details Unspecified",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:16:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Here are the key events on day 1,206 during Russia&#039;s war on Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Russia-Ukraine war: List of key events, day 1,206"
    ],
    "summary": "On day 1,206 of Russia's war on Ukraine, significant developments occurred, though specific details of these events were not provided in the content. The ongoing conflict marks a prolonged period of hostilities between Russia and Ukraine, highlighting the continued tension and impact on the region. The mention of \"key events\" suggests important occurrences; however, without further information, the nature of these developments remains unspecified.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is not very constructive as it only offers basic awareness about the ongoing conflict between Russia and Ukraine. It mentions 'key developments' but does not provide any details or insights about these events, making it difficult for readers to gain a deeper understanding of the situation or make informed decisions.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.402
  },
  {
    "title": "BC Seniors Face Long Waits for Affordable Housing",
    "domain": "general",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:05:03 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Thousands of seniors who have applied to the BC Housing Registry are waiting for homes amidst soaring need, scarce supply and silence."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/senior-housing-web-article-Thumbnail.jpg?quality=85&strip=all",
    "titles": [
      "‘It’s like a punishment’: Renters’ golden years tarnished by BC Housing backlog"
    ],
    "summary": "Thousands of seniors in British Columbia are on a waiting list for homes through the BC Housing Registry, facing a growing demand for affordable housing amid limited availability. The situation highlights the challenges of meeting the housing needs of seniors in the region, with many experiencing prolonged waits without updates.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is fairly constructive. It highlights a significant issue - the long wait times for affordable housing for seniors in British Columbia. It provides useful information about the challenges faced by seniors and the housing situation in the region. However, it does not report on any solutions, improvements, or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.495
  },
  {
    "title": "Vodafone Ends Contracts with 12 Franchisees Amid £120M Legal Dispute",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:00:52 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Telecoms group says it strongly refutes claim by 62 franchisees that it ‘unjustly enriched’ itself at their expense</p><p>Vodafone has terminated the contracts of 12 franchisees who have continued running the brand’s high street stores while also being part of a £120m high court claim against the telecoms group.</p><p>The legal case was launched in December, when 62 franchisees claimed Vodafone had <a href=\"https://www.theguardian.com/business/2024/dec/10/vodafone-store-managers-debts-franchise-operators-legal-claim\">“unjustly enriched” itself</a> at the expense of scores of vulnerable..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7917406a2d7b1a15e4fd8fb9df5bf3b63bf4a19c/468_204_3493_2794/master/3493.jpg?width=140&quality=85&auto=format&fit=max&s=351224e1da6baab67f6a89d15a04266f",
    "titles": [
      "Vodafone terminates contracts of 12 franchisees who joined £120m lawsuit"
    ],
    "summary": "Vodafone has terminated contracts with 12 franchisees involved in a £120m legal claim against the company. These franchisees, part of a group of 62, accused Vodafone of \"unjustly enriching\" itself at their expense. Vodafone disputes these claims. The legal action was initiated in December, highlighting a significant conflict between the telecom giant and its franchisees.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant legal dispute between Vodafone and its franchisees. It increases awareness about the potential issues between large companies and their franchisees. However, it does not offer any actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Trump Admin Cancels $766M Moderna Contract, Imposes mRNA Vaccine Rules",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:00:51 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Administration’s actions signal move away from technology as health agencies see vaccine-related shakeups</p><p>As top US health officials turn against some mRNA vaccines, experts fear for the country’s preparedness for the next pandemic and worry that other vaccines will be targeted next.</p><p>Donald Trump’s administration recently canceled a $766m award to Moderna on the research and development of H5N1 bird flu vaccines, and officials have announced new restrictions and regulations for Covid mRNA vaccines – actions that signal a move away from the breakthrough technology.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/b7e03d46377c08179009fd4c86bc08ea93e746f9/587_0_4826_3864/master/4826.jpg?width=140&quality=85&auto=format&fit=max&s=78c098ded391a47262e1bd352e799f5d",
    "titles": [
      "US experts fear all vaccines at risk as Trump officials target mRNA jabs"
    ],
    "summary": "The Trump administration has withdrawn a $766 million contract with Moderna for H5N1 bird flu vaccine R&D and imposed new regulations on Covid mRNA vaccines, indicating a pivot away from mRNA technology. This shift has raised concerns among health experts about the U.S.'s readiness for future pandemics and the potential for other vaccines to face similar scrutiny. The cancellation of the Moderna contract and the introduction of new vaccine restrictions reflect a significant change in the government's approach to vaccine technology and public health strategy.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides context about a major shift in the U.S. government's approach to vaccine technology and public health strategy. It raises awareness about the potential implications for future pandemic readiness and vaccine scrutiny. However, it doesn't highlight any progress or solutions.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.444
  },
  {
    "title": "Labour Moves to Lift Bankers' Bonus Cap to Boost London's Economy",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:00:51 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Labour has helped get ball rolling by lifting the bankers’ bonus cap but we have seen before how this play ends</p><p>As the old ways of turning a profit become more difficult – from assembling cars to selling soap powder – politicians of all stripes want the City to inject some dynamism into the economy.</p><p>From Labour to Reform, the siren call of London’s financial district is strong. If only, they ask, the wheels of the banking industry could be cranked to spin faster, surely much more money could be generated and we would all be rich.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/1c89dd0b1be05b39535d0c90de9504d0d6a5a971/471_0_4123_3298/master/4123.jpg?width=140&quality=85&auto=format&fit=max&s=380b2aa6654d9441c618ccfbabe3d5bf",
    "titles": [
      "Letting banks loose is back on the agenda as UK politicians chase growth at any cost"
    ],
    "summary": "Labour has initiated the process of removing the bankers' bonus cap, aiming to stimulate economic dynamism by encouraging the financial sector in London to boost its activity. This move reflects a broader political consensus across various parties, including Reform, on the potential of the City's financial industry to significantly enhance economic growth by increasing its operational pace.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it not only informs about a significant policy change but also provides the rationale behind it - stimulating economic dynamism and growth. It highlights a potential solution to boost London's economy, giving readers a deeper understanding of the strategies being employed in economic policy.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "Israeli Air Force Achieves Operational Freedom in Tehran Airspace: IDF",
    "domain": "general",
    "location": "national",
    "published": "Sat, 14 Jun 2025 14:52:15 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNWHUxOHFtWFZVNTFRMnUwdG9qcV82OXQyZXJGZ3p6ZzdqUTFrNzg4OXZIY1VXM2NzZXBHd0dXTTZIcXljcVhKWGdLckZGZ2d5WWJ1a1JaNkhsSjM2aUdVRnhRVEZrTUVPaU5zcE9YVkQxbHRYTF9EbmgySG5BLVF4N2ZBTWVidnFRWXRkdw?oc=5\" target=\"_blank\">Israeli air force achieved freedom of operation in Tehran's airspace, IDF says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>"
    ],
    "image_url": "",
    "titles": [
      "Israeli air force achieved freedom of operation in Tehran's airspace, IDF says - Axios"
    ],
    "summary": "The Israeli Defense Forces (IDF) announced that the Israeli air force has successfully achieved freedom of operation within Tehran's airspace. This development marks a significant milestone in the capabilities and operational reach of Israel's air force, as stated by the IDF.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the military capabilities of the Israeli air force, which could be important for readers interested in Middle Eastern geopolitics. However, it doesn't provide much insight into the broader implications or potential consequences of this development.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.43
  },
  {
    "title": "Men Jailed for Stealing Churchill Artwork",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 14:51:30 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The men were sentenced to two to four years for their roles in the 2019 theft of an 18-carat artwork at Winston Churchill’s ancestral home."
    ],
    "image_url": "https://static01.nyt.com/images/2025/06/14/multimedia/14xp-toilet-theft-lwjh/14xp-toilet-theft-lwjh-mediumSquareAt3X.jpg",
    "titles": [
      "2 Men Are Sentenced in Theft of Golden Toilet"
    ],
    "summary": "Two men have been sentenced to two to four years in prison for their involvement in the 2019 theft of an 18-carat artwork from Winston Churchill's ancestral home.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of a crime and its consequences, it doesn't offer much depth or insight beyond the basic facts. It doesn't explain why the artwork was significant, how the men were caught, or what the implications might be for security at other historic homes.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.394
  },
  {
    "title": "Chuck Pagano's Return to Ravens Receives Warm Welcome",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:50:09 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Chuck Pagano's return draws smiles each time it is mentioned, but it may also gist the longtime Raven with some closure."
    ],
    "image_url": "",
    "titles": [
      "Chuck Pagano’s Ravens return doubles as a shot at some unfinished business"
    ],
    "summary": "Chuck Pagano's return to the Ravens has been positively received, bringing smiles and potentially offering him closure. His long association with the team underscores the significance of this moment.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides some insight into the dynamics of a sports team and the significance of a former coach's return. However, it doesn't provide much actionable information or a deeper understanding of the sport or the team's strategies.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Houston Texans' Jimmie Ward Arrested; NFL Legal Action Possible",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:49:50 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Houston Texans defensive back Jimmie Ward could face legal action from the NFL following his arrest on Thursday morning."
    ],
    "image_url": "",
    "titles": [
      "Texans DB Jimmie Ward could face NFL suspension following arrest"
    ],
    "summary": "Houston Texans defensive back Jimmie Ward was arrested on Thursday morning. Following his arrest, he may face legal action from the NFL. The current status of the situation and the specifics of the legal action he might face have not been detailed.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the arrest of Jimmie Ward and potential legal action from the NFL, it lacks depth and insight. It does not offer any actionable insights, report on solutions or improvements, or increase clarity around systems or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Ohio Lineman Impresses at WVU Camp, Engages with Coaches",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:44:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Ironton (Oh.) 2026 offensive lineman Caleb Jacobs came to West Virginia to compete in the big man camp and left a positive impression on the coaching staff.  Jacobs, 6-foot-5, 290-pounds, traveled with his team for the 7-on-7 passing tournament but was able to showcase what he could do in front of the coaching staff at the big man event.  The 2026 prospect was able to work with offensive line coach Jack Bicknell during the event and speak with him afterwards, along with head coach Rich Rodriguez."
    ],
    "image_url": "",
    "titles": [
      "2026 OL Caleb Jacobs enjoys West Virginia big man stop"
    ],
    "summary": "Caleb Jacobs, a 2026 offensive lineman from Ironton, Ohio, attended West Virginia's big man camp, leaving a strong impression on the coaching staff. Standing at 6-foot-5 and weighing 290 pounds, Jacobs demonstrated his skills while also participating in a 7-on-7 passing tournament with his team. He had the opportunity to work directly with offensive line coach Jack Bicknell and engaged in discussions with both Bicknell and head coach Rich Rodriguez following the event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Caleb Jacobs' performance at the WVU camp and his interactions with the coaching staff. However, it doesn't report on any specific progress or solutions, nor does it increase clarity around broader systems or trends.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Houston Rockets Win 1995 NBA Championship Led by Olajuwon",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:42:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "It was June 14, 1995, when Hakeem Olajuwon’s Rockets completed perhaps the most iconic run to a championship in NBA history."
    ],
    "image_url": "",
    "titles": [
      "30 years ago today: Rockets complete historic journey to second NBA championship"
    ],
    "summary": "On June 14, 1995, the Houston Rockets, led by Hakeem Olajuwon, secured an NBA championship, marking a historic achievement in the league's history. This victory is celebrated for its significance and the remarkable performance of the team, particularly Olajuwon, during their playoff run.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a historic event in the NBA but offers minimal depth or insight. It doesn't provide actionable insights, report on solutions or improvements, or increase clarity around systems or trends in the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "University of Tennessee Adds In-State Safety to 2026 Football Recruits",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:42:26 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Tennessee receives a football commitment from a 2026 in-state safety prospect."
    ],
    "image_url": "",
    "titles": [
      "In-state safety prospect commits to Tennessee football"
    ],
    "summary": "The University of Tennessee has secured a commitment from an in-state safety prospect for their football team's 2026 recruiting class. This development strengthens the team's future defensive lineup, showcasing the program's ongoing efforts to attract top local talent.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information to readers who follow the University of Tennessee football team, offering insight into the team's recruiting strategy and potential future performance. However, it lacks a broader context or discussion of solutions or innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Josh Rock Criticizes Devon Petersen for Disrespect at Darts World Cup",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:42:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Josh Rock felt Devon Petersen was disrespectful after he poured drink on to Daryl Gurney's darts case during their match at the World Cup of Darts."
    ],
    "image_url": "https://e2.365dm.com/25/06/1920x1080/skysports-josh-rock-daryl-gurney_6941959.jpg?20250614155443",
    "titles": [
      "Rock: Petersen poured drink over Gurney's case"
    ],
    "summary": "Josh Rock criticized Devon Petersen for disrespect after Petersen poured a drink onto Daryl Gurney's darts case during their match at the World Cup of Darts. This incident has led to a public display of disapproval from Rock regarding Petersen's actions.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises awareness about sportsmanship issues in the darts world, it doesn't provide much depth or insight. It focuses on a single incident and reaction, without exploring underlying causes, potential solutions, or broader implications.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "PSV Eindhoven Renews Pursuit of Loum Tchaouna After Lazio Stint",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:40:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "PSV Eindhoven have reportedly revived their attempts to sign Loum Tchaouna who is coming off an underwhelming first season at Lazio.The BackgroundThe Biancocelesti bought the Frenchman last summer fol..."
    ],
    "image_url": "",
    "titles": [
      "PSV Eindhoven Open Talks With Lazio for Young Winger"
    ],
    "summary": "PSV Eindhoven is reportedly renewing their efforts to sign Loum Tchaouna following his disappointing debut season at Lazio. Tchaouna, who transferred to the Biancocelesti last summer, struggled to make a significant impact. This move indicates PSV's continued interest in bolstering their squad with Tchaouna's inclusion.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information about PSV Eindhoven's recruitment strategy and Tchaouna's career trajectory. However, it doesn't delve into the reasons for Tchaouna's underperformance at Lazio or provide insights into how PSV might utilize him differently. It informs but doesn't fully contextualize.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "U.S. Open Purse Stays the Same as Last Year",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 15:39:14 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The purse for this year's U.S. Open is the same as last year."
    ],
    "image_url": "",
    "titles": [
      "U.S. Open purse: How much will the winner will take home?"
    ],
    "summary": "The purse for the U.S. Open this year remains unchanged from last year's amount.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the U.S. Open purse but offers minimal depth or insight into why the purse remains the same or how this might impact the tournament or its participants.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Minnesota State Senator, Wife Shot Multiple Times",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 16:00:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Gov. Tim Walz said that Minnesota Democratic state senator John Hoffman and his wife, Yvette, were also each shot multiple times."
    ],
    "image_url": "",
    "titles": [
      "Minnesota Rep. Melissa Hortman assassinated; manhunt for suspect posing as cop"
    ],
    "summary": "Minnesota Democratic state senator John Hoffman and his wife, Yvette, were each shot multiple times, according to Governor Tim Walz. The current condition of the couple and details surrounding the incident have not been provided in the information available.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "The story is reactive and sensational, focusing on the violent incident without providing any actionable insights, context, or deeper understanding of the situation. It does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.368
  },
  {
    "title": "Trump Military Parade to Mobilize Thousands of Troops",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:00:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Also called the Trump Military parade, it will involve thousands of troops."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-876007180-e1749220018474.jpg?w=2048",
    "titles": [
      "How to watch the Army Birthday Parade live online for free—and without cable"
    ],
    "summary": "The event referred to as the Trump Military Parade is set to feature thousands of troops. This large-scale military parade, planned during Donald Trump's presidency, aims to showcase the strength and discipline of the U.S. armed forces by mobilizing a significant number of military personnel for the event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the planned military parade, giving readers an understanding of its scale. However, it lacks details on the purpose or potential impacts of the event, and does not report on any progress, solutions, or innovations.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424
  },
  {
    "title": "Coatue Founder Regrets Late Bitcoin Investment, Notes Market Entry Shift",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 14:10:26 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Coatue founder Philippe Laffont discusses not investing in bitcoin sooner, the shrinking cost of getting in and the crypto's evolving role in a portfolio."
    ],
    "image_url": "",
    "titles": [
      "Bitcoin becoming 'more central’ to portfolios as its volatility cools, Coatue's Philippe Laffont says"
    ],
    "summary": "Philippe Laffont, founder of Coatue, expressed regret for not investing in Bitcoin earlier. He highlighted the decreasing cost of entry into the cryptocurrency market and discussed Bitcoin's changing role in investment portfolios. Laffont's remarks reflect his evolving perspective on the digital asset's significance and potential financial impact.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insights into the changing dynamics of the cryptocurrency market and its role in investment portfolios. However, it does not offer solutions or highlight progress in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.414
  },
  {
    "title": "$150,000 Now Middle-Class Income in Major U.S. Cities",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 13:30:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Earning a household income of $150,000 makes you middle class in some of the largest U.S. cities."
    ],
    "image_url": "",
    "titles": [
      "The income you need to be middle class in the 15 biggest U.S. cities"
    ],
    "summary": "In several major U.S. cities, a household income of $150,000 is classified as middle class. This financial benchmark reflects the cost of living and economic standards within these urban areas, indicating that such an income level is necessary to maintain a middle-class lifestyle in these locations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about the cost of living and economic standards in major U.S. cities. It provides basic information but lacks depth or actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.946,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.401
  },
  {
    "title": "Study Shows High Child Care, Housing Costs Strain US Families",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 13:15:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Child care and housing costs can make living comfortably expensive for families in the U.S., even with two working adults, a recent SmartAsset study found."
    ],
    "image_url": "",
    "titles": [
      "A family of 4 needs over $300,000 a year to live comfortably in this state—it's not Hawaii or California"
    ],
    "summary": "A recent study by SmartAsset highlights that for families in the U.S., managing living expenses can be challenging due to high costs associated with child care and housing. This difficulty persists despite having two income earners in the household, indicating significant financial pressure on American families in covering essential living costs.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the financial pressures on American families due to high living costs. It increases awareness about the impact of child care and housing costs, but it does not suggest solutions or improvements to the problem.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.941,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Miley Cyrus Marks Career Milestone with First Major Purchase",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 13:05:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The first time Grammy-winning artist Miley Cyrus \"made a little money,\" she splurged on fashion item — and she still owns it today."
    ],
    "image_url": "",
    "titles": [
      "Miley Cyrus shares the first big purchase she ever made: 'I still have it to this day'"
    ],
    "summary": "Grammy-winning artist Miley Cyrus, upon earning her first significant income, invested in a fashion item that she has retained to this day. This purchase highlights a personal milestone in her career, marking the beginning of her financial independence and success in the music industry.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides some basic awareness about Miley Cyrus's career milestone, it does not offer much depth or insight that would be useful to readers. It lacks actionable insights or deeper understanding, and does not report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.938,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.38
  },
  {
    "title": "Dr. Jenny Woo Shares Books That Transformed Her Side Hustle into a Business",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 13:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Mind Brain Emotion founder and CEO Dr. Jenny Woo shares the books that helped her grow her side hustle into a successful full-time business."
    ],
    "image_url": "",
    "titles": [
      "I have 5 income streams and make over $1 million from Amazon alone: 5 books that helped me reinvent—and keep going"
    ],
    "summary": "Dr. Jenny Woo, the founder and CEO of Mind Brain Emotion, has shared a list of books that were instrumental in transforming her side hustle into a thriving full-time business. This selection of literature provided her with the insights and knowledge necessary to expand and solidify her entrepreneurial venture.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides readers with actionable insights and deeper understanding of how to turn a side hustle into a full-time business. It clearly highlights solutions and empowering knowledge by sharing a list of books that were instrumental to Dr. Woo's success.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439
  },
  {
    "title": "Lindsay Lohan Embraces Morning Routine for Happiness, Productivity",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 12:30:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Lindsay Lohan starts her mornings with a workout, green tea, mindfulness. That's a great way to stay happy in life and productive at work, experts say."
    ],
    "image_url": "",
    "titles": [
      "Lindsay Lohan shares the simple morning routine that keeps her motivated and productive: 'It's all about balance'"
    ],
    "summary": "Lindsay Lohan has a morning routine that includes working out, drinking green tea, and practicing mindfulness. Experts agree that such habits contribute to happiness and productivity. This approach to starting her day aligns with recommended practices for well-being and work efficiency.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs and contextualizes usefully, even though the topic is not necessarily negative. It provides readers with actionable insights into practices that could potentially increase their happiness and productivity. However, it does not report on solutions, improvements, or innovations, which prevents it from scoring higher.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.926,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "WVU Student Identifies Fungus Sought by LSD Inventor After 80 Years",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:48:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/long-awaited-mystery-fungus-sought-by-lsds-inventor-found-after-80-year-search/\" rel=\"nofollow\" title=\"Long-Awaited Mystery Fungus Sought by LSD’s Inventor Found After 80-Year Search\"><img alt=\"Corinne Hazel and Professor Daniel Panaccione Examine Morning Glory Samples\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Corinne-Hazel-and-Professor-Daniel-Panaccione-Examine-Morning-Glory-Samples-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A student at WVU identified a..."
    ],
    "image_url": "",
    "titles": [
      "Long-Awaited Mystery Fungus Sought by LSD’s Inventor Found After 80-Year Search"
    ],
    "summary": "After an 80-year search, a student at West Virginia University (WVU) has identified the mystery fungus long sought by LSD's inventor. This discovery resolves a longstanding scientific quest to find the fungus, which is associated with morning glory seeds, a known natural source of psychoactive substances similar to LSD. The breakthrough provides valuable insights into the biochemical pathways of these compounds and their potential applications in medical and psychological research.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides a deep understanding of a long-standing scientific mystery, offers potential applications in medical and psychological research (usefulness), and reports on a significant scientific breakthrough (progress).",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451
  },
  {
    "title": "New Crayfish Species Found; Blood Bacteria Metabolites May Slow Aging",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 15:09:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-2-new-species-of-crayfish-hiding-in-plain-sight/\" rel=\"nofollow\" title=\"Scientists Discover 2 New Species of Crayfish Hiding in Plain Sight\"><img alt=\"Okanagan Crayfish (Pacifastacus Okanaganensis)\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Okanagan-Crayfish-Pacifastacus-Okanaganensis-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Two new crayfish species have been discovered and named, but face immediate threats from invasive species and human...",
      "<a href=\"https://scitechdaily.com/scientists-discover-anti-aging-molecules-hiding-in-your-blood/\" rel=\"nofollow\" title=\"Scientists Discover Anti-Aging Molecules Hiding in Your Blood\"><img alt=\"Anti-Aging Rejuvenation Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Anti-Aging-Rejuvenation-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Three newly identified indole metabolites from a blood-dwelling bacterium were found to reduce skin cell inflammation and aging markers, offering promise for..."
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover 2 New Species of Crayfish Hiding in Plain Sight",
      "Scientists Discover Anti-Aging Molecules Hiding in Your Blood"
    ],
    "summary": "Scientists have discovered two new species of crayfish, now facing threats from invasive species and human activities. Additionally, researchers identified three indole metabolites in blood-dwelling bacteria that can reduce skin cell inflammation and markers of aging, showing potential for anti-aging treatments.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about new species and the threats they face (awareness), and provides insights into potential anti-aging treatments (usefulness). However, it does not clearly highlight solutions or progress towards addressing the threats to the new species.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "Humpback Whales Blow Bubble Rings at Humans in Possible Playful Acts",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 14:38:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/underwater-smoke-signals-humpbacks-may-be-talking-to-humans/\" rel=\"nofollow\" title=\"Underwater Smoke Signals: Humpbacks May Be Talking to Humans\"><img alt=\"Humpback Whale Bubble Ring\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"607\" src=\"https://scitechdaily.com/images/Humpback-Whale-Bubble-Ring-777x607.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Humpback whales have been caught blowing bubble rings at humans in what may be playful or communicative acts. This discovery offers a deeper glimpse into nonhuman..."
    ],
    "image_url": "",
    "titles": [
      "Underwater Smoke Signals: Humpbacks May Be Talking to Humans"
    ],
    "summary": "Humpback whales have been observed blowing bubble rings towards humans, a behavior that could indicate playful or communicative intentions. This interaction provides new insights into the complex ways nonhuman species might attempt to engage with humans, suggesting a deeper level of interspecies communication.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it increases awareness about complex interspecies communication. It provides useful insights into the behavior of humpback whales, but it does not report on progress or solutions related to the topic.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.426
  },
  {
    "title": "Study Questions Taurine's Anti-Aging Benefits",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 09:46:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/taurine-may-not-be-the-anti-aging-fix-youve-heard-about/\" rel=\"nofollow\" title=\"Taurine May Not Be the Anti-Aging Fix You’ve Heard About\"><img alt=\"Taurine Molecular Structure Clear\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Taurine-Molecular-Structure-Clear-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The findings indicate that this amino acid did not show a longitudinal decline with age. Taurine, a popular amino acid known for its role in energy drinks and..."
    ],
    "image_url": "",
    "titles": [
      "Taurine May Not Be the Anti-Aging Fix You’ve Heard About"
    ],
    "summary": "Recent research challenges the popular belief that taurine, an amino acid found in energy drinks, is an anti-aging solution. The study revealed that taurine levels do not decrease with age, suggesting its effects on aging may have been overstated.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful insight into the effects of taurine on aging, challenging a popular belief and thus contributing to a deeper understanding of the topic. However, it does not report on solutions, improvements, or innovations, and the awareness it provides is fairly specific and not broadly applicable.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.875,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "New Nanoparticle Delivery System Targets Lung Cancer Treatment",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 09:21:28 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-hope-for-lung-cancer-scientists-develop-targeted-genetic-treatment/\" rel=\"nofollow\" title=\"New Hope for Lung Cancer: Scientists Develop Targeted Genetic Treatment\"><img alt=\"Lung Cancer Science Photo\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Lung-Cancer-Science-Photo-Crop-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers have developed a lung-targeted nanoparticle delivery system for genetic therapies. In a major step forward for respiratory medicine,..."
    ],
    "image_url": "",
    "titles": [
      "New Hope for Lung Cancer: Scientists Develop Targeted Genetic Treatment"
    ],
    "summary": "Researchers have developed a new lung-targeted nanoparticle delivery system designed for genetic therapies, marking a significant advancement in the treatment of lung cancer. This innovative approach aims to directly target and treat the affected lung tissues, offering new hope for patients battling this disease.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution in the field of lung cancer treatment. It provides actionable insights for those interested in the latest advancements in cancer treatment, and it increases awareness about the potential of genetic therapies and nanoparticle delivery systems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.868,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.425
  },
  {
    "title": "Florida Removes Record Pythons, Ancient Skull Found, Uranus Moons Studied",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 08:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "This week, the state of Florida reached a \"startling milestone\" in the effort to eradicate invasive Burmese pythons in the Everglades. Archaeologists found the 6,000-year-old remains of a teen girl with cranial modification. And a study of the moons of Uranus provides more confirmation that the planet is just really weird."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/saturday-citations-cha.jpg",
    "titles": [
      "Saturday Citations: Chatbots easily tricked; better strength training; dynamics of a neural 'reward map'"
    ],
    "summary": "This week, Florida achieved a significant benchmark in its campaign to remove invasive Burmese pythons from the Everglades. Additionally, archaeologists discovered the 6,000-year-old remains of a teenage girl with modified cranial features. Furthermore, research on Uranus' moons reinforced the notion of the planet's unusual characteristics.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information on various topics, contributing to the reader's understanding of each. It reports on progress in the removal of invasive species and new discoveries in archaeology and astronomy. However, it lacks depth and actionable insights, as it covers multiple topics briefly rather than exploring any one topic in depth.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.926,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "New Tyrannosaur Species Identified from 50-Year-Old Bones in Mongolia",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 08:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Misidentified bones that languished in the drawers of a Mongolian institute for 50 years belong to a new species of tyrannosaur that rewrites the family history of the mighty T-Rex, scientists said Wednesday."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-t-rex-ancestor-dis-1.jpg",
    "titles": [
      "New T-Rex ancestor discovered in drawers of Mongolian institute"
    ],
    "summary": "Bones stored for 50 years at a Mongolian institute have been identified as belonging to a new species of tyrannosaur, according to scientists. This discovery, announced on Wednesday, challenges previous understandings of the T-Rex family history, indicating significant revisions to the evolutionary lineage of these dinosaurs.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful knowledge about a new discovery in the field of paleontology, contributing to a deeper understanding of dinosaur evolution. However, it does not report on progress, solutions, or improvements, nor does it significantly increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.416
  },
  {
    "title": "Wood Pellet Plants Near Yosemite Spark Fire Concerns",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 06:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Facilities that make wood pellets have a track record of catching alight. Yet there are plans to build several near Yosemite’s tinderbox forests."
    ],
    "image_url": "https://media.wired.com/photos/684acaf52adeef00c74c7c45/master/pass/AP24203458670422.jpg",
    "titles": [
      "Wood Pellet Mills Are Prone to Catching Fire. Why Build Them in California?"
    ],
    "summary": "Wood pellet production facilities, known for their susceptibility to fires, are slated for construction near the fire-prone forests surrounding Yosemite National Park. This decision has raised concerns due to the historical incidence of fires at such plants.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful awareness about the potential fire risks associated with wood pellet production facilities. However, it does not offer any solutions or improvements to mitigate these risks, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.384
  }
]