[
  {
    "title": "Trump Announces Trade Deal with Japan, Easing Tariff Tensions",
    "domain": "general",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:56:29 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "NPR",
      "CNBC",
      "Axios",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The 15% tax on imported Japanese goods is a meaningful drop from the 25% rate that Trump, in a recent letter to Japanese Prime Minister Shigeru Ishiba, said would be levied starting Aug. 1.",
      "US president says Japanese exports will be subject to a 15 percent tariff under the trade agreement.",
      "The deal will reportedly see the US levy 15% tariff on goods imported from Japan. Donald Trump also said the US would increase exports of rice and vehicles to the East Asian nation.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE1pdmFtSEREMmpETllzWG9CSHczT0NucFRQRkZZaWxLMGpFbEhaNDZPQXNtbHQ2S1lLUjZTc21DME9rM2xKZUZPZnpvM1Qwd05ZWmtKUDZmTDJQcmh6V2EyMHM5VHd0WUlWdVBnbFZYb3BFaUpaOUxpd1FjOHA?oc=5\" target=\"_blank\">Trump announces Philippines trade deal, after pact with Indo",
      "In his tariff letter sent out to Japan earlier this month, Trump had threatened 25% levies on the country's exports to the U.S., starting Aug. 1.",
      "<p>Tokyo’s failure to secure a US trade deal sooner had caused political uproar and economic uncertainty in Japan, with the prime minister reportedly considering his future</p><p>Donald Trump has announced a trade deal with Japan, potentially resolving weeks of fraught negotiations between the two a",
      "Trump initially threatened a 25% tariff rate for Japan that would have gone into effect in August."
    ],
    "image_url": "",
    "titles": [
      "Trump announces trade deal with Japan that lowers threatened tariff to 15%",
      "Trump announces ‘massive’ trade deal with Japan",
      "Trump announces Japan trade deal with 15% tariff on imports",
      "Trump announces Philippines trade deal, after pact with Indonesia - Axios",
      "Trump announces 'massive' trade deal with Japan, setting tariffs at 15%",
      "Trump announces Japan trade deal amid speculation over future of PM Ishiba",
      "Trump Announces Japan Trade Deal With Lowered Tariffs Of 15%—Toyota And Honda Lead Surge In Japanese Stocks"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.91,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary": "US President Donald Trump has announced a trade deal with Japan, potentially settling weeks of tense negotiations. This follows Trump's earlier threat to impose a 25% tariff on Japanese exports to the U.S. starting August 1. The announcement comes amid political and economic turmoil in Japan, where Prime Minister Shigeru Ishiba was reportedly considering his future due to the failure to secure a US trade deal. Details of the agreement remain limited.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the recent trade deal between the US and Japan, which could have significant economic implications. However, it lacks depth and details about the deal, and does not clearly explain the potential impacts or solutions to the tariff tensions.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "U.S. and Japan Strike Trade Deal, Lower Car Tariffs to 15%",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 04:54:26 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Axios",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "US importers of Japanese cars will pay a tariff of 15% as part of a wider trade agreement.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1vYjJESUZxdjZCWmtFcUtUZjVDcTVMYUFCNFRHaWVIZm9YTGZRNVRHS19NLVZPdS1BQXIyQ3ItYUhJamJJajZHZEVUX3lYdlpuQlNiYjFWcjdROHBld0JrZUNveGFmVV90a3FkOHF2MnpDbUUyTWc?oc=5\" target=\"_blank\">Trump says U.S. reached Japan trade deal with 15% tariffs</a>&nbsp;&",
      "Trump announces ‘massive’ deal that lowers levy to 15% from threatened 25%"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d643/live/56f83420-678a-11f0-af20-030418be2ca5.jpg",
    "titles": [
      "US and Japan agree 'massive' trade deal, Trump says",
      "Trump says U.S. reached Japan trade deal with 15% tariffs - Axios",
      "US and Japan agree trade deal"
    ],
    "score_components": {
      "magnitude": 0.89,
      "recency": 0.928,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.861,
    "summary": "The U.S. has reached a trade agreement with Japan, as announced by former President Trump, which includes a reduction of tariffs on imported Japanese cars to 15%. This is a decrease from the previously threatened 25% tariff, marking a significant development in the trade relations between the two countries.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on a significant development in the trade relations between the U.S. and Japan, which can be seen as a solution to the previous trade tension. This information is useful for readers interested in international trade and can help them understand the dynamics of trade negotiations.",
    "image": {
      "src": "https://live.staticflickr.com/65535/50277580568_01f38f90a0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d331665-7a90-45c7-9e18-79e947016de3/thumb/",
      "alt": "U.S. Secretary of State Michael R. Pompeo meets PM Netanyahu",
      "credit": "U.S. Embassy Jerusalem / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Venus Williams, 45, Wins at Washington Open, Becomes Second-Oldest Victor",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 23 Jul 2025 07:24:36 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "ESPN",
      "BBC",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Seven-time Grand Slam singles champion Venus Williams, 45, beats Peyton Stearns - 22 years her junior - in the first round of the Washington Open.",
      "Venus Williams became the second-oldest woman to win a tour-level singles match in professional tennis at age 45, beating Peyton Stearns -- 22 years her junior -- by a 6-3, 6-4 score at the DC Open on Tuesday night.",
      "Venus Williams produced a superb display on her singles return on Tuesday to knock out world No 35 Peyton Stearns in straight sets at the Mudabala Citi DC Open.",
      "<p>Venus Williams became the second-oldest woman to win a tour-level singles match in professional tennis, delivering some of her familiar big serves and groundstrokes at age 45 while beating Peyton Stearns — 22 years her junior — by a 6-3, 6-4 score at the DC Open on Tuesday night.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2eb2/live/e32d97e0-6786-11f0-9b94-c1ed0a58722f.jpg",
    "titles": [
      "Venus Williams, 45, becomes oldest winner since Navratilova",
      "Venus, 45, wins DC match; oldest since Navratilova",
      "'I have the same fire!' - Venus Williams, 45, becomes oldest WTA winner since 2004",
      "Venus Williams becomes oldest woman to win tour-level match since 2004"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 0.985,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.802,
    "summary": "At 45 years old, Venus Williams defeated 22-year-old Peyton Stearns with a score of 6-3, 6-4 in the first round of the Washington Open, making her the second-oldest woman to win a tour-level singles match in professional tennis. Williams showcased her skill with powerful serves and groundstrokes during the match.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of Venus Williams' recent victory, it does not provide actionable insights or deeper understanding for the reader. It also does not report on solutions, improvements, or innovations, and does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/7243/7345677580_4c781b826d_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1dc7e9c0-7a23-4fa3-81a4-b1f9b1ef1cf4/thumb/",
      "alt": "Venus Transit Viewing at NASA Goddard",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ukraine Parliament Passes Law Boosting Oversight on Anti-Corruption Bodies",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Jul 2025 00:52:31 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Ukraine's parliament passed legislation that will tighten oversight of two key anti-corruption agencies, which critics say could significantly weaken their independence.",
      "New law sparks concern among Western allies as critics say move undermines the authority of the watchdogs.",
      "Ukrainian lawmakers voted to strip two anti-corruption bodies of their independence. This could impede Ukraine's progress toward the EU, which has already expressed concern about the move. DW has the latest."
    ],
    "image_url": "",
    "titles": [
      "Thousands protest as Zelenskyy signs bill weakening anti-corruption agencies",
      "Protests in Ukraine as Zelensky signs bill targeting anti-corruption bodies",
      "Ukraine: EU concerned about Kyiv's anti-corruption bodies"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.927,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.801,
    "summary": "Ukraine's parliament approved legislation increasing government oversight over two major anti-corruption agencies, raising concerns among critics and Western allies about the potential undermining of their independence. This move has sparked worries that it could hinder Ukraine's aspirations to join the European Union, which has already voiced apprehensions regarding the legislation.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the recent legislation passed by the Ukraine parliament and its potential implications. It increases awareness about the political situation in Ukraine and its aspirations to join the European Union. However, it doesn't report on any solutions or improvements, hence the score is not higher.",
    "image": {
      "src": "https://live.staticflickr.com/3907/14630940496_a9c96d4f8e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/eac302f1-b674-4c06-8ebe-77d095a25dd3/thumb/",
      "alt": "Wedding Ukraine National",
      "credit": "be creator / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "US Olympic Committee Bars Transgender Women from Women's Sports",
    "domain": "general",
    "location": "national",
    "published": "Tue, 22 Jul 2025 18:42:35 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The U.S. Olympic and Paralympic Committee tells the federations overseeing swimming, athletics and other sports that it has an \"obligation to comply\" with an executive order issued by President Trump.",
      "<p>Olympic and Paralympic committee tells federations it has ‘obligation to comply’ with executive order issued by Trump</p><p>The US Olympic and Paralympic committee has in effect barred transgender women from competing in women’s sports, telling the federations overseeing swimming, athletics and o",
      "<p>The U.S. Olympic and Paralympic Committee has effectively barred transgender women from competing in women’s sports, telling the federations overseeing swimming, athletics and other sports it has an “obligation to comply” with an executive order issued by President Donald Trump.</p>"
    ],
    "image_url": "",
    "titles": [
      "U.S. Olympic and Paralympic officials bar transgender women from Olympic women's sports",
      "US Olympics officials quietly bar trans women from competing in women’s sports",
      "U.S. Olympic, Paralympic officials bar transgender women from competing in Olympic women’s sports"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.816,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary": "The U.S. Olympic and Paralympic Committee has informed sports federations, including those for swimming and athletics, that they must comply with an executive order by President Trump, effectively prohibiting transgender women from participating in women's sports competitions. This decision aligns with the committee's stated obligation to adhere to the executive order.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs the reader about a significant decision by the U.S. Olympic and Paralympic Committee, providing useful context about the issue of transgender women in women's sports. However, it doesn't report on solutions or attempts to solve the problem, nor does it provide a deep understanding of the underlying issues.",
    "image": {
      "src": "https://live.staticflickr.com/21/28096036_7a7f2892c5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/54dc6803-3e6d-488f-873d-2cd0440008aa/thumb/",
      "alt": "US Flag",
      "credit": "ReneS / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Heavy Metal Icon Ozzy Osbourne Dies at 76 After Parkinson's Battle",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 18:58:58 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "BBC",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The singer helped invent both heavy metal and the image of the wild rock star,  before unlikely reality TV fame.",
      "John Michael \"Ozzy\" Osbourne once admitted that his destructive lifestyle may have killed him years ago. But the \"Prince of Darkness\" overcame addiction to continue his work and pioneer the heavy metal genre.",
      "<p>Having escaped a life of drudgery in Birmingham, Ozzy became the rare rock frontman you could relate to – and then, against the odds, a national treasure</p><p>• <a href=\"https://www.theguardian.com/music/2025/jul/22/ozzy-osbourne-black-sabbath-frontman-and-icon-of-british-heavy-metal-dies-aged-7",
      "The Prince of Darkness, Ozzy Osbourne, has died at the age of 76, just weeks after taking to the stage for a final performance with the original members of his old band Black Sabbath in Birmingham, England. No cause of death was revealed. Osbourne had been living with Parkinson&#8217;s Disease &#821"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0460/live/32f29d50-672f-11f0-8dbd-f3d32ebd3327.jpg",
    "titles": [
      "Wild life of Ozzy Osbourne, rock's 'prince of darkness'",
      "Ozzy Osbourne: The 'Prince of Darkness' who pioneered hard rock",
      "Ozzy Osbourne, the people’s Prince of Darkness, took heavy metal into the light | Alexis Petridis",
      "The ‘Prince of Darkness’ Ozzy Osbourne dies at 76"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.755,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary": "Heavy metal pioneer Ozzy Osbourne, famously known as the \"Prince of Darkness\" and a key figure in the creation of the genre and the wild rock star image, has died at the age of 76. Osbourne, who rose from a challenging background in Birmingham to become a beloved figure in music and later in reality TV, passed away after battling advanced Parkinson's disease. His death comes shortly after a final performance with Black Sabbath in Birmingham, marking the end of an era for fans worldwide.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides a bit more depth than the previous one, mentioning Ozzy Osbourne's battle with Parkinson's disease and his rise from a challenging background. However, it still lacks actionable insights or a clear focus on solutions or improvements. It does raise awareness about Parkinson's disease, but does not delve into the disease or its impacts.",
    "image": {
      "src": "https://live.staticflickr.com/5220/5383419929_5ba549a233_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3046cead-3903-442f-9c71-76d9111a77c6/thumb/",
      "alt": "Bright similarity: Stylish blonde woman tourist in a large straw hat, wearing a heavy gold link chain, silk dress, straw bag, guerrilla wall art of a business man with a brief case, Historical district, Mazatlan, Mexico",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Amazon to buy AI company Bee that makes wearable listening device",
    "domain": "technology",
    "location": "national",
    "published": "Tue, 22 Jul 2025 20:03:20 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Amazon has launched a flurry of AI products and services, and it recently overhauled its Alexa voice assistant with the technology.",
      "Amazon is acquiring Bee, a startup that puts AI on your wrist. Bee CEO Maria de Lourdes Zollo says on LinkedIn that the company is joining Amazon to help “bring truly personal, agentic AI to even more customers.” Bee makes a $49.99 Fitbit-like device that listens in on your conversations while using",
      "Amazon has acquired the AI wearables startup Bee, which makes a bracelet and an Apple Watch app that record your day-to-day life to function as an AI assistant."
    ],
    "image_url": "",
    "titles": [
      "Amazon to buy AI company Bee that makes wearable listening device",
      "Amazon buys Bee AI wearable that listens to everything you say",
      "Amazon acquires Bee, the AI wearable that records everything you say"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.772,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.751,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about a significant business acquisition in the tech industry. It could help readers understand the direction Amazon is taking with AI and wearable technology, even though it does not report on solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/1978/45567621401_f64ffbcf81_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/770a5efb-4ac3-4c85-87f4-eb2d7d9161fe/thumb/",
      "alt": "Amazon rainforest",
      "credit": "Astro_Alex / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Heavy Metal Icon Ozzy Osbourne Passes Away After Final Concert",
    "domain": "general",
    "location": "global",
    "published": "2025-07-22T20:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ABC News",
      "Business Insider",
      "Deutsche Welle"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Ozzy Osbourne was known to fans as \"The Prince of Darkness\" and the \"Godfather of Heavy Metal.\" The British musician's family has announced his death.",
      "Ozzy Osbourne, famed Black Sabbath frontman and heavy metal pioneer, has died at 76.",
      "Ozzy Osbourne, the cofounding member of Black Sabbath who earned the nickname \"Prince of Darkness,\" died on Tuesday, his family confirmed."
    ],
    "image_url": "",
    "titles": [
      "Ozzy Osbourne, Black Sabbath frontman, dead at 76",
      "WATCH:  Ozzy Osbourne, Black Sabbath legend, dead at 76",
      "Ozzy Osbourne, legendary Black Sabbath front man turned reality TV star, dead at 76"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.785,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary": "Ozzy Osbourne, the British musician known as the \"Prince of Darkness\" and \"Godfather of Heavy Metal\" for his role in pioneering the genre with his band Black Sabbath in the 70s, has died, his family announced. Osbourne, who also gained fame from the reality TV show \"The Osbournes,\" passed away less than three weeks after his retirement concert.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the death of a famous musician, it does not offer much depth or insight. There are no actionable insights or deeper understanding provided, and it does not report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/5220/5383419929_5ba549a233_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3046cead-3903-442f-9c71-76d9111a77c6/thumb/",
      "alt": "Bright similarity: Stylish blonde woman tourist in a large straw hat, wearing a heavy gold link chain, silk dress, straw bag, guerrilla wall art of a business man with a brief case, Historical district, Mazatlan, Mexico",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AFP Seeks Israel's Approval for Gaza Journalists' Evacuation Amid Crisis",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 05:12:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Paris-based news agency says freelance contributors facing &#039;appalling&#039; situation in the war-ravaged enclave.",
      "<p>Palestinian journalists working for French organisation say desperate hunger and lack of clean water is making them ill</p><p>News agency Agence France-Presse (AFP) has called on Israel to allow the immediate evacuation of its freelance contributors and their families from the Gaza Strip, a day a"
    ],
    "image_url": "",
    "titles": [
      "AFP calls on Israel to allow evacuation of its journalists from Gaza",
      "AFP news agency calls on Israel to allow evacuation of its freelance contributors"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.934,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary": "Agence France-Presse (AFP) has requested Israel to permit the urgent evacuation of its freelance journalists and their families from Gaza, citing dire conditions. The Paris-based news agency highlighted the \"appalling\" situation faced by Palestinian journalists, including severe hunger and illness due to a lack of clean water.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about the challenging conditions faced by journalists in Gaza. It provides useful information about the role of news agencies in advocating for their staff. However, it doesn't report on any solutions or improvements, and the depth of the story is limited.",
    "image": {
      "src": "https://live.staticflickr.com/8211/8400689333_4a0e197234_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bca6f659-0ee4-400b-802a-06fb177212c2/thumb/",
      "alt": "1973 Original Photo France Michel Jobert South Vietnam War Vuong Van Bac AFP",
      "credit": "manhhai / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Raleigh's 39th HR, Gilbert's Pitching End Brewers' 11-Game Streak",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 01:25:23 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Seattle All-Star Cal Raleigh hit his major league-leading 39th home run of the season, Logan Gilbert tossed 6⅓ shutout innings and the Mariners ended the Milwaukee Brewers' 11-game winning streak, posting a 1-0 victory Tuesday night at T-Mobile Park.",
      "<p> Cal Raleigh hit his major league-leading 39th home run of the season, Logan Gilbert tossed 6 1/3 shutout innings and the Seattle Mariners snapped the Milwaukee Brewers&#8217; 11-game winning streak, 1-0 on Tuesday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Raleigh's 39th HR helps halt Brewers' 11-game run",
      "Mariners snap Brewers’ 11-game win streak behind Raleigh’s 39th home run"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.938,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary": "Seattle Mariners' Cal Raleigh hit his 39th home run of the season, leading the major leagues, and Logan Gilbert pitched 6⅓ shutout innings as the Mariners ended the Milwaukee Brewers' 11-game winning streak with a 1-0 victory on Tuesday night at T-Mobile Park.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a recent sports event, but doesn't offer much in-depth analysis or insight. It doesn't provide actionable insights or deeper understanding, nor does it report on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/5086/13453182055_b4d5362b9e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a4ef3441-6a3f-459d-902d-a89a139e620a/thumb/",
      "alt": "Raleigh Union Station",
      "credit": "NCDOTcommunications / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Philippines-US Trade Deal Signed; 19% Tariff Raises Business Concerns",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 19:39:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Philippine President Marcos hails the trade deal with the US as &#039;a significant achievement&#039;.",
      "President Donald Trump said the US reached an agreement with the Philippines setting a 19% tariff on the Southeast Asian country’s exports, a deal Philippine businesses say may push them to look at other markets."
    ],
    "image_url": "",
    "titles": [
      "President Trump sets 19% tariff on Philippines in new trade deal",
      "Marcos Meeting With Trump Yields 19% Tariff for Philippines"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.766,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "Philippine President Marcos praised a new trade agreement with the US, describing it as a significant achievement. The deal establishes a 19% tariff on exports from the Philippines to the US. However, Philippine businesses express concerns that this tariff may compel them to explore alternative markets.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a new trade agreement between the Philippines and the US, including potential impacts on businesses. However, it does not delve into potential solutions or improvements to the concerns raised, nor does it provide a deeper understanding of the systems or trends at play.",
    "image": {
      "src": "https://live.staticflickr.com/7194/6950247264_c2bd6f14e5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/abba8245-baa9-4534-9772-3bccfa0ebce8/thumb/",
      "alt": "Philippine, US soldiers conduct raid during Exercise Balikatan 2012 [Image 3 of 5]",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "England Advances to Final, Agyemang Pivotal Despite Slow Starts",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:54:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Michelle Agyemang provided the spark England needed as they advanced past Italy and into the final, but can they avoid more slow starts before it is too late?",
      "This England team does not know when it is beaten, even when everyone else has given up on them. No matter how badly they play, no matter how much luck they have to ride, they find a way to win."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/22/9081f440-dec9-4f21-88e9-ba7f8479e981/england-3.jpg",
    "titles": [
      "As England advance to Euro 2025 final, Sarina Wiegman and Lionesses must stop playing with fire",
      "England will lose Euro 2025 final if Sarina Wiegman does not change"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.836,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary": "Michelle Agyemang played a crucial role in England's advancement to the final after a victory over Italy, despite the team's pattern of slow starts. England has demonstrated resilience, consistently finding ways to win regardless of their performance level or reliance on luck. The team's ability to overcome adversity and never give up, even when faced with skepticism, has been a key factor in their success.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of the team's performance and the role of a key player. It highlights the resilience of the team, which could be seen as a form of progress. However, it could offer more in terms of actionable insights or clarity around systems and trends.",
    "image": {
      "src": "https://live.staticflickr.com/5557/14949716569_389bd08bcb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/391828c0-8cb0-495b-a8ab-cda4c0018586/thumb/",
      "alt": "York, England",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Raducanu Wins at DC Open, Norrie Advances to Last 16",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 06:46:36 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Emma Raducanu secured an impressive straight-sets win over seventh seed Marta Kostyuk in Washington as she looks to build ahead of the US Open.",
      "<ul><li><p>Briton pulls through gruelling encounter to advance</p></li><li><p>Norrie reaches men’s last 16 after seeing off Musetti</p></li></ul><p>Emma Raducanu began her buildup towards next month’s US Open with an impressive straight-sets win over seventh seed Marta Kostyuk at the DC Open in Wash"
    ],
    "image_url": "",
    "titles": [
      "Emma Raducanu’s US Open prep gathers pace with fine win over Marta Kostyuk in Washington",
      "Raducanu’s US Open buildup gathers pace with Washington win over Kostyuk"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.965,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "Emma Raducanu achieved a significant victory at the DC Open in Washington, defeating seventh seed Marta Kostyuk in straight sets. This win marks an important moment in her preparation for the upcoming US Open. Additionally, in the men's category, Norrie advanced to the last 16 after defeating Musetti.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of recent events in the DC Open, but does not offer actionable insights or deeper understanding. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Emma_Raducanu_2021_Transylvania_Open.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4c1da571-67b1-4842-8d97-37c211238166/thumb/",
      "alt": "Emma Raducanu 2021 Transylvania Open",
      "credit": "Nuță Lucian from Cluj-Napoca, Romania / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Rich Hill, 45, Becomes Oldest Active MLB Player in Royals-Cubs Game",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 02:45:49 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The well-traveled lefty gave the Royals five solid innings on Tuesday night",
      "<p>Rich Hill became the oldest active player in baseball when he started against the Cubs in Chicago on Tuesday night after the Kansas City Royals selected the 45-year-old from Triple-A Omaha.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/23/6eb50c01-88bb-409a-9deb-6b43e74b1bbe/rich-hill-imagn.png",
    "titles": [
      "Rich Hill, 45, makes MLB history, becomes oldest active player by starting for Royals vs. Cubs",
      "Royals’ Rich Hill becomes oldest player in majors at 45 with start against Cubs"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.888,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary": "Rich Hill, at 45, became the oldest active player in Major League Baseball when he started for the Kansas City Royals against the Chicago Cubs on Tuesday night. Selected from Triple-A Omaha, Hill delivered five solid innings for the Royals in the game.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides some awareness about a milestone in a player's career, but it lacks depth and actionable insights. It doesn't report on solutions, improvements, or innovations, and it doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/6131/6035865223_81b06dfb62_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/79f05724-6b9d-458c-a8af-72679c84cfb7/thumb/",
      "alt": "The Tea Party pretends to be a populist party but that is misleading, for it was created with a few thousand “true believers” financed by the rich and powerful within the Republican party, This is exactly what happened in Germany in the 30s; Fascism.",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Microsoft Warns of Chinese Actors Exploiting SharePoint Vulnerability",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 15:31:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Two Chinese nation-state actors and one China-based threat actor have tried to exploit the vulnerability for weeks, Microsoft said.",
      "The tech giants have evidence that Chinese hackers are exploiting the new bug, but warned \"multiple actors\" are also hacking into affected SharePoint systems."
    ],
    "image_url": "",
    "titles": [
      "Microsoft says Chinese hacking groups exploited SharePoint vulnerability in attacks",
      "Google, Microsoft say Chinese hackers are exploiting SharePoint zero-day"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.702,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Microsoft reported that two Chinese nation-state actors and one China-based threat actor have been exploiting a new vulnerability in SharePoint systems for weeks. Additionally, the company warned that \"multiple actors\" are also hacking into affected systems, indicating a broader cybersecurity threat. This situation underscores the active interest of various malicious entities in exploiting software vulnerabilities for unauthorized access.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story raises awareness about a specific cybersecurity threat and the broader issue of software vulnerabilities. However, it does not provide actionable insights for readers or report on specific solutions to the problem.",
    "image": {
      "src": "https://live.staticflickr.com/2193/2264763977_fbeb2e34ba_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6e22ebe1-7c72-44d0-94c0-5e8181f91752/thumb/",
      "alt": "Microsoft sign outside building 99",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Pascal Siakam, Sesame Street Star to Lead Brickyard 400 Event",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 21:48:25 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "A big star for the NBA's Indiana Pacers, and an iconic Sesame Street character will play key roles in the July 27 Brickyard 400 at the Indianapolis Motor Speedway.",
      "<p>After helping set the pace in Indiana&#8217;s run to the NBA Finals last month, Pascal Siakam will do the same ahead of the Brickyard 400 on Sunday.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68803d6450d16212b59dcb0e/0x0.jpg?width=960",
    "titles": [
      "Indiana Pacers Pascal Siakam Will Drive NASCAR Brickyard 400 Pace Car",
      "Pacers’ Pascal Siakam to drive pace car at Brickyard 400 in Indianapolis"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.87,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary": "Pascal Siakam, a prominent player for the NBA's Indiana Pacers, along with a notable Sesame Street character, will have significant roles in the Brickyard 400 at the Indianapolis Motor Speedway on July 27. Following his contribution to the Pacers' NBA Finals appearance last month, Siakam is set to lead the pace before the race starts on Sunday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an upcoming event, but does not offer any deeper insights or actionable information. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51867067870_3fb9de3e05_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cb084ea2-2492-4f64-b00d-301c10ccdb8a/thumb/",
      "alt": "Nvidia@16nm@Pascal@GP100@Tesla_P100@T_Taiwan_1912A1_PN9G70.S6W_GP100-897-A1___DSCx07_poly(photoshopped)@5x",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Australia Launches World-First Genome Mapping for 250,000 Species",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 03:03:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A world-first tool is tracking Australia's progress in sequencing the full genomes—or genetic blueprints—of the country's 250,000-plus known and catalogued species."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/into-the-great-genome.jpg",
    "titles": [
      "A new tool helps researchers track Australia's genomic biodiversity"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary": "Australia has launched a pioneering tool aimed at sequencing the genomes of its over 250,000 known species. This world-first initiative tracks the country's progress in mapping the genetic blueprints of its diverse wildlife, marking a significant step in understanding and conserving its biological heritage.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It reports on a world-first innovation in genome mapping, providing readers with an understanding of the importance of conserving biological heritage. It also offers actionable insights into how this tool can be used for conservation purposes.",
    "image": {
      "src": "https://live.staticflickr.com/3658/3462260137_2cd7c42444.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e45b7919-5d33-49ee-818e-45ddcb8a0699/thumb/",
      "alt": "Formal recognition of human rights?! In Australia?!",
      "credit": "moggs oceanlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gulf Buys 60% Stake in Pak Lay Power for $128M to Boost Clean Energy Portfolio",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 02:48:37 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Gulf is buying 60% of the 770-megawatt Pak Lay Power—which is  building a hydroelectric power plant in the Mekong region—for $128 million as the Bangkok-listed company scaled up investments in clean energy."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6880843ca751fe2620e33c18/0x0.jpg?width=960",
    "titles": [
      "Billionaire Sarath Ratanavadi’s Gulf Takes Over Lao Hydro Power Project In $128 Million Deal"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary": "Gulf, a Bangkok-listed company, has acquired a 60% stake in Pak Lay Power, which is constructing a 770-megawatt hydroelectric plant in the Mekong region, for $128 million. This move is part of Gulf's strategy to increase its investments in clean energy.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It informs readers about a concrete step taken by a company to increase its investments in clean energy, contributing to the global effort to combat climate change. It not only provides awareness about the trend of investing in clean energy but also highlights an example of progress in this area.",
    "image": {
      "src": "https://live.staticflickr.com/8504/28915942464_55baa8b5e5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e77cefaf-042c-4d9e-b2fa-91f2951e7bbf/thumb/",
      "alt": "Twilight Time at the Gulf",
      "credit": "Charles Patrick Ewing / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Economists Call for Government Incentive Reform to Boost Productivity",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 07:54:31 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The key issue, economists say, is boosting productivity, something that requires a change in government incentives."
    ],
    "image_url": "",
    "titles": [
      "CNBC's The China Connection newsletter: Beijing has more to worry about than just deflation"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "Economists emphasize the need to increase productivity, which hinges on altering government incentives.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides readers with a deeper understanding of how government incentives can influence productivity. It also highlights a potential solution to boost productivity, therefore contributing to readers' decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/8480/8251577325_445d3c1f9b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a8f32981-b346-40a5-9d86-081928d8dd17/thumb/",
      "alt": "Apple-achia, Amazon-ia, Fortress Facebook and Google Earth by David Parkins in the Economist",
      "credit": "dullhunk / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Fungus Cultivation Boosts Wheat's Nutritional Value, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 03:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "New research in Plants, People, Planet indicates that bread wheat's micronutrient content can be increased by cultivating it with a specific type of fungus."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/wheat-bread.jpg",
    "titles": [
      "Study finds certain fungi boost the micronutrient content of bread wheat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Recent research published in Plants, People, Planet has found that the micronutrient content of bread wheat can be significantly enhanced through cultivation with a particular fungus. This discovery offers a potential pathway to improve the nutritional value of one of the world's staple foods.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful insights into a potential solution for improving the nutritional value of a staple food. It highlights progress in agricultural research and increases awareness about the impact of cultivation techniques on food nutrition.",
    "image": {
      "src": "https://live.staticflickr.com/96/238020547_ead6634155_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/75109d76-6062-4f81-bf70-54b59ecb998e/thumb/",
      "alt": "Orange Fungus",
      "credit": "dnhoshor / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Penn State Researchers Boost Industrial Efficiency with Reaction Acceleration",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 03:02:30 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Speeding up chemical reactions is key to improving industrial processes or mitigating unwanted or harmful waste. Realizing these improvements requires that chemists design around documented reaction pathways. Now, a team of Penn State researchers has found that a fundamental reaction called oxidativ"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-play-in-the-chemic.jpg",
    "titles": [
      "Unexpected electron transfer from hydrogen to metals reshapes understanding of key chemical reactions"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "A team of researchers from Penn State has discovered that by accelerating a fundamental reaction known as oxidative addition, significant improvements can be made in industrial processes. This advancement could lead to more efficient manufacturing and the reduction of harmful waste. The study focuses on optimizing chemical reactions, which is crucial for enhancing various industrial applications.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it reports on a solution to improve industrial efficiency and reduce waste. It offers readers a deeper understanding of the importance of optimizing chemical reactions in industrial processes and highlights the progress made in this area.",
    "image": {
      "src": "https://live.staticflickr.com/7112/7420589920_ed630e8c3a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c9641b2f-6c86-4955-9c2c-bc84bfaa98e3/thumb/",
      "alt": "Pinterest for Nonprofits (Penn Strategies)",
      "credit": "pennstrategies / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Deep-Sea Bacteria Sugar Offers New Cancer Treatment Hope",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 03:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Promoting pyroptosis—an inflammatory form of programmed cell death—has become a promising treatment strategy for cancer. In research published in The FASEB Journal, investigators purified a long-chain sugar molecule, or exopolysaccharide, from deep-sea bacteria and demonstrated that it triggers pyro"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/deep-sea.jpg",
    "titles": [
      "Compound produced by deep-sea bacteria shows anti-tumor effects in mouse study"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Researchers have identified a long-chain sugar molecule, extracted from deep-sea bacteria, that can induce pyroptosis, an inflammatory form of programmed cell death, offering a new potential cancer treatment strategy. This finding was reported in The FASEB Journal, highlighting the molecule's ability to specifically target and kill cancer cells through this process.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a potential innovative solution in cancer treatment. It contributes to the reader's understanding of new scientific findings and their potential applications in healthcare. However, it lacks actionable insights for the general reader.",
    "image": {
      "src": "https://live.staticflickr.com/7383/11231811093_ea8151250a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/85d9af87-2028-488a-a585-4bbaf96aec50/thumb/",
      "alt": "Faux Deep Sea Vent Life",
      "credit": "subarcticmike / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "PayPal taps wallets from China and India to make cross-border payments easier for 2 billion people",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 04:01:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "PayPal is partnering with global fintech companies to let users pay to different wallet systems cross border."
    ],
    "image_url": "",
    "titles": [
      "PayPal taps wallets from China and India to make cross-border payments easier for 2 billion people"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It highlights a solution (PayPal's cross-border payments feature) to a problem (difficulty of cross-border payments), and it could empower readers by making them aware of this new option. It also increases awareness about the global financial system and the role of digital wallets.",
    "image": {
      "src": "https://live.staticflickr.com/8518/8531322820_9be2b46323_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/56ddf376-120e-4917-ba66-9ac6bdd4be03/thumb/",
      "alt": "MWC Barcelona 2013 - eBay, Paypal",
      "credit": "Janitors / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Taiwan Negotiators in US for Tariff Talks with Trump's Team",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 07:25:20 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Taiwan’s trade negotiators have arrived in the US for tariff talks to clinch a deal with President Donald Trump’s team, according to a person familiar with the matter."
    ],
    "image_url": "",
    "titles": [
      "Taiwan Aims to Strike Agreement with US in New Round of Talks"
    ],
    "score_components": {
      "magnitude": 0.099,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Taiwan's trade negotiators are in the US for tariff talks with President Trump's team. The goal is to reach a deal.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about ongoing tariff negotiations between Taiwan and the US, providing useful context for those interested in international trade. However, it lacks detail about the specific issues at stake or potential solutions, limiting its overall constructiveness.",
    "image": {
      "src": "https://live.staticflickr.com/124/413492260_a8c63fe9a5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/49f1eff9-0b06-4aa7-a9dd-fb012180a3aa/thumb/",
      "alt": "Taiwan DPI magazine interview!",
      "credit": "*silviaStella / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "EU and Portugal Leaders to Discuss Trade, Security with China's Xi",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 04:52:54 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Ursula von der Leyen and António Costa prepare to meet Xi Jinping in Beijing amid geopolitical turmoil"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F4c04097b-8a81-4641-aa26-a936dd1c9efe.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "China hits out at EU ahead of tough talks in shadow of trade and Ukraine war"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.434,
    "summary": "Ursula von der Leyen, President of the European Commission, and António Costa, Prime Minister of Portugal, are set to meet with Chinese President Xi Jinping in Beijing. This meeting comes at a time of significant geopolitical unrest. The discussions are expected to address various issues, including trade, climate change, and regional security concerns.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about an upcoming diplomatic meeting, and it hints at the range of complex issues to be discussed, including trade, climate change, and security. However, without more detail on the specific problems being addressed or potential solutions, it falls short of being fully constructive.",
    "image": {
      "src": "https://live.staticflickr.com/8624/16374126025_51408b0624_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8b08d828-09c2-4099-9ad3-7fac45bbbc71/thumb/",
      "alt": "EU Eruption in Greece",
      "credit": "DonkeyHotey / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Inflation Below Expectations Ahead of July Monetary Policy Decision",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 06:00:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The inflation figure was lower than the 0.9% expected by economists, and comes ahead of the country's monetary policy decision later in July."
    ],
    "image_url": "",
    "titles": [
      "Singapore inflation remains at over four-year low ahead of monetary policy decision"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.95,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "The latest inflation figure was below economists' expectations of 0.9%. This data was released before the country's upcoming monetary policy decision in July. The lower inflation rate may impact the decision-making process.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the current economic situation and how it might influence upcoming monetary policy decisions. However, it does not clearly highlight solutions or progress, limiting its constructiveness.",
    "image": {
      "src": "https://live.staticflickr.com/1329/554086317_f30d601436_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/880e612e-e28a-454d-96ba-365596ffb90e/thumb/",
      "alt": "Inflatable lounging",
      "credit": "Yahoo Inc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Ni4W Alloy Could Boost Phone, Laptop, and Data Center Performance",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 04:20:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/phones-data-centers-laptops-one-new-alloy-could-supercharge-them-all/\" rel=\"nofollow\" title=\"Phones, Data Centers, Laptops – One New Alloy Could Supercharge Them All\"><img alt=\"Ni4W Material\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://sci"
    ],
    "image_url": "",
    "titles": [
      "Phones, Data Centers, Laptops – One New Alloy Could Supercharge Them All"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.425,
    "summary": "Researchers have developed a new alloy, Ni4W, which has the potential to significantly enhance the performance of devices such as phones, laptops, and data centers. This material is designed to improve the efficiency and speed of these devices, potentially revolutionizing how they operate. The study's findings suggest that Ni4W could be a key component in future technology advancements, offering a substantial upgrade over current materials used in device manufacturing.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a new alloy that could enhance the performance of everyday devices, contributing to the reader's understanding of technological advancements. However, it does not provide actionable insights for the reader or clear progress in solving a specific problem.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gupshup raises $60M in equity and debt, leaves unicorn status hanging",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 06:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Gupshup has raised over $60 million in a new round over four years after attaining the unicorn status."
    ],
    "image_url": "",
    "titles": [
      "Gupshup raises $60M in equity and debt, leaves unicorn status hanging"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Gupshup's financial situation, which could inform decision-making for investors or stakeholders. However, it doesn't provide deeper insights into the company's plans for the money or how this could impact the broader industry.",
    "image": {
      "src": "https://live.staticflickr.com/2294/2044659688_9f923597d7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d2b95d11-930a-4c42-b44a-57cbd96dd460/thumb/",
      "alt": "Sunny day with puffy clouds as the eyes oversee new prayer flags beings raised, under a multi-colored umbrella, from a restaurant across from the Bodha Stupa, Kathmandu, Nepal",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "De Gea to Explain Failed Real Madrid Move After Retirement",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 03:17:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Former Manchester United goalkeeper David de Gea has said he will only reveal details of his failed move to Real Madrid once his career is over."
    ],
    "image_url": "",
    "titles": [
      "De Gea: Madrid move collapsed 'for a reason'"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.409,
    "summary": "David de Gea, ex-Manchester United goalkeeper, plans to disclose reasons for his unsuccessful transfer to Real Madrid after retiring. He expressed this intention, indicating that the details will be shared post-career. The current status is that de Gea has not yet revealed the specifics of the failed move.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story provides some basic awareness about a player's future intentions, but it lacks depth or insight. It doesn't offer any actionable insights or deeper understanding to the reader. It also doesn't report on any solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/8395/8693587013_8d5243afed_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/28f1b116-6fa2-46d1-911d-e55da801e8a6/thumb/",
      "alt": "Santuario de Montserrat 'Monasterio Santa María de Montserrat' Barcelona,Cataluña,España",
      "credit": "Catedrales e Iglesias / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Windows 11&#8217;s new update will add a bunch of AI features",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-22T16:41:08-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Microsoft is releasing several new AI features for Windows 11, including its Copilot Vision tool that can scan everything on your screen. The features, which are gradually rolling out to everyone now, also include tools that are exclusive to Copilot Plus PCs. For starters, all Windows 11 users can n"
    ],
    "image_url": "",
    "titles": [
      "Windows 11&#8217;s new update will add a bunch of AI features"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.782,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.405,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about the new features that will be added in the Windows 11 update. However, without more information on how these AI features can be used or their potential impacts, it lacks a full score.",
    "image": {
      "src": "https://live.staticflickr.com/5135/5459504420_1450c36a5f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ee762f68-414b-4f94-bca3-bc99a72926fe/thumb/",
      "alt": "Window",
      "credit": "Mullica / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The Escobar Phone scam saga has finally come to an end",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-22T18:27:49-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The former CEO of the company that marketed the sketchy-looking Escobar Fold 1 and Escobar Fold 2 phones — which you may remember from a 2020 video from Marques Brownlee — has pleaded guilty to fraud and money laundering, according to the US Department of Justice. In a plea agreement, United States "
    ],
    "image_url": "",
    "titles": [
      "The Escobar Phone scam saga has finally come to an end"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.812,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about the conclusion of a scam saga, which could be useful for those following the story or interested in tech scams. It does not report on solutions or improvements, but it does increase awareness about the potential risks in the tech industry.",
    "image": {
      "src": "https://live.staticflickr.com/8178/7953813066_6c2ee50fc3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4093d7b-daf4-4125-aa3c-a1a0c2e9a342/thumb/",
      "alt": "Escobar returns to the dugout.",
      "credit": "james_in_to / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Kylian Mbappé to Wear No. 10 Jersey at Real Madrid Next Season",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 03:17:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Kylian Mbappé will wear the No. 10 jersey at Real Madrid next season, switching from the No. 9 he wore last year, a source confirmed to ESPN."
    ],
    "image_url": "",
    "titles": [
      "Source: Mbappé to take No. 10 jersey at Madrid"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.402,
    "summary": "Kylian Mbappé will switch from wearing the No. 9 jersey to the No. 10 jersey at Real Madrid next season, as confirmed by a source to ESPN. This change in jersey number signifies Mbappé's new role within the team for the upcoming season.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "The story provides basic awareness about a change in jersey number for a player, but it doesn't provide any deeper understanding or insight. It doesn't report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Kylian_Mbappe_2017.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/121bcaed-2eeb-4486-8018-3ad41b731e0c/thumb/",
      "alt": "Kylian Mbappe 2017",
      "credit": "Biser Todorov / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "UK Reports Increase in Dog Thefts During COVID Pandemic",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 14:10:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Dog theft can be a devastating crime. During the COVID pandemic, newspapers suggested there was an epidemic of \"dognapping\" in the UK. If you have a dog, the reports may have alarmed you at a time when there were already many reasons to feel afraid."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/dog.jpg",
    "titles": [
      "Dog thefts: What really happened during the COVID pandemic"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.742,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.399,
    "summary": "During the COVID pandemic, reports in the UK suggested a rise in dog thefts, causing alarm among dog owners. The crime of dog theft can have severe emotional impacts. However, it is essential to verify specific data and statistics to understand the true extent of the issue.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the rise in dog thefts during the pandemic, but it lacks depth or insight into the reasons behind this trend or what actions can be taken in response. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "England Advances to Euro 2025 Final After Late Comeback Against Italy",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 23 Jul 2025 06:36:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Sky Sports News' Anton Toloui is joined by Charlotte Harpur from The Athletic as they dissect England's dramatic late comeback against Italy to reach the Euro 2025 final."
    ],
    "image_url": "https://e2.365dm.com/25/07/1920x1080/skysports-england-women-italy-women_6971298.jpg?20250723064414",
    "titles": [
      "Super subs strike again in late comeback - but can England 'find a way' in final?"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391,
    "summary": "England secured a spot in the Euro 2025 final after a dramatic late comeback against Italy, as reported by Sky Sports News' Anton Toloui and The Athletic's Charlotte Harpur. This victory marks a significant achievement for the team, advancing them to the championship match of the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the results of a sports event but does not provide any deeper insight or understanding. It does not report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/5557/14949716569_389bd08bcb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/391828c0-8cb0-495b-a8ab-cda4c0018586/thumb/",
      "alt": "York, England",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Studies Show COVID-19's Long-Term Effects on Brain Health",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 17:00:20 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The covid-19 pandemic changed our lives, and the world, in many ways - and now we are starting to understand its wider neurological effects"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/22151920/SEI_2596765891.jpg",
    "titles": [
      "The pandemic may have aged our brains even before we caught covid-19"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.709,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.391,
    "summary": "The COVID-19 pandemic has significantly impacted global health and daily life. Recent studies are beginning to reveal its broader neurological effects, indicating long-term consequences on brain health and function. This ongoing research aims to understand the full scope of COVID-19's impact on the nervous system.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it provides insights into the long-term effects of COVID-19 on brain health. It increases awareness about the ongoing research into the effects of the virus on the nervous system. However, it does not report on any solutions or improvements, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "OpenAI agreed to pay Oracle $30B a year for data center services",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:36:31 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI was the customer that signed the huge deal that Oracle disclosed last month."
    ],
    "image_url": "",
    "titles": [
      "OpenAI agreed to pay Oracle $30B a year for data center services"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.781,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.385,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This news provides useful context about the business decisions of OpenAI and Oracle, but it does not provide actionable insights or deeper understanding of the implications of this agreement. More information on how this will affect the operations of OpenAI or the data center services industry would make it more constructive.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Andrej_Karpathy%2C_OpenAI.png",
      "thumbnail": "https://api.openverse.org/v1/images/295e4310-a6a5-419d-b3c5-a830a6e6a434/thumb/",
      "alt": "Andrej Karpathy, OpenAI",
      "credit": "Gladwin Analytics / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "2025 Aston Martin Vanquish Volante: A-M’s ultimate GT goes topless",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 23:01:05 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Only a handful of the V12 convertibles will come to the US each year."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/IMG_7213-1152x648.jpg",
    "titles": [
      "2025 Aston Martin Vanquish Volante: A-M’s ultimate GT goes topless"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.821,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.376,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a new car model, but it does not provide deeper insights or actionable information. It does not report on solutions, improvements, or attempts to solve problems, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9F%D1%83%D1%82%D0%B8%D0%BD_%282025-05-22%29_cropped.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bf5bd12a-4d6b-4617-a13a-66eb1f2cf82c/thumb/",
      "alt": "Владимир Путин (2025-05-22) (cropped)",
      "credit": "Пресс-служба Президента России / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Apple Intelligence news summaries are back, with a big red disclaimer",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:24:41 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Apple disabled news summaries earlier this year after they mangled headlines."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/apple-summary-26-1152x648-1753213115.jpeg",
    "titles": [
      "Apple Intelligence news summaries are back, with a big red disclaimer"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.778,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.374,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the return of Apple Intelligence news summaries, but without more information on what the 'big red disclaimer' entails or why it's significant, it lacks depth and insight.",
    "image": {
      "src": "https://live.staticflickr.com/2833/12956313933_6058b1315e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4939b4c-aa73-4256-bb52-9b25962562d9/thumb/",
      "alt": "Apples",
      "credit": "JeepersMedia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Nicolas Jackson Poised for Manchester United Transfer from Chelsea",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 17:30:38 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Nicolas Jackson has been linked with a summer transfer to Manchester United after falling down the pecking order at Chelsea."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/688002933e42a49b586833cb/0x0.jpg?width=960",
    "titles": [
      "Could Unwanted Chelsea Striker Be The Solution To Man Utd’s Problems?"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.796,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.351,
    "summary": "Nicolas Jackson is reportedly set for a summer transfer to Manchester United due to decreased playing time at Chelsea. The player's future seems to be moving towards a switch to Manchester United as he has lost his spot in the Chelsea lineup.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's potential transfer. However, it does not provide deeper insight into the reasons behind the transfer, the implications for both teams, or the player's performance that led to this decision.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Nicola_Sturgeon_2021.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d9f7df1c-b7f1-4441-96cb-d8dfe14e989f/thumb/",
      "alt": "Nicola Sturgeon 2021",
      "credit": "Scottish Government / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "\"New DNA Structures May Revolutionize Light, Sound, and Matter Manipulation\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 03:41:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/these-dna-structures-could-rewrite-the-rules-of-light-sound-and-matter/\" rel=\"nofollow\" title=\"These DNA Structures Could Rewrite the Rules of Light, Sound, and Matter\"><img alt=\"DNA Moiré Superlattices Gallery\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"2"
    ],
    "image_url": "",
    "titles": [
      "These DNA Structures Could Rewrite the Rules of Light, Sound, and Matter"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.343,
    "summary": "Researchers have developed DNA structures that may significantly impact the manipulation of light, sound, and matter, potentially altering fundamental principles in these areas. These structures, known as DNA moiré superlattices, exhibit unique properties that could lead to advancements in various scientific fields. The study's outcomes suggest new possibilities for technological innovation and a deeper understanding of the natural world.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]