[
  {
    "title": "Romanian Nationalist Wins First Round of Presidential Voting",
    "domain": "general",
    "location": "global",
    "published": "Sun, 04 May 2025 23:56:25 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "George Simion bucked a recent trend of voters around the world punishing candidates seen as friendly to President Trump."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/04/multimedia/04int-romania-election--bmhk/04int-romania-election--bmhk-mediumSquareAt3X.jpg",
    "titles": [
      "Romanian Nationalist Wins First Round of Presidential Voting"
    ],
    "summary": "George Simion, a candidate perceived as friendly to President Trump, successfully countered a recent global trend where voters have penalized such candidates. This deviation from the trend signifies a notable outcome in his political context.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful understanding of the current political climate in Romania, highlighting an unexpected deviation from global trends. However, it doesn't provide actionable insights or shed light on potential solutions or progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.776,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.488,
    "normalized_score": 3.35
  },
  {
    "title": "Trump has cut global climate finance. China is more than happy to step in.",
    "domain": "general",
    "location": "global",
    "published": "Sun, 04 May 2025 23:42:08 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "Even U.S. allies locked in national security disputes with Beijing, like the Philippines, are finding it impossible to resist China’s green energy infrastructure."
    ],
    "image_url": "",
    "titles": [
      "Trump has cut global climate finance. China is more than happy to step in."
    ],
    "summary": "The Philippines, despite national security disputes with Beijing, is engaging with China's green energy infrastructure projects. This indicates a broader trend where even countries at odds with China on security issues find the benefits of participating in China’s green energy initiatives compelling.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly presents a trend in global climate finance and provides an understanding of the implications of political decisions on environmental issues. It also highlights China's role in green energy initiatives, which can be seen as a solution to the problem of reduced global climate finance.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.772,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.533,
    "normalized_score": 6.0
  },
  {
    "title": "WATCH:  Coyote drinks water from skylight window on top of Los Angeles hair salon",
    "domain": "general",
    "location": "national",
    "published": "Sun, 04 May 2025 23:34:18 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "A surreal moment was captured on camera when a coyote was spotted drinking water from the skylight window on top of a Los Angeles hair salon."
    ],
    "image_url": "https://s.abcnews.com/images/US/250504_abc_social_SKY_COYOTE_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Coyote drinks water from skylight window on top of Los Angeles hair salon"
    ],
    "summary": "A coyote was observed drinking water from the skylight window of a Los Angeles hair salon, an unusual and notable event that was captured on camera. This incident highlights the rare interaction between urban wildlife and city environments.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises basic awareness about urban wildlife interactions, it lacks depth and insight. It doesn't provide actionable insights or highlight any solutions or progress related to wildlife management in urban environments.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.826,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.481,
    "normalized_score": 2.94
  },
  {
    "title": "A Popemobile Used by Pope Francis Will Become a Mobile Clinic in Gaza",
    "domain": "general",
    "location": "global",
    "published": "Sun, 04 May 2025 23:31:58 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "In his last months, Pope Francis blessed an effort to transform the vehicle he used when he visited the West Bank in 2014 into a mobile health clinic to treat Palestinian children in the Gaza Strip."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/01/world/00int-popemobile/00int-popemobile-mediumSquareAt3X.jpg",
    "titles": [
      "A Popemobile Used by Pope Francis Will Become a Mobile Clinic in Gaza"
    ],
    "summary": "Pope Francis, in his final months, endorsed the conversion of the vehicle he utilized during his 2014 West Bank visit into a mobile health clinic. This clinic is now set to provide medical care to Palestinian children in the Gaza Strip, reflecting the Pope's support for humanitarian efforts in the region.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights a solution (conversion of a vehicle into a mobile clinic) to a problem (lack of medical care in the Gaza Strip). It also provides readers with a deeper understanding of Pope Francis's humanitarian efforts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.77,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.517,
    "normalized_score": 5.06
  },
  {
    "title": "Peru kidnapping leaves 13 dead in gold mine",
    "domain": "general",
    "location": "global",
    "published": "Sun, 04 May 2025 23:12:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Miners were kidnapped and killed in a Peruvian gold mine after a confrontation with a criminal gang."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cdb5/live/3f984f70-2934-11f0-8a06-39fd36bcf4b2.jpg",
    "titles": [
      "Peru kidnapping leaves 13 dead in gold mine"
    ],
    "summary": "In Peru, a group of miners at a gold mine were abducted and subsequently killed following a clash with a criminal gang. This incident underscores the ongoing security challenges within the country's mining sector.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story is negative, it does provide useful context about the security challenges in Peru's mining sector. However, it does not offer any solutions or progress towards addressing these issues.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.766,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.485,
    "normalized_score": 3.18
  },
  {
    "title": "Sensational Scheffler roars to record Byron Nelson victory",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 04 May 2025 23:15:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Scottie Scheffler matched the record for the fewest amount of strokes ever at a PGA Tour event as he stormed to an eight-shot victory at The CJ Cup Byron Nelson in Texas."
    ],
    "image_url": "https://e1.365dm.com/25/05/1920x1080/skysports-scottie-scheffler_6906733.jpg?20250505001505",
    "titles": [
      "Sensational Scheffler roars to record Byron Nelson victory"
    ],
    "summary": "Scottie Scheffler tied the PGA Tour record for the lowest number of strokes at The CJ Cup Byron Nelson in Texas, securing an eight-shot victory. This performance marks a significant achievement in his career.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of an event (Scottie Scheffler's record-tying performance), but does not provide much depth or insight beyond that. It does not highlight any progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.766,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.455,
    "normalized_score": 1.41
  },
  {
    "title": "Race highlights | Miami Grand Prix",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 04 May 2025 23:02:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Highlights of the Miami Grand Prix."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-formula-one-miami-gp_6906645.jpg?20250504225346",
    "titles": [
      "Race highlights | Miami Grand Prix"
    ],
    "summary": "The Miami Grand Prix featured intense racing and strategic gameplay among Formula 1 teams. Max Verstappen secured a victory, further solidifying his lead in the championship standings. The event was marked by competitive overtakes and a challenging track that tested drivers' skills. Safety cars played a pivotal role in the race dynamics, influencing team strategies. The Miami Grand Prix has been highlighted as a significant addition to the Formula 1 calendar, showcasing the sport's growing popularity in the United States.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful recap of the Miami Grand Prix, offering insights into the race dynamics, strategies, and outcomes. However, it doesn't provide a deeper understanding of the systems or trends in Formula 1 racing or highlight any significant progress or solutions.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.763,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.465,
    "normalized_score": 2.0
  },
  {
    "title": "Piastri eases to Miami win as Norris fights back to seal McLaren one-two",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 04 May 2025 22:40:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Oscar Piastri extended his world championship lead with a dominant Miami Grand Prix victory as Lando Norris recovered from first-lap drama to seal a McLaren one-two."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-oscar-piastri-mclaren_6906638.jpg?20250504224724",
    "titles": [
      "Piastri eases to Miami win as Norris fights back to seal McLaren one-two"
    ],
    "summary": "Oscar Piastri increased his lead in the world championship by winning the Miami Grand Prix, showcasing a dominant performance. Lando Norris, despite facing issues on the first lap, managed to secure second place, resulting in a one-two finish for McLaren.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of the race results, but it lacks depth or insight into the broader context or implications. It does not highlight any significant progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.758,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.453,
    "normalized_score": 1.29
  },
  {
    "title": "'Not good teamwork!' | Hamilton fumes at Ferrari after team orders dispute",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 04 May 2025 22:13:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Lewis Hamilton sends jabs at Ferrari on team radio during the Miami Grand Prix."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-formula-one-hamilton_6906618.jpg?20250504221535",
    "titles": [
      "'Not good teamwork!' | Hamilton fumes at Ferrari after team orders dispute"
    ],
    "summary": "During the Miami Grand Prix, Lewis Hamilton made critical remarks about Ferrari via his team radio. These comments highlight a moment of tension between Hamilton and the Ferrari team during the event. The specific content or nature of the jabs was not detailed in the provided information.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story mainly focuses on a moment of tension during the race, but it doesn't provide any actionable insights or deeper understanding. The specific content of the dispute is not detailed, and the story does not increase clarity around systems, causes, trends, or impacts in Formula 1 racing.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.752,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.431,
    "normalized_score": 0.0
  },
  {
    "title": "Mourinho silent on future as Fener title hopes fade",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 5 May 2025 11:55:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "José Mourinho refused to confirm whether he will remain at Fenerbahce next season after Sunday's defeat to Besiktas left them adrift in the title race."
    ],
    "image_url": "",
    "titles": [
      "Mourinho silent on future as Fener title hopes fade"
    ],
    "summary": "José Mourinho did not confirm if he will stay as Fenerbahce's coach next season following a defeat to Besiktas, which impacted their chances in the title race.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the current situation of Fenerbahce's coach and their title hopes, but it does not offer any deeper understanding or actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.488,
    "normalized_score": 3.35
  },
  {
    "title": "NPR and PBS CEOs say they'll challenge Trump administration over federal funding cuts",
    "domain": "business",
    "location": "national",
    "published": "Sun, 04 May 2025 18:01:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The CEOs of NPR and PBS said on Sunday's \"Face the Nation\" they will challenge Trump's executive order to end federal funding to the organizations."
    ],
    "image_url": "",
    "titles": [
      "NPR and PBS CEOs say they'll challenge Trump administration over federal funding cuts"
    ],
    "summary": "The CEOs of NPR and PBS announced on \"Face the Nation\" their intention to challenge President Trump's executive order that aims to terminate federal funding for both organizations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant decision by the CEOs of NPR and PBS to challenge a presidential executive order. It provides useful context about the potential impact of federal funding cuts on these organizations, but it does not report on potential solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.693,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.471,
    "normalized_score": 2.35
  },
  {
    "title": "Engine Maker Cummins Withdraws Its Outlook, Citing Uncertainty Over Tariffs",
    "domain": "business",
    "location": "global",
    "published": "Mon, 05 May 2025 15:56:48 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"picture alliance / Contributor / Getty Images\" src=\"https://www.investopedia.com/thmb/IlFNjWLV-hre-b9gkChzivAUfzE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2169412621-d6291bb9ee9446579e3edfb0ef8e0c2e.jpg\" title=\"Cummins booth at the \" /><figcaption><i><p>picture alliance / Contributor / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Cummins on Monday withdrew its 2025 outlook, citing uncertainty about the impact of the Trump administration's tariffs.</li><li>The vehicle engine maker beat profit and sales estimates in the first quarter.</li><li>Shares of Cummins have lost about 12% of their value since the start of the year.</li></ul><br /><br /><p>Engine maker Cummins (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CMI\">CMI</a>) on Monday withdrew its 2025 outlook, citing uncertainty about the potential impact of the Trump administration's tariffs.<span class=\"ql-inline-citation\"></span></p><p>“Due to growing economic uncertainty driven by tariffs we have withdrawn our full year forecast,” CEO Jennifer Rumsey said, adding “we look forward to reinstating our forecast when conditions allow.”</p><p>Previously, Cummins had projected a revenue decline of 2% to rise of 3% year-over-year, with <a href=\"https://www.investopedia.com/terms/e/ebitda.asp\">earnings before interest, taxes, depreciation, and amortization</a> of 16.2% to 17.2% of sales.<span class=\"ql-inline-citation\"></span> </p><p>The company posted first-quarter <a href=\"https://www.investopedia.com/terms/e/eps.asp\">earnings per share</a> of $5.96, down from $14.03 a year earlier but above analysts' estimates compiled by Visible Alpha. While revenue fell 2.7% to $8.17 billion, that also topped expectations.</p><p>Sales at the firm’s Distribution, Power Systems, and Accelera units advanced, while they fell at its Engine and Components segments. </p><p>Shares of Cummins gained about 2% in recent trading. They've lost about 12% of their value since the start of the year.<br /></p><figure><img alt=\"TradingView\" src=\"https://www.investopedia.com/thmb/ygKH3YqmySwq5YH66CvoAthA_kg=/fit-in/640x480/CMI_2025-05-05_11-50-18-9a1e2073e1534b3d8d32a3ec949ac29a.png\" title=\"CMI\" /><figcaption><i><p>TradingView</p></i></figcaption></figure>"
    ],
    "image_url": "https://www.investopedia.com/thmb/IlFNjWLV-hre-b9gkChzivAUfzE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2169412621-d6291bb9ee9446579e3edfb0ef8e0c2e.jpg",
    "titles": [
      "Engine Maker Cummins Withdraws Its Outlook, Citing Uncertainty Over Tariffs"
    ],
    "summary": "Cummins, an engine manufacturer, announced it is withdrawing its 2025 financial outlook due to uncertainties caused by tariffs from the Trump administration. Despite this, the company reported first-quarter earnings and sales that exceeded analysts' expectations, with earnings per share of $5.96 and revenue of $8.17 billion. However, Cummins has experienced a 12% decline in share value since the beginning of the year. CEO Jennifer Rumsey expressed the company's intention to reinstate the forecast when conditions stabilize.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides empowering knowledge about the impact of tariffs on a major engine manufacturer, Cummins. It reports on the company's financial performance and its decision to withdraw its financial outlook due to uncertainties. This information could be useful for investors, policymakers, and others interested in the effects of trade policies on businesses.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.601,
    "normalized_score": 10.0
  },
  {
    "title": "Berkshire Hathaway shares fall nearly 4% after shocking Buffett exit and an earnings decline",
    "domain": "business",
    "location": "national",
    "published": "Mon, 05 May 2025 15:56:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Investors are processing Warren Buffett's surprise announcement to step down and envision a new path for the conglomerate after his legendary 60-year run."
    ],
    "image_url": "",
    "titles": [
      "Berkshire Hathaway shares fall nearly 4% after shocking Buffett exit and an earnings decline"
    ],
    "summary": "Warren Buffett announced his decision to step down, ending his 60-year tenure leading his conglomerate. Investors are now considering the future direction of the company following this unexpected news.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant event in the business world, which could affect readers who are investors or interested in finance. However, it does not provide any solutions or insights into how the situation could improve, nor does it delve into the reasons behind Buffett's decision.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 7.29
  },
  {
    "title": "Bessent to Milken conference: Trump will make America 'more appealing for investors like you'",
    "domain": "business",
    "location": "national",
    "published": "Mon, 05 May 2025 15:54:05 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Treasury Secretary Scott Bessent sketched out the roadmap of President Donald Trump's economic agenda in a pitch to a room full of global investors."
    ],
    "image_url": "",
    "titles": [
      "Bessent to Milken conference: Trump will make America 'more appealing for investors like you'"
    ],
    "summary": "Treasury Secretary Scott Bessent outlined President Donald Trump's economic plan to global investors, detailing the administration's agenda aimed at stimulating the U.S. economy. The presentation aimed to attract investment by highlighting key policy initiatives.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides awareness about the administration's economic plan and its potential impact on investors. It gives readers a deeper understanding of the government's strategies to stimulate the economy. However, it does not provide actionable insights for the general reader or highlight specific solutions to economic challenges.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 8.94
  },
  {
    "title": "Student loan default has 'dramatic and immediate' credit score impact, expert says — with drop of up to 175 points",
    "domain": "business",
    "location": "national",
    "published": "Mon, 05 May 2025 15:53:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Millions of borrowers who are late on their payments may see their credit scores plummet as collection activity on federal student loans restarts."
    ],
    "image_url": "",
    "titles": [
      "Student loan default has 'dramatic and immediate' credit score impact, expert says — with drop of up to 175 points"
    ],
    "summary": "Millions of borrowers with overdue federal student loan payments face potential drops in their credit scores as collection activities, paused during the pandemic, are set to resume. This change marks the end of temporary relief measures.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for readers with student loans and increases awareness about the impacts of defaulting on these loans. However, it would be even more constructive if it also provided information on possible solutions or strategies to avoid or mitigate the negative impacts of loan default.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 9.06
  },
  {
    "title": "These Common Bad Habits in Your 30s Can Damage Your Body and Mind for Decades",
    "domain": "science",
    "location": "global",
    "published": "Sun, 04 May 2025 20:24:57 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/these-common-bad-habits-in-your-30s-can-damage-your-body-and-mind-for-decades/\" rel=\"nofollow\" title=\"These Common Bad Habits in Your 30s Can Damage Your Body and Mind for Decades\"><img alt=\"Sad Man 30s Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Sad-Man-30s-Art-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A new study reveals that smoking, heavy drinking, and inactivity from a young age significantly harm mental and physical health by midlife, urging early lifestyle changes for healthier aging. Addressing harmful lifestyle choices, such as smoking, excessive alcohol consumption, and physical inactivity, early in life is crucial for increasing the likelihood of a healthy and [...]"
    ],
    "image_url": "",
    "titles": [
      "These Common Bad Habits in Your 30s Can Damage Your Body and Mind for Decades"
    ],
    "summary": "A recent study highlights that engaging in smoking, heavy drinking, and physical inactivity from a young age can significantly damage both mental and physical health by midlife. It emphasizes the importance of making early lifestyle changes to promote healthier aging, suggesting that addressing these harmful habits early on can increase the chances of maintaining good health later in life.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it provides actionable insights into the importance of healthy habits and their long-term impacts on mental and physical health. It increases awareness about the risks of smoking, heavy drinking, and physical inactivity, thus contributing to the reader's decision-making about lifestyle changes.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.727,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.504,
    "normalized_score": 4.29
  },
  {
    "title": "Taking This Popular Type of Medicine as an Infant Could Increase Your Risk of Obesity",
    "domain": "science",
    "location": "global",
    "published": "Sun, 04 May 2025 19:59:33 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/taking-this-popular-type-of-medicine-as-an-infant-could-increase-your-risk-of-obesity/\" rel=\"nofollow\" title=\"Taking This Popular Type of Medicine as an Infant Could Increase Your Risk of Obesity\"><img alt=\"Baby Close Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Baby-Close-Art-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Early antibiotic use is linked to higher BMI and increased obesity risk in children, according to a Finnish study of over 33,000 kids. Children who receive antibiotics during the first two years of life may be more likely to develop a higher body mass index (BMI) in later childhood, according to new research. The findings [...]"
    ],
    "image_url": "",
    "titles": [
      "Taking This Popular Type of Medicine as an Infant Could Increase Your Risk of Obesity"
    ],
    "summary": "A Finnish study involving over 33,000 children found that early antibiotic use in the first two years of life is associated with an increased risk of obesity in later childhood, as indicated by a higher body mass index (BMI).",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the potential risks associated with early antibiotic use, contributing to a deeper understanding of the link between medication use in infancy and health outcomes in later childhood. However, it does not offer solutions or alternatives to antibiotic use, limiting its score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.721,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.492,
    "normalized_score": 3.59
  },
  {
    "title": "Microplastics Are Invading Our Arteries, and It Could Be Increasing Your Risk of Stroke",
    "domain": "science",
    "location": "global",
    "published": "Sun, 04 May 2025 19:34:24 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/microplastics-are-invading-our-arteries-and-it-could-be-increasing-your-risk-of-stroke/\" rel=\"nofollow\" title=\"Microplastics Are Invading Our Arteries, and It Could Be Increasing Your Risk of Stroke\"><img alt=\"Microplastic Particles Fingers\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Microplastic-Particles-Fingers-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Higher levels of micronanoplastics were found in carotid artery plaque, especially in people with stroke symptoms, suggesting a potential new risk factor. People with plaque buildup in the arteries of their neck have been found to carry higher concentrations of tiny plastic particles within those blood vessels compared to individuals with healthy arteries. This difference [...]"
    ],
    "image_url": "",
    "titles": [
      "Microplastics Are Invading Our Arteries, and It Could Be Increasing Your Risk of Stroke"
    ],
    "summary": "Research has revealed that individuals with plaque buildup in their neck arteries, specifically the carotid arteries, have higher concentrations of microplastics compared to those with healthy arteries. This finding suggests a potential link between microplastic exposure and an increased risk of stroke.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story increases awareness about the potential health risks associated with microplastic exposure, providing useful context about its link to stroke risks. However, it doesn't provide actionable insights or report on solutions to the problem of microplastic exposure, which restricts its score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.715,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.48,
    "normalized_score": 2.88
  },
  {
    "title": "Scientists Expose a New Achilles’ Heel of Deadly Brain Cancer",
    "domain": "science",
    "location": "global",
    "published": "Mon, 05 May 2025 14:23:02 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-expose-a-new-achilles-heel-of-deadly-brain-cancer/\" rel=\"nofollow\" title=\"Scientists Expose a New Achilles’ Heel of Deadly Brain Cancer\"><img alt=\"Cancer Cells DNA\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Cancer-Cells-DNA-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Glioblastoma may be driven by 3D DNA folding patterns, not just mutations, offering new paths for treatment. A new preclinical study from researchers at Weill Cornell Medicine suggests that the way DNA folds inside the nuclei of brain cells could play a crucial role in understanding glioblastoma, a particularly aggressive and lethal form of brain [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Expose a New Achilles’ Heel of Deadly Brain Cancer"
    ],
    "summary": "Researchers at Weill Cornell Medicine have discovered that the aggressive and deadly brain cancer, glioblastoma, may be influenced by the 3D folding patterns of DNA within brain cell nuclei, not just genetic mutations. This finding, from a preclinical study, opens up new potential avenues for treating the disease by targeting the structure of DNA.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides useful insights into a new potential treatment for glioblastoma, a deadly brain cancer. It reports on an innovative approach to the disease, focusing on the 3D folding patterns of DNA, and thus offers a new solution to a serious health problem.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.976,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.586,
    "normalized_score": 9.12
  },
  {
    "title": "One Vitamin, Two Discoveries: How B12 Prevents and Heals Acute Pancreatitis",
    "domain": "science",
    "location": "global",
    "published": "Mon, 05 May 2025 13:58:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/one-vitamin-two-discoveries-how-b12-prevents-and-heals-acute-pancreatitis/\" rel=\"nofollow\" title=\"One Vitamin, Two Discoveries: How B12 Prevents and Heals Acute Pancreatitis\"><img alt=\"Man Abdominal Pain Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Man-Abdominal-Pain-Art-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have uncovered a surprising ally in the fight against acute pancreatitis: vitamin B12. Through genetic analysis and mouse model experiments, researchers showed that higher vitamin B12 levels can significantly reduce the severity of this often-deadly condition. Acute Pancreatitis: A Deadly Digestive Threat Acute pancreatitis (AP) is a serious gastrointestinal condition that affects people of [...]"
    ],
    "image_url": "",
    "titles": [
      "One Vitamin, Two Discoveries: How B12 Prevents and Heals Acute Pancreatitis"
    ],
    "summary": "Researchers have found that vitamin B12 plays a crucial role in both preventing and mitigating the severity of acute pancreatitis. Through genetic analysis and tests on mouse models, the study revealed that increased levels of vitamin B12 can significantly lessen the impact of this serious gastrointestinal disease.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it enhances the reader's understanding of the role of vitamin B12 in preventing and mitigating the severity of acute pancreatitis. It reports on a solution to a serious health issue and provides actionable insights (increasing vitamin B12 intake) for those at risk.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.971,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.577,
    "normalized_score": 8.59
  }
]