[
  {
    "title": "Google discontinues Nest Protect smoke alarm and Nest x Yale door lock",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has announced the discontinuation of two products: the Nest Protect Smart Smoke and CO alarm, and the Nest x Yale smart door lock. The Nest Protect, known as one of the best smart smoke alarms available, has been difficult to purchase recently."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9957492488310186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4589373122077547,
    "summary": "Google has announced it will discontinue the Nest Protect Smart Smoke and CO alarm and the Nest x Yale smart door lock. The Nest Protect, recognized as a top smart smoke alarm, has recently faced purchasing difficulties."
  },
  {
    "title": "Madison Square Garden&#8217;s surveillance system banned this fan over his T-shirt design",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T10:31:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Frank Miller was banned for life from New York's Radio City Music Hall, preventing him from attending a concert there on his parents' wedding anniversary. The ban was enforced before he could pass through security."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9761243644560185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45403109111400464,
    "summary": "Frank Miller was permanently banned from entering New York's Radio City Music Hall, resulting in him being unable to attend a concert coinciding with his parents' wedding anniversary. The ban was put into effect before he had the opportunity to go through security."
  },
  {
    "title": "Judge dismisses Samsung’s smart ring lawsuit against Oura",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T10:08:17-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In June, Samsung sought a legal declaration to affirm that its unreleased Galaxy Ring did not violate five patents held by smart ring maker Oura. However, a judge has dismissed Samsung's lawsuit, ruling that Samsung's action was premature as there was no solid proof Oura intended to sue over patent infringement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9597611371180556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44994028427951394,
    "summary": "In June, Samsung filed a lawsuit seeking confirmation that its upcoming Galaxy Ring didn't infringe on five patents owned by Oura, a maker of smart rings. A judge has dismissed the case, stating it was too early for such legal action because there was no concrete evidence that Oura planned to sue Samsung for patent infringement."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 98 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T10:04:12-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, a major discount event that coincides with the onset of spring. The sale, which includes deals on gardening supplies, bedding, and more, started recently and will continue until Monday, March 31, 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9569112834490741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44922782086226853,
    "summary": "Amazon has initiated its Big Spring Sale, offering significant discounts on various items including gardening supplies and bedding. This sale began recently and is set to end on Monday, March 31, 2025."
  },
  {
    "title": "Nvidia RTX 5090 mobile GPU:  more efficient and a little faster",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nvidia's launch of its 50-series desktop GPUs has faced challenges, including quality control problems, limited performance improvements, and issues with cables melting. The new laptop GPUs, including the flagship RTX 5090, are also experiencing a modest start but offer improved efficiency for laptop gamers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9539833725347222,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4484958431336805,
    "summary": "Nvidia's release of its 50-series desktop GPUs has encountered several problems, such as quality control issues, minor performance enhancements, and reports of cables melting. The company's latest laptop GPUs, led by the RTX 5090, have had a lukewarm debut but promise better efficiency for laptop gaming."
  },
  {
    "title": "Common Side Effects is coming back for a second season",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:39:28-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Adult Swim's animated series \"Common Side Effects\" is set to conclude its first chapter this Sunday. However, the network has confirmed the show will return for a second season, continuing the narrative of a man's quest to save the world and challenge major corporations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9397046374074074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44492615935185187,
    "summary": "Adult Swim's \"Common Side Effects\" will end its first season this Sunday, with plans for a second season confirmed. The series follows a man on a mission to save the world and take on big corporations."
  },
  {
    "title": "Amazon MGM Studios head Jennifer Salke steps down",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:30:44-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jennifer Salke is leaving her position as the head of Amazon MGM Studios to pursue a career in producing. This move was announced in an internal memo by Mike Hopkins, the head of Prime Video and Amazon MGM Studios. According to the memo, Amazon will not seek a replacement for Salke's role as part of its organizational strategy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9336267343171296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44340668357928237,
    "summary": "Jennifer Salke is stepping down as the head of Amazon MGM Studios to start a career in producing. Mike Hopkins, leader of Prime Video and Amazon MGM Studios, shared this news in an internal memo, stating that Amazon has decided not to look for a replacement for Salke, aligning with the company's organizational strategy."
  },
  {
    "title": "Nintendo’s Legend of Zelda movie hits theaters in March 2027",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:16:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo's news app announced the release date for the live-action movie titled \"The Legend of Zelda,\" set to premiere worldwide on March 26, 2027. Further details about the movie are currently limited."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9237170119675926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4409292529918981,
    "summary": "Nintendo announced that the live-action movie \"The Legend of Zelda\" will premiere worldwide on March 26, 2027. Details about the movie are currently limited."
  },
  {
    "title": "WhatsApp users can now add music to their status",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "WhatsApp introduces a feature enabling users to add temporary music clips to their profile updates. This feature, allowing snippets from popular songs to be featured in WhatsApp statuses, is rolling out globally, with expansion expected in the coming weeks, as announced by Meta, WhatsApp's parent company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9122553754745371,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4380638438686343,
    "summary": "WhatsApp has launched a new feature that lets users add short music clips to their profile updates. This update, which includes snippets from popular songs for WhatsApp statuses, is being released worldwide. Meta, the parent company of WhatsApp, announced plans for further expansion in the near future."
  },
  {
    "title": "OpenAI has a Studio Ghibli problem",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T08:58:44-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The internet has recently been engaged in creating art using a new tool, producing both beautiful and horrifying pieces. This includes stylized family portraits and various takes on the Distracted Boyfriend meme."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9113633736342592,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4378408434085648,
    "summary": "The internet community has embraced a new tool for creating art, generating a wide range of pieces from beautiful stylized family portraits to unique interpretations of the Distracted Boyfriend meme."
  },
  {
    "title": "State of emergency declared in Myanmar after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:17:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, with tremors also felt in south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing tremors that were felt in neighboring south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Thailand's capital, leading to concerns that workers might be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers could be trapped within the wreckage."
  },
  {
    "title": "Residents describe horror in aftermath of earthquake in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:35:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A resident of Yangon, the largest city in Myanmar, reported to the BBC that they experienced earthquake tremors lasting approximately four minutes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An earthquake caused tremors lasting about four minutes in Yangon, Myanmar's largest city, as reported by a local resident to the BBC."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is perceived as aiming to question the legitimacy of the current leaders in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent move is seen as an attempt to challenge the legitimacy of Kyiv's current leadership."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified that they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the Arctic, Russia's President responded to Trump's plans, labeling them as \"serious.\" He also made it clear that these plans have no connection to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered because of tariffs imposed by Trump, putting at risk future collaborations between the two countries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that the relationship between Canada and the US has changed due to tariffs introduced by Trump, potentially affecting future partnerships between the two nations."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests calling for the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, demanding the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has directed his vice-president to concentrate on the operations of the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, although further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children have died in a recent incident. Additional information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda has reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a prison in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was moved from a US prison to one in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a growing opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by her fan club's founder. The assailant's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A renowned music star was killed by the person who founded her fan club. This individual's first attempt to get parole in Texas was denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies have pledged to retaliate against the United States, following China's accusation that Washington has breached international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies have announced plans to retaliate against the United States, responding to China's claim that the U.S. has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's development was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The technology was developed with assistance from Russia, analysts report."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect has been arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was arrested with the help of a local resident, as reported by the police."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster\" there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a child's report of a \"monster\" under their bed led a babysitter to discover an actual man hiding there."
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained when a convoy of 20 armed vehicles arrived at his residence, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained following the arrival of a convoy of 20 armed vehicles at his residence, as reported by his party."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:46:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected efforts by JD Vance and his wife to engage with the island, following Donald Trump's previous statement about wanting to acquire Greenland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has declined engagement with JD Vance and his wife, following a past statement by Donald Trump expressing a desire to acquire Greenland."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and national factors has made the government's effort to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic issues has complicated the government's pursuit of re-election for a second term."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India has experienced growth due to affluent, urban residents increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India has seen growth as more affluent, urban individuals are spending more on their pets, particularly dogs and cats, providing them with various forms of pampering."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's selection of standout photographs showcases a diverse range of moments from across Africa and beyond. The collection captures a variety of scenes, highlighting the continent's rich cultural, social, and natural landscapes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's collection of standout photographs highlights diverse moments across Africa, showcasing the continent's rich cultural, social, and natural landscapes through a variety of scenes."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed a willingness to spend the entire day playing golf with the US president if it would bring advantages to Vietnam."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister has stated readiness to spend a full day playing golf with the US president if it benefits Vietnam, highlighting a diplomatic gesture aimed at strengthening ties between the two countries."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that allows individuals to visualize their family tree in a dynamic, movie-like format, showing the geographical movement of ancestors over time. This innovative approach can also be applied to model the spread of diseases and track animal migration across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that enables people to see their family tree as a dynamic visual, illustrating ancestors' movements over time. This method can also model disease spread and track animal migration."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that 60% of the gap between predicted and actual ocean temperatures around Antarctica is caused by rising levels of meltwater and rainfall in the region over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals with Long COVID often experience feelings of being dismissed, disbelieved, and unsupported by their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study highlights that many Long COVID patients feel ignored, doubted, and unsupported by their healthcare providers, indicating a gap in the patient-caregiver relationship for those suffering from the condition."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also display distinct gene regulation patterns. This discovery highlights a potential factor in the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from different parts of the body come from various precursor cells and show unique patterns of gene regulation. This finding may explain a key aspect of vertebrates' evolutionary success."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a new method using terahertz (THz) imaging to non-invasively visualize the cochlear structures in mice, enabling high-resolution diagnostics. This technology allows for 3D reconstructions of the inner ear, promising advancements in diagnosing hearing loss and other medical conditions. The potential for creating miniaturized THz devices, such as endoscopes and otoscopes, could revolutionize the diagnosis of hearing loss, cancer, and more, improving diagnostic speed, accuracy, and patient outcomes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new non-invasive technique using terahertz imaging to visualize the cochlear structures in mice, allowing for 3D inner ear reconstructions. This method could lead to advancements in diagnosing hearing loss and other conditions, with the potential for developing miniaturized devices like endoscopes and otoscopes to enhance diagnostic accuracy and patient care."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will encourage scientists to speak out against the misuse of science for political agendas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, promotes teaching eugenics in college genetics courses. He argues this approach will help scientists counter the misuse of science for political purposes."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An analysis of soil samples from twelve parks in Dublin, Ireland, found that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study analyzing soil samples from 12 parks in Dublin, Ireland, discovered that park entrances contained higher concentrations of infective roundworm eggs than other areas within the parks."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
  },
  {
    "title": "Ex-Tulane wing Williams commits to Kentucky",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tulane wing Kam Williams, recognized as one of the top shooters available in the transfer portal, has committed to playing for Mark Pope at Kentucky, as reported by ESPN on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kam Williams, a former Tulane wing known for his shooting skills, has committed to play for Kentucky under coach Mark Pope, according to ESPN."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University had an outstanding performance in a basketball game against Arizona, contributing 30 points, 6 rebounds, 7 assists, and 3 blocks, leading to a 100-93 victory. This win secures the Blue Devils a spot in the Elite Eight for the second consecutive year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg from Duke University scored 30 points, with 6 rebounds, 7 assists, and 3 blocks in a basketball game, leading to a 100-93 win over Arizona. This victory ensures the Blue Devils advance to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win over the Los Angeles Lakers on Thursday night. This shot is considered one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory against the Los Angeles Lakers. This event is highlighted as one of the NBA season's most dramatic finishes."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech a place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored the winning basket with 7.3 seconds left in overtime, helping Texas Tech defeat Arkansas 85-83 after rallying from a 16-point deficit. This victory advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jeremy Pruitt, a former football coach at Tennessee, has sued the NCAA for $100 million. He accuses the NCAA and the university of conspiring to unfairly blame him for violations, labeling him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA and the university, seeking $100 million in damages. Pruitt claims he was made a \"sacrificial lamb\" in a conspiracy to pin violations on him unfairly."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alex Ovechkin led the Washington Capitals in a postgame handshake with retiring Minnesota Wild goalie Marc-Andre Fleury, following their game on Thursday. This gesture was a sign of respect towards Fleury's career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following their game on Thursday, Alex Ovechkin and the Washington Capitals participated in a postgame handshake with Marc-Andre Fleury, the retiring goalie of the Minnesota Wild, as a gesture of respect for his career."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:53:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, amid speculation of his potential trade during the offseason. His performance was warmly received by Cardinals fans, who celebrated with a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, sparking celebrations among Cardinals fans who gave him a curtain call. This performance comes amidst rumors of a possible trade involving Arenado in the offseason."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:21:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The field of 68 teams in the tournament has been reduced to 12 following Thursday's games, with all the action closely monitored."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament started with 68 teams, but after Thursday's games, only 12 teams remain in contention. The progress of the games is being closely watched."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:03:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This rapid conversion involved significant logistical and operational efforts to ensure the stadium was ready for the start of the baseball season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' ballpark for Opening Day in just four days. This involved extensive logistical and operational work to prepare the stadium for the baseball season's kickoff."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:22:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings. The report discusses who among them has taken the top spot, highlighting their performances and contributions to their respective teams."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the latest Sweet 16 player rankings, focusing on their significant performances and contributions to their teams. The report details who has emerged as the top-ranked player among them."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:22:57 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team towards a potential championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are significant contributors to Notre Dame's basketball team, driving the team closer to a potential championship."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:51:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record-breaking number of 3-point shot attempts in the league, sparking a debate on whether there should be measures to limit the frequency of these shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, leading to discussions about potentially implementing measures to reduce these shots' frequency."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, had a standout performance against Travis Hunter, marking a record night that highlighted his potential future in the NFL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, had a record-setting performance against Travis Hunter, showcasing his NFL potential."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After experiencing depression, a snowboarder has regained her happiness and is now aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder who has overcome depression is now targeting qualification for the 2026 Olympics, with her next opportunity at the World Championships this Saturday."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussion arises around whether there has been a change in sportsmanship or officiating in recent games, with players, executives, and analysts sharing various perspectives on the matter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent discussions have emerged on whether there has been a shift in sportsmanship or officiating in recent games, involving insights from players, executives, and analysts. Various viewpoints are being shared on the topic."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As the playoff field becomes clearer, a panel has provided their votes on team standings, with details on each team's schedule up until April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A panel has voted on the standings of teams heading towards the playoffs, providing an analysis of each team's schedule until April 17 to clarify the playoff field."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, Fulham's left back, has had an exceptional season, establishing himself as one of the top players globally in his position. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, the left back for Fulham, has had an outstanding season, earning recognition as one of the world's leading players in his position. He aims to achieve major successes with the U.S. national team."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue involved an unexpected series of events. Since his arrival, he has fully embraced his experience at the university, with no regrets about the path that led him there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue University was marked by unforeseen circumstances. Despite this, he has positively embraced his time at the university and has no regrets regarding the series of events that brought him there."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:19:40 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears have overcome significant challenges and a period of tragedy to reemerge as contenders for a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears have successfully navigated through considerable obstacles and a time of sorrow, positioning themselves as potential contenders for a championship title."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has expressed that speculation linking him with a move to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Johnny Cardoso, a midfielder for Real Betis and the United States national team, stated that rumors of him potentially moving to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann to delay Atleti exit for MLS",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain with Atlético Madrid for the next season, according to sources cited by ESPN. This decision comes despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Canada could face legal action in Davies injury row",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal steps against the Canadian soccer federation due to a severe knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation following a significant knee injury suffered by player Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça : 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:40:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm for competing against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and showed excitement about facing Barcelona in the UEFA Women's Champions League semifinals."
  }
]