[
  {
    "title": "YouTube Settles Trump Lawsuit for $24.5M Over Account Suspension",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:16:56 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Times",
      "The Guardian",
      "Axios",
      "Ars Technica",
      "Business Insider",
      "CNBC",
      "The Verge",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "www.theverge.com",
      "arstechnica.com",
      "www.ft.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "YouTube is the latest social media company to pay Trump tens of millions of dollars to resolve lawsuits brought before he returned to power. The money will fund a new ballroom at the White House.",
      "Video platform settles lawsuit filed in response to Trump&#039;s suspension over the January 6, 2021, riot at US Capitol.",
      "After Meta and X, Google has also settled the lawsuit brought on by the US President. However, YouTube's settlement does not constitute an admission of liability.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE91QkZKM0YyVnFuZWxIV3N4U1Ewb2s0ampyMnk4VG1UMzBieVlFWmlSdHJ1OVdJZmUyc3BpcFpXU29Ha0pfTmJmZlJsRm51SjBraTBBQ3hSZkRBT1piRUhxVF9VTjdxYUdMVXktX0NfRW9kMGRQb2VBTTgwWDZZTEk?oc=5\" target=\"_blank\">YouTube to pay Trump $22 million for suspending his acco",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit involving the suspension of President Donald Trump's account in 2021.",
      "US president sued Google’s video platform after it blocked him from posting following the 2021 attack on the US Capitol",
      "<p>Platform suspended the US president’s YouTube channel in 2021 after the January 6 Capitol riot</p><p>YouTube has agreed to pay $24.5m to settle a suit brought by Donald Trump in 2021 that alleged the platform wrongly suspended his channel after the January 6 attack on the US Capitol. The Google s",
      "In total, YouTube will pay $24.5 million to settle the suit brought by President Donald Trump.",
      "YouTube has settled a lawsuit President Donald Trump filed against the company in 2021, according to The Wall Street Journal. Trump filed sweeping lawsuits against Google-owned YouTube, Meta (then Facebook), and X (then Twitter) after he was suspended from the platforms, and now all three companies ",
      "Alphabet settles with Trump instead of fighting lawsuit over January 6 suspension."
    ],
    "image_url": "",
    "titles": [
      "YouTube agrees to pay Trump $24 million to settle lawsuit over Jan. 6 suspension",
      "YouTube to pay $24.5m to settle lawsuit over Trump’s account suspension",
      "YouTube to pay $24.5 million to settle Trump lawsuit",
      "YouTube to pay Trump $22 million for suspending his account after Jan. 6 riot - Axios",
      "YouTube agrees to pay Trump $24.5 Million to settle lawsuit over suspended account",
      "YouTube pays $24.5mn to settle Trump censorship lawsuit",
      "YouTube agrees to pay Trump $24.5m to settle lawsuit over account suspension",
      "YouTube to pay $22 million to Trump to settle post-January 6 ban case",
      "YouTube caves to Trump with $24.5 million settlement",
      "Trump obtains another settlement as YouTube agrees to pay $24.5 million"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.903,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.856,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump, stemming from the suspension of his account after the January 6, 2021 Capitol riot. This agreement resolves the legal dispute over the platform's decision to block Trump in the aftermath of the Capitol attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Peace Plan for Israel-Gaza Conflict, Awaits Hamas Response",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 12:15:29 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Ahead of the leaders' meeting on Monday, the White House released its peace plan to immediately end Israel's war in the territory, boost aid to Gaza and require Hamas to release Israeli hostages.",
      "The US and Israeli leaders say they have agreed a peace plan for Gaza and warned Hamas to accept it.",
      "They say they have, but on Gaza&#039;s security and long-term governance, Netanyahu appears to differ from the plan.",
      "Proposal calls for an immediate end to the conflict and the release of all remaining hostages",
      "<p>Plan calls for immediate end to war between Israel and Hamas but lacks detail on how key points will be executed</p><p>The White House peace plan for Gaza proposes an immediate end to the devastating war between Israel and Hamas that has raged in the coastal territory for nearly two years, while ",
      "<p>Pair say proposal represents new chapter but Israeli PM threatens to ‘finish the job’ if Hamas officials fail to agree</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/30/trump-gaza-proposal-peace-reactions-welcomed-world-leaders-palestinian-residents-remain-sceptical\"><strong>Tr"
    ],
    "image_url": "",
    "titles": [
      "Trump announces an agreement with Israel to end war in Gaza",
      "Trump and Netanyahu agree new Gaza peace plan",
      "Have Trump and Netanyahu really agreed on a Gaza peace plan? Key takeaways",
      "Netanyahu says Israel backs Trump’s peace plan for Gaza",
      "What’s in Trump’s 20-point peace plan for Gaza?",
      "Trump and Netanyahu to Hamas: accept Gaza peace plan or face consequences"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.78,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.85,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House, under President Trump, proposed a peace plan to end the conflict between Israel and Gaza, including immediate ceasefire, increased aid for Gaza, and the release of Israeli hostages by Hamas. Despite Trump's assurance of full US support for Israel should Hamas reject the proposal, the plan, detailed in a 20-point document, has yet to receive acceptance from Hamas as of the leaders' meeting on Monday.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Probes Church Attack; Trump Proposes Gaza Peace Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 07:11:39 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "Financial Times",
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.ft.com",
      "www.npr.org",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The FBI is searching for answers as to why a man drove his truck into a church yesterday and opened fire. And, Trump has a new proposed plan to end the war in Gaza.",
      "Officials have not yet named a motive for the shooter or the names of the four people killed.",
      "The White House says its proposal would end the war on Gaza immediately if both sides accept.",
      "Israel&#039;s Benjamin Netanyahu has said he supports US President Trump’s 20-point plan to end the war on Gaza.",
      "US President Donald Trump has outlined a plan to end Israel’s war on Gaza.",
      "President says Israel has &#039;full backing&#039; of US, may take steps to defeat Hamas if it doesn&#039;t accept proposed peace deal.",
      "Donald Trump's proposed plan to end the war in Gaza will be discussed with Israeli Prime Minister Benjamin Netanyahu on Monday. So what exactly is in the 21-point plan?",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSVhtd2RYb01zVU9QY256RGtvTmZ0blNiYVg0XzJPTEhCVEF0WkZxWnNPa0E2ZUhjR3FPQmdrX3UwbVNIeDEzNVhvbi1jeFV6MzhQVnJrMkxuRUZXWURDRk5XNk5MX0tCSExTRnB0YW4zSWxWRHhXTzRQQWk?oc=5\" target=\"_blank\">Netanyahu endorses Trump plan to end Gaza war</a>&nbsp;&nbsp",
      "The White House published its plan ahead of a press conference with Israeli Prime Minister Benjamin Netanyahu"
    ],
    "image_url": "",
    "titles": [
      "The latest on the Michigan church shooting. And, Trump's new plan to end war in Gaza",
      "What we know about Michigan church shooting and arson attack",
      "Here’s the full text of Trump’s 20-point plan to end Israel’s war on Gaza",
      "Netanyahu says he supports Trump’s plan to end war on Gaza",
      "Trump outlines plan to end Israel’s war on Gaza",
      "Trump proposes 20-point plan to end war in Gaza",
      "What is Donald Trump's 21-point plan to end Gaza war?",
      "Netanyahu endorses Trump plan to end Gaza war - Axios",
      "Full text of Trump’s proposal to end the war in Gaza"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.702,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is investigating an incident where a man drove his truck into a church and began shooting. Meanwhile, Donald Trump has proposed a 21-point plan aimed at ending the war in Gaza, which he will discuss with Israeli Prime Minister Benjamin Netanyahu on Monday. The specifics of the plan are yet to be detailed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 00:59:57 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Phone and internet connections are down nationwide after the Taliban sever fibre-optic connections.",
      "On orders from the ruling Taliban, Afghanistan's telecommunications authorities have capped fiber optic internet access. It is unclear how long telephone and cellular networks will be affected, or to what degree.",
      "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide ",
      "The internet, now in widespread blackout, has been a lifeline for Afghan women trying to access education — and for Taliban officials trying to run the country."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0203/live/f08a4b00-9d68-11f0-a16f-ff7724a733bf.jpg",
    "titles": [
      "Afghanistan sees telecom shutdown as Taliban cut off internet",
      "Afghanistan: Taliban shuts down internet indefinitely",
      "Afghanistan hit by communications blackout after Taliban shuts internet",
      "Afghanistan’s internet goes down amid fears of a Taliban crackdown"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.916,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madagascar Protests: 22 Dead, President Dissolves Government",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 22:42:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The demonstrations, which started over deteriorating living conditions, have left 22 people dead, according to the UN.",
      "At least 22 people were killed after protests broke out power cuts, water shortages and widespread poverty. The youth-led protesters named their movement Gen Z.",
      "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power ",
      "Andry Rajoelina, the leader of the island nation in Africa, acknowledged grievances over power cuts and water shortages that have drawn thousands of young people to the streets."
    ],
    "image_url": "",
    "titles": [
      "Madagascar president dissolves government after youth-led deadly protests",
      "Madagascar president fires government after Gen-Z protests",
      "Madagascar’s president dissolves government amid youth-led protests",
      "Madagascar’s President Dissolves Government Amid Deadly Protests"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.892,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Madagascar, protests led by the youth movement \"Gen Z\" over severe water and power shortages and escalating poverty resulted in at least 22 fatalities, as reported by the UN. The widespread demonstrations prompted President Andry Rajoelina to dissolve the government in response to the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 22:01:18 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios",
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQNXljdkdjNnJfS1hfRXdIWDVGX3RTdHMwelVPbFhTSmhid3hmb1ZwUmMyUC10UDFfQ2JDWUJ1aW5KNkNUOW1rWk1aSEdtc2lHNmd4TnBILUZHbm14UER0MVgxdFF6NzdpQW5QcXR6UXBKZndLQnVUSjhWdXpLUXJoM3NlLUctNVVjdnV1akxn?oc=5\" target=\"_blank\">Charlie Javice sentenced to 7 years",
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "Charlie Javice got a 7-year prison sentence for defrauding JPMorgan Chase in the $175M sale of her fintech startup Frank.",
      "The fintech startup had been acquired by JPMorgan Chase in 2021 for $175 million. The bank later accused Frank of lying about its customer base."
    ],
    "image_url": "",
    "titles": [
      "Charlie Javice sentenced to 7 years in prison for defrauding JP Morgan - Axios",
      "Startup founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Charlie Javice sentenced to 7 years in prison for JPMorgan Chase fraud",
      "Frank founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.861,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.761,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Charlie Javice, the founder of the fintech startup Frank, was sentenced to 7 years in prison for defrauding JPMorgan Chase during the company's sale for $175 million in 2021. Javice was arrested in 2023 after the bank accused her of falsely inflating Frank's customer base.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Labels Bishnoi Gang as Terrorist, Seizes Assets",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:17:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The move will enable asset seizures and prosecutions of Bishnoi gang that has been accused of targeting Sikh activists.",
      "Public Safety Minister Gary Anandasangaree announced the designation in a news release Monday, saying it will help Canadian security, intelligence and police agencies.",
      "Canada has listed the Bishnoi gang as a terrorist entity, following calls from Conservative and NDP politicians. The listing bars Canadians from financing or aiding the group led by Lawrence Bishnoi, the gang&#8217;s leader in India, who has reportedly coordinated criminal activities from a cellphon",
      "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimida"
    ],
    "image_url": "",
    "titles": [
      "Canada labels India’s Bishnoi gang as ‘terrorist’ organisation",
      "B.C. government welcomes Canada listing India-based Bishnoi gang as terrorist entity",
      "Canada lists the Bishnoi gang as a terrorist entity",
      "Canada designates Indian gang linked to high-profile killings as terrorist entity"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.797,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada has officially designated the India-based Bishnoi gang as a terrorist entity, led by Lawrence Bishnoi. This action enables Canadian authorities to seize property and freeze accounts associated with the gang. The decision follows advocacy from Conservative and NDP politicians, aiming to prevent Canadians from financially supporting or assisting the group's criminal activities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 01:28:36 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Democrats say there are still \"very large differences\" between the two sides, while Republicans have accused them of  \"not doing the right thing\".",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQNUxnUXRpSVRLdlZPY0gzS3NxeTBqZFBNS1ltY0JIUnJXZ1Btemp5MGZOUXlUVy0wRXAzNGZoUGVPQS15Qy1ZYkJUWHZoaXA5NFNtTmRGNEJfajZJRjRGb191Tlh3c1N5YXE1VDhDRDNPNzhwYVFydmVYRUQzMlhJZmpMX2JmZzVmSmw4S3d1TkYySVk2REZnUDlR?oc=5\" target=\"_blank\">Trump, Democrats le",
      "Top Congressional leaders are at the White House on Monday to meet with President Donald Trump in a last-ditch effort to avert a government shutdown."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4382/live/47d00c30-9d8a-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US shutdown looms after Trump and Democrats end meeting without a deal",
      "Trump, Democrats leave meeting without deal to avoid government shutdown - Axios",
      "WATCH:  Trump to meet with top Democrats as shutdown looms"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.925,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Warns of Shutdown Amid Funding Deal Dispute, Coal Policy Looms",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 18:28:37 -0400",
    "source": "ABC News",
    "sources": [
      "Financial Times",
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com",
      "www.ft.com"
    ],
    "snippets": [
      "After a meeting with congressional leaders at the White House on Monday, Vice President Vance says \"I think we're headed to a shutdown.\"",
      "Democrats have insisted that any short-term funding deal to avoid a shutdown of the U.S. government include an extension of enhanced Obamacare subsidies.",
      "Federal funding set to run out on Wednesday morning unless lawmakers reach agreement"
    ],
    "image_url": "https://s.abcnews.com/images/US/repub-1-ap-gmh-250929_1759179668490_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Vance says 'we're headed to a shutdown'",
      "'We're headed to a shutdown,' Vance says after Trump meeting with leaders ends",
      "Vance warns US government is ‘headed to a shutdown’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.888,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After a meeting with congressional leaders, Vice President Vance indicated a potential government shutdown due to disagreements over a short-term funding deal, particularly Democrats' demand for an extension of enhanced Obamacare subsidies. Federal funding is set to expire on Wednesday unless an agreement is reached. Concurrently, Trump officials plan to announce policies to increase coal output.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Broncos Overwhelm Bengals with 512 Yards in Monday Night Victory",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 23:30:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.cbssports.com",
      "www.nbcsports.com",
      "broncoswire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "SportsLine expert Adam Silverstein has revealed his Cincinnati Bengals vs. Denver Broncos picks for Monday Night Football from Empower Field at Mile High in Denver",
      "Denver piled up 512 yards of offense, including 186 rushing yards, in the blowout.",
      "The Denver Broncos finally have a 100-yard rusher.",
      "The Broncos took care of business on Monday Night Football, running past the Bengals in primetime.",
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxNenJnbmtKNS01Ul93ZnlrNXMzclVSdG1LNXRSNDJWMERVS0tXTXNQdU9jcnBjNE1TNmlZSXprWkZEYW1EbFlQWHViWXBIME0wc1FodG1mOTBBTGEwSjZKMlhFSEdVaDEwUDYxdmJmdVQ0bm83dFpSNDZGVWQwd2JUYnRibWVoMVBlWDRXa3VXbkY4WE93dFNQNjN2RXlWUQ?oc=5\" target=\"_blank\">Bengals vs. B"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/05/7c3bd01e-8d75-4a36-9fcf-34161b2d93b7/courtland-sutton-broncos-imagn.jpg",
    "titles": [
      "Broncos vs. Bengals predictions, odds, time: 2025 NFL Week 5 Monday Night Football pick by expert on 17-2 roll",
      "Monday Night Football: Broncos gain 500 yards, roll to 28-3 win over Bengals",
      "Denver Broncos end incredibly bad streak during 'Monday Night Football' win over Bengals",
      "Broncos run past Bengals in 28-3 win on 'Monday Night Football'",
      "Bengals vs. Broncos: Three Bold Predictions for Week 4 ‘Monday Night Football' - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.907,
      "consensus": 0.829,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Denver Broncos defeated the Cincinnati Bengals in Monday Night Football at Empower Field at Mile High in Denver. Denver's offense amassed 512 yards, including 186 rushing yards, leading to a significant victory. This game also marked the Broncos having a player rush for over 100 yards, contributing to their dominant performance against the Bengals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Bochy to Leave Rangers' Manager Role, Offered Front Office Position",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 01:09:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Texas said Bochy has been offered a front office advisory role",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOc3lVSktUWlY3WmRpQTNHaVRsZUZRTWRQN1c5ekhpeGZLSFNBY0hWSERVMVpUUW9MQkF4SEY5WjdpdFRwYkNwLVB2b05kak9BSkFweXBxODEwbFIxc0pQcFNtWTBJMm5NSGNxdEV5WEJmRHNUajZGV25idG4xaG1wa3E3MHdsdm91RmxweEI3M3hoQQ?oc=5\" target=\"_blank\">Rangers Moving on From Bruce ",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQUnpUT0hEQ1oyZXM5UTZOS3J0ZEFzdDR5b3cyQzZjdV9BazdZUFBMNG8yc2tPVGNKUmhjTlZUcXVHTFlKOHJUb25VdlZINWxyRzZ5eWZVMmcxQThoYXZfenBwM2JrRDlONUNicjBMNFFtU244SVZFaFJxMzBEZjJFRw?oc=5\" target=\"_blank\">‘I’m Following’—Man Utd Manager Target Speaks Out on ",
      "<p>The Texas Rangers announced on Monday that manager Bruce Bochy, who led the team to a World Series in 2023, won&#8217;t return as the team&#8217;s manager in 2026.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/4ddc4248-e3fe-4bea-837b-c9b662a5a7f2/bochy-getty.png",
    "titles": [
      "Bruce Bochy out as Rangers manager after three seasons, 2023 World Series title",
      "Rangers Moving on From Bruce Bochy As Manager After Three Seasons - Sports Illustrated",
      "‘I’m Following’—Man Utd Manager Target Speaks Out on Red Devils Interest - Sports Illustrated",
      "Bruce Bochy won’t return as Rangers manager in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Texas Rangers announced that Bruce Bochy, who managed the team to a World Series win in 2023, will not return as manager in 2026. Instead, Bochy has been offered a front office advisory role with the Rangers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nuno Espirito Santo's West Ham Debut Ends in 1-1 Draw with Everton",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 21:28:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Watch Premier League highlights as new West Ham United manager Nuno Espirito Santo earns a draw at Everton in his first match in charge.",
      "Jarrod Bowen kicks off the Nuno Espirito Santo era in style",
      "<p>Only 20 days after <a href=\"https://www.theguardian.com/football/2025/sep/09/nottingham-forest-part-company-with-head-coach-nuno-espirito-santo\">his sacking by Nottingham Forest</a>, Nuno Espírito Santo was <a href=\"https://www.theguardian.com/football/2025/sep/27/graham-potter-sacked-by-west-ham",
      "FREE TO WATCH: Highlights from Everton&#8217;s match against West Ham in the Premier League."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9dd1/live/62fbb780-9d7a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Bowen earns new West Ham boss Nuno draw at Everton",
      "'The man for West Ham, AGAIN!' | Bowen kicks off the Nuno era in style",
      "Bowen hits back at Everton to secure point for West Ham in Nuno’s first game",
      "Bowen snatches first point for Nuno’s West Ham!"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nuno Espirito Santo began his tenure as West Ham United manager with a 1-1 draw against Everton in his first Premier League match in charge. This comes only 20 days after his departure from Nottingham Forest. In the match at the Hill Dickinson Stadium, Jarrod Bowen scored, marking a promising start under Santo's leadership. Despite the draw, Santo acknowledged that his team has much to learn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Sonnet 4.5 AI, Masters Coding with Business Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "fortune.com"
    ],
    "snippets": [
      "Claude Sonnet 4.5 is better at coding, using computers and meeting practical business needs.",
      "Anthropic’s latest Claude model, Sonnet 4.5, shows gains in coding and autonomous task completion.",
      "Anthropic says its new AI model is robust enough to build production-ready applications, rather than just prototypes."
    ],
    "image_url": "",
    "titles": [
      "Anthropic launches Claude Sonnet 4.5, its latest AI model that's 'more of a colleague'",
      "Anthropic releases Claude Sonnet 4.5, a model it says can build software and accomplish business tasks autonomously",
      "Anthropic launches Claude Sonnet 4.5, its best AI model for coding"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.775,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic introduced Claude Sonnet 4.5, an AI model they claim is the best for coding tasks, emphasizing its practical business applications. It autonomously coded a chat app similar to Slack or Teams, producing 11,000 lines of code in 30 hours. The company highlights the model's capability to create production-ready applications, marking a significant advancement in applied artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India Wins Asia Cup T20 Final; Refuses Trophy from Pakistan Minister",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:18:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "From tournament format to venues and top players to watch, here&#039;s Al Jazeera&#039;s guide to the Women&#039;s Cricket World Cup.",
      "India won the Asia Cup Twenty20 final by five wickets in Dubai on Sunday, but refused to collect the championship trophy from Pakistan's interior minister.",
      "Months after a military conflict, a cricket tournament brought the Indian team three victories over its fiercest rival but few signs of an easing in bitterness."
    ],
    "image_url": "",
    "titles": [
      "ICC Women’s World Cup 2025: Teams, schedule, tickets, India vs Pakistan",
      "Asia Cup 2025: India, Pakistan cricket teams spar",
      "India-Pakistan Tensions Lead to Trophy-Less Cricket Final at Asia Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.764,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "India won the Asia Cup Twenty20 final against Pakistan by five wickets in Dubai. The Indian team controversially refused to collect the championship trophy from Pakistan's interior minister, citing political tensions. This incident occurred after the Indian leader referred to the victory as an extension of 'Operation Sindoor'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Beat Jets 27-21 for Season's First Win, Hill Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 23:43:02 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.espn.com",
      "www.upi.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Dolphins' victory over the Jets came at a cost on Monday night.",
      "Darren Waller had a pair of touchdown catches in his first NFL game in nearly two years, and Tua Tagovailoa threw for 177 yards to lead the Miami Dolphins to their first win of the season, 27-21 over the New York Jets on Monday night.  The Dolphins lost star receiver Tyreek Hill to what appeared to ",
      "Miami Dolphins wide receiver Tyreek Hill had a surprising reaction while he was being carted off the field following his gruesome injury in Week 4. Here's what Miami's star wideout said about that.",
      "Miami Dolphins defenders answered requests for violence, punching and ripping for three New York Jets fumbles Monday en route to their first win of the season.",
      "Miami Dolphins wide receiver Tyreek Hill sustained a dislocated left knee injury and was carted off the field during a win Monday over the New York Jets."
    ],
    "image_url": "",
    "titles": [
      "Dolphins' offense gets going, but Tyreek Hill's knee injury overshadows win over Jets",
      "Dolphins beat Jets 27-21; Tyreek Hill suffers serious knee injury",
      "Miami Dolphins' Tyreek Hill explains odd reaction to suffering gruesome knee injury",
      "Dolphins beat Jets for first win, but lose Hill to ugly knee injury",
      "Miami Dolphins' Tyreek Hill dislocates knee vs. New York Jets"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.631,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Miami Dolphins defeated the New York Jets 27-21, marking their first win of the season. Darren Waller scored two touchdowns, and Tua Tagovailoa threw for 177 yards. However, the victory was marred by a significant injury to star receiver Tyreek Hill, who suffered a dislocated left knee and was carted off the field. The Dolphins' defense was noted for causing three Jets fumbles during the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sirianni Addresses A.J. Brown's Cryptic Tweet Amid Performance Queries",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 22:23:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Eagles coach Nick Sirianni, asked about A.J. Brown's cryptic tweet following Sunday's game, said he believes Brown wants to remain in Philadelphia.",
      "Brown posted a bible verse on social media after a puzzling four-game stretch"
    ],
    "image_url": "",
    "titles": [
      "Sirianni: Brown's desire is to remain with Eagles",
      "Eagles' Nick Sirianni responds to A.J. Brown's cryptic post: 'I question nothing about his desire to be here'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Eagles coach Nick Sirianni addressed concerns about A.J. Brown's cryptic tweet, which followed a perplexing four-game performance. Despite speculation of unhappiness due to his role amid the team's victories, Sirianni believes Brown wants to stay in Philadelphia. The tweet in question featured a bible verse, sparking inquiries about Brown's contentment with the Eagles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US-Proposed Peace Plan for Gaza Gains Support, Uncertainty Remains",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 02:18:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The proposal may shift the focus towards negotiation, but longstanding issues mean achieving peace will be difficult.",
      "<p>The US president has won regional backing, but Hamas’s response and Israel’s intentions leave the outcome in doubt</p><p>At first glance, the 20-point plan outlined by President Trump and agreed by Benjamin Netanyahu appears more likely to end the two-year conflict in Gaza than anything we have s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed3e/live/8f22f550-9d9b-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump's Gaza plan is a significant step - but faces fundamental obstacles",
      "Trump’s plan for Gaza is ambitious but peace is far from guaranteed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Palestinian Authority and regional leaders have endorsed a 20-point peace plan proposed by US President Trump to end the two-year conflict in Gaza. The plan, supported by Benjamin Netanyahu, aims to bring peace, but the responses from Hamas and the intentions of Israel remain uncertain, casting doubt on the plan's effectiveness.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Broncos Beat Bengals 28-3 on MNF, Ending Losing Streak",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 03:41:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Denver Broncos were nearly perfect against the Cincinnati Bengals on 'Monday Night Football'.",
      "<p>Bo Nix threw for two touchdowns and ran for another to atone for his end zone interception and the Denver Broncos snapped a two-game skid by sending the Cincinnati Bengals to their second straight blowout loss, 28-3 Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Denver Broncos have five winners and no losers in huge win over Bengals",
      "Broncos bounce back with dominant win over Bengals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Denver Broncos defeated the Cincinnati Bengals 28-3 on 'Monday Night Football', breaking their two-game losing streak. Bo Nix contributed significantly by throwing for two touchdowns and running for another, despite an end zone interception. This victory sent the Bengals to their second consecutive blowout loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 4: Updated Power Rankings for All 32 Teams Released",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 03:22:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "news.google.com"
    ],
    "snippets": [
      "How do all 32 teams in the NFL stack up against each other coming out of Week 4 of the 2025 NFL regular season? Here's an updated look from best to worst.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeDlvc3BTUmtjOEtWSGpCaVNoaFRGS1RRUmlJRkY2dmVsSE9mSHRxMEdWS2VaME1HTWNlcGFpQjdLTXFsRVN6R2I3NHZpZUQ0SmRYQUR4cktVcVhLOXU3eGo0MEZ0dXBscGFFZGY2X1BsYzNyZ1Bhb29ZTFJMeU9Sbm93eWh4WDd0?oc=5\" target=\"_blank\">B/R Experts Week 5 NFL Power Rankings</a>&n"
    ],
    "image_url": "",
    "titles": [
      "NFL power rankings: Rams, Steelers and Chiefs bump up; Ravens, 49ers fade for Week 5",
      "B/R Experts Week 5 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 4 of the 2025 NFL season has concluded, and updated power rankings for all 32 teams have been released. This ranking sorts the teams from best to worst based on their performance up to this point in the season. For detailed rankings and analysis, refer to the provided link.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China's Manufacturing Shrinks for 6th Month, PMI Shows Slight Improvement",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 02:22:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "While still in contraction, China's latest PMI reading in September was the strongest since March.",
      "HONG KONG (AP) &#8212; China&#8217;s factory activity shrank for a sixth straight month in September, the longest slump since 2019, an official report said Tuesday. The official manufacturing purchasing managers index, or PMI, improved to 49.8 from 49.4 in August. But it remained below the 50-cutoff"
    ],
    "image_url": "",
    "titles": [
      "Asia-Pacific markets trade mixed as China manufacturing contracts for a sixth straight month",
      "China’s factory activity contracts for a 6th straight month as trade tensions weigh on the economy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In September, China's manufacturing sector contracted for the sixth consecutive month, marking its longest decline since 2019. However, the official purchasing managers index (PMI) increased slightly to 49.8 from 49.4 in August, indicating the strongest factory activity since March but still below the growth threshold of 50.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labour Unveils Tax Strategy, Albanese Endorses Gaza Peace Plan Excluding Hamas",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 01:17:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Labour's tax positions over the forthcoming Budget and a 20-point Gaza peace plan lead the papers.",
      "<p>Anthony Albanese welcomes commitment to denying Hamas a role in any future governance of Gaza, and urges Hamas to agree to the terms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussa"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d92f/live/a0cd5550-9d93-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "The Papers: Labour 'opens door' to tax rise and Trump's Gaza peace plan",
      "‘There is hope’: Australia welcomes Trump’s 20-point peace plan for Gaza"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Labour's tax strategies for the upcoming Budget and a 20-point Gaza peace plan are highlighted in recent news. Anthony Albanese has endorsed the exclusion of Hamas from future governance in Gaza and calls for Hamas to accept the peace terms.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-UK PM's Role in Palestinian Affairs Stirs Labour Party Disbelief",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 23:11:19 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Some in former UK prime minister’s Labour party react with incredulity at his proposed role in Palestinian territory",
      "For the former British prime minister, the Middle East is one of the most consistent, if contentious, chapters in a busy post-Downing Street career."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F793653da-53aa-450f-83fa-648667c9244b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Tony Blair set to serve on Trump’s ‘Board of Peace’ for Gaza",
      "Tony Blair Emerges as Potential Figure in Postwar Gaza"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.882,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A former UK Prime Minister's potential involvement in Palestinian territory has elicited disbelief among some members of his Labour Party. This development is part of his ongoing engagement with Middle Eastern affairs, which has been a significant yet controversial aspect of his career after leaving office.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Police Seize £5bn in Largest Crypto Fraud, Woman Pleads Guilty",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 02:55:36 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "UK police seized cryptocurrency worth more than £5bn after a seven-year probe into a global money laundering web.",
      "<p>Zhimin Qian pleads guilty after wallets with 61,000 bitcoins, currently worth over £5bn, seized from north London home</p><p>A woman has been convicted for her role in a multibillion-pound bitcoin fraud after what is thought to have been the world’s largest cryptocurrency seizure.</p><p>Zhimin Qi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/88d1/live/d2427980-9da2-11f0-ae8d-8fb47de53624.png",
    "titles": [
      "Chinese woman convicted after 'world's biggest' bitcoin seizure",
      "Woman admits UK bitcoin fraud charges after ‘world’s largest’ crypto seizure"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UK police concluded a seven-year investigation into a global money laundering scheme, seizing cryptocurrency worth over £5bn. Zhimin Qian pleaded guilty to her role in this fraud, involving 61,000 bitcoins, following the seizure from her north London home. This operation is considered the world's largest cryptocurrency seizure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Enacts AI Transparency Law, Mandates Safety Disclosures",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 00:02:11 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1ETDZIR1NSbnh6aGFSclI0b0d0cENGOWFscDQ0RWRSR01yZ1c4Y0tGdkN6UVU2M0lhX3l4c0JBMlJmMFI2WTFsMElDcVQ3STQ2X0pfcG41bEh6TmhzZ0haVC1yTGpmUVBGQXJKcXhsdksxcjlRcWU2Ry1n?oc=5\" target=\"_blank\">Newsom signs major California AI bill</a>&nbsp;&nbsp;<font colo",
      "SB 53 requires large AI labs – including OpenAI, Anthropic, Meta, and Google DeepMind – to be transparent about safety protocols. It also ensures whistleblower protections for employees at those companies."
    ],
    "image_url": "",
    "titles": [
      "Newsom signs major California AI bill - Axios",
      "California Governor Newsom signs landmark AI safety bill SB 53"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.898,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California Governor Gavin Newsom signed Senate Bill 53, the \"Transparency in Frontier Artificial Intelligence Act,\" into law. Authored by Sen. Scott Wiener, the legislation mandates large AI labs like OpenAI, Anthropic, Meta, and Google DeepMind to disclose their safety protocols and provides whistleblower protections for their employees. This landmark bill aims to increase transparency in the AI industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nicole Kidman and Keith Urban Separate After Nearly 20 Years",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 00:38:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The A-List couple share two children and have been married since 2006.",
      "<p>Australian actor and her musician husband have reportedly separated after two decades together</p><p>Nicole Kidman and Keith Urban have separated after almost 20 years of marriage.</p><p>Variety <a href=\"https://variety.com/2025/film/news/nicole-kidman-keith-urban-separated-1236534501/\">confirmed"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e35d/live/18a45a70-9d89-11f0-b732-8db235f47798.jpg",
    "titles": [
      "Nicole Kidman and Keith Urban separate after almost 20 years",
      "Nicole Kidman and Keith Urban split after 19 years"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.909,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nicole Kidman and Keith Urban, an Australian actor and musician couple married since 2006 and parents to two children, have separated after nearly 20 years together, as confirmed by Variety.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic's Claude Model Outshines OpenAI, Google in Coding Tests",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:31:25 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SMkpRU0ZzVks1d2Vrd0xqeTFSYTZoakwxSWlkV0JkRzl6c1owZ2k0cTVnYzQyTUxLV3Z0dHNiLWNfQV9iYkswX1A1U0pqbm8ydmpyRnF0Y2RuRWhfSGhOQUZWaG43QlljTmx2eFdrRzdNQzRjQXVYcg?oc=5\" target=\"_blank\">Anthropic's latest Claude model can work for 30 hours on its own<",
      "Latest Claude model beats OpenAI and Google on coding tests."
    ],
    "image_url": "",
    "titles": [
      "Anthropic's latest Claude model can work for 30 hours on its own - Axios",
      "Anthropic says its new AI model “maintained focus” for 30 hours on multistep tasks"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic has developed the latest Claude model, outperforming OpenAI and Google on coding tests. The model can operate autonomously for 30 hours. This advancement showcases the model's capabilities in the field of artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Volunteer Apps Close Tonight; Baiju Bhatt to Speak",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "If you’ve been thinking about applying to volunteer at TechCrunch Disrupt 2025, this is it — applications close tonight at 11:59 p.m. PT. Only accepting local Bay Area applicants.",
      "Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, shares insights on building transformative companies in fintech and aerospace at TechCrunch Disrupt 2025."
    ],
    "image_url": "",
    "titles": [
      "Final day to apply: Volunteer at TechCrunch Disrupt 2025",
      "From Robinhood to Aetherflux: Baiju Bhatt’s next frontier at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.759,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Applications for volunteering at TechCrunch Disrupt 2025 close tonight at 11:59 p.m. PT, and only local Bay Area applicants are eligible. In related news, Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, will speak at the event, sharing insights on creating transformative companies in fintech and aerospace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]