[
  {
    "title": "Marco Rubio says US will begin revoking visas of Chinese students",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:55:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "snippets": [
      "The US will also &#039;enhance scrutiny of all future visa applications&#039; from China and Hong Kong, the State Department said."
    ],
    "image_url": "",
    "titles": [
      "Marco Rubio says US will begin revoking visas of Chinese students"
    ],
    "summary": "The US State Department announced it will increase scrutiny on all future visa applications from China and Hong Kong. This measure aims to enhance the evaluation process for individuals seeking to enter the United States from these locations.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about new visa policies for Chinese and Hong Kong students. It does not provide solutions or progress, but it does increase awareness about the changing immigration policies.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.887,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.532,
    "normalized_score": 6.43
  },
  {
    "title": "Trump laments size of ‘much too big’ airplane gifted by Qatar",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:40:20 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>The Boeing 747-8, a present from the Gulf state, is more than 18ft longer than the current Air Force One</p><p>Donald Trump’s big, beautiful new plane from the government of Qatar has arrived – but the US president says it’s too big to be his personal perk.</p><p>The problem for the US president is not the smack of impropriety that comes with <a href=\"https://www.theguardian.com/us-news/2025/may/21/trump-qatar-plane\">accepting</a> a luxury 747 jumbo jet from the Gulf state and intended as a replacement Air Force One – Trump has already brushed off any criticism on that front.</p> <a href=\"https://www.theguardian.com/us-news/2025/may/28/trump-qatar-plane-gift-boeing\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7f5e8bc12ed6a0482d460cfc3933e3f4bcc63854/543_0_5130_4104/master/5130.jpg?width=140&quality=85&auto=format&fit=max&s=baf42c74463b3aece3bf0664307c0c2d",
    "titles": [
      "Trump laments size of ‘much too big’ airplane gifted by Qatar"
    ],
    "summary": "The government of Qatar gifted Donald Trump a Boeing 747-8, intended as a replacement for Air Force One. This new plane is over 18 feet longer than the current Air Force One. However, Trump has stated that the plane is too large to serve as his personal aircraft. Despite potential concerns over the appropriateness of accepting such a luxurious gift from a foreign state, Trump has dismissed any criticisms related to the issue.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a gift received by Trump, but it lacks depth or insight. It does not provide actionable insights for the reader, nor does it report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.507,
    "normalized_score": 3.88
  },
  {
    "title": "'Diddy' trial day 15 recap: Judge denies motion for a mistrial over arson dispute",
    "domain": "general",
    "location": "national",
    "published": "Wed, 28 May 2025 23:39:44 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "Sean \"Diddy\" Combs trial day 15 recap: Judge denies motion for a mistrial over arson dispute."
    ],
    "image_url": "https://s.abcnews.com/images/US/combs-trial-sketch-03-rt-jef-250528_1748448299027_hpMain_4x3t_384.jpg",
    "titles": [
      "'Diddy' trial day 15 recap: Judge denies motion for a mistrial over arson dispute"
    ],
    "summary": "On the 15th day of Sean \"Diddy\" Combs' trial, the judge rejected a motion for a mistrial that was filed in relation to a dispute over arson charges. This decision means the trial will continue without being declared invalid or starting over.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing trial of Sean 'Diddy' Combs, but it lacks depth or insight. It does not provide actionable insights for the reader, nor does it report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.938,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.527,
    "normalized_score": 5.92
  },
  {
    "title": "Trump's battle on international students explained... in 70 seconds",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:38:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The BBC's Nomia Iqbal spoke to students at Harvard University, which is the target of funding cuts and a ban on international student enrollment."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7e63/live/c1881ed0-3c02-11f0-b6e6-4ddb91039da1.jpg",
    "titles": [
      "Trump's battle on international students explained... in 70 seconds"
    ],
    "summary": "BBC's Nomia Iqbal reported on reactions from Harvard University students regarding proposed funding cuts and a ban on international student enrollment. The university, known for its prestigious academic programs, faces challenges that could impact its diversity and financial stability. The current status of these proposals and their implications for Harvard's future were the focus of the discussion.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the potential impacts of funding cuts and a ban on international student enrollment at Harvard University. However, it doesn't offer solutions or highlight progress, and the depth of understanding it provides is somewhat limited due to its short length.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.546,
    "normalized_score": 7.86
  },
  {
    "title": "Rosenberg: What a new Stalin statue says about Russia's attempt to reshape history",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:26:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "A brand new statue of the Soviet dictator Josef Stalin has been unveiled at a Metro station in Moscow."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7ff5/live/eb10b3c0-3c61-11f0-aa24-d1c64c46ace6.jpg",
    "titles": [
      "Rosenberg: What a new Stalin statue says about Russia's attempt to reshape history"
    ],
    "summary": "A new statue of Josef Stalin has been unveiled at a Moscow Metro station, marking a notable addition to the city's public monuments. This event reflects a significant moment in the ongoing discourse around Stalin's legacy in Russia.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of Russia's attempt to reshape history through public monuments, but it lacks in-depth analysis or insight into the implications of this action. It does not highlight progress or provide actionable insights.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.88,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.51,
    "normalized_score": 4.18
  },
  {
    "title": "Papers: Arsenal eye move for former Man City star Sane",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 28 May 2025 23:55:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "The top stories and transfer rumours from Thursday's newspapers..."
    ],
    "image_url": "https://e1.365dm.com/25/03/1920x1080/skysports-paper-talk-brand-refresh_6852897.jpg?20250311094415",
    "titles": [
      "Papers: Arsenal eye move for former Man City star Sane"
    ],
    "summary": "Today's newspapers are filled with the latest top stories and transfer rumors, highlighting the ongoing discussions and potential moves within the sports world. The coverage includes updates on key players, potential transfers, and speculations surrounding future team compositions. While specific details and outcomes of these rumors are yet to be confirmed, the news reflects the dynamic nature of sports team management and player negotiations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of the potential transfer of a player, it does not provide in-depth analysis, solutions, or progress. The story is mainly speculative and does not provide actionable insights or empower the reader with knowledge.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.886,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.2
  },
  {
    "title": "2025 Memorial Tournament picks, odds, field: Surprising predictions by golf model that's nailed 15 majors",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 23:49:26 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "SportsLine's model simulated the 2025 Memorial Tournament 10,000 times and revealed its PGA Tour golf picks for Scottie Scheffler, Xander Schauffele, and more"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/28/04058adf-170b-456f-8695-408144c191c2/tommy-fleetwood-golf-pga-getty-images.jpg",
    "titles": [
      "2025 Memorial Tournament picks, odds, field: Surprising predictions by golf model that's nailed 15 majors"
    ],
    "summary": "SportsLine's model, after simulating the 2025 Memorial Tournament 10,000 times, has released its PGA Tour golf picks, including predictions for players like Scottie Scheffler and Xander Schauffele. This extensive simulation aims to forecast the outcomes for these athletes and others in the tournament.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for golf enthusiasts and bettors, offering predictions based on extensive simulations. However, it doesn't provide deeper insights into the sport or the athletes, nor does it report on progress or improvements.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.885,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.509,
    "normalized_score": 4.08
  },
  {
    "title": "Maresca: Conference League win can be start of something important",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 28 May 2025 23:42:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Enzo Maresca put Chelsea's slow start in their ultimately victorious Conference League final down to the mental efforts his side had put into securing Champions League football 72 hours earlier."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-enzo-maresca-chelsea_6929966.jpg?20250528225429",
    "titles": [
      "Maresca: Conference League win can be start of something important"
    ],
    "summary": "Enzo Maresca attributed Chelsea's initial sluggish performance in the Conference League final to the team's mental exertion from securing a Champions League spot just 72 hours prior. Despite the slow start, Chelsea emerged victorious in the final.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides a good level of insight into the team's performance and the potential impact of their win. However, it doesn't delve into solutions, improvements, or innovations in the team's strategy or training.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.51,
    "normalized_score": 4.18
  },
  {
    "title": "Panthers move on to Cup Final: Grades, takeaways for both teams",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 23:38:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Though the Canes mounted a strong challenge, the Panthers are Eastern Conference champs again."
    ],
    "image_url": "",
    "titles": [
      "Panthers move on to Cup Final: Grades, takeaways for both teams"
    ],
    "summary": "The Panthers have secured the title of Eastern Conference champions, overcoming a strong challenge from the Canes. This marks their latest achievement in the competition.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of the outcome of the match and the Panthers' progress in the competition. However, it lacks depth or insight into the teams' strategies, performance, or the implications of the result.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.49,
    "normalized_score": 2.14
  },
  {
    "title": "Fantasy Baseball Bullpen Report: Camilo Doval returns to closer role; Robert Garcia, Daniel Palencia get shot",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 23:24:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Meanwhile, Mason Miller and Jeff Hoffman have fallen on hard times"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/28/0088eb69-10f1-4254-8f86-99e5bd6ca08b/robert-garcia.jpg",
    "titles": [
      "Fantasy Baseball Bullpen Report: Camilo Doval returns to closer role; Robert Garcia, Daniel Palencia get shot"
    ],
    "summary": "Mason Miller and Jeff Hoffman have recently experienced significant difficulties, indicating a downturn in their current circumstances. The specific nature of their challenges or the consequences of these hard times was not detailed in the available information.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the changes in the roles of baseball players, but it lacks depth or insight into the reasons for these changes or the potential impacts on the team or the sport.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.879,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.469,
    "normalized_score": 0.0
  },
  {
    "title": "Credit default swaps are back in fashion — even if the panic might be overblown",
    "domain": "business",
    "location": "national",
    "published": "Wed, 28 May 2025 23:49:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The cost of insuring exposure to U.S. government debt has been rising steadily this year, hovering near its highest level in two years."
    ],
    "image_url": "",
    "titles": [
      "Credit default swaps are back in fashion — even if the panic might be overblown"
    ],
    "summary": "The cost of insuring against the risk of the U.S. government defaulting on its debt has been increasing throughout the year, reaching levels close to the highest seen in the past two years.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the increasing cost of insuring against the risk of the U.S. government defaulting on its debt. However, it doesn't provide solutions or improvements, nor does it give a clear understanding of the causes or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.885,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.521,
    "normalized_score": 5.31
  },
  {
    "title": "‘King Of Drag’ Becomes The First Reality Show Centered On Drag Kings",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 23:48:09 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "For the first time TV history, a show with an exciting new premise titled ‘King of Drag,’ will showcase drag kings exclusively in a reality competition show."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6837d864bc97b1f61daa6db5/0x0.jpg?width=960&precrop=1991%2C1119%2Cx0%2Cy87",
    "titles": [
      "‘King Of Drag’ Becomes The First Reality Show Centered On Drag Kings"
    ],
    "summary": "For the first time in TV history, a reality competition show titled 'King of Drag' will exclusively feature drag kings. This groundbreaking show introduces a new premise to television, focusing on the talents and performances of drag kings in a competitive format.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides awareness about a new reality show that focuses on drag kings, a group that may not be widely known or understood. It contributes to the reader's understanding of the evolving landscape of reality TV and the representation of diverse identities, but it doesn't provide actionable insights or report on solutions to specific problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.94,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.558,
    "normalized_score": 9.08
  },
  {
    "title": "‘RuPaul’s Drag Race’ Doesn’t Need A Rainbow Logo To Celebrate Pride",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 23:43:30 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "Since its debut in 2009 on Logo TV, Drag Race has been unapologetic in its showcase of the LGBT+ community where other shows and platforms might struggle."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6837d75d9f111cad62c8673e/0x0.jpg?width=960",
    "titles": [
      "‘RuPaul’s Drag Race’ Doesn’t Need A Rainbow Logo To Celebrate Pride"
    ],
    "summary": "Since its launch in 2009 on Logo TV, Drag Race has consistently highlighted the LGBT+ community, setting a precedent for representation where other shows and platforms have often faltered.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the representation of the LGBT+ community in media, specifically through the show 'RuPaul's Drag Race'. However, it doesn't offer actionable insights or report on solutions to any problems.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.545,
    "normalized_score": 7.76
  },
  {
    "title": "How Jinkx Monsoon Redefines Broadway On Her Own Terms",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 23:35:58 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "While drag queens have been featured on Broadway for years, but Jinkx Monsoon marked the first time that a drag queen was ever considered in a gendered acting category."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6837d4e0be83379bd3da325a/0x0.jpg?width=960",
    "titles": [
      "How Jinkx Monsoon Redefines Broadway On Her Own Terms"
    ],
    "summary": "Jinkx Monsoon became the first drag queen to be considered for a gendered acting category on Broadway, marking a historic moment in the industry. This recognition highlights a significant milestone for drag performers on Broadway, where drag queens have been featured for years but never in this specific context.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and innovation in the Broadway industry, with Jinkx Monsoon becoming the first drag queen to be considered for a gendered acting category. It provides empowering knowledge about the evolving representation of drag performers.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.938,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.567,
    "normalized_score": 10.0
  },
  {
    "title": "Trio Of Haliburton, Siakam, Mathurin Meet Moment For Pacers Trio Of Ws",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 23:28:39 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "The Indiana Pacers needed to respond after a Game 3 loss against the New York Knicks. Tyrese Haliburton, Bennedict Mathurin, and Pascal Siakam met the moment."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6836b4aa0bee2c809391056c/0x0.jpg?width=960&precrop=3335%2C1874%2Cx0%2Cy50",
    "titles": [
      "Trio Of Haliburton, Siakam, Mathurin Meet Moment For Pacers Trio Of Ws"
    ],
    "summary": "In response to a Game 3 loss, the Indiana Pacers bounced back against the New York Knicks, led by standout performances from Tyrese Haliburton, Bennedict Mathurin, and Pascal Siakam. Their collective effort contributed significantly to the team's recovery and success in the subsequent game.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Indiana Pacers' recovery from a loss, highlighting the key players' contributions. However, it doesn't offer deeper insights into the team's strategies or the broader trends in the sport.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.936,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.536,
    "normalized_score": 6.84
  },
  {
    "title": "This Common Oral Bacterium Can Invade Your Heart",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:54:26 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-common-oral-bacterium-can-invade-your-heart/\" rel=\"nofollow\" title=\"This Common Oral Bacterium Can Invade Your Heart\"><img alt=\"Dental Teeth Mouth Bacteria and Viruses\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Dental-Teeth-Mouth-Bacteria-and-Viruses-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Gum disease bacteria can reach the heart, causing damage that raises AFib risk. Good oral hygiene may help protect heart health. Tempted to skip flossing? It might not be worth the risk. A new study from Hiroshima University (HU) has found that the gum disease bacterium Porphyromonas gingivalis (P. gingivalis) can enter the bloodstream and [...]"
    ],
    "image_url": "",
    "titles": [
      "This Common Oral Bacterium Can Invade Your Heart"
    ],
    "summary": "A study from Hiroshima University discovered that the bacterium Porphyromonas gingivalis, associated with gum disease, can enter the bloodstream and potentially increase the risk of atrial fibrillation (AFib) by causing heart damage. This research highlights the importance of maintaining good oral hygiene to protect heart health.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the potential health risks of poor oral hygiene, thereby contributing to a deeper understanding of the connection between oral health and heart disease. However, it does not highlight any solutions or improvements to this issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.859,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.533,
    "normalized_score": 6.53
  },
  {
    "title": "USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:29:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/usc-scientists-unveil-5-in-1-blood-test-for-early-alzheimers-detection/\" rel=\"nofollow\" title=\"USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection\"><img alt=\"Science Lab Blood Red Liquid Test Tubes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Science-Lab-Blood-Red-Liquid-Test-Tubes-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>In a proof-of-concept study, the test successfully identified five critical biomarkers associated with Alzheimer’s disease, exceeding the capabilities of currently available commercial blood tests. Researchers at the Keck School of Medicine of USC have created a&#160; new blood test that could make it easier to detect Alzheimer’s disease early. This innovative tool, called the Penta-Plex [...]"
    ],
    "image_url": "",
    "titles": [
      "USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection"
    ],
    "summary": "Researchers at the Keck School of Medicine of USC have developed a new blood test, named the Penta-Plex, capable of identifying five critical biomarkers for Alzheimer's disease. This proof-of-concept study demonstrates the test's potential to surpass existing commercial blood tests in early detection of the disease, making it a significant advancement in Alzheimer's research and diagnosis.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It reports on a significant innovation in Alzheimer's research and diagnosis, providing readers with actionable insights and a deeper understanding of the progress being made in this field. It also increases awareness about the potential of early detection in managing Alzheimer's disease.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.853,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.551,
    "normalized_score": 8.37
  },
  {
    "title": "Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:04:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/brain-reset-one-molecular-switch-could-silence-alzheimers-and-parkinsons/\" rel=\"nofollow\" title=\"Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s\"><img alt=\"Brain Switch On\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Brain-Switch-On-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A scientist has discovered a biochemical &#8220;master switch&#8221; that connects and potentially cures Alzheimer&#8217;s and Parkinson’s. His theory may revolutionize brain disease treatment and sustainable medicine. At the upcoming Sustainability Through Science and Technology Summit 2025 (SIPS 2025), Nobel Laureate Prof. Aaron Ciechanover will be honored in a special event taking place in Cebu, Philippines, [...]"
    ],
    "image_url": "",
    "titles": [
      "Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s"
    ],
    "summary": "A scientist has discovered a biochemical \"master switch\" that may link and treat Alzheimer's and Parkinson's diseases. This breakthrough could transform the treatment of brain diseases and advance sustainable medicine. Nobel Laureate Prof. Aaron Ciechanover will be recognized for this discovery at the Sustainability Through Science and Technology Summit 2025 (SIPS 2025) in Cebu, Philippines.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It reports on a groundbreaking discovery that could significantly advance the treatment of Alzheimer's and Parkinson's diseases. This story provides readers with empowering knowledge about the progress being made in the field of brain disease treatment and sustainable medicine.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.847,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.558,
    "normalized_score": 9.08
  },
  {
    "title": "We’re about to unlock the secrets of ancient human brains",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 20:00:42 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "For the first time, we have a method for extracting proteins from preserved soft tissues like brains – which could be a treasure trove of evolutionary information"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/27133011/SEI_253312812.jpg",
    "titles": [
      "We’re about to unlock the secrets of ancient human brains"
    ],
    "summary": "Scientists have developed a novel method to extract proteins from preserved soft tissues, including brains, for the first time. This breakthrough could unlock valuable evolutionary information, providing new insights into the history of life on Earth.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it reports on a scientific innovation that could potentially provide readers with a deeper understanding of human evolution and the history of life on Earth. It highlights progress in the field of paleontology and could empower readers with knowledge about our ancient ancestors.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.818,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.539,
    "normalized_score": 7.14
  },
  {
    "title": "Massive glacier collapse triggers landslide that buries Swiss village",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 19:08:04 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Villagers in Blatten, Switzerland, were evacuated earlier this month after authorities warned a nearby glacier was on the brink of collapse – one of many becoming less stable as global temperature rise"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/28180039/SEI_253445449.jpg",
    "titles": [
      "Massive glacier collapse triggers landslide that buries Swiss village"
    ],
    "summary": "Residents of Blatten, Switzerland, were evacuated earlier this month due to the imminent threat of a nearby glacier collapsing. This incident highlights the increasing instability of glaciers worldwide, attributed to the rise in global temperatures.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "While this story reports on a negative event, it still provides useful context about the impacts of global warming, thus increasing awareness about climate change and its consequences. However, it does not provide any solutions or actionable insights for the reader, limiting its constructive score.",
    "score_components": {
      "magnitude": 0.439,
      "recency": 0.806,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.527,
    "normalized_score": 5.92
  }
]