[
  {
    "title": "Cleveland Guardians Clinch Playoff Spot After Historic Comeback",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 23:07:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Guardians clinched a playoff berth Saturday night after CJ Kayfus was hit by a pitch with the bases loaded in the ninth inning.",
      "For the seventh time in 10 seasons, Cleveland heads to the postseason",
      "Guardians manager Stephen Vogt said in the midst of Cleveland's 10-game losing streak in early July that there was light at the end of the tunnel and things would turn around.  Vogt ended up selling his team a little short, as the Guardians made one of the biggest turnarounds in baseball history.  C",
      "<p>It took 161 games, but we finally know the six teams that will battle it out in the American League playoffs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Guardians clinch playoff berth on walk-off HBP",
      "Guardians clinch MLB playoff spot on walk-off hit-by-pitch in pursuit of AL Central, record-breaking comeback",
      "Guardians clinch postseason spot with walk-off hit by pitch, complete historic turnaround",
      "Guardians walk off Rangers on HBP to become final AL playoff team to clinch"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.978,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.81,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cleveland Guardians secured a playoff spot for the seventh time in ten seasons after a win clinched by CJ Kayfus getting hit by a pitch with bases loaded in the ninth inning. This achievement comes after a significant mid-season turnaround, overcoming a 10-game losing streak in July. The Guardians' entry into the postseason was confirmed in their 161st game, marking one of the biggest comebacks in baseball history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Orders Troops to Portland to Guard Immigration Sites",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:12:33 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Axios",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "President Trump is authorizing the deployment of troops to \"protect\" Portland and ICE facilities there from \"domestic terrorists\" as he expands his controversial deployments to more U.S. cities.",
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local offic"
    ],
    "image_url": "",
    "titles": [
      "Trump says he will send troops to Portland to deal with 'domestic terrorists'",
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Donald Trump says he is deploying troops to Portland, Oregon"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.763,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The president has directed troops to Portland with a \"full force\" directive, stating it is necessary to protect immigration detention facilities from what he terms \"domestic terrorists.\" This action is part of a broader initiative to address security concerns at these facilities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx Face Elimination in WNBA Semis Without Coach, Injured Star Collier",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 20:21:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Lynx will be without their head coach and star player when they face elimination Sunday as Napheesa Collier has been ruled out with an ankle injury.",
      "The top-seeded Lynx will be without their best player and head coach as they try to keep their season alive",
      "<p>Minnesota Lynx star Napheesa Collier will miss Game 4 of the WNBA semifinal series against Phoenix on Sunday, two days after injuring her left ankle late in Game 3.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lynx rule out star Collier for must-win Game 4",
      "Napheesa Collier injury: Lynx star ruled out of Game 4 with left foot injury suffered late in heated Game 3",
      "Lynx star Napheesa Collier out for Game 4 vs. Mercury due to ankle injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Minnesota Lynx face elimination in Game 4 of the WNBA semifinals against Phoenix without their head coach and star player, Napheesa Collier, who has been ruled out due to an ankle injury sustained in Game 3.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Nears Ryder Cup Victory with Record Lead Over US",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 18:53:55 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Europe is on the verge of retaining the Ryder Cup after a dominant Saturday left it just 2.5 points from victory over the United States at Bethpage Black.",
      "<ul><li><p>Europe maintain dominance as insults fly from crowd</p></li><li><p>Rory McIlroy calls abuse ‘really, really challenging’</p></li></ul><p>Quite incredibly, this managed to be an even uglier day for the United States of America off the golf course than it was on it. Never in his wildest of ",
      "<p>On an &#8220;intense&#8217; Day 2 at the Ryder Cup, Rory McIlroy helped lead the European side to an 11.5-4.5 advantage. </p>\n<p>And if history tells us anything, that’s an insurmountable lead.</p>"
    ],
    "image_url": "",
    "titles": [
      "Europe holds historic lead, on brink of Ryder Cup",
      "Europe seize high ground and 11½-4½ lead over USA into Ryder Cup singles",
      "McIlroy helps Europe take commanding lead after ‘intense’ Day 2 at Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Europe is on the verge of retaining the Ryder Cup after taking a record seven-point lead over the United States at Bethpage Black, despite facing a barrage of insults from the crowd. Rory McIlroy described the abuse as \"really, really challenging.\" Europe needs just 2.5 points to secure victory, following a dominant performance on Saturday. President Donald Trump did not attend the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 12:11:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "financialpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Unidentified drones seen at several places, including the biggest army base, after a slew of earlier sightings.",
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "In neighboring Germany, several drones were reported in the northern German state of Schleswig-Holstein, which borders Denmark, from Thursday into Friday night.",
      "BERLIN (AP) &#8212; The Danish defense ministry said Saturday that &#8220;drones have been observed at several of Danish defense facilities.&#8221; The new drone sightings overnight Friday into Saturday come after there were several drone sightings in the Nordic country earlier this week, with some "
    ],
    "image_url": "",
    "titles": [
      "Denmark reports new drone sightings overnight at military sites",
      "Denmark: New drone sightings over military infrastructure",
      "Denmark reports drone sightings at military facilities as NATO warns Russia about violating airspace",
      "Denmark reports new drone sightings at military facilities"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.717,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McIlroy, Lowry Endure Fan Abuse, Lead Europe to Ryder Cup Victory",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 01:23:32 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After facing abuse from American fans which \"crossed the line\", Rory McIlroy and Shane Lowry lead Europe towards a rare Ryder Cup away win.",
      "After facing abuse from American fans which &quot;crossed the line&quot;, Rory McIlroy and Shane Lowry lead Europe towards a rare Ryder Cup away win.",
      "<p>Rory McIlroy backed away from the ball, turned around and told a group of heckling fans to sShut the (expletive) up!” Then, he stepped up to his shot and did the work himself.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/509b/live/d25f81e0-9bf6-11f0-be96-85c61452c8b2.jpg",
    "titles": [
      "Europeans silence jeering US crowd with famous Ryder Cup display",
      "McIlroy & Lowry silence New York crowd on famous European day",
      "Fiery Rory McIlroy colourfully tells New York crowd to shut up"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rory McIlroy and Shane Lowry faced abuse from American fans during the Ryder Cup, with incidents crossing the line of sportsmanship. Despite the hostile environment, they led Europe towards a rare away victory. McIlroy notably confronted hecklers directly, demanding silence before taking his shot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lavrov: Russia Won't Attack Europe but Will Respond to Aggression",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:37:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The Russian foreign minister made the comment in an address to the United Nations General Assembly on Saturday.",
      "Russian Foreign Minister Sergey Lavrov spoke at the U.N. General Assembly after weeks in which unauthorized flights into NATO’s airspace have raised alarm around Europe.",
      "UNITED NATIONS (AP) — As new tensions rise between Russia and NATO powers, Moscow&#8217;s top diplomat insisted to world leaders Saturday that his nation doesn&#8217;t intend to attack Europe but will mount a “decisive response” to any aggression. At the same time, Foreign Minister Sergey Lavrov too"
    ],
    "image_url": "",
    "titles": [
      "Russia will give ‘decisive response’ if provoked by West, says Lavrov",
      "Russia warns of ‘decisive response’ to any act of aggression against it",
      "Russia tells UN: No intent to attack Europe, but aggression will get a ‘decisive response’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.819,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly, Russian Foreign Minister Sergey Lavrov stated Russia does not plan to attack Europe but will respond decisively to any aggression. This comes amid rising tensions and unauthorized flights into NATO airspace, raising concerns across Europe.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Backs £1.5bn Loan for JLR to Recover from Cyber-Attack, Restart Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 21:00:13 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ministers hope the loan, from a commercial bank and underwritten by the government, will give certainty to suppliers.",
      "Government says guarantee from UK Export Finance will protect the automotive supply chain",
      "<p>Britain’s largest automotive employer plans to restart engine manufacturing in early October, report says</p><p>The government has said it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) as the carmaker battles the consequences of a recent cyber-attack.</p><p>JLR had to suspend"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1505/live/303c0ab0-9be6-11f0-bddd-5f1abb8b5445.jpg",
    "titles": [
      "Government to guarantee £1.5bn loan to Jaguar Land Rover after cyber shutdown",
      "Jaguar Land Rover wins £1.5bn UK loan support after cyber attack",
      "UK government will underwrite £1.5bn loan guarantee to Jaguar Land Rover after cyber-attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK government has underwritten a £1.5bn loan guarantee to Jaguar Land Rover (JLR), Britain's largest automotive employer, to help it recover from a cyber-attack and restart engine manufacturing in early October. This move, involving a loan from a commercial bank backed by UK Export Finance, aims to protect the automotive supply chain and provide certainty to suppliers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Killed in Stampede at Vijay's Rally in Tamil Nadu, Toll May Rise",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 19:22:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Vijay, a well-known actor who goes by only one name, launched a political party last year.",
      "At least 36 people were killed in a stampede at a campaign rally for the popular Tamil actor-turned-politician, officials said.",
      "At least 36 people were killed and dozens injured in a stampede Saturday at a political rally in India for a popular actor-turned-politician, authorities said."
    ],
    "image_url": "",
    "titles": [
      "At least 39 killed in crowd crush at Indian actor-politician Vijay’s rally",
      "India: Dozens killed at rally for actor-politician Vijay",
      "At least 36 killed at Indian actor’s political rally"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.832,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At least 36 people were killed in a stampede during a campaign rally for actor-turned-politician Vijay in Tamil Nadu, India. The event drew tens of thousands of supporters. Health officials warn the death toll may increase.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadiens Beat Maple Leafs 4-2 in NHL Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 01:51:13 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Riley Kidney and Lane Hutson each scored power-play goals in the second period and the visiting Montreal Canadiens defeated the Toronto Maple Leafs 4-2 in NHL pre-season action on Saturday.",
      "<p>Designated for a new role this season, Alex Newhook looked the part Saturday in a win over the Maple Leafs. </p>\n<p>If he can replicate that type of effort in the regular season, it will go a long way for the Canadiens. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/aeec906f82173b3430671e411a85bb59a73cc9d1f9e595f4a22c0d3f9ab6e395.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens use power play to beat Leafs",
      "Newhook shines in new role to help Canadiens beat Maple Leafs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.696,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Riley Kidney and Lane Hutson scored power-play goals in the second period, leading the Montreal Canadiens to a 4-2 victory over the Toronto Maple Leafs in an NHL pre-season game. Alex Newhook, in a new role for the Canadiens, also impressed during the match. The outcome highlights potential strengths for Montreal as they prepare for the regular season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Wins Third Women's Rugby World Cup, Defeating Canada 33-13",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 17:01:37 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "CityNews",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Final: Canada 13-33 England</p></li><li><p>Ellie Kildunne shines for largest crowd in women’s rugby history</p></li></ul><p>If this were a movie, the scriptwriters would be shoo-ins for an Oscar, the plot centred on a dominant team who overcame the heartbreak of losing two back-to-back Ru",
      "<p>England finally has a Women&#8217;s Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.</p>",
      "England finally has a Women&#8217;s&#160;Rugby&#160;World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday. Victory by five tries to three capped an astonishing World Cup cycle in which England won every match, 33 in a row,"
    ],
    "image_url": "https://i.guim.co.uk/img/media/419f43299f7512584409b061464caf5943147a87/1909_1397_1898_1519/master/1898.jpg?width=140&quality=85&auto=format&fit=max&s=a347528da6d8c7807fe8f96c7fca0554",
    "titles": [
      "England outclass Canada to capture glorious Women’s Rugby World Cup triumph",
      "Canada drops Women’s Rugby World Cup final against England",
      "Canada loses Women’s Rugby World Cup final 33-13 to England"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.776,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "England won their third Women's Rugby World Cup title by defeating Canada 33-13 at Twickenham, in front of a record crowd of 81,885. Ellie Kildunne stood out in a game that marked England's dominance in women's rugby, completing a perfect World Cup cycle with 33 consecutive wins. This victory cements England's status as a powerhouse in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Reinstates Sanctions on Iran Over Nuclear Deal Failures",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 13:05:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The UN has reimposed sanctions on Iran, a decade after they were lifted as part of the nuclear deal called the JCPOA.",
      "Tehran fails to meet deadline set by European powers",
      "<p>Sanctions bar dealings related to Tehran’s nuclear and ballistic missiles program and are also expected to have wider effects on its troubled economy</p><p>Widespread UN sanctions against Iran have come back into force for the first time in a decade, after last-ditch nuclear talks with western po"
    ],
    "image_url": "",
    "titles": [
      "Iran slams ‘illegal’ vote as UN reimposes decade-old sanctions",
      "UN reimposes sanctions on Iran over its nuclear programme",
      "Sweeping UN sanctions on Iran come into effect after nuclear talks fail"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.73,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UN has reinstated sanctions on Iran for the first time in a decade after Tehran failed to meet the deadline set by European powers regarding the nuclear deal, JCPOA. These sanctions, targeting Iran's nuclear and ballistic missiles program, are anticipated to broadly impact its already struggling economy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Marc-Andre Fleury Retires with Ovation in Final Penguins Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 22:59:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Marc-Andre Fleury, who signed a ceremonial professional tryout contract earlier this month, received a standing ovation in his final game with the Penguins, a 4-1 preseason win against the Blue Jackets.",
      "<p>Marc-Andre Fleury stopped all eight shots he faced during the third period of his final game with the Pittsburgh Penguins, a 4-1 preseason win against the Columbus Blue Jackets on Saturday night.</p>",
      "<p>Watch as Pittsburgh Penguins legend Marc-Andre Fleury is given a standing ovation by the home crowd after putting on a remarkable performance in his final appearance with the team.</p>"
    ],
    "image_url": "",
    "titles": [
      "Fleury bids emotional farewell in last Pens game",
      "Marc-Andre Fleury receives emotional farewell in final game with Penguins",
      "Gotta See It: Fleury receives standing ovation in final send-off with Penguins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Marc-Andre Fleury, after signing a ceremonial contract, played his final game with the Pittsburgh Penguins, receiving a standing ovation. In this 4-1 preseason win against the Columbus Blue Jackets, Fleury stopped all eight shots in the third period, marking a memorable farewell performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Seeks Drone Sale to US, Eyes More Arms Deals; Russia Warns UN",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 02:26:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Zelenskyy says Ukraine also working on deal to sell drones to the US; Sergei Lavrov tells UN ‘any aggression’ against Russia will be met with ‘decisive response’. What we know on day 1,313</p><ul><li><p><a href=\"https://www.theguardian.com/world/russia+ukraine\">See all our Russia-Ukraine war cove",
      "Ukraine is ready to secure additional deals with the US on arms deliveries, including long-range weapons, in addition to an existing $90 billion agreement, according to President Volodymyr Zelenskiy."
    ],
    "image_url": "https://i.guim.co.uk/img/media/3e59abb7420b4d60a4d4aec9148c6da390218863/390_0_5908_4728/master/5908.jpg?width=140&quality=85&auto=format&fit=max&s=cf99930c3b26dc59ea5b6063db04926f",
    "titles": [
      "Ukraine war briefing: Ukraine discussing ‘mega’ arms deal with US, Zelenskyy says",
      "Zelenskiy Says Ukraine Seeks Long-Range Arms Deals With US"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine's President Zelenskyy announced the country is working on a deal to sell drones to the US and is ready to secure more arms deals, including long-range weapons, beyond the existing $90 billion agreement. Meanwhile, Russia's Sergei Lavrov warned the UN that any aggression against Russia would prompt a 'decisive response'. This development occurs on day 1,313 of the conflict.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 05:41:52 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for h",
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally.",
      "<p>State department said it would revoke Petro’s visa after he joined a pro-Palestinian rally in New York, where he called for US soldiers to ‘disobey’ Trump</p><p>The Colombian president, <a href=\"https://www.theguardian.com/profile/gustavo-petro\">Gustavo Petro</a>, has dismissed the US decision to"
    ],
    "image_url": "https://i.guim.co.uk/img/media/e6f1015e4d2aaf8fe372de8e552b18d6f6cb9b19/370_0_3044_2437/master/3044.jpg?width=140&quality=85&auto=format&fit=max&s=269f6f22fe8835539781931b5431ff23",
    "titles": [
      "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "State Department revokes visa for Colombian President Gustavo Petro",
      "U.S. Says It Will Revoke Colombian President’s Visa",
      "‘I don’t care’: Colombia president Petro hits back after US revokes his visa"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.613,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Saturday Upsets Shake Up College Football Playoff Bracket",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 03:43:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Statement wins on a chaotic Saturday led to a shake up in the College Football Playoff bracket",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQRkJQVkdwOURlU0RYUlJCZE5IM1pNN2g1S0poRG5fbndSTHZfODJPMUxrSklWMUtQN0QwSHlaVUZQR0dTbVFFLUUyYUlyR043RnVqVkh6ZEw0aHY2eW5sNXNpdENjQTVLS2tCT0dXdFBnVExudmRSaTZVcExCSUY1bWs2ZEdUeG1kQmRvbjZFME4?oc=5\" target=\"_blank\">College Football Playoff Bracket"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/28/2627799c-50ea-45a9-93c7-07a0b48d6d36/bama-bowl-projections.png",
    "titles": [
      "Bowl projections: SEC, Big Ten own College Football Playoff field with Alabama, Oregon, Ole Miss among risers",
      "College Football Playoff Bracket Week 5 Projections: Ole Miss Vaults Into Rankings - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On a chaotic Saturday, significant victories led to major changes in the College Football Playoff bracket. This shakeup has altered the landscape for teams vying for a championship contention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Argentina Shocked by Live-Streamed Murder of Three Women; 5 Arrested",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 02:30:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Drug gang suspected in torture and murder of two young women, and a 15-year-old girl, in crime that shocks Argentina.",
      "The murder of three young women who were tortured live on social media has shocked Argentina. Five suspects have been detained but the alleged mastermind behind the killings is still at large."
    ],
    "image_url": "",
    "titles": [
      "Thousands protest livestreamed murder of 2 women, young girl in Argentina",
      "Argentina: Thousands march for women murdered on livestream"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Argentina, three young women, including a 15-year-old girl, were tortured and murdered, an act broadcasted live on social media, shocking the nation. Five suspects are in custody, yet the alleged mastermind remains at large.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Golden Lion Tamarins, Sloths Share Habitat at Palm Beach Zoo",
    "domain": "science",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 21:24:11 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society.",
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society in Florida."
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/250927_abc_social_monkey_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Golden lion tamarins and sloths become unlikely roommates at Florida zoo",
      "Golden lion tamarins and sloths become unlikely roommates at Palm Beach Zoo"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Golden lion tamarins and Hoffman's two-toed sloths are now cohabiting in a new habitat at the Palm Beach Zoo and Conservation Society in Florida, showcasing an unusual pairing of species.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Revokes Colombian President's Visa After Protest Remarks",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 23:26:05 +0000",
    "source": "Fortune",
    "sources": [
      "CityNews",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "During a protest Friday over the war in Gaza, he said “I ask all the soldiers of the United States' army, don't point your rifles against humanity\" and “disobey the orders of Trump.”",
      "WASHINGTON (AP) — Tensions between the United States and Colombia have escalated with the State Department announcing it was revoking a visa for Gustavo Petro, president of the Latin American country, after he participated in a New York protest where he called on American soldiers to disobey Preside"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/AP25266820328000-e1759015209306.jpg?w=2048",
    "titles": [
      "U.S. revokes visa for Colombia’s president after he went to a protest and urged American soldiers to disobey Trump",
      "US revokes visa for Colombia’s president after he urges American soldiers to disobey Trump"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. State Department revoked the visa of Colombian President Gustavo Petro after he urged American soldiers to disobey President Trump's orders during a protest in New York against the war in Gaza. This action has heightened tensions between the United States and Colombia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Portland Officials Oppose Trump's National Guard Deployment Order",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 20:32:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The city&#039;s Democratic mayor says there is no need for the US president to send federal forces.",
      "<p>Officials in Portland have pushed back against the announcement, saying there is  ‘no need for military troops’ – key US politics stories from Saturday 27 September</p><p>Donald Trump has ordered the deployment of the national guard to Portland, Oregon, authorizing “full force, if necessary”, ign"
    ],
    "image_url": "",
    "titles": [
      "Trump orders deployment of troops to US city of Portland and ICE facilities",
      "Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.853,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Portland officials, including the city's Democratic mayor, have opposed President Donald Trump's order to deploy the National Guard to Portland, Oregon. They argue that there is no need for military troops in the city. This response comes after Trump's authorization for the deployment, emphasizing the use of \"full force, if necessary.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Deploys Troops to Protect Immigration Facilities in Major US City",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 21:42:04 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The president says the latest move to send troops to a major US city is \"necessary\" to protect immigration detention facilities.",
      "Move to protect immigration enforcement facilities is fourth deployment in Democrat-controlled US cities"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f730/live/021eaaf0-9c01-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Trump authorises 'full force' as Portland set to become latest city to see troops deployed",
      "Trump authorises ‘full force’ as he orders troops to ‘war-ravaged’ Portland"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.856,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The President has announced the deployment of troops to a major US city, marking the fourth such action in Democrat-controlled cities. This move aims to safeguard immigration detention facilities, deemed \"necessary\" for their protection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints and Answers for Today's NYT Mini Crossword and Connections Puzzle",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 19:02:07 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/66ad93159698a3280d18584c/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Mini Crossword Clues And Answers For Sunday, September 28th",
      "NYT Connections Today: Hints, Answers For Sunday, September 28"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.898,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Need assistance with today's NYT Mini Crossword or Connections puzzle? Find hints and answers for both games here. This resource provides solutions to help you complete the puzzles successfully.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  }
]