[
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale, coinciding with the onset of warmer months, is currently underway and will continue until Monday, March 31, 2025. The event offers significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9634860565972222,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4508715141493056,
    "summary": "Amazon's Big Spring Sale is happening now through March 31, 2025, offering discounts on items such as gardening supplies and bedding to mark the start of warmer months."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a rewarding experience for players. The game emphasizes precision in its gameplay, offering a challenging yet satisfying experience as players take on the role of a shinobi."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9122707784375,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.438067694609375,
    "summary": "Assassin's Creed Shadows features enhanced stealth and assassination gameplay, focusing on precision and offering a challenging experience. Players assume the role of a shinobi, navigating through the game with rewarding mechanics."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is a gaming laptop that aims to be an alternative to the MacBook Pro, featuring a design that balances gaming capabilities with a thin and light chassis. This marks a return to a more streamlined design after the previous generation increased in size."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8706041115046297,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4276510278761574,
    "summary": "The Razer Blade 16 gaming laptop is designed to offer an alternative to the MacBook Pro, focusing on a balance between gaming performance and a slim, lightweight design. This represents a shift back to a more streamlined design, moving away from the larger size of its predecessor."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various settings needing additional light. It is rechargeable, portable, and features three adjustable LED panels that emit 3000 lumens, making it ideal for use at campsites, workspaces, or for mechanical work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.586668926087963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35666723152199076,
    "summary": "BougeRV has released a portable LED lantern designed for outdoor camping and versatile enough for workspaces or mechanical tasks. This rechargeable light offers 3000 lumens through three adjustable LED panels, catering to different lighting needs."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) until a final decision is made in the ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.25290735175925916,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2732268379398148,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) until a final ruling is made in the current court case."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft announced that the latest Windows 11 Insider Preview will remove a bypass script that previously allowed users to set up the operating system without an internet connection and logging into an account."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.24891429596064807,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.272228573990162,
    "summary": "Microsoft's latest update to the Windows 11 Insider Preview will eliminate a script that permitted users to install the operating system without needing an internet connection or to log into an account."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will continue until March 31st. The sale features dozens of deals accessible without an Amazon Prime membership. A comprehensive roundup includes over 100 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.2406388327662038,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.27015970819155094,
    "summary": "Amazon's Big Spring Sale is happening now through March 31st, offering a wide range of deals on popular items and low-cost alternatives. This sale is open to all customers, not just Amazon Prime members, and includes a comprehensive roundup of over 100 deals."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk announced that his AI company, xAI, has acquired the social media platform X (previously Twitter) in an all-stock deal. The transaction values xAI at $80 billion and X at $33 billion, which includes $12 billion in debt. This acquisition comes a few years after Musk bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.23467818438657406,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2686695460966435,
    "summary": "Elon Musk's AI company, xAI, has acquired the social media platform X (formerly known as Twitter) in an all-stock transaction. The deal values xAI at $80 billion and X at $33 billion, incorporating $12 billion of debt. This follows Musk's earlier purchase of Twitter for $44 billion a few years ago."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653), aimed at enabling IT professionals to remotely recover Windows 11 devices that won't boot. This feature, first announced last year, is designed to prevent incidents similar to the previous Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.22729392489583322,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.26682348122395827,
    "summary": "Microsoft is testing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This tool allows IT professionals to remotely fix devices that won't boot, aiming to avoid problems like the past Crowdstrike issue."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, following its acquisition of Fitbit in early 2021. Initially, users were required to make the switch by 2025, but a recent email to Fitbit users announced the extension."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.21118281355324076,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.26279570338831015,
    "summary": "Google has postponed the deadline for Fitbit users to transfer their accounts to Google accounts until next year. This decision follows Google's acquisition of Fitbit in early 2021. Originally, users had until 2025 to make the switch, but a recent email to users has extended this timeframe."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers are actively engaged in efforts to rescue individuals from the debris of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescuers are currently working to save people trapped in the rubble of a tower that fell on Friday."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire broke out in a city, injuring 21 people and damaging a restaurant along with several other buildings, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire occurred in a city, resulting in 21 people being injured and causing damage to a restaurant and multiple other buildings, as reported by local authorities."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 10:58:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other top officials, stating it demonstrated a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister has criticized the visit of the US Vice President and other senior officials, describing it as showing a \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting with the country's leader following the upcoming Canadian elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and revealed intentions to meet with Canada's leader after the forthcoming Canadian elections."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the past year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida within the last year."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The investigation is part of a broader effort by the Trump administration to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration is conducting an investigation into diversity and inclusion initiatives as part of a wider examination of such programs."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki has been criticized for wearing a disguise on TV to promote his own book."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise on television to promote his own book."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. The initiative aims to improve the visual content available on the platform."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative is working to enhance the quality of photos, particularly those of celebrities, on a specific website. The project focuses on upgrading the visual content available on the platform."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed alleging that a controversial influencer assaulted and threatened an individual in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit claims a controversial influencer committed assault and made threats against someone in Beverly Hills, which the influencer denies."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from several celebrities, including Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy has issued an apology after receiving criticism from celebrities such as Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent who reported on mass protests in Turkey was deported from the country this week."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent, who covered mass protests in Turkey, was deported from the country this week."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, expressing deep anguish over their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of individuals missing in Antigua have expressed their profound distress to the BBC, conveying their anguish over the disappearances of their loved ones."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's magnitude and the extensive length of the fault line it occurred on played significant roles in the resulting devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake caused significant devastation due to its high magnitude and the long fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing widespread damage in the area."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 14-foot-wide mural by artist MF Husain was sold for a record $13.8 million in New York last week."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mural by artist MF Husain, measuring 14 feet in width, was sold for a record-setting $13.8 million at an auction in New York last week."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their conduct while executing an evacuation at a military base in South Sudan amidst gunfire."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices for cars have significantly increased, with expectations for further rises, according to a car seller speaking to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, with further increases expected, a car seller told the BBC."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world, but certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will be a near-total one in some parts of Canada, but it will not reach totality anywhere in the world."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers in Myanmar received applause for successfully carrying 30-year-old Phyu Lay Khaing on a stretcher to safety."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescuers in Myanmar were applauded for safely transporting 30-year-old Phyu Lay Khaing on a stretcher to a secure location."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake in Myanmar caused a 33-story building under construction to collapse on Friday, leaving dozens of people unaccounted for."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-story building under construction in Myanmar collapsed on Friday due to a powerful earthquake, resulting in dozens of people being reported missing."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to a baby shortly after evacuating from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman successfully gave birth to her baby shortly after being evacuated from a hospital."
  },
  {
    "title": "Turkiye protests: Iconic scenes and divided coverage",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:33:50 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The protests in Turkiye have highlighted a divided political and media landscape, featuring perspectives from both supporters and critics of the current situation. This coverage aims to present a balanced view by incorporating voices from across the spectrum."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Protests in Turkiye have showcased the country's divided political and media landscape, with coverage including both supporters and critics of the current situation. The aim is to provide a balanced perspective by featuring voices from across the spectrum."
  },
  {
    "title": "Eid Mubarak 2025: Hear greetings in different languages",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:33:12 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eid will start on Sunday, March 30, in Saudi Arabia. The article provides guidance on expressing Eid greetings in various languages."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Eid will begin on Sunday, March 30, in Saudi Arabia. The article offers instructions on how to extend Eid greetings in different languages."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators have discovered that mutations in VPS35, a crucial part of a pathway that uses reactive oxygen species (ROS) to destroy cancer cells, can lead to resistance to chemotherapy. This finding may aid in identifying tumors that are resistant to treatments."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that mutations in the VPS35 gene, which is involved in a process that eliminates cancer cells using reactive oxygen species (ROS), can cause tumors to become resistant to chemotherapy. This discovery could help in identifying which tumors will not respond to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study revealed that over 50% of US adults have faced discrimination, with those highly exposed being over five times more likely to show signs of depression and anxiety. Compared to those unaffected, individuals experiencing discrimination have almost nine times higher odds of screening positive for both mental health conditions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that over half of US adults have experienced discrimination, leading to a significant increase in mental health issues. Those facing high levels of discrimination are over five times more likely to exhibit depression and anxiety symptoms. Additionally, individuals who have encountered discrimination have nearly nine times the risk of screening positive for both conditions compared to those who have not faced discrimination."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new customizable hydrogel, created using 3D printing, showed promising results in preclinical trials for repairing various types of meniscal tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new 3D-printed hydrogel that can be customized to repair different types of meniscal tears. This hydrogel showed promising outcomes in preclinical trials, indicating potential for future use in meniscal repair."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cold water immersion for a week has been found to boost cells' ability to handle stress by improving cellular resilience and autophagic function. This adaptation may contribute to better health, disease prevention, and a slower aging process at the cellular level."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that immersing in cold water for a week enhances cells' stress response, cellular resilience, and autophagy. This adaptation could lead to improved health, disease prevention, and slower cellular aging."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Approximately one-third of women aged 14-49 in the U.S. experience bacterial vaginosis (BV), marked by odors and possible painful side effects. Over half of those treated with the first-line antibiotic, metronidazole, see a recurrence. Researchers have now created a DNA PCR-based lab test to enable precise treatment by analyzing the bacteria responsible for BV, aiming to improve treatment efficacy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the U.S., about one-third of women aged 14-49 suffer from bacterial vaginosis (BV), which can cause odors and discomfort. Over 50% of patients treated with the standard antibiotic, metronidazole, experience a recurrence. Researchers have developed a DNA PCR-based lab test to identify the specific bacteria causing BV, with the goal of enhancing treatment effectiveness."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that red meat, enhanced with scent oils, is the most effective bait for capturing weasel images on camera traps. This finding aids conservationists in tracking weasel populations, as these animals are notoriously hard to photograph."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that using red meat with added scent oils is the best bait for photographing weasels with camera traps. This method improves the ability of conservationists to monitor weasel populations, which are difficult to capture on camera."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that can learn independently, closely mimicking biological neurons. These infomorphic neurons form artificial neural networks, learning self-organizedly by extracting information from their surrounding network environment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created artificial neurons that can learn on their own, similar to how human neurons function. These neurons, part of artificial neural networks, can self-organize and learn by analyzing information from their environment."
  },
  {
    "title": "Brain channels 'stopped in time' reveal chemical flow that enables learning and thinking",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 13:49:00 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent study has discovered findings that could help in the development of new medications. These drugs would target signaling channels in the body, aiming to either block or open them. This advancement has the potential to treat a range of conditions, including epilepsy and certain intellectual disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has identified potential advancements in medication development by targeting signaling channels in the body to treat conditions such as epilepsy and some intellectual disorders. The research focuses on creating drugs that can either block or open these channels, offering new treatment possibilities."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:17:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston both secured victories in their respective games. The event was followed by detailed analysis of the action from each match, providing insights into how these wins were achieved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston each won their respective games. Post-game analysis offered insights into the strategies and performances that led to their victories."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is declaring for the NBA draft and entering the transfer portal, according to his agent Sam Permut of Roc Nation, as reported by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, has announced his decision to declare for the NBA draft and enter the transfer portal. His agent, Sam Permut of Roc Nation, confirmed this news to ESPN."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:38:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A precisely executed inbounds play led No. 1 Houston to a 62-60 victory over Purdue, securing their place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston won against Purdue with a score of 62-60, thanks to a well-executed inbounds play, advancing to the Elite Eight."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts scored 31 points and had 10 rebounds, helping UCLA win 76-62 against Ole Miss. This victory advances UCLA to the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:38:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off homer on Friday, marking an emotional highlight early in the season after he lost nearly 20 pounds due to an illness."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, an emotional moment following his loss of nearly 20 pounds due to an illness earlier in the season."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb spoke out against online harassment directed at Mississippi State's Chandler Prater, stating her belief that JuJu Watkins' ACL injury was not caused by a malicious play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater from online harassment, stating that JuJu Watkins' ACL injury was not the result of a malicious play."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' comment suggesting Antetokounmpo could have scored 250 points in a 1970s NBA game, stating that comparing different basketball eras is not feasible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo addressed LeBron James' remark that Antetokounmpo could score 250 points in a 1970s NBA game by stating that comparing basketball eras is not practical."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu won the women's figure skating world championship, becoming the first American to do so since 2006. She ended Kaori Sakamoto's three-year reign as champion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu became the first American to win the women's figure skating world championship since 2006, ending Kaori Sakamoto's three-year championship streak."
  },
  {
    "title": "UCLA lands MWC Player of Year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:20:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists this season for New Mexico, has committed to play for UCLA after entering the transfer portal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard with an average of 20.4 points and 6.5 assists per season for New Mexico, has decided to transfer to UCLA for his future college basketball career."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 11:29:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament's Sweet 16 commenced with its first four games, marking a significant phase in the competition. This stage is pivotal as teams vie for a spot in the Elite Eight, moving one step closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament progressed to the Sweet 16, starting with four games. This critical stage determines which teams advance to the Elite Eight, edging closer to the championship."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:39:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has concluded, shifting focus to future team development. The team will concentrate on portal priorities and integrating new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has ended, and the team is now focusing on building for the future. Efforts will include prioritizing portal transfers and incorporating new recruits to strengthen the team for the upcoming season."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:29:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an analysis of various sports matchups, including their implications for playoff projections and draft lottery standings. It offers updated information on what is at stake for the teams involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article analyzes sports matchups, discussing their impact on playoff projections and draft lottery standings. It updates on the stakes for the involved teams."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:29:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As the playoff field becomes clearer, a panel has cast their votes on team rankings, with details provided on each team's schedule up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A panel has voted on team rankings as the playoff field becomes clearer, providing details on each team's schedule until April 17."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The New York Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in only four days. This rapid conversion involved extensive preparations and adjustments to accommodate the event, showcasing the flexibility and efficiency of the teams and facility management involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The New York Yankees' spring training facility was quickly converted into the Tampa Bay Rays' Opening Day ballpark in just four days. This swift transformation required detailed planning and adjustments, highlighting the adaptability and efficiency of both the teams and the facility management."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:47:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's pursuit of a championship title. Their performances are central to the team's success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are pivotal to Notre Dame's championship ambitions, driving the team's success with their standout performances."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting lines, spreads, totals, and Basketball Power Index (BPI) ratings are now available for every game in the Women's Basketball tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting information such as lines, spreads, totals, and Basketball Power Index (BPI) ratings for every game in the Women's Basketball tournament has been released."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are striving to surpass Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 10:21:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday. This announcement was made on Friday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 10:21:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving over $20 million from a jury verdict."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 10:21:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna has appealed to the Spanish football federation (RFEF), arguing that Barcelona improperly played defender Iñigo Martínez in a LaLiga match due to a technicality related to his absence from Spain's games due to injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has filed an appeal with the Spanish football federation (RFEF), claiming Barcelona fielded defender Iñigo Martínez in a LaLiga match in violation of regulations, citing a technicality linked to his non-participation in Spain's matches due to injury."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 10:21:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, sustained a left knee injury during a 0-0 match against the Houston Dash. She will undergo evaluation in New Jersey following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, injured her left knee during a 0-0 game against the Houston Dash. She is set to be evaluated in New Jersey after the injury."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 10:21:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo appealed to FIFA on Friday, requesting the organization to reconsider its decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have formally appealed to FIFA, asking the organization to reverse its decision to disqualify the Mexican team from the Club World Cup."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating legal action against the Canadian soccer federation due to a significant knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering suing the Canadian soccer federation over a serious knee injury Alphonso Davies suffered."
  },
  {
    "title": "Herdman reprimanded in Canada drone scandal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Canada soccer coach John Herdman received a written reprimand after a disciplinary hearing for his role in a drone-spying incident during the Paris Olympics."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Canada soccer coach John Herdman was issued a written reprimand following a disciplinary hearing related to a drone-spying incident at the Paris Olympics."
  }
]