[
  {
    "title": "Australia to Recognize Palestinian State at UN, Aligns with Allies",
    "domain": "general",
    "location": "national",
    "published": "Mon, 11 Aug 2025 01:31:57 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post",
      "Axios",
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The decision comes as France, Canada and the UK have signaled similar steps in recent weeks.",
      "Australian PM Anthony Albanese says Australia will recognise a Palestinian state at next month&#039;s UN General Assembly.",
      "Prime Minister Anthony Albanese says two-state solution is &#039;humanity&#039;s best hope&#039; to end suffering in Gaza.",
      "Australia will back Palestinian statehood at the UN in September, Prime Minister Anthony Albanese says. New Zealand may follow, with a decision expected from its cabinet next month. Follow DW for the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1YQzZidTlNWnRPYWN4SjRTOGZNYVlLeWtWcUFkN0M0UVdLZEF5UGo4cWpSR3g5Z0IxanYwNTA5OEVlMG9naVlGZld6Wjg2dGlkZWxMbEdlandZU0NXaTlNUHF4NjZnVEdnRjJXU1FiU1dIbkZ2LVlBc2ln?oc=5\" target=\"_blank\">Australia will recognize a Palestinian state, PM Albanese says<",
      "<p>Labor prime minister Anthony Albanese said a two-state solution was the best hope to ‘bring an end to the conflict, suffering and starvation in Gaza’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/11/news-live-netanyahu-shameful-palestine-state-anthony-albanese-pe",
      "Canberra is the latest U.S. ally to announce such a move in the face of growing global outrage over the dire humanitarian situation in Gaza.",
      "<p>How a two-state solution will work – and what Palestinian groups and critics have said in response</p><p>The Australian government will recognise a Palestinian state at the United Nations general assembly next month, with prime minister Anthony Albanese saying a two-state solution was “humanity’s"
    ],
    "image_url": "",
    "titles": [
      "Australia will recognize a Palestinian state, Prime Minister Albanese says",
      "Australia to recognise Palestinian state at UN in September",
      "Australia to recognise Palestinian statehood, New Zealand may follow",
      "Middle East: Australia to recognize Palestinian state at UN",
      "Australia will recognize a Palestinian state, PM Albanese says - Axios",
      "Australia to recognise a Palestinian state at the UN next month",
      "Australia to recognize a Palestinian state, joining France, Canada and U.K.",
      "Australia will recognise Palestinian statehood – but what will that mean for people in Gaza?"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.948,
      "consensus": 1.0,
      "constructiveness": 0.053,
      "proximity": 0.75
    },
    "score": 0.835,
    "summary": "Australia, led by Prime Minister Anthony Albanese, has announced it will recognize a Palestinian state at the upcoming UN General Assembly. This decision aligns with actions by France, Canada, and the UK, and comes amid international concerns over the humanitarian situation in Gaza. Albanese highlighted that a two-state solution offers the best hope for ending the conflict and suffering in the region. New Zealand is also considering a similar stance, with a decision expected soon.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 76 tokens"
  },
  {
    "title": "Nvidia and AMD to Pay US 15% Revenue from China Chip Sales for Export Licenses",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 07:01:59 GMT",
    "source": "BBC",
    "sources": [
      "MarketWatch",
      "The Guardian",
      "Fortune",
      "BBC",
      "Financial Times",
      "CNBC",
      "Deutsche Welle"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The chip giants will hand revenues to the US government in exchange for licences to export to China.",
      "The US government began issuing artificial intelligence chip export licenses after the revenue-sharing deal, despite security concerns.",
      "The arrangement comes as President Donald Trump's tariffs continue to reverberate through the global economy.",
      "Chipmakers agree to unusual arrangement to secure export licences from Trump administration",
      "<p>Chipmakers agree to quid pro quo deal as condition for obtaining export licenses for Chinese market, FT reports</p><p>Nvidia and AMD have agreed to give the US government 15% of their revenues from chip sales in China, under an unprecedented arrangement to obtain export licenses for the semicondu",
      "Nvidia plans to share 15% of the revenue from sales of its H20 chip in China and AMD will deliver the same share from MI308 revenues.",
      "Nvidia Corp. and Advanced Micro Devices Inc. will give 15% of their chip revenue from sales in China to the U.S. government as a condition of receiving new export licenses, according to a report Sunday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5b1a/live/8b0b0ca0-764a-11f0-8a67-b1cc2ecf43e7.jpg",
    "titles": [
      "Chip giants Nvidia and AMD to pay 15% of China revenue to US",
      "Nvidia, AMD to pay US 15% of AI chip sales to China",
      "Nvidia and AMD to pay 15% of China chip sales revenues to the U.S. government, FT reports",
      "Nvidia and AMD to pay 15% of China chip sale revenues to US government",
      "Nvidia and AMD reportedly agree to pay 15% of China chip sale revenues to US",
      "Nvidia, AMD agree to pay US 15% of China chip sale revenue",
      "Nvidia and AMD reportedly will give U.S. government 15% of their China chip revenues"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.958,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary": "Nvidia Corp. and Advanced Micro Devices Inc. (AMD) have agreed to pay the U.S. government 15% of their revenue from certain chip sales in China as part of a unique deal to secure export licenses. This arrangement, reported as a response to ongoing global economic shifts due to President Donald Trump's tariffs, marks an unprecedented approach to obtaining the necessary permissions for operating in the Chinese market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens"
  },
  {
    "title": "Israeli Airstrike Kills 4 Al Jazeera Journalists in Gaza, Sparks Outrage",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 00:43:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "The Guardian",
      "New York Times",
      "Financial Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Media network condemns ‘assassination’ of its Gaza correspondents and photographers by Israeli forces.",
      "Anas al-Sharif along with four other Al Jazeera journalists have been killed by an Israeli attack.",
      "An Israeli air strike has killed four Al Jazeera journalists including correspondent Anas al-Sharif.",
      "Al Jazeera staff killed in targeted Israeli attack on a tent housing journalists near al-Shifa Hospital, Gaza City.",
      "Israel says it killed Al Jazeera journalist Anas Al-Sharif. Israel's plans to expand operations to capture and occupy Gaza City have drawn severe condemnation. DW has the latest.",
      "The Al Jazeera media company said in a Sunday statement that four of its journalists -- including correspondent Anas Al Sharif -- were killed in an Israeli airstrike.",
      "Anas al-Sharif was well known across the Arab world for reports on the famine in the enclave",
      "<p>Israel admits deliberate attack on the journalist, known for frontline coverage, in a strike on a tent outside al-Shifa hospital</p><p>A prominent Al Jazeera journalist who had previously been threatened by Israel has been killed along with four colleagues in an Israeli airstrike.</p><p>Anas al-S",
      "Anas al-Sharif, a well-known correspondent, was among those killed. Israel said it had targeted Mr. al-Sharif, claiming he worked for Hamas, which he had denied."
    ],
    "image_url": "",
    "titles": [
      "Al Jazeera condemns killing of its journalists by Israeli forces in Gaza",
      "Israel kills Anas al-Sharif and four other Al Jazeera journalists in Gaza",
      "Israel kills four Al Jazeera journalists including Anas al-Sharif in Gaza",
      "Anas al-Sharif among five Al Jazeera staff killed by Israel in Gaza",
      "Al Jazeera journalist killed in Israeli attack in Gaza City",
      "Israeli strike kills Al Jazeera journalist Anas Al Sharif in Gaza",
      "Israel kills famous Al Jazeera reporter in Gaza",
      "Anas al-Sharif, prominent Al Jazeera correspondent, among five journalists killed in Israeli airstrike on Gaza",
      "Israeli Strike Kills 4 Al Jazeera Journalists, Network Says"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.858,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.808,
    "summary": "An Israeli airstrike near al-Shifa Hospital in Gaza City killed four Al Jazeera journalists, including Anas al-Sharif. Al Jazeera condemned the attack, describing it as a targeted strike on journalists and accused the IDF of inciting against its reporters, while Israel claimed Sharif was associated with Hamas. The incident has intensified scrutiny on Israel's military actions in Gaza, with plans to expand operations in the area facing widespread criticism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens"
  },
  {
    "title": "Justin Rose Wins FedEx St. Jude Championship in Playoff Comeback",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 23:47:49 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNV0tJMGpVb1pBb3ZlMWpvV1N5SkdNRnYtRlJ2Nm1rckdZVEFENkpUYmRmVDNoZDhjemp2aDZyWWhZOVY3cjZxRW1lWEF2Zzk2RWgyaUZDdEJVUjFXOWV5TWJFU1pKeUpLYWFXZllvQS0xWlh5bTdzaWVwaDhxZ05aSUVnQjcyRlF2akFtYlp3NUZDSGRfeWVNNkJfTnk?oc=5\" target=\"_blank\">Justin Rose Tops",
      "Highlights from day four of the FedEx St Jude Championship from TPC Southwind, Memphis, Tennessee.",
      "Justin Rose produced a sensational finish at the FedEx St Jude Championship with six birdies in his final eight holes to win a play-off against US Open champion JJ Spaun.",
      "<p>Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday.</p>",
      "<p>Watch as England&#8217;s Justin Rose drills a birdie putt on the third playoff hole to edge out JJ Spaun to earn his 12th career PGA Tour win at the St. Jude Championship.</p>"
    ],
    "image_url": "",
    "titles": [
      "Rose rallies late, tops Spaun in St. Jude playoff",
      "Justin Rose Tops J.J. Spaun in FedEx St. Jude Playoff; Tommy Fleetwood Stumbles - Sports Illustrated",
      "Highlights: Rose beats Spaun in FedEx St Jude Championship play-off",
      "Rose beats Spaun in St Jude Championship play-off after Fleetwood fades",
      "Justin Rose rallies late and beats Spaun to capture FedEx St. Jude Championship",
      "Rose edges Spaun on third playoff hole to claim St. Jude Championship"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.914,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.807,
    "summary": "Justin Rose overcame a three-shot deficit in the final five holes against Tommy Fleetwood and won the FedEx St. Jude Championship by making two birdies in a playoff against U.S. Open champion J.J. Spaun. Rose clinched the victory with six birdies in his last eight holes, showcasing a remarkable comeback on Sunday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "Trump Threatens Eviction of Homeless in D.C., Questions on Authority Arise",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:34:38 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Fortune",
      "BBC",
      "Axios",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Trump says homeless people must go \"far\" from the nation's capital, as part of his anti-crime plan, but the mayor pushes back.",
      "The White House declined to explain what legal authority Trump would use to evict people from the nation&#039;s capital.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFAzaWVia1k5bldleWEwX2tuWDNqa1cxeE5zckRaTXBLalJ1dVAtU0Zsb3ZfdHpHS29hbjlUQ0Z4MUt6cVRjWFllLWJOZzdhbmtZTnBuRzhfbFFMNUl6enpLZkRKMS1VeEJwQmVqaEl0YktfcUJ0V2hrTW5PejlBVGM?oc=5\" target=\"_blank\">FBI deployed to D.C. after Trump announces crackdown on ",
      "President Donald Trump's remarks come as he has increased his rhetoric about countering crime in the District in recent days.",
      "<p>President demands unhoused residents leave US capital or face eviction and vowed to use officers to make arrests</p><p>In a social media post on Sunday, Donald Trump has demanded homeless residents of Washington DC leave the country’s capital or face eviction, and again promised to use federal of",
      "\"I'm going to make our Capital safer and more beautiful than it ever was before,\" the president posted on his Truth Social platform Sunday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/53d4/live/40e34ae0-7634-11f0-8758-990a63646bde.jpg",
    "titles": [
      "Trump demands homeless people 'immediately' move out of Washington DC",
      "Trump pledges to move homeless people in Washington, DC ‘far’ from the city",
      "FBI deployed to D.C. after Trump announces crackdown on homeless people - Axios",
      "Trump warns homeless to leave Washington, D.C., ‘immediately’",
      "Trump orders homeless he passed en route to golf course to leave Washington DC",
      "Trump says homeless people must leave Washington, DC, immediately — ‘We will give you places to stay, but FAR from the Capital’"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.803,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary": "President Donald Trump demanded that homeless individuals in Washington D.C. leave the city or face eviction, threatening to use federal officers to enforce this. Despite his claim that D.C. is \"one of the most dangerous cities in the world,\" federal data shows a decline in crime rates. Trump's legal authority to enforce such evictions remains unexplained by the White House. His statements align with recent rhetoric on combating crime in the capital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens"
  },
  {
    "title": "Magnitude 6.1 Earthquake Strikes Northwest Turkey, 1 Dead, 29 Injured",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 00:13:55 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "Global News",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The magnitude 6.1 quake left one person dead and caused 16 buildings to collapse in the north-west Balikesir province.",
      "Over a dozen buildings collapsed as a result of the tremor, which was felt as far as Istanbul.",
      "The earthquake, with an epicenter in the town of Sindirgi, sent shocks that were felt some 200 kilometers away in Istanbul, a city of more than 16 million people.",
      "ISTANBUL (AP) — A magnitude 6.1 earthquake struck Turkey’s northwestern province of Balikesir on Sunday, killing at least one person and causing more than a dozen buildings to collapse, officials said. At least 29 people were injured. The earthquake, with an epicenter in the town of Sindirgi, sent s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5c51/live/63c33290-7630-11f0-a067-a5100ae1e8c2.jpg",
    "titles": [
      "Turkey earthquake flattens buildings in north-east Balikesir province",
      "Turkey: 6.1 magnitude earthquake kills 1 in Balikesir",
      "6.1 earthquake hits Turkey’s Balikesir province, killing 1 and collapsing buildings",
      "6.1 earthquake hits Turkey’s Balikesir province, killing 1 and collapsing buildings"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.831,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary": "A magnitude 6.1 earthquake hit Balikesir province in northwest Turkey, with its epicenter in Sindirgi. The quake resulted in at least one death and 29 injuries, causing over a dozen buildings to collapse. The tremors were felt up to 200 kilometers away, including in Istanbul, a city home to over 16 million people.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens"
  },
  {
    "title": "Netanyahu Advocates for Israel's Control of Gaza Amid International Criticism",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 18:06:52 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu doubled down on his plan for Israel to seize control of Gaza City and the remaining sliver of Gaza not already under Israeli control.",
      "The Israeli prime minister is pushing to take control of Gaza&#039;s largest urban hub despite a wave of global criticism.",
      "<p>Israeli PM says taking over city is ‘best way’ to end war, despite condemnation from within Israel and around world</p><p>Benjamin Netanyahu has defended his plan to take control of Gaza City in the face of widespread international outrage, even as senior UN officials warned that the move risked "
    ],
    "image_url": "",
    "titles": [
      "Netanyahu defends Israel's plan to seize Gaza City, despite global condemnation",
      "UN warns of ‘calamity’ as Netanyahu pushes for Israel to seize Gaza City",
      "Netanyahu defends Gaza City plan as UN warns of ‘calamity’ and starvation"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.812,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.736,
    "summary": "Israeli Prime Minister Benjamin Netanyahu is advocating for Israel to take control of Gaza City and the remaining areas of Gaza not yet under its dominion, asserting this strategy as the \"best way\" to conclude the ongoing conflict. This stance comes despite extensive international condemnation and warnings from senior UN officials about the potential risks of such a move. Netanyahu also highlighted the plight of Israeli hostages in Gaza, claiming they are being deliberately starved, as part of his justification for the takeover.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 83 tokens"
  },
  {
    "title": "Van Gisbergen Sets Record with 4th Straight Road Win, Tops Rookie Season",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 17:19:21 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Shane van Gisbergen tied a Cup Series record with his fourth straight road-course victory, blowing out the competition again at Watkins Glen International.",
      "SVG's four wins are now the most for a driver in their Cup rookie season",
      "<p>Shane van Gisbergen’s latest victory in NASCAR’s premier series was as historical as it was emotional.</p>"
    ],
    "image_url": "",
    "titles": [
      "Shane van Gisbergen wins fourth race this season",
      "NASCAR at Watkins Glen results: Shane van Gisbergen sets new high mark with fourth straight road course win",
      "Rookie Shane van Gisbergen secures fourth victory of the season"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.799,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary": "Shane van Gisbergen made history by winning his fourth consecutive road-course race in the Cup Series at Watkins Glen International. This victory also marked the most wins by a driver in their rookie season. Van Gisbergen's latest NASCAR triumph was both significant and emotional.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "EU Ministers to Discuss Ukraine Aid Before US-Russia Summit",
    "domain": "general",
    "location": "global",
    "published": "2025-08-10T19:50:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "European foreign ministers will hold a video call on Monday to discuss how to best support Ukraine ahead of a summit between the US and Russia.",
      "<p>Remote US state is not an easy destination for either leader, but the choice of venue reflects the many factors at play</p><p>It is unlikely that Vladimir Putin will arrive in Alaska on Friday to present Donald Trump with a territorial demand for the 49th state, sold by Tsar Alexander II to the U",
      "Washington’s push to negotiate an end to the war has raised concerns the Trump administration will make concessions to Moscow that Kyiv finds unacceptable."
    ],
    "image_url": "",
    "titles": [
      "EU, NATO chief back Ukraine ahead of Trump-Putin summit",
      "Mutual inconvenience: why Alaska for the Trump-Putin summit on Ukraine?",
      "Ukraine and Europe Project United Front Ahead of Trump-Putin Summit"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.775,
      "consensus": 0.847,
      "constructiveness": 0.062,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "European foreign ministers are set to discuss support for Ukraine in a video call before a US-Russia summit. The meeting, highlighting the complex geopolitics involved, will take place despite concerns over the remote, challenging location and speculation about Russia's intentions. Washington's efforts to end the war have sparked fears of potential concessions to Moscow that may not align with Kyiv's interests.",
    "constructiveness_score": 0.062,
    "constructiveness_reason": "1 constructive keywords out of 65 tokens"
  },
  {
    "title": "Eagles' Landon Dickerson Carted Off Field with Leg Injury",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 23:47:49 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Eagles Pro Bowl left guard Landon Dickerson was helped off the field and carted indoors after suffering an apparent right leg injury during the team's open practice Sunday night.",
      "Dickerson is a three-time Pro Bowler and a staple on the Philadelphia offensive line"
    ],
    "image_url": "",
    "titles": [
      "Eagles' Dickerson injured in practice, exits on cart",
      "Landon Dickerson injury: Eagles Pro Bowl lineman carted off practice field with apparent lower leg issue"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.914,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary": "Eagles Pro Bowl left guard Landon Dickerson was carted off the field with an apparent right leg injury during an open practice. A three-time Pro Bowler, Dickerson is a key player on the Philadelphia Eagles' offensive line. The current status of his injury has not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "A'ja Wilson Sets WNBA Record with 30-Point, 20-Rebound Game",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 23:47:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A'ja Wilson had 32 points and 20 rebounds, becoming the first player in WNBA history with 30-plus points and at least 20 rebounds in a game.",
      "<p>A&#8217;ja Wilson scored 32 points and tied a career-high with 20 rebounds to become the first player in WNBA history with 30-plus points and at least 20 rebounds in a game as the Las Vegas Aces beat the Connecticut Sun 94-86 on Sunday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Aces' Wilson first with 30-point, 20-rebound game",
      "A’ja Wilson records first 30-20 game in WNBA history in Aces’ win over Sun"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.914,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary": "A'ja Wilson achieved a historic milestone in the WNBA by scoring 32 points and securing 20 rebounds in a single game, marking the first time a player has reached at least 30 points and 20 rebounds in the league's history. This performance contributed to the Las Vegas Aces' 94-86 victory over the Connecticut Sun.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "Ukrainians Concerned Over Peace Talks Without Their Input Post-Trump Return",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 04:00:20 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "There is a danger for both Kyiv and Europe that they lose sight of a strategic vision of where they want to get to",
      "Since President Trump retook office, many Ukrainians have worried a peace accord would be struck without them."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa25e39f7-d4d2-4467-b726-6c96e1cb3e80.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump, Putin and the future of Ukraine",
      "In a Trump-Putin Summit, Ukraine Fears Losing Say Over Its Future"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.899,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "Since President Trump's return to office, concerns have arisen among Ukrainians about the potential for a peace agreement to be reached without their input. This situation underscores the risk for Kyiv and Europe of losing focus on their long-term strategic goals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens"
  },
  {
    "title": "Trump Hopes for Boost in China's Soybean Purchases Amid Trade Truce Expiry",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 06:16:48 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "High Chinese tariffs threaten important market for US farmers",
      "US President Donald Trump said he hopes China will massively step up its purchases of American soybeans — comments that come a day before a trade truce expires."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fae8c06a4-205d-431f-88a3-311fb3b306f0.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump urges China to buy more US soyabeans as trade truce deadline looms",
      "Trump Urges China to Quadruple US Soy Buying, Lifting Prices"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.943,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "US President Donald Trump expressed hope that China will significantly increase its purchases of American soybeans. This statement was made as high Chinese tariffs pose a threat to a vital market for US farmers, with the trade truce between the two countries set to expire the following day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Union Demands Government Denounce Vaccine Misinformation After CDC Shooting",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 17:56:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A union representing workers at the CDC said the shooting was not random and “compounds months of mistreatment, neglect, and vilification that CDC staff have endured.\"",
      "A Georgia man who had blamed the COVID-19 vaccine for making him depressed and suicidal has been identified as the shooter who opened fire late Friday on the U.S. Centers for Disease Control and Prevention headquarters, killing a police officer. The 30-year-old suspect, who died during the incident,"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/c8f1f9362310e0742009321fd2a04b0fd9be198cfc2f220ca62b42a91e8bc460.jpg?quality=65&strip=all",
    "titles": [
      "CDC shooter blamed COVID vaccine for depression; union demands statement against misinformation",
      "CDC shooter blamed COVID vaccine for depression; union demands statement against misinformation"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.745,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.652,
    "summary": "A union representing CDC employees has demanded the federal government condemn vaccine misinformation, linking it to a deadly shooting at CDC headquarters by a Georgia man. The shooter, who blamed the COVID-19 vaccine for his depression and suicidal thoughts, killed a police officer before dying during the incident. The union highlighted that this act of violence reflects the culmination of months of mistreatment, neglect, and vilification faced by CDC staff.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens"
  },
  {
    "title": "Spurs Begin Talks with Man City for Winger Savinho",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 07:45:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "🚨⚪️ EXCL: Tottenham open club to club talks to sign Savinho from Man City!Negotiations ongoing between Spurs and City, also understand Savinho’s open to the move if the clubs can agree on fee...",
      "Tottenham Hotspur have opened negotiations with Manchester City over the potential signing of Brazilian winger Savinho, according to transfer journalist Fabrizio Romano.The 21-year-old is believed to ...",
      "Tottenham have opened formal negotiations with Manchester City over the transfer of Brazilian winger Savinho. That's according to several sources, including the Athletic, who claim that the 21-year-ol...",
      "Tottenham Hotspur have approached Manchester City about signing Savinho, with talks under way between the two Champions League clubs."
    ],
    "image_url": "",
    "titles": [
      "Tottenham make a move for Savinho",
      "Tottenham begin talks with Man City for winger Savinho",
      "🚨 BREAKING: Tottenham 'open negotiations' for Man City winger",
      "Tottenham in talks with Man City over deal for Savinho"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Tottenham Hotspur has initiated negotiations with Manchester City for the transfer of 21-year-old Brazilian winger Savinho. Multiple sources, including Fabrizio Romano and the Athletic, confirm that discussions are ongoing, with Spurs having formally approached City. Savinho is reportedly open to the move, pending agreement on the transfer fee between the clubs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Netanyahu Defends Gaza Offensive, Cites Security and Demilitarization Goals",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 17:36:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Benjamin Netanyahu said the goals include demilitarizing Gaza, the Israeli military having “overriding security control” and a non-Israeli civilian administration in charge.",
      "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Sunday defended a new military offensive in Gaza that&#8217;s more sweeping than previously announced, declaring in the face of growing condemnation at home and abroad that Israel “has no choice but to finish the job and complete the defe"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/01/20241229051220-20241229051220-6771225ed5e3812d22e2d93fjpeg_c0f04d.jpg?quality=65&strip=all",
    "titles": [
      "Israel defends planned military offensive in Gaza, lashes out at ‘global campaign of lies’",
      "Netanyahu defends new military offensive in Gaza and says it will be wider than announced"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.739,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.651,
    "summary": "Israeli Prime Minister Benjamin Netanyahu defended a significant military offensive in Gaza, emphasizing the need to demilitarize the area, maintain Israeli military's \"overriding security control,\" and establish a non-Israeli civilian administration. This stance comes amidst increasing domestic and international criticism, with Netanyahu insisting on completing the operation for Israel's security.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Tesla Seeks UK Electricity License Amid European EV Sales Slump",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 04:17:07 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "BBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "If approved by the energy watchdog Ofgem, it would allow the US firm to take on the UK's dominant suppliers.",
      "Tesla's push for an electricity license comes as the company endures a protracted EV sales slump across Europe."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/af44/live/303acee0-765a-11f0-a35c-27a088b3bc1d.jpg",
    "titles": [
      "Musk's Tesla applies to supply power to British homes",
      "Elon Musk's Tesla launches bid to supply electricity to British households"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.905,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary": "Tesla has applied for an electricity license in the UK, seeking approval from the energy regulator Ofgem. If granted, this move would enable Tesla to compete with the UK's leading energy suppliers. This application comes at a time when Tesla is experiencing a prolonged slump in electric vehicle (EV) sales throughout Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Jets Activate Jermaine Johnson, Boosting Pass Rush",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 03:37:17 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Johnson suffered a torn Achilles in Week 2 last season",
      "<p>Jermaine Johnson is officially back and ready to bolster the New York Jets&#8217; pass rush.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/11/e8e77d50-4de9-4a38-9bd9-49b1f1e92276/gettyimages-1737792367-2.jpg",
    "titles": [
      "Jets activate Jermaine Johnson: Pro Bowl pass rusher set to return after Achilles injury",
      "Jets activate Jermaine Johnson from PUP list 11 months after torn Achilles tendon"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.911,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "The New York Jets activated edge rusher Jermaine Johnson from the PUP list on Sunday. Johnson's return is expected to strengthen the Jets' pass rush as they prepare for upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 32 tokens"
  },
  {
    "title": "Palou Wins 4th IndyCar Title, Ties Ganassi with Penske's Record",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 20:32:44 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "Alex Palou's fourth IndyCar Series Championship is team owner Chip Ganassi's 17th IndyCar Series title, tying him with the great Roger Penske for most in IndyCar history.",
      "<p>Alex Palou wrapped up his fourth IndyCar championship in the last five seasons on Sunday at Portland International Raceway when title contender Pato O’Ward lost power early in the race.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689936c353591a381d40f6c4/0x0.jpg?width=960",
    "titles": [
      "Alex Palou Continues Historic Rise With Fourth IndyCar Series Title",
      "Alex Palou wins third consecutive IndyCar championship, fourth overall"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.854,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary": "Alex Palou secured his fourth IndyCar Series Championship in five seasons, contributing to team owner Chip Ganassi's 17th title, equaling Roger Penske's record for most IndyCar titles. The victory was clinched at Portland International Raceway after competitor Pato O’Ward experienced a power loss early in the race.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens"
  },
  {
    "title": "Justin Rose Wins FedEx St. Jude Championship, Oldest European PGA Victor",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 10 Aug 2025 23:40:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<ul><li><p>Run of late birdies sets up Rose’s victory in Memphis</p></li><li><p>At 45 is oldest European to win on PGA Tour in modern era</p></li></ul><p>Justin Rose produced a sensational finish at the FedEx St Jude Championship with six birdies in his last final eight holes to win a playoff agains",
      "Watch the three play-off holes JJ Spaun and Justin Rose played to decide the winner of the St Jude Championship."
    ],
    "image_url": "https://i.guim.co.uk/img/media/92baf7cc86bd5e6fa39a002ad6a40a9de11a665f/579_86_3932_3146/master/3932.jpg?width=140&quality=85&auto=format&fit=max&s=c88bef0f037ed22ecfdc11e0e46ecc58",
    "titles": [
      "Justin Rose wins nail-biting playoff against JJ Spaun to claim FedEx Cup title",
      "Three nail-biting holes | Rose and Spaun battle it out in play-off"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.822,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary": "Justin Rose secured a victory at the FedEx St. Jude Championship in Memphis by making six birdies in his final eight holes, leading to a playoff win against JJ Spaun. At 45, Rose becomes the oldest European to win on the PGA Tour in the modern era. This triumph was highlighted by a remarkable performance in the three playoff holes against Spaun.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "EU Leaders Call for More Pressure on Russia Before Trump-Putin Summit",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 17:01:54 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Russian president secures first official invitation to US in almost two decades ahead of sanctions deadline",
      "For President Vladimir V. Putin of Russia, it is an opportunity not just to end the Ukraine war on his terms, but to split apart the Western security alliance."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9bfd8efc-435f-4895-b421-471379f83239.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What Putin wants from Trump at Alaska summit",
      "With Ukraine in the Balance, Trump and Putin Head Into Summit With Mismatched Goals"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.716,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary": "Leaders of six European countries and the EU have urged for increased pressure on Russia ahead of a scheduled summit in Alaska between President Trump and President Putin. The meeting, set for next Friday, aims to discuss a resolution to the Ukraine war. European leaders express concerns that the summit could allow Putin to achieve his goals on his terms, potentially fracturing the Western security alliance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "Raducanu to Face World No 1 Sabalenka at Cincinnati Open, Norrie Out",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 10 Aug 2025 17:54:02 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<ul><li><p>British No 1 excited to take on world No 1 in third round</p></li><li><p>Cameron Norrie goes out to Roberto Bautista Agut</p></li></ul><p>Emma Raducanu has underlined her excitement before what she describes as a “fact-finding match” against the world No&nbsp;1, Aryna Sabalenka, as they p",
      "Emma Raducanu will face Aryna Sabalenka in the third round of the Cincinnati Open on Monday at 6pm, live on <em>Sky Sports Tennis</em>."
    ],
    "image_url": "https://i.guim.co.uk/img/media/13efcc390acfaaeab091be9bc912b83d8d08026e/639_0_4305_3444/master/4305.jpg?width=140&quality=85&auto=format&fit=max&s=c98afaa0c6bf45b22f417973094c56f5",
    "titles": [
      "Raducanu ready for ‘fact-finding match’ against Sabalenka at Cincinnati Open",
      "Raducanu to face Sabalenka at Cincinnati Open on Monday evening"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.729,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary": "Emma Raducanu is set to play against Aryna Sabalenka, the world No 1, in the third round of the Cincinnati Open. The match is scheduled for Monday at 6pm and will be broadcast live on Sky Sports Tennis. Raducanu has expressed her excitement for the match, describing it as a \"fact-finding match.\" Meanwhile, Cameron Norrie has been eliminated from the tournament after losing to Roberto Bautista Agut.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens"
  },
  {
    "title": "Mark Cuban Stresses Research Quality for AI Edge Over China",
    "domain": "business",
    "location": "global",
    "published": "2025-08-11T05:50:21Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "\"The quality and depth of the research we do in this country can help us stay ahead of China and other countries in the AI race,\" Cuban said."
    ],
    "image_url": "https://i.insider.com/68996e93a17a8c5b40529f1a?format=jpeg",
    "titles": [
      "Mark Cuban says the US has got to keep investing in research if it wants to have a chance of beating China at AI"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.954,
      "consensus": 0.393,
      "constructiveness": 0.222,
      "proximity": 0.5
    },
    "score": 0.515,
    "summary": "Entrepreneur Mark Cuban emphasized the importance of research quality in maintaining a competitive edge in artificial intelligence (AI) against countries like China. Cuban highlighted the significance of robust research efforts to lead in the AI race.",
    "constructiveness_score": 0.222,
    "constructiveness_reason": "2 constructive keywords out of 36 tokens"
  },
  {
    "title": "Beijing Optimistic on U.S. Talks, Decision Awaits Trump",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 07:42:35 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Following the latest bilateral meeting in Stockholm in July, Beijing had struck an optimistic tone on an extension, while U.S. negotiators had put the ball in Trump's court."
    ],
    "image_url": "",
    "titles": [
      "U.S.-China high-stakes tariff truce extension hangs in the balance as deadline looms"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.497,
    "summary": "After a recent meeting in Stockholm, Beijing expressed optimism about extending negotiations with the U.S., while American negotiators have indicated that the decision now rests with President Trump. The outcome of the discussions remains pending as both sides await further developments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Nigerian profitable food delivery Chowdeck lands $9M from Novastar, Y Combinator",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 07:11:55 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Chowdeck, a Lagos-based food delivery startup that has stayed profitable in a notoriously tough and low-margin market, has raised $9 million in Series A funding to launch a quick commerce strategy and expand into more cities in Nigeria and Ghana. The equity round was led by Novastar Ventures, with p"
    ],
    "image_url": "",
    "titles": [
      "Nigerian profitable food delivery Chowdeck lands $9M from Novastar, Y Combinator"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "ETH Zurich Levitates Nano Spheres with Quantum Purity Using Light",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 01:10:09 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "ETH Zurich researchers levitated a nano glass sphere cluster with record-setting quantum purity at room temperature, avoiding costly cooling. Using optical tweezers, they isolated quantum zero-point motion, paving the way for future quantum sensors in navigation, medicine, and fundamental physics."
    ],
    "image_url": "",
    "titles": [
      "Scientists freeze quantum motion without cooling"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.941,
      "consensus": 0.393,
      "constructiveness": 0.133,
      "proximity": 0.5
    },
    "score": 0.49,
    "summary": "Researchers at ETH Zurich have successfully levitated a cluster of nano glass spheres with unprecedented quantum purity at room temperature, utilizing optical tweezers. This breakthrough avoids the need for expensive cooling methods. By isolating quantum zero-point motion, the team has opened new possibilities for the development of quantum sensors with potential applications in navigation, medicine, and fundamental physics research.",
    "constructiveness_score": 0.133,
    "constructiveness_reason": "2 constructive keywords out of 60 tokens"
  },
  {
    "title": "Nations Struggle to Agree on Global Plastic Pollution Treaty",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 03:34:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Countries remained at loggerheads Monday over how to tackle plastic pollution, with only four days left to craft a landmark global treaty on reining in the ever-growing scourge."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/countries-are-trying-t-1.jpg",
    "titles": [
      "Four days left to square the circle on global plastic pollution treaty"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Countries are still in disagreement on how to address plastic pollution as they work to finalize a global treaty within four days. The negotiations are ongoing, and a consensus has not yet been reached on how to effectively combat the increasing issue of plastic waste on a global scale.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens"
  },
  {
    "title": "AOL is finally shutting down dial-up",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-11T03:32:48-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AOL dial-up is ending on September 30th according to a statement posted on the company’s website. It marks the end of the service that was synonymous with the internet for many since its launch in 1991.  “AOL routinely evaluates its products and services and has decided to discontinue Dial-up Intern"
    ],
    "image_url": "",
    "titles": [
      "AOL is finally shutting down dial-up"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens"
  },
  {
    "title": "Laser Technology Reveals Hidden Ocean Surface Layer, Enhancing Marine Study",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 05:48:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/lasers-reveal-a-hidden-world-just-above-the-waves/\" rel=\"nofollow\" title=\"Lasers Reveal a Hidden World Just Above the Waves\"><img alt=\"Rolling Wave Bright Sky\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Rolling-Wav"
    ],
    "image_url": "",
    "titles": [
      "Lasers Reveal a Hidden World Just Above the Waves"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.954,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "Scientists have utilized laser technology to uncover a previously unseen layer of the ocean's surface, revealing intricate patterns and dynamics not visible to the naked eye. This breakthrough allows researchers to study marine environments with greater precision, potentially enhancing our understanding of oceanic processes and their impact on global climate systems. The study marks a significant advancement in oceanography, offering new insights into the complex interactions between the sea and the atmosphere.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens"
  },
  {
    "title": "First Direct Observation of Zero-Point Motion in Molecules Achieved",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 01:29:38 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Using the world’s most powerful X-ray laser, researchers have captured the hidden, never-ending vibrations of atoms inside molecules. This first-ever direct view of zero-point motion reveals that atoms move in precise, synchronized patterns, even in their lowest energy state."
    ],
    "image_url": "",
    "titles": [
      "Scientists capture the secret quantum dance of atoms for the first time"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary": "Researchers have utilized the world's most powerful X-ray laser to observe the zero-point motion within molecules, marking the first time this phenomenon has been directly viewed. They discovered that atoms exhibit synchronized, precise movements even in their lowest energy state, offering new insights into atomic behavior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens"
  },
  {
    "title": "Study Debunks Myth: No Creativity Difference Between Left and Right-Handed",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 05:23:20 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/100-years-of-data-shatter-the-creative-lefty-myth/\" rel=\"nofollow\" title=\"100 Years of Data Shatter the “Creative Lefty” Myth\"><img alt=\"Left Handed Creative Painter\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Left"
    ],
    "image_url": "",
    "titles": [
      "100 Years of Data Shatter the “Creative Lefty” Myth"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.945,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "A comprehensive analysis of 100 years of data has debunked the myth that left-handed individuals are inherently more creative than right-handed people. This extensive study, utilizing a century's worth of information, conclusively demonstrates that there is no significant difference in creativity levels between left-handed and right-handed people, challenging long-held beliefs about the correlation between handedness and creative abilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens"
  },
  {
    "title": "Early Human Diet Shift to Meat Key to Evolution, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 04:58:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-shocking-diet-that-fueled-human-evolution/\" rel=\"nofollow\" title=\"The Shocking Diet That Fueled Human Evolution\"><img alt=\"Three Skulls Hominin Teeth\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Three-Skulls-Hom"
    ],
    "image_url": "",
    "titles": [
      "The Shocking Diet That Fueled Human Evolution"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary": "Researchers have identified that a significant shift in the diet of early humans played a crucial role in human evolution. The study, focusing on the analysis of hominin teeth, suggests that incorporating meat into their diet allowed early humans to develop better tools, larger brains, and more complex social structures. This dietary change is considered a pivotal moment that contributed to the advancement of human species.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "Study Explains Why Humans See Faces in Objects Due to Brain's Bias",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 23:21:31 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/why-your-brain-sees-faces-everywhere-and-cant-look-away/\" rel=\"nofollow\" title=\"Why Your Brain Sees Faces Everywhere and Can’t Look Away\"><img alt=\"Coffee Face Scream\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Cof"
    ],
    "image_url": "",
    "titles": [
      "Why Your Brain Sees Faces Everywhere and Can’t Look Away"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.834,
      "consensus": 0.393,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.467,
    "summary": "Research explains why humans tend to see faces in everyday objects, a phenomenon known as pareidolia. This tendency is rooted in the brain's overactive facial recognition system. The study highlights that recognizing faces quickly is crucial for social interaction and survival, leading our brains to err on the side of caution by sometimes seeing faces where there are none. This insight sheds light on human evolution and the importance of faces in social communication.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 75 tokens"
  },
  {
    "title": "Security flaws in a carmaker’s web portal let one hacker remotely unlock cars from anywhere",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 00:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Security researcher Eaton Zveare told TechCrunch that the flaws he discovered in the carmaker's centralized dealer portal exposed vast access to customer and vehicle data. With this access, Zveare said he could remotely take over a customer's account and unlock their cars, and more."
    ],
    "image_url": "",
    "titles": [
      "Security flaws in a carmaker’s web portal let one hacker remotely unlock cars from anywhere"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.845,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.457,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 16 tokens"
  },
  {
    "title": "Why investors just bet $85M on this Indian company’s generic drug strategy",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 23:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Truemeds has taken a different route from other Indian online pharmacies — and it has helped the startup double its revenue."
    ],
    "image_url": "",
    "titles": [
      "Why investors just bet $85M on this Indian company’s generic drug strategy"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.836,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "Breakthrough in Egg Freezing Enhances Fertility Preservation",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:56:06 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/frozen-in-time-the-hidden-trick-that-keeps-human-eggs-alive-for-decades/\" rel=\"nofollow\" title=\"Frozen in Time: The Hidden Trick That Keeps Human Eggs Alive for Decades\"><img alt=\"Early Stage Embryo\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"htt"
    ],
    "image_url": "",
    "titles": [
      "Frozen in Time: The Hidden Trick That Keeps Human Eggs Alive for Decades"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.826,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary": "Scientists have discovered a mechanism that allows human eggs to remain viable for decades when frozen. This process, essential for fertility preservation, involves a unique cellular structure that protects the eggs from damage over time. This breakthrough could significantly enhance fertility treatments and egg banking, offering hope to those looking to conceive later in life.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "The hidden cost of living amid Mark Zuckerberg’s $110M compound",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 19:59:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Mark Zuckerberg has spent 14 years gobbling up his leafy Palo Alto neighborhood, according to a New York Times report detailing how the Meta CEO has purchased 11 properties for over $110 million to create his own personal fiefdom in Crescent Park. The piecemeal compound features a main residence, gu"
    ],
    "image_url": "",
    "titles": [
      "The hidden cost of living amid Mark Zuckerberg’s $110M compound"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.777,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.444,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "The computer science dream has become a nightmare",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:59:42 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Well, the coding-equals-prosperity promise has officially collapsed. Fresh computer science graduates are facing unemployment rates of 6.1% to 7.5% &#8212; more than double what biology and art history majors are experiencing, according to a recent Federal Reserve Bank of New York study. A crushing "
    ],
    "image_url": "",
    "titles": [
      "The computer science dream has become a nightmare"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.761,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.44,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  },
  {
    "title": "Stanford sticks with legacy admissions",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:18:08 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Stanford University has confirmed its admissions policies for fall 2026 will continue considering legacy status, a decision that could influence access to one of Silicon Valley&#8217;s most important talent pipelines. Stanford is also ending its test-optional policy, requiring SAT or ACT scores for "
    ],
    "image_url": "",
    "titles": [
      "Stanford sticks with legacy admissions"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.75,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.438,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 5 tokens"
  },
  {
    "title": "We found stuff AI is pretty good at",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Tech companies keep telling everyone that this or that AI feature is going to change everything. But when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster. Sometimes AI tools feel so open-ended, it's hard to know where to st"
    ],
    "image_url": "",
    "titles": [
      "We found stuff AI is pretty good at"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.7,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.435,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  }
]