[
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a challenging yet rewarding experience. The game has been praised for its precision in gameplay, marking a significant achievement for the Assassin's Creed franchise."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9973331437962963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4593332859490741,
    "summary": "Assassin's Creed Shadows has been released, featuring enhanced stealth and assassination gameplay. Critics have commended the game for its precise mechanics, noting it as a significant advancement for the Assassin's Creed series."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is presented as a gaming-focused alternative to the MacBook Pro, featuring a return to a thinner and lighter chassis design after the previous generation's bulkier build. This laptop aims to combine gaming performance with a more conventional laptop appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9556664765625,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.448916619140625,
    "summary": "The Razer Blade 16 is introduced as a gaming laptop with a design focus on being thinner and lighter compared to its previous generation, positioning itself as an alternative to the MacBook Pro. It aims to blend gaming performance with the aesthetics of a more traditional laptop."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various settings needing additional light. It is rechargeable, compact, and features three adjustable LED panels that emit 3000 lumens, making it ideal for use at campsites, workspaces, or for mechanical work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6717312909722222,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3779328227430555,
    "summary": "BougeRV has released a new LED lantern designed for outdoor camping that doubles as a work lamp for various environments. It is rechargeable and compact, with three adjustable panels that provide 3000 lumens of light, suitable for campsites, workspaces, and mechanical tasks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of a court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.33796971648148155,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.29449242912037044,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) until a court case decision is made."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has announced in its latest Windows 11 Insider Preview that it will remove a script that allowed users to bypass the requirement of connecting to the internet and logging in during setup. This change reinforces the necessity for all Windows 11 devices to be set up with an internet-connected account."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3339766604861111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2934941651215278,
    "summary": "Microsoft is updating Windows 11 to eliminate a script that let users skip internet and login requirements during setup, as revealed in the latest Insider Preview. This update mandates all Windows 11 devices to be configured with an internet-connected account."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will continue until Monday, March 31st. The sale features dozens of deals across a range of products, accessible without needing an Amazon Prime membership. A comprehensive roundup includes over 100 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.32570119711805556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2914252992795139,
    "summary": "Amazon is hosting its Big Spring Sale, ending on March 31st, offering numerous deals across various products. The sale is open to all customers, not just Amazon Prime members. A roundup highlights over 100 deals on popular items and affordable alternatives."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has purchased the social media platform X (previously Twitter) in an all-stock deal. xAI was valued at $80 billion and X at $33 billion, which includes $12 billion in debt. This acquisition comes years after Musk originally bought Twitter for $44 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.31974054855324086,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2899351371383102,
    "summary": "Elon Musk's AI company, xAI, acquired the social media platform X (formerly Twitter) in an all-stock transaction. xAI was valued at $80 billion and X at $33 billion, encompassing $12 billion in debt. This deal follows Musk's initial purchase of Twitter for $44 billion years earlier."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature, announced last year, enables IT professionals to remotely recover devices that won't boot, aiming to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.31235628885416666,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.28808907221354163,
    "summary": "Microsoft is testing a new feature called Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11, designed to help IT professionals remotely recover non-booting devices. This development aims to mitigate issues like those experienced during the previous year's Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, following its acquisition of Fitbit in early 2021. Initially, users were required to make the switch by 2025. This update was communicated to Fitbit users via email."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.29624517730324074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2840612943258102,
    "summary": "Google has postponed the deadline for Fitbit users to transition their accounts to Google accounts to next year, following its acquisition of Fitbit in 2021. Originally set for 2025, the extension was announced to users through email."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer ties with the Trump administration following challenges in international negotiations. Initially sponsored by Nauru, TMC's efforts in 2021 sparked a rush to establish mining regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.2858053620833334,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2814513405208333,
    "summary": "The Metals Company (TMC), focusing on deep-sea mining, sought to strengthen connections with the Trump administration after facing difficulties in global discussions. Initially backed by Nauru in 2021, TMC's actions led to an urgent push to create regulations for deep-sea mining."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers are currently engaged in efforts to rescue individuals trapped in the rubble of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescue teams are actively working to save people trapped under the debris of a tower that fell on Friday."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has resulted in 21 people being injured and caused a restaurant along with several other buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple other buildings, local officials reported."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 10:58:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit of the US Vice President and other top officials, describing it as a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards the visit by the US Vice President and other high-ranking officials, labeling it as a demonstration of \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive\" and announced plans for a meeting with Canadian leaders post the country's elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as highly successful and revealed intentions to hold a meeting with Canadian officials after the country's elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, detailing the emotional turmoil they face due to the disappearance of their loved ones."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing persons in Antigua have expressed their emotional distress to the BBC over the disappearances of their loved ones, highlighting the significant impact these incidents have on their lives."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, a public figure, has been criticized for wearing a disguise during a television appearance to promote his own book. This incident has sparked controversy and discussions about his actions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise on TV to promote his book, sparking debate over his actions."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed against a controversial influencer, accusing him of assault and threats during an incident in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a controversial influencer of assault and threats in Beverly Hills, which the influencer denies."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from celebrities such as Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy apologized after receiving criticism from notable actors including Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey this week following their coverage of mass protests happening in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey after reporting on widespread protests in the country."
  },
  {
    "title": "Top US vaccine official forced to resign, reports say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 03:05:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Peter Marks resigned from his position, citing in his resignation letter that his new boss, Robert F Kennedy Jr, supports \"misinformation and lies.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Peter Marks resigned from his position due to disagreements with his new boss, Robert F Kennedy Jr, who he accuses of supporting misinformation and lies, as stated in his resignation letter."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. This action took place just hours after the rocket attack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah location in response to two rockets fired from southern Lebanon into northern Israel. The strike occurred hours after the rocket launch."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:00:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's massive impact was due to its magnitude and the extent of the fault line it happened along, leading to significant devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake caused widespread destruction due to its high magnitude and the large area of the fault line involved."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:34:05 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A major earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing widespread destruction in the area."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the sale price of his work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan. The crew successfully completed the mission despite coming under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew was commended for successfully carrying out an evacuation mission at a South Sudan military base, despite being under attack."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further rises, according to a car seller speaking to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have significantly increased, with further rises anticipated, a car seller told the BBC."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere globally, but some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday due to a powerful earthquake originating from neighboring Myanmar. Dozens of people are currently unaccounted for following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to a powerful earthquake from neighboring Myanmar, leaving dozens of people unaccounted for."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Lack of equipment stalls race to save earthquake survivors in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 12:28:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Mandalay, significant destruction has occurred, leaving survivors in urgent need of assistance from the military government."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Mandalay, substantial damage has resulted in survivors requiring immediate aid from the military government."
  },
  {
    "title": "Why can’t we remember our early years? Do babies make memories at all?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:22:26 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have for the first time observed the formation of memories in real time within the brains of babies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have observed the formation of memories in real-time in baby brains for the first time."
  },
  {
    "title": "Rival rallies erupt in South Korea over President Yoon’s impeachment",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:04:01 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Seoul, supporters and critics of Yoon Suk Yeol have gathered in public demonstrations amidst his impeachment trial."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Seoul, public demonstrations have taken place involving both supporters and critics of Yoon Suk Yeol during his impeachment trial."
  },
  {
    "title": "Is Sudan’s war merging with South Sudanese conflicts?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:50:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The conflict in Sudan is extending into South Sudan, with the Sudanese army and the Rapid Support Forces (RSF) looking for new allies and proxy groups in the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The conflict in Sudan has spread into South Sudan as the Sudanese army and the Rapid Support Forces (RSF) seek new allies and proxy groups in the neighboring region."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that mutations in VPS35, a crucial component in a pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapy treatments. This finding could aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that mutations in the VPS35 gene, which is involved in a process that uses reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy. This discovery may help in identifying tumors that will not respond to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study reveals that over 50% of US adults have faced discrimination. Those highly exposed to such treatment are over five times more likely to show signs of depression and anxiety. Furthermore, individuals experiencing discrimination are nearly nine times more likely to test positive for both mental health issues compared to those who haven't faced discrimination."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study finds that over half of US adults have experienced discrimination, with those highly exposed being over five times more likely to exhibit depression and anxiety symptoms. Additionally, those facing discrimination are nearly nine times more likely to have both mental health issues compared to individuals who haven't experienced discrimination."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new 3D printed hydrogel designed for meniscal tear treatment showed promising results in preclinical trials, effectively addressing various types of tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new 3D printed hydrogel designed to treat meniscal tears has shown promising outcomes in preclinical trials, successfully targeting different types of tears."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study found that immersing in cold water for seven days can boost cellular resilience and autophagic function, which helps cells better manage stress. This adaptation may improve health, potentially prevent diseases, and slow aging at the cellular level."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study revealed that cold water immersion for seven consecutive days enhances cellular resilience and autophagic function, aiding cells in stress management. This adaptation could potentially enhance health, prevent diseases, and decelerate aging at the cellular level."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Approximately one-third of women ages 14-49 in the U.S. experience bacterial vaginosis (BV), a condition with symptoms like unpleasant odors and potential pain. Over half of those treated with the standard antibiotic, metronidazole, face recurrence. Researchers have now created a DNA PCR-based lab test aimed at improving treatment by identifying the specific bacteria causing the infection, allowing for more personalized medication prescriptions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In the U.S., around one-third of women aged 14-49 suffer from bacterial vaginosis (BV), often experiencing symptoms such as unpleasant odors and pain. Standard treatment with metronidazole leads to recurrence in over half of the cases. To enhance treatment efficacy, researchers have developed a DNA PCR-based lab test that identifies the specific bacteria responsible for BV, enabling more tailored medication prescriptions."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study on improving camera trap effectiveness for weasels found that using red meat as bait, enhanced with scent oils, is more effective than other materials. This discovery aids conservationists in tracking weasel populations more accurately."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study has found that using red meat bait, enhanced with scent oils, significantly improves the effectiveness of camera traps in tracking weasels. This method aids conservationists in more accurately monitoring weasel populations."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that can learn independently, closely mimicking biological neurons. These \"infomorphic neurons\" form artificial neural networks, learning in a self-organized manner by extracting information from their surrounding network environment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created \"infomorphic neurons,\" a new type of artificial neuron that can independently learn, closely resembling the function of biological neurons. These neurons form networks that learn by self-organization, extracting information from their environment."
  },
  {
    "title": "Brain channels 'stopped in time' reveal chemical flow that enables learning and thinking",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 13:49:00 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study has identified signaling channels that could lead to the creation of drugs aimed at treating conditions like epilepsy and certain intellectual disorders. This research may enhance the development of medications that either block or activate these channels."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has discovered signaling channels that could pave the way for new drugs targeting epilepsy and some intellectual disorders. This research holds potential for the development of treatments that can block or activate these channels, offering new hope for managing these conditions."
  },
  {
    "title": "Smart textiles and surfaces: How lightweight elastomer films are bringing tech to life",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed thin silicone films that, when an electrical voltage is applied, can vibrate, flex, press, or pull with precision. This technology enables the creation of clothing that simulates touch, touch displays with haptic feedback, and ultralight loudspeakers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created thin silicone films that can move precisely when electrified, allowing for the development of clothes that mimic touch, touch displays with haptic feedback, and lightweight loudspeakers."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a growth factor cocktail that successfully reversed potentially fatal cell damage in mice infected with anthrax. This finding suggests the potential for adapting this treatment for use in humans."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a treatment that reversed severe cell damage in mice with anthrax, indicating it might be adapted for human use in the future."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created a new AI and machine learning-based model that improves predictions on chemotherapy responses in muscle-invasive bladder cancer patients. This model combines whole-slide tumor imaging data with gene expression analyses, achieving better accuracy than former models that relied on a single type of data."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed an AI and machine learning model that enhances the accuracy of predicting chemotherapy responses in muscle-invasive bladder cancer patients. This advanced model integrates whole-slide tumor imaging with gene expression analyses, outperforming previous models that used only one data type."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a direct connection between dopamine levels and cognitive flexibility, revealing that increased dopamine production in the brain improves performance on challenging tasks. This finding, achieved through PET imaging, could lead to more targeted treatments for neurological and psychiatric conditions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have found a direct link between dopamine levels in the brain and cognitive flexibility, showing that higher dopamine production can enhance performance on difficult tasks. This discovery, made using PET imaging, opens the door to more precise treatments for neurological and psychiatric disorders."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of Toxoplasma gondii, a parasite. This insight could help understand how to control latency in other nervous system infections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can recognize and regulate the inactive stage of the parasite Toxoplasma gondii. This discovery may aid in understanding how to manage dormant infections in the nervous system."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing nearly 270,000 seed plant species globally has identified environmental conditions and dispersal barriers as key factors influencing plant diversity and distribution. The research sheds light on why certain plants thrive in specific regions, examining how these patterns have evolved over millions of years."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species has found that environmental conditions and dispersal barriers significantly affect plant diversity and distribution. This research helps explain why certain plants are found in specific areas, looking at how these patterns have developed over millions of years."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:55:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Auburn and Houston secured victories in their respective games on Friday night. The event featured comprehensive analysis of both teams' performances, offering insights into the key moments and strategies that led to their wins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Auburn and Houston won their games on Friday, with detailed analyses highlighting the strategies and key moments that contributed to their victories."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:30:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A flawlessly performed inbounds play led to No. 1 Houston defeating Purdue with a score of 62-60, securing their place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston advanced to the Elite Eight by defeating Purdue 62-60, thanks to a perfectly executed inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts led UCLA to a 76-62 win against Ole Miss with a performance of 31 points and 10 rebounds. This victory advances UCLA to the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off home run on Friday, marking a significant moment after an emotional start to the season. Betts had lost nearly 20 pounds due to an illness prior to this achievement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, achieving a significant milestone following a challenging start to the season where he lost nearly 20 pounds because of an illness."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and secured 19 rebounds, leading LSU to an 80-73 victory over NC State, marking LSU's third consecutive Elite Eight appearance in the tournament. This performance was crucial as teammate Flau'Jae Johnson faced difficulties during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow led LSU to an 80-73 win over NC State with 30 points and 19 rebounds, securing their third straight Elite Eight spot in the tournament. This was especially significant as teammate Flau'Jae Johnson struggled in the game."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater from online bullying, stating she didn't see JuJu Watkins' ACL tear as resulting from a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State player Chandler Prater against online bullying, stating that JuJu Watkins' ACL injury was not caused by a dirty play."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' comment suggesting Antetokounmpo could score 250 points in a 1970s game by stating comparisons between the current era and that time are not valid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo disagreed with LeBron James' suggestion that he could score 250 points in a 1970s basketball game, stating that comparisons between today's game and that era are not valid."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu became the first American woman to win the world figure skating championship since 2006, ending Kaori Sakamoto's three-year reign as champion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu won the world figure skating championship, becoming the first American woman to do so since 2006, and ending Kaori Sakamoto's three-year championship streak."
  },
  {
    "title": "UCLA lands MWC Player of Year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Guard Donovan Dent, previously with New Mexico where he averaged 20.4 points and 6.5 assists per game this season, has committed to UCLA following his entry into the transfer portal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Guard Donovan Dent, formerly of New Mexico, where he averaged 20.4 points and 6.5 assists per game this season, has transferred to UCLA."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:28:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have been completed. This phase of the tournament highlights the top 16 teams competing for a spot in the next round."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has advanced to the Sweet 16, with the first four games already concluded. This stage showcases the top 16 teams vying for a place in the subsequent round."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:39:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has concluded, leading to a shift in focus towards future team development. The emphasis will now be on prioritizing transfers through the portal and integrating incoming recruits to strengthen the Wolfpack for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has ended, and the team is now concentrating on improving for the next season. Their strategy involves focusing on acquiring transfers and blending in new recruits to enhance the team's performance."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:29:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article discusses the implications of various matchups, including their impact on playoff projections and draft lottery standings. It provides updated information on the competitive landscape, highlighting what is at stake for teams involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article examines the effects of different sports matchups on playoff projections and draft lottery standings, offering updated insights into the competitive dynamics and stakes for the teams involved."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:29:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has completed its voting, outlining team rankings and their schedules up until April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's details have been clarified following the completion of voting by a panel, which has ranked teams and outlined their schedules leading up to April 17."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day within a four-day period."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' ballpark was prepared for Opening Day at the Yankees' spring training facility in just four days, showcasing a rapid transformation of the venue."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:47:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's basketball team toward a championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are pivotal figures driving Notre Dame's basketball team in their pursuit of a championship."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting information, including lines, spreads, and totals, along with Basketball Power Index (BPI) ratings, has been released for every game in the Women's basketball tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting details and Basketball Power Index (BPI) ratings for all games in the Women's basketball tournament have been made available, covering lines, spreads, and totals for each match."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL are aiming to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are competing to overtake Birmingham, the current league leader."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson. A jury awarded Gleeson over $20 million in damages."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, with a jury awarding him over $20 million in damages."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna appealed to the Spanish football federation (RFEF) on Friday, arguing that Barcelona improperly played defender Iñigo Martínez in their LaLiga match due to a technicality related to his absence from Spain's games because of an injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna filed an appeal with the Spanish Football Federation (RFEF) claiming Barcelona fielded defender Iñigo Martínez improperly in their LaLiga match. The appeal is based on a technicality regarding Martínez's participation following an injury that kept him out of Spain's games."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 match against the Houston Dash on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, injured her left knee in a 0-0 game against Houston Dash. She will have her knee evaluated."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo have called on FIFA to reassess its decision to exclude the Mexican team from the Club World Cup. They made their appeal on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo appealed to FIFA on Friday to reconsider its decision to bar the Mexican team from participating in the Club World Cup."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian Soccer Federation due to a severe knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian Soccer Federation following a severe knee injury suffered by player Alphonso Davies."
  },
  {
    "title": "Herdman reprimanded in Canada drone scandal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 08:22:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Canada soccer coach John Herdman received a written reprimand after a disciplinary hearing found him involved in a drone-spying incident at the Paris Olympics."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Canada soccer coach John Herdman was issued a written reprimand following a disciplinary hearing that determined his involvement in a drone-spying incident during the Paris Olympics."
  }
]