[
  {
    "title": "White House acknowledges problems in RFK Jr.'s 'Make America Healthy Again' report",
    "domain": "general",
    "location": "national",
    "published": "Thu, 29 May 2025 23:50:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR"
    ],
    "snippets": [
      "HHS Secretary Robert F. Kennedy Jr.'s \"Make America Healthy Again\" report cited hundreds of studies, but a closer look by the news organization NOTUS found that some of those studies did not exist."
    ],
    "image_url": "",
    "titles": [
      "White House acknowledges problems in RFK Jr.'s 'Make America Healthy Again' report"
    ],
    "summary": "A review by NOTUS of HHS Secretary Robert F. Kennedy Jr.'s \"Make America Healthy Again\" report found discrepancies, revealing that some of the hundreds of studies cited in the document do not exist. This raises questions about the report's accuracy and reliability.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the credibility of a report from a high-ranking official. It contributes to the reader's understanding of the situation and the need for accurate information in decision-making. However, it does not highlight progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.546,
    "normalized_score": 4.75
  },
  {
    "title": "IT specialist placed thumb drive with classified info in Virginia park: Court docs",
    "domain": "general",
    "location": "national",
    "published": "Thu, 29 May 2025 23:42:07 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "An IT specialist employed by the Defense Intelligence Agency has been charged with attempting to provide classified information to a friendly foreign government."
    ],
    "image_url": "https://s.abcnews.com/images/US/doj-gty-er-240906_1725656523984_hpMain_4x3t_384.jpg",
    "titles": [
      "IT specialist placed thumb drive with classified info in Virginia park: Court docs"
    ],
    "summary": "An IT specialist working for the Defense Intelligence Agency has been officially charged for trying to give classified information to a government considered friendly to the United States.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story offers basic awareness about a specific security breach, it does not provide deeper insight or understanding about the broader issues related to data security or espionage. It also does not report on solutions or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.507,
    "normalized_score": 2.28
  },
  {
    "title": "World has responsibility to get aid into Gaza, UN official tells BBC",
    "domain": "general",
    "location": "global",
    "published": "Thu, 29 May 2025 23:11:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The UN's Tom Fletcher tells the BBC the people of Gaza have been subjected to forced starvation by Israel."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/163b/live/b497d120-3cde-11f0-b6e6-4ddb91039da1.jpg",
    "titles": [
      "World has responsibility to get aid into Gaza, UN official tells BBC"
    ],
    "summary": "Tom Fletcher of the UN reported to the BBC that Israel has subjected the people of Gaza to forced starvation. This statement highlights the severity of the humanitarian issues facing Gaza's population as conveyed by a UN representative.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases clarity around the humanitarian crisis in Gaza, informing readers about the severity of the situation and the international responsibility to provide aid. However, it does not clearly highlight solutions or progress towards resolving the issue.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.876,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.546,
    "normalized_score": 4.75
  },
  {
    "title": "The new Covid variant NB.1.8.1 is driving infections in Australia. A virologist explains what you need to know | Lara Herrero for the Conversation",
    "domain": "general",
    "location": "global",
    "published": "Thu, 29 May 2025 23:04:57 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Evidence so far suggests NB.1.8.1 may spread more easily and partially sidestep immunity from prior infections or vaccination</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/may/30/australia-news-live-burrup-gas-north-west-shelf-woodside-greens-vaping-bradfield-count-ntwnfb\">Australia news live: latest politics updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>As we enter the colder months in Australia, Covid is <a href=\"https://www.perthnow.com.au/news/public-health/covid-19-new-subvariant-nb181-driving-increase-in-infections-in-wa-c-18801659\">making headlines</a> again, this time due to the emergence of a new variant: NB.1.8.1.</p><p>Last week, the <a href=\"https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf\">World Health Organization</a> designated NB.1.8.1 as a <a href=\"https://www.who.int/activities/tracking-SARS-CoV-2-variants\">“variant under monitoring”</a>, owing to its growing global spread and some notable characteristics which could set it apart from earlier variants.</p> <a href=\"https://www.theguardian.com/world/2025/may/30/new-covid-variant-australia-nb181\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/086d344cf30370bf88d883fe5545ccadff1ad2bf/0_0_3687_2949/master/3687.jpg?width=140&quality=85&auto=format&fit=max&s=29c20076d4a21dabe46a7226378c7a2e",
    "titles": [
      "The new Covid variant NB.1.8.1 is driving infections in Australia. A virologist explains what you need to know | Lara Herrero for the Conversation"
    ],
    "summary": "The new COVID-19 variant, NB.1.8.1, is gaining attention as it may spread more easily and could potentially evade immunity from previous infections or vaccinations. The World Health Organization has classified it as a \"variant under monitoring\" due to its increasing global presence and distinct characteristics. This development comes as Australia enters its colder months, witnessing a rise in COVID-19 cases linked to this variant.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new Covid-19 variant, helping readers understand the current situation and potential risks. However, it does not mention any solutions or progress in dealing with this variant, hence it does not score higher.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.875,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.546,
    "normalized_score": 4.75
  },
  {
    "title": "New AI test can predict which men will benefit from prostate cancer drug",
    "domain": "general",
    "location": "global",
    "published": "Thu, 29 May 2025 23:01:37 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Artificial intelligence tool determines best candidates to take abiraterone, which can halve risk of death from disease</p><p>Doctors have developed an artificial intelligence tool that can predict which men with prostate cancer will benefit from a drug that halves the risk of dying.</p><p>Abiraterone has been described as a “gamechanger” treatment for the disease, which is the most common form of cancer in men in more than 100 countries. It has already helped hundreds of thousands with advanced prostate cancer to live longer.</p> <a href=\"https://www.theguardian.com/society/2025/may/30/new-ai-test-can-predict-which-men-will-benefit-from-prostate-cancer-drug\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/5eb2c87ce61ff33102cd970f602ae008ec65efa6/805_0_4027_3222/master/4027.jpg?width=140&quality=85&auto=format&fit=max&s=be5ae846a23447243b0aa61a22f9ceae",
    "titles": [
      "New AI test can predict which men will benefit from prostate cancer drug"
    ],
    "summary": "Doctors have developed an AI tool capable of predicting which prostate cancer patients will benefit from abiraterone, a treatment known to reduce the risk of death by half. Abiraterone is hailed as a significant advancement for the most common cancer in men across over 100 countries, extending the lives of hundreds of thousands with advanced stages of the disease.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only provides a deeper understanding of a new AI tool and its potential benefits for prostate cancer patients, but also highlights progress and innovation in the medical field. This information could empower readers, especially those affected by prostate cancer, to make informed decisions about their treatment options.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.874,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.566,
    "normalized_score": 6.01
  },
  {
    "title": "Missouri's Eli Drinkwitz laments consecutive Big Ten national championships, SEC shortcomings: 'It bothers us'",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 29 May 2025 23:57:55 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "SEC football is in the midst of its longest national championship drought in a decade"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/29/d89e7cca-277e-4dd1-901c-12523113d210/adobe-express-file.jpg",
    "titles": [
      "Missouri's Eli Drinkwitz laments consecutive Big Ten national championships, SEC shortcomings: 'It bothers us'"
    ],
    "summary": "The SEC, a collegiate athletic conference, is currently experiencing its longest national championship drought in football in ten years. This marks a significant shift for a conference traditionally known for its strong football programs and frequent championship victories.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of the current state of collegiate football championships, it lacks depth and insight. It does not provide actionable insights for the reader, nor does it highlight any solutions or improvements to the situation. The focus is mainly on the SEC's shortcomings, which doesn't contribute meaningfully to the reader's understanding or decision-making.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.887,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.472,
    "normalized_score": 0.06
  },
  {
    "title": "Ohtani scores 170 runs? Royals have a top-10 starting pitcher? Don't be surprised",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 29 May 2025 23:52:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Eric Karabell looks into the crystal ball to tell fantasy baseball managers what might come to pass in the not-too-distant future."
    ],
    "image_url": "",
    "titles": [
      "Ohtani scores 170 runs? Royals have a top-10 starting pitcher? Don't be surprised"
    ],
    "summary": "Eric Karabell offers predictions for future fantasy baseball trends and outcomes to assist managers in making informed decisions. His insights aim to guide players through potential scenarios that could impact their strategy and success in the game.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides actionable insights for fantasy baseball managers, giving them a deeper understanding of potential trends and outcomes. However, it doesn't report on solutions or improvements, and the awareness it provides is specific to the niche audience of fantasy baseball players.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.886,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.511,
    "normalized_score": 2.53
  },
  {
    "title": "Rankings: Napheesa Collier jumps Caitlin Clark",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 29 May 2025 23:52:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Fantasy women's basketball rankings for 2025 with A'ja Wilson, Napheesa Collier and Caitlin Clark as the top three."
    ],
    "image_url": "",
    "titles": [
      "Rankings: Napheesa Collier jumps Caitlin Clark"
    ],
    "summary": "In the 2025 fantasy women's basketball rankings, A'ja Wilson, Napheesa Collier, and Caitlin Clark are ranked as the top three players. This list serves as a guide for fantasy basketball enthusiasts, highlighting these athletes as key picks for their fantasy teams.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information for fantasy basketball enthusiasts, helping them make informed decisions about their teams. It doesn't highlight progress or solutions, and the awareness it provides is limited to the context of fantasy basketball.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.886,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.519,
    "normalized_score": 3.04
  },
  {
    "title": "Sources: Chelsea to beat Man Utd to Delap signing",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 29 May 2025 23:44:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Chelsea have beaten Manchester United to the £30 million signing of Liam Delap with sources telling ESPN, with a deal close to being finalised."
    ],
    "image_url": "",
    "titles": [
      "Sources: Chelsea to beat Man Utd to Delap signing"
    ],
    "summary": "Chelsea have successfully secured the signing of Liam Delap for £30 million, outbidding Manchester United. According to ESPN sources, the deal is nearing completion.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about a recent development in the football world, it doesn't offer actionable insights or a deeper understanding of the situation. It also doesn't report on progress, solutions, or improvements, and the awareness it provides is limited to the specific event of Liam Delap's signing.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.884,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.0
  },
  {
    "title": "Milan fire Conceição, reportedly line up Allegri",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 29 May 2025 23:44:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "AC Milan fired Sergio Conceicao as expected on Thursday following a disappointing season that saw the Rossoneri fail to qualify for Europe."
    ],
    "image_url": "",
    "titles": [
      "Milan fire Conceição, reportedly line up Allegri"
    ],
    "summary": "AC Milan dismissed coach Sergio Conceicao on Thursday due to the team's underperformance, resulting in their failure to qualify for European competitions this season.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the dismissal of AC Milan's coach due to the team's underperformance. However, it does not offer any deeper insights or solutions to the issue.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.884,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.0
  },
  {
    "title": "Here's what impressed us most about Costco's earnings beat in a tariff-filled world",
    "domain": "business",
    "location": "national",
    "published": "Thu, 29 May 2025 23:40:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "After a surprising earnings miss last time around, Costco delivered on Thursday night."
    ],
    "image_url": "",
    "titles": [
      "Here's what impressed us most about Costco's earnings beat in a tariff-filled world"
    ],
    "summary": "Costco reported its earnings on Thursday, showing a rebound from its previous surprising miss. The outcome indicates an improvement in the company's financial performance.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Costco's financial performance and how it has improved despite the challenges posed by tariffs. It gives readers a deeper understanding of the company's situation, but it doesn't highlight a solution or innovation.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.548,
    "normalized_score": 4.87
  },
  {
    "title": "AI deepfakes pose ‘significant’ risk to ‘identity systems upon which our entire economy relies,’ warns fintech CEO",
    "domain": "business",
    "location": "global",
    "published": "Thu, 29 May 2025 23:36:26 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Scammers can now use AI tools to generate multiple live video fakes of real people—and request money transfers."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/54533838837_52914157a3_o-e1748560311489.jpg?w=2048",
    "titles": [
      "AI deepfakes pose ‘significant’ risk to ‘identity systems upon which our entire economy relies,’ warns fintech CEO"
    ],
    "summary": "Scammers are utilizing advanced AI tools to create realistic live video fakes of actual individuals. These counterfeit videos are then used to solicit money transfers from victims. This development in scam tactics represents a significant escalation in the sophistication of online fraud.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the increasing risk of AI deepfakes in online fraud, providing useful context for understanding this emerging threat. However, it does not report on any solutions or improvements to address this problem.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.882,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.528,
    "normalized_score": 3.61
  },
  {
    "title": "Costco tops earnings and revenue estimates as sales jump 8%, shares still dip",
    "domain": "business",
    "location": "national",
    "published": "Thu, 29 May 2025 23:11:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Costco is poised to benefit from tariff volatility as it offers competitive prices and bulk discounts."
    ],
    "image_url": "",
    "titles": [
      "Costco tops earnings and revenue estimates as sales jump 8%, shares still dip"
    ],
    "summary": "Costco is set to gain from fluctuations in tariffs due to its strategy of providing competitive prices and bulk purchase discounts. This approach positions the retailer to attract customers looking for value amid changing tariff landscapes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Costco's financial performance and its strategy to handle tariff fluctuations. However, it doesn't delve into any solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.876,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.518,
    "normalized_score": 2.97
  },
  {
    "title": "Musk's SpaceX town in Texas warns residents they may lose right to 'continue using' their property",
    "domain": "business",
    "location": "national",
    "published": "Thu, 29 May 2025 23:07:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Starbase was officially formed earlier this month after Elon Musk's aerospace and defense contractor prevailed in a local election."
    ],
    "image_url": "",
    "titles": [
      "Musk's SpaceX town in Texas warns residents they may lose right to 'continue using' their property"
    ],
    "summary": "Elon Musk's aerospace and defense contractor company successfully won a local election, leading to the official formation of Starbase earlier this month.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about SpaceX's recent local election victory and the potential implications for residents. However, it lacks depth and doesn't offer actionable insights or a deeper understanding of the situation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.875,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.508,
    "normalized_score": 2.34
  },
  {
    "title": "Ava Max Says She’s ‘Lovin’ Myself’ On New Single",
    "domain": "business",
    "location": "global",
    "published": "Thu, 29 May 2025 23:00:29 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "Ava Max is gearing up for her new album 'Don't Click Play' with the new single \"Lovin' Myself.\""
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6836440e8340df1dad23016e/0x0.jpg?width=960",
    "titles": [
      "Ava Max Says She’s ‘Lovin’ Myself’ On New Single"
    ],
    "summary": "Ava Max is preparing to release her new album titled 'Don't Click Play' and has introduced the album with a new single called \"Lovin' Myself.\" This marks the latest project from the pop artist as she continues to build her music career.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Ava Max's new single and upcoming album, but it doesn't provide deeper insights or understanding, nor does it report on solutions, improvements, or attempts to solve problems. It also doesn't increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.929,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 2.09
  },
  {
    "title": "Scientists Discover Violation of 1931 Thermodynamic Principle",
    "domain": "science",
    "location": "global",
    "published": "Thu, 29 May 2025 21:55:34 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-violation-of-1931-thermodynamic-principle/\" rel=\"nofollow\" title=\"Scientists Discover Violation of 1931 Thermodynamic Principle\"><img alt=\"Thermodynamics Experiment Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Thermodynamics-Experiment-Art-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The cell model of ion-exchange membranes reveals violations of the Onsager reciprocity principle, particularly at high electrolyte concentrations, highlighting the importance of accounting for asymmetric transport coefficients. Ion-exchange membranes are widely used in electrochemical and separation processes, and accurate modeling of their transport properties is essential. A new study published in the journal Asymmetry demonstrates [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Violation of 1931 Thermodynamic Principle"
    ],
    "summary": "Scientists have discovered a violation of the Onsager reciprocity principle, a fundamental thermodynamic rule established in 1931, in ion-exchange membranes, especially at high electrolyte concentrations. This discovery underscores the need for precise modeling of transport properties in these membranes, which are crucial for electrochemical and separation processes. The findings, published in the journal Asymmetry, highlight the significance of accounting for asymmetric transport coefficients in the study and application of ion-exchange membranes.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides readers with useful insights into a new scientific discovery that challenges a long-standing thermodynamic principle. It increases awareness about the need for precise modeling in ion-exchange membranes and the implications of this discovery on electrochemical and separation processes. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.859,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.523,
    "normalized_score": 3.29
  },
  {
    "title": "Turning Waste Into Energy: New Enzyme Revolutionizes Biofuel Production",
    "domain": "science",
    "location": "global",
    "published": "Thu, 29 May 2025 21:22:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/turning-waste-into-energy-new-enzyme-revolutionizes-biofuel-production/\" rel=\"nofollow\" title=\"Turning Waste Into Energy: New Enzyme Revolutionizes Biofuel Production\"><img alt=\"CelOCE Enzyme Acting on Cellulose Fibers\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"561\" src=\"https://scitechdaily.com/images/CelOCE-Enzyme-Acting-on-Cellulose-Fibers-777x561.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The natural protein, known as CelOCE, was developed at the Brazilian Center for Research in Energy and Materials and is ready for immediate integration into industrial processes. Breaking down plant material into usable fuel has long been one of science’s biggest energy challenges. At the heart of this process is cellulose, the most abundant renewable [...]"
    ],
    "image_url": "",
    "titles": [
      "Turning Waste Into Energy: New Enzyme Revolutionizes Biofuel Production"
    ],
    "summary": "Researchers at the Brazilian Center for Research in Energy and Materials have developed a new enzyme, CelOCE, that significantly enhances biofuel production by efficiently breaking down cellulose, the most abundant renewable material in plant matter, into usable fuel. This breakthrough is ready for immediate industrial application, potentially revolutionizing the way waste is converted into energy.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights an innovative solution to biofuel production, which could potentially revolutionize the way waste is converted into energy. It provides actionable insights for industries involved in biofuel production and contributes to the reader's understanding of advancements in this field.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.851,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.551,
    "normalized_score": 5.06
  },
  {
    "title": "First evidence of ancient birds nesting above the Arctic circle",
    "domain": "science",
    "location": "global",
    "published": "Thu, 29 May 2025 20:00:32 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Tiny bone fragments from Alaska suggest birds started breeding and nesting in the Arctic 30 million years earlier than previously thought"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/28151751/sei253344921.jpg",
    "titles": [
      "First evidence of ancient birds nesting above the Arctic circle"
    ],
    "summary": "Recent findings in Alaska of tiny bone fragments indicate that birds began breeding and nesting in the Arctic approximately 30 million years earlier than scientists previously believed. This discovery challenges existing theories about bird migration and breeding patterns in ancient times.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a new discovery that challenges existing theories about bird migration and breeding patterns. It provides a deeper understanding of bird behavior in ancient times. However, it does not offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.818,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.501,
    "normalized_score": 1.9
  },
  {
    "title": "Long shot science leads to revised age for land-animal ancestor",
    "domain": "science",
    "location": "global",
    "published": "Thu, 29 May 2025 19:46:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "Phys.org"
    ],
    "snippets": [
      "The fossils of ancient salamander-like creatures in Scotland are among the most well-preserved examples of early stem tetrapods -- some of the first animals to make the transition from water to land. Thanks to new research, scientists believe that these creatures are 14 million years older than previously thought. The new age -- dating back to 346 million years ago -- adds to the significance of the find because it places the specimens in a mysterious hole in the fossil record called Romer's Gap.",
      "In 1984, an amateur paleontologist in Scotland found a remarkable specimen: a nearly complete fossil of what looked to be a lizard or salamander. Rather small in size at 20 centimeters, it would turn out to be a crucial piece in the puzzle of animal evolution."
    ],
    "image_url": "",
    "titles": [
      "Long shot science leads to revised age for land-animal ancestor",
      "Long shot science leads to revised age for land-animal ancestor"
    ],
    "summary": "New research on fossils found in Scotland reveals that ancient salamander-like creatures, initially discovered in 1984, are 14 million years older than previously thought, dating back to 346 million years ago. This finding places these early stem tetrapods, crucial to understanding the transition from water to land, within Romer's Gap in the fossil record, addressing a significant mystery in animal evolution.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the field of paleontology and animal evolution. The discovery adds to our understanding of the timeline of life on Earth, specifically the transition from water to land. However, it does not directly report on solutions, improvements, or innovations, nor does it offer actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.55,
      "recency": 0.829,
      "consensus": 0.4,
      "constructiveness": 0.8
    },
    "score": 0.629,
    "normalized_score": 10.0
  },
  {
    "title": "Gaming seals reveal how cloudy water provides sense of direction",
    "domain": "science",
    "location": "global",
    "published": "Thu, 29 May 2025 18:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Open water swimming can be strangely claustrophobic. Immerse your face in cloudy water and your view might dwindle to a few centimeters. Yet, harbor seals (Phoca vitulina) manage to negotiate the turbid coastal waters in which they reside with ease, detecting their surroundings through various senses, including their dexterous whiskers."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/harbor-seal.jpg",
    "titles": [
      "Gaming seals reveal how cloudy water provides sense of direction"
    ],
    "summary": "Harbor seals (Phoca vitulina) adeptly navigate the murky coastal waters where they live, despite the limited visibility that can make open water swimming feel claustrophobic. They rely on their highly sensitive whiskers among other senses to detect their surroundings and move through the water with ease.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers a deeper understanding of how harbor seals navigate murky waters, which could be useful for marine biologists or animal behavior researchers. It increases awareness about the adaptations of marine animals, but it does not provide actionable insights for the reader or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.804,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.497,
    "normalized_score": 1.65
  }
]