[
  {
    "title": "Colombian Senator and Presidential Candidate Dies After Rally Shooting",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 12 Aug 2025 00:48:13 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Miguel Uribe was shot three times while giving a campaign speech in a park and had since remained in an intensive care unit in serious condition with episodes of slight improvement.",
      "<p>Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39</p><p>Miguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.</p><p>Uribe, an opposition candidate with ",
      "Miguel Uribe Turbay, a Colombian senator, was shot at a campaign event in Bogotá in June and had been in intensive care since.",
      "Mr. Uribe, a presidential hopeful, was shot in June at a campaign rally in Bogotá in an attack that shocked the nation."
    ],
    "image_url": "",
    "titles": [
      "Colombian senator and presidential hopeful dies 2 months after shooting",
      "Colombian senator Miguel Uribe dies after June campaign shooting",
      "Colombian presidential hopeful dies after being shot at campaign event",
      "Miguel Uribe, Colombian Senator Shot at Campaign Event, Dies at 39"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.933,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.83,
    "summary": "Miguel Uribe Turbay, a rightwing presidential candidate and Colombian senator, died at the age of 39 after being shot in the head at a campaign rally in Bogotá in June. Despite undergoing multiple surgeries and intensive care, Uribe succumbed to his injuries two months post-attack. His death has shocked the nation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Extends Tariff Pause on Chinese Imports for 90 Days",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 06:10:19 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "CityNews",
      "BBC",
      "Axios"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "news.google.com",
      "www.dw.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The US will hold its levy on Chinese imports at 30%, while China will keep a 10% tariff on American goods.",
      "The decision in Washington and Beijing to put off tariff increases delays a trade showdown between the world's two biggest economies.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9FNnZTQUw0dlRTUjdpTmpCTmRfWHJnbnNGTEtsVjhwVEdRaTRjOXVjV0FsbGFxQXVnUVJ1NHl1Sl85WmpxZERIeVFxRXo0Vk9wZFFoZW5xZ1ZMYnFNN1NRMjJXdU9ieElRbXZZS3VpMFU?oc=5\" target=\"_blank\">U.S., China extend tariff pause another 90 days</a>&nbsp;&nbsp;<font color=\"",
      "<p>President signs executive order extending deadline for higher tariffs hours before agreement was due to expire</p><p>Donald Trump has once again delayed implementing sweeping tariffs on <a href=\"https://www.theguardian.com/world/china\">China</a>, announcing another 90-day pause just hours before ",
      "WASHINGTON (AP) — President Donald Trump extended a trade truce with China for another 90 days Monday, at least delaying once again a dangerous showdown between the world’s two biggest economies. Trump posted on his Truth Social platform that he signed the executive order for the extension, and that"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d2b6/live/576dda70-770e-11f0-8c81-1388426461db.jpg",
    "titles": [
      "US and China extend trade truce to avoid tariffs hike",
      "Trump, China extend tariffs pause for 90 more days",
      "U.S., China extend tariff pause another 90 days - Axios",
      "Trump announces another 90-day pause on China tariffs",
      "US and China extend trade truce another 90 days, easing tension between world’s largest economies"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.94,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary": "President Donald Trump signed an executive order extending the pause on increasing tariffs against Chinese imports for another 90 days, just before the previous pause was set to expire at midnight in Beijing. This action prevents the expected rise in tariffs that was scheduled for Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "chinese flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump to Nominate Heritage Foundation Economist as BLS Commissioner",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:50:34 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "NPR",
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.aljazeera.com",
      "www.npr.org",
      "news.google.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "President Trump plans to tap an economist from the conservative Heritage Foundation to oversee the Bureau of Labor Statistics. He fired the previous leader after a disappointing jobs report.",
      "US president&#039;s nomination comes after firing of agency head raised concerns about integrity of US government statistics.",
      "E.J. Antoni is a chief economist of conservative think tank Heritage Foundation. Trump fired the former BLS chief over a report showing a slowdown in hiring.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9yNXNQcUpRYTkwc3VRRlgyTzZzSmJrYjFMSjJDRmJKdDVCYVlITF81bGZlQWRRVk1xbWFBM3IzMGF5b3lYdkZmZUd2QUp0Z091d3g1RGRXcV9fQ0JseEJUZUQ1YWRjQ1VrTUVlTkVkR2hSaXBzS1d4akhQMjI3RXc?oc=5\" target=\"_blank\">Trump names Heritage's E.J. Antoni to lead Bureau of Lab",
      "<p>This blog is now closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/aug/11/trump-ej-antoni-heritage-foundation-bls\">here</a></p><p><strong>Donald Trump</strong> said on Truth Social today that DC “will be LIBERATED today”.</p><p>Ahead of his press conference, in just ",
      "<p>EJ Antoni, longtime critic of Bureau of Labor Statistics, nominated to replace Erika McEntarfer, who Trump fired</p><p>Donald Trump has announced he is nominating EJ Antoni, the chief economist at the conservative Heritage Foundation, as the next commissioner of the Bureau of Labor Statistics.</p",
      "President Donald Trump said late Monday he plans to nominate E.J. Antoni, the chief economist of the conservative Heritage Foundation, to become commissioner of the Bureau of Labor Statistics."
    ],
    "image_url": "",
    "titles": [
      "Trump taps conservative economist to lead statistics agency",
      "Trump names conservative economist to lead labour statistics agency",
      "US: Trump taps conservative economist as Labor Stats head",
      "Trump names Heritage's E.J. Antoni to lead Bureau of Labor Statistics - Axios",
      "Trump nominates chief economist at rightwing Heritage Foundation to lead Bureau of Labor Statistics – as it happened",
      "Trump nominates Heritage Foundation economist as labor statistics chief",
      "Trump picks conservative economist E.J. Antoni to lead Bureau of Labor Statistics"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.842,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.815,
    "summary": "President Donald Trump announced his intention to nominate E.J. Antoni, a chief economist at the conservative Heritage Foundation, as the new commissioner of the Bureau of Labor Statistics (BLS). This decision follows Trump's firing of the previous commissioner, Erika McEntarfer, citing dissatisfaction with a recent jobs report and accusing her of manipulating data. Trump asserts that Antoni will provide \"honest and accurate\" employment data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Explosion at Pennsylvania Steel Plant Kills One, Leaves One Missing",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 06:57:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "The Guardian",
      "Business Insider",
      "Axios"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.aljazeera.com",
      "news.google.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Flames and heavy smoke billow out of the plant owned by US Steel as firefighters struggle to extinguish the fire.",
      "The massive US Steel coking plant is the largest such facility in North America.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOQU5KNWZuU24yWHJjSGdnVFNOR2YyMFpTZ3BlRXc1cG8tRlZ5QkdXYU9ldW5yN0R4UFdTZHJ4Y0hQLU5MODhEaC1tMkl4WnVid05sSlVfbWZXeFQ3Z3dVZ1dYbjNRM196cVBzb0htOUdtSDBNMGxsbnh3VS13SzNwV0k3WElfVU9ZWW8tMV9JcVVHQQ?oc=5\" target=\"_blank\">At least 2 dead and 10 injure",
      "Two people have died and 10 are injured following an explosion at a Pennsylvania steel plant on Monday, Allegheny County police said.",
      "One person has died, one is unaccounted for and 10 are injured following an explosion at a Pennsylvania steel plant on Monday, local police said.",
      "<p>Second fatality reported after body of one worker pulled from wreckage of coking facility in Clairton after explosion sent black smoke into the sky</p><p>An explosion at a US Steel plant in <a href=\"https://www.theguardian.com/us-news/pennsylvania\">Pennsylvania</a>, near Pittsburgh, has killed tw",
      "The explosion took place at the US Steel Clairton Coke Works plant, located south of Pittsburgh, Pennsylvania."
    ],
    "image_url": "",
    "titles": [
      "Two dead, 10 injured in explosion at US steel plant in Pennsylvania",
      "One dead, dozens injured in steel plant explosion in Pennsylvania",
      "At least 2 dead and 10 injured in explosions at U.S. Steel Clairton plant - Axios",
      "2 dead, 10 hurt from explosion at Pennsylvania steel plant: Officials",
      "WATCH:  One dead, 10 injured in explosion at Pennsylvania steel plant, officials say",
      "Explosion ‘like thunder’ at Pennsylvania US Steel plant leaves two dead",
      "Explosion at US Steel plant in Pennsylvania leaves 2 dead, 10 injured"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.976,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary": "An explosion at the US Steel Clairton Coke Works plant in Pennsylvania resulted in one death, one person missing, and 10 injuries. The incident occurred south of Pittsburgh at North America's largest coking facility. The cause of the explosion is currently unknown, and a search and rescue operation is underway for the missing individual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Taylor Swift Announces 12th Album \"The Life of a Showgirl\"",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-12T05:15:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Le Monde",
      "The Guardian",
      "Deutsche Welle",
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com",
      "www.dw.com",
      "www.lemonde.fr",
      "www.theguardian.com"
    ],
    "snippets": [
      "Taylor Swift has announced her 12th studio album will be \"The Life of a Showgirl.\" A post on her website did not specify a release date.",
      "La date de sortie de l’album n’a pas encore été annoncée et la pochette en sera « révélée ultérieurement ».",
      "<p>Singer announced her 12th album at 12.12am on 12 August after a countdown, mysterious posts and teasing an appearance on her boyfriend Travis Kelce’s New Heights podcast</p><p>Taylor Swift has announced her next album, The Life of a Showgirl.</p><p>Swift is known for dropping hints and clues for ",
      "The superstar musician also shared a clip of her appearance on boyfriend and NFL Star Travis Kelce’s ‘New Heights’ podcast.",
      "Taylor Swift announced a new album, \"The Life of a Showgirl.\" More details will likely be revealed in the next episode of Travis Kelce's podcast."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift's next album titled 'The Life of a Showgirl'",
      "Taylor Swift annonce la sortie de son douzième album, « The Life of a Showgirl »",
      "Taylor Swift announces new album The Life of a Showgirl",
      "Taylor Swift Announces 12th Album ‘The Life Of A Showgirl’—Set To Appear On Travis Kelce’s Podcast",
      "Taylor Swift announces new album 'The Life of a Showgirl' &mdash; here's everything we know"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.942,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "Taylor Swift has announced her 12th studio album titled \"The Life of a Showgirl,\" with details and the release date yet to be disclosed. The announcement came after a series of teasers, including a countdown and mysterious posts, culminating in a reveal at 12.12 am on 12 August. Swift also shared a clip from an upcoming appearance on her boyfriend Travis Kelce’s podcast, 'New Heights,' where more information about the album is expected to be unveiled.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 78 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "U.S.-China Trade Truce Deadline Looms, Tariffs May Rise on Consumer Goods",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 20:26:04 -0400",
    "source": "ABC News",
    "sources": [
      "Financial Times",
      "ABC News",
      "The Guardian",
      "New York Times",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.nytimes.com",
      "www.ft.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ahead of the trade truce, the current tariff rate on Chinese imports was 145%.",
      "US leader postpones new tariffs on world’s biggest exporter for another 90 days",
      "<p>Bourses in Australia and Japan hit record highs as hopes grow of trade deal within latest 90-day pause</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/12/us-china-extend-90-day-tariff-truce-uk-wage-growth-steady-vacancies-fall-us-inflation-business-live\">Business live – ",
      "President Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.",
      "U.S. levies on Chinese goods like toys, footwear and furniture could rise sharply if a deal is not approved by Tuesday’s deadline."
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-1-rt-gmh-250811_1754923283197_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Trump signs 90-day extension for trade truce with China",
      "Trump extends trade war truce with China",
      "Trump’s China trade truce extension spurs market rally",
      "Trump Extends China Tariff Truce by Three Months",
      "Trump extends trade truce with China. What it means for tariffs."
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.852,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary": "Before the trade truce, the U.S. had a 145% tariff rate on Chinese imports. If a deal isn't approved by Tuesday, tariffs on items like toys, footwear, and furniture could increase significantly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Al Jazeera Reporter and Colleagues Killed in Israeli Airstrike in Gaza",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:16:51 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "LA Times",
      "Washington Post",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.latimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Sharif was killed when Israel targeted a tent used by media in northern Gaza, alongside six others, Al Jazeera said.",
      "Anas al-Sharif, a reporter previously threatened by Israel, and four colleagues were killed in an Israeli airstrike.",
      "The attack on the journalists came as Israel said it was preparing to invade and take over Gaza City.",
      "Officials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and the other four victims all worked for the network.",
      "Anas al-Sharif, a well-known correspondent, was among those killed. Israel said it had targeted Mr. al-Sharif, claiming he worked for Hamas, which he had denied.",
      "<p>Al Jazeera reporter Anas al-Sharif, 28, drew millions of followers on social media and emerged as one of the top voices in the Arab world for his chronicling of the war in Gaza.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a03b/live/5b0875e0-76d8-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Who was Anas al-Sharif, prominent Gaza journalist killed by Israel?",
      "Israel kills Al Jazeera journalist Anas al-Sharif in Gaza",
      "Palestinians mourn Al Jazeera journalist Anas al-Sharif, crew in Gaza",
      "Who Were the Al Jazeera Journalists Killed in an Israeli Strike in Gaza?",
      "Israeli Strike Kills 5 Al Jazeera Journalists, Network Says",
      "Prominent Al Jazeera journalist among several killed in Israeli strike on Gaza press tent"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.719,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary": "Anas al-Sharif, a 28-year-old Al Jazeera reporter with a significant social media following, and four colleagues were killed in an Israeli airstrike targeting a media tent in northern Gaza. Israel has accused al-Sharif of being a Hamas operative, a claim disputed by Al Jazeera. This incident is part of a broader conflict in which nearly 270 journalists and media workers have been killed since Israel launched its war on Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israeli flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump to Deploy National Guard, Control D.C. Police Amid Crime Concerns",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Mon, 11 Aug 2025 18:42:00 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "The Guardian",
      "Deutsche Welle",
      "LA Times",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.aljazeera.com",
      "news.google.com",
      "www.dw.com",
      "www.cnbc.com",
      "www.latimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "President is deploying National Guard in response to what he calls a crime emergency, with 800 troops to be sent to DC.",
      "US President Donald Trump claimed the city had been taken over by criminals and gangs. But police statistics show that violent crimes have decreased significantly in recent years.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQakxHQVgzZ19lVkx0YVpKYVlud28zb0F0bmh3UGlRU1ZRenNzNmVKNXpFcmE3NE56RjNTRklVTktLU0RSR2dfaVY5UlZMZUlORWFwWWlsNWJ0SnpkQ1V5cUt6QzZ0LWN0UDZlVUNHX2xOWXlyUFBpYzhsNm8yMmdSeS1Tc2FpU2ExTlZv?oc=5\" target=\"_blank\">Trump to deploy National Guard to D.C. ",
      "Trump in a social media post on Sunday declared that \"the Homeless\" in Washington, D.C., will \"have to move out.\"",
      "<p>President claims US capital ‘overtaken by violent gangs and bloodthirsty criminals … and homeless people’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/11/donald-trump-washington-crime-homelessness-redistricting-tariffs-us-politics-news-live-updates\">US politics – live ",
      "<p>Trump is invoking Section 740 of the District of Columbia Home Rule Act that places the Metropolitan Police Department under direct federal control.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "Why is Trump sending US National Guard to Washington, DC?",
      "Trump announces National Guard deployment in Washington, DC",
      "Trump to deploy National Guard to D.C. and federalize city police - Axios",
      "Trump puts Washington, DC, police under federal control, deploys National Guard",
      "Trump seizes control of Washington DC police and deploys national guard",
      "Trump expands L.A. military tactics by sending National Guard to Washington, D.C."
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.74,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary": "President Donald Trump announced plans to deploy the National Guard and take control of Washington D.C.'s Metropolitan Police Department, citing concerns over crime and homelessness. Despite Trump's claims of the city being \"overtaken\" by criminals and gangs, police statistics indicate a significant decrease in violent crimes in recent years. D.C.'s mayor has criticized the comparison to a war-torn country as exaggerated and misleading. Trump's actions are based on invoking section 740 of the District of Columbia Home Rule Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 86 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Browns' Myles Garrett Cited for Speeding, Caught at 100 mph in 60 Zone",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 21:47:58 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Browns defensive end Myles Garrett was issued a citation for speeding on the interstate in a Cleveland suburb early Saturday morning, according to court records, after he was clocked going 100 mph in a 60 mph zone.",
      "Garrett has a history of speeding tickets",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQWFVLN3ZnQXFzNVlHLUVjWHNwemdjT3drOWxJYUpUUWVtbTA5elVRNUY5ZWZSRmh1bnBDM05ncmhVZDA3V0F3Rl9aXzdOdzVWaTQtX0l0X2F5ZzdIZkhQRDV1VDNzd282ekF1Q3NJcFdzTkdFSWZzZmx4dG5fOFp4eXJGcGR5d2lvOWUwSmN0bkYwdw?oc=5\" target=\"_blank\">Myles Garrett Cited for Speed"
    ],
    "image_url": "",
    "titles": [
      "Browns' Garrett cited for going 100 mph in 60 zone",
      "Browns star Myles Garrett cited for driving 100 mph after team's preseason opener",
      "Myles Garrett Cited for Speeding Saturday After Browns Preseason Game - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.877,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary": "Browns defensive end Myles Garrett was cited for speeding early Saturday in a Cleveland suburb after being caught driving 100 mph in a 60 mph zone, as per court records. This incident adds to Garrett's history of speeding tickets, highlighting a recurring issue with traffic violations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Exclusive: GitHub CEO to step down - Axios",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 21:34:50 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1EeklEczZkc1JFa1BWRjZGbmF5ZG1QbGFHWDJEQkxWWTQ3MVpxeDluMnFFbVE3b2dtcHJFaXZUUUE3d3VoUWRtMXdIUEtjVXBlbmJEN21WX2pVa180QU1ydkQyS0NoTFN5bzJDcA?oc=5\" target=\"_blank\">Exclusive: GitHub CEO to step down</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</fo",
      "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "Microsoft bought GitHub for $7.5 billion in 2018."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: GitHub CEO to step down - Axios",
      "GitHub CEO to step down",
      "GitHub will be folded into Microsoft proper as CEO steps down"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.786,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Critiques Intel CEO's Ties, Plans Collaboration",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:46:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Fortune",
      "Al Jazeera"
    ],
    "domains": [
      "www.businessinsider.com",
      "fortune.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Trump said last week that Intel’s CEO Lip-Bu Tan was &#039;highly conflicted&#039; due to ties with Chinese firms.",
      "Last week, President Donald Trump called Intel CEO Lip-Bu Tan \"highly CONFLICTED\" on Truth Social. On Monday, he posted calling Tan a \"success.\"",
      "\"Mr. Tan and my Cabinet members are going to spend time together, and bring suggestions to me during the next week.\""
    ],
    "image_url": "",
    "titles": [
      "Trump meets with Intel CEO after calling for his ouster",
      "Trump praises Intel's CEO, days after calling for him to resign",
      "Trump says Intel CEO has ‘amazing story,’ sets Cabinet talks"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.742,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "Last week, US President Donald Trump labeled Intel CEO Lip-Bu Tan as \"highly conflicted\" due to connections with Chinese companies, expressing his concerns on Truth Social. However, Trump later referred to Tan as a \"success\" and announced plans for Tan and Cabinet members to collaborate and bring forward suggestions to him in the coming week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Paramount Secures Exclusive Rights to UFC Broadcasts in $7.7B Deal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 15:50:50 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5hR3hXUnpTRnJhVTRWTFhmRURjT0VPM1JabUNaYkZRako4ZVFEZkV1YVRlRGhoc0JWUmxVdVRFLXZmSjR1Z0dBWnpHTUg1aHRSd0VWNVdFR01SX0stYWoxT0hNOXFBNmNPQnRfTHREMl84cEtRVEE3V0YtSQ?oc=5\" target=\"_blank\">UFC, Paramount strike new deal for $7.7 billion over 7 years<",
      "The Paramount deal will eliminate the pay-per-view model used by ESPN in its current UFC deal, making all events available for no extra charge on Paramount+.",
      "UFC's CEO reveals why he wanted David Ellison's muscle behind his MMA giant, why pay-per-view events no longer work, and what a potential UFC fight at the White House would look like on CBS."
    ],
    "image_url": "",
    "titles": [
      "UFC, Paramount strike new deal for $7.7 billion over 7 years - Axios",
      "Paramount buys UFC rights in $7.7 billion, 7-year deal in first major move post-Skydance merger",
      "Dana White On How UFC Landed Its Blockbuster $7.7 Billion Streaming Deal With Paramount"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.698,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary": "Paramount has entered a seven-year, $7.7 billion agreement to become the exclusive U.S. broadcaster of Ultimate Fighting Championship (UFC) events, starting in 2026. This deal, the first major agreement following Paramount's merger with Skydance, will see UFC events move from ESPN to Paramount+, eliminating the current pay-per-view model and making all events available at no additional cost to subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ty Simpson Named Alabama's Starting QB for 2025 Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 21:47:58 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Alabama players were informed that Ty Simpson would be the team's starting quarterback on Monday, sources said.",
      "The redshirt junior has won the quarterback competition in Tuscaloosa for the first time in his career"
    ],
    "image_url": "",
    "titles": [
      "Sources: Alabama names Simpson starting QB",
      "Alabama expected to name Ty Simpson starting QB: Veteran earns long-awaited chance to run Crimson Tide offense"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.877,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary": "Ty Simpson has been officially named Alabama's starting quarterback for the 2025 season, winning the position for the first time in his career. After a competitive process, Head Coach Kalen DeBoer announced the decision, choosing Simpson over Austin Mack and Keelon Russe. The Alabama football team was informed of Simpson's new role on Monday, Aug. 11, ahead of their game against FSU.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NFL Rookies, Free Agents Shine in Preseason Debut",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 20:55:06 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "How did rookies and top free agent acquisitions fare in the NFL's first full preseason week?",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQdWNMelNPY3k5dUJudjNtd2NvemQyVFI0ZXBzMkhWTnprMWs4THdfVWtRQ182eXMxLTV0UDZIMEdLWDZfZnpmS0dvZmluWF8wTzlKbUZDZFVXWndqaXZLRFNOSG5RdG9URmM0Vk9tWkZ3OUNzM1dMd0k1Q0NMWmxDdzFvVWEzbVRiUlB0U29mbjNSeHVZUG1ia2c4NA?oc=5\" target=\"_blank\">How Tyler Shough’"
    ],
    "image_url": "",
    "titles": [
      "NFL preseason Week 1 takeaways: Tyler Shough's debut a mixed bag for Saints",
      "How Tyler Shough’s Performance in Preseason Debut Impacts Saints QB Battle - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.861,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary": "In the NFL's first full preseason week, rookies and top free agent acquisitions showcased their talents, with varying degrees of success. Specific performances, such as that of Tyler Shough, were highlighted, indicating a focus on individual achievements and potential impacts on their teams. The overall assessment of these players' performances provides insights into their readiness for the regular season and their potential contribution to their teams' successes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "nfl",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sinner, Auger-Aliassime Advance to Next Rounds at Cincinnati Open",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 06:21:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Defending men's champion Jannik Sinner is through to the last 16 of the Cincinnati Open after a 6-2 7-6 (8-6) victory over Canadian Gabriel Diallo.",
      "<p>Canada&#8217;s Felix Auger-Aliassime advanced to the fourth round of the Cincinnati Open tennis tournament with a 7-6 (4), 4-2 win over France&#8217;s Arthur Rinderknech on Monday.</p>"
    ],
    "image_url": "https://e1.365dm.com/25/08/1920x1080/skysports-jannik-sinner-tennis_6988563.jpg?20250812063726",
    "titles": [
      "Sinner through to Cincinnati Open last 16",
      "Auger-Aliassime advances to fourth round at Cincinnati Open, Diallo loses to Sinner"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.944,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "Defending champion Jannik Sinner advanced to the last 16 of the Cincinnati Open by defeating Gabriel Diallo with scores of 6-2, 7-6 (8-6). Similarly, Canada's Felix Auger-Aliassime moved into the fourth round after a 7-6 (4), 4-2 victory over France's Arthur Rinderknech.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ottawa Senators Secure Land for New Downtown Arena at LeBreton Flats",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:51:38 EDT",
    "source": "Sportsnet",
    "sources": [
      "CityNews",
      "Sportsnet"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>A new downtown arena for the Ottawa Senators has sometimes seemed like a more distant hope than a Stanley Cup. On Monday, one of those dreams took a leap forward. </p>",
      "OTTAWA — The Ottawa Senators are one step closer to having a new arena in the city&#8217;s downtown core. The Senators and the National Capital Commission have agreed on the sale of 4.5 hectares (11 acres) of land at LeBreton Flats for the project. The agreement of purchase and sale with Capital Spo"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/lebreton-flats.jpg",
    "titles": [
      "Senators’ land purchase in LeBreton Flats gives optimism for downtown arena",
      "Ottawa Senators, NCC finalize land deal for new arena at LeBreton Flats"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.842,
      "consensus": 0.682,
      "constructiveness": 0.123,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary": "The Ottawa Senators have made significant progress toward building a new arena in Ottawa's downtown area by agreeing with the National Capital Commission on the purchase of 4.5 hectares (11 acres) of land at LeBreton Flats. This development moves the team closer to realizing the long-discussed project, marking a key milestone in the efforts to secure a new venue for the team.",
    "constructiveness_score": 0.123,
    "constructiveness_reason": "2 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nevada Court Allows Jon Gruden's Lawsuit Against NFL to Proceed",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 00:53:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Gruden sued the NFL and Roger Goodell in November 2021",
      "<p>A Nevada court apparently cleared the way Monday for a 2021 lawsuit filed by former Las Vegas Raiders coach Jon Gruden to proceed against the NFL and Commissioner Roger Goodell, alleging that a “malicious and orchestrated campaign” was used to destroy Gruden’s career by leaking old emails he had "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/12/156023a7-3ba9-4895-84da-e680c83b56df/gruden-imagn.png",
    "titles": [
      "Jon Gruden vs. NFL lawsuit: Nevada Supreme Court sides with former coach in ongoing battle vs. league",
      "Nevada court clears way for former Raiders coach Jon Gruden to sue NFL"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.86,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "In November 2021, Jon Gruden, former Las Vegas Raiders coach, filed a lawsuit against the NFL and Commissioner Roger Goodell, claiming they conducted a \"malicious and orchestrated campaign\" to end his career by leaking his old emails. A Nevada court has recently allowed this lawsuit to move forward, indicating the legal battle over the allegations will proceed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "nfl",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
    "domain": "technology",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 11 Aug 2025 13:04:57 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.npr.org"
    ],
    "snippets": [
      "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "The deal won’t resolve national security concerns."
    ],
    "image_url": "",
    "titles": [
      "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "Trump strikes “wild” deal making US firms pay 15% tax on China chip sales"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.731,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 16 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Italian Orienteering Athlete Mattia Debertolis Dies During China Event",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 06:30:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Italian athlete Mattia Debertolis dies after collapsing during orienteering event in China.",
      "Italian athlete Mattia Debertolis dies after collapsing during orienteering event in China."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/49cc/live/f1cc0800-7743-11f0-9cb9-4b17a25d293a.jpg",
    "titles": [
      "Italian athlete dies after collapse at World Games",
      "Italian athlete dies after collapse at World Games"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.947,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "Italian athlete Mattia Debertolis tragically passed away after collapsing during an orienteering event in China. Debertolis, a well-known athlete in the sport, collapsed during the race and despite efforts to revive him, he could not be saved. The incident has led to an outpouring of condolences from the orienteering community.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "china flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Astros Beat Red Sox 7-6, Urías and McCormick Shine",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 03:53:10 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Three players essential to the Astros' past, present, and future convened on Monday night",
      "<p>Ramón Urías had three hits with a two-run homer and Chas McCormick hit his first homer this season as the Houston Astros built a big lead and held on for a 7-6 win over the Boston Red Sox on Monday night.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/12/3e637c0c-51e5-4cf1-bd47-5c9aeef430da/bregman-getty.png",
    "titles": [
      "Alex Bregman homers, gets standing ovation in Houston return, but Astros hold off Red Sox rally for big win",
      "Astros hold off Red Sox in Bregman’s return to Houston"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.916,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "The Houston Astros secured a 7-6 victory over the Boston Red Sox, with notable performances from Ramón Urías, who had three hits including a two-run homer, and Chas McCormick, who hit his first homer of the season. Carlos Correa also contributed with an RBI single. This win comes after the Astros were previously swept by the Red Sox.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Revel shutters rideshare business, pivots to EV charging",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-11T15:04:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Revel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging. “At the end of the day, rideshare is a very competi",
      "Revel has abandoned its small Uber and Lyft competitor four years after it started, and is looking to sell or return its bright-blue Tesla and Kia EVs."
    ],
    "image_url": "",
    "titles": [
      "Revel shutters rideshare business, pivots to EV charging",
      "Revel shuts down its ride-hail business to focus on EV charging"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.762,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "ESPN and Fox Launch Bundled Streaming in October, Offering $10 Monthly Savings",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 18:36:28 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "ESPN and Fox will offer their upcoming direct-to-consumer streaming services as a bundle beginning in October.",
      "You can save $10 a month by signing up for this bundle, instead of ESPN’s and Fox’s separate stand-alone services, debuting in August."
    ],
    "image_url": "",
    "titles": [
      "ESPN, Fox to bundle upcoming streaming services for $39.99 a month",
      "Disney adds to sports streaming war chest with ESPN/Fox bundle priced at $39.99 per month"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.739,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary": "Starting in October, ESPN and Fox will provide a bundled direct-to-consumer streaming service. This bundle will allow subscribers to save $10 monthly compared to signing up for the separate stand-alone services, which are set to launch in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Lunar Trailblazer Mission Lost After Launch",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 10:57:49 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "NASA’s Lunar Trailblazer, a mission designed to create high-resolution maps of water on the Moon, ended after losing contact with the spacecraft just one day after its February 26 launch. Despite extensive global efforts to reestablish communication, the small satellite’s misaligned solar arrays pre",
      "<a href=\"https://scitechdaily.com/nasas-lunar-trailblazer-moon-mission-lost-just-a-day-after-launch/\" rel=\"nofollow\" title=\"NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch\"><img alt=\"NASA Lunar Trailblazer in Orbit\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "How NASA’s Lunar Trailblazer was lost before reaching the Moon",
      "NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.699,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary": "NASA's Lunar Trailblazer mission, aimed at mapping water on the Moon, was declared lost a day after its launch. Despite initial success, contact with the spacecraft was unexpectedly lost, and recovery efforts have since failed, marking an early end to the mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Reddit will block the Internet Archive",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-11T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; ins",
      "The Internet Archive confirmed it's in ongoing discussions with Reddit after block."
    ],
    "image_url": "",
    "titles": [
      "Reddit will block the Internet Archive",
      "Reddit blocks Internet Archive to end sneaky AI scraping"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.73,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 6 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Madrid-Washington Relations Strain Over Defense, Policy Disagreements",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 05:05:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "Tensions over defense and foreign policy issues are growing between Madrid and Washington."
    ],
    "image_url": "",
    "titles": [
      "Spain treads a risky path by standing up to Trump on defense and China"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.92,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.504,
    "summary": "Tensions between Madrid and Washington are escalating due to disagreements over defense and foreign policy. The specific issues causing the discord have not been detailed, but the growing rift marks a significant strain in relations between the two capitals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ukraine Excluded from Trump-Putin Talks, Faces Uncertain Position",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 07:28:55 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "Ukraine has been left out in the cold ahead of high-profile talks between U.S. President Donald Trump and President Vladimir Putin on Friday."
    ],
    "image_url": "",
    "titles": [
      "Sidelined from Trump-Putin talks, Ukraine warns the world not to trust Russia"
    ],
    "score_components": {
      "magnitude": 0.46,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.502,
    "summary": "Ukraine is not included in upcoming talks between U.S. President Trump and Russian President Putin. This exclusion leaves Ukraine in a precarious position as the two leaders meet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 29 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Medical Digital Twins Gain Popularity in Therapy, Spark Debate",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 03:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "There is a rising use of medical digital twins that represent patients. Therapists can use personas in AI to represent the minds of their clients. Its good and bad news."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689adf1fb3b7a76143dd2fa6/0x0.jpg?width=960",
    "titles": [
      "Therapists Leverage AI For Mental Health By Delving Into Virtual Digital Twins Of Their Clients And Patients Minds"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.098,
      "proximity": 0.5
    },
    "score": 0.501,
    "summary": "The use of medical digital twins, which are virtual representations of patients, is increasing. These digital personas, powered by AI, are being utilized by therapists to better understand and represent their clients' minds. This development has both positive and negative implications.",
    "constructiveness_score": 0.098,
    "constructiveness_reason": "1 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Elephants Raid Crops, Pose Danger in Kenya's Taita Hills",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 03:19:38 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "For farmers in the Taita hills in southern Kenya, elephants are a menace: they raid crops and will occasionally injure or even kill people."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/kenyan-farmers-use-bee.jpg",
    "titles": [
      "Kenyan farmers use bees and sesame to keep away marauding elephants"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "In the Taita hills of southern Kenya, farmers are facing significant challenges due to elephants raiding crops and sometimes causing injuries or fatalities among the local population. These incidents have highlighted the ongoing conflict between wildlife and human agricultural activities in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nvidia, AMD to Pay US Govt 15% on China Chip Sales to Comply With Export Rules",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-08-12T07:00:45Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Nvidia and AMD are expected to pay the US government 15% of their China chip sales revenues."
    ],
    "image_url": "https://i.insider.com/689aa724194a2d49b8ae6086?format=jpeg",
    "titles": [
      "Mark Cuban is lauding Trump for how the POTUS has handled China and Nvidia"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "summary": "Nvidia and AMD are anticipated to pay the US government 15% of their chip sales revenue from China. This move aims to comply with new export rules. The companies are expected to navigate this requirement to continue their operations in the Chinese market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Tech Stocks Rally, Markets Up as China Boosts Liquidity",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 07:33:11 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQVnRRSlFTS0l2Snp4bVFfbXlRa0ttMDl2U1B3SnlueXlsbTE1SV9odTBHTHl6ZjE4MG0yajBORlQtMHBLT290Y29wSzFBQ1dDSE02d3Y0YmxxcXlKYlhiR1ZVcjJ6UXlMSC1VUE9WRWNyS2JHa2tYUjVhbGh2c1hhbzk0MG1xeHJmOVlkemRBczIxN29C?oc=5\" target=\"_blank\">Stocks Rise on Tech, China "
    ],
    "image_url": "",
    "titles": [
      "Stocks Rise on Tech, China Tariff Truce Extension: Markets Wrap - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "Stocks rose as tech shares rebounded and China's central bank injected liquidity into the financial system. The tech-heavy Nasdaq Composite gained 1.2%, while the S&P 500 and Dow Jones Industrial Average also saw increases. Investors are monitoring economic data and inflation concerns. The outcome is a positive market response to tech and China's monetary policy actions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "china flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Parasite Evades Immune System by Blocking Pain Signals in Humans",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 01:45:18 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists have discovered a parasite that can sneak into your skin without you feeling a thing. The worm, Schistosoma mansoni, has evolved a way to switch off the body’s pain and itch signals, letting it invade undetected. By blocking certain nerve pathways, it avoids triggering the immune system’s"
    ],
    "image_url": "",
    "titles": [
      "The parasite that turns off your body’s pain alarm and sneaks in"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.952,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Scientists have discovered that the parasite Schistosoma mansoni can enter human skin unnoticed by inhibiting pain and itch signals. It achieves this by blocking specific nerve pathways, which helps it evade the immune system's response. This adaptation allows the parasite to invade the host without detection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Mammal Species Fossil Found in Chilean Patagonia",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 03:30:17 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Scientists have discovered the fossil of a tiny mouse-sized mammal that lived in the time of the dinosaurs in Chilean Patagonia."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/this-illustration-by-m.jpg",
    "titles": [
      "Scientists find 74-million-year-old mammal fossil in Chile"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "In Chilean Patagonia, scientists found a fossil of a small mammal that lived during the dinosaur era. The discovery sheds light on ancient ecosystems. The fossil represents a new species, named Eomurucutuia diasae. This finding contributes to understanding prehistoric biodiversity and the evolution of mammals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Quantum Entanglement Achieved at Room Temperature, Boosting Computing Prospects",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 05:01:15 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/room-temperature-quantum-breakthrough-stuns-physicists/\" rel=\"nofollow\" title=\"Room-Temperature Quantum Breakthrough Stuns Physicists\"><img alt=\"Laser Hits Glass Particles\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"517\" src=\"https://scitechdaily.com/image"
    ],
    "image_url": "",
    "titles": [
      "Room-Temperature Quantum Breakthrough Stuns Physicists"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.087,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "Physicists have achieved a significant breakthrough by demonstrating quantum entanglement at room temperature, a development that could significantly advance quantum computing and communication technologies. This achievement, previously thought to be possible only at extremely low temperatures, opens new pathways for practical quantum applications in everyday environments.",
    "constructiveness_score": 0.087,
    "constructiveness_reason": "1 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/atom.svg",
      "thumbnail": "icons/atom.svg",
      "alt": "quantum",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Mexico City's Axolotls Now Rare in Wild, Hard to Spot",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 02:57:30 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Sixty years ago, residents of a canal-crossed borough in Mexico City could pluck axolotls—the large salamander reminiscent of a tiny dragon—out of the water with their hands because they were so plentiful. Now it's almost impossible to find them in the wild."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-search-for.jpg",
    "titles": [
      "Scientists search for DNA of an endangered salamander in Mexico City's canals"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "Residents of a canal-crossed borough in Mexico City used to easily find axolotls in the water 60 years ago. These large salamanders, resembling tiny dragons, are now scarce in the wild, making it difficult to spot them.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/mexico.svg",
      "thumbnail": "icons/mexico.svg",
      "alt": "mexico flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "New Mineral in Meteorite Redefines Heat Conduction Rules",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 05:31:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-stunned-by-alien-mineral-that-breaks-the-rules-of-heat/\" rel=\"nofollow\" title=\"Scientists Stunned by Alien Mineral That Breaks the Rules of Heat\"><img alt=\"Crystal Mineral Meteorite Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"h"
    ],
    "image_url": "",
    "titles": [
      "Scientists Stunned by Alien Mineral That Breaks the Rules of Heat"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary": "Scientists have discovered a novel mineral in a meteorite that exhibits unique heat conduction properties, challenging existing rules of thermal physics. This alien mineral, found in a space rock, has the ability to conduct heat in a way that contradicts previously understood principles, potentially leading to new advancements in materials science and engineering. The discovery has left researchers both surprised and intrigued by its implications for future technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "TDK backs Ultraviolette with $21M to take India-made electric motorcycles global",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 04:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Ultraviolette aims to expand its electric motorcycles to 40 European countries, as well as Latin America and Southeast Asia."
    ],
    "image_url": "",
    "titles": [
      "TDK backs Ultraviolette with $21M to take India-made electric motorcycles global"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/india.svg",
      "thumbnail": "icons/india.svg",
      "alt": "india flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Self-Forgiveness Requires Addressing Moral Injuries, Study Finds",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 23:52:41 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Flinders University researchers found that forgiving yourself isn’t just about letting go. People stuck in guilt and shame often feel trapped in the past, and true healing comes from addressing deeper moral injuries and restoring a sense of control."
    ],
    "image_url": "",
    "titles": [
      "Trapped in guilt and shame? Science explains why you can’t let go"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.915,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary": "Researchers at Flinders University discovered that self-forgiveness involves more than just moving on from guilt and shame. True healing requires addressing deeper moral injuries and regaining a sense of control, suggesting that individuals who feel trapped by their past need to confront and reconcile with their deeper moral wrongdoings to achieve genuine recovery.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 23:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models — without requiring technical expertise."
    ],
    "image_url": "",
    "titles": [
      "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 00:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Pronto has raised $11 million in an all-equity Series A round co-led by General Catalyst and Glade Brook Capital at a post-money valuation of $45 million."
    ],
    "image_url": "",
    "titles": [
      "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.853,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 17 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "High-severity WinRAR 0-day exploited for weeks by 2 groups",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 00:13:14 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Exploits allow for persistent backdooring when targets open booby-trapped archive."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/malware-threat-1000x648.jpg",
    "titles": [
      "High-severity WinRAR 0-day exploited for weeks by 2 groups"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.848,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]