[
  {
    "title": "Landslide in Sudan's Darfur Kills 1,000; Sole Survivor Found",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 11:16:49 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Up to 1,000 dead after a landslide levels a village in western Sudan, as displaced residents flee famine and war.",
      "The landslide wiped out an entire village in the Marra Mountains, according to the Sudan Liberation Movement/Army. Only one person is said to have survived.",
      "<p>Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor</p><p>More than 1,000 people were killed in a landslide in western Sudan on Sunday, according to a rebel group that controls the area.</p><p>The landslide, which followed heavy rain, destroyed th",
      "A landslide in a remote area of Darfur destroyed an entire village, a rebel group holding the territory said. Heavy rains are hampering rescue efforts.",
      "The landslide leveled a village in the remote Marra mountains, a local rebel group said. Its leader appealed for urgent help, saying, “This is a nightmare.”"
    ],
    "image_url": "",
    "titles": [
      "As many as 1,000 killed in Sudan landslide",
      "Sudan landslide kills over 1,000 people, says rebel group",
      "Sudan landslide kills at least 1,000 people, rebel group says",
      "Sudan landslide kills hundreds, U.N. says; rebel group says one survivor remains",
      "Landslide Kills Hundreds in Sudan"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.982,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A landslide in Sudan's Darfur region, caused by heavy rain, destroyed a village in the Marra Mountains, leaving over 1,000 people dead with only one survivor. The Sudan Liberation Movement/Army, which controls the area, has called for international assistance to recover bodies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Maple Leafs Extend Goalie Dennis Hildeby for 3 Years",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 02 Sep 2025 15:17:40 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Toronto Maple Leafs have signed goaltender Dennis Hildeby to a three-year contract extension, the team announced Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOcFlMWllQV2ROcEVyNnVGZDZ1YzdIMk1pejVCY3lJTVdSbmNSS29Yd0VzN0pDbWxQRGNpeTVBRDdKQ2N2TFFZc1k5Z3djOUVHSHZVSnZmV1B4UngzampZNG5RT3VEQXIzSzhDZkcwUUEzT1RCdi15RmZhZkNZY3RwWE1HcTA?oc=5\" target=\"_blank\">Maple Leafs Sign Goaltender Dennis Hildeby</a>&n",
      "<p>Toronto Maple Leafs goalie Dennis Hildeby agreed to a three-year, $2.525 million contract extension, the team announced on Tuesday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/1ff5aac8ab4287c946d3bee757ab76e1c8070a488f49d91bd756323abac4a3b3.jpg?quality=65&strip=all",
    "titles": [
      "Leafs sign goalie Hildeby to three-year extension",
      "Maple Leafs Sign Goaltender Dennis Hildeby - NHL.com",
      "Maple Leafs sign goalie Dennis Hildeby to three-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.783,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The Toronto Maple Leafs have signed goaltender Dennis Hildeby to a three-year contract extension, the team announced Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump's National Guard Deployment in LA Illegal",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 10:22:15 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "www.ft.com"
    ],
    "snippets": [
      "President Trump took control of the state's National Guard in June and deployed it to Los Angeles to face anti-immigration protestors and assist officers making detentions and deportations.",
      "US District Judge Charles Breyer questioned Trump&#039;s rationale that the Los Angeles protests constituted a &#039;rebellion&#039;.",
      "Ruling says government violated law banning US military from enforcing domestic law"
    ],
    "image_url": "",
    "titles": [
      "A California judge rules that Trump's deployment of the guard to LA was illegal",
      "US judge declares Trump’s military deployment to Los Angeles illegal",
      "Judge blocks Trump’s deployment of National Guard in California"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In June, President Trump deployed the state's National Guard to Los Angeles to address anti-immigration protests and support detainment and deportation efforts. US District Judge Charles Breyer ruled this action illegal, stating it violated laws preventing US military from engaging in domestic law enforcement. Breyer challenged Trump's classification of the protests as a 'rebellion.'",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gérard Depardieu to Stand Trial for 2018 Rape Charges",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-02T11:33:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CityNews",
      "Deutsche Welle",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The French film star is accused of raping and sexually assaulting actor Charlotte Arnould in 2018.",
      "The actress Charlotte Arnould has accused the French movie icon of raping her twice in 2018 at his home in Paris. He denies wrongdoing.",
      "<p>Judge orders case to be heard against French film star after allegations made by Charlotte Arnould about 2018 incidents</p><p>The French actor <a href=\"https://www.theguardian.com/film/gerard-depardieu\">Gérard Depardieu</a> has been ordered to stand trial on charges of raping and sexually assault",
      "PARIS (AP) — The French film star Gérard Depardieu has been ordered to stand trial before a criminal court in Paris over allegations of rape and sexual assault against actor Charlotte Arnould. “I feel relieved,” Arnould, 29, wrote on Instagram on Tuesday, announcing that she had received the investi"
    ],
    "image_url": "",
    "titles": [
      "Gerard Depardieu ordered to stand trial for rape — lawyer",
      "Gérard Depardieu Is Ordered to Stand Trial Over Rape Accusations",
      "Depardieu to stand trial over alleged rape and sexual assault of fellow actor",
      "Gérard Depardieu to face trial in Paris over rape and sexual assault allegations"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.908,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "French actor Gérard Depardieu has been ordered to stand trial on charges of raping and sexually assaulting Charlotte Arnould in 2018 at his Paris home. Arnould, who has publicly accused Depardieu of raping her twice, expressed relief at the decision. Depardieu denies any wrongdoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Will Power Leaves Team Penske After 17 Seasons, Ending Historic Partnership",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 10:28:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Ending a year of speculation, it was announced Tuesday that Will Power would not be returning to Team Penske for an 18th season.",
      "One of the most successful relationships in IndyCar history has ended as Team Penske and 2-time IndyCar Champion and 2018 Indianapolis 500 winner Will Power have split.",
      "<p>Will Power, the consummate company man who won two IndyCar titles and the Indianapolis 500 for Roger Penske, will not return to Team Penske for an 18th season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Two-time IndyCar champ Power out at Penske",
      "After 17 Seasons Team Penske Will Not Re-Sign IndyCar Great Will Power",
      "Will Power won’t return to Team Penske will not return for 18th season"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Will Power, a two-time IndyCar Champion and 2018 Indianapolis 500 winner, will not return to Team Penske for an 18th season, ending one of the most successful partnerships in IndyCar history. This decision concludes a year of speculation about Power's future with the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Padres' Jason Adam Injured, Carted Off Field in Game vs Orioles",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 10:28:07 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "All-Star reliever Jason Adam was carted off the field after getting injured in the seventh inning of the Padres' loss to the Orioles on Monday.",
      "San Diego loses a key high-leverage reliever with the playoffs approaching",
      "<p>All-Star reliever Jason Adam of the San Diego Padres was carted off the field after getting injured in the seventh inning Monday against the Baltimore Orioles.</p>"
    ],
    "image_url": "",
    "titles": [
      "Pads reliever Adam suffers ruptured quad tendon",
      "Jason Adam injury: Padres All-Star RP suffers ruptured quad in loss to Orioles, reveals recovery timeline",
      "Padres reliever Jason Adam carted off field with ruptured quadriceps tendon"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "All-Star reliever Jason Adam of the San Diego Padres was carted off the field due to an injury during the seventh inning of Monday's game against the Baltimore Orioles. This injury poses a significant loss for San Diego as they approach the playoffs, losing a key high-leverage reliever.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kraft Heinz to Split into Two Public Companies, Confirming Speculations",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 15:49:34 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times",
      "MarketWatch"
    ],
    "domains": [
      "www.theguardian.com",
      "www.marketwatch.com",
      "www.ft.com"
    ],
    "snippets": [
      "Split will undo 2015 tie-up orchestrated by Warren Buffett and investment group 3G Capital",
      "<p>Chicago-based food group says it will split into two publicly traded companies through tax-free spin-off</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest ",
      "Ten years after Warren Buffett backed the merger of Kraft Foods and Heinz, the combined company is breaking up, as Kraft Heinz Co. on Tuesday confirmed what Wall Street has expected for months."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5d9d5199-705d-4982-b44d-f87f63b9d8b0.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Kraft Heinz announces break-up a decade after megamerger",
      "Kraft Heinz to split a decade after merger in bid to revive growth",
      "Big Warren Buffett–backed merger calls it quits as Kraft Heinz announces breakup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kraft Heinz Co., formed by a merger in 2015 supported by Warren Buffett and 3G Capital, announced it will split into two separate publicly traded companies through a tax-free spin-off. This move comes ten years after the original merger, confirming recent Wall Street expectations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bolsonaro Faces 40-Year Sentence in Coup Plot Trial",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "Prosecutors in Jair Bolsonaro's coup-plotting trial deliver closing arguments this week, with the former Brazilian president facing a possible 40-year sentence.",
      "The former president is charged with five counts, including plotting the assassination of senior officials.",
      "Former Brazilian president in court along with seven others accused of failed power grab after 2022 election loss.",
      "The former Brazilian president is charged with planning a coup after losing the 2022 elections. He says he pursued only legal avenues to remain in power. Here is what to know about the trial."
    ],
    "image_url": "",
    "titles": [
      "Brazil's ex-President Bolsonaro coup trial begins — here's what to know",
      "Trial of Brazil’s Bolsonaro enters verdict phase over alleged coup plot",
      "Why is Brazil’s Jair Bolsonaro on trial — and what’s next?",
      "What to Know About Jair Bolsonaro’s Coup Plot Trial"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prosecutors delivered closing arguments in the trial of former Brazilian President Jair Bolsonaro, who faces a potential 40-year sentence for plotting a coup after his 2022 election loss. Charged with five counts, including planning the assassination of senior officials, Bolsonaro is on trial alongside seven others for attempting a failed power grab. Bolsonaro maintains he sought only legal means to stay in power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Houston Man Charged in Fatal Shooting of Boy in Prank Incident",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 11:05:08 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News",
      "Global News"
    ],
    "domains": [
      "www.theguardian.com",
      "globalnews.ca",
      "abcnews.go.com"
    ],
    "snippets": [
      "A man has been charged with murder in the shooting of a Houston boy who police said was playing a door-knocking prank on a neighbor's home.",
      "<p>Leon Gonzalo Jr, 42, was arrested and charged with murder in connection with the Houston shooting</p><p>A 42-year-old man in Texas has been charged with murder after the fatal <a href=\"https://www.theguardian.com/us-news/2025/sep/01/houston-boy-shot-doorbell-ringing-prank\">shooting of an 11-year-",
      "Houston police said the victim and his friends were playing a game of 'ding dong ditch,' when someone rings a doorbell and then runs away."
    ],
    "image_url": "https://s.abcnews.com/images/US/Gonzalo-Leon-ht-gmh-250902_1756822391494_hpMain_4x3t_384.jpg",
    "titles": [
      "Man charged with murder in door-knock prank shooting of 11-year-old boy",
      "Texas man charged after 11-year-old boy shot dead while playing doorbell prank",
      "11-year-old boy shot, killed during ‘ding dong ditch’ prank, man charged with murder"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.978,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 42-year-old man, Leon Gonzalo Jr, has been charged with murder following the fatal shooting of an 11-year-old boy in Houston. The incident occurred while the boy and his friends were engaged in a \"ding dong ditch\" prank.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Carmaker Hit by Cyberattack, Staff Sent Home, No Customer Data Breached",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 15:44:44 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Staff were sent home and the company shut down its IT systems in an effort to minimise the damage done.",
      "UK carmaker forced to shut down systems but says no evidence so far customer data stolen",
      "<p>Carmaker says it has shut down its systems but there is no evidence customer data has been stolen</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d270/live/49dd2890-8805-11f0-8c43-13009d7c5281.jpg",
    "titles": [
      "Jaguar Land Rover production severely hit by cyber-attack",
      "Jaguar Land Rover says production ‘severely’ disrupted by cyber incident",
      "Jaguar Land Rover manufacturing and retail ‘severely disrupted’ by cyber incident"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.971,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A UK carmaker experienced a cybersecurity incident, leading to staff being sent home and the shutdown of its IT systems to limit damage. Despite these measures, the company has found no evidence that customer data was compromised.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Judge Rules National Guard's ICE Raid Involvement in LA Illegal",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 13:38:40 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE8zaHF1QU9SMnFGeFR6bENuTDBOYW02SFFMU3kyRUJQVzRpSUIwYnVZa3hFMjRDVjdqX0ZVQ1lEbElDVEtzQ083WHZOcU5qRG9wZmhCU0xpay1Kcjh1YnQ4THc1X0hGRThpZzlfQ2ZGVQ?oc=5\" target=\"_blank\">National Guard illegally performed law enforcement in LA, judge rules</a>&nbs",
      "The ruling from Judge Charles Breyer in San Francisco federal court comes as Trump mulls deploying National Guard troops to other cities to deal with crime.",
      "<p>Judge said administration violated federal law by sending troops to accompany Ice agents on immigration raids</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates\">US politics li"
    ],
    "image_url": "",
    "titles": [
      "National Guard illegally performed law enforcement in LA, judge rules - Axios",
      "Trump can’t use National Guard, military in California to enforce laws, Judge Breyer rules",
      "Trump illegally deployed national guard during LA Ice protests, judge rules"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge in San Francisco, Charles Breyer, ruled that the National Guard's involvement in law enforcement activities in Los Angeles, specifically accompanying ICE agents on immigration raids, was illegal under federal law. This decision comes amid considerations by the Trump administration to deploy National Guard troops to various cities to address crime.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Massive Earthquake Hits Afghanistan, Death Toll Rises",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 08:23:18 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Rescuers are hampered by mountainous terrain and roads strewn with debris.",
      "Families are searching for loved ones under the rubble in eastern Afghanistan after a magnitude 6 quake wiped villages.",
      "As the death toll climbs past 1,400, rescue workers are trying to reach survivors in the isolated regions of Afghanistan that were ravaged by a massive earthquake."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ce86/live/de70a340-87cb-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Aerial search for survivors after Afghan quake kills 800 people",
      "Families search for survivors under rubble after Afghan earthquake",
      "Afghanistan earthquake: Search on for survivors in remote areas"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.833,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A massive earthquake has devastated isolated regions in Afghanistan, leading to an increasing death toll. Ehsanullah Ehsan, the provincial head of disaster management, stated that the number of bodies trapped cannot be predicted. Rescue workers are currently trying to reach survivors amidst the destruction.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick's NC Team Faces Major Loss in Season Opener Against TCU",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 04:25:31 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "thelistwire.usatoday.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Belichick's squad posted one of the worst games in program history to open a season",
      "Social media had plenty of reactions and thoughts on Bill Belichick's debut loss to TCU with North Carolina.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQZnZzNXVmY0tFRDJBd0gzbUE4ODg4M3ZvcmhWV0lnbGZrUVR0cFF6a3k3a2paX3EwU1NYSW84cTdHeTBMOXNraFg2WmMwS2w4LXI5N0JpUDNvMmVPM3pYNUFsN1lIanhQb1Ziakw1di1OcVY1QzNtc3NqVjNwNHNCQ3RjeTV6STA?oc=5\" target=\"_blank\">SI:AM | North Carolina Smoked by TCU in Bill",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPUDZwT3J2ZkYtNmxuN0pqRE1FVEE2YTRnTVJvdjBObjYtRUVNWlEtbGctRFYzRnhQZGJpb3BnaFdGc2FwbTI5ZmFoZFdQZXpZalhmaElNeXNuVlZGSXF6S2UtVlhVVXJWUDBDM1RjTjg2VFFDc0VjX3RZblE0TExEeHllYTRyVzhQNkhsclZEdm0?oc=5\" target=\"_blank\">National reaction after Bill Bel",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQWTNyUXpyalZsYWZkVlhPMkJxUFc3RUZJeWdGdEMzXy1fYlpYdzUtZzJVX1Rua21ObTB5WjhaZ0d6ZWk0Q0E3V2hfdGxyM1luWWtWcjdDTUR5T2xOUlcwM283aTJNaThucW9WcFJoSXNkYmlTd2UxN0pCVUFkU1N1NUc3TEZUTldMZjBDbQ?oc=5\" target=\"_blank\">Football Fans Had All the Jokes After"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/02/1c4ff300-db90-44d5-acc0-c2e553070559/heels.jpg",
    "titles": [
      "By the numbers: Why Bill Belichick's UNC debut was a disaster for the ages at North Carolina",
      "Best social media reactions to Bill Belichick's college coaching debut with North Carolina",
      "SI:AM | North Carolina Smoked by TCU in Bill Belichick’s Ugly Debut - Sports Illustrated",
      "National reaction after Bill Belichick's shocking college football debut - Sports Illustrated",
      "Football Fans Had All the Jokes After UNC's Blowout Loss in Bill Belichick Debut - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.783,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bill Belichick's North Carolina team suffered a significant defeat to TCU in what was described as one of the program's worst season openers. The loss prompted a wide range of reactions and commentary across social media, highlighting the unexpected and disappointing performance of Belichick's squad.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Final Month of Baseball Season: Playoff Spots and Records in Play",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 11:46:50 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "With less than a month left to play in the 2025 regular season, here's what our experts think will happen the rest of the way.",
      "Here's what you need to know about the battles to reach October as teams trying to lock up a postseason spot.",
      "Will there be a no-hitter? How about a 100-win team? There's plenty to sort out in the final month"
    ],
    "image_url": "",
    "titles": [
      "MLB September predictions: From best record to playoff races and more",
      "Welcome to September! Ranking the MLB playoff races that will rule the final month",
      "MLB September storylines: Playoff races heat up, Aaron Judge vs. Cal Raleigh, milestone chases and more"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "With less than a month remaining in the 2025 regular baseball season, experts are analyzing the potential outcomes as teams vie for postseason positions. Key points of speculation include the possibility of a no-hitter and whether any team will achieve over 100 wins. The final month is crucial for teams aiming to secure a spot in October's playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nestlé Fires CEO Freixe Over Conduct, Names Navratil New Chief",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 22:49:52 GMT",
    "source": "Axios",
    "sources": [
      "Washington Post",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZjZYNnVqb25tcGUzeTZkeHN3REFlckdRVUhNUW9uQldPUWo0Nms2cGJ0TmdXdmtxWFk2NThQSGZxSmRLaWtKcnpmQUozdS1tR2tJUmZTUUJOYlR5MnM1clZNc2lRQVVHYkd2ZUhITExLV0VvN2N5T1JfOWhLRjBuN0ZQZ2dRQ203MDRB?oc=5\" target=\"_blank\">Nestlé fires CEO Laurent Freixe over \"r",
      "<p>Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement</p><p>Nestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached i",
      "The Swiss food giant said Laurent Freixe’s dismissal was effective immediately and named longtime executive Philipp Navratil as its new CEO."
    ],
    "image_url": "",
    "titles": [
      "Nestlé fires CEO Laurent Freixe over \"romantic relationship\" with employee - Axios",
      "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "Nestlé removes CEO after investigation into relationship with subordinate"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.683,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nestlé dismissed CEO Laurent Freixe for failing to disclose a romantic relationship with a direct subordinate, breaching the company's code of conduct. Philipp Navratil, previously of Nestlé Nespresso, was appointed as the new CEO, marking the company's third chief executive change in just over a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Longhorns Drop in Top 25 After Loss to Buckeyes, Outlook Not Bleak",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 09:50:03 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "What did we learn in Week 1 and how did it affect our Top 25?",
      "The Longhorns faltered against the Buckeyes, but evidence suggests the sky is indeed not falling"
    ],
    "image_url": "",
    "titles": [
      "College football Power Rankings: First impressions of each Top 25 team",
      "Tom Fornelli's College Football Power Ratings: Ohio State on top; why Texas holds firm at No. 2 after loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 1, the Longhorns lost to the Buckeyes, impacting their position in the Top 25 rankings. Despite the loss, analysis indicates that the situation for the Longhorns is not as dire as it may seem.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company to Launch Teen Mental Health Feature Amid Lawsuit",
    "domain": "technology",
    "source_domain": "www.lemonde.fr",
    "location": "global",
    "published": "Tue, 02 Sep 2025 16:19:29 +0200",
    "source": "Le Monde",
    "sources": [
      "Ars Technica",
      "Le Monde"
    ],
    "domains": [
      "www.lemonde.fr",
      "arstechnica.com"
    ],
    "snippets": [
      "L’option arrivera dans le courant du mois, affirme l’entreprise, et devrait permettre de surveiller la santé psychologique des adolescents. L’annonce survient alors qu’un couple d’Américains a porté plainte contre OpenAI après le suicide de leur fils.",
      "Promised protections follow reports of vulnerable users misled in extended chats."
    ],
    "image_url": "https://img.lemde.fr/2025/09/02/500/0/6000/3000/644/322/60/0/9575045_ftp-import-images-1-5bd08di4xfi3-5776226-01-06.jpg",
    "titles": [
      "OpenAI va instaurer un contrôle parental sur ChatGPT",
      "OpenAI announces parental controls for ChatGPT after teen suicide lawsuit"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An upcoming feature aimed at monitoring the mental health of teenagers will be launched by a company within the month. This announcement comes after a lawsuit was filed by a U.S. couple against OpenAI, blaming the firm for their son's suicide. The initiative seeks to address concerns about the safety of vulnerable users in extended chats.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump's Troop Deployment in LA Unlawful, Limits Future Actions",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 11:46:37 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The Trump administration's use of federal troops in Los Angeles to conduct law enforcement operations is unlawful, a federal judge ruled on Tuesday.",
      "The decision could limit Trump’s ability to send the National Guard to other cities, as he threatens to send troops to Chicago."
    ],
    "image_url": "https://s.abcnews.com/images/US/cali-national-guard-gty-jef-250902_1756820705361_hpMain_4x3t_384.jpg",
    "titles": [
      "Use of federal troops in Los Angeles is unlawful, judge says",
      "Trump’s Los Angeles Takeover Violated Federal Law, Judge Rules"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge ruled on Tuesday that the Trump administration's deployment of federal troops for law enforcement operations in Los Angeles is unlawful. This decision may restrict Trump's capacity to deploy the National Guard to cities like Chicago, as he has threatened.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MrBeast Plans to Launch Mobile Phone Company, Expanding Brand",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-02T14:33:31Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "MrBeast has plans for a mobile phone company, following an MVNO playbook adopted by celebrities like Ryan Reynolds and the \"SmartLess\" podcast.",
      "MrBeast, the 27-year-old popular YouTuber, plans to launch a phone company as he diversifies his brand."
    ],
    "image_url": "https://i.insider.com/68b6f3f0cfc04e97619c6597?format=jpeg",
    "titles": [
      "MrBeast has plans for a phone company in the mold of Ryan Reynolds' Mint Mobile",
      "MrBeast reportedly plans to launch a phone company"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "MrBeast, a 27-year-old YouTuber, intends to start his own mobile phone company, following a strategy similar to celebrities like Ryan Reynolds. This move is part of his efforts to expand his brand.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Scores 131 in ODI Series Opener Against South Africa; Overton Takes Brea",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 15:47:51 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>England are skittled for 131 at Headingley</p></li><li><p><a href=\"https://www.theguardian.com/sport/2025/sep/01/jamie-overton-indefinite-break-red-ball-cricket-england\">Baker set for debut as Overton takes ‘indefinite break’</a></p></li></ul><p><strong>1st over: England 8-0 (Duckett 0, S",
      "Latest score from Headingley as England begin a three-match one-day international series against South Africa. Watch live on Sky Sports Cricket."
    ],
    "image_url": "https://i.guim.co.uk/img/media/c4f0efbc841208a436287c4806ff0e4d170cfc5c/592_30_5440_4352/master/5440.jpg?width=140&quality=85&auto=format&fit=max&s=28ea570cfaff97d252866801adb76b8d",
    "titles": [
      "England v South Africa: first men’s one-day international – live",
      "Scorecard: England vs South Africa, first ODI"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England was bowled out for 131 at Headingley during the first match of a three-match one-day international series against South Africa. In related news, Jamie Overton has taken an indefinite break from red-ball cricket, leading to Baker's debut for the team. The match is being broadcast live on Sky Sports Cricket.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sainsbury's Tests Shoplifter Detection Tech in London and Bath",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 13:15:50 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Sainsbury's says the technology is part of efforts to identify shoplifters to curb retail crime.",
      "<p>Retailer starts eight-week trial at stores in London and Bath before potentially expanding nationwide</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest upd"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a6a7/live/a3557aa0-87f9-11f0-be14-b712a0c48110.jpg",
    "titles": [
      "Sainsbury's to trial facial recognition to catch shoplifters",
      "Sainsbury’s tests facial recognition technology in effort to tackle shoplifting"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sainsbury's has initiated an eight-week trial of technology aimed at identifying shoplifters in London and Bath stores, as part of efforts to reduce retail crime. The trial could expand nationwide depending on its success.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Borrowing Costs Rise, Pressuring Chancellor Ahead of Budget",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 13:38:10 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The cost of government borrowing has risen again - what does it mean for the public finances and upcoming Budget?",
      "Rise in gilt yields adds to pressure on chancellor Rachel Reeves ahead of Budget"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5ebf/live/24076500-87ff-11f0-be14-b712a0c48110.jpg",
    "titles": [
      "What's causing the UK's long-term borrowing costs to rise?",
      "Pound falls as UK long-term borrowing costs hit highest level since 1998"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The cost of government borrowing has increased, indicated by a rise in gilt yields. This development adds financial pressure on Chancellor Rachel Reeves as she prepares for the upcoming Budget, impacting public finances.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Klarna Files for U.S. IPO, Seeks Up to $1.27B, Valuation at $14B",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 13:05:45 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Swedish fintech firm Klarna is aiming to raise up to $1.27 billion in its long-awaited U.S. initial public offering, according to its official filing on Tuesday.",
      "Swedish buy now, pay later (BNPL) startup Klarna and its shareholders are reviving its initial public offering, hoping to raise as much as $1.27 billion in a listing that would value the company at up to $14 billion."
    ],
    "image_url": "",
    "titles": [
      "Klarna aims to raise up to $1.27 billion in U.S. IPO",
      "Klarna revives IPO plans, aims to raise $1.27B"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Swedish fintech company Klarna, specializing in buy now, pay later services, has officially filed for a U.S. initial public offering (IPO) with the aim of raising up to $1.27 billion. This move could value Klarna at up to $14 billion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kraft Heinz to Split Into Two Companies, Reversing $46B Merger",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 12:40:51 GMT",
    "source": "Axios",
    "sources": [
      "Financial Post",
      "Axios"
    ],
    "domains": [
      "financialpost.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTFA4R2pIdmlVc2lscWhFaEVqcVBvbk1lekNnSEpzVHZVR1E2Q3dEWjhjNjQ5aEd6ZWJPRjFIX3FsX09jX09PbTJEeHlodmozSGpKcG1UeWFPUkxtMlhwMlNZdWI0Z1RQQV80enB5NQ?oc=5\" target=\"_blank\">Kraft Heinz to break up into two separate companies</a>&nbsp;&nbsp;<font color=\"#",
      "Unwinds US$46-billion merger that united two iconic brands a decade ago"
    ],
    "image_url": "",
    "titles": [
      "Kraft Heinz to break up into two separate companies - Axios",
      "Kraft Heinz to separate into two publicly traded companies"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kraft Heinz announced it will split into two independent companies, undoing a US$46-billion merger from ten years ago. This decision aims to separate their operations into distinct entities, focusing on their respective market strengths.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Sales Offer Big Discounts on TVs, School Supplies Ahead of Sports Seas",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-02T10:49:03-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Labor Day weekend is over, which means the symbolic end of summer has passed. On a more positive note, dozens of the best Labor Day deals are still around, so you still have time to take advantage of them if you spent the long weekend offline. For a limited time, you can save on a [&#8230;]",
      "Labor Day weekend marks the unofficial end of summer, which is a bit sad, but it’s a great time to get a deal on a fancy, new TV. The US holiday is happening just before the start of the 2025-2026 NFL season, the World Cup qualifiers, and the lead-up to the MLB post-season games. This [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "The 71 best Labor Day deals you can still get",
      "The best Labor Day TV sales"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.972,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.462,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Labor Day weekend, marking the unofficial end of summer, brings a wave of sales on a wide range of products, including big-screen OLED TVs and back-to-school essentials. Coinciding with the lead-up to major sports events, such as the 2025-2026 NFL season, World Cup qualifiers, and MLB post-season games, the holiday offers extensive discounts. Comprehensive guides have been compiled to help shoppers navigate nearly 100 deals considered worth the investment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]