[
  {
    "title": "King Arthur wants to automate your sourdough starter",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:51:06-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Sourdough Sidekick is a new countertop appliance designed to automatically feed sourdough starters, ensuring they are ready for baking when needed. This product is a collaboration by FirstBuild."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9885756955555556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4571439238888889,
    "summary": "The Sourdough Sidekick is a countertop appliance created by FirstBuild that automatically feeds sourdough starters, making them ready for use in baking."
  },
  {
    "title": "Trump pardons ex-Nikola CEO Trevor Milton",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:39:55-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trevor Milton, the founder of Nikola Motors, was pardoned by President Donald Trump after being convicted of defrauding investors by lying about the capabilities of his zero-emission truck company, including claims about building its own electric truck, the Nikola One. The White House confirmed the pardon on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9807900914004629,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4551975228501157,
    "summary": "Trevor Milton, founder of Nikola Motors, was pardoned by President Donald Trump following his conviction for defrauding investors by making false claims about his company's zero-emission trucks. The White House confirmed the pardon on Friday."
  },
  {
    "title": "Google’s Pixel 9A will launch on April 10th",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:35:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google will launch the Pixel 9A in the US, Canada, and the UK on April 10th, following a delay due to a \"component quality issue\" after its March 19th reveal. The budget-friendly smartphone will also be released in the rest of Europe at a later date."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9776926210416667,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45442315526041666,
    "summary": "Google is set to release the Pixel 9A in the US, Canada, and the UK on April 10th, after a delay related to a \"component quality issue\" post its March 19th reveal. The budget smartphone will launch in the rest of Europe later."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:33:47-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. This event, running through March 31, 2025, offers discounts on gardening supplies, bedding, and more."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9764920670949074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4541230167737269,
    "summary": "Amazon has started its Big Spring Sale, offering discounts on items like gardening supplies and bedding. The sale runs until March 31, 2025, marking the beginning of the warmer season."
  },
  {
    "title": "NASA and Boeing investigate Starliner&#8217;s &#8216;anomalies&#8217; before its next crewed flight",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:15:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NASA and Boeing are addressing technical problems with the Starliner spacecraft to prepare for a potential crewed flight later this year or early next. The issues had previously prevented the spacecraft from returning astronauts to Earth."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9637552967824075,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45093882419560183,
    "summary": "NASA and Boeing are working together to fix technical issues with the Starliner spacecraft, aiming for a crewed flight possibly later this year or early next year. These problems had earlier hindered the spacecraft's ability to safely return astronauts to Earth."
  },
  {
    "title": "Helldivers 2 is locking out players who use older CPUs",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:13:41-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Players of Helldivers 2 on older CPUs are facing issues running the game due to a requirement for AVX2 support, a feature present in CPUs since 2013. This requirement comes from the game's developer, Arrowhead Game Studios, and its publisher, Sony."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9624836512962963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4506209128240741,
    "summary": "Helldivers 2 is experiencing compatibility issues on older CPUs because it requires AVX2 support, a feature available in CPUs since 2013. This requirement is set by the game's developer, Arrowhead Game Studios, and its publisher, Sony."
  },
  {
    "title": "First Alert’s new smart smoke alarm is meant to be a Google Nest Protect replacement",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:01:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "First Alert introduced a new smart smoke and carbon monoxide (CO) alarm line compatible with Google Home. This launch comes after Google decided to stop its Nest Protect smart smoke alarm and announced a partnership with First Alert for this new product."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9537855209143519,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44844638022858796,
    "summary": "First Alert has launched a new line of smart smoke and carbon monoxide alarms that are compatible with Google Home. This development follows Google's decision to discontinue its Nest Protect smart smoke alarm and enter into a partnership with First Alert for these new products."
  },
  {
    "title": "Yale’s new smart lock can match your Google Nest doorbell",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Yale has introduced a new smart lock compatible with the Google Home ecosystem, designed to work alongside Google's Nest video doorbells. Additionally, the Yale Smart Lock features Matter-over-Thread compatibility, enabling it to function with Apple Home, Amazon Alexa, and Samsung platforms. This announcement comes after Google decided to discontinue its Nest x Yale Lock."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9529436775578704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4482359193894676,
    "summary": "Yale launched a new smart lock that works with Google Home and Nest video doorbells. It also supports Matter-over-Thread, making it compatible with Apple Home, Amazon Alexa, and Samsung platforms. This follows Google's discontinuation of the Nest x Yale Lock."
  },
  {
    "title": "Google discontinues Nest Protect smoke alarm and Nest x Yale door lock",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has announced the discontinuation of the Nest Protect Smart Smoke and CO alarm and the Nest x Yale smart door lock. The Nest Protect, known for being a top smart smoke alarm, has been difficult to purchase recently."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9529310136574074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44823275341435187,
    "summary": "Google has announced it will discontinue the Nest Protect Smart Smoke and CO alarm and the Nest x Yale smart door lock. The Nest Protect, a leading smart smoke alarm, has recently faced availability issues."
  },
  {
    "title": "In Baby Steps, I stumbled through a refreshing kind of open world",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bennett Foddy, known for creating challenging games like QWOP and Getting Over It, has released a new game titled Baby Steps. Like his previous works, Baby Steps combines difficult physics with thoughtful design, providing a gameplay experience that is both frustrating and meditative."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9529149576273148,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4482287394068287,
    "summary": "Bennett Foddy, the creator of QWOP and Getting Over It, has launched a new game called Baby Steps. Continuing his tradition, the game features challenging physics and thoughtful design, offering players a gameplay experience that is both frustrating and meditative."
  },
  {
    "title": "State of emergency declared in Myanmar after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:17:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake struck central Myanmar, with the tremors also felt in regions of south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A powerful earthquake hit central Myanmar, with its effects also felt in parts of south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building in Thailand's capital has collapsed, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed. There are concerns that workers might be trapped in the debris."
  },
  {
    "title": "BBC reporter on desperate search for survivors in rubble of 30-storey building",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 13:14:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A search and rescue operation is currently taking place at a collapsed tower in Bangkok, with teams on the ground working to find and aid any survivors. Panisa Aemocha is reporting from the scene, highlighting the urgency and concern surrounding the effort."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A search and rescue operation is underway at a collapsed tower in Bangkok. Teams are actively seeking and assisting survivors, with Panisa Aemocha reporting from the site, emphasizing the critical nature of the rescue efforts."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah location in response to two rockets launched from southern Lebanon into northern Israel."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah site after two rockets were fired from southern Lebanon into northern Israel."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but stated they were unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" but clarified they are not connected to Moscow's activities in the region."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing a 1979 disco song titled \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is perceived as an effort to question the legitimacy of the current government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event is viewed as an attempt to challenge the legitimacy of the existing government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests calling for the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, demanding the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order for his vice-president to concentrate on the operations and activities of the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, although further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children have died in a recent incident, but additional information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda has reported to the BBC that she lacks any information regarding her son, who was deported from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was deported from the US to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid a resurgence of opposition forces."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from opposition groups."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The music icon was murdered by the founder of her fan club. The perpetrator's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The music icon was killed by her fan club's founder, who has had their first parole request denied in Texas."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies have pledged to retaliate against the United States, with China specifically accusing Washington of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies, including China, have announced plans to retaliate against the United States, accusing it of violating international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in connection with the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter for the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology in question was reportedly developed with assistance from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed with the help of Russian expertise, analysts report."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was arrested with the help of a local resident, police say."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man concealed under a child's bed when the child mentioned seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his residence, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his residence, as stated by his party."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck amid challenges including a civil war, food shortages, and a worsening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has occurred in a region already facing a civil war, food shortages, and a deteriorating economy."
  },
  {
    "title": "Residents describe horror in aftermath of earthquake in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:35:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A resident of Yangon, Myanmar's largest city, reported to the BBC that the area experienced tremors lasting approximately four minutes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A resident in Yangon, Myanmar's largest city, reported experiencing tremors for about four minutes, according to the BBC."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her lack of fear in her career, citing Charli XCX and Sabrina Carpenter as major inspirations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed confidence in her career, attributing her lack of fear to the influence of artists Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local factors is making it challenging for the government to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic issues is complicating the government's efforts to win re-election for a second term."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that visualizes the migration of ancestors across the globe over time, transforming traditional family trees into dynamic movies. This innovative approach can also be applied to study the spread of diseases and track animal movements across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns the migration patterns of ancestors into dynamic visual movies, rather than static family trees. This method not only helps in understanding human ancestral movements but is also useful in tracking the spread of diseases and animal migration across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades can be attributed to increased meltwater and rainfall in the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that 60% of the difference in predicted vs. actual ocean temperatures near Antarctica over many years is due to more meltwater and rainfall in that area."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that people with Long COVID often feel ignored, doubted, and unsupported by their healthcare providers, indicating a significant gap in patient-provider communication and care for those affected by the condition."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions originate from various precursor cells and have distinct gene regulation. This discovery highlights a potential factor in the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that vertebrates' skeletal cells come from different precursor cells in various body regions, each with unique gene regulation. This diversity may contribute to vertebrates' evolutionary success."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a new non-invasive method using terahertz (THz) imaging to create high-resolution, 3D visualizations of cochlear structures in mice. This advancement may improve diagnostics for hearing loss and other conditions, potentially leading to the creation of miniaturized THz diagnostic devices. This technology promises to enhance diagnostic accuracy, speed, and patient outcomes in various medical fields."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a non-invasive technique using terahertz imaging to produce detailed 3D images of cochlear structures in mice. This method could enhance diagnostics for hearing loss and other conditions, potentially leading to smaller diagnostic devices. The technology aims to improve diagnostic precision, speed, and patient outcomes across multiple medical areas."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will help scientists counteract the misuse of science for political purposes by encouraging them to speak up."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, promotes adding eugenics to college genetics curriculums. He argues this will aid scientists in combating the misuse of science for political reasons by motivating them to voice their concerns."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from twelve parks in Dublin, Ireland, showed that the entrances of these parks contain higher levels of infective roundworm eggs than other areas within the parks."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, has overturned the sexual assault conviction of Brazilian soccer player Dani Alves. This decision was announced on Friday."
  },
  {
    "title": "Ex-Tulane wing Williams commits to Kentucky",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tulane wing Kam Williams, recognized as one of the top shooters available in the transfer portal, has committed to playing for Mark Pope at Kentucky, he confirmed to ESPN on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kam Williams, a former Tulane wing known for his shooting skills, has committed to playing basketball at Kentucky under coach Mark Pope, as confirmed to ESPN."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased his talent with a standout performance during a game against Arizona, contributing 30 points, 6 rebounds, 7 assists, and 3 blocks to secure a 100-93 victory. This win propels the Blue Devils into the Elite Eight for the second consecutive season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg, playing for Duke University, delivered an impressive performance in a basketball game against Arizona, scoring 30 points, making 6 rebounds, 7 assists, and 3 blocks. This effort helped Duke win 100-93, advancing them to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers on Thursday night. This dramatic shot is considered one of the season's most thrilling finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, scored a 47-foot 3-pointer from half court at the buzzer, leading to a 119-117 victory over the Los Angeles Lakers on Thursday. This shot is highlighted as one of the NBA season's most exciting finishes."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech a place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored the winning basket with 7.3 seconds left in overtime, helping Texas Tech defeat Arkansas 85-83. Texas Tech overcame a 16-point deficit to secure a spot in the Elite Eight."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to scapegoat him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He accuses the NCAA and the university of conspiring to make him a scapegoat."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After Thursday's game, Alex Ovechkin led his Washington Capitals teammates in a postgame handshake with Marc-Andre Fleury, the retiring goalie for the Minnesota Wild, as a sign of respect for Fleury's career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following Thursday's game, Alex Ovechkin and his Washington Capitals teammates participated in a postgame handshake with Marc-Andre Fleury, the Minnesota Wild's retiring goalie, as a gesture of respect for Fleury's career."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:19 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking an impactful moment especially after rumors of him being traded in the offseason. His performance was well-received by Cardinals fans, who celebrated by giving him a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amid offseason trade rumors. His performance led to a celebration among Cardinals fans, who honored him with a curtain call."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings. The article discusses which of these athletes has taken the top spot, comparing their performances and contributions to their teams."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the latest Sweet 16 player rankings, focusing on their performances and team contributions. The article ranks these athletes, determining who occupies the top position among them."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:56:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's push towards a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players in Notre Dame's pursuit of a championship title, showcasing their significant contributions to the team's success."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight of the NCAA basketball tournament has been determined after Thursday's games. Four matchups took place, setting the stage for the next round of competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight teams in the NCAA basketball tournament were decided after Thursday's games, which featured four matchups. These games have now set the stage for the next round of the tournament."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' Opening Day ballpark in a span of four days. This quick turnaround involved significant logistical and operational efforts to ensure it was ready for the start of the baseball season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was rapidly converted into the Rays' Opening Day ballpark in just four days, showcasing a significant logistical and operational achievement to prepare for the baseball season's start."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:55:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record number of 3-point attempts in the league, raising questions about whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, sparking discussions on whether there should be actions taken to reduce the number of these attempts."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a night that also highlighted Travis Hunter and his potential NFL future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record during a game that also showcased Travis Hunter's promising NFL prospects."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder who previously battled depression is now aiming to qualify for the 2026 Olympics. She will compete at the World Championships on Saturday, having rediscovered her passion for the sport."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, who overcame depression, is targeting a spot in the 2026 Olympics. She's set to compete in the World Championships on Saturday, rejuvenated with a newfound enthusiasm for snowboarding."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "There's a discussion among players, executives, and analysts about whether there's a change in how soccer is being played or officiated, focusing on whether players are adopting a cleaner style of play or if referees are becoming more lenient in their decisions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "There is an ongoing debate among soccer players, executives, and analysts regarding a potential shift in the sport's dynamics, specifically questioning if there has been a move towards a cleaner style of play by players or if referees are showing more leniency in their officiating decisions."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, evaluating each team's performance up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is being determined as a panel has voted to assess the performance of each team up to April 17, making the competition's outlook clearer."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, Fulham's left back, has had an exceptional season, establishing himself as one of the top players in his position globally. He also has high aspirations for his future with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, the left back for Fulham, has had an outstanding season, making him one of the leading players worldwide in his role. He also aims for significant achievements with the U.S. national team."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unusual series of events. Since his arrival, he has fully embraced his experience at the university, showing no regrets about how he ended up there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue involved a unique sequence of events. Since joining the university, he has fully accepted his experience, expressing no regrets about his journey there."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears, a team previously known for their success, have overcome significant challenges and a period of hardship, positioning themselves as contenders for a championship title once more."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears, a team with a history of success, have navigated through substantial challenges and a difficult period. They are now considered contenders for a championship title again."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States midfielder Johnny Cardoso, currently with Real Betis, has expressed increased confidence amid speculation linking him with a move to the Premier League."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States midfielder Johnny Cardoso, who plays for Real Betis, has shown greater confidence as rumors suggest he may transfer to a Premier League team."
  },
  {
    "title": "Sources: Griezmann staying put amid MLS links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to ESPN sources, despite his expressed desire to play in Major League Soccer (MLS) in the future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, as per ESPN sources. This decision comes even though he has shown interest in moving to Major League Soccer (MLS) eventually."
  },
  {
    "title": "Canada could face legal action in Davies injury row",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal steps against the Canadian soccer federation due to a significant knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation over a severe knee injury suffered by Alphonso Davies."
  },
  {
    "title": "Chelsea captain Bright warns Barça : 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:41:12 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mindset and expressed enthusiasm for competing against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's outstanding mindset and showed excitement about facing Barcelona in the UEFA Women's Champions League semifinals."
  }
]