[
  {
    "title": "A beginner’s guide to using Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T13:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Signal, a messaging app, gained significant attention after The Atlantic's editor-in-chief, Jeffrey Goldberg, was accidentally added to a group chat with top military officials discussing an airstrike. This incident, reported on Monday, brought the app into the spotlight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9962459723032407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45906149307581023,
    "summary": "Signal, a messaging app, was highlighted after an incident where The Atlantic's editor-in-chief, Jeffrey Goldberg, was mistakenly added to a group chat with high-ranking military officials talking about an airstrike. This event was reported on Monday and has since brought increased attention to the app."
  },
  {
    "title": "Here’s what military planning usually looks like — and why it doesn’t include Signal",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T12:53:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration officials, including Secretary of Defense Pete Hegseth and Vice President JD Vance, used a Signal group chat to plan a military strike on Houthi targets in Yemen, as reported by The Atlantic."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9915789596875,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.457894739921875,
    "summary": "Trump administration officials, such as Secretary of Defense Pete Hegseth and Vice President JD Vance, utilized a Signal group chat to coordinate a military strike on Houthi targets in Yemen, according to The Atlantic."
  },
  {
    "title": "Madison Square Garden&#8217;s surveillance system banned this fan over his T-shirt design",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T12:09:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Frank Miller was banned for life from New York's Radio City Music Hall and all associated venues before he could attend a concert there on Monday night, which he planned to see in celebration of his parents' wedding anniversary."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9611613401736111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45029033504340277,
    "summary": "Frank Miller was permanently banned from New York's Radio City Music Hall and its related venues, preventing him from attending a concert there on Monday night, an event he had planned to celebrate his parents' wedding anniversary."
  },
  {
    "title": "King Arthur wants to automate your sourdough starter",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:51:06-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Sourdough Sidekick is a new countertop appliance designed to automatically feed sourdough starter, ensuring it's ready for baking when needed. This device is a creation of FirstBuild."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9483572460532408,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4470893115133102,
    "summary": "The Sourdough Sidekick, developed by FirstBuild, is a new kitchen appliance designed to automatically care for sourdough starters, keeping them fed and ready for use in baking."
  },
  {
    "title": "Trump pardons ex-Nikola CEO Trevor Milton",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:39:55-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trevor Milton, the founder of Nikola Motors, was pardoned by President Donald Trump after being convicted of defrauding investors by lying about the capabilities of his zero-emission truck company, including claims about building its own electric truck, the Nikola One. The White House confirmed the pardon on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9405801477662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44514503694155094,
    "summary": "Trevor Milton, founder of Nikola Motors, was pardoned by President Donald Trump following his conviction for defrauding investors with false claims about his company's zero-emission trucks. The White House confirmed the pardon on Friday."
  },
  {
    "title": "Google’s Pixel 9A will launch on April 10th",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:35:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google will launch the Pixel 9A in the US, Canada, and the UK on April 10th, following a delay due to a component quality issue. The budget-friendly smartphone was initially expected to launch after its March 19th reveal. It will be released in the rest of Europe at a later date."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9374908240046296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4443727060011574,
    "summary": "Google is set to release the Pixel 9A in the US, Canada, and the UK on April 10th, after a delay caused by a component quality issue. Originally planned to launch following its March 19th reveal, the budget-friendly smartphone will be available in the rest of Europe at a future date."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:33:47-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon launched its Big Spring Sale, running until March 31, 2025. The event features discounts on gardening supplies, bedding, and more, coinciding with the start of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9362993255208334,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4440748313802083,
    "summary": "Amazon has initiated its Big Spring Sale, which will last until March 31, 2025. This sale offers discounts on a variety of items, including gardening supplies and bedding, to mark the beginning of the warmer season."
  },
  {
    "title": "NASA and Boeing investigate Starliner&#8217;s &#8216;anomalies&#8217; before its next crewed flight",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:15:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NASA and Boeing are addressing technical problems with the Starliner spacecraft to ensure its readiness for a crewed flight potentially scheduled for later this year or early next. The issues had previously prevented the spacecraft from returning astronauts to Earth."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9235775634259259,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4408943908564815,
    "summary": "NASA and Boeing are working to resolve technical issues with the Starliner spacecraft, aiming to prepare it for a possible crewed mission later this year or early next year. These problems had earlier hindered the spacecraft's ability to safely return astronauts to Earth."
  },
  {
    "title": "Helldivers 2 is locking out players who use older CPUs",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:13:41-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Some players of Helldivers 2 are unable to play the game on older computers due to a requirement from developer Arrowhead Game Studios and publisher Sony for systems to support AVX2 (Advanced Vector Extensions), a feature present in CPUs since 2013."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9223124827662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4405781206915509,
    "summary": "Helldivers 2 players with older computers are facing issues running the game because it requires AVX2 support, a CPU feature available since 2013. This requirement was set by the game's developer, Arrowhead Game Studios, and its publisher, Sony."
  },
  {
    "title": "First Alert’s new smart smoke alarm is meant to be a Google Nest Protect replacement",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T11:01:11-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "First Alert introduced a new series of smart smoke and carbon monoxide alarms compatible with Google Home, following Google's announcement to discontinue its Nest Protect alarm. The collaboration between Google and First Alert brings the First Alert Smart Smoke & Carbon Monoxide (CO) Alarm to the market."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9136206595138889,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43840516487847225,
    "summary": "First Alert has launched a new line of smart smoke and carbon monoxide alarms that work with Google Home. This release comes after Google announced it will stop making its Nest Protect alarm. The new products are part of a collaboration between Google and First Alert."
  },
  {
    "title": "Over 140 dead in Myanmar and Thailand after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:00:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake struck central Myanmar, with tremors felt in neighboring south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, also affecting areas in south-west China and Thailand with its tremors."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building has collapsed in Thailand's capital, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building has collapsed in Bangkok, Thailand, raising fears that workers might be trapped in the debris."
  },
  {
    "title": "BBC reporter on desperate search for survivors in rubble of 30-storey building",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 13:14:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A search and rescue operation is currently in progress at a collapsed tower in Bangkok, as reported by Panisa Aemocha. Teams are working urgently to find and assist any survivors amid the debris."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A search and rescue operation is underway at a collapsed tower in Bangkok, according to Panisa Aemocha. Rescue teams are actively searching through the debris to find and help survivors."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. The incident took place hours after the rocket attack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah site in response to two rockets fired from southern Lebanon towards northern Israel. The strike occurred hours after the rocket attack."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's President commented on Donald Trump's plans, describing them as \"serious\" but clarifying that they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's President described Donald Trump's Arctic plans as \"serious,\" stating they have no connection to Moscow."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced allegations of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night.\""
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The action is perceived as an effort to question the legitimacy of the existing government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A move is seen as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests demanding the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, calling for the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order for his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details on the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were among those who died in a recent incident. Additional details about the victims have not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a prison in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son after he was moved from a US detention facility to a prison in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid a challenge from a revitalized opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing competition from a rejuvenated opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The perpetrator's first attempt at parole was denied in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's initial request for parole was rejected in Texas."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies have pledged to retaliate against the United States, following accusations from China that Washington has breached international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies have committed to taking retaliatory actions against the United States in response to China's accusations that the U.S. has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in connection with the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter for the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new technology has been developed with assistance likely coming from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed, with analysts indicating that there is likely assistance from Russia involved in its creation."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with the assistance of a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been taken into custody with help from a community member, police say."
  },
  {
    "title": "Major earthquake adds to war-torn Myanmar's troubles",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:16:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent earthquake has struck a region already facing challenges from a civil war, food shortages, and a weakening economy."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent earthquake has hit a region already dealing with the impacts of a civil war, food shortages, and a declining economy."
  },
  {
    "title": "Residents describe horror in aftermath of earthquake in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:35:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A resident of Yangon, Myanmar's largest city, reported to the BBC that they experienced tremors lasting approximately four minutes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A resident in Yangon, Myanmar's largest city, reported experiencing tremors that lasted around four minutes, according to the BBC."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her fearlessness in music, crediting inspiration from artists Charli XCX and Sabrina Carpenter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed that she approaches music with fearlessness, drawing inspiration from artists like Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local factors is making it challenging for the government to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic issues is complicating the government's efforts to win re-election for a second term."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban Indians increasingly spending on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is seeing growth as more affluent, urban residents are spending more on their pets, including dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments from across Africa and beyond. The selection highlights the continent's rich cultural, social, and natural landscapes, capturing everything from daily life and traditional ceremonies to wildlife and scenic views."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's selection of photographs highlights diverse moments across Africa, showcasing the continent's rich culture, social life, traditional ceremonies, wildlife, and landscapes. The collection captures a wide range of scenes, from daily activities to scenic views."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the whole day playing golf with the US president if it would bring advantages to his country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister stated he is open to spending an entire day playing golf with the US president if it could benefit Vietnam, indicating a readiness to engage in diplomacy through informal means."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms traditional family trees into dynamic movies, illustrating the global migration of ancestors over time. This innovative approach not only enhances genealogical studies but also has applications in tracking disease spread and analyzing animal migration patterns across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns family trees into dynamic movies, showing ancestors' global migration over time. This method improves genealogical research and can also be used to track disease spread and study animal migration patterns across regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rainfall account for 60% of the observed difference between predicted and actual ocean temperatures around Antarctica over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study indicates that people with Long COVID often feel ignored, disbelieved, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit distinct gene regulation. This variation in gene regulation among skeletal cells is believed to be crucial to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that vertebrate skeletal cells come from different precursor cells and have unique gene regulation depending on their body region. This diversity in gene regulation is considered key to vertebrates' evolutionary success."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a non-invasive, high-resolution terahertz (THz) imaging technique to visualize cochlear structures in mice, paving the way for advanced diagnostics of hearing loss and other conditions. This method allows for 3D reconstructions, potentially leading to the creation of miniaturized THz diagnostic devices. This breakthrough could significantly improve diagnostic speed, accuracy, and patient outcomes in treating hearing loss, cancer, and beyond."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new non-invasive imaging technique using terahertz (THz) technology for detailed visualization of cochlear structures in mice. This method, which enables 3D reconstructions, may lead to the development of compact THz diagnostic devices. The advancement promises to enhance the diagnosis and treatment of hearing loss, cancer, and other conditions by improving speed and accuracy, potentially benefiting patient outcomes."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will motivate scientists to address the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, is advocating for the inclusion of eugenics in college genetics curriculums. He argues that this will help motivate scientists to confront and address the misuse of science for political ends."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances had higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from 12 parks in Dublin, Ireland, showed higher concentrations of infective roundworm eggs near park entrances than in other park areas."
  },
  {
    "title": "Jenkins fired as Grizzlies coach after six seasons",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:56:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Taylor Jenkins has been dismissed from his role as the coach of the Memphis Grizzlies, who are currently ranked 5th in the Western Conference."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Taylor Jenkins has been fired as the coach of the Memphis Grizzlies, who are ranked 5th in the Western Conference."
  },
  {
    "title": "Source: Patriots planning to release LB Bentley",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The New England Patriots intend to release Ja'Whaun Bentley, a veteran starting linebacker and three-time team captain, on Friday, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The New England Patriots plan to release Ja'Whaun Bentley, a veteran linebacker and three-time team captain, this Friday, as reported by ESPN citing a source."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain announced on Friday that it has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top court in Catalonia, Spain, overturned the sexual assault conviction of Brazilian soccer player Dani Alves on Friday."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to scapegoat him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt is suing the NCAA and the University of Tennessee for $100 million. He claims they conspired to make him a scapegoat."
  },
  {
    "title": "Ex-Tulane wing Williams commits to Kentucky",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tulane wing Kam Williams, recognized as one of the top shooters in the transfer portal, has committed to playing for Mark Pope at Kentucky, he confirmed to ESPN on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tulane wing Kam Williams, known for being a top shooter, has committed to playing basketball for Kentucky under coach Mark Pope, as confirmed to ESPN."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win over the Los Angeles Lakers. This dramatic shot marked one of the season's most thrilling finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey from the Chicago Bulls hit a 47-foot 3-pointer at the buzzer from half court, leading to a 119-117 victory against the Los Angeles Lakers. This event is highlighted as one of the NBA season's most exciting finishes."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After Thursday's game, Alex Ovechkin led the Capitals in a postgame handshake with retiring Wild goalie Marc-Andre Fleury, ensuring every player participated in the gesture of respect."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following Thursday's game, Alex Ovechkin, captain of the Capitals, organized a postgame handshake for every player with Marc-Andre Fleury, the retiring goalie of the Wild, as a sign of respect."
  },
  {
    "title": "Record 26 Cubans make MLB Opening Day rosters",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cuba set a record with 26 players on Major League Baseball's Opening Day rosters, the highest number to date. Meanwhile, Japan saw 12 of its players make the rosters, marking its most significant representation since 2012."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cuba achieved a record by having 26 players on Major League Baseball's Opening Day rosters, the highest number ever for the country. At the same time, Japan had 12 players on the rosters, its largest presence since 2012."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:43:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking a notable moment after being discussed in trade possibilities during the offseason. His performance was celebrated by Cardinals fans, who showed their appreciation with a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amid offseason trade rumors. His performance earned him a curtain call from Cardinals fans, highlighting their support and appreciation for the player."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:41:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The latest Sweet 16 player rankings have sparked interest in whether Paige Bueckers, Lauren Betts, or Hannah Hidalgo will secure the top position."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The recent Sweet 16 player rankings have generated discussion about who will be ranked first among Paige Bueckers, Lauren Betts, and Hannah Hidalgo."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:41:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team towards a championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading figures in Notre Dame's basketball team, significantly contributing to the team's pursuit of a championship."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT, more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Elite Eight lineup in the basketball tournament was determined after Thursday's four games. These matches have set the stage for the next round of competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Elite Eight lineup in the basketball tournament was finalized following Thursday's four games, advancing teams to the next round of competition."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:42:51 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' Opening Day ballpark in just four days. This rapid conversion allowed the Rays to host their season opener at this location."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Rays' Opening Day ballpark in just four days, enabling the Rays to host their season opener at this venue."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:41:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, the number of 3-point attempts in the league has reached a historic high, sparking discussions on whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, leading to debates about possibly implementing rules to reduce the number of these shots."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, had a standout performance during a record-setting night, facing off against Travis Hunter, who has prospects in the NFL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, delivered a standout performance and set records in a game against Travis Hunter, an NFL prospect."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Snowboarder, after battling depression, has regained her enthusiasm for the sport. She is now aiming to secure a spot in the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder who overcame depression is now focused on qualifying for the 2026 Olympics. Her next opportunity to progress towards this goal is at the World Championships on Saturday."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts suggest a trend towards cleaner gameplay in sports or a change in referee behavior, with fewer penalties being called. The reasons behind these observations are being debated within the sports community."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent discussions among players, executives, and analysts indicate a trend towards cleaner gameplay in sports or a shift in referee behavior, leading to fewer penalties being called. The sports community is currently debating the reasons behind these observations."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on the team standings, with the results and each team's schedule up until April 17 now available for review."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's outlook has been updated following a panel's vote on team standings. The results, along with each team's schedule leading up to April 17, have been released for public review, clarifying the playoff scenario as the season progresses."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had a standout season, establishing himself as a top global left back. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a player for Fulham, has gained recognition as a leading global left back after an impressive season. He aims to reach major achievements with the U.S. national team."
  },
  {
    "title": "Braden Smith's long road to Big Ten basketball, the Purdue record books and another Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Braden Smith's journey to Purdue was marked by an unusual series of events. Since his arrival, he has fully embraced his experience at the university, showing no regrets about the path that led him there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Braden Smith's path to Purdue involved a unique series of events. Since joining the university, he has fully embraced his experience and expressed no regrets about his journey."
  },
  {
    "title": "Inside Maine's long climb back to the top of college hockey",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 11:44:49 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Black Bears, historically a dominant team, have overcome significant adversity, including tragedy, to reemerge as contenders for a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Black Bears, a historically dominant team, faced significant challenges and a tragedy but have managed to become contenders for a championship title once again."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 10:45:37 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States midfielder Johnny Cardoso, who currently plays for Real Betis, has stated that the ongoing speculation about his potential transfer to the Premier League has boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "United States midfielder Johnny Cardoso, currently with Real Betis, expressed that rumors of a possible move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann staying put amid MLS links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:12:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain at Atlético Madrid for the next season, according to sources reported by ESPN. This is despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, ESPN reports, despite his earlier interest in moving to Major League Soccer (MLS)."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 12:12:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian soccer federation due to a severe knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation over a serious knee injury suffered by player Alphonso Davies."
  }
]