[
  {
    "title": "US Airstrikes Target Iran's Nuclear Sites, Escalate Regional Tensions",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 20:39:06 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Financial Times",
      "Financial Post",
      "CityNews",
      "The Verge",
      "Business Insider",
      "Washington Post",
      "Al Jazeera",
      "ABC News",
      "New York Times",
      "Fortune",
      "The Guardian",
      "CNBC",
      "BBC",
      "Forbes",
      "Bloomberg",
      "Global News",
      "Investopedia",
      "MarketWatch",
      "LA Times"
    ],
    "domains": [
      "general",
      "technology",
      "business"
    ],
    "snippets": [
      "BBC security analyst Gordon Corera examines how much damage is likely to have been caused to Iran's nuclear sites.",
      "Iranian Canadians and Jewish groups turned worried eyes to the Middle East on Sunday, as U.S. strikes against three Iranian nuclear sites raised fears of escalating violence. Nimâ Machouf, a member of a Montreal Iranian women&#8217;s association, said family members in Iran are living &#8220;from on",
      "Donald Trump on Saturday announced the US had launched strikes on three major Iranian nuclear targets. Here's how business leaders reacted.",
      "<p>Trump claims the assault ‘totally obliterated’ the key facilities, but what do we know about its impact?</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis – latest updates<",
      "\"It will take some time for this conflict to settle, but the market will view the worst is now in the rear-view mirror,\" Dan Ives wrote.",
      "The nuclear fuel enrichment plant was built deep inside a mountain in order to withstand an attack.",
      "US B-2 Spirit stealth bomber aircraft dropped heavy bunker-buster bombs on Fordow and other Iranian nuclear sites.",
      "Trump on Sunday disputed Iranian attempts to downplay the strikes on its nuclear facilities, stressing that \"obliteration\" was an accurate description.",
      "<p>Much could go wrong for the US and the Middle East as Trump and Netanyahu pursue the disempowerment of Iran</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis – latest updat",
      "Initial military assessments of the buried nuclear site contrast with the statement on the strike there made by President Trump.",
      "Ventilation shafts “are probably the most vulnerable points of the facility,” one expert said.",
      "We compare and contrast Tulsi Gabbard’s congressional testimony that Iran is not building a nuclear weapon, with her rec",
      "Maxar Technologies released satellite imagery on Sunday showing activity at Iran's Fordo nuclear facility prior to U.S. air strikes.",
      "A timeline of how the complex mission unfolded was laid out in a Pentagon briefing.",
      "Code-named \"Operation Midnight Hammer,\" the top-secret U.S. attack on Iran's nuclear facilities was launched overnight .",
      "The vice president stopped short of backing President Trump’s assertion that the three bombed facilities had been “totally obliterated.”",
      "Vice President JD Vance said Sunday that despite the U.S. strikes on Iran's nuclear sites last night, the U.S. is not at war with Iran.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOU2Vrd05uekpSN3gzTXJZMXV0OTBPY1N2bEZWTEczYU1CaDBFWEZjMHBpRExSQ2NMZDA3TFRtXzQ2MXdyeHY4MUtqWVRPTkgtRjlQR2JEZlVMNnZTWWowcEdwNXFzWjNEbWplM3lmaFZNMFhRc0hsX09weHQ0cUZtUA?oc=5\" target=\"_blank\">U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnig",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1QM0Q0VE1KaF9uTEl0eU9RQjV6R0gzWVdRaGs5ZjlPN0VVRHd1c0ViZjdGZ2FNWHRLUW9GaHhhZjJ3NUNXdUREejdlNHVRUWZCX1hvQjBBaHpubTRMYlRmN0s3c0dvTTFJZVFBWXdiQXgzamNLS0Jn?oc=5\" target=\"_blank\">U.S. enters Israel's war against Iran</a>&nbsp;&nbsp;<font color=\"#",
      "President Trump avoided asking Congress for permission before striking Iran, despite the Constitution saying only the legislature can declare war.",
      "<p>Donald Trump speaks of regime change in Tehran as the US awaits reprisals from Iran and world leaders urge de-escalation and a return to negotiations</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-late",
      "<p>The United States has joined Israel in its attacks on Iranian nuclear sites. Michael Safi hears from reporter Hugo Lowell and world affairs correspondent Andrew Roth on what happens now</p> <a href=\"https://www.theguardian.com/news/audio/2025/jun/22/why-trump-bombed-iran-podcast\">Continue reading",
      "The risk of a spiraling conflagration that pulls the U.S. in deeper flies in the face of Trump’s own rhetoric about righting the wrongs of an earlier era of U.S. overreach.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNdTVnNkdMVFNqbEg2c09mVzZ2MDFDUE5NYmFwb2VYaF95QTBmOXR0WE5wMF84R1d4cnR0N0xmNGhDRTh4MmZYMWFITm5CVFc1TTlCWmNlcFJ5SVRrdTFIUGVRVTJPMEpNQlRESG9JaWhLVW9xR3o3WVBLOUp3ZmlFamdFazBEam1hZkE?oc=5\" target=\"_blank\">Trump's Iran strikes meet bipartisan blo",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE8xSG50ZXVKZHhyNnVnRExMUDJsblVXbW1CSTdnb3FqQV9tZHpQM3A4MTVGc2Q2Rl9pbmJEd3NXOVlfVkpmRDdDalBCWElmbjBOTnVFN0RHQkhWWmN3MG5hZlhtSHZ3c0VpUFo4?oc=5\" target=\"_blank\">Scoop: Trump launches MAGA PAC in effort to oust Rep. Massie from Congress</a>&nbsp",
      "Four years ago, Trump used a swear word for Netanyahu. On Sunday, he said they worked as a team. We track that shift.",
      "The last-minute demonstrations drew hundreds of people in some cities, fewer in others. Many expressed displeasure with the Iranian leadership but were against any more U.S. involvement in another war.",
      "‘Tactical surprise’ and ‘misdirection’ allowed American B-2 bombers to attack Iranian nuclear sites without drawing fire",
      "Trump appears to contradict that later Sunday, questioning the possibility of &#039;regime change.&#039;",
      "“It’s not politically correct to use the term, ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change???”",
      "Trump claimed Iran's nuclear facilities sustained 'monumental damage' from the U.S. strikes.",
      "Top U.S. officials detailed a devastating but “limited” strike on Iran’s nuclear facilities, warning that future attacks could follow if Iran retaliates.",
      "Trump said the U.S. hit the Fordow, Natanz and Isfahan nuclear sites. Iran’s foreign minister called it a “dangerous military operation” against his country.",
      "Iran defended its right to self-defense, as President Trump doubled down on the claim that the strikes had caused “monumental damage” to Iranian nuclear sites.",
      "<p>Top officials insist US ‘not at war with Iran’; Iranian foreign minister reportedly lands in Moscow to discuss ‘common threats’ with Putin</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/22/us-attacks-on-iran-inflicted-major-destruction-pentagon-officials-say\"><strong>Iran says ",
      "<p>U.S. military officials said its precision strikes against Iran's three main nuclear facilities caused \"extremely severe damage and destruction.\"</p>",
      "<p>Trump has warned of broader US involvement in Israel’s war if Iran attempts to strike back against US military sites in the region</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/21/trump-us-nuclear-strikes-iran\">Full report: Trump says US has attacked three Iranian nuclear site",
      "<p>Follow the day’s news live</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/jun/23/australia-backs-us-iran-strikes-pine-gap\">PM backs Iran strikes but says Australia is ‘deeply concerned about any escalation’</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/em",
      "24/7 coverage of breaking news and live events",
      "Lawmakers expressed surprise after the President Trump announced the U.S. had attacked three Iranian nuclear sites.",
      "In the wake of President Donald Trump's \"massive precision strikes\" on Iran, concerns have been raised both for Americans in the region and at home.",
      "Iran remains the US&#039;s adversary in the Middle East since the 1979 Islamic revolution led by Ayatollah Ruhollah Khomeini.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWWhOa1oyTURGNnpWLXdWQlVid3h6NUpUbGhjQ1dWbmlPM2o0MVZKOGt4NzV0MHM4ejd2NDUwcDJNXzN6UEZWUXIwREt3VlNHYWhFYkxqSzBaeVJkY2MxMnNTVERteVdBRlJNOV9YcG5fZERwY1E?oc=5\" target=\"_blank\">Trump administration says U.S. does not seek regime change in Iran</",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE8tMXlsbHBKS1pQLUgzTlFhNDVYS2lGU3g3eC1OUGUzQ0duSzlONUZxU2d2X2VPVUo0RU9TdWFwc1hpWGZ3WWYxMy1EUFNzcHpOTUlELVdjaWVuZVhFY1dXVmxrRTF3NTdvaFlUVQ?oc=5\" target=\"_blank\">U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says</a>&nb",
      "\"Perhaps they should follow President Trump's lead and give peace a chance,\" Vance said.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1zTEFvazFLblpzaENEZ3JNWU0xZGZ5VG9hal9GY00xNjluVnVpVmhPYXd1V1JfMWwzUGRGMks4RlB5bjI2YTdtQVI0OWJPaE5Fcm1sVkxpNm5tYkpHUzFleVJpeW5rMV9KbTNJNUVxbFlxWVd1N192emJFMA?oc=5\" target=\"_blank\">\"It was a headfake\": Inside Trump's secret orders to strike I",
      "Republicans in Congress praised President Trump’s decision to hit Iran. Many Democrats and some G.O.P. lawmakers said he should have consulted Congress.",
      "The United States’ overnight attack could cause further escalation. To Israelis, it is already seen as a victory for Israel, and for Prime Minister Benjamin Netanyahu.",
      "Asian currencies and stocks fell at the start of the week, as US strikes on Iran rattled investors and pushed up the price of oil.",
      "Markets across the Middle East ended mostly higher on Sunday after the U.S. entered the war between Israel and Iran.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE10ZGFnQjA2NkRVeTlxcnJNVU5wZEZhY0wxVWRhdnVucUlINDFSSjdfQXJmOFJmS2tXc0J3NWx2NUkyVjFhOTJLNnZIMDFYVlJfSU90UGFBYkFKMlN5YkhacmRlUWtuSFJWelh1em5R?oc=5\" target=\"_blank\">Oil prices climb but don't soar after U.S. strike, Iranian threats</a>&nbsp;&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTFBQYnFkWGR1ZTY3WDk4M3pxWnBwdTJWbnpnRUNESUJTRTlPck5DYzdNWXdRUEhHM2JmTTFiSFhKektSdWNtUllCQlZ0a2FOZjZMekNSTFF6QWxQdXBRZGZ1VEUwdjBlZ3Rr?oc=5\" target=\"_blank\">Trump floats regime change in Iran</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1LTmJvc0tPZ0t1NjBVOUN0ZFU1c19uU0c5S082N3daR1cxTnV6UFd2cHJTWE9PeWVWNHVPU2ItRjFvMFltRGZMV2UtdElTdTdhR0VoZ1hVLTJPUmQzYnRTRnltbEdubjRlNlpabTJvMmE0bHhNR2RhV3ZVcw?oc=5\" target=\"_blank\">At Trump's request, Israel cleared way for U.S. bombers in Ir",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10YUtRd3lzVXY5bFRDZ2c5WUotYlRTbUlpcGl4SVFpT1ZqczFNNnlWWTduUVdSbTVvZmJDbDlydHBPTUFkcFpaWGJmd0k0ZWZvR2I3WWZ2cER4QURwLUdIVi1JZTZMTUxwSVZTcGxNempXc1l5UE0zeER3?oc=5\" target=\"_blank\">Live: US Says It Launched Airstrikes on Iran Nuclear Sites</a>&",
      "After the Iran bombings, more officers were placed at religious, cultural and diplomatic locations, Mayor Eric Adams said. The M.T.A. and the Port Authority have activated counterterrorism protocols.",
      "Iran launched its 20th wave of missile and drone strikes against Israeli military targets, according to Iran state-owned media Fars.",
      "OTTAWA — Prime Minister Mark Carney called for de-escalation on Sunday after the United States carried out strikes against three Iranian nuclear sites earlier in the day. Carney issued a social media post shortly before 8 a.m. Eastern saying the U.S. military action was &#8220;designed to alleviate&",
      "Commander also signalled main response may be directed at Israel",
      "The nation’s supreme leader may choose to back down after a first round of retaliation, or prefer martyrdom and building a nuclear weapon.",
      "<p>Australia, like Little Sir Echo, whimpers after the world’s premier bully bombs the ‘bully of the Middle East’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"http",
      "Iran’s foreign minister warned that the U.S. decision to join Israel’s war against Iran would have “everlasting consequences.”",
      "Senate Intelligence Chair Tom Cotton said Sunday that the US must \"be prepared for Iran to retaliate\" following Saturday night's strikes.",
      "Donald Trump says US bombing attacks he ordered have &#039;totally obliterated&#039; Iran&#039;s key nuclear sites.",
      "Rep. Jim Himes said it was still too soon to know if U.S. strikes against Iranian facilities had substantially weakened the country’s nuclear program.",
      "Residents in central Tehran said they could see and hear heavy strikes, while Israel said it was defending itself from an attack. Earlier, President Trump suggested that a new government could take over in Tehran.",
      "The choice of how to retaliate is existential as a wider war risks not only increased violence but could also threaten regime survival, according to analysts.",
      "B-2 stealth bombers, fighter aircraft and submarine-launched cruise missiles struck Fordo, Natanz and Isfahan during “Operation Midnight Hammer.”",
      "In phone interviews, people in Iran voiced fear, sorrow and grief after waking up to the news of strikes on the country’s nuclear facilities.",
      "Saudi Arabia, Qatar and other Gulf Arab countries expressed dismay over the American attack, but stopped short of condemning the United States, a key ally.",
      "<p>Vice-president declines to double down on Trump’s stance that Iran’s nuclear sites were totally destroyed</p><p><a href=\"https://www.theguardian.com/us-news/jd-vance\">JD Vance</a> has said the US is “not at war” with <a href=\"https://www.theguardian.com/world/iran\">Iran</a> – but is with its nucl",
      "<p>US president says strikes led to ‘monumental damage’ and questioned if the regime could ‘make Iran great again’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Live coverage: region braces ",
      "<p>In today’s newsletter: After Donald Trump brings the US into Israel’s conflict with Iran, one analyst sets out the potential response from Tehran</p><p></p><p>Good morning. After he ordered the attacks on Iranian nuclear sites that constituted the US’s entry into Israel’s war against Iran, Donald",
      "Plus, a farmer’s fire brigade in Canada.",
      "<figure><img alt=\"Carlos Barria / Pool / Getty Images Middle East equities were rallying Sunday on hopes U.S. attack would hasten a resolution.\" src=\"https://www.investopedia.com/thmb/FVFtXMfh6dCMA0p_sPsSGGYfXmY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2220645738-",
      "The raids attacked research and centrifuge arrays that Tehran has built up over decades",
      "President’s social media posts contradict officials’ claims that US does not seek to topple government",
      "Vice President JD Vance's remarks come after Defense Secretary Pete Hegseth said Iran's \"nuclear ambitions have been obliterated\" following Saturday's strikes.",
      "Defense Secretary Pete Hegseth echoed remarks made by President Donald Trump Saturday following strikes on three major nuclear enrichment facilities in Iran.",
      "World leaders reacted to President Donald Trump's announcement Saturday that the U.S. had carried out a \"very successful attack\" on three nuclear sites in Iran, including Fordo.",
      "The United States struck three nuclear sites in Iran on Saturday, plunging the U.S. into a battle waged over the past several days between Israel and Iran.",
      "And Iran warns of \"everlasting consequences\".",
      "The mood in the government after the U.S. attacks is one of defeat and humiliation. But state media are showing people going about their daily routines.",
      "Will the U.S. intervention continue? Will Trump’s domestic political coalition hold? What impact might a surge in oil prices have on inflation in the U.S.?",
      "<figure><img alt=\"Kamil Krzaczynski/ AFP / Getty The Federal Reserve opted to leave its benchmark interest rate unchanged last week. Fed Chair Jerome Powell said that the central bank needs to assess the impact of tariffs on inflation in the coming months.\" src=\"https://www.investopedia.com/thmb/YHK",
      "The broader crypto market has also tanked, dropping 7% over the past 24 hours.",
      "Shipowners could ignore the advice because the Gulf is too important a region for them to avoid and rates can always rise to compensate for the risk.",
      "<p>Rolling coverage of the latest economic and financial news</p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/jun/22/oil-prices-expected-to-rise-after-us-attack-on-iran\">Price of oil could spike after Iran’s parliament votes to close key shipping route</a></p></li></ul><p><strong>Ja",
      "The US military's surprise B-2 bomber strikes on Iran's nuclear sites relied on deception and strategic misdirection, military leaders said.",
      "US Air Force B-2 Spirit bombers struck Iran's nuclear facilities, and a guided-missile submarine also launched strikes.",
      "Iranian officials had warned the U.S. to stay out, saying it would have dire consequences for the entire region.",
      "Iranian Canadians and Jewish organizations watched the situation in the Middle East with growing concern on Sunday, as U.S. airstrikes sparked fears of intensifying conflict.",
      "Amid fears of more dangerous escalation across the Middle East, some leaders condemned the attacks, and others urged restraint.",
      "Both elation and fear were widespread in Israel amid uncertainty over what comes next.",
      "Iran’s foreign minister called the attack a “betrayal” in the middle of negotiations and said it would have “everlasting consequences.”",
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/BOORCuWqSZ2q-AR3ONcANUowmfk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/BTCUSDChart-89b67e04e3c44a6e81098116335de71b.gif\" title=\"This image depicts the BTCUSD chart.\" /><figcaption><i>Source: Tradi",
      "This is your weekly lookahead at the key global events that could move markets and shape policy.",
      "Investors are largely shrugging off escalations in the Middle East, with many strategists believing the conflict to be contained.",
      "Iran’s Foreign Minister Abbas Araghchi says US Israel crossed &#039;a very big red line&#039; by attacking three nuclear sites.",
      "The US struck Iran’s Fordow, Natanz, and Isfahan nuclear sites, escalating tensions with Iran.",
      "“Extremely severe damage and destruction.” The US military struck the Fordow, Isfahan and Natanz nuclear sites in Iran.",
      "The US has bombed Iran - and Iran says it reserves all options to respond.",
      "Monotype is keen for you to know what AI might do in typography. As one of the largest type design companies in the world, Monotype owns Helvetica, Futura, and Gill Sans - among 250,000 other fonts. In the typography giant's 2025 Re:Vision trends report, published in February, Monotype devotes an en",
      "<p>Want to get this in your inbox every weekday? <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl&amp;CMP=au_sfl\">Sign up for the Afternoon Update here</a>, and start your day with <a href=\"",
      "<p>Grandfather Ned Hargraves says there is ‘no trust’ between the remote community of Yuendumu and NT police</p><p><strong>Warning: This article contains names and images of Indigenous Australians who have died</strong></p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/",
      "<p>The Guardian’s picture editors select photographs from around the world.<br />Warning: gallery contains sensitive images</p> <a href=\"https://www.theguardian.com/news/gallery/2025/jun/22/iran-israel-yacht-jaws-photos-of-the-weekend\">Continue reading...</a>",
      "Service members, veterans and their families expressed differing views on the airstrikes but shared concern over the safety of American troops.",
      "The \"tortuous\" US-Iran relationship was tested at least once before, but this is of far greater magnitude",
      "Demonstrators take to the streets in France, Pakistan, Greece and the Philippines to condemn the military action."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ea24/live/14d60860-4fed-11f0-86d5-3b52b53af158.jpg",
    "titles": [
      "Watch: How successful have the US strikes on Iran been?",
      "Iranian Canadians and others watch and worry after U.S. strikes on nuclear sites",
      "Business leaders from Bill Ackman to Jason Calacanis react to the US strike on Iran's nuclear sites",
      "How effective was the US attack on Iran’s nuclear sites? A visual guide",
      "Dow futures drop 150 points while oil prices jump after the U.S. bombs Iran’s nuclear sites and widens Mideast conflict",
      "Here’s What to Know About Fordo, Iran’s Best-Protected Nuclear Site",
      "Satellite images show the damage at Iran's deeply buried Fordow nuclear site after massive US strikes",
      "Trump calls 'obliteration' an accurate description of damage to Iran's nuclear facilities",
      "US bombing of Iran’s nuclear facilities is Trump’s biggest gamble yet as president",
      "Iran’s Fordo Nuclear Site Said to Look Severely Damaged, Not Destroyed",
      "Satellite Images Show What U.S. May Have Targeted at Iran’s Fordo Nuclear Site",
      "Tulsi Gabbard on Iran’s nuclear capabilities",
      "Satellite images show activity at Iran's Fordo nuclear facility before U.S. air strikes",
      "Decoy flights and seven B-2 stealth bombers - how US says it hit Iran's nuclear sites",
      "How bunker-busters and B-2 stealth bombers hit Iran's nuclear program",
      "Vance says Iran’s nuclear program has been ‘substantially delayed.’",
      "Vance: 'We're not at war with Iran, we're at war with Iran's nuclear program'",
      "U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnight Hammer\" strikes on Iran - Axios",
      "U.S. enters Israel's war against Iran - Axios",
      "Is the U.S. at War With Iran? What to Know About Trump, Congress and War Powers",
      "US-Iran crisis: what we know so far",
      "Why Trump bombed Iran – podcast",
      "Trump bombs Iran, raising the ghosts of Iraq",
      "Trump's Iran strikes meet bipartisan blowback in Congress over war powers - Axios",
      "Scoop: Trump launches MAGA PAC in effort to oust Rep. Massie from Congress - Axios",
      "US attacks Iran: How Trump rejoined ‘team’ Netanyahu",
      "Small Protests Against the U.S. Attack in Iran Sprouted Up Over the Weekend",
      "How the US used stealth and decoys to launch surprise attack on Iran",
      "Senior Trump officials say US attacks on Iran ‘not about regime change’",
      "Trump is open to regime change in Iran, after his administration said that wasn’t the goal",
      "U.S. Strikes Iran: Iranian Military Addresses ‘Gambler’ Trump After He Hints At Regime Change In Tehran (Live Updates)",
      "U.S. officials detail Iran bombing raid, noting limited attack for now",
      "Officials assess damage from U.S. strikes; Trump raises possibility of regime change in Iran",
      "Israel-Iran live updates: Region fears wider war; Trump raises prospect of regime change in Iran",
      "Israel-Iran war live: Trump floats regime change to ‘make Iran great again’ as region braces for Iranian response to US strikes",
      "With 40,000 troops in the region, U.S. braces for response as Iran weighs its options",
      "From shipping, to proxies, to targeting US bases, Iran’s options to strike back are limited",
      "Australia news live: Lambie labels Trump a ‘bloody sociopath’; Hastie calls PM’s response to US strikes on Iran ‘too slow and too passive’",
      "LIVE:  ABC News Live",
      "Congressional leaders react to Trump ordering attack on Iran",
      "After Trump attacks Iran, what experts and officials fear for the American homeland",
      "History of US-Iran relations: From the 1953 regime change to Trump strikes",
      "Trump administration says U.S. does not seek regime change in Iran - Axios",
      "U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says - Axios",
      "JD Vance says Iran is ‘clearly not very good at war’ and should seek peace while declaring the U.S. has ‘no interest’ in ground troops",
      "\"It was a headfake\": Inside Trump's secret orders to strike Iran - Axios",
      "Republican Lawmakers Cheer Strike on Iran as Top Democrats Condemn It",
      "Trump’s Strike on Iran Cements Netanyahu’s Political Comeback",
      "Emerging Assets Drop as US Strike on Iran Fans Worries About Oil",
      "Gulf markets end higher, shielded from major turmoil after the U.S. strike on Iran",
      "Oil prices climb but don't soar after U.S. strike, Iranian threats - Axios",
      "Trump floats regime change in Iran - Axios",
      "At Trump's request, Israel cleared way for U.S. bombers in Iran - Axios",
      "Live: US Says It Launched Airstrikes on Iran Nuclear Sites - Bloomberg",
      "NYC Increases Police Presence at Vulnerable Sites After U.S. Bombings in Iran",
      "Iran says it reserves all options after ‘outrageous’ U.S. strikes, launches fresh attacks on Israel",
      "Carney says Middle East ‘highly volatile’ after U.S. strikes Iran, calls for calm",
      "Iran’s top general says military entitled to retaliate following US strikes",
      "Will Iran Decide to Retaliate Against the U.S.?",
      "As the US chooses destruction over diplomacy in Iran, Australia has to decide between principle and prostration | Allan Behm",
      "Iran Had Vowed to Retaliate. Now, It Faces Grim Choices.",
      "Senate Intel Chair Cotton: 'We have to be prepared for Iran to retaliate'",
      "Will Iran retaliate or capitulate?",
      "Top Democrat says Trump strikes on Iran a 'massive, massive gamble'",
      "Israel and Iran Trade New Round of Attacks",
      "Iran says ‘all options’ on table; bigger conflict may threaten regime’s survival",
      "Pentagon Details Multipronged Attack on Iranian Nuclear Sites",
      "‘We’re All in Shock’: Iranians React to U.S. Attack on Nuclear Sites",
      "Gulf Countries Voice Concern After U.S. Attack on Iran Nuclear Sites",
      "JD Vance claims US is at war with Iran’s nuclear program, not Iran",
      "Trump talks of regime change in Iran and insists US ‘obliterated’ nuclear sites",
      "Monday briefing: Four ways Iran could retaliate to US bombing of nuclear sites",
      "Monday Briefing: The U.S. Struck Iran",
      "Investors Brace for Market Fallout From U.S. Strike on Iran Nuclear Sites",
      "In maps: Iran’s three nuclear sites targeted by US bombers",
      "Trump taunts Iran with prospect of ‘regime change’ after strike on nuclear sites",
      "U.S. isn't at war with Iran, 'we're at war with Iran's nuclear program,' Vance says",
      "Hegseth claims Iran's nuclear ambitions 'obliterated' after U.S. strikes",
      "World leaders react after Trump says U.S. has bombed 3 nuclear sites in Iran, including Fordo",
      "US hits 3 Iranian nuclear sites, Trump says, plunging America into conflict",
      "The US Bombs Iranian Nuclear Sites",
      "After U.S. Strikes, Iranian Officials Try to Project a Sense of Normalcy",
      "6 questions investors should be asking as U.S. strikes Iran",
      "What to Expect in Markets This Week:  Investors Digest News of US Strikes on Iran, Await May PCE Inflation, Powell Testimony, Earnings from Nike, FedEx, Micron",
      "Bitcoin plummets below $100,000 after U.S. strikes Iran nuclear sites",
      "Shipping on high alert in Mideast after U.S. strikes on Iran",
      "IMF chief warns of broader risks from US strikes on Iran, after oil hits five-month high – business live",
      "How the US military tricked everyone to surprise Iran with B-2 bomber strikes on its nuclear sites",
      "The US military struck Iran with some of its most elusive weapons: stealth bombers and a hidden submarine",
      "How Iran could retaliate after U.S. strikes on its nuclear program",
      "Iranian Canadians and others watch and worry after U.S. strikes on nuclear sites",
      "World Leaders React to the U.S. Strikes on Iran",
      "Some Israelis Expect New Era After U.S. Strikes on Iran. Others Are Skeptical.",
      "After U.S. Strikes on Iran, Prospects for Diplomacy Look Dim",
      "Watch These Bitcoin Price Levels Amid Volatile Trading After U.S. Strikes Iran",
      "The Week Ahead: What's next after U.S. strikes on Iran and Europe's 5% defense problem",
      "Why global markets are brushing off U.S. strikes on Iran",
      "Iran warns US of consequences after strikes, says Trump betrayed his voters",
      "Satellite images show damage from US strikes on Iran’s Fordow nuclear site",
      "US strikes Iran in ‘Operation Midnight Hammer’",
      "US strikes Iran, what comes next?",
      "What happens when AI comes for our fonts?",
      "Afternoon Update: Albanese backs US strikes on Iran; Kumanjayi White’s family demand government ‘step in’; and YouTube’s tiny apartments",
      "‘You must step in’: family of Kumanjayi White demand federal government support after death in custody",
      "Strikes on Iran and Israel, a hoisted yacht and Jaws rides again - photos of the weekend",
      "Around Military Bases in the U.S., Unease Over What Comes Next",
      "Lyse Doucet: An unprecedented moment - but what US and Iran do next could be even more momentous",
      "Watch: US strikes on Iran trigger protests internationally"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.787,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.864,
    "summary": "The United States conducted airstrikes on three nuclear sites in Iran, marking a significant escalation in the conflict between Israel and Iran. The operation, named \"Operation Midnight Hammer,\" involved B-2 stealth bombers, fighter aircraft, and submarine-launched cruise missiles targeting the Fordo, Natanz, and Isfahan sites. The strikes have led to widespread reactions, including fear and anger within Iran, international calls for de-escalation, and varied responses from global leaders. Initial assessments suggest the attacks caused massive damage to Iran's nuclear capabilities. President D",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant international event, offering readers some insight into the geopolitical situation. However, it does not suggest any solutions, improvements, or innovations, and it does not provide a comprehensive understanding of the causes or impacts of the situation."
  },
  {
    "title": "Tesla Launches Robotaxi Service in Austin with Select Model Y Fleet",
    "domain": "general",
    "location": "national",
    "published": "Mon, 23 Jun 2025 04:45:24 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios",
      "MarketWatch",
      "The Verge",
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "general",
      "technology",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPbWhMeTJCcGRObkhOOTR2dzNGZkh2MlFaVTBhZ0dtOVMxRVh3VzVfcjF1WFFGczhucVBIc0VkVnhYdVpUSWI5Q0dTUWJUQVNqZF9KRE1WendBRWMtcThXaExMZzhwemllY2lRY0gxV1JKcWxnMng0WmVnSXFUNUFsWnk3UmVudjlINl9SYy1WTTBEYlZFTFF3TlFR?oc=5\" target=\"_blank\">Delta-8 THC will st",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1HVzBvU3pmSmNucGlRS2hnR1hxUEdNYTlzTnJQeWFfbXN3SV9lZTBkTFptQm44YVN2WnNKbXIyUWdzZTNyb201T3JaT0ViUF92WUl3cFFvcnZSNHFQakhpc2RRaTFEUlo5TUJFSUNPVmk?oc=5\" target=\"_blank\">Tesla's robotaxi service begins cautiously in Texas</a>&nbsp;&nbsp;<font col",
      "The launch of the EV maker’s robotaxi service caps a decade of promises about autonomous vehicles by Tesla CEO Elon Musk.",
      "Tesla finally did the damn thing. The company launched its hotly anticipated robotaxi service in Austin, Texas, on Sunday, June 22nd — and we’re now starting to see some of the first reactions roll in. But first, we have to get a few important caveats out of the way. Tellingly, the service is not op",
      "The number of Teslas deployed will be small — just 10 or 12 vehicles — and will only pick up passengers in a limited, geofenced area.",
      "Tesla has started giving rides in driverless Model Y SUVs in Austin. Details are still sparse, but limited service is open to vetted and invited riders.",
      "Today's the day for Tesla's long-awaited Robotaxi launch in Austin, Texas."
    ],
    "image_url": "",
    "titles": [
      "Delta-8 THC will stay legal in Texas - Axios",
      "Tesla's robotaxi service begins cautiously in Texas - Axios",
      "Tesla’s robotaxi launch is here. Here’s what it means for the stock.",
      "Tesla’s robotaxi is live: here are some of the first reactions",
      "Elon Musk launches Tesla robotaxi service in Austin with $4.20 flat fee for customers",
      "Tesla launches robotaxi rides in Austin with big promises and unanswered questions",
      "Tesla officially launches robotaxis in Austin to a small group of users, charging a $4.20 flat fee per ride"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.856,
    "summary": "Tesla has launched its Robotaxi service in Austin, Texas, deploying a small fleet of driverless Model Y SUVs. Initially, the service is available to a select group of vetted and invited riders. The operation is confined to a limited, geofenced area in the city, with only 10 to 12 vehicles being used for the launch.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress and innovation in the field of autonomous vehicles. It provides useful information about Tesla's new service, which can help readers understand the current state of autonomous vehicle technology and its implementation. It also increases awareness about the systems and trends in this field."
  },
  {
    "title": "US Airstrikes Target Iran's Nuclear Sites, Escalate Regional Tensions",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 19:25:11 +0000",
    "source": "Washington Post",
    "sources": [
      "The Guardian",
      "Washington Post",
      "New York Times",
      "CBC News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Israeli forces recovered the bodies of three hostages taken to Gaza during the Oct. 7, 2023, attacks, authorities announced Sunday.",
      "<img alt=\"A tent encampment is seen amid the rubble of a destroyed city.\" height=\"349\" src=\"https://i.cbc.ca/1.7568108.1750612965!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/aptopix-israel-palestinians.jpg\" title=\"A tent camp for displaced Palestinians stretches among the ruins of building",
      "<p>IDF says remains of two civilians and one soldier were retrieved in ‘special operation’ on Saturday</p><p>Israel announced on Sunday it had recovered the bodies of two civilians and one soldier held hostage in Gaza, amid its wars in Gaza and Iran.</p><p>The Israeli military said it recovered the ",
      "The retrieval of the bodies of three Israelis taken hostage by Hamas jolted Israelis’ focus back to a conflict that had been overshadowed by the escalating crisis with Iran.",
      "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel. Dozens were freed or killed, and at least 20 are believed to be alive in Gaza."
    ],
    "image_url": "",
    "titles": [
      "Israel recovers bodies of three hostages from Gaza, IDF says",
      "Israel says remains of 3 more hostages recovered, as refugee camp in Gaza struck",
      "Israel recovers bodies of three hostages held in Gaza",
      "Israel Recovers Bodies of Three Hostages Held by Hamas in Gaza",
      "Hamas took 251 hostages from Israel into Gaza. Where are they?"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.767,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.844,
    "summary": "The United States conducted airstrikes on three nuclear sites in Iran, marking a significant escalation in the conflict between Israel and Iran. The operation, named \"Operation Midnight Hammer,\" involved B-2 stealth bombers, fighter aircraft, and submarine-launched cruise missiles targeting the Fordo, Natanz, and Isfahan sites. The strikes have led to widespread reactions, including fear and anger within Iran, international calls for de-escalation, and varied responses from global leaders. Initial assessments suggest the attacks caused massive damage to Iran's nuclear capabilities. President D",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant international event, offering readers some insight into the geopolitical situation. However, it does not suggest any solutions, improvements, or innovations, and it does not provide a comprehensive understanding of the causes or impacts of the situation."
  },
  {
    "title": "LSU Wins Second College World Series Title in Three Years",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 06:55:10 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Sky Sports",
      "BBC",
      "Al Jazeera",
      "The Guardian",
      "Forbes",
      "Global News",
      "ABC News",
      "CityNews",
      "NHL",
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "business",
      "sports"
    ],
    "snippets": [
      "Shai Gilgeous-Alexander caps a dominant season as the Oklahoma City Thunder clinch the NBA Championship.",
      "OKLAHOMA CITY (AP) — Shai Gilgeous-Alexander walked off the court for the final time this season, collapsed into the arms of coach Mark Daigneault and finally smiled. It was over. The climb is complete. The rebuild is done. The Oklahoma City Thunder are champions. The best team all season was the be",
      "Shai Gilgeous-Alexander of Hamilton, Ont., walked off the court for the final time this season, collapsed into the arms of coach Mark Daigneault and finally smiled. It was over. The climb is complete. The rebuild is done. The Oklahoma City Thunder are NBA champions. The best team all season was the ",
      "Gilgeous-Alexander added more hardware to his trophy case to cap off a magical season",
      "<p>The list of Canadians to win the NBA title has just added two new names. </p>",
      "<p>Oklahoma City Thunder swingman and Montreal, Que. native Luguentz Dort speaks after an NBA title win, shouting out Canada as well as his parents&#8217; homeland of Haiti and saying he&#8217;s proud to rep his two countries on the biggest stage.</p>",
      "<p>He&#8217;s the most valuable player. The scoring champion. And now, an NBA champion along with NBA Finals MVP.</p>\n<p>All in one season.</p>",
      "Shai Gilgeous-Alexander joins elite company after the Oklahoma City Thunder's NBA Title.",
      "Shai Gilgeous-Alexander showed plenty of class towards Tyrese Haliburton.",
      "Caitlin Clark reacts to the unfortunate news,",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNUW45VENoNGVNTjB0X2JhM2hHa3BBMkV1R2toZUhoS0NUNHNVQTlieFlrMDh4ZXItUDJrSGYxMDVxLVk2OGR3cjNRdmdmTUtrZ1lOU0ZYc2NoTnBrdFMtNE41Y2lGQmFDenVPYllJc0RyZ0RsNXNDcnVwSkx3QWh3SlpMTnNHUk5GNWc?oc=5\" target=\"_blank\">LeBron James Reacted to Tyrese Haliburto",
      "<p>This is not how Indiana star Tyrese Haliburton saw the season ending.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNNEtoVnFRbWk2OXpZR1VKVE9TQmpYLWNObkhIX253bU8wdHVrT2k2d1R6bl9lX2ZWazdhRmNnTmxpNFg3X1BTTVZxVGNHREtJbVRxOTdrRDZqejYyRlJZVzVFMXlJS3lQWXhaSjNXbkpDMUc0cjY4YzFnRFd5MnNHQllINmc?oc=5\" target=\"_blank\">Inter Miami CF Predicted Lineup vs. Palmeiras: H",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQR2l3bk9hT3hvdFdGeU95UkxYRlAyQk5WaEVWcEs2aV9NMGNkSXZNU0l6c0F0NUN0cC1hQUFoazZxdTFpUE8zczExNm9jd2tROEdLVVNoYmNSRXR3N1NTNmRqWGFsU1Rza0daNHliQUNCQnhxaVZ3aTR0ZXpxRzJpUnVTTVlZVEE?oc=5\" target=\"_blank\">Predicting Lions' Madden NFL 26 Ratings: Def",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9FOTZKalkxMnl1b0ZGcjhhSExHbTdfSXpDdlliNjkxRVJyTjZpcVo3SjJ5TF9XV29vRE9mNEpJejhaYVU0bVBJMTZCT3VGY29yNWxMVXJ5SGdUSERjbm1VX0dOaUVtdEhRMWMxX0hhWS1vcmdHUm9oZG1kdUM?oc=5\" target=\"_blank\">Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First ",
      "Xabi Alonso gets first victory as Madrid manager, despite his football side playing most of game with only 10 players.",
      "Los Colchoneros are in need of a result to advance",
      "Both are on the outside looking in at a spot in the round of 16",
      "The MLS side look to stun the European champions",
      "SportsLine's Martin Green reveals his Club World Cup final picks for Al Ain vs. Man City on Sunday",
      "Ilkay Gundogan scored twice as Manchester City thrashed Al Ain 6-0 to secure their place in the last 16 of the Club World Cup.",
      "<p>Kenan Yildiz scored two goals in Juventus’ 4-1 win over Wydad in the Club World Cup on Sunday.</p>",
      "Claudio Echeverri's 45-minute cameo has given Pep Guardiola plenty to think about, while Xabi Alonso got his first win as Real Madrid coach. Here's what you need to know from Sunday's Club World Cup action.",
      "Brazilian teams Botafogo, Palmeiras, Flamengo and Fluminense all sit in first position in their respective FIFA 2025 Club World Cup groups.",
      "<ul><li><p>Man of the match İlkay Gündoğan scores twice in 6-0 win in Atlanta</p></li><li><p>Cherki opens account; Echeverri, Haaland and Bobb also find net</p></li></ul><p>Manchester City will jet into the inland heat of Orlando’s Camping World Stadium for a 3pm showdown with Juventus on Thursday t",
      "Manchester City powered their way to an emphatic 6-nil win over Al Ain at the Mercedes-Benz Stadium earlier this morning (UK time). The win saw Pep Guardiola’s side guarantee themselves a place in t...",
      "Claudio Echeverri stole the headlines as Manchester City continued their FIFA Club World Cup campaign with a 6-0 thrashing of Al-Ain in Atlanta.Pep Guardiola’s side cruised past their UAE opponents ...",
      "Ilkay Gundogan scored two goals as Manchester City comfortably dispatched Emirati club Al Ain 6-0 on Sunday to ease into the knockout stage of the Club World Cup from Group G along with Juventus.",
      "SportsLine's Jon Eimer reveals his picks for the Concacaf Gold Cup 2025 matchup between Haiti and the United States on Sunday",
      "<p>Patrick Agyemang scored a tiebreaking goal in the 75th minute, and the United States overcame Matt Freese’s goalkeeping gaffe to beat Haiti 2-1 on Sunday night and win its Concacaf Gold Cup group with a 3-0 record.</p>",
      "SportsLine's Brandt Sutton reveals his soccer picks for the Concacaf Gold Cup 2025 group stage match of Costa Rica vs. Mexico on Sunday",
      "Mexico drew 0-0 with Costa Rica on Sunday night at Allegiant Stadium in Las Vegas to win Group A of the CONCACAF Gold Cup and will play Saudi Arabia in the quarterfinals.",
      "Goals from Haaland, Gundogan and new signing Cherki help Man City enter the tournament&#039;s knockout stage.",
      "The tournament officially began on Saturday, June 14",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPeWU5SHpXdjFwemszb042U1R3eGg5bmpIQjBvaXNwVk9CVmRqZTJhdElxUUEzR0NQRXBGVEdHeE1GTWs1WnhvZjFoaGo3V0xYS2lGeWhnYWxEVUhqMk1oMDA3cHlKa0F6NXhaV3NkRktsYWd2STRhel96ZGt3WjZmYmtNY0c5UlhCaEkyOHl4Rmc0dw?oc=5\" target=\"_blank\">New York Yankees Surprisingly",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOMDJySEVpVmQ0U2RJMzluQ1RLNDhXWlpfSS1kcUJqcW9WWDBNQ0pXR2V0alR2VXRPOHpXT1pleDhZR09fWTBDUmRhYmI3U0NraU9VWnhyN3BkNEl4YzJDZUR4SzJSYkpTVV9RX2pqMGt4TXUyVmlIaEY4MmttQldRNzBOa0VydW9kQUFEaVM1MWtwMTRkbHBFYUln?oc=5\" target=\"_blank\">Here's Where LSU's ",
      "<p>LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the College World Series finals.</p>",
      "LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning, and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the Men's College World Series finals.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBsUE9uLTI2Xy04ckRrYXMtYjBCODRtYVFGcklVX0VMbjJILXowTmpwWHN1RW02RWtPS3czcHJYNU5sMlpGWXNGMVEyMUpKdE5yNnl5RHNiX0ZLQmZPdDFxYVBNQlVSMUs3UDlKcGt4VW4zRHM?oc=5\" target=\"_blank\">Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to N",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxOWEVqV2s5aHEtd2w3SGtTNmdtOVlLaWFPbnVET0pvMEVuSWV2ajJKS1ZGbERwZC1VVTdrZXpEODJiSkNocW50T3I1QUhuUHRZM3RvaS1Xd1VPM1VXS1QwNTEzSlQtMjg2cklRS0hxeXpsekgzS0ZkRzFYNWczWm5rQ0tYcTNpbzFvMFZZMmYwZmE5OUhHTkZpNExqdw?oc=5\" target=\"_blank\">Braves' Brian Sni",
      "The Tigers were victorious in Omaha once again, earning their second title in three years",
      "The 2025 NASCAR Cup Series will feature both an international and grassroots flair",
      "With LSU winning all of its eight titles since 1991, the Tigers are college baseball's best program.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQejJyNmFfQ3paWHhBejJ0WXNBbDBSbW16TzRMYU9Wb29LLTl6QzB1VEdEOXRYN1pONDhoQjVHeGNVcDBDekVsZGJxRWEtb2dmdXEwRzNpVkt0VWxaQXo5eERxNzd5QklISmNaX1F2andUNTJjYkxCTGtOQ0NFUkJYN0JTOE9BX01yVlE?oc=5\" target=\"_blank\">Bayern Munich ‘Targeting Second Liverpoo",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPOFQtN0hEaVlXVDRKMFVPLVBvWWNYRkFLNWhpUzB2RDk4S0ZDWjE2UUlHdV9BRFpfTTdtZ3hpWkdIVzUxRmx1SjdtUzdoMmR5RVNLajZONFBkWWllTzNEeEpLMmtfV09hcTBlUWV3WTgzRkRPbFpIcWVlRXpOeDVpVGQ1VG5GdzZXVUp6Ni1TOEUzdw?oc=5\" target=\"_blank\">Broncos DC Explains How Hufan",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9EQjE2SjUzc19MSEFNNDVMQkhrQjZQYXlMS2p4Xy01SHN1WS0zSkpjRTNnZS0tU2lGa2N3NFZDdU1EVjBqUGZva0pZWWh5VnZTb0lsanlkTEZmUHdYTm5qb296dDVCVnpjYmZLNVdnbFVoVVR3Vk53UXpTanZrV1E?oc=5\" target=\"_blank\">Rockets Acquire Kevin Durant in Blockbuster Trade With S",
      "<p>Kevin Durant is set to add another chapter to his long and winding NBA story.</p>\n<p>The Phoenix Suns have dealt the 15-time All-Star to the Houston Rockets in exchange for Jalen Green, Dillon Brooks, the No. 10 pick in the 2025 draft and five second-round picks ending his fruitless run in the de",
      "The Heat had the pieces to land Kevin Durant.",
      "Durant isn't joining another superstar this time, and Houston is ready for takeoff",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxONmxVaTBHT2JtM09menZwcUdWbWlqVjFhaTZqRi1UU2FDUGhNTXVuRVpEeGRpTHlRWm5fMGV5WktDNDZsNUEySHlCMEZoQm90VGdNTzN1b2ZhYlNxT2JKaEpKd2kwNkxDZENSYUNKV1A4N2NHRXpvZnktMUhqdGFmNFlUamRxT210VnhtQmMyNVU2UFVR?oc=5\" target=\"_blank\">Details of Heat’s Failed Fi",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNc2lFM0ZfTWZ1YllTck56QkFNenZNUkFHVUliUmFQUFVtV2FXSExBQkxrXzVvYXZWNDlaR1RrV3pyVUdISGxsbWg1aGpoUFF5UVF5TnhiRHJ3RFNScGdqLU9za1R6cUdZQjFibXhldW1OSUtSSFp6b1BoZFFRQzgzZ0NyNkhsLXd3azl2cFJFYTlYRUFjOXc?oc=5\" target=\"_blank\">Russell Henley Calls Pen",
      "The Kevin Durant era is over in Phoenix. He will be traded to the Houston Rockets in exchange for Jalen Green, Dillon Brooks, and a package of draft compensation.",
      "The Suns and Rockets have agreed to a deal that lands Kevin Durant in Houston. Which side won the trade?",
      "Phoenix Suns All-Star forward Kevin Durant will join his fifth NBA team after being traded to the Houston Rockets.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBRWE0wZVVEaDRoZG1kT2RKcWQ2TVhxcWplYzhneHlqcWdXOUZOMWpwM1VvVW9IQUhvVzAxZzRES3BxcXNWYUZFLUh0STVJd3FLRUxvXzRFX2VYbGFtRlZpU00zSk9TQmFpQzB6aVM2WmJqTXFiYmVJ?oc=5\" target=\"_blank\">Marchment traded to Kraken by Stars for 2 draft picks</a>&nbsp;&nbs",
      "Durant is joining his fifth NBA team in hopes of winning a third championship",
      "Phoenix ultimately couldn't drum up peak value for Durant in a trade",
      "In the last four years, Houston and Phoenix have effectively switched places",
      "Let's dive into the winners and losers from the latest blockbuster trade",
      "The Suns have agreed to trade Kevin Durant to the Rockets for Jalen Green, Dillon Brooks, the No. 10 pick in this year's draft and five second-round picks, sources told ESPN.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQblFTeHZ4LV9TQnFnSEx4WTBVNWpTSGQwTUdmUGJ2MXFLNnFLRzJnaUlXUGFNRVlXMVlMQ3NfdE9xNFJXRFlDNGlxOUZNMkZqMExxSUVQUDNZY1JKVVY5OXV3YTQyRVZ1QzJRTVlidnp3YkFnWk9pdzFRR1hwTzFxX0dBS2xXTkRwNWVJUkFJcTN4MGhEcjFpYThB?oc=5\" target=\"_blank\">NBA Insider Gives U",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxNNEExblMzY1duN1M2YXFJLU1RUVc2LUpPRFlEcXVwRVhHYU5URnBUUDJ1REI2dUMwQU1qZlNsLUczX2N6U2I5dlVZV3hRR1N6Nkk4RHBDX0RVYTVHNS14ZUxaak1qeGNUdV9KbXZvTzFYbXZzQ05qX1FId3hGbW5YQlJOMA?oc=5\" target=\"_blank\">Transfer Rumors: Man Utd Make New Mbeumo Bid; Dia",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPX0hWVHUwS25maUZYclg4aE5LX3lZd09iVS1zS3VjQ3Fsbmd1TEtXMjRoNnpmd01fYWkza05mcWxSN0F4VlhVTnBUNXdrZW45TDBoeW5qWkprdzQwTXlEaVAyXzJoUXZFS1g1bndNaHpCOUJEY01JX0Y2NlRHRUROeGVmWl9LVmdD?oc=5\" target=\"_blank\">Flash Sale: Ja Morant's Nike Sneakers are J",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOMUJ3a3lOVnM5UG1kYXlyTGt5UUs4X1VhRXVOR1BYY0xlYkxiYkhyWkVZeVBxSUpzQkJhaEUxcGRrNlJuRWhyc3MtUTN2UGdjNHc0RUhpMUI3azlVaEd5a0ZWR2xzVnFwT3Y0RkdrTjhfeE55U2VFeGRKZDRDVzVwN3BMR3RHMXpmUnc?oc=5\" target=\"_blank\">’I Need to Play’—Arda Guler Makes Real M",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQdmppYnk2WVZxMzBySU91MGQ0NlEtenBRR1FJeXg1Rmo5TGE5NjhTMjZKa21TX0NlZ3VyWWZQeGduWjBjcWFJWFNhVGJWb0NJNEptRHZkd2NUdE9aSXFhMzlJNVdjZm5WenFCbnFYQ1M4QjNxZm9RSktxTG5zc0hPOUZXZjdwT2xDZi1ScXRPSVVVMHRab2xaNQ?oc=5\" target=\"_blank\">New York Yankees Proj",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQeHBzN1RYbzhXV3hWSWdfYm5zakFUM2cweWJveEcxeDB1VzBDNmJZczY5c204WVVEUzA3ZEZ5Z3haRTNPVlQ1UXMyQ19zU1o5elV2MFRSel9IbWpVOFVPWU1kX1J6NWN2YmtvMzF0VGVqeDJaczR1UVlCMm9mbFp5VkZqT0FFSDA?oc=5\" target=\"_blank\">Eagles 'Weapon' Already Compared To Legend</",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOS0Jyb3VWYldtTHFrZWd5RUdvdU9jX3BwLXpPR1pZVWt0SWctYmt2SEpJQk43THBsRU0yQTNZeVloU2lzcjV0dnBsaVk4UTYyazA3NlhyWjlKU3RuUWZEWVVqbGZwTkFRY01vVnVBdXUzR0dJVUpmZHV1QmJ3emh6Mm82OG43QU9HNnRQek9tY3EweUFzS0w0Vg?oc=5\" target=\"_blank\">Braves Outright DFA'd",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNb2pBNTI2dC1iM0RldzBUT3BGZzdjRy1sTVFmZU9GUnRSRGxuMlBVTkhIOTk5akM3R2Z2anJocENNa1NHLWVrMDc2Z1IxdGpjTlQ1ZG5pam1ibEY1dXVSa2xHWGUtXy1rUWEzVHpBdEhZb1JkdHZLX3M2aHpOdFlDc19STmRGeHc?oc=5\" target=\"_blank\">Magic Johnson Makes Prediction for Rockets A",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxOOFg1eUNvYUtfTVhodVctQzV2ZzUtdnlreDFWc09Hc25lR0c3Mi1IMUYxNDlzMHdKeXRzek9rZGg0M3lEUVNNbWMtajFhWDJLRE1uYWt0R0Y4LS01ZjZ3TXVSYlB1NjJScjZ0UGpsbDFYTUdIZDg2MDh1VTQzNmNRckRGNy1OUldIcjBiQjJHakZ4Q1U?oc=5\" target=\"_blank\">‘Optimistic’—Xabi Alonso Rev",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPeXFGaG1YTElQb1E0Qk1LR2JwYklnZnpNVzVBRUJUcXhUcWk2OTFzazBMYlFDOHEtOTdoNlYwZEZ3RDVCeTVFRXZLV3htZ2NHdUJ5ZVNDbE9VNnA1eS1hZXBacEk2VzlCLS1HRV9hRmhHekVia2RfMzhOSE0xcm1zSlhPUWJJelhpcHBWcXY4T21UMHlkbkYtNg?oc=5\" target=\"_blank\">Details Released Abou",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPNDNlMk8tNWtIOTRSXzBfS09GTXJsdkVhTXVlMjV6N3pvUGY4QzFhWXdOTHRMY3ZpSnh3cG5Ya1V4b2xWc3MxUXZFazlxOXQ5V3FJWUMtMXBWU25Vb3d5MVJHOGlmWXVITGxialFqOTFuMDBTOWctemFFNXJpeTI0cTNKVGtJNGwwV2VRQw?oc=5\" target=\"_blank\">Ben Griffin Responds to Jack Nicklaus",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNNTJoNmZYX2tNRnRsbE1MOFc2UjZyMU83Tkc2OGlRRmh1T3RRakNZZTJBMEVuNVdUbUJ4X2xXeUZ5R2taTGJBVEVMTlczQzZCbWZtejE3dDdONmhnLUlhVnZMNEpwMWVMN25DanlGTmdRdkRPU3ZWVEVZZjlJOXctS01uSG41RDhzYzFkZEZ6dw?oc=5\" target=\"_blank\">Roundtable: Lions Player Not Gett",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQanlLb3pnUFp6QTFrYWFtSThqVG5ZZUR3WTRxcGhqM2hjYmI1X0NYaFQ5SV91ekFEQkhEQ09iVVNmRmxUUFgxdGpMMjh1Tlc2V1RBT2tnNm9qOWNkS1FpRmE2Y0E3b2ZSeTBmXzA1anNuOWpaMnk3ZFZwTEZLNjhxb201SDhsUzV4enAzaFNXUE5sUWx6eWlKM3ZR?oc=5\" target=\"_blank\">Maple Leafs Reporte",
      "Haliburton went down late in the first quarter of Game 7",
      "People are going to ask: Should Haliburton have even been playing after the calf strain?",
      "The entire league landscape changed when the Pacers star went down in Game 7 on Sunday night",
      "Pacers star Tyrese Haliburton was helped off the court in the first quarter of Game 7 with what his father told ESPN is an Achilles injury.",
      "Caitlin Clark's exchange with legend.",
      "Oklahoma City Thunder star Chet Holmgren sent a loud four-word message after winning the championship on Sunday night.",
      "The best photos from the Oklahoma City Thunder's 2025 NBA championship celebration.",
      "How long can Shai Gilgeous-Alexander and his crew keep this going?",
      "<p>With Oklahoma City&#8217;s championship season now cemented, here are some of the sports world&#8217;s best reactions to the Thunder finally hoisting the Larry O&#8217;Brien Trophy.</p>",
      "<p>Shai Gilgeous-Alexander poured in 29 points and dished 12 assists, earning Finals MVP honours as the Oklahoma City Thunder topped the Indiana Pacers 103-91 in Game 7 of the NBA Finals for the city&#8217;s first championship win.</p>",
      "<p>Parker Meadows blasted a three-run homer, Wenceel Pérez added a two-run shot, and the Detroit Tigers crushed the Tampa Bay Rays 9-3.</p>",
      "<p>Jose Iglesias got his team on the board with a two-run single in the seventh and walked it off with an RBI fielder&#8217;s choice in the ninth as the San Diego Padres rallied to defeat the Kansas City Royals 3-2.</p>",
      "<p>Kyle Stowers hit his first home run in 31 games, Otto Lopez drove in a pair of runs, and Sandy Alcantara allowed three runs over six quality innings as the Miami Marlins defeated the Atlanta Braves 5-3.</p>",
      "<p>Tommy Pham drove in three runs on three hits, Bailey Falter pitched into the sixth inning, and the Pittsburgh Pirates cruised to an 8-3 win over the Texas Rangers.</p>",
      "<p>Jazz Chisholm Jr. added two hits and two RBIs to his season tally, Will Warren pitched into the seventh inning, striking out six, and the New York Yankees took a 4-2 win over the Baltimore Orioles.</p>",
      "<p>Cal Raleigh continued his hot streak with a two-run blast, Donovan Solano smacked a pair of two-run shots, and the Seattle Mariners crushed the Chicago Cubs 14-6.</p>",
      "<p>Max Muncy crushed a three-run and a two-run shot, driving in seven runs on the day, Shohei Ohtani recorded his first strikeout in a Dodgers uniform, and Los Angeles earned a 13-7 win over the Washington Nationals.</p>",
      "<p>Shohei Ohtani pitched one hitless inning Sunday in his second mound start for the Los Angeles Dodgers, striking out two and allowing just one baserunner on an error by Mookie Betts.</p>",
      "<p>Miguel Vargas added two hits and two RBIs to his season tally, Adrian Houser pitched into the seventh inning, and the Chicago White Sox took a 4-2 win over the Toronto Blue Jays.</p>",
      "<p>Sportsnet&#8217;s Hazel Mae and Shi Davidi break down Toronto Blue Jays reliever Jeff Hoffman&#8217;s eighth-inning hiccup, why manager John Schneider remains confident in him, Chris Bassitt&#8217;s strong outing, and Max Scherzer&#8217;s return to the rotation.</p>",
      "<p>Chris Bassitt tossed six strong innings in a loss to the White Sox on Sunday, once again providing the type of rotation steadiness that has become a Blue Jays cornerstone.</p>",
      "Miguel Vargas doubled in two runs in the eighth inning as the Chicago White Sox rallied past the Toronto Blue Jays 4-2 on Sunday afternoon.",
      "<p>Shai Gilgeous-Alexander cemented his legacy as perhaps the best Canadian basketball player of all time, capping off a 68-win season by leading the Thunder to their first NBA championship.</p>",
      "Oklahoma City Thunder capped an extraordinary season by defeating Indiana Pacers 103-91 in Game 7 of the NBA Finals to win the franchise's first title since relocating from Seattle in 2008.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNV0Z1VUxnQWoyYkhrZEN4NEMxdnZYUjdDT2xWRXkzcEx2OXRrYXIzZTJjYWY4bFB2OHJKUk1RczNBREh0WHI1alRJenAyX3lfWkhxYzRqNGx0VDZCNWRucG84bTlKblozU19pNTkzelJPbmdnYWltNmpUTVFwTXUxUUpCYUVaZnk2eDRCdA?oc=5\" target=\"_blank\">One Stat Summed Up Thunder's Game 7 W",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNcnVleHdublZFVjNSZnYza3ZFN3ppd2dXbXNTZDlqR05YSHZDcWh2Tlc2YVpUTTdocV9UN0wyUVpQUTBSU1JkYV9LbzlscG96dFN4SGRoWmJzc2cwMWN4TU5SbDhzNGtrR1dHM29xRmxfR1lPUFd1T25uZDJTLXRMZ2R3?oc=5\" target=\"_blank\">Thunder Beat Pacers in Game 7 to Win Franchise's Fi",
      "Carlisle has plenty of motivational material for the Pacers entering Game 7",
      "Tonight is the first NBA Finals Game 7 in almost a decade. Here is what to watch for as the Thunder take on the Pacers.",
      "For the first time since relocating to Oklahoma City, the Thunder has won an NBA Championship.",
      "Oklahoma City will be celebrating the Thunder's title with a parade on Tuesday",
      "The Pacers fell just short, but there are other title-less franchises that could be next to hoist the trophy",
      "<p>Minjee Lee closed with a 2-over 74 but never gave up the lead Sunday in the final round of the KPMG Women’s PGA Championship to win her third major title. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOYWJaaVRFaE92MHRBR0dvdlpqT1VXWGduTzEwRklHWWNMMXBKU2I1TkpGYl9UdTVTMFdHUzJlWVJwcEk1NWdQM2RZZFlPVGFRSVd4MDlyX0NfWm1RRC1HSXVMV2VrWm9tTTZiQ2ktVk9kUUtJMDNFMjh3clpycDduTWZZendnQ2IwTkpRcjZEMktkZlhrcmc?oc=5\" target=\"_blank\">2025 KPMG Women's PGA Ch",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPWk5naVZsYUVETVdhbGlZUDRxbXNpaG9lTHBXX2NuVkVnSUpxR2lIM1dhUC1faDlqZ3JIZTRMZzR3S1QtcThLT2luZVNhTzQyS19hWlVvanhXMFN0VnRMQ0VQUnV6ZnhRaGV6cHB3SHZiZjdsS29OSzl5YnFYaHlhM01TcngydVBva0l2ck43Zw?oc=5\" target=\"_blank\">2025 Travelers Championship Final",
      "<p>New England&#8217;s own Keegan Bradley caps off the comeback on the 72nd hole to win the Travelers Championship at TPC River Highlands in Cromwell, Conn., during the final signature event of the year.</p>",
      "<p>Ryder Cup captain Keegan Bradley rallied from three shots behind with four holes to play and birdied the 18th hole before a delirious home crowd Sunday for a 2-under 68 to win the Travelers Championship.</p>",
      "An incredible final hole played out at the Travelers Championship, as Keegan Bradley sensationally denied Tommy Fleetwood a maiden PGA Tour title.",
      "Highlights from the final round of the Travelers Championship as Tommy Fleetwood narrowly missed out on a maiden PGA Tour title at the hands of Keegan Bradley.",
      "American Keegan Bradley pips England's Tommy Fleetwood on the 18th hole to claim the Travelers Championship.",
      "The final signature event of the season brought with it another significant payout at the Travelers Championship",
      "Highlights from the final round of the KPMG Women's PGA Championship at PGA Frisco.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/live/2025/jun/22/indiana-pacers-v-oklahoma-city-thunder-nba-finals-game-7-live-updates\">As it happened: Pacers 91–103 Thunder</a></p></li><li><p>Franchise claim first title since move from Seattle</p></li><li><p>Pacers lose star Tyrese Haliburton",
      "The best photos from the Oklahoma City Thunder's 103-91 Game 7 win over the Indiana Pacers.",
      "Three-leg NBA SGP picks and best bets for Sunday's NBA Finals 2025 Game 7 between Oklahoma City and Indiana",
      "NBA insiders break down the Thunder's Game 7 win to claim the championship.",
      "SportsLine's model simulated Oklahoma City vs. Indiana 10,000 times and revealed its NBA picks for Sunday's NBA Finals 2025 Game 7 contest",
      "SportsLine expert Matt Severance reveals his NBA bets and predictions for Sunday's Game 7 of Indiana Pacers vs. Oklahoma City Thunder in the NBA Finals 2025",
      "The first NBA Finals Game 7 in nine years is set for Sunday night",
      "Tyrese Haliburton's father confirmed his son suffered an Achilles injury in the winner-take-all title game",
      "The Thunder were victorious in Sunday's Game 7",
      "NBA front office insider Bobby Marks breaks down the summer priorities and needs for every team.",
      "Oklahoma City Police Sgt. Rob Robertson told ABC News that shots rang out on the west side of Scissortail Park shortly after the game ended.",
      "Thunder&#039;s Shai Gilgeous-Alexander scored 29 points and won the Finals MVP Award as OKC won the trophy at home."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/663e/live/8537e810-4ff9-11f0-a4e7-aff14a71dc45.jpg",
    "titles": [
      "Thunder beat Pacers to win NBA Finals",
      "Game 7: Shai Gilgeous-Alexander scores 29 points and Thunder beat Pacers 103-91 for NBA title",
      "Canada’s Shai Gilgeous-Alexander leads Oklahoma City to NBA title",
      "Shai Gilgeous-Alexander wins NBA Finals MVP, completing season not seen since Shaquille O'Neal, Michael Jordan",
      "Gilgeous-Alexander, Dort join growing list of Canadians to win NBA title",
      "‘My people’: Thunder’s Dort sends love to Canada, Haiti after title win",
      "Canada’s Shai Gilgeous-Alexander captures Finals MVP award",
      "Shai Gilgeous-Alexander Joins Elite Company After Thunder's NBA Title",
      "Shai Gilgeous-Alexander Sends Message About Tyrese Haliburton After NBA Finals",
      "Caitlin Clark Had No Words for Tyrese Haliburton News on Sunday",
      "LeBron James Reacted to Tyrese Haliburton Injury With One NSFW Word - Sports Illustrated",
      "Pacers’ Tyrese Haliburton exits Game 7, ruled out with right Achilles injury",
      "Inter Miami CF Predicted Lineup vs. Palmeiras: Herons Try for Round of 16 Berth - Sports Illustrated",
      "Predicting Lions' Madden NFL 26 Ratings: Defense - Sports Illustrated",
      "Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First Win of the Alonso Era - Sports Illustrated",
      "Real Madrid beat Pachuca at Club World Cup despite Asencio’s early red card",
      "Atletico Madrid vs. Botafogo live stream, where to watch Club World Cup: Odds, prediction, pick, lineups",
      "Porto vs. Al Ahly live stream, odds: Where to watch Club World Cup online, pick, prediction, what to know",
      "Seattle Sounders vs. PSG live stream, where to watch Club World Cup: Odds, prediction, pick, lineups",
      "Man City vs. Al Ain odds, prediction, time: Free 2025 FIFA Club World Cup expert picks for Sunday, June 22",
      "Man City score six to reach Club World Cup last 16",
      "Kenan Yildiz scores twice in Juventus’ win in Club World Cup",
      "Club World Cup updates: Echeverri shows he can shine for City",
      "Brazilian Teams Dominate At FIFA 2025 Club World Cup",
      "Manchester City hit Al Ain for six in one-sided Club World Cup romp",
      "There was a glimpse of the future at Manchester City against Al Ain",
      "Claudio Echeverri scores brilliant first Manchester City goal",
      "Echeverri, Cherki score 1st City goals in CWC romp",
      "USMNT vs. Haiti prediction, odds, time, best bets: Free 2025 Concacaf Gold Cup picks for Sunday, June 22",
      "U.S. overcomes Freese gaffe as to beat Haiti, win Concacaf Gold Cup group",
      "Mexico vs. Costa Rica prediction, odds, time, bets: Free 2025 Concacaf Gold Cup picks for Sunday, June 22",
      "Costa Rica draws with Mexico, meets U.S. in last 8",
      "Manchester City thump Al Ain 6-0 at Club World Cup",
      "FIFA Club World Cup 2025 schedule, scores: Where to watch Lionel Messi and Inter Miami vs. Palmeiras",
      "New York Yankees Surprisingly Call Up New Starter - Sports Illustrated",
      "Here's Where LSU's Eighth Men's College World Series Title Ranks All-Time - Sports Illustrated",
      "LSU sweeps Coastal Carolina in College World Series finals for second title in three years",
      "LSU chases Coastal, wins 2nd MCWS in 3 years",
      "Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to NBA Title - Sports Illustrated",
      "Braves' Brian Snitker Declines to Place Blame on Michael Harris II - Sports Illustrated",
      "2025 College World Series: Scores, bracket, complete results as LSU wins eighth national title in baseball",
      "NASCAR 2025 race schedule, results: Complete list of Cup Series race dates, winners, tracks, locations",
      "LSU's latest MCWS title makes the Tigers college baseball's best of all time",
      "Bayern Munich ‘Targeting Second Liverpool Star’ Alongside Cody Gakpo - Sports Illustrated",
      "Broncos DC Explains How Hufanga & Greenlaw Will Elevate This Defense - Sports Illustrated",
      "Rockets Acquire Kevin Durant in Blockbuster Trade With Suns - Sports Illustrated",
      "AP Source: Suns trade Kevin Durant to Rockets",
      "New Details Emerge on Heat's Failed Attempt to Trade for Kevin Durant",
      "How Kevin Durant's trade to Rockets gives KD perfect situation to rewrite his legacy",
      "Details of Heat’s Failed Final Trade Offer for Kevin Durant Revealed - Sports Illustrated",
      "Russell Henley Calls Penalty on Himself at Travelers to Teach His Son a Lesson - Sports Illustrated",
      "Houston Rockets Land Kevin Durant In Massive Trade With Phoenix Suns",
      "Grading the deal: Houston goes all-in, but did Phoenix get enough?",
      "Durant traded to Houston Rockets for Green, Brooks, picks: Report",
      "Marchment traded to Kraken by Stars for 2 draft picks - NHL.com",
      "Kevin Durant trade: Rockets land Suns star in NBA blockbuster as Jalen Green headlines return",
      "Kevin Durant trade: Why Heat reportedly rejected offer, plus which teams made a run before Rockets deal",
      "Kevin Durant trade shows just how far Rockets have risen, Suns have fallen",
      "Winners and losers of Kevin Durant trade: Good news for Rockets' Amen Thompson, Heat and Wolves miss out",
      "Sources: Durant to Rockets in blockbuster trade",
      "NBA Insider Gives Update on Rumored Paul George Trade - Sports Illustrated",
      "Transfer Rumors: Man Utd Make New Mbeumo Bid; Diaz Agrees Real Madrid Move - Sports Illustrated",
      "Flash Sale: Ja Morant's Nike Sneakers are Just $39 Online - Sports Illustrated",
      "’I Need to Play’—Arda Guler Makes Real Madrid Transfer Admission - Sports Illustrated",
      "New York Yankees Projected to Land Anthony Volpe Replacement - Sports Illustrated",
      "Eagles 'Weapon' Already Compared To Legend - Sports Illustrated",
      "Braves Outright DFA'd Reliever to Triple-A - Sports Illustrated",
      "Magic Johnson Makes Prediction for Rockets After Kevin Durant Trade - Sports Illustrated",
      "‘Optimistic’—Xabi Alonso Reveals Kylian Mbappe’s Club World Cup Return Date - Sports Illustrated",
      "Details Released About Celtic's Deal For Benjamin Nygren - Sports Illustrated",
      "Ben Griffin Responds to Jack Nicklaus's Subtle Stray After the Memorial Tournament - Sports Illustrated",
      "Roundtable: Lions Player Not Getting Enough Attention - Sports Illustrated",
      "Maple Leafs Reportedly Lowball John Tavares With Initial Contract Offer - Sports Illustrated",
      "NBA stars react to Tyrese Haliburton injury, Draymond Green makes comparison to Kevin Durant's Achilles tear",
      "Tyrese Haliburton's apparent Achilles tear brings one of NBA's all-time stories to a heartbreaking end",
      "Tyrese Haliburton just suffered the most devastating injury in NBA history, and it impacts the whole league",
      "Pacers lose Haliburton to Achilles injury in Game 7",
      "Caitlin Clark's Meeting With Cheryl Miller Turns Heads on Sunday",
      "Thunder's Chet Holmgren Sends Loud 4-Word Message After Winning NBA Championship",
      "Photos: Best images from Thunder's 2025 NBA championship celebration",
      "Why Thunder are perfectly set up to be next NBA dynasty after winning first championship in OKC",
      "‘Start of a dynasty?’: Sports world reacts to Thunder winning NBA title",
      "NBA Finals Game 7 Highlights: Thunder 103, Pacers 91",
      "MLB Highlights: Tigers 9, Rays 3",
      "MLB Highlights: Padres 3, Royals 2",
      "MLB Highlights: Marlins 5, Braves 3",
      "MLB Highlights: Pirates 8, Rangers 3",
      "MLB Highlights: Yankees 4, Orioles 2",
      "MLB Highlights: Mariners 14, Cubs 6",
      "MLB Highlights: Dodgers 13, Nationals 7",
      "Ohtani pitches sharp inning, hits homer in Dodgers’ win over Nationals",
      "MLB Highlights: White Sox 4, Blue Jays 2",
      "Blue Jays drop series to White Sox after Hoffman’s latest hiccup",
      "Bassitt provides stability for Blue Jays pitchers despite loss to White Sox",
      "Vargas’s two-run double lifts White Sox over Jays",
      "Gilgeous-Alexander, Thunder cement legacy with NBA championship",
      "Thunder cap incredible season by beating Pacers in Game 7 to win NBA Finals",
      "One Stat Summed Up Thunder's Game 7 Win Over Pacers to Claim First NBA Title - Sports Illustrated",
      "Thunder Beat Pacers in Game 7 to Win Franchise's First NBA Championship - Sports Illustrated",
      "Pacers' Rick Carlisle motivated by leaked video of Thunder championship buses: 'That's all I'm thinking about'",
      "Stats, Odds To Watch For NBA Finals Game 7 Between Pacers And Thunder",
      "2025 NBA Finals: Thunder Delivers Oklahoma City Its First NBA Title",
      "Thunder parade details: Oklahoma City sets date, route, time to celebrate 2025 NBA champions",
      "Ranking 10 NBA teams that have never won a championship by who's closest to first title",
      "Minjee Lee wins the KPMG Women’s PGA Championship for her 3rd major title",
      "2025 KPMG Women's PGA Championship Final Payouts, Prize Money, Winnings: Minjee Lee Wins $1.8 Million - Sports Illustrated",
      "2025 Travelers Championship Final Payouts, Prize Money, Winnings: Keegan Bradley Wins $3.6 Million - Sports Illustrated",
      "Keegan Bradley caps off comeback on 72nd hole to win Travelers Championship",
      "Keegan Bradley pulls stunner to deny Fleetwood, win Travelers Championship",
      "INCREDIBLE SCENES! Dramatic chip-in, Fleetwood falters and Bradley birdies to win!",
      "Fleetwood misses out to Bradley in DRAMATIC finish!",
      "Heartbreak for Fleetwood as Bradley denies him first PGA title",
      "2025 Travelers Championship purse, prize money: Payouts for Keegan Bradley, players from $20 million pool",
      "Minjee Lee wins third major title at Women's PGA Championship",
      "Thunder beat Pacers in Game 7 to win franchise’s first NBA title in Oklahoma City",
      "Photos: Best images from Thunder's 103-91 Game 7 win over Pacers",
      "Free NBA picks, odds, player props, SGP bets for 2025 NBA Finals, Game 7: Pacers vs. Thunder same game parlay",
      "2025 NBA Finals: OKC crowned champion in winner-take-all Game 7",
      "Pacers vs. Thunder prediction, odds, line, start time: 2025 NBA Finals Game 7 picks by computer model",
      "2025 NBA Finals odds, Game 7 prediction: Pacers vs. Thunder picks, best bets by NBA expert on 168-91 run",
      "Where to watch NBA Finals Game 7: Thunder vs. Pacers TV channel, time, odds, live stream",
      "Tyrese Haliburton injury: Torn Achilles feared for Pacers star after exiting NBA Finals Game 7 in serious pain",
      "2025 NBA playoff bracket, scores: Thunder take down Pacers in NBA Finals Game 7 for OKC's first title",
      "Thunder and Pacers' biggest summer priorities, plus guides for every NBA team",
      "1 injured in shooting near downtown Oklahoma City after NBA Finals win: Police",
      "OKC Thunder beat Indiana Pacers 103-91 in Game 7 to win NBA Finals"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.975,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.835,
    "summary": "LSU defeated Coastal Carolina 5-3 in the Men's College World Series finals, claiming their second national championship in three years. The victory was highlighted by a four-run fourth inning that knocked Coastal Carolina's previously unbeaten ace, Jacob Morrison, out of the game. During the match, Coastal Carolina head coach Kevin Schnall and first base coach Matt Schilling were ejected, resulting in their suspension for a potential Game 3. LSU's win in Omaha reaffirmed their dominance in college baseball.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the outcome of the College World Series finals and highlights some key moments in the game. However, it lacks a deeper analysis of the team's performance over the years, the significance of the win, or the impact of the coaches' ejection."
  },
  {
    "title": "Russian Strikes in Kyiv Kill 5, Hit Hospitals Amid Stalled Talks",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 07:08:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Russian missiles and drones hit residential areas and hospitals in Ukraine's Kyiv region, the interior minister says.",
      "It was the latest in a series of deadly Russian strikes, which have intensified as cease-fire talks have largely stalled.",
      "Missile and drone strikes target residential areas in numerous districts across Kyiv.",
      "Attack on Kyiv kills five and wounds others as rescue efforts continue."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7f89/live/a0be0a40-4ffb-11f0-a466-d54f65b60deb.jpg",
    "titles": [
      "Seven killed in Kyiv in new Russian aerial attack",
      "Russian Attack on Kyiv Kills at Least 6, Ukraine Says",
      "‘Massive’ Russian air assault kills at least six in Ukraine’s capital Kyiv",
      "Search for survivors after Russian drone and missile barrage hits Kyiv"
    ],
    "score_components": {
      "magnitude": 0.87,
      "recency": 0.979,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary": "Russian missile and drone attacks targeted residential areas and hospitals in Ukraine's Kyiv region, resulting in at least five deaths and multiple injuries, according to the interior minister. These strikes are part of a series of deadly attacks amidst stalled cease-fire talks. Several districts across Kyiv were affected, with ongoing rescue operations for the wounded.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing conflict in Ukraine, including the impact on civilians and infrastructure. However, it lacks depth or insight into the causes, potential solutions, or broader implications of the situation."
  },
  {
    "title": "Iran Parliament Backs Strait of Hormuz Closure Idea Amid US Tensions",
    "domain": "general",
    "location": "national",
    "published": "Sun, 22 Jun 2025 20:37:06 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CNBC",
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE11NldzRS1CR2dBVFFCdWo4bGxYWTJ6WGliUGQ0NURBNm15ZmczWnI5N3I0Y3FzQUhqcXV4WFE4N0RaNnVNN01yOXFhLUdDa1BWUENPY3c4RXJ3QmFVVXFRZS1mOWRVVzRsZ1JhckNSWQ?oc=5\" target=\"_blank\">Iran parliament reportedly backs closing Strait of Hormuz, which could spike ",
      "Iran's foreign minister warned earlier Sunday that the Islamic Republic \"reserves all options to defend its sovereignty\" after U.S. airstrikes.",
      "The Strait of Hormuz isn’t the only concern when it comes to flows of crude and other energy products out of the Middle East.",
      "<p>Iran’s parliament approved a measure to close the vital global trade route, through which more than a fifth of the world’s oil supply passes through daily</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza",
      "The Straits are the only sea route from the Persian Gulf to the open ocean, and about 20% of the world's oil transits the waterway."
    ],
    "image_url": "",
    "titles": [
      "Iran parliament reportedly backs closing Strait of Hormuz, which could spike oil prices - Axios",
      "U.S. calls on China to prevent Iran from closing Strait of Hormuz and disrupting global oil flows",
      "It isn’t just the Strait of Hormuz. Oil traders and global investors await Iran’s response to U.S. strike.",
      "The strait of Hormuz: what is it, and why does it matter to global trade?",
      "Iran’s parliament backs blocking Strait of Hormuz. Its closure will alienate Tehran further"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.786,
      "consensus": 0.985,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary": "Iran's parliament has reportedly supported the idea of closing the Strait of Hormuz, a crucial passage for Middle Eastern oil and gas exports, in response to U.S. airstrikes on its nuclear sites. Despite this, the likelihood of the strait's closure remains low. Iran's foreign minister has stated the country reserves all options to defend its sovereignty. The situation has led to increased geopolitical risks, contributing to a stronger dollar in early trading as investors seek protection.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant geopolitical event, providing context about the strategic importance of the Strait of Hormuz and the potential economic impacts of its closure. However, it does not report on any solutions or attempts to solve the problem."
  },
  {
    "title": "Lions Land in Australia; Injury Concerns Ahead of Force Game",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 07:01:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Chest-thumping speech before the 2013 series decider is part of Lions lore and can be the head coach’s mantra for his 2025 tourists",
      "The British and Irish Lions touched down in Australia, with head coach Andy Farrell revealing lingering injury concerns over Jamison Gibson-Park and Hugo Keenan.",
      "<p>Chest-thumping speech before the 2013 series decider is part of Lions lore and can be the head coach’s mantra for his 2025 tourists</p><p>The logistics involved in touring Australia with the British &amp; Irish Lions have changed slightly over the years. On the first Lions tour in 1888 the 22 sel"
    ],
    "image_url": "",
    "titles": [
      "Andy Farrell’s Lions land in Australia aiming to revive the spirit of Sydney",
      "Farrell reveals fitness concerns over key duo as Lions land in Australia",
      "Andy Farrell’s Lions land in Australia aiming to revive the spirit of Sydney"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.977,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary": "The British and Irish Lions have arrived in Australia for their game against the Western Force, with head coach Andy Farrell expressing concerns over injuries to Jamison Gibson-Park and Hugo Keenan. Despite these concerns, Huw Jones is confirmed available for the match, while Immanuel Feyi-Waboso is set to face a disciplinary hearing. The team's preparation is underway, with the status of Gibson-Park and Keenan closely monitored ahead of Saturday's game.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides basic awareness about the upcoming game and the injury status of key players, it lacks depth or insight into the implications of these injuries or the strategies the team might employ to overcome these challenges."
  },
  {
    "title": "Brook's 99 Nears India's Score; Match Poised as Teams Enter Day 4",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 17:42:39 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Harry Brook's knock of 99 helps England close the gap to trail by six runs before India get their second innings underway with a score of 90-2 at close of play on day three of the first Test at Headingley.",
      "India has 96-run lead over England with eight wickets remaining going into day four of first cricket Test at Headingley.",
      "India are two down, leading England by 96, going into the fourth morning of the first Test at Headingley after another hugely-absorbing day's play on Sunday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3ad1/live/1bf700b0-4f91-11f0-86d5-3b52b53af158.jpg",
    "titles": [
      "Brook misses out on century as first Test finely poised on day three",
      "India-England: Brooks scores 99, Stokes strikes late on day 3 of first Test",
      "Stokes strikes late to leave England-India Test perfectly poised"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.74,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "On day three of the first Test at Headingley, Harry Brook scored 99 runs, bringing England close to India's first innings score with a total of 465. India, in their second innings, ended the day at 90-2, leading by 96 runs with eight wickets in hand. The match has seen significant performances, including a century by Ollie Pope and a notable bowling effort from Jasprit Bumrah. The outcome remains uncertain as the teams head into day four.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the ongoing cricket match between England and India. It gives some details about the performances of the players and the current status of the game. However, it does not offer deeper insights or actionable information for the reader."
  },
  {
    "title": "NBA Draft Prospect Rankings Released, Key Movements in Top 10 Noted",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 00:47:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Who made big jumps in the top 10? Where do the Duke, Rutgers players rank? Here's our final top 100 big board.",
      "Our experts reveal their consensus final NBA Draft prospect rankings"
    ],
    "image_url": "",
    "titles": [
      "📈 Final NBA draft big board: Top 100 prospects",
      "2025 NBA Draft Top 100 Prospect Rankings: Scouting reports for top players on final Big Board"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.932,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.709,
    "summary": "Experts Matt Miller and Jordan Reid have released their final NBA Draft prospect rankings, highlighting significant movements within the top 10, including the positions of Duke and Rutgers players. They also speculate on the possibility of the draft's fourth-ranked player dropping to eighth. Additionally, they share their early top-five rankings for every position, focusing on key players to watch in the 2025 season. This comprehensive analysis aims to provide a clear overview of the talent landscape as the draft approaches.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information and context about the NBA Draft prospect rankings, which can help readers understand the dynamics of the upcoming season. However, it doesn't highlight progress or solutions, and its main focus is on speculation and predictions."
  },
  {
    "title": "Spain Exempt from NATO's 5% GDP Defense Spending Target, PM Announces",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 06:45:21 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "CityNews"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "NATO meets for its annual summit this week, and the U.S. is pushing for allies to sharply increase their defense spending to 5% of gross domestic product.",
      "MADRID (AP) — Spain reached a deal with NATO to be excluded from a 5% of GDP defense spending target, days before the military alliance&#8217;s leaders will gather at a summit, Prime Minister Pedro Sánchez said on Sunday. “Spain will, therefore, not spend 5% of its GDP on defense, but its participat"
    ],
    "image_url": "",
    "titles": [
      "NATO allies will pledge to hike defense spending – but will they deliver?",
      "Spain reaches deal with NATO ahead of summit to be excluded from 5% defense spending goal"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.971,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary": "At the annual NATO summit, the U.S. advocated for member nations to significantly boost their defense spending to 5% of GDP. However, Spain negotiated an exemption from this target, as announced by Prime Minister Pedro Sánchez. Consequently, Spain will not adhere to the 5% GDP defense spending guideline but will maintain its participation in NATO activities.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about Spain's position within NATO and its financial commitments, contributing to readers' understanding of international relations and defense spending. However, it does not report on solutions or progress, nor does it delve into the potential impacts of this decision."
  },
  {
    "title": "IS Suicide Bomber Kills 22 at Damascus Church Service",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 18:17:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Blast in Dweil’a on the outskirts of Damascus was carried out as people were praying inside the Mar Elias Church.",
      "<p>Evening attack is first major atrocity by Islamist terror group in Syria since President al-Assad was deposed</p><p>A suicide bombing by Islamic State (IS) targeting a church in Damascus has killed 22 people and wounded 63, Syrian state media have said.</p><p>The attack on Sunday night was the fi",
      "The attack on a Greek Orthodox service made clear the challenges facing Syria’s new government in a country long pitted by sectarian divides."
    ],
    "image_url": "",
    "titles": [
      "At least 22 killed in Syria church bombing attack, dozens wounded",
      "Islamic State suicide bombing in Damascus church leaves many dead and dozens injured",
      "Syria Church Bombing Kills at Least 20 in Damascus"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.749,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary": "An Islamic State (IS) suicide bomber attacked a Greek Orthodox church in Damascus, Syria, during a service, killing 22 and wounding 63. The incident occurred in the Dweil’a area on the outskirts of the capital. This marks the first major terrorist act in Syria since President al-Assad's deposition, highlighting the ongoing sectarian challenges the new government faces.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story reports on a tragic event, raising awareness about the ongoing sectarian challenges in Syria. However, it does not provide deeper insights into the root causes of these challenges, potential solutions, or the broader impacts of this event."
  },
  {
    "title": "Royal Ascot Attendance Rises, Showcasing Event's Enduring Appeal",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 07:00:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "A full set of rising attendances confirms the enduring appeal of the summer showpiece with its ability to grow and evolve",
      "<p>Full set of rising attendances confirms the enduring appeal of the summer showpiece with its ability to grow and evolve</p><p>There were a host of memorable performances and races over the course of Royal Ascot, from Field Of Gold’s <a href=\"https://www.theguardian.com/sport/2025/jun/17/royal-asc"
    ],
    "image_url": "",
    "titles": [
      "Royal Ascot plays strong hand to underpin meeting’s continuing success",
      "Royal Ascot plays strong hand to underpin meeting’s continuing success"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary": "The summer event Royal Ascot saw an increase in attendance, highlighting its lasting popularity and capacity to adapt. The event featured numerous memorable performances and races, including notable achievements by Field Of Gold. This confirms Royal Ascot's status as a significant and evolving fixture in the summer sporting calendar.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information on the increased attendance at Royal Ascot, indicating its enduring popularity. It also highlights specific performances, contributing to a deeper understanding of the event. However, it does not report on any significant innovations, improvements, or solutions within the sporting event."
  },
  {
    "title": "Jon Jones Retires from UFC, Aspinall Named New Heavyweight Champion",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 19:16:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "No, the last chapter of Jon Jones' UFC career doesn't negate his legacy, yet it does add a \"but\" to the end.",
      "With Jon Jones retired, Tom Aspinall is the undisputed UFC heavyweight champion. Aspinall's first title defense could come against Ciryl Gane. We look at the fight odds."
    ],
    "image_url": "",
    "titles": [
      "Okamoto: Jon Jones' MMA résumé isn't ruined by not fighting Tom Aspinall",
      "With Jon Jones Retired, Tom Aspinall Opens As Favorite Over Ciryl Gane"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.831,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.692,
    "summary": "Jon Jones has retired from the UFC, leaving a complex legacy. Despite his achievements, his career's final chapter adds a caveat to his reputation. Following his departure, Tom Aspinall has become the undisputed UFC heavyweight champion, with potential plans for his first title defense against Ciryl Gane being discussed, including fight odds.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant change in the UFC, namely Jon Jones' retirement and Tom Aspinall's ascension to heavyweight champion. It hints at the complexity of Jones' legacy, but doesn't delve into specifics. It also provides some insight into future plans for Aspinall's title defense, contributing to reader understanding of the current state and future of the UFC heavyweight division."
  },
  {
    "title": "OpenAI Removes io Acquisition Details Amid Trademark Lawsuit",
    "domain": "business",
    "location": "global",
    "published": "2025-06-22T23:48:32Z",
    "source": "Business Insider",
    "sources": [
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "OpenAI removed news of its deal with Jony Ive's io from its website on Sunday amid a trademark suit filed by iyO, another AI hardware company.",
      "OpenAI appears to have pulled a much-discussed video promoting the friendship between CEO Sam Altman and legendary Apple designer Jony Ive (plus, incidentally, OpenAI’s $6.5 billion deal to acquire Ive and Altman’s device startup io) from its website and YouTube page."
    ],
    "image_url": "https://i.insider.com/682e0b4aac40ae2b0c9eacd8?format=jpeg",
    "titles": [
      "OpenAI scrubs news of Jony Ive deal amid trademark dispute",
      "OpenAI pulls promotional materials around Jony Ive deal due to court order"
    ],
    "score_components": {
      "magnitude": 0.69,
      "recency": 0.84,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary": "OpenAI retracted information and a promotional video about its $6.5 billion acquisition of the device startup io, co-founded by CEO Sam Altman and Apple's Jony Ive, from its website and YouTube following a trademark lawsuit from iyO, another AI hardware company. This move indicates a response to legal challenges related to the deal and trademark issues.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is useful in that it informs readers about a current event in the tech industry, specifically the legal challenges OpenAI is facing due to a trademark lawsuit. However, it does not provide a deep understanding of the issue or offer any solutions or progress."
  },
  {
    "title": "Bayern Eyes Martinelli or Gittens, Arsenal Targets Rodrygo, Brighton to Bid for ",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 07:22:34 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Bayern to sign Gabriel Martinelli or Jamie Gittens? | Arsenal to make Rodrygo bid? | Brighton to splash £40m on Harvey Elliott?",
      "<p>Today’s fluff is embracing rain</p><p>The tears seemed very real from <strong>Emiliano</strong> <strong>Martínez</strong> after a win over Tottenham last month because his Aston Villa future is not certain. Despite being the world’s best goalkeeper, according to <a href=\"https://www.theguardian.c",
      "José Mourinho has approved a move for Manchester United winger Jadon Sancho as Fenerbahçe prepare for a pivotal summer transfer window.The Turkish club have already opened talks with United over a p..."
    ],
    "image_url": "",
    "titles": [
      "Football transfer rumours: Emiliano Martínez eager to join Manchester United?",
      "Football transfer rumours: Emiliano Martínez eager to join Manchester United?",
      "Jadon Sancho: José Mourinho plots move for Manchester United winger"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary": "Bayern Munich is considering signing either Gabriel Martinelli or Jamie Gittens. Arsenal is planning to bid for Rodrygo, while Brighton intends to spend £40m on Harvey Elliott. Emiliano Martínez's future at Aston Villa remains uncertain despite his notable performance. José Mourinho has approved Fenerbahçe's move for Manchester United winger Jadon Sancho, with talks already underway.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information for football fans, providing insights into potential player transfers and strategic decisions by clubs. However, it doesn't provide a broader context or analysis of trends in the sport."
  },
  {
    "title": "Pachuca's Cabral Admits Insulting Rudiger, Denies Racism in Club World Cup Row",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 01:03:37 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Pachuca's defender admits to insulting him but says that the insult was not racist",
      "Following the heated end to Real Madrid’s Club World Cup match against Pachuca, controversy erupted over an alleged racist incident involving Antonio Rudiger and Pachuca captain Gustavo Cabral. Rud..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/23/ea93dff2-2d21-4368-a8eb-3458c10e2500/rudiger.jpg",
    "titles": [
      "Real Madrid's Antonio Rudiger alleges he was racially abused by Pachuca's Gustavo Cabral",
      "Pachuca captain denies racist insults to Antonio Rudiger, explains what he really said"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.863,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Following a contentious incident during the Club World Cup match between Real Madrid and Pachuca, Pachuca's defender, Gustavo Cabral, admitted to insulting Real Madrid's Antonio Rudiger but denied the insults were racist. The controversy arose after the match, leading to public discussion and scrutiny over the nature of the remarks made by Cabral.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a controversy in the world of football, but does not provide any deeper insight or actionable information. It does not report on solutions or improvements, but rather on an ongoing dispute."
  },
  {
    "title": "Florida Panthers Celebrate Stanley Cup Win with Fort Lauderdale Parade",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 22:45:25 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPUVZrWkxpVXVySW9XeUNfVG5XdmRzTEZuVVFEeGJoeF9sOGNfRVctLVVxelN3VzhjT0taY1liVEJnTE9icXpJVk1KNDdFUHpZWmdOTE1YSDRrbDQ5Y3h4dzV1UjBQeFlkaExrMWZhZFFhR0R1b0lhY3lLRURraDYyeF9qZw?oc=5\" target=\"_blank\">Panthers continue Stanley Cup revelry with beachf",
      "<p>Champagne was swilled and spilled, cigars were smoked and the Stanley Cup was hoisted a few more times, all with about 400,000 people watching.</p>",
      "<p>The Stanley Cup celebrations continue in Fort Lauderdale as the Florida Panthers took to the streets Sunday. Here are some of the top sights and sounds from the parade.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQZ29GaVlEZXdSTkFkZDZONEV5R2tVWE1hZFdHU0dkSTdYNjRfaDlTRElPM1E4dEFkUWZVdXRXNzNnRVdUTTRwSnNPZ08yeGl3UExQSXFsRlBaOURXR29WWmVlaE5LekFWY094V2tSWVR2ZXRGUWNNbGt5Ti1lS0lJWWlpY1lHWEY5?oc=5\" target=\"_blank\">Tennis star Navratilova celebrates Stanley "
    ],
    "image_url": "",
    "titles": [
      "Panthers continue Stanley Cup revelry with beachfront parade - NHL.com",
      "‘This is amazing’: Panthers celebrate Stanley Cup with another parade",
      "Sights and sounds from Panthers’ Stanley Cup parade",
      "Tennis star Navratilova celebrates Stanley Cup with Panthers - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.822,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary": "The Florida Panthers celebrated their Stanley Cup victory in Fort Lauderdale with a parade attended by approximately 400,000 fans. The event featured champagne, cigars, and multiple instances of the Stanley Cup being hoisted. This celebration is part of ongoing Stanley Cup revelry involving the team and its supporters.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is primarily celebratory in nature, reporting on the Florida Panthers' Stanley Cup victory and subsequent parade. It doesn't offer much in terms of actionable insights or deeper understanding. It doesn't report on solutions, improvements, or innovations, and doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Former England Bowler Syd Lawrence and FedEx Founder Fred Smith Pass Away",
    "domain": "business",
    "location": "global",
    "published": "Sun, 22 Jun 2025 17:34:28 GMT",
    "source": "Investopedia",
    "sources": [
      "Business Insider",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Bloomberg via Getty Images Fred Smith \" src=\"https://www.investopedia.com/thmb/26vf8mOhBn9Mb8IIorpyPTh7etw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-1129092699-891701a40e334843b993a7aa4660ca8f.jpg\" /><figcaption><i><p>Anna Moneym",
      "Fred Smith, the founder of FedEx and a celebrated entrepreneur who frequented Washington, DC, died Saturday at 80."
    ],
    "image_url": "https://www.investopedia.com/thmb/26vf8mOhBn9Mb8IIorpyPTh7etw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-1129092699-891701a40e334843b993a7aa4660ca8f.jpg",
    "titles": [
      "FedEx Founder Fred Smith Dies at 80",
      "FedEx founder Fred Smith is dead at 80"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.738,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.596,
    "summary": "David 'Syd' Lawrence, a former England and Gloucestershire fast bowler, has passed away at the age of 61 after being diagnosed with Motor Neurone Disease last year. Lawrence took 18 wickets in five Tests for England. Separately, Fred Smith, the founder of FedEx and a Vietnam War veteran, has died at the age of 80. Smith started FedEx in 1973 with 14 planes, transforming it into a global express delivery giant.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the deaths of two notable figures, it does not provide much depth or insight beyond these facts. It does not offer actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "EU and Canada to Sign Defense Partnership Monday",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 06:53:10 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The European Union and Canada are expected to sign a security and defense partnership on Monday at a summit that will kick off a range of discussions about how they can work closer together."
    ],
    "image_url": "",
    "titles": [
      "EU and Canada Prepare to Sign Security Pact Ahead of NATO Summit"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 1.0
    },
    "score": 0.497,
    "summary": "The European Union and Canada are set to sign a security and defense partnership on Monday during a summit aimed at enhancing their collaboration. This agreement marks a significant step in strengthening the ties between the two entities, focusing on mutual security and defense interests.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in international relations, specifically in terms of security and defense partnerships. It provides information that can contribute to readers' understanding of the evolving geopolitical landscape. Nonetheless, it could have provided more details or insights on the potential impacts of this partnership."
  },
  {
    "title": "Supertankers Reverse in Strait of Hormuz After US Airstrikes on Iran",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 07:28:35 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Two supertankers, each capable of hauling about 2 million barrels of crude, U-turned in the Strait of Hormuz after US airstrikes on Iran raised the risk of a response that would ensnare commercial shipping in the region."
    ],
    "image_url": "",
    "titles": [
      "Supertankers Do U-Turns Around Hormuz After US Airstrikes"
    ],
    "score_components": {
      "magnitude": 0.229,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Following US airstrikes on Iran, two supertankers, each capable of transporting approximately 2 million barrels of crude oil, reversed course in the Strait of Hormuz. This action was taken due to concerns over potential retaliatory measures by Iran that could jeopardize commercial shipping in the area.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the immediate repercussions of US airstrikes on Iran, providing some context about the situation. However, it lacks depth and doesn't provide actionable insights or discuss potential solutions to the problem."
  },
  {
    "title": "Brent Crude Surpasses $80 After US Strikes on Iran",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 06:21:46 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Brent crude rises to more than $80 a barrel after US strikes on Iran"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F73b82a22-f538-4d26-a67c-b41e8f3be75b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Oil price hits 5-month high before paring gains"
    ],
    "score_components": {
      "magnitude": 0.209,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "Brent crude oil prices increased to over $80 a barrel following US military strikes on Iran. This development marks a significant shift in the oil market, influenced by geopolitical tensions between the US and Iran. The current status reflects heightened concerns over potential disruptions in oil supply.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the immediate impact of geopolitical events on oil prices, offering some insights into the dynamics of the oil market. However, it does not delve into the broader implications of this shift or potential strategies for managing such disruptions."
  },
  {
    "title": "US, Israeli Strikes Target Nuclear Sites, Concerns Over Enriched Material Rise",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 04:00:42 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "US and Israeli attacks hit key nuclear sites but questions remain over stash of enriched material"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F0929269a-609c-46c5-acd5-999173232264.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Where is Iran’s uranium? Fate of strike hangs on 400kg stockpile"
    ],
    "score_components": {
      "magnitude": 0.229,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.462,
    "summary": "US and Israeli forces conducted strikes on significant nuclear facilities, raising concerns about the whereabouts and security of a stash of enriched nuclear material. The current status of this material and the overall impact of the attacks on nuclear capabilities remain unclear.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a significant geopolitical event and its potential implications. However, it lacks depth or insight into the situation, such as the potential consequences of the strikes, the response from the international community, or the historical context of these actions."
  },
  {
    "title": "Kevin Mayer: AI Offers Limited Cost Relief in TV and Film Production",
    "domain": "business",
    "location": "global",
    "published": "2025-06-23T07:22:28Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Kevin Mayer said producing high-quality TV and movies is so expensive now that using AI can only help so much."
    ],
    "image_url": "https://i.insider.com/6858d1ecf748d8c055f42152?format=jpeg",
    "titles": [
      "A former Disney exec says peak TV is over, and there's only so much AI can do to help"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Kevin Mayer, a prominent figure in the entertainment industry, stated that the high costs associated with producing quality TV shows and movies are so significant that artificial intelligence (AI) can only provide limited assistance in reducing these expenses. This highlights the challenges faced by content creators in managing production budgets despite advancements in technology.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the challenges of managing production budgets in the entertainment industry, even with advancements in technology like AI. It does not necessarily report on solutions or improvements, but it does contribute to a deeper understanding of the issue."
  },
  {
    "title": "Paul Pogba Set to Join AS Monaco, Sources Say",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 03:14:35 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Former Manchester United and Juventus midfielder Paul Pogba will sign for Ligue 1 side AS Monaco, a source told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Source: Pogba to join Monaco on two-year deal"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.443,
    "summary": "Former Manchester United and Juventus midfielder Paul Pogba is set to join Ligue 1 team AS Monaco, according to information provided to ESPN by a source. This move marks a significant transfer for both Pogba and the Monaco club.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for football fans, particularly those who follow Paul Pogba or AS Monaco. It doesn't report on solutions or improvements, but it does provide a deeper understanding of player transfers within football, which could be useful for fans or those interested in the business side of the sport."
  },
  {
    "title": "Chile's New Telescope Unveils First Images, Transforming Astronomy",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 06:00:19 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A powerful new telescope in Chile is set to transform astronomy, and its first pictures of stellar nurseries and galaxies have just been unveiled"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/20111708/SEI_255987692.jpg",
    "titles": [
      "Stunning first images show the power of the Vera C. Rubin Observatory"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "A new powerful telescope in Chile has begun operations, significantly impacting astronomy. It has unveiled its first images, showcasing detailed views of stellar nurseries and galaxies. These initial pictures mark a transformative step in the study of the cosmos, promising deeper insights into the universe's mysteries.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in the field of astronomy, providing awareness about the potential for deeper understanding of the universe. It also highlights progress in the study of the cosmos."
  },
  {
    "title": "Study Suggests Brain Ages Faster, Linking to Memory Loss",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 03:13:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/your-brain-might-be-older-than-you-think-and-it-could-explain-memory-loss/\" rel=\"nofollow\" title=\"Your Brain Might Be Older Than You Think – And It Could Explain Memory Loss\"><img alt=\"Human Brain Abstract Technology\" class=\"webfeedsFeaturedVisual wp-post-image\" hei"
    ],
    "image_url": "",
    "titles": [
      "Your Brain Might Be Older Than You Think – And It Could Explain Memory Loss"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.902,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "A recent study suggests that the human brain may age faster than the rest of the body, potentially explaining memory loss. Researchers have found that certain brain regions can show signs of aging earlier than expected, which might contribute to cognitive decline. This discovery could help in understanding and addressing age-related memory issues.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is useful as it provides insights into the potential cause of memory loss, which is aging of the brain. It also contributes to awareness about the link between brain aging and cognitive decline. However, it does not provide any solutions or improvements to address this issue."
  },
  {
    "title": "Battery Performance Doubled with Dry Electrode Breakthrough",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 22:03:33 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/battery-breakthrough-scientists-double-performance-with-dry-electrodes/\" rel=\"nofollow\" title=\"Battery Breakthrough: Scientists Double Performance With Dry Electrodes\"><img alt=\"Battery Technology Charging\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"432\" s"
    ],
    "image_url": "",
    "titles": [
      "Battery Breakthrough: Scientists Double Performance With Dry Electrodes"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.81,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.424,
    "summary": "Scientists have achieved a breakthrough in battery technology by doubling performance using dry electrodes. This advancement could significantly enhance the efficiency and longevity of batteries, marking a pivotal development in energy storage solutions.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant innovation that could improve energy storage solutions. It provides useful insights into the progress being made in battery technology, contributing to the reader's understanding of this field."
  },
  {
    "title": "Breakthrough in UV Detection with Diamond-Platinum Nanowires",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 23:13:35 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/breakthrough-in-solar-blind-tech-diamond-nanowires-set-a-new-benchmark/\" rel=\"nofollow\" title=\"Breakthrough in Solar-Blind Tech: Diamond Nanowires Set a New Benchmark\"><img alt=\"Single Crystal Diamond Nanowires Embedded With Platinum Nanoparticles for High Temperatu"
    ],
    "image_url": "",
    "titles": [
      "Breakthrough in Solar-Blind Tech: Diamond Nanowires Set a New Benchmark"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.83,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "Researchers have achieved a significant breakthrough in solar-blind technology by developing diamond nanowires embedded with platinum nanoparticles. This new technology sets a new benchmark for efficiency and performance in detecting ultraviolet (UV) light without interference from visible light. The advancement promises improvements in various applications, including communications, environmental monitoring, and military uses.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a significant innovation in the field of solar-blind technology. It provides readers with an understanding of the potential applications and benefits of this breakthrough, such as improvements in communications, environmental monitoring, and military uses. This empowers readers with knowledge about advancements in this field."
  },
  {
    "title": "Korean Scientists Unveil Breakthrough in Energy Storage Technology",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 22:38:50 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/overcoming-long-held-limitations-korean-scientists-unveil-next-generation-energy-storage-technology/\" rel=\"nofollow\" title=\"Overcoming Long-Held Limitations: Korean Scientists Unveil Next-Generation Energy Storage Technology\"><img alt=\"Solar Supercapacitor Art Conce"
    ],
    "image_url": "",
    "titles": [
      "Overcoming Long-Held Limitations: Korean Scientists Unveil Next-Generation Energy Storage Technology"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.82,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Korean scientists have developed a new energy storage technology, addressing long-standing limitations in the field. This next-generation technology aims to enhance the efficiency and capacity of energy storage systems, potentially leading to significant advancements in various applications, including renewable energy sources and electric vehicles. The breakthrough was announced on SciTechDaily, highlighting its potential impact on overcoming current energy storage challenges.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant innovation in energy storage technology, providing readers with actionable insights about the potential applications and benefits of this breakthrough. It highlights progress in addressing long-standing limitations in the field, which could lead to advancements in renewable energy sources and electric vehicles. This story contributes meaningfully to the reader’s understanding of this topic."
  },
  {
    "title": "Why Danny Boyle shot ‘28 Years Later’ on iPhones",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 20:22:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Director Danny Boyle famously shot his post-apocalyptic classic “28 Days Later” on Canon digital cameras, making it easier for him to capture eerie scenes of an abandoned London, and giving the movie’s fast-moving zombies a terrifying immediacy. To make his decades-later sequel “28 Years Later” (whi"
    ],
    "image_url": "",
    "titles": [
      "Why Danny Boyle shot ‘28 Years Later’ on iPhones"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.782,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.398,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story could potentially provide insights into the use of technology in film-making. It could be useful to readers interested in film production or the creative use of everyday technology. However, without the summary, it's hard to determine if it offers solutions or innovations."
  },
  {
    "title": "The stablecoin evangelist: Katie Haun’s fight for digital dollars",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 18:43:27 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In 2018, when Bitcoin was trading around $4,000 and most Americans, at least, thought cryptocurrency was a fad, Katie Haun found herself on a debate stage in Mexico City opposite Paul Krugman, the Nobel Prize-winning economist. As Krugman focused on Bitcoin's wild price swings, Haun steered the conv"
    ],
    "image_url": "",
    "titles": [
      "The stablecoin evangelist: Katie Haun’s fight for digital dollars"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.756,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.393,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story seems to offer insights into the world of digital currencies and the role of key players in this field. It could be useful for readers interested in finance, technology, and trends in digital currencies. However, without a summary, it's hard to determine the depth of the information provided."
  },
  {
    "title": "Study Suggests Dietary Change Can Improve Sleep in 24 Hours",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 02:48:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-simple-dietary-trick-could-improve-your-sleep-in-24-hours/\" rel=\"nofollow\" title=\"This Simple Dietary Trick Could Improve Your Sleep in 24 Hours\"><img alt=\"Happy Woman Waking Up in Bed Good Sleep\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"h"
    ],
    "image_url": "",
    "titles": [
      "This Simple Dietary Trick Could Improve Your Sleep in 24 Hours"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.894,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.391,
    "summary": "A recent study highlighted by SciTechDaily suggests a dietary change could enhance sleep quality within 24 hours. The research, focusing on a simple adjustment to food intake, indicates potential for immediate improvements in sleep patterns. The specifics of the dietary modification were not detailed in the provided content.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the potential link between dietary changes and improved sleep. However, it lacks depth and actionable insights as it does not detail the specifics of the dietary modification that could lead to these improvements."
  },
  {
    "title": "WVU Student Finds Microplastics in Appalachian Stream Fish",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:00:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "When West Virginia University biology undergraduate student Isabella Tuzzio tested fish from central Appalachian streams, her research revealed microplastics in every fish she sampled."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/student-discovers-wide.jpg",
    "titles": [
      "Student discovers widespread microplastic pollution in Appalachian streams and fish"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.745,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.391,
    "summary": "Isabella Tuzzio, an undergraduate student at West Virginia University, conducted research on fish from central Appalachian streams and found microplastics in every fish she sampled. This discovery highlights the widespread issue of pollution in aquatic environments, specifically pointing to the presence of microplastics in the ecosystem affecting local wildlife.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it increases awareness about the issue of pollution, specifically the presence of microplastics in aquatic ecosystems. The research findings provide useful insights, even though the topic is negative, and can potentially inform decisions and actions related to environmental conservation."
  },
  {
    "title": "OpenAI and Jony Ive&#8217;s &#8216;io&#8217; brand has vanished, but their AI hardware deal remains",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-22T17:44:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI has scrubbed mentions of io, the hardware startup co-founded by famous Apple designer Jony Ive, from its website and social media channels. The sudden change closely follows their recent announcement of OpenAI&#8217;s nearly $6.5 billion acquisition and plans to create dedicated AI hardware. "
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Jony Ive&#8217;s &#8216;io&#8217; brand has vanished, but their AI hardware deal remains"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.805,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.39,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing business deals between OpenAI and Jony Ive's brand. However, without more context or details on the implications or progress of this deal, the story's constructiveness is limited."
  },
  {
    "title": "Scary Dreams Linked to Increased Cortisol and Health Risks",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 00:01:11 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Scary dreams disrupt our sleep and elevate our levels of the stress hormone cortisol, which may have serious consequences for our health over time"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/20160321/SEI_256228237.jpg",
    "titles": [
      "Nightmares linked to faster biological ageing and early death"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.387,
    "summary": "Scary dreams can interrupt sleep and increase cortisol, a stress hormone, potentially leading to long-term health issues.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides a useful insight into the health implications of scary dreams, increasing reader's understanding of the potential long-term health issues. However, it does not report on any solutions or attempts to solve the problem, nor does it provide a deep understanding of the systems or causes."
  },
  {
    "title": "SMB-focused Finom closes €115M as European fintech heats up",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 23 Jun 2025 07:01:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Finom, an Amsterdam-based challenger bank for SMBs that claims to have doubled its revenue in 2024, closed a €115 million Series C equity round (around $133 million)."
    ],
    "image_url": "",
    "titles": [
      "SMB-focused Finom closes €115M as European fintech heats up"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a specific event in the fintech industry, but it does not offer any actionable insights or deeper understanding. It also doesn't report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Moratorium on state AI regulation clears Senate hurdle",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 17:17:56 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A Republican effort to prevent states from enforcing their own AI regulations cleared a key procedural hurdle on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Moratorium on state AI regulation clears Senate hurdle"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.734,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.366,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a development in AI regulation, but it lacks depth or insight into its implications or context. It does not provide actionable insights or report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "LinkedIn CEO says AI writing assistant is not as popular as expected",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:06:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "While LinkedIn users seem to have embraced AI, there’s one area that’s seen less uptake than expected, according to CEO Ryan Roslansky: the AI-generated suggestions for polishing your LinkedIn posts."
    ],
    "image_url": "",
    "titles": [
      "LinkedIn CEO says AI writing assistant is not as popular as expected"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.687,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.356,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "Without a summary, it's hard to fully assess the story. However, based on the title, it seems to offer basic awareness about the performance of a specific AI tool. But it lacks depth or insight into why this is the case, what it means for LinkedIn, or what it suggests about AI tools more broadly."
  },
  {
    "title": "Weird-shaped notebooks make me want to write again",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-22T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Andru Marino is an audio and video producer at The Verge. “I make videos on our YouTube / TikTok / Instagram channels, and have produced our podcasts like Vergecast, Decoder, and Why’d You Push That Button?” He also keeps a lot of notes, and his latest favorite places to keep them are the Triangle a"
    ],
    "image_url": "",
    "titles": [
      "Weird-shaped notebooks make me want to write again"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.685,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.336,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Again, without a summary, it's difficult to fully evaluate. But based on the title, this story seems to offer basic awareness about an individual's personal experience with a product. It lacks depth or insight into why these notebooks are effective, how they might benefit others, or any broader trends in notebook design or writing habits."
  },
  {
    "title": "Last day to save on your TechCrunch All Stage pass — prices go up tonight",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It’s now or never — this is your final day to lock in savings for TechCrunch All Stage, happening July 15 in Boston. Prices increase tonight, June 22, at 11:59 p.m. PT. If you’ve been thinking about attending, now’s the time to commit. Register here. TC All Stage brings together founders, investors,"
    ],
    "image_url": "",
    "titles": [
      "Last day to save on your TechCrunch All Stage pass — prices go up tonight"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.685,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.329,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a time-sensitive offer, but it doesn't provide deeper insight, progress, or actionable knowledge beyond that. Its usefulness is limited to those specifically interested in attending the event."
  }
]