[
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The BougeRV LED lantern is marketed as an outdoor camplight but functions as a versatile work lamp suitable for various settings requiring additional lighting. It is rechargeable, compact, and features three adjustable LED panels that emit 3000 lumens, making it ideal for use in areas such as campsites, workspaces, or for vehicle maintenance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7968362995601852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4092090748900463,
    "summary": "The BougeRV LED lantern is a rechargeable, compact light designed for outdoor use, offering versatility with its three adjustable LED panels that provide 3000 lumens. It is suitable for various settings, including campsites, workspaces, and vehicle maintenance, due to its ample lighting capabilities."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) during ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4630747251851852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3257686812962963,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while legal proceedings are ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft announced in its latest Windows 11 Insider Preview that it will remove a bypass script previously allowing users to set up Windows 11 devices without an internet connection or logging into an account."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.45908166937500006,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32477041734375,
    "summary": "Microsoft has announced in its latest Windows 11 Insider Preview update that it will eliminate the bypass script that enabled users to set up Windows 11 devices without an internet connection or a Microsoft account login."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until Monday, March 31st, offering numerous deals that are accessible without an Amazon Prime membership. The sale features over 100 deals on popular gear, including budget-friendly options."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.45080620614583333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3227015515364583,
    "summary": "Amazon's Big Spring Sale, running until March 31st, includes over 100 deals on popular items, available to all shoppers without requiring an Amazon Prime membership. The sale emphasizes budget-friendly options."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X, previously known as Twitter, in an all-stock deal. Musk, who bought Twitter a few years ago for $44 billion, announced the transaction values xAI at $80 billion and X at $33 billion, which includes $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.44484555774305556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3212113894357639,
    "summary": "Elon Musk's AI firm, xAI, has bought the social media platform X (formerly Twitter) in an all-stock transaction. Musk, who previously acquired Twitter for $44 billion, values xAI at $80 billion and X at $33 billion, with the latter carrying $12 billion in debt."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature aims to enable IT professionals to remotely recover devices that won't boot, a response to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.43746129825231483,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31936532456307876,
    "summary": "Microsoft has introduced a new feature, Quick Machine Recovery, in its latest Windows Insider Preview build (6120.3653) for Windows 11. This tool is designed to help IT professionals remotely recover devices that are unable to boot, aiming to prevent situations like the Crowdstrike incident from last year."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, following its acquisition of Fitbit in early 2021. Initially, users were required to make the switch by 2025. This update was communicated to Fitbit users via email."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4213501868981482,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31533754672453707,
    "summary": "Google has postponed the deadline for Fitbit users to transfer their accounts to Google accounts to next year. This decision comes after Google acquired Fitbit in early 2021. Initially, the migration was mandatory by 2025. Fitbit users were informed of this extension through an email."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer ties with the Trump administration following obstacles in international discussions. Initially backed by Nauru, TMC's endeavors in 2021 accelerated efforts to establish mining regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.41091037185185186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31272759296296293,
    "summary": "The Metals Company (TMC), focused on starting deep-sea mining, sought to strengthen its relationship with the Trump administration after facing challenges in global talks. Supported by Nauru, TMC's activities in 2021 pushed for the creation of mining regulations."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the onset of warmer months. This sale event, running until March 31, 2025, offers significant discounts on a variety of products, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4018710197685186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31046775494212964,
    "summary": "Amazon has started its Big Spring Sale, offering discounts on products like gardening supplies and bedding. The sale is set to run until March 31, 2025, aligning with the start of the spring season."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are co-writing a thriller novel with elements similar to \"Squid Game,\" as reported by Deadline. The untitled book, which involves players surviving deadly tests, has attracted eight-figure bids for its publishing rights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.39158166767361113,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30789541691840283,
    "summary": "MrBeast and James Patterson are collaborating on a thriller novel, inspired by \"Squid Game,\" featuring players in lethal challenges. The yet-to-be-titled book has received publishing bids over ten million dollars, according to Deadline."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers are currently engaged in efforts to save individuals trapped in the debris of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescuers are actively working to save people trapped under the rubble of a tower that fell on Friday."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 10:42:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire broke out in a city, resulting in 21 people being injured. The incident affected a restaurant and several buildings, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire erupted in a city, injuring 21 individuals. The blaze impacted a restaurant and multiple buildings, as reported by local authorities."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 10:58:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other senior officials, describing it as showing a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards a visit by the US Vice President and senior officials, labeling it as a display of \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with the Canadian leader as \"extremely productive.\" He announced plans for a future meeting post-Canada's upcoming elections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US President described recent talks with the Canadian leader as highly effective and announced intentions for a follow-up meeting after Canada's forthcoming elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, detailing the emotional turmoil they face due to the disappearance of their loved ones."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have expressed their emotional distress to the BBC, regarding the disappearance of their loved ones."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki faced criticism for wearing a disguise to promote his own book on a television program."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki, received backlash for disguising himself to promote his book on a TV show."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed alleging that a controversial influencer assaulted and threatened an individual in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a well-known influencer of assault and making threats against someone in Beverly Hills. The influencer has refuted these claims."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from celebrities such as Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy apologized after receiving criticism from several celebrities, including Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the presence of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were present."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests occurring in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Top US vaccine official forced to resign, reports say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 03:05:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Peter Marks resigned, citing in his resignation letter that his new boss, Robert F Kennedy Jr, supports \"misinformation and lies.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Peter Marks resigned from his position, stating in his resignation letter that he could not work under Robert F Kennedy Jr, whom he accused of endorsing \"misinformation and lies.\""
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah location, following the launch of two rockets from southern Lebanon towards northern Israel. This action occurred within hours of the initial rocket fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel carried out a strike on a Hezbollah site in response to two rockets fired from southern Lebanon into northern Israel. This retaliation happened hours after the initial rocket launch."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is perceived as an effort to question the validity of the current leadership in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event is seen as an attempt to challenge the legitimacy of the existing government in Kyiv."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescuers, including one in Mandalay, digging through rubble by hand to aid in the response efforts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage. In response, rescue teams, including individuals in Mandalay, are manually searching through debris to help those affected."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 07:19:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A large earthquake struck central Myanmar, resulting in significant destruction across the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing widespread damage in the region."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York, establishing a new record for the highest price achieved by the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions while evacuating a military base in South Sudan, despite being attacked."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew successfully evacuated a military base in South Sudan under attack, receiving praise for their actions."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further rises, according to a car seller interviewed by the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have significantly increased, with further rises anticipated, as reported by a car seller to the BBC."
  },
  {
    "title": "Anxious wait for news of missing after Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday due to a powerful earthquake originating from neighboring Myanmar. Dozens of people are reported missing following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to a powerful earthquake from neighboring Myanmar. Dozens are reported missing after the collapse."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Shwe Sar Yan Pagoda, located south-east of Mandalay in Myanmar, experienced a collapse at its top due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Shwe Sar Yan Pagoda, situated southeast of Mandalay in Myanmar, suffered a collapse at its peak following an earthquake."
  },
  {
    "title": "Is Sudan’s war merging with South Sudanese conflicts?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:50:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sudan's conflict is extending into South Sudan, with the Sudanese army and the Rapid Support Forces (RSF) looking for new allies and proxy groups in the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The conflict in Sudan is spreading into South Sudan as the Sudanese army and the Rapid Support Forces (RSF) seek new allies and proxy groups in the neighboring region."
  },
  {
    "title": "Gaza people surviving on canned food as fresh produce ‘rotting’ at border",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:47:27 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The UN relief chief has reported that food supplies are decaying at the Gaza border due to an ongoing blockade by Israel, which commenced on March 18. This action is being criticized for violating humanitarian law."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The UN relief chief announced that food supplies are spoiling at the Gaza border because of a blockade by Israel that started on March 18. This blockade is facing criticism for breaching humanitarian law."
  },
  {
    "title": "Nepal appoint former Australian international Law as new coach",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 08:49:20 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former coach of the West Indies, Sri Lanka, and Bangladesh cricket teams has successfully led the United States cricket team into the Super 8s of the 2024 T20 World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former coach, who previously led the West Indies, Sri Lanka, and Bangladesh cricket teams, has guided the United States cricket team to the Super 8s stage of the 2024 T20 World Cup."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a growth factor cocktail that successfully reversed fatal cell damage in mice exposed to anthrax. This finding suggests the potential for adapting this treatment for use in humans affected by the disease."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a treatment that reversed deadly cell damage in mice caused by anthrax exposure. This breakthrough indicates the possibility of developing a similar therapy for humans suffering from the disease."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created an advanced AI model that improves predictions on chemotherapy responses in muscle-invasive bladder cancer patients. This model uniquely combines whole-slide tumor imaging data with gene expression analyses, achieving better accuracy than former models based on a single data type."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers developed an AI model that enhances the accuracy of predicting chemotherapy outcomes for muscle-invasive bladder cancer patients. This model integrates whole-slide tumor images with gene expression data, outperforming previous models that relied on only one type of data."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a direct link between dopamine levels and cognitive flexibility, finding that increased dopamine production in the brain enhances task efficiency. This breakthrough, identified through PET imaging during challenging cognitive tasks, may lead to improved treatments for neurological and psychiatric disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have found that higher dopamine levels in the brain improve cognitive flexibility, making tasks more efficient. This discovery, made using PET imaging during complex cognitive tasks, could enhance treatments for neurological and psychiatric conditions."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of Toxoplasma gondii, a parasite. This insight could help understand how to control latency in other nervous system infections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can detect and control the dormant phase of the parasite Toxoplasma gondii. This discovery may aid in understanding how to manage latency in various nervous system infections."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing nearly 270,000 seed plant species globally has identified environmental conditions and dispersal barriers as key factors influencing plant distribution and diversity. The research examines how these patterns have evolved over millions of years, explaining why certain plants thrive in specific regions but not in others."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species has revealed that environmental conditions and dispersal barriers significantly impact plant distribution and diversity. The research highlights how these factors have shaped plant patterns over millions of years, leading to the prevalence of certain plants in specific areas while absent in others."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:15:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A well-executed inbounds play led No. 1 Houston to a 62-60 victory over Purdue, securing their place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston defeated Purdue 62-60, advancing to the Elite Eight after a successful inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and grabbed 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts led UCLA to a 76-62 win over Ole Miss with a performance of 31 points and 10 rebounds. This victory takes UCLA into the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:13:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off homer on Friday, marking an emotional highlight early in the season after he lost nearly 20 pounds due to an illness."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, an emotional moment for the player who had lost nearly 20 pounds because of an illness earlier in the season."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and grabbed 19 rebounds, leading LSU to an 80-73 victory over NC State, securing their third consecutive Elite Eight appearance in the tournament. This performance was crucial as teammate Flau'Jae Johnson faced difficulties during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow led LSU to an 80-73 win over NC State with 30 points and 19 rebounds, ensuring the team's third straight Elite Eight appearance in the tournament. Her performance was key as teammate Flau'Jae Johnson struggled in the game."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb criticized the online bullying directed at Mississippi State's Chandler Prater, defending her over accusations related to JuJu Watkins' ACL injury. Gottlieb stated she does not view the incident as a result of a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater against online bullying, following accusations related to JuJu Watkins' ACL injury. Gottlieb stated she does not believe the incident was due to a dirty play."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' comment suggesting Antetokounmpo could score 250 points in a 1970s game, stating that comparing different basketball eras is not feasible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo addressed LeBron James' remark that he could score 250 points in a 1970s basketball game, stating that comparing players across different eras is impractical."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu won the women's figure skating world championship, becoming the first American to do so since 2006 by defeating three-time defending champion Kaori Sakamoto."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu became the first American to win the women's figure skating world championship since 2006, defeating three-time defending champion Kaori Sakamoto."
  },
  {
    "title": "UCLA lands MWC Player of Year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season for New Mexico, has decided to transfer to UCLA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season at New Mexico, is transferring to UCLA."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:41:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has advanced to the Sweet 16 stage, with the first four games underway. This phase of the tournament showcases the top 16 teams competing for a spot in the next round."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA basketball tournament has progressed to the Sweet 16, featuring the top 16 teams. These teams are currently competing in the first four games of this round to secure their places in the subsequent phase of the tournament."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 02:00:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston secured victories in their respective games. The event offered detailed analysis of both teams' performances, providing insights into the strategies and key moments that led to their wins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston both won their respective games. The event provided an analysis of each team's performance, highlighting the strategies and key moments that contributed to their victories."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, prompting a shift in focus towards future team development. The team will concentrate on identifying key transfer portal targets and integrating new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded, leading the team to prioritize future development. Efforts will be directed at scouting potential transfers and incorporating new recruits to strengthen the squad for the upcoming season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This rapid conversion involved extensive preparations and adjustments to accommodate a major league game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly transformed into the Tampa Bay Rays' ballpark for Opening Day within four days. This swift changeover required significant preparations and modifications to host a major league baseball game."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are underway regarding whether there has been a shift in how soccer is played or officiated, focusing on whether players are engaging in cleaner play or if referees have become less inclined to use their whistles during games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Discussions are taking place among soccer players, executives, and analysts about potential changes in the sport's play style or refereeing, specifically questioning if there has been an increase in cleaner play by players or a decrease in referees' tendency to call fouls."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on team rankings. The voting results, along with the schedule for each team up to April 17, have been released, providing insight into the standings as the postseason approaches."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's outlook has been clarified following the release of team rankings, determined by a panel's votes. Alongside these rankings, the schedule for each team leading up to April 17 has been made available, offering a detailed view of the standings and the path to the postseason."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A snowboarder, who had previously battled depression, is now aiming to qualify for the 2026 Olympics. Her renewed sense of joy is evident as she prepares for the World Championship event on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, overcoming past struggles with depression, is now training for the 2026 Olympics. She is currently preparing for the World Championship event this Saturday, showing a renewed sense of joy in her pursuit."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, Fulham's left back, has had an exceptional season, establishing himself as one of the top players in his position globally. He is also aspiring to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, the left back for Fulham, has had an outstanding season, earning recognition as one of the world's leading players in his position. He aims to achieve notable successes with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the United Football League (UFL) are competing to surpass Birmingham, the current leading team in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Helen Hu, who had retired from gymnastics and was working at a hostel in Ecuador a year ago, won the SEC beam title this past weekend."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, a former gymnast who had retired and was working at a hostel in Ecuador last year, achieved a significant comeback by winning the SEC beam title this past weekend."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat by Argentina on Tuesday, as announced on Friday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson. A jury awarded the sum following Gleeson's legal action."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, by a jury."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna appealed to the Spanish football federation (RFEF), arguing that Barcelona improperly played defender Iñigo Martínez in their LaLiga match due to a technicality related to his absence from Spain's games due to injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has lodged an appeal with the Spanish football federation (RFEF), claiming Barcelona fielded defender Iñigo Martínez in a LaLiga match against them in violation of rules, citing a technicality about his non-participation in Spain's recent matches due to injury."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 draw with the Houston Dash on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, is set to be evaluated for a left knee injury she got during a 0-0 draw against the Houston Dash last Friday."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo have appealed to FIFA, requesting the organization to reconsider its decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have formally appealed to FIFA, asking the international football governing body to reevaluate its decision to disqualify the Mexican team from participating in the Club World Cup."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian soccer federation due to a severe knee injury sustained by Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation following a significant knee injury to player Alphonso Davies."
  }
]