[
  {
    "title": "Trump Proposes Peace Plan for Israel-Gaza Conflict, Awaits Hamas Response",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 12:15:29 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Ahead of the leaders' meeting on Monday, the White House released its peace plan to immediately end Israel's war in the territory, boost aid to Gaza and require Hamas to release Israeli hostages.",
      "US President Donald Trump has outlined a plan to end Israel’s war on Gaza.",
      "President says Israel has &#039;full backing&#039; of US to take steps to defeat Hamas if it doesn&#039;t accept proposed peace deal.",
      "Hamas has not agreed with the 20-point peace plan, which President Donald Trump discussed during remarks at the White House."
    ],
    "image_url": "",
    "titles": [
      "Trump announces an agreement with Israel to end war in Gaza",
      "Trump outlines plan to end Israel’s war on Gaza",
      "Trump says ‘beyond very close’ to ending war in Gaza",
      "Watch: Trump details plan to end Israel war with Hamas in Gaza"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House, under President Trump, proposed a peace plan to end the conflict between Israel and Gaza, including immediate ceasefire, increased aid for Gaza, and the release of Israeli hostages by Hamas. Despite Trump's assurance of full US support for Israel should Hamas reject the proposal, the plan, detailed in a 20-point document, has yet to receive acceptance from Hamas as of the leaders' meeting on Monday.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:34:36 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Post",
      "The Guardian",
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "Frank founder sold student aid start-up to the US bank for $175mn in 2021 but lied about its user base",
      "<p>Javice was convicted for defrauding JPMorgan Chase into buying her college financial aid startup Frank for $175m</p><p>Charlie Javice, the entrepreneur convicted for defrauding <a href=\"https://www.theguardian.com/business/jpmorgan\">JPMorgan</a> Chase into buying her college financial aid startup",
      "NEW YORK (AP) &#8212; Charlie Javice, the founder of a startup company that sought to dramatically improve how students apply for financial aid, was sentenced Monday to more than seven years in prison for cheating JPMorgan Chase out of $175 million by greatly exaggerating how many students it served"
    ],
    "image_url": "",
    "titles": [
      "Startup founder Charlie Javice reportedly sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Charlie Javice sentenced to 7 years in prison for JPMorgan fraud",
      "Entrepreneur Charlie Javice sentenced to over seven years for defrauding JPMorgan",
      "Charlie Javice sentenced to 7 years in prison for fraudulent $175M sale of financial aid startup"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.967,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Charlie Javice, founder of the financial aid platform Frank, was sentenced to over seven years in prison for defrauding JPMorgan Chase. Convicted of exaggerating her startup's user base, she misled the bank into purchasing Frank for $175 million in 2021.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 19:20:43 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Phone and internet connections are down nationwide after the Taliban cut fibre-optic connections to prevent \"immorality\".",
      "On orders from the ruling Taliban, Afghanistan's telecommunications authorities have capped fiber optic internet access. It is unclear how long telephone and cellular networks will be affected, or to what degree.",
      "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide ",
      "The shutdown came two weeks after the ruling Taliban cut off the internet in half a dozen provinces, saying they wanted to prevent “immoral acts.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0203/live/f08a4b00-9d68-11f0-a16f-ff7724a733bf.jpg",
    "titles": [
      "Afghanistan telecom blackout as Taliban shuts off internet",
      "Afghanistan: Taliban shuts down internet indefinitely",
      "Afghanistan hit by communications blackout after Taliban shuts internet",
      "Afghanistan Has Nationwide Internet Blackout, Monitors Say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.962,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Sonnet 4.5 AI, Masters Coding with Business Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "The Verge",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Claude Sonnet 4.5 is better at coding, using computers and meeting practical business needs.",
      "The startup says Claude Sonnet 4.5 is the world's best model for AI coding tasks, and a leap forward in applied artificial intelligence.",
      "Anthropic's latest AI model spent 30 hours running by itself to code a chat app akin to Slack or Teams. It spat out about 11,000 lines of code, according to Anthropic, and it only stopped running when it had completed the task. The model, Claude Sonnet 4.5, was announced today, and its ability to op",
      "Anthropic says its new AI model is robust enough to build production-ready applications, rather than just prototypes."
    ],
    "image_url": "",
    "titles": [
      "Anthropic launches Claude Sonnet 4.5, its latest AI model that's 'more of a colleague'",
      "Anthropic unveils latest AI model, aiming to extend its lead in coding intelligence",
      "Anthropic releases Claude Sonnet 4.5 in latest bid for AI agents and coding supremacy",
      "Anthropic launches Claude Sonnet 4.5, its best AI model for coding"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.916,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic introduced Claude Sonnet 4.5, an AI model they claim is the best for coding tasks, emphasizing its practical business applications. It autonomously coded a chat app similar to Slack or Teams, producing 11,000 lines of code in 30 hours. The company highlights the model's capability to create production-ready applications, marking a significant advancement in applied artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New York Giants Co-Owner John Mara Diagnosed with Cancer at 70",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 15:47:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Giants co-owner John Mara announced Monday that he recently was diagnosed with cancer and is following the treatment plan recommended by his doctors.",
      "Mara, 70, has been with the Giants since 1991",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE93eFN6Vk04Y3hSOXZxbjhNa0IwaGlUN0ZGR2NPbENpLWtvcVNyS0d0U1JIV2hrMEYwSWwxYzVaaVczQ29OWFcwNkxJUG1sOWNYWGI2UmdaWmNqZEp4S3dCNnNFTDVQTFZRc0hKSk5mbmIxTnVDbDlzUllmYXM?oc=5\" target=\"_blank\">Giants Owner John Mara Announces Cancer Diagnosis</a>&nbsp;&"
    ],
    "image_url": "",
    "titles": [
      "Giants co-owner Mara being treated for cancer",
      "Giants president, co-owner John Mara announces cancer diagnosis, says he's 'feeling strong and optimistic'",
      "Giants Owner John Mara Announces Cancer Diagnosis - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "John Mara, the co-owner of the New York Giants, announced on Monday that he has been diagnosed with cancer. At 70 years old, Mara, who has been with the Giants since 1991, is following a treatment plan recommended by his doctors.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Probes Church Attack; Trump Proposes Gaza Peace Plan",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 07:11:39 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "The FBI is searching for answers as to why a man drove his truck into a church yesterday and opened fire. And, Trump has a new proposed plan to end the war in Gaza.",
      "Donald Trump's proposed plan to end the war in Gaza will be discussed with Israeli Prime Minister Benjamin Netanyahu on Monday. So what exactly is in the 21-point plan?",
      "The White House released Trump's \"Comprehensive Plan to End the Gaza Conflict.\""
    ],
    "image_url": "",
    "titles": [
      "The latest on the Michigan church shooting. And, Trump's new plan to end war in Gaza",
      "What is Donald Trump's 21-point plan to end Gaza war?",
      "Trump admin live updates: White House releases Trump's plan to end the war in Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.829,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is investigating an incident where a man drove his truck into a church and began shooting. Meanwhile, Donald Trump has proposed a 21-point plan aimed at ending the war in Gaza, which he will discuss with Israeli Prime Minister Benjamin Netanyahu on Monday. The specifics of the plan are yet to be detailed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Labels Bishnoi Gang as Terrorist, Seizes Assets",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:17:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "CityNews",
      "Al Jazeera"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The move will enable asset seizures and prosecutions of Bishnoi gang that has been accused of targeting Sikh activists.",
      "Canada has listed the Bishnoi gang as a terrorist entity, following calls from Conservative and NDP politicians. The listing bars Canadians from financing or aiding the group led by Lawrence Bishnoi, the gang&#8217;s leader in India, who has reportedly coordinated criminal activities from a cellphon",
      "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimida"
    ],
    "image_url": "",
    "titles": [
      "Canada labels India’s Bishnoi gang as ‘terrorist’ organisation",
      "Canada lists the Bishnoi gang as a terrorist entity",
      "Canada designates Indian gang linked to high-profile killings as terrorist entity"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada has officially designated the India-based Bishnoi gang as a terrorist entity, led by Lawrence Bishnoi. This action enables Canadian authorities to seize property and freeze accounts associated with the gang. The decision follows advocacy from Conservative and NDP politicians, aiming to prevent Canadians from financially supporting or assisting the group's criminal activities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Owner Apologizes for Playoff Miss After Season Slump",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 16:30:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Mets went from the best record in baseball on June 12 to missing the playoffs",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9XODZJZWRyS2pfdklmX096d1kwbGZCVnBxbEZ5VmVKWXl5ejlKUmtMM2UteHJoQmM0MXFqcVNVcDZlUDNZMk1oWS1kS2NPUHpMLUxNQkVoMUVndzdjVENteTFhQ3prdnlUOWc?oc=5\" target=\"_blank\">Mets Owner Steve Cohen Posts Apology to Fans After New York Misses Playoffs</a>&nbsp",
      "<p>Despite holding MLB&#8217;s best record at one point, the New York Mets slumped down the stretch and missed the post-season entirely. Now, owner Steve Cohen is issuing an apology to fans.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/29/4394f27b-21c4-48d9-bc99-ad6850f9d290/cohen-getty.png",
    "titles": [
      "Mets owner Steve Cohen apologizes to fans after brutal collapse: 'The result was unacceptable'",
      "Mets Owner Steve Cohen Posts Apology to Fans After New York Misses Playoffs - Sports Illustrated",
      "Mets owner Steve Cohen apologizes to fans after late-season collapse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.926,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Mets, after having the best record in baseball on June 12, experienced a significant slump and missed the playoffs. Mets owner Steve Cohen has issued an apology to fans for the team's disappointing performance and failure to reach the post-season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India Wins Asia Cup T20 Final; Refuses Trophy from Pakistan Minister",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:18:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "From tournament format to venues and top players to watch, here&#039;s Al Jazeera&#039;s guide to the Women&#039;s Cricket World Cup.",
      "India won the Asia Cup Twenty20 final by five wickets in Dubai on Sunday, but refused to collect the championship trophy from Pakistan's interior minister.",
      "Months after a military conflict, a cricket tournament brought the Indian team three victories over its fiercest rival but few signs of an easing in bitterness."
    ],
    "image_url": "",
    "titles": [
      "ICC Women’s World Cup 2025: Teams, schedule, tickets, India vs Pakistan",
      "Asia Cup 2025: India, Pakistan cricket teams spar",
      "India-Pakistan Tensions Lead to Trophy-Less Cricket Final at Asia Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.903,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "India won the Asia Cup Twenty20 final against Pakistan by five wickets in Dubai. The Indian team controversially refused to collect the championship trophy from Pakistan's interior minister, citing political tensions. This incident occurred after the Indian leader referred to the victory as an extension of 'Operation Sindoor'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Bualoi Kills 13 in Vietnam, Leaves 2M Without Power",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 12:01:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Thousands of residents were still being evacuated as Typhoon Bualoi made landfall sooner than forecast.",
      "Typhoon Bualoi has hit Vietnam's coast earlier than expected, causing death and extensive destruction. Residents have been warned of flash floods and landslides.",
      "At least 13 people were killed and dozens more injured in central Vietnam, where 2 million were without power. Bualoi’s deadly path had started with 10 deaths in the Philippines."
    ],
    "image_url": "",
    "titles": [
      "Video: Several dead as Typhoon Bualoi displaces thousands in Vietnam",
      "Typhoon Bualoi lashes Vietnam, killing at least 13",
      "Typhoon Bualoi Slams Into Central Vietnam, Adding to Death Toll"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Typhoon Bualoi hit Vietnam's coast earlier than predicted, causing significant destruction and at least 13 deaths in central Vietnam, with dozens injured. The storm, which previously resulted in 10 deaths in the Philippines, left 2 million people without power in Vietnam. Authorities are evacuating thousands and warning of flash floods and landslides.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lewis Hamilton Announces Death of Beloved Bulldog Roscoe After Treatment",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 13:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawa.citynews.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Lewis Hamilton has announced the death of his \"beloved\" pet dog Roscoe.",
      "<p>Lewis Hamilton says his bulldog Roscoe, a fixture in the Formula 1 paddock, has died following days of medical treatment and that putting him to sleep was “one of the most painful experiences” of the seven-time F1 champion&#8217;s life.</p>",
      "Lewis Hamilton says his bulldog Roscoe, a fixture in the Formula 1 paddock, has died following days of medical treatment and that putting him to sleep was “one of the most painful experiences” of the seven-time F1 champion&#8217;s life. Hamilton missed a tire testing day last week as he cared for Ro"
    ],
    "image_url": "https://e1.365dm.com/25/09/1920x1080/skysports-lewis-hamilton-roscoe_7032324.jpg?20250926145749",
    "titles": [
      "Hamilton mourns death of 'beloved' dog Roscoe",
      "Lewis Hamilton says death of his dog Roscoe ‘one of the most painful experiences’",
      "Lewis Hamilton says the death of his dog Roscoe is ‘one of the most painful experiences’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lewis Hamilton announced the death of his bulldog Roscoe, a well-known figure in the Formula 1 paddock, after days of medical treatment. Describing the decision to euthanize Roscoe as one of his most painful experiences, Hamilton had previously missed a tire testing day to care for him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Back Plan to End Gaza War; US to Boost Coal Output",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T19:31:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US President Donald Trump said that many Arab nations support his plan to end the nearly two-year-long war in Gaza. He and Israeli Prime Minister Benjamin Netanyahu called on Hamas to accept the plan. Follow DW for more.",
      "<p>Netanyahu says he supports Trump’s Gaza peace plan but Hamas still must agree to proposal</p><p><strong>Trump officials to announce plan to boost coal output</strong></p><p>The US is set to announce on Monday policies <strong>to try to boost the output of coal</strong>, the interior department sa",
      "<p>Netanyahu says he supports Trump’s Gaza peace plan but Hamas still must agree to proposal</p><p><strong>Trump officials to announce plan to boost coal output</strong></p><p>The US is set to announce on Monday policies <strong>to try to boost the output of coal</strong>, the interior department sa"
    ],
    "image_url": "",
    "titles": [
      "Middle East: Trump, Netanyahu call for Hamas to accept plan",
      "Trump demands Hamas accept US plan to ‘end Gaza conflict’ as Netanyahu says Israel will ‘finish the job’ if they don’t",
      "Trump demands Hamas accept US plan to ‘end Gaza conflict’ as Netanyahu says Israel will ‘finish the job’ if they don’t – live"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have endorsed a plan aimed at ending the nearly two-year-long war in Gaza, with Trump stating that many Arab nations also support the initiative. However, for the plan to proceed, Hamas must agree to it. Additionally, the US plans to announce policies to increase coal output.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: initiative, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Unveils 21-Point Plan Against Hamas with Israel's Support",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:46:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump&#039;s 21-point plan is said to have Netanyahu on board, but Hamas says it&#039;s not received any proposal yet.",
      "Mr. Trump, speaking alongside Prime Minister Benjamin Netanyahu, said Israel would have his “full backing” to eliminate the threat of Hamas if the militant group does not agree to its terms. Hamas said it was not consulted on the proposal."
    ],
    "image_url": "",
    "titles": [
      "What is the Trump plan for Gaza and will it work?",
      "Live Updates: Trump Releases Cease-Fire Plan for Gaza and Say Hamas Must Accept It"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump announced a 21-point plan to address the threat of Hamas, with Israeli Prime Minister Benjamin Netanyahu's support. Trump stated Israel would have his \"full backing\" to act against Hamas if they reject the proposal. However, Hamas claims they have not been consulted about the plan.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "San Francisco Giants Fire Bob Melvin After .500 Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 15:47:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The San Francisco Giants have fired three-time manager of the year Bob Melvin after the Giants finished 81-81 this season.",
      "The offseason carousel starts with an opening in San Francisco. Here's who is out -- and who could be in line to replace them.",
      "The Giants were 161-163 under Melvin across two seasons"
    ],
    "image_url": "",
    "titles": [
      "SF Giants fire manager Melvin after two seasons",
      "Tracking MLB offseason manager changes: Giants fire Bob Melvin after two seasons",
      "Giants fire manager Bob Melvin: San Francisco wants 'change in leadership' after third-place NL West finish"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The San Francisco Giants dismissed Bob Melvin, their three-time Manager of the Year, following a season where the team ended with an 81-81 record. During his two-year tenure with the Giants, Melvin's record was 161-163. This move marks the beginning of the offseason changes for the team, opening up speculation on his potential replacement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Malik Nabers Suffers Season-Ending ACL Tear",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 15:47:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "An MRI on Monday confirmed that Giants standout wide receiver Malik Nabers has suffered a season-ending torn ACL.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBWX1BmajhXQVpYWVNWRmlYVFlvaFZraGxUUld3eFRRTjV5MXpIZHUxcG9SZ2oycDI5R0paRDFYNFhVbndxOHlISVRXWFRvNHBEcmhMM1VQdGhQUVVlLUd1MVRsT0lhUmU3SXo2aGw3em9pNVJFWEpv?oc=5\" target=\"_blank\">Malik Nabers Injury Update: Giants Star Out for Season With Torn AC",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPallUYlNoT3lGU3doWEY4c1F2V01NOUJ4VzZPaFFjYUlPYV83X0lhU2VDT2k0R3NGT19FY2gxZVh0dDlweFNhVktIVlF3NHpkVlJlV0RlTENLNTNGbVBITVZ0WEQyaTNSWVNlNGJXdExVVS1LcVdwRlJsUTdtQS1UbUFTZEJ6N0EwdkZKWTFB?oc=5\" target=\"_blank\">Malik Nabers Shares Sad Instagram P"
    ],
    "image_url": "",
    "titles": [
      "Giants star Nabers out for season with torn ACL",
      "Malik Nabers Injury Update: Giants Star Out for Season With Torn ACL - Sports Illustrated",
      "Malik Nabers Shares Sad Instagram Post After Season-Ending ACL Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An MRI on Monday confirmed that Malik Nabers, the Giants' standout wide receiver, has suffered a torn ACL, ending his season. This was reported across multiple news sources, including a personal update from Nabers on Instagram, expressing his disappointment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kevin Durant Plans to Sign Contract Extension with Houston Rockets",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 15:47:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Kevin Durant said he envisions himself signing a contract extension with the Rockets.",
      "Kevin Durant is only signed through this season, but anticipates getting a deal done to stay in Houston"
    ],
    "image_url": "",
    "titles": [
      "Durant envisions signing extension with Rockets",
      "Kevin Durant plans to sign contract extension with Rockets, sees himself in Houston long-term"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NBA player Kevin Durant expressed his intention to sign a contract extension with the Houston Rockets. Currently signed through this season, Durant is looking to secure a deal to remain with the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 15:55:06 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Leavitt said there's \"nothing to negotiate\" with congressional leadership.",
      "Top Congressional leaders are at the White House on Monday to meet with President Donald Trump in a last-ditch effort to avert a government shutdown.",
      "President Donald Trump and congressional leaders from both parties are set to meet at 3 p.m. for 11th hour talks."
    ],
    "image_url": "https://s.abcnews.com/images/US/hakeem-jeffries-1-gty-gmh-250929_1759159180053_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump holding high-stakes meeting with top Democrats as government shutdown looms",
      "WATCH:  Trump to meet with top Democrats as shutdown looms",
      "Democrats refuse to cave on health care before meeting with Trump on government shutdown"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Nation Covers Week 4 Insights; US Loses Ryder Cup to Europe",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 11:39:07 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "bearswire.usatoday.com"
    ],
    "snippets": [
      "Our NFL Nation reporters react to all the action, answering the biggest questions coming out of each game. Here's what we learned from Week 4.",
      "The Chicago Bears won a close game against the Raiders, 25-24. Here's a look at the PFF grades following their Week 4 win:"
    ],
    "image_url": "",
    "titles": [
      "Best, worst of Week 4: Chiefs win big over Ravens, Packers tie Cowboys",
      "Bears PFF grades: Best, worst players from Week 4 win vs. Raiders"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NFL Nation reporters provided insights on Week 4 games, addressing key questions from each matchup. Additionally, the United States lost the Ryder Cup to Europe, despite a strong comeback attempt.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova's Pro-European Party Wins Majority, Eyes Closer EU Ties",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 05:41:54 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "Moldova's pro-Western governing party won a clear parliamentary majority, defeating pro-Russian groups in an election that was widely viewed as a stark choice between East and West.",
      "The results brought a sigh of relief for the European Union, as Moldova showed firm public support for the ruling party’s pro-Europe course."
    ],
    "image_url": "",
    "titles": [
      "Moldova's pro-EU party wins clear parliamentary majority, defeating pro-Russian groups",
      "In defeat for Russia, pro-E.U. party wins Moldovan parliamentary majority"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.804,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldova's pro-European governing party won a parliamentary majority in a critical election, defeating pro-Russian factions. The victory is seen as a pivotal moment for Moldova's future direction, with the country expressing strong support for closer ties with the European Union. President Maia Sandu hailed the outcome as crucial for Moldova's EU path. The election, marking a significant choice between aligning with Europe or Russia, concluded with over 50% of votes for the pro-European party. The defeated pro-Russian party has called for protests against the results.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Missing Teen Found Dead in Singer D4vd’s Car Trunk",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 19:24:51 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Celeste Rivas Hernandez, first reported missing at age 13, found decomposing in trunk of singer’s car in Los Angeles</p><p>The missing teenager whose body was discovered decomposing in singer D4vd’s Tesla in early September likely died several weeks earlier, according to the Los Angeles police de",
      "The Los Angeles Police Department found a decomposing body in a vehicle, which multiple outlets reported is registered under singer D4vd’s name, David Anthony Burke."
    ],
    "image_url": "https://i.guim.co.uk/img/media/daaada1056309fea34147e0d6840baf4b0659ad6/0_236_1206_963/master/1206.jpg?width=140&quality=85&auto=format&fit=max&s=b314ea431204cdcfece4d4b3b6063a35",
    "titles": [
      "Body of missing teen found in D4vd’s Tesla likely ‘dead for several weeks,’ says police",
      "Body Found In Singer D4vd’s Car Was Likely Dead For Weeks, Police Say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Celeste Rivas Hernandez, reported missing at age 13, was found deceased in the trunk of a car registered to singer D4vd, real name David Anthony Burke, in Los Angeles. The discovery was made in September, and Los Angeles police suggest she likely died weeks prior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Seeks Western Missiles to Prompt Moscow Peace Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:25:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Vance's comments come as Ukraine's deputy defence minister tells the BBC Western weapons could force Moscow to start peace talks.",
      "Tomahawk cruise missiles, which have a range of at least 1,500 miles, would boost Ukraine’s ability to hit deep inside Russia, including Moscow."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1108/live/f4cd3df0-9d3e-11f0-973f-51ea2fc41b54.jpg",
    "titles": [
      "Trump considering supplying Ukraine with long-range missiles, Vance says",
      "U.S. considers Ukraine’s request for long-range Tomahawk missiles"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.887,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukraine's deputy defense minister stated to the BBC that Western weapons, including Tomahawk cruise missiles with a range of at least 1,500 miles, could compel Moscow to initiate peace talks. These missiles would enhance Ukraine's capability to strike targets deep within Russia, including Moscow.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "James Webb Telescope Discovers Moon-Forming Disk Around Exoplanet",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 29 Sep 2025 13:43:04 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "science.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "The NASA/ESA/CSA James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha B, which is located 625 light years away from Earth, ",
      "NASA’s James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha b, which is located 625 light-years away from Earth, is a possi"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/webb-studies-moon-form.jpg",
    "titles": [
      "Moon-forming disk around massive planet offers insight into how the moons of gas giants might have formed",
      "NASA’s Webb Telescope Studies Moon-Forming Disk Around Massive Planet"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The James Webb Space Telescope has made the first direct measurements of a moon-forming disk around the exoplanet CT Cha B, located 625 light-years from Earth. This carbon-rich disk could potentially lead to the formation of moons, marking a significant discovery in the study of celestial bodies outside our solar system.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EA Acquired by PIF, Silver Lake, and Affinity for $55 Billion",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:40:35 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Electronic Arts said it has agreed to be acquired by PIF, Silver Lake and Affinity Partners in an all-cash deal worth $55 billion.",
      "Investors will receive $210 per share, well above the stock's all-time high."
    ],
    "image_url": "",
    "titles": [
      "EA going private in $55 billion deal that will pay shareholders $210 a share",
      "It’s official: EA is selling to private equity in $55 billion deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Electronic Arts announced its acquisition by PIF, Silver Lake, and Affinity Partners in a deal valued at $55 billion. Investors are set to receive $210 per share in cash, surpassing the stock's historical peak.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Adds Parental Controls to ChatGPT, Aiming to Curb Harmful Content",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-29T10:26:39-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "OpenAI has rolled out some long-awaited parental controls for ChatGPT to all web users, with mobile coming “soon,” according to the company.&#160; The controls, announced last month, allow for reducing or removing certain content — like sexual roleplay and the ability to generate images — and reduci",
      "The new safety features come after numerous incidents of ChatGPT validating users' delusional thinking instead of redirecting harmful conversations -- including the death of a teenage boy by suicide."
    ],
    "image_url": "",
    "titles": [
      "OpenAI’s ChatGPT parental controls are rolling out — here’s what you should know",
      "OpenAI rolls out safety routing system, parental controls on ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.887,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI introduced new parental controls for ChatGPT on the web, with mobile updates expected soon. These controls aim to limit or eliminate content such as sexual roleplay and image generation. This update follows incidents where ChatGPT was criticized for not adequately handling harmful conversations, including a case linked to a teenager's suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EA Undergoes Largest Leveraged Buyout with Saudi Backing, Kushner Involvement",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 14:06:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "EA is known for making best-selling games such as EA FC, The Sims and Mass Effect.",
      "Saudi-backed transaction orchestrated by Jared Kushner and Silver Lake is biggest-ever leveraged buyout"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/41bd/live/ab75e000-9d32-11f0-82af-53ec555e619b.png",
    "titles": [
      "Gaming giant Electronic Arts bought in unprecedented $55bn deal",
      "Video games maker Electronic Arts strikes $55bn deal to go private"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Electronic Arts (EA), creator of best-selling games like EA FC, The Sims, and Mass Effect, is involved in the largest-ever leveraged buyout. This transaction is backed by Saudi investors and was orchestrated by Jared Kushner and Silver Lake.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny Skips US in World Tour, Set for Super Bowl Halftime Show",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 03:42:50 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWTA4MnZGLTNwMVViRVhST3dHWG5xQmJ6UFVpTklSbFBxSy1rMGctY1Nlb2pIdGpRSnpyTld1SEhLUVFPNlR4NFBEWlhzNExvRUh2TDRCNkhNanhOWTdEc1R0bUVNWDdsNWdZM2I1aWFzMFZENUVZMlJMVlFkRl9tbE92VQ?oc=5\" target=\"_blank\">Bad Bunny to headline Super Bowl halftime show in",
      "Bad Bunny is officially the 2026 Super Bowl halftime show headliner. Here are other musicians who deserve a shot, too."
    ],
    "image_url": "",
    "titles": [
      "Bad Bunny to headline Super Bowl halftime show in 2026 - Axios",
      "22 musicians we'd love to see perform the Super Bowl halftime show"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.695,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bad Bunny, a Puerto Rican pop star known for criticizing the Trump administration's immigration policies, has chosen to exclude the U.S. from his upcoming world tour due to concerns over ICE raids. Despite this, he is set to headline the Super Bowl halftime show.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Volunteer Apps Close Tonight; Baiju Bhatt to Speak",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "If you’ve been thinking about applying to volunteer at TechCrunch Disrupt 2025, this is it — applications close tonight at 11:59 p.m. PT. Only accepting local Bay Area applicants.",
      "Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, shares insights on building transformative companies in fintech and aerospace at TechCrunch Disrupt 2025."
    ],
    "image_url": "",
    "titles": [
      "Final day to apply: Volunteer at TechCrunch Disrupt 2025",
      "From Robinhood to Aetherflux: Baiju Bhatt’s next frontier at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.897,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Applications for volunteering at TechCrunch Disrupt 2025 close tonight at 11:59 p.m. PT, and only local Bay Area applicants are eligible. In related news, Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, will speak at the event, sharing insights on creating transformative companies in fintech and aerospace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]