[
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern is marketed as an outdoor camplight but functions as a versatile work lamp suitable for various settings needing additional light. It is rechargeable, compact, and features three swiveling LED panels that emit 3000 lumens, making it ideal for use at campsites, workspaces, or for mechanical work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9384292819444444,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44460732048611107,
    "summary": "BougeRV's LED lantern, designed for outdoor camping, also serves as a multi-purpose work lamp. It is rechargeable, compact, and has three adjustable LED panels that provide 3000 lumens of light, making it suitable for campsites, workspaces, and mechanical tasks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction to prevent the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) during ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6046677075231481,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.361166926880787,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction blocking the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while legal proceedings are ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has announced that in the latest Windows 11 Insider Preview, it will remove a bypass script that previously allowed users to set up Windows 11 devices without an internet connection and logging in. This change enforces the requirement for all Windows 11 devices to be connected to the internet and logged into an account during setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6006746516898147,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36016866292245364,
    "summary": "Microsoft will update Windows 11 Insider Preview to eliminate a script that enabled offline setup, mandating internet connection and account login for device setup."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until March 31st, offering a wide range of deals accessible without an Amazon Prime membership. The sale features over 100 discounts on popular products, alongside a selection of affordable alternatives for budget-conscious shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5923991884837962,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3580997971209491,
    "summary": "Amazon is hosting its Big Spring Sale until March 31st, providing over 100 discounts on various products. The sale is open to all shoppers, not just Amazon Prime members, and includes deals on popular items as well as budget-friendly options."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X (previously Twitter) in an all-stock deal. Musk, who bought Twitter a few years ago for $44 billion, values xAI at $80 billion and X at $33 billion, which includes $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5864385400810186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35660963502025467,
    "summary": "Elon Musk's AI company, xAI, has purchased the social media platform X (formerly known as Twitter) through an all-stock transaction. Musk, who previously acquired Twitter for $44 billion, now values xAI at $80 billion and X at $33 billion, with this figure encompassing $12 billion in debt."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing a new feature called Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11 devices. This feature aims to enable IT professionals to remotely recover devices that won't boot, a response to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5790542805902779,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35476357014756943,
    "summary": "Microsoft is testing Quick Machine Recovery in Windows 11's latest Insider Preview build (6120.3653), designed to help IT professionals remotely fix devices that won't boot. This development aims to mitigate issues like last year's Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google, which acquired Fitbit in early 2021, has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year, as announced in an email to users. This is a change from the original requirement to move accounts by 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5629431692361111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35073579230902774,
    "summary": "Google has postponed the deadline for Fitbit users to transfer their accounts to Google accounts to next year, revising the initial 2025 deadline. This update was communicated to users via email."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer ties with the Trump administration following challenges in international negotiations. Initially sponsored by Nauru, TMC's efforts in 2021 accelerated the creation of regulatory frameworks for deep-sea mining."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5525033541782407,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34812583854456014,
    "summary": "The Metals Company (TMC), focused on starting deep-sea mining, sought to strengthen its relationship with the Trump administration due to difficulties in global discussions. Sponsored by Nauru, TMC's actions in 2021 expedited the development of regulations for deep-sea mining."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its first major sale event of 2025, named the Big Spring Sale, which is currently underway and will continue until Monday, March 31st. The sale offers significant discounts on a variety of items, including gardening supplies and bedding, to mark the transition into the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5434640020833332,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34586600052083327,
    "summary": "Amazon's Big Spring Sale, its first major sale event of 2025, is happening now through Monday, March 31st. The sale features significant discounts on items such as gardening supplies and bedding, celebrating the arrival of warmer months."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are co-writing a thriller novel with elements similar to Squid Game, as reported by Deadline. The untitled book, which involves players surviving deadly tests, has received bids in the eight-figure range for its publishing rights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5331746500000001,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34329366250000004,
    "summary": "MrBeast and James Patterson are collaborating on a thriller novel, inspired by Squid Game, featuring players in lethal challenges. The yet-to-be-titled book's publishing rights have attracted eight-figure bids, according to Deadline."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building collapsed in Bangkok, Thailand, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears that workers might be trapped within the debris."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 06:03:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has resulted in 21 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and several other buildings, local officials reported."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:08:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other top officials, describing it as a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister criticized the visit of the US Vice President and other senior officials, calling it a \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled discussions with Canada as \"extremely productive.\" He announced plans for a future meeting with Canadian leaders following the upcoming elections in Canada."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent discussions with Canada as highly effective and announced intentions for a meeting with Canadian leaders after Canada's forthcoming elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their distress with the BBC, expressing deep anguish over their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have expressed their distress to the BBC, sharing their deep anguish over the disappearances of their loved ones."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki, received criticism for wearing a disguise on TV several years ago to promote his own book."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise during a TV appearance years ago to promote his book."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from several high-profile actors, including Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy has apologized after receiving criticism from notable actors such as Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey after reporting on mass protests occurring in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey following their coverage of widespread protests in the nation."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon towards northern Israel. The events unfolded hours apart."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah site in response to two rockets fired from southern Lebanon towards northern Israel. The incidents occurred hours apart."
  },
  {
    "title": "Dua Lipa wins copyright case over Levitating",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:31:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A pop star faced accusations of copying the 1979 disco song \"Wiggle and Giggle All Night,\" suggesting potential plagiarism concerns."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A pop star has been accused of plagiarizing the 1979 disco track \"Wiggle and Giggle All Night,\" raising concerns over copyright infringement."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is viewed as an effort to question the legitimacy of the existing government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent action has been interpreted as an attempt to challenge the legitimacy of the current government in Kyiv."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:14:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans is planning protests calling for the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans has announced plans to protest, demanding the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, leading to rescue efforts in Mandalay where individuals, including one rescuer reported using bare hands, are digging through rubble to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, causing significant damage. Rescue operations are underway in Mandalay, with efforts including individuals using their bare hands to search for survivors in the rubble."
  },
  {
    "title": "A rediscovered painting that just made Indian art history",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by artist MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the sale of the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation at a military base in South Sudan. Despite coming under fire, the crew successfully carried out their mission."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for successfully completing an evacuation mission at a military base in South Sudan, despite being under attack."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices for cars have significantly increased, with expectations of further rises, according to a car seller interviewed by the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, with further increases expected, as reported by a car seller to the BBC."
  },
  {
    "title": "Chappell Roan: 'There's a new path for girls breaking the rules'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 09:10:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Giver singer discussed her lack of fear in her career, crediting inspiration from artists Charli XCX and Sabrina Carpenter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Giver singer expressed confidence in her career, attributing her fearlessness to being inspired by artists Charli XCX and Sabrina Carpenter."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Shwe Sar Yan Pagoda, located south-east of Mandalay in Myanmar, experienced a collapse at its top due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Shwe Sar Yan Pagoda, situated southeast of Mandalay in Myanmar, suffered a collapse at its top following an earthquake."
  },
  {
    "title": "Bridge collapses into river in Mandalay, Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:49:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7-magnitude earthquake hit central Myanmar, causing significant damage to the Ava Bridge near Mandalay, as shown in video footage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7-magnitude earthquake struck central Myanmar, significantly damaging the Ava Bridge near Mandalay, according to video evidence."
  },
  {
    "title": "Four policemen, two suspected rebels killed in India-administered Kashmir",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 07:04:17 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several individuals died during a gunfight that occurred in a forested area of the southern Jammu region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several individuals were killed in a gunfight in a forested area of the southern Jammu region."
  },
  {
    "title": "US wants to make Philippines “a proxy” in US-China confrontation",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 05:52:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Victor Gao accused Pete Hegseth of attempting to incite a conflict between China and the US by involving the Philippines."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Victor Gao has accused Pete Hegseth of trying to spark a conflict between China and the United States by dragging the Philippines into the situation."
  },
  {
    "title": "Four Afghan girl guitarists escaped the Taliban. Will they be forced back?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 04:42:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four Afghan girls, Yasemin, Zakia, Shukriya, and Uzra, all aged 7, fled Afghanistan and are now facing the risk of deportation due to a Trump-era order and policies in Pakistan."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four Afghan girls, aged 7, named Yasemin, Zakia, Shukriya, and Uzra, fled Afghanistan and are now at risk of deportation due to a Trump-era order and policies in Pakistan."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a growth factor cocktail that reversed severe cell damage in mice infected with anthrax, indicating potential for future medical application in humans."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a cocktail of growth factors that successfully reversed severe cell damage in mice infected with anthrax. This breakthrough suggests the possibility of future treatments for humans."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created an advanced AI and machine learning model that improves the prediction of chemotherapy outcomes for muscle-invasive bladder cancer patients. This new model combines whole-slide tumor imaging with gene expression analysis, offering more accurate predictions than earlier models based on a single data type."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new AI and machine learning model that enhances the accuracy of predicting chemotherapy outcomes for muscle-invasive bladder cancer patients. This model uniquely integrates whole-slide tumor imaging with gene expression analysis, outperforming previous models that relied on only one type of data."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a link between dopamine levels and cognitive flexibility, revealing that the brain produces more dopamine during challenging tasks, which enhances task efficiency. This finding, observed through PET imaging, could lead to improved treatments for neurological and psychiatric disorders by allowing for more targeted therapy strategies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have found that the brain increases dopamine production during difficult tasks, improving task performance. This discovery, made using PET imaging, could help develop better treatments for neurological and psychiatric disorders by enabling more precise therapy approaches."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of Toxoplasma gondii, a parasite. This insight could help understand how to control latency in other nervous system infections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can detect and control the dormant stage of Toxoplasma gondii, a parasite. This discovery could aid in understanding how to manage latency in various nervous system infections."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing nearly 270,000 seed plant species globally found that environmental conditions and dispersal barriers significantly influence plant diversity and distribution. This research sheds light on why certain plants thrive in specific regions while others do not, by examining how these patterns have evolved over millions of years."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species has revealed that environmental conditions and dispersal barriers play a crucial role in determining plant diversity and distribution. This research helps explain the reasons behind the thriving of certain plants in specific areas, based on evolutionary patterns over millions of years."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:27:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A well-executed inbounds play led No. 1 Houston to a 62-60 victory against Purdue, securing their place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston defeated Purdue 62-60, advancing to the Elite Eight after a successful inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss. This win propels UCLA into the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts led UCLA to a 76-62 victory against Ole Miss, scoring 31 points and grabbing 10 rebounds. This win takes UCLA to the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:26:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off homer on Friday, marking an emotional highlight in a season that began with challenges, including an illness that led him to lose nearly 20 pounds."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off home run on Friday, providing a high point in a season that started with difficulties for him, including an illness that caused him to lose nearly 20 pounds."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and secured 19 rebounds, leading LSU to an 80-73 victory over NC State, marking LSU's third consecutive Elite Eight appearance in the tournament. This performance was crucial as teammate Flau'Jae Johnson faced difficulties during the game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow led LSU to an 80-73 win over NC State with 30 points and 19 rebounds, securing their third straight Elite Eight spot in the tournament. This was pivotal as teammate Flau'Jae Johnson struggled during the game."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb spoke out against the online bullying targeting Mississippi State's Chandler Prater, defending her by stating that JuJu Watkins' ACL injury was not caused by a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater against online bullying, stating that JuJu Watkins' ACL injury was not the result of a dirty play by Prater."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' comment suggesting Antetokounmpo could score 250 points in a 1970s game, stating that comparing different basketball eras is not feasible."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo addressed LeBron James' remark that he could score 250 points in a 1970s basketball game, stating it's not possible to compare different basketball eras accurately."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu won the women's figure skating world championship, becoming the first American to do so since 2006. She ended Kaori Sakamoto's three-year reign as champion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu became the first American to win the women's figure skating world championship since 2006, ending Kaori Sakamoto's three-year championship streak."
  },
  {
    "title": "UCLA lands MWC player of year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season for New Mexico, has decided to transfer to UCLA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard who achieved an average of 20.4 points and 6.5 assists per game this season with New Mexico, is transferring to UCLA."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:41:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament's Sweet 16 commenced with its first four games. This phase of the tournament features the top 16 teams competing to advance to the next round. The outcomes of these games are crucial as they determine which teams move closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament's Sweet 16 round started with the first four games, involving the top 16 teams. These matches are key in deciding which teams will advance towards the championship."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 02:00:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston both secured victories in their respective games. The events of the night were covered with in-depth analysis of both teams' performances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston each won their respective games. The victories were followed by detailed analysis of both teams' performances."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, leading to a focus on future team development. The team is now concentrating on acquiring new talent through the transfer portal and welcoming incoming recruits, aiming to strengthen the Wolfpack for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's season has concluded, and the team is now emphasizing future development by seeking new talent via the transfer portal and integrating incoming recruits. This strategy aims to bolster the Wolfpack for the upcoming season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in only four days. This rapid conversion showcases the flexibility and adaptability of sports facilities to accommodate major league games, ensuring the Rays had a venue for their season opener."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' Opening Day ballpark in just four days. This change highlights the ability of sports facilities to adapt and provide a venue for major league games, ensuring the Rays had a place for their season opener."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "There's an ongoing debate about whether players in the sport are playing more cleanly or if referees are less inclined to call fouls. This discussion involves players, executives, and analysts sharing various perspectives on the matter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The debate on whether the perceived reduction in fouls in the sport is due to players competing more cleanly or referees being more reluctant to call fouls is ongoing. This discussion includes input from players, executives, and analysts, each offering different viewpoints on the issue."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming more defined as a panel has cast their votes, evaluating each team's performance up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field has been clarified after a panel evaluated team performances up until April 17, casting their votes to define the contenders."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance during a game against Travis Hunter, showcasing his potential for the NFL."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford football player from Medicine Hat, Alberta, set a record in a game against Travis Hunter, highlighting his NFL prospects."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The snowboarder, after facing challenges with depression, has regained her enthusiasm and is now aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, who previously struggled with depression, is now focused on qualifying for the 2026 Olympics. Her next opportunity to advance towards this goal is at the World Championships on Saturday."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson, Fulham's left back, has had an exceptional season, establishing himself as one of the world's top players in his position. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, the left back for Fulham, has had an outstanding season, earning recognition as one of the top players globally in his position. He aims to achieve major successes with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Every team in the UFL aims to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are competing to surpass Birmingham, the current top team in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A year ago, Helen Hu, a former gymnast, was working at a hostel in Ecuador. Recently, she achieved a significant comeback by winning the SEC beam title in gymnastics."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, once a gymnast turned hostel worker in Ecuador, made a remarkable return to gymnastics by winning the SEC beam title recently, a year after her career seemed to have taken a different path."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:38:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday the dismissal of head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) has fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:38:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Richard H. Edelson, the team doctor for Portland Timbers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won a $20 million medical malpractice lawsuit against Richard H. Edelson, the team doctor for Portland Timbers, for mishandling his treatment."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:38:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna appealed to the Spanish football federation (RFEF) on Friday, claiming Barcelona improperly played defender Iñigo Martínez in their LaLiga match due to a technicality related to his absence from Spain's games due to injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has filed an appeal with the Spanish football federation (RFEF), alleging that Barcelona fielded defender Iñigo Martínez in a LaLiga match in violation of regulations. The claim centers on a technicality concerning Martínez's participation following an injury that kept him out of Spain's national team games."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:38:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 draw with the Houston Dash on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will have her left knee evaluated after being injured in a 0-0 draw against the Houston Dash on Friday."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:38:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo have appealed to FIFA to reconsider the decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have requested FIFA to reevaluate its decision to disqualify the Mexican team from the Club World Cup."
  }
]