[
  {
    "title": "Single $80M Lotto Max winning ticket sold in Surrey, B.C.",
    "domain": "general",
    "location": "national",
    "published": "Sat, 10 May 2025 15:57:12 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The BC Lottery Corporation says a single ticket, sold in Surrey, matched seven out of seven winning numbers in Friday's Lotto Max draw."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2023/05/lotto-max-file-e1684941645290.jpg?quality=85&strip=all",
    "titles": [
      "Single $80M Lotto Max winning ticket sold in Surrey, B.C."
    ],
    "summary": "A single ticket sold in Surrey won the Lotto Max draw on Friday by matching all seven winning numbers, as announced by the BC Lottery Corporation.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a lottery event but does not offer any actionable insights, deeper understanding, or information about solutions or improvements. It doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.525,
    "normalized_score": 0.13
  },
  {
    "title": "India and Pakistan Announce Cease-Fire After Days of Escalating Fighting",
    "domain": "general",
    "location": "global",
    "published": "Sat, 10 May 2025 15:57:11 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "President Trump also announced the cease-fire, saying it had been mediated by the United States, although only Pakistan quickly acknowledged an American role."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/10/multimedia/10int-india-pakistan-leadall-wcpm/10int-india-pakistan-leadall-wcpm-mediumSquareAt3X.jpg",
    "titles": [
      "India and Pakistan Announce Cease-Fire After Days of Escalating Fighting"
    ],
    "summary": "President Trump announced a cease-fire that the United States mediated. However, only Pakistan has acknowledged the U.S.'s role in this agreement.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story informs about a significant event and provides context about the role of the U.S. in mediating the cease-fire. However, it doesn't provide a deeper understanding of the underlying causes of the conflict or potential long-term solutions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 5.39
  },
  {
    "title": "Judge orders limit in Mount Polley tailings dam deposits amid court challenge",
    "domain": "general",
    "location": "national",
    "published": "Sat, 10 May 2025 15:55:15 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The Supreme Court in British Columbia has ordered that the Mount Polley mine limit the tailings it can deposit into its storage facility while a First Nation challenges an addition to the dam in court."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/3ee1034d8e64f8bce36be09c3a99ee8360ad41cf53c56869a366ccbcd7616959_3dc58b.jpg?quality=85&strip=all",
    "titles": [
      "Judge orders limit in Mount Polley tailings dam deposits amid court challenge"
    ],
    "summary": "The British Columbia Supreme Court has mandated the Mount Polley mine to restrict the amount of tailings it deposits into its storage facility. This order comes as a response to a legal challenge by a First Nation against a proposed addition to the dam.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a legal decision that impacts environmental protection. It highlights an attempt to solve a problem related to industrial waste management. However, it could provide more information about the broader implications and potential solutions to this issue.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 7.76
  },
  {
    "title": "Southampton v Manchester City, Fulham v Everton, and more: football – live",
    "domain": "general",
    "location": "global",
    "published": "Sat, 10 May 2025 15:51:45 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>Follow goal and news updates from around the grounds</li><li><a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://www.theguardian.com/football/tables\">Tables</a> | <a href=\"https://www.theguardian.com/football/2025/jan/14/premier-league-top-scorers-2024-25-who-is-leading-race-for-golden-boot\">Golden Boot race</a> | And <a href=\"mailto:barry.glendenning@theguardian.com\">mail Barry</a></li></ul><p><strong>League One playoff:</strong> Stockport County have gone ahead at Brisbane Road, with Norwood turning provider to tee up Fraser Horsfall for a back post header from close range that gives the visitors the advantage.</p><p><strong>League One playoff:</strong> Leyton Orient took the lead against Stockport County in their semi-final first leg courtesy of a strike from a preposterously offside Charlie Kelman that was allowed to stand, but the visitors have just equalised after Oliver Norwood scored from the spot. There’s about 30 minutes to play at Brisbane Road. Wycombe Wanderers and Charlton Athletic will contest the first leg of their semi-final at Adams Park tomorrow.</p> <a href=\"https://www.theguardian.com/football/live/2025/may/10/southampton-v-manchester-city-fulham-v-everton-football-live-clockwatch\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/23a29c23f31ef0a95454c73d1dfb10737da091aa/1258_717_3893_3115/master/3893.jpg?width=140&quality=85&auto=format&fit=max&s=894bd329278eb0743a6aa62d44ee9c47",
    "titles": [
      "Southampton v Manchester City, Fulham v Everton, and more: football – live"
    ],
    "summary": "In the League One playoff semi-final first leg at Brisbane Road, Leyton Orient initially took the lead against Stockport County with a goal from Charlie Kelman, despite controversy over its offside position. Stockport County later equalized with a penalty by Oliver Norwood. Fraser Horsfall then scored for Stockport, giving them the lead. There are about 30 minutes left in the match. The other semi-final between Wycombe Wanderers and Charlton Athletic is scheduled for tomorrow at Adams Park.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the ongoing football matches and their current status. However, it doesn't offer any deeper insights, actionable information, or context for the reader to understand the significance of the events.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.525,
    "normalized_score": 0.13
  },
  {
    "title": "Giro d’Italia: Josh Tarling edges out Roglic for time-trial victory in Tirana",
    "domain": "general",
    "location": "global",
    "published": "Sat, 10 May 2025 15:50:31 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>21-year-old Welshman wins by 1sec for Ineos Grenadiers</li><li>Second is enough for Primoz Roglic to take overall lead</li></ul><p>Josh Tarling of Ineos Grenadiers set a time-trial pace even the race favourite, Primoz Roglic, could not match to win stage two of the Giro d’Italia by one second in Albania.</p><p>Tarling had a nervous wait before his first Grand Tour stage victory was confirmed as the 21-year-old Welshman watched Roglic come so close, but the Slovene had to settle for second place with the consolation of taking over the leader’s pink jersey for Red Bull–Bora–Hansgrohe.</p><p><em>Full report to follow</em></p> <a href=\"https://www.theguardian.com/sport/2025/may/10/giro-ditalia-josh-tarling-primoz-roglic-time-trial-victory-cycling\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f78631c103a7413d3005d25b59e09f5dc63f1223/430_0_4056_3244/master/4056.jpg?width=140&quality=85&auto=format&fit=max&s=ff2fde72fec050cf1ccc6c0cec505a91",
    "titles": [
      "Giro d’Italia: Josh Tarling edges out Roglic for time-trial victory in Tirana"
    ],
    "summary": "21-year-old Josh Tarling of Ineos Grenadiers won stage two of the Giro d'Italia in Albania by one second, marking his first Grand Tour stage victory. Despite finishing second in the time-trial, Primoz Roglic of Red Bull–Bora–Hansgrohe took the overall lead and donned the leader's pink jersey.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the results of the Giro d'Italia stage two. It offers a little more depth by mentioning the overall lead and the leader's pink jersey. However, it still lacks actionable insights or a broader context about the implications of these results.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.545,
    "normalized_score": 2.76
  },
  {
    "title": "Saints quarterback Carr announces retirement due to shoulder injury",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 10 May 2025 16:38:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "New Orleans Saints quarterback Derek Carr is retiring from the NFL after 11 seasons due to a right shoulder injury."
    ],
    "image_url": "https://e2.365dm.com/24/09/1920x1080/skysports-derek-carr-new-orleans-saints_6689790.jpg?20240918222051",
    "titles": [
      "Saints quarterback Carr announces retirement due to shoulder injury"
    ],
    "summary": "Derek Carr, the quarterback for the New Orleans Saints, has announced his retirement from the NFL after an 11-season career. His decision to retire is due to a right shoulder injury.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about Derek Carr's retirement decision due to a shoulder injury. It provides useful information for fans and followers of the New Orleans Saints and NFL. However, it doesn't delve into the implications of his retirement for the team or the league, nor does it discuss potential replacements or the team's future strategy.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 1.008,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.546,
    "normalized_score": 2.89
  },
  {
    "title": "Hollie Doyle becomes most successful female jockey in British history",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 10 May 2025 16:32:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Hollie Doyle enjoyed another landmark victory when claiming the outright record for most winners by a female rider in Britain by striking on Brindavan at Ascot."
    ],
    "image_url": "https://e1.365dm.com/25/02/1920x1080/skysports-hollie-doyle-racing_6817925.jpg?20250202184705",
    "titles": [
      "Hollie Doyle becomes most successful female jockey in British history"
    ],
    "summary": "Hollie Doyle set a new record for the most wins by a female jockey in Britain, achieving this milestone with her victory on Brindavan at Ascot. This landmark win marks a significant achievement in her career and in the history of British horse racing.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights an achievement and progress in the field of horse racing, particularly for female jockeys. It provides useful information about Hollie Doyle's career and could inspire readers, especially women interested in the sport.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.006,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.567,
    "normalized_score": 5.66
  },
  {
    "title": "Swiatek drops out of world's top two after early defeat in Rome",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 10 May 2025 16:06:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Iga Swiatek will drop outside the world's top two for the first time in three years after defeat by Danielle Collins in the third round of the Italian Open."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-swiatek-tennis_6912062.jpg?20250510162547",
    "titles": [
      "Swiatek drops out of world's top two after early defeat in Rome"
    ],
    "summary": "Iga Swiatek will fall out of the top two in the world rankings for the first time in three years following her loss to Danielle Collins in the third round of the Italian Open.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story is negative in nature, it provides useful information about the current state of tennis rankings and the performance of Iga Swiatek. It doesn't offer solutions or improvements, but it does give readers a deeper understanding of the competitive nature of professional tennis.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.0,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.536,
    "normalized_score": 1.58
  },
  {
    "title": "Tarling wins Giro stage 2 by a second over new overall leader Roglic",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 10 May 2025 15:46:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "British cyclist Joshua Tarling beat pre-race favorite Primoz Roglic by a solitary second in an individual time trial to win the second stage of the Giro d’Italia on Saturday.  Roglic moved into the pink jersey, albeit only just.  Tarling, who rides for Ineos Grenadiers, finished the 14-kilometer (8.5-mile) route through the Albanian capital of Tirana in 16 minutes, seven seconds."
    ],
    "image_url": "",
    "titles": [
      "Tarling wins Giro stage 2 by a second over new overall leader Roglic"
    ],
    "summary": "British cyclist Joshua Tarling won the second stage of the Giro d'Italia on Saturday, edging out pre-race favorite Primoz Roglic by one second in an individual time trial. Despite the close win, Roglic took the overall lead and donned the pink jersey. Tarling, who competes for Ineos Grenadiers, completed the 14-kilometer route in Tirana, Albania, in 16 minutes and seven seconds.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about the Giro d'Italia race and the performance of Joshua Tarling and Primoz Roglic. It provides insights into the competitive dynamics of the race and informs readers about the current standings. However, it doesn't highlight any significant solutions, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.554,
    "normalized_score": 3.95
  },
  {
    "title": "Hull KR tame Dragons and book Wembley date in push to end 40-year drought",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 10 May 2025 15:46:36 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Hull KR beat Catalans Dragons 36-12 to reach the Challenge Cup final, increasing hope of their first silverware for 40 years"
    ],
    "image_url": "",
    "titles": [
      "Hull KR tame Dragons and book Wembley date in push to end 40-year drought"
    ],
    "summary": "Hull KR secured a spot in the Challenge Cup final by defeating Catalans Dragons 36-12, marking a significant victory as they pursue their first piece of silverware in 40 years. This win brings them closer to ending their long wait for a major trophy.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Hull KR's victory and their progress towards a major trophy. However, it lacks depth or insight into the strategies used in the game, the implications of the victory, or the broader context of the sport.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.524,
    "normalized_score": 0.0
  },
  {
    "title": "Why Pope Leo chose his name: AI, workers’ rights, new Industrial Revolution",
    "domain": "business",
    "location": "national",
    "published": "Sat, 10 May 2025 15:25:11 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Pope Leo also suggested that he would follow the late Pope Francis' lead on his commitment to social justice."
    ],
    "image_url": "",
    "titles": [
      "Why Pope Leo chose his name: AI, workers’ rights, new Industrial Revolution"
    ],
    "summary": "Pope Leo has indicated his intention to continue the commitment to social justice of his predecessor, the late Pope Francis. This suggests a continuity in the Vatican's approach to addressing issues of social equity and care for the marginalized.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some context about Pope Leo's intentions and the continuity in the Vatican's approach to social justice issues. However, it does not provide actionable insights or concrete details about how these issues will be addressed.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.991,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.561,
    "normalized_score": 4.87
  },
  {
    "title": "The case for owning stocks at every age, plus what the Street means by 'risk off'",
    "domain": "business",
    "location": "national",
    "published": "Sat, 10 May 2025 15:00:11 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "This week we answer two questions about navigating this challenging this market."
    ],
    "image_url": "",
    "titles": [
      "The case for owning stocks at every age, plus what the Street means by 'risk off'"
    ],
    "summary": "This week's news focuses on providing guidance for navigating the current challenging market. Two main questions are addressed to offer insights and strategies for individuals seeking to understand and adapt to the market's conditions. The outcome is a set of recommendations aimed at helping readers make informed decisions in a complex economic environment.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive, as it provides actionable insights and strategies for navigating the stock market, which can empower readers to make informed decisions. It also provides clarity about market conditions and trends.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.581,
    "normalized_score": 7.5
  },
  {
    "title": "Bitcoin back above $100,000: Financial planning icon Ric Edelman reacts to the crypto ETF boom",
    "domain": "business",
    "location": "national",
    "published": "Sat, 10 May 2025 15:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Bitcoin’s milestone week comes as new crypto exchange-traded funds are hitting the market."
    ],
    "image_url": "",
    "titles": [
      "Bitcoin back above $100,000: Financial planning icon Ric Edelman reacts to the crypto ETF boom"
    ],
    "summary": "Bitcoin experienced a significant week coinciding with the launch of new cryptocurrency exchange-traded funds (ETFs). These developments mark a notable moment in the digital currency's market presence, illustrating its ongoing integration into mainstream financial products.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful insights into the latest developments in the cryptocurrency market, especially the integration of Bitcoin into mainstream financial products. However, it lacks details about the implications of these developments or potential solutions to challenges in the crypto market.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.561,
    "normalized_score": 4.87
  },
  {
    "title": "India and Pakistan agree to immediate ceasefire",
    "domain": "business",
    "location": "national",
    "published": "Sat, 10 May 2025 14:36:41 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "President Donald Trump said the two nations reached the ceasefire after \"a long night of talks mediated by the United States.\""
    ],
    "image_url": "",
    "titles": [
      "India and Pakistan agree to immediate ceasefire"
    ],
    "summary": "President Donald Trump announced that a ceasefire was reached between two nations following extensive negotiations mediated by the United States. The agreement came after a prolonged period of discussions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on a significant progress in the resolution of conflicts between India and Pakistan, which is a solution-oriented development. It also provides useful information that can help readers understand the dynamics of international relations. However, it could provide more context about the causes and impacts of the conflict.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.98,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.58,
    "normalized_score": 7.37
  },
  {
    "title": "Trump’s trip to Saudi Arabia raises the prospect of US nuclear cooperation with the kingdom",
    "domain": "business",
    "location": "global",
    "published": "Sat, 10 May 2025 14:31:55 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "This coming week, Republican President Donald Trump will make his first trip to Saudi Arabia of his second term."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25129802277465-e1746887034402.jpg?w=2048",
    "titles": [
      "Trump’s trip to Saudi Arabia raises the prospect of US nuclear cooperation with the kingdom"
    ],
    "summary": "Republican President Donald Trump is set to visit Saudi Arabia for the first time during his second term in the upcoming week. This marks a significant diplomatic endeavor as part of his current presidency.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a significant diplomatic endeavor, which could potentially lead to nuclear cooperation between the US and Saudi Arabia. However, it lacks depth in terms of the implications of this potential cooperation, as well as the systems and trends in international nuclear politics.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.979,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.565,
    "normalized_score": 5.39
  },
  {
    "title": "Alzheimer’s Risk May Begin Before 30, New Study Warns",
    "domain": "science",
    "location": "global",
    "published": "Sat, 10 May 2025 15:37:51 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/alzheimers-risk-may-begin-before-30-new-study-warns/\" rel=\"nofollow\" title=\"Alzheimer’s Risk May Begin Before 30, New Study Warns\"><img alt=\"Brain Connections Network Concept Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Brain-Connections-Network-Concept-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Cognitive function was found to be associated with established risk factors and biomarkers as early as age 24. A new study led by researchers at Columbia University’s Mailman School of Public Health and the Columbia Butler Aging Center reveals that risk factors and biological markers linked to Alzheimer’s disease may influence cognitive function much earlier [...]"
    ],
    "image_url": "",
    "titles": [
      "Alzheimer’s Risk May Begin Before 30, New Study Warns"
    ],
    "summary": "A study by Columbia University's Mailman School of Public Health and the Columbia Butler Aging Center has found that risk factors and biological markers for Alzheimer's disease can affect cognitive function starting as early as age 24. This research suggests that the roots of Alzheimer's risk may begin much earlier in life than previously thought.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the early onset of Alzheimer's risk, which can help readers understand the disease better and potentially take early preventive measures. However, it does not report on any solutions or improvements to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 6.58
  },
  {
    "title": "Scientists Discover Hidden Cause of Alzheimer’s Hiding in Plain Sight",
    "domain": "science",
    "location": "global",
    "published": "Sat, 10 May 2025 15:12:50 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-hidden-cause-of-alzheimers-hiding-in-plain-sight/\" rel=\"nofollow\" title=\"Scientists Discover Hidden Cause of Alzheimer’s Hiding in Plain Sight\"><img alt=\"Dementia Mental Health Brain Explosion Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Dementia-Mental-Health-Brain-Explosion-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers found the PHGDH gene directly causes Alzheimer’s and discovered a drug-like molecule, NCT-503, that may help treat the disease early by targeting the gene’s hidden function. A recent study has revealed that a gene previously identified as a biomarker for Alzheimer’s disease is not just a marker, it is a direct cause of the [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Hidden Cause of Alzheimer’s Hiding in Plain Sight"
    ],
    "summary": "Researchers have identified the PHGDH gene as a direct cause of Alzheimer's disease, not just a biomarker as previously thought. They also discovered a drug-like molecule, NCT-503, which targets the gene's hidden function and may offer a new treatment option for the disease at an early stage.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it not only provides a deeper understanding of Alzheimer's disease by identifying a direct cause, but also reports on a potential new treatment option. This can empower readers with knowledge and hope for a solution.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.988,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.6,
    "normalized_score": 10.0
  },
  {
    "title": "A beginner's guide to vegan fashion (and how to spot 'greenwashing')",
    "domain": "science",
    "location": "global",
    "published": "Sat, 10 May 2025 11:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "\"Vegan\" and \"plant-based\" are not just food labels anymore; they are fashion's latest buzzwords. Imagine walking into a high-street fashion store, drawn to a stylish bomber jacket labeled \"100% vegan.\" You flip the tag, looking for material details, only to find none. Nearby, a luxury handbag proudly announces it's made from vegan leather. A closer look reveals it's 56% recycled polyester and 44% polyurethane—basically plastic."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/vegan-leather.jpg",
    "titles": [
      "A beginner's guide to vegan fashion (and how to spot 'greenwashing')"
    ],
    "summary": "Fashion brands are increasingly labeling products as \"vegan\" or \"plant-based,\" extending beyond food to items like jackets and luxury handbags. However, consumers may find these labels misleading upon closer inspection. For example, a jacket labeled \"100% vegan\" lacks material details, and a \"vegan leather\" handbag is revealed to be made from 56% recycled polyester and 44% polyurethane, essentially plastic. This trend highlights a growing use of these terms in fashion, raising questions about the materials' sustainability and transparency.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it raises awareness about the misleading use of terms like 'vegan' and 'plant-based' in the fashion industry. It provides actionable insights for consumers to make informed decisions and promotes transparency in the industry.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.932,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.565,
    "normalized_score": 5.39
  },
  {
    "title": "Dismantling NOAA Threatens the World’s Ability to Monitor Carbon Dioxide Levels",
    "domain": "science",
    "location": "global",
    "published": "Sat, 10 May 2025 11:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "The agency maintains the global backbone of measurements of CO2 and other gases, but these are at risk of being curtailed if the foreshadowed cuts to NOAA are realized."
    ],
    "image_url": "https://media.wired.com/photos/681c9010bf7f6e9a9dc486f5/master/pass/shutterstock_785739712.jpg",
    "titles": [
      "Dismantling NOAA Threatens the World’s Ability to Monitor Carbon Dioxide Levels"
    ],
    "summary": "The agency responsible for maintaining global measurements of CO2 and other gases faces potential operational risks due to anticipated budget cuts to NOAA. These cuts could lead to a reduction in the agency's ability to monitor crucial environmental data.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about the potential impact of budget cuts on NOAA's ability to monitor environmental data. It raises awareness about the importance of these measurements in understanding and addressing climate change. However, it doesn't provide specific solutions or progress towards addressing this issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.929,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.544,
    "normalized_score": 2.63
  },
  {
    "title": "I work as a sensitivity reader—and racism is harder to spot than you'd think",
    "domain": "science",
    "location": "global",
    "published": "Sat, 10 May 2025 10:30:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "If I asked you to picture a racist, I know exactly what you'd envision. A white hood, or someone screaming slurs, or a person praising slavery."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/reading.jpg",
    "titles": [
      "I work as a sensitivity reader—and racism is harder to spot than you'd think"
    ],
    "summary": "The article discusses common stereotypes associated with racism, suggesting that many people might envision overt symbols or acts of racism, such as wearing a white hood, yelling racial slurs, or openly supporting slavery, when thinking of a racist individual.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This article is highly constructive as it offers deeper understanding of the subtleties and complexities of racism, beyond the overt symbols or acts. It empowers readers with knowledge to identify and address less obvious forms of racism. However, it doesn't explicitly report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.923,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.562,
    "normalized_score": 5.0
  }
]