[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for tasks to be automated by machines, including self-driving cars and cleaning robots. While advanced sentient robots may not be widely affordable in our lifetimes, robot vacuums have become an accessible option for automating household cleaning tasks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7790107222106482,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.404752680552662,
    "summary": "In the present day, advancements in technology have enabled the automation of various tasks through machines, such as self-driving cars and cleaning robots. Although highly advanced sentient robots may remain out of financial reach for many during their lifetimes, robot vacuums have emerged as a widely accessible means to automate home cleaning tasks."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. The event, running until March 31, 2025, offers discounts on gardening supplies, bedding, and more."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7289768824189815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3922442206047454,
    "summary": "Amazon has initiated its Big Spring Sale, offering discounts on items such as gardening supplies and bedding. The sale is set to continue until March 31, 2025, aligning with the onset of spring."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following a Nintendo Direct stream, as reported by VGC. This reveal was made on a webpage dedicated to the new Virtual Game Card lending system, which is set to launch. This announcement was not initially planned for the day's discussions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7226116324074074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3906529081018518,
    "summary": "Nintendo unexpectedly announced \"Switch 2 Edition\" games following a Nintendo Direct stream, as reported by VGC. This revelation came via a webpage for the new Virtual Game Card lending system. The announcement was not originally scheduled for the day's discussions."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting conservative podcasters for extensive access to senior officials from the Trump Administration. This initiative aims to engage alternative media and is planned to be a recurring event, highlighting the administration's focus on diversifying media outreach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7002392798726852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3850598199681713,
    "summary": "On Thursday, the White House initiated Podcast Row, an event designed to grant conservative podcasters access to senior Trump Administration officials. This move, intended to broaden media outreach, signifies the administration's effort to include alternative media platforms. The event is expected to be repeated, emphasizing the administration's strategy to diversify its communication channels."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers, including its first color e-reader, are being discounted. The Kindle Scribe, notable for its note-taking capability, is on sale at an all-time low price for the 16GB model."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.691623828900463,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3829059572251158,
    "summary": "Amazon's Big Spring Sale features discounts on several e-readers, including the Kindle Scribe, which is notable for its note-taking feature. The 16GB model of the Kindle Scribe is available at its lowest price ever. The sale also includes Amazon's first color e-reader."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission have been directed to stop describing the agency as \"independent\" in complaints. This instruction was communicated by Christopher Mufarrige, the Director of the Bureau of Consumer Protection, through an email."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6642966347337964,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37607415868344907,
    "summary": "The Director of the Bureau of Consumer Protection, Christopher Mufarrige, has instructed Federal Trade Commission staff to no longer refer to the agency as \"independent\" in their complaints. This directive was issued via email."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian firm, has launched the Classic 2 trackball mouse, maintaining the original's design and ergonomics but featuring enhanced connectivity, a more precise scroll wheel, and a design upgrade for easier 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6591913764467592,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3747978441116898,
    "summary": "Ploopy, a Canadian company, released the Classic 2 trackball mouse, an update of its original model. It includes improved connectivity, a more accurate scroll wheel, and a redesigned structure for simpler 3D printing, while keeping the original design and ergonomics."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is ongoing until Monday, March 31st, offering numerous deals that are available to all customers, not just Amazon Prime members. The sale includes over 90 deals on popular items, with a focus on providing low-cost alternatives for shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6324428639351851,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3681107159837963,
    "summary": "Amazon is holding its Big Spring Sale until March 31st, featuring over 90 deals accessible to all customers, including non-Prime members. The sale focuses on offering low-cost alternatives on popular items."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft announced the creation of a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises, with Tencent investing €1.16 billion for a 25% stake. This values the new subsidiary at approximately €4 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6280675819560184,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3670168954890046,
    "summary": "Ubisoft has formed a new subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises. Tencent has invested €1.16 billion in exchange for a 25% stake, valuing the subsidiary at about €4 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on a variety of gadgets and gear, including Apple MacBooks. These MacBooks come with Apple's M-series chips, available in various sizes and price points. Notably, the M1 MacBook Air has been discontinued."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6229751325694444,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3657437831423611,
    "summary": "Amazon's Big Spring Sale is offering substantial discounts on numerous items, including Apple MacBooks equipped with M-series chips. The sale encompasses different models and price ranges. It's important to note that the M1 MacBook Air is no longer available."
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified that they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's President described Donald Trump's Arctic plans as \"serious\" but stated they have no connection to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered because of tariffs imposed by Trump, putting at risk future collaborative efforts between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that Trump's tariffs have changed the Canada-US relationship, potentially affecting future cooperation."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected JD Vance and his wife's advances following Donald Trump's vow to assert control over the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has declined an approach by JD Vance and his wife after Donald Trump promised to take control over the island."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has issued an order for his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children were among those who died in a recent incident, but additional information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son since he was moved from the US to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid a strong challenge from the opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking reelection, facing a significant challenge from the opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The perpetrator's first parole attempt was denied in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The perpetrator, who was seeking parole in Texas, had their first attempt at release denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing it of breaking international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies, led by China, have announced plans to retaliate against the United States, claiming it has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's advancement was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The advancement in technology was reportedly supported by Russia, as stated by analysts."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist, was arrested in Istanbul during his coverage of protests. Following his arrest, he was deported to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The movie featuring Robert Downey Jr as Doctor Doom is scheduled for release in May 2026."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A movie starring Robert Downey Jr. as Doctor Doom is set to be released in May 2026."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been apprehended with the help of a local resident, as stated in police reports."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a bed after a child reported seeing a \"monster\" there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a bed after a child reported seeing a \"monster.\""
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The new law in Poland permits authorities to temporarily suspend asylum rights at the Belarus border."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Poland has enacted a law allowing the temporary suspension of asylum rights at its border with Belarus. This measure is aimed at managing migration and security concerns."
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his residence, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his residence, as reported by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Boualem Sansal, an 80-year-old individual, expressed in an interview with a far-right news outlet that during the colonial period, France allocated an excessive amount of land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Boualem Sansal, an 80-year-old, stated in an interview with a far-right news outlet that France gave too much land to Algeria during the colonial period."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the deaths of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine and highlighted his country's resilience amid challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky spoke about Europe's backing of Ukraine, emphasizing the nation's endurance in the face of adversity."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and national issues has made the government's effort to secure a second term in office more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government is facing increased difficulty in securing a second term due to a combination of domestic and international challenges."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent urban residents increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care industry in India is expanding as more wealthy city dwellers are spending on luxury items and services for their pets, particularly dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that the combination of strong winds, dry land, and pine trees significantly increases the risk of wildfires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts caution that the risk of wildfires is heightened due to strong winds, dry conditions, and the presence of pine trees."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms family trees into dynamic movies, illustrating the global movements of ancestors over time. This innovative approach not only offers a unique perspective on genealogy but also has applications in tracking disease spread and analyzing animal migration patterns across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a statistical method that turns family trees into dynamic movies, showing how ancestors moved globally over time. This new technique provides a fresh view on genealogy and can be used to track disease spread and study animal migration patterns."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rain in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rain account for 60% of the unexpected difference in ocean temperatures around Antarctica over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently feel ignored, doubted, and lacking support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study highlights that people with Long COVID often experience feelings of being overlooked, doubted, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions originate from distinct precursor cells and exhibit unique gene regulation patterns. This discovery highlights the complexity of skeletal development and may explain vertebrates' evolutionary success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that vertebrate skeletal cells from various body regions come from different precursor cells and have unique gene regulation patterns. This finding sheds light on the complexity of skeletal development and could explain the evolutionary success of vertebrates."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will motivate scientists to address the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, is promoting the idea of incorporating eugenics into college genetics courses. He argues that this will help scientists tackle the issue of science being misused for political reasons."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances have higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from twelve parks in Dublin, Ireland, showed that park entrances contain higher levels of infective roundworm eggs than other areas within the parks."
  },
  {
    "title": "3-seed Texas Tech survives OT thriller vs. 10-seed Arkansas to book spot in Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:44:17 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm sorry, but it seems like there was no news content provided for me to summarize. Could you please provide the specific details or content you'd like summarized?"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "As no specific news content was provided, a summary cannot be generated. Please provide the details or content you wish to have summarized."
  },
  {
    "title": "Flagg drops 30, leads 1-seed Duke into Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased his talent in a basketball game against Arizona, scoring 30 points, grabbing six rebounds, making seven assists, and blocking three shots. This performance contributed to Duke's 100-93 victory, advancing them to the Elite Eight for the second consecutive year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg from Duke University played a key role in their 100-93 win over Arizona, scoring 30 points, with six rebounds, seven assists, and three blocks. This victory moves Duke into the Elite Eight for the second year in a row."
  },
  {
    "title": "Giddey's 47-ft, buzzer-beating heave stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half-court at the buzzer, leading to a 119-117 win over the Los Angeles Lakers. This shot marked one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half-court at the buzzer, securing a 119-117 victory against the Los Angeles Lakers. This event is highlighted as one of the NBA season's most dramatic finishes."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not make a clear statement about his future with the team following their Sweet 16 loss to Florida on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "After Maryland's Sweet 16 defeat to Florida, men's basketball coach Kevin Willard did not provide a definitive answer regarding his future with the team."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU in the East Region semifinal. Mark Sears led the team in this achievement, breaking a 35-year-old record."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in their 113-88 victory over BYU in the East Region semifinal. Mark Sears was the leading player in this achievement, breaking a record that had stood for 35 years."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut game with the Mets on Thursday, Juan Soto struck out with two outs in the ninth inning, failing to score the tying runs. This concluded the game with a 3-1 victory for the Astros."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing the tying runs from scoring. The game ended in a 3-1 win for the Astros."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, which held extra importance following offseason trade speculations. His performance was celebrated by Cardinals fans, who honored him with a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amid offseason trade rumors. His performance was met with applause from Cardinals fans, leading to a curtain call."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to scapegoat him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt is suing the NCAA and the university for $100 million. He claims they conspired to make him a scapegoat."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 00:47:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After Thursday's game, Alex Ovechkin led the Capitals players in a postgame handshake with retiring Wild goalie Marc-Andre Fleury, demonstrating respect and sportsmanship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following Thursday's game, Alex Ovechkin and his Capitals teammates participated in a postgame handshake with Marc-Andre Fleury, the retiring goalie of the Wild, as a gesture of respect and sportsmanship."
  },
  {
    "title": "How Calipari's departure led to Kentucky, Arkansas and BYU in the Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The coaching changes across three teams have successfully led each of them to advance to the second weekend of competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Coaching changes in three different teams have resulted in each team progressing to the second weekend of their respective competitions."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders are discussing key NBA awards, focusing on the MVP race between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are currently focusing on the MVP race, highlighting a competition between Nikola Jokic and Shai Gilgeous-Alexander."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record number of 3-point attempts in the league, sparking discussions on whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, leading to debates about potentially implementing measures to reduce the frequency of these shots."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts have made predictions for the 2025 baseball season, including whether the Dodgers can win again and potential MVP winners."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts have predicted outcomes for the 2025 baseball season, focusing on the Los Angeles Dodgers' chances of securing another victory and identifying potential Most Valuable Player (MVP) candidates."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The message provides information relevant to sports teams, indicating support for teams whether they are already favorites or aiming to be the surprise success of 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The message highlights encouragement for sports teams, showing support for both established favorites and those aspiring to become the surprise successes of 2025."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings. The update does not specify which of these athletes takes the top spot, indicating that all are considered key players within the rankings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo have been highlighted in the latest Sweet 16 player rankings. The update does not disclose the specific rankings of these athletes, suggesting they are all significant contenders within the list."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's basketball team in their pursuit of a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team in their quest for a championship title, showcasing their significant contributions and skills on the court."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical role, made his own selections for the first round of an unspecified event, presumably related to sports. This action was part of an exercise where he utilized his experience as a General Manager (GM) to make choices as if he were in that position again."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, drawing on his experience as a General Manager, made selections for the first round of a hypothetical event, likely in sports, as part of an exercise simulating his return to the GM role."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised widespread concern in college athletics about the potential for other athletes to be victims."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concern in college athletics, highlighting the possibility that more athletes may be victims."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in Europe's top football leagues are currently dominating the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1. These players have showcased exceptional talent and skill, positioning themselves at the top of the scoring charts in their respective leagues."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top scorers in Europe's major football leagues, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1, are currently leading the charts. These players have demonstrated remarkable talent and skill in their performances."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced on Thursday that four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, are under investigation for purported \"indecent conduct\" during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" in a Champions League match against Atlético Madrid, as announced on Thursday."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, unlike the situation a year ago, indicating no immediate changes are expected regarding his future with the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, suggesting he will continue with the team as there are no expected changes to his position."
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona secured a semi-final spot in the women's Champions League by defeating VfL Wolfsburg 6-1 in the second leg of their quarter-final match, achieving a 10-2 win on aggregate."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona's women's team advanced to the Champions League semi-finals after beating VfL Wolfsburg 6-1 in the second leg of their quarter-final, resulting in a 10-2 aggregate victory."
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Premier League clubs will have a 10-day early transfer window in June before the FIFA Club World Cup, followed by a reopening on June 16, as confirmed by the league on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Premier League clubs will benefit from a 10-day early transfer window in June ahead of the FIFA Club World Cup. The window will then reopen on June 16, as announced by the league."
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Manchester City will delay any decisions on Claudio Echeverri's future with the club until the summer, according to information provided to ESPN by a source."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Manchester City has decided to postpone any decisions regarding Claudio Echeverri's future at the club until the summer, as reported by ESPN citing a source."
  }
]