[
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:24:36 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "CityNews",
      "NPR",
      "CNBC",
      "ABC News",
      "Al Jazeera",
      "Forbes",
      "The Guardian",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.cnbc.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.theguardian.com",
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.ft.com"
    ],
    "snippets": [
      "The deal raises the possibility that the war may now be over, ending the  bloodiest fighting ever between Israelis and Palestinians.",
      "Gaza ceasefire breakthrough announced by US President Donald Trump on third day of talks in Egypt’s Sharm el-Sheikh.",
      "Mediator Qatar said that more details of the agreement would be announced at a later date.",
      "US President Donald Trump said this means that all of the hostages will be released very soon and Israel will withdraw troops. DW has the latest.",
      "President Donald Trump said earlier Wednesday he may go to the Middle East in the coming days.",
      "Trump announced that Israel and Hamas had agreed on the first phase of a peace plan which could put an end to the two-year war and free hostages.",
      "US president says all hostages to be released ‘very soon’ as he hails breakthrough deal",
      "<p>Donald Trump announces that all hostages will be released ‘very soon’ and Israel will withdraw troops to an agreed upon line</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates\">Follow latest upd",
      "President Donald Trump suggested he may travel to Gaza.",
      "U.S. President Donald Trump has announced that Israel and Hamas have agreed to the “first phase” of his peace plan to pause fighting and release at least some hostages and prisoners. “This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed u",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”",
      "<p>US President Donald Trump announced that Israel and Hamas have agreed to the ‘first phase’ of his plan to pause fighting and release some hostages and prisoners</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-a"
    ],
    "image_url": "",
    "titles": [
      "Israel and Hamas agree on the 'first phase' of Gaza ceasefire deal",
      "LIVE: Trump says Israel, Hamas agree on ‘first phase’ of Gaza ceasefire",
      "Trump says Israel and Hamas sign off on first phase of Gaza ceasefire plan",
      "Israel, Hamas sign off on 'phase 1' of Gaza peace plan, Trump says",
      "Israel-Gaza live updates: Trump says Israel and Hamas signed off on 1st phase of deal",
      "Israel, Hamas agree to first phase of Gaza peace plan, allowing release of hostages and prisoners",
      "Trump says Israel and Hamas have agreed first phase of Gaza peace plan",
      "‘First phase’ of ceasefire deal to end war in Gaza agreed by Israel and Hamas",
      "Trump Says Israel And Hamas Have Agreed To First Phase Of Peace Deal",
      "Israel and Hamas agree to ‘first phase’ of plan to end fighting and release hostages, Trump says",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’",
      "Gaza ceasefire deal: What we know so far about the ‘first phase’ of the peace plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.905,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.866,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Yankees 5-2, Advance to ALCS for First Time Since 2016",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 23:05:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Global News",
      "Yahoo Sports",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca",
      "www.nbcsports.com",
      "www.espn.com",
      "www.timesunion.com"
    ],
    "snippets": [
      "The Blue Jays advanced to the club's first ALCS since 2016 after defeating the Yankees 5-2 on Wednesday.",
      "Vladimir Guerrero Jr. and George Springer each drove in a run, and eight Toronto pitchers shut down the New York Yankees.",
      "The AL East rivals faced each other 13 times in the regular season, with the Blue Jays winning eight of those games.",
      "The Toronto Blue Jays have advanced to the American League Championship Series for the first time since 2016 with a 5-2 win over the New York Yankees in Game 4 of the ALDS.",
      "The Blue Jays have won 5-2 in Game 4 of the American League Division Series against the New York Yankees. After two wins in Toronto, one loss in New York on Tuesday, the team made a comeback Wednesday after defeating the Yankees. The Jays are now advancing to the the American League Championship Ser"
    ],
    "image_url": "",
    "titles": [
      "Jays knock out Yankees, reach 1st ALCS since '16",
      "Blue Jays beat Yankees 5-2 in Game 4 to reach first ALCS since 2016",
      "Blue Jays beat Yankees in Game 4 to win the ALDS",
      "NewsAlert: Blue Jays beat Yankees, advance to ALCS",
      "Blue Jays beat Yankees 5-2, advance to the ALCS"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.977,
      "consensus": 0.928,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.815,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays advanced to the American League Championship Series (ALCS) for the first time since 2016 by defeating the New York Yankees 5-2 in Game 4 of the ALDS. Key contributions came from Vladimir Guerrero Jr. and George Springer, with eight pitchers collectively shutting down the Yankees. This victory follows a regular season where the Blue Jays won eight of thirteen games against their AL East rivals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguars Trade for Browns' Newsome, Campbell Moves to Cleveland",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 23:05:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Jaguars and Browns agreed to a trade of cornerbacks Wednesday night, with Greg Newsome heading to Jacksonville and Tyson Campbell going to Cleveland, sources told ESPN's Adam Schefter.",
      "The Browns have made a second trade in two days",
      "The Jaguars and Browns are swapping cornerbacks."
    ],
    "image_url": "",
    "titles": [
      "Sources: Jags get Newsome; Campbell to Browns",
      "Browns trade CB Greg Newsome II to Jaguars for CB Tyson Campbell, per reports",
      "Jaguars reportedly trading for CB Greg Newsome, sending CB Tyson Campbell to the Browns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Jaguars and Browns have completed a cornerback trade, with Greg Newsome moving to Jacksonville and Tyson Campbell heading to Cleveland, as reported by ESPN's Adam Schefter. This marks the Browns' second trade in two days, indicating active roster adjustments by both teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested for Historic LA Fire, AI Image Found on Devices",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 02:57:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Investigators say evidence collected from the 29-year-old's devices showed an AI image of a burning city.",
      "Police say 29-year-old Jonathan Rinderknecht was behind fire that destroyed much of the Pacific Palisades neighbourhood.",
      "Authorities announced the arrest of a 29-year-old man for allegedly starting the devastating fire in the Los Angeles neighborhood of Pacific Palisades in January. It is considered the worst fire in the city's history."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3d6e/live/0e430540-a469-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "ChatGPT image snares suspect in deadly Los Angeles fire",
      "Suspect charged with starting deadly Los Angeles Palisades fire",
      "US police arrest man suspected of starting deadly LA fire"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.954,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jonathan Rinderknecht, 29, was arrested for starting a fire in Los Angeles' Pacific Palisades neighborhood, considered the worst in the city's history. Evidence from his devices included an AI image of a burning city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Accuses Pritzker, Chicago Leaders Without Evidence",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:28:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.latimes.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as US troops arrive in state.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNODU0dE5Ea1BGZFR0dl8yOWs0c1MtMnlpV2JmLVpZUUJ6em5Ta3lIOXhCLWdmZ1FPOG9NTnlwUHhWSkU2ekhaXy1jRVFhTElkS2VfR0hPT21taTJadkpVd3c5VWRZZDJTQjlHQ2RGemNOTWtWZ0JQdGNZUmZid0lDbzFTRUd5Zw?oc=5\" target=\"_blank\">Trump baselessly calls for Pritzker, Chicago ",
      "<p>President Trump continued to campaign for deploying National Guard troops to Chicago and Portland, Ore., despite opposition from local and state leaders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump calls to jail Chicago mayor, Illinois governor in immigration dispute",
      "Trump baselessly calls for Pritzker, Chicago mayor to be jailed - Axios",
      "Trump says Chicago mayor, Illinois governor should be jailed amid militarized campaign"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.869,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump made baseless accusations against Governor Pritzker and Chicago's leadership, alleging their failure to protect ICE officers. No evidence was provided to support his claims.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flight Delays Rise Amid Controller Shortage and Government Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 22:20:10 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQWE1tajBMMWdsc0h1dTlycUx1clJBLU5HSDBSV3pnWmhDU1ZvM0dzemVtUFJNZXJYVU0yQWlWNmt4NDZOM3dSMXNSUmZUQXpmZGhrSFhBS1hCSnFON1hQRFRNaE91dVM2Yktoc0lvYURuaDNmZTBSWWFVR0Z4dlRCTndrZmtpbEhEWGc?oc=5\" target=\"_blank\">How air traffic controllers could help e",
      "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.",
      "The government shutdown is exacerbating concerns about the strain on air traffic controllers, a shortage of whom has vexed airline executives for years."
    ],
    "image_url": "",
    "titles": [
      "How air traffic controllers could help end the shutdown - Axios",
      "WATCH:  Air traffic controller shortages amid shutdown lead to canceled flights, delays",
      "Air traffic control shortages add to U.S. flight delays, FAA says"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.867,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Flight delays and cancellations are increasing due to a shortage of air traffic controllers caused by sickness-related absences. The ongoing government shutdown is worsening the situation, highlighting a long-standing issue of controller shortages that has troubled airline executives for years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giannis Affirms Commitment to Bucks, Open to Future Changes",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:05:11 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Milwaukee's MVP was asked about recent reports of a trade between the Bucks and Knicks",
      "Giannis Antetokounmpo reaffirmed that he's “locked in” with the Milwaukee Bucks while acknowledging the possibility he eventually could change his mind depending on how things develop over the next several months.  “I believe in this team,” the two-time MVP told reporters Wednesday after the Bucks' ",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOQ1BTcThHYmM1TFdIX2otczVQQlBvcjlTdjNrSkJzUWo1X00wR1g2d3FIZ2tTTEJnOGZIUUxlemU3SU9ESkRDc0dBYnRZdkZjemJlOWRuWFI5SGxveDRjRmszbVc0M0Zlam5mS2dZUmZHVTh3cTF3Q19xLWFhWUtjVjR4OFlTUQ?oc=5\" target=\"_blank\">Giannis Antetokounmpo Responds to Latest Buck"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/08/2a40565e-c152-4d32-9c55-48827d2582a5/giannis.jpg",
    "titles": [
      "Giannis Antetokounmpo trade rumors: Bucks star 'locked into' team but reveals when his mind could change",
      "Antetokounmpo says he's 'locked in' with Bucks while noting possibility he could change his mind",
      "Giannis Antetokounmpo Responds to Latest Bucks Trade Rumors - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.844,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Giannis Antetokounmpo, the two-time MVP, has stated he remains committed to the Milwaukee Bucks amid rumors of a potential trade to the Knicks. He expressed his belief in the team's potential but did not rule out changing his stance in the future based on the team's development.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rielly Shines in Leafs' 5-2 Win Over Canadiens, Nylander Leads Offense",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 09 Oct 2025 03:38:27 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Morgan Rielly went through an off-season of reflection.",
      "<p>William Nylander led the offensive charge for the Toronto Maple Leafs, tallying a goal and two assists in his team&#8217;s 5-2 victory over the Montreal Canadiens. Morgan Rielly added a goal and an assist of his own in the win.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/64e18e60c3c8b9e420603daf54353b617870f80f0bb2ef2342d0846fb3d62bef.jpg?quality=65&strip=all",
    "titles": [
      "Rielly’s big night powers Leafs over Canadiens",
      "NHL Highlights: Maple Leafs 5, Canadiens 2"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.713,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Morgan Rielly, after an off-season of reflection, contributed to the Toronto Maple Leafs' 5-2 victory over the Montreal Canadiens by scoring a goal and assisting another. William Nylander spearheaded the team's offensive efforts with a goal and two assists.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attack on Manchester Synagogue on Holy Day Kills Two; Assailant Claims IS Ties",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 19:37:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Police confirm the attacker made the call after he crashed his car into a brick wall.",
      "Police said Jihad al-Shamie called emergency services to declare allegiance to armed group as he carried out the attack.",
      "Jihad al-Shamie, who attacked a Manchester synagogue on the holiest day of the Jewish calendar, called the emergency services during the attack to claim responsibility."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a5fb/live/0efb21c0-a455-11f0-8a21-ff96e44d1cc2.jpg",
    "titles": [
      "Synagogue attacker pledged allegiance to 'Islamic State' in 999 call",
      "Manchester synagogue attacker claimed allegiance to ISIS, UK police say",
      "Manchester Synagogue Attacker Pledged Allegiance to ISIS, Police Say"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.819,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad al-Shamie attacked a Manchester synagogue on the Jewish calendar's holiest day, killing two worshippers. During the attack, he crashed his car into a brick wall, then called emergency services to claim responsibility and pledge allegiance to the Islamic State, according to police.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tuchel Calls England 2026 World Cup \"Underdogs,\" Stresses Unity and Cohesion",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:21:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Thomas Tuchel believes England will go into the World Cup as \"underdogs\" and says they have \"no chance\" of succeeding unless the team unite.",
      "The 2026 FIFA World Cup is set to be the most expensive, polluting and political yet.",
      "<ul><li><p>Tuchel: ‘I don’t see why we should burden ourselves’</p></li><li><p>Head coach ‘not just collecting most talented players’</p></li></ul><p>Thomas Tuchel has said England would be underdogs at the World Cup and would be stronger if they did not allow themselves to become burdened by expect"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4684/live/c0c65910-a487-11f0-961e-13040d1e97f4.jpg",
    "titles": [
      "England will be 'underdogs' at World Cup - Tuchel",
      "Will the 2026 World Cup be a disaster for fans?",
      "Tuchel insists England should embrace underdog status at 2026 World Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.849,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Thomas Tuchel, addressing England's prospects for the 2026 FIFA World Cup, labeled the team as \"underdogs\" and emphasized the necessity of unity for any chance of success. He highlighted the importance of not overburdening themselves with expectations. Additionally, Tuchel mentioned his approach to team selection, focusing on cohesion over merely gathering the most talented players. The 2026 World Cup is noted for being anticipated as the most expensive, environmentally taxing, and politically charged iteration to date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man United Co-owner Backs Coach Amorim, Offers 3-Year Window to Prove Worth",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:08:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Manchester United co-owner Sir Jim Ratcliffe says manager Ruben Amorim needs three years to prove he is a \"great\" coach.",
      "<ul><li><p>Minority owner moves to clarify coach’s future</p></li><li><p>‘You can’t run a club like United on kneejerk reactions’</p></li></ul><p>Sir Jim Ratcliffe insists he will not take a “kneejerk” decision to sack Ruben Amorim and has indicated he will afford the head coach three years to demon",
      "Manchester United minority owner Sir Jim Ratcliffe has said he wants to give under-pressure head coach Ruben Amorim three years in the job to prove himself."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aed/live/3ebc1c60-a45b-11f0-bf2c-b564608f4fa4.jpg",
    "titles": [
      "Amorim needs three years at Man Utd - Ratcliffe",
      "Ratcliffe says Ruben Amorim has three years to prove himself at Manchester United",
      "Ratcliffe: I want to give Amorim three years to prove himself at Man Utd"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.794,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester United co-owner Sir Jim Ratcliffe supports head coach Ruben Amorim, stating he will not make a \"kneejerk\" decision regarding his position. Ratcliffe emphasizes the importance of stability and has indicated Amorim will be given three years to demonstrate his capabilities and prove he is a \"great\" coach for the club.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's PM Lecornu: Budget Must Pass by Year-End, Avoids Snap Elections",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 20:50:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Sébastien Lecornu, the outgoing prime minister, said MPs recognise the pressing need to pass a budget by the end of the year.",
      "The announcement came after last-ditch talks by outgoing premier Sebastien Lecornu failed to find a solution to crisis.",
      "The announcement from the French president came after last-ditch talks held by Sébastien Lecornu, France’s departing prime minister, who said most parties wanted to avoid snap elections."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c717/live/89beaff0-a480-11f0-892d-8503a9b17f9b.jpg",
    "titles": [
      "Macron will nominate new French prime minister in 48 hours",
      "France’s Macron to appoint new prime minister within 48 hours",
      "Macron Will Name New Prime Minister Rather Than Call Elections"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's outgoing prime minister, announced the need to pass a budget by year's end, following unsuccessful last-ditch talks to resolve a crisis. Despite the failure, Lecornu noted a general consensus among parties to avoid snap elections, as stated by the French president.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolly Parton Debunks Health Rumors: \"I Ain't Dead Yet!\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:12:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The singer's sister had asked fans to pray for her after the star postponed gigs due to health issues.",
      "Legendary American singer Dolly Parton put the buzz of a health scare to bed in a social media post. The 79-year-old said she was okay after her sister made comments about her health, sending fans in a tailspin.",
      "<p>Country music star shares buoyant video on social media after rumors swirl about her health</p><p>Dolly Parton has taken to social media to clarify she “ain’t dead yet!”</p><p>In a <a href=\"https://www.instagram.com/reel/DPjkor7kfeb/?utm_source=ig_embed&amp;ig_rid=f6a18523-b270-4635-8cd2-e641914e"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/810e/live/e81213b0-a3f1-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Dolly Parton posts 'I ain't dead yet' after sister sparks health concerns",
      "'Ain't dead yet,' says Dolly Parton amid health rumors",
      "Dolly Parton addresses health concerns in new video: ‘I ain’t dead yet!’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.795,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Dolly Parton addressed health rumors by posting a video on social media, asserting \"I ain't dead yet!\" following concerns raised after her sister asked fans for prayers and Parton postponed gigs due to health issues. She aimed to clarify her current well-being to her fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Parliament Bans Meat Terms for Plant-Based Products Amid Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 16:55:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Pressure to ban meat labels for plant-based products comes from Europe's livestock farmers.",
      "<p>Proponents say move would strengthen position of farmers in supply chain but critics dismiss it as ‘hotdog populism’</p><p>Veggie burgers, tofu steak and cauliflower schnitzel will be off the menu if the European parliament gets its way after a vote on food names.</p><p>MEPs voted on Wednesday by",
      "More and more European shoppers are buying imitation schnitzel, bratwurst and steak made from plants but some politicians say only real meat should use those names."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/62fd/live/09d090f0-a45e-11f0-a789-358ea6d9d143.jpg",
    "titles": [
      "No more veggie burgers? EU parliament votes to ban meat names for plant-based foods",
      "‘Veggie burgers’ could be off EU menu as MEPs back renaming plant-based foods",
      "That’s no schnitzel! E.U. moves to ban using meat names for veggie fare."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "European Parliament voted to restrict plant-based products from using meat-related terms like 'burger' or 'steak'. This decision, supported by livestock farmers aiming to strengthen their market position, faces criticism for potentially misleading consumers and limiting choice. Critics label it as 'hotdog populism'. The outcome impacts labeling of plant-based foods across Europe, with opponents arguing it could confuse shoppers accustomed to such terms for vegetarian options.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flintoff Resigns as Northern Superchargers Coach Over Contract Dispute",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 17:28:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Former England all-rounder Andrew Flintoff says he will no longer coach Northern Superchargers in The Hundred, feeling he is \"worth more\" than what the new owners offered.",
      "<ul><li><p>Terms could not be agreed with new owners Sun Group</p></li><li><p>‘You’ll be missed. I wasn’t expecting that,’ says Adil Rashid</p></li></ul><p>Andrew Flintoff has walked away from his role as Northern Superchargers head coach, suggesting the team’s new Indian owners made him feel underv",
      "Andrew Flintoff has walked away from his role as Northern Superchargers head coach, suggesting the team's new Indian owners made him feel undervalued."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/69d4/live/a607bdb0-a466-11f0-8c79-29eeaf2ea52d.jpg",
    "titles": [
      "'I'm worth more' - Flintoff leaves Superchargers",
      "Andrew Flintoff leaves role as Northern Superchargers head coach",
      "'I'm worth more' - Flintoff steps away from Northern Superchargers role"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.783,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Andrew Flintoff has resigned as head coach of the Northern Superchargers, citing dissatisfaction with the contract offered by the team's new owners, Sun Group. Flintoff felt undervalued by the terms proposed, leading to his decision to step down. Teammate Adil Rashid expressed surprise and disappointment at Flintoff's departure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Take 2-0 Series Lead as Wilson Shines, Sabally Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 23:50:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Everything that happened in Game 3, including A'ja Wilson's historic night and Satou Sabally's injury.",
      "The Aces have taken a commanding 2-0 lead, but now the series will shift to Phoenix for Game 3"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals Game 3 takeaways: How Aces beat Mercury to go up 3-0",
      "2025 WNBA Finals: Aces vs. Mercury schedule, Game 3 prediction, odds, pick, where to watch"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Game 3 of the series, A'ja Wilson had a historic night, contributing significantly to the team's performance. However, the game was also marked by Satou Sabally's injury. Despite these events, the Aces secured a 2-0 lead in the series. The next game is set to take place in Phoenix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nobel Chemistry Prize Awarded for Metal-Organic Frameworks Innovation",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:58:33 +0100",
    "source": "New Scientist",
    "sources": [
      "Phys.org",
      "New Scientist",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "phys.org",
      "www.newscientist.com"
    ],
    "snippets": [
      "Susumu Kitagawa, Richard Robson and Omar Yaghi have been honoured for the development of metal-organic frameworks, porous materials that can capture water or pollutants",
      "Three scientists have been awarded the 2025 Nobel prize in chemistry for discovering a new form of molecular architecture: crystals that contain large cavities.",
      "Three researchers share prize for structured polymers called metal-organic frameworks."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/10/08110541/SEI_269475037.jpg",
    "titles": [
      "Nobel prize in chemistry awarded for work on molecular architecture",
      "Nobel chemistry prize awarded for crystal materials that could revolutionize green technology",
      "Chemistry Nobel prize awarded for building ordered polymers with metal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.698,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the Nobel Prize in Chemistry for creating metal-organic frameworks. These innovative porous materials have applications ranging from capturing water in deserts to storing gases and delivering drugs. This recognition highlights their significant contribution to science and various industries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SoftBank Acquires ABB's Robotics Division for $5.4 Billion to Boost AI Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 03:10:53 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The S&amp;P 500 and Nasdaq Composite scored new intraday and closing highs Wednesday stateside.",
      "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier."
    ],
    "image_url": "",
    "titles": [
      "SoftBank shares soar 13% after it agrees to buy ABB robotics unit for $5.4 billion",
      "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SoftBank Group announced its acquisition of the robotics division of ABB, a Swiss engineering firm, for $5.4 billion. This move aims to expand SoftBank's involvement in robotics, emphasizing the company's focus on physical AI as a key area of future development.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Peptide Blocks Alpha-Synuclein Misfolding, Aids Parkinson’s Research",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:24:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain dis",
      "<a href=\"https://scitechdaily.com/scientists-discover-food-molecules-that-trick-cells-into-staying-young/\" rel=\"nofollow\" title=\"Scientists Discover Food Molecules That Trick Cells Into Staying Young\"><img alt=\"Energy Vitality Human Health Lifespan\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a molecule that could stop Parkinson’s in its tracks",
      "Scientists Discover Food Molecules That Trick Cells Into Staying Young"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Researchers have developed a peptide that inhibits the harmful misfolding of alpha-synuclein, a protein associated with Parkinson’s disease and some forms of dementia. In laboratory and animal studies, this peptide stabilized the protein and enhanced motor functions, showcasing the potential of rational drug design in addressing neurodegenerative disorders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signals Imminent Gaza Peace Deal; May Visit Middle East",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 01:56:03 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFBQc25iSUp6Q05iblQ0NVJtWGhZdGEzMGVYTWptSlhENktQQ0g2SHVQS0lkS3lnZWYyZFZsVHZRdHYzS3dwUExCY3l2WW5nZ0Q3WUJsdXhKeHp0TVhsN05KWDZOaGxENGFVRnVQVHVMbUs4TlU2?oc=5\" target=\"_blank\">Gaza peace deal reached, hostages to be freed</a>&nbsp;&nbsp;<font colo",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1hbXNZQTdmUDd2OVRfMUdRVmtYcjl0cFNSRFhmOVRNQnJDZ1JpRUoyZGlMdC1EUDhOTlN4X1JNNGxWUDhyQzJoQWZEXzdNQS1wY01HaXAyWGhGX2Y2SHR1dmxqOUlnY1M5RHB6OUFkVlA?oc=5\" target=\"_blank\">Gaza peace deal may be imminent</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</",
      "<p>US president optimistic after US, Qatari and Turkish officials join third day of indirect Israel-Hamas talks in Egypt</p><p>Donald Trump has said he may travel to the Middle East at the end of the week, adding that negotiations in Egypt to end the two-year war in Gaza were “very close” to reachin"
    ],
    "image_url": "",
    "titles": [
      "Gaza peace deal reached, hostages to be freed - Axios",
      "Gaza peace deal may be imminent - Axios",
      "Trump says Gaza peace deal ‘very close’ and he may travel to Middle East in days"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A peace deal to end the two-year war in Gaza appears imminent, with Donald Trump stating negotiations in Egypt, involving US, Qatari, and Turkish officials, are \"very close\" to a conclusion. Trump is optimistic about the talks and may travel to the Middle East soon. A note from Secretary of State Marco Rubio suggests Trump will soon announce the deal on Truth Social.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 22:47:23 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "",
    "titles": [
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "IRS Furloughs Workers Amid Ongoing Government Shutdown",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:00:29 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The IRS furloughs came on the same day that the Senate again fell short of passing a funding resolution that would end the federal government shutdown.",
      "Tax filings and payments are still due and Criminal Investigation will stay on the job. But processing of refunds and amended returns will likely be delayed."
    ],
    "image_url": "",
    "titles": [
      "IRS furloughs nearly half of its workforce due to government shutdown",
      "IRS Halts Most Taxpayer Services As It Furloughs Nearly Half Its Workers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.826,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The IRS furloughed employees as the Senate failed to pass a funding resolution, continuing the federal government shutdown. Despite efforts, no spending plans were approved to reopen the government. President Trump previously stated that about 750,000 federal workers could be furloughed or fired due to the shutdown.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shutdown Begins Amid Funding Deal Stalemate",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 23:47:29 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1IR0s3dmdnRTJjb1ZzelM5d2lSaC0zSHJDaWdYMzBCamhKVU5seHBCRXNZUUFTYUNxbmktTUstWURTODVidXZmNjRzdUI0XzRTWlJJcjZjdVNHbGppT0pVcTNuZlBQaWlaT2hKejZocVFBUW16Z2c?oc=5\" target=\"_blank\">The retiring Senate Democrat leading quiet government shutdown talks",
      "President Donald Trump and Republicans accuse Democrats, who want any funding bill to include health-care protections, of holding the government hostage."
    ],
    "image_url": "",
    "titles": [
      "The retiring Senate Democrat leading quiet government shutdown talks - Axios",
      "Senate again rejects funding bills as government shutdown enters second week"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government shutdown began at midnight on October 1, following a failure to reach a funding deal, with Democrats demanding health-care protections in any bill and Republicans, led by President Donald Trump, accusing them of holding the government hostage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Wildfire Kills 12; Man Charged with Arson",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:58:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Palisades Fire in early January burned thousands of homes and killed multiple people as flames spread rapidly in heavy winds up to 100 miles per hour.",
      "<p>Jonathan Rinderknecht allegedly started blaze that destroyed over 6,800 structures in California</p><p>A 29-year-old man has been arrested and charged with igniting the fire that days later became the devastating Palisades blaze, which killed 12 people and destroyed more than 6,800 structures in "
    ],
    "image_url": "",
    "titles": [
      "Florida man charged with intentionally setting Pacific Palisades fire in LA",
      "Man charged with starting Palisades fire that killed 12 people"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.842,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In early January, the Palisades Fire in California, fueled by winds up to 100 mph, killed 12 people and destroyed over 6,800 structures. Jonathan Rinderknecht, 29, has been arrested and charged with starting the fire. He allegedly sought to cover his tracks by inquiring about lighting a cigarette.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lecornu Resigns 14 Hours After Cabinet Formation Amid Party Resistance",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T18:39:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "Caretaker Prime Minister Lecornu resigned on Monday only 14 hours after naming his Cabinet, which had met resistance from rival political parties.",
      "Outgoing premier Sébastien Lecornu says prospect of a snap parliamentary election is receding"
    ],
    "image_url": "",
    "titles": [
      "France: Macron to name new French PM after Lecornu resigns",
      "Emmanuel Macron to name a new French PM by Friday"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Caretaker Prime Minister Sébastien Lecornu resigned just 14 hours after forming his Cabinet due to resistance from rival political parties. Following his resignation, Lecornu noted that the likelihood of a snap parliamentary election is decreasing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Pharmacy Launches Medication Kiosks for Common Prescriptions",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 12:53:58 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The kiosks are operated by Amazon Pharmacy and stock a range of commonly prescribed medications, such as antibiotics, inhalers and blood pressure treatments.",
      "The kiosks have a range of commonly prescribed medications, including antibiotics, inhalers, and blood pressure medications."
    ],
    "image_url": "",
    "titles": [
      "Amazon launches prescription vending machines at One Medical clinics in Los Angeles",
      "Amazon Pharmacy is launching vending machines for prescription drugs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.712,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon Pharmacy operates kiosks stocking various commonly prescribed medications like antibiotics, inhalers, and blood pressure treatments. The kiosks provide convenient access to these medications for customers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prime Big Deal Days: Top Picks on Tech and 4K Blu-rays at Low Prices",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-08T19:58:35-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "All of the deals we’ve recommended from Prime Big Deal Days are for products our team has tested and can personally vouch for, whether it be a streaming device, a laptop, or a pair of noise-canceling earbuds. However, there are also plenty of other gadgets that the&#160;Verge&#160;staff genuinely lo",
      "Movie streaming services are fine, but as their respective libraries and monthly rates change, nothing compares to having the 4K Blu-rays of your favorite movies to play whenever you want. If you want to add some titles to your collection, several great films and box sets are selling at the lowest p"
    ],
    "image_url": "",
    "titles": [
      "You still have time to save on Verge-favorite gadgets before Prime Day ends",
      "There’s still time to stock up on Blu-ray deals before the end of Prime Day"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.916,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During Prime Big Deal Days, the team recommended various tested products, including streaming devices, laptops, and noise-canceling earbuds. Additionally, with changing libraries and rates of movie streaming services, the appeal of owning 4K Blu-rays for uninterrupted access to favorite films is highlighted, noting that several titles are currently available at their lowest prices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]