[
  {
    "title": "Chris Eubank Jr beats Conor Benn on unanimous points decision",
    "domain": "general",
    "location": "global",
    "published": "Sat, 26 Apr 2025 23:22:31 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Fierce rivals go the distance in middleweight bout as their famous fathers watch on at Tottenham Hotspur Stadium."
    ],
    "image_url": "",
    "titles": [
      "Chris Eubank Jr beats Conor Benn on unanimous points decision"
    ],
    "summary": "In a highly anticipated middleweight boxing match held at Tottenham Hotspur Stadium, fierce rivals competed intensely in front of their famous fathers and a large audience. The event showcased the athletes' skills and determination as they battled through the rounds, ultimately going the full distance of the match. The presence of their renowned fathers added to the spectacle, highlighting the legacy and rivalry aspect of the contest. The outcome of the bout was not specified in the provided information.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the boxing match but lacks depth or insight into the significance of the event, the strategies used, or the implications for the athletes' careers.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.985,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.486,
    "normalized_score": 7.01
  },
  {
    "title": "Australia's universal healthcare is crumbling. Can it be saved?",
    "domain": "general",
    "location": "global",
    "published": "Sat, 26 Apr 2025 22:41:37 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "More and more Australians, regardless of where they live, are delaying or going without the care they need."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a88f/live/ebd0d3f0-228d-11f0-8c2e-77498b1ce297.png",
    "titles": [
      "Australia's universal healthcare is crumbling. Can it be saved?"
    ],
    "summary": "A growing number of Australians across all regions are postponing or not seeking necessary healthcare. This trend indicates a nationwide issue with access to medical services, affecting individuals' health decisions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story highlights a critical issue with Australia's healthcare system and implies a need for solutions, contributing to the reader's understanding of the problem and potentially influencing their decision-making regarding healthcare.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.975,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.544,
    "normalized_score": 10.0
  },
  {
    "title": "What will the next chapter look like for the Roman Catholic Church?",
    "domain": "general",
    "location": "global",
    "published": "Sat, 26 Apr 2025 22:27:01 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pope Francis leaves behind a legacy of reform - so how will his successor wield power?"
    ],
    "image_url": "",
    "titles": [
      "What will the next chapter look like for the Roman Catholic Church?"
    ],
    "summary": "Pope Francis, known for his reformative efforts within the Catholic Church, has left a significant legacy. The focus now shifts to how his successor will exercise power and whether they will continue or diverge from Francis's path of reform. The outcome will significantly impact the church's direction and its global influence.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about the potential future direction of the Catholic Church, although it doesn't offer specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.513,
    "normalized_score": 8.4
  },
  {
    "title": "Russia claims it has regained full control of Kursk from Ukraine",
    "domain": "general",
    "location": "global",
    "published": "Sat, 26 Apr 2025 21:41:18 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukraine denies Russian claims it has been forced out of the border region."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/977d/live/645a2660-22b5-11f0-9a6d-939f656e85b8.jpg",
    "titles": [
      "Russia claims it has regained full control of Kursk from Ukraine"
    ],
    "summary": "Ukraine has officially refuted Russian allegations suggesting that Ukrainian forces have been expelled from a border region. The current status of the situation, according to Ukraine, remains unchanged, with no ground lost to Russian forces in the disputed area.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the conflict between Russia and Ukraine, but doesn't provide deeper understanding or actionable insights.",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.961,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.512,
    "normalized_score": 8.35
  },
  {
    "title": "Huge blast at key Iranian port kills 14 and injures more than 750",
    "domain": "general",
    "location": "global",
    "published": "Sat, 26 Apr 2025 21:19:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A private security firm said it believed the affected containers had contained solid fuel destined for ballistic missiles."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1955/live/72ae71d0-2292-11f0-9060-674316cb3a1f.png",
    "titles": [
      "Huge blast at key Iranian port kills 14 and injures more than 750"
    ],
    "summary": "A private security firm reported that the containers involved in a recent incident were believed to contain solid fuel intended for ballistic missiles. The firm's analysis suggests a connection between the contents of the containers and missile development activities.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story reports on a tragic event but doesn't provide context or actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.956,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.479,
    "normalized_score": 6.65
  },
  {
    "title": "2025 NFL Draft picks by team: Full list of all 257 picks, plus every selection for each of the 32 franchises",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 00:23:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The NFL Draft has come and gone"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/24/7756758c-26d4-4ced-acdb-562e2ec76daf/nfl-draft-2025.jpg",
    "titles": [
      "2025 NFL Draft picks by team: Full list of all 257 picks, plus every selection for each of the 32 franchises"
    ],
    "summary": "The NFL Draft has concluded. This event, where NFL teams select eligible college football players to join the league, is an annual key moment in shaping team rosters for the upcoming season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the NFL Draft, which could influence fans' understanding and expectations for the upcoming season.",
    "score_components": {
      "magnitude": 0.1,
      "recency": 0.999,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.41,
    "normalized_score": 3.09
  },
  {
    "title": "Cincinnati Bearcats guard Luke Kandra",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 00:20:51 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cincinnati Bearcats guard Luke Kandra"
    ],
    "image_url": "",
    "titles": [
      "Cincinnati Bearcats guard Luke Kandra"
    ],
    "summary": "Cincinnati Bearcats guard Luke Kandra has been reported in multiple news sources regarding his status with the team. The specific details about his condition, reasons for any changes in status, or achievements were not provided in the information given. Without these details, a comprehensive summary cannot be accurately formulated. For the most current and detailed information, please refer to the latest reports from reliable sports news outlets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "The story lacks specific details about Luke Kandra's status with the team, providing no value or takeaway for the reader.",
    "score_components": {
      "magnitude": 0.1,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35,
    "normalized_score": 0.0
  },
  {
    "title": "After making a run, Nelly Korda makes back-to-back double bogeys to fall out of Chevron contention",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 00:18:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nelly Korda was moving up the leaderboard Saturday at the Chevron Championship until a disastrous double-double dropped her out of contention."
    ],
    "image_url": "",
    "titles": [
      "After making a run, Nelly Korda makes back-to-back double bogeys to fall out of Chevron contention"
    ],
    "summary": "Nelly Korda was advancing in the rankings at the Chevron Championship on Saturday but experienced a significant setback after scoring double bogeys on consecutive holes. This resulted in her falling out of contention for the title.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Nelly Korda's performance at the Chevron Championship, but doesn't provide deeper insights or context.",
    "score_components": {
      "magnitude": 0.1,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.4,
    "normalized_score": 2.58
  },
  {
    "title": "2025 NFL Draft winners and losers: Shedeur Sanders falls into both categories, Tom Brady makes the list",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 00:17:44 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "John Breech looks at the winners and losers from the full three days of the draft"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/27/e8376116-308b-48d6-bcaf-f95e0b5e82aa/shedeur-7g.jpg",
    "titles": [
      "2025 NFL Draft winners and losers: Shedeur Sanders falls into both categories, Tom Brady makes the list"
    ],
    "summary": "John Breech analyzed the outcomes of the three-day draft, identifying which teams and individuals emerged as winners and losers. This comprehensive review offers insights into the draft's impact on various participants, though specific details on the winners and losers were not provided in the summary content.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful analysis of the NFL Draft, informing readers about the outcomes for different teams and players.",
    "score_components": {
      "magnitude": 0.1,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.41,
    "normalized_score": 3.09
  },
  {
    "title": "2025 NFL draft: What Utah ties have signed as free agents after going undrafted?",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 00:17:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Here’s where locals that were not selected in this year’s draft are signing or earning mini-camp invites, along with a full list of Utah ties who were drafted."
    ],
    "image_url": "",
    "titles": [
      "2025 NFL draft: What Utah ties have signed as free agents after going undrafted?"
    ],
    "summary": "Local athletes from Utah who were not picked in this year's draft are signing contracts or receiving invitations to mini-camps. Additionally, a comprehensive list of players with Utah connections who were drafted has been released, showcasing the range of talent emerging from the area.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about local athletes from Utah, contributing to readers' understanding of the NFL Draft.",
    "score_components": {
      "magnitude": 0.1,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.41,
    "normalized_score": 3.09
  },
  {
    "title": "Republicans plan to scrap US audit regulator",
    "domain": "business",
    "location": "global",
    "published": "Sat, 26 Apr 2025 22:47:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Proposal to fold the Public Company Accounting Oversight Board into the SEC will boost Donald Trump’s deregulatory agenda"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F0756c4df-4d05-422d-8fce-d3191e97603b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Republicans plan to scrap US audit regulator"
    ],
    "summary": "A proposal has been made to integrate the Public Company Accounting Oversight Board (PCAOB) into the Securities and Exchange Commission (SEC). This move is seen as aligning with Donald Trump's broader agenda to reduce regulatory burdens.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful context about a proposal to integrate the PCAOB into the SEC, informing readers about potential changes in regulatory oversight.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.977,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.534,
    "normalized_score": 9.48
  },
  {
    "title": "China seizes disputed reef in the South China Sea",
    "domain": "business",
    "location": "global",
    "published": "Sat, 26 Apr 2025 18:13:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sandy Cay is just kilometres from the Philippines’ military outpost at Thitu Island"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb334dd7d-601a-40de-a6f9-f5c2488e68f2.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "China seizes disputed reef in the South China Sea"
    ],
    "summary": "Sandy Cay, located just kilometers away from Thitu Island, is in close proximity to a military outpost of the Philippines. This geographical detail highlights the strategic position of Sandy Cay in relation to Philippine military interests.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a territorial dispute in the South China Sea, but lacks depth or actionable insights.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.913,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.494,
    "normalized_score": 7.42
  },
  {
    "title": "Unrealistic to shift all U.S. iPhone assembly to India, Apple bear Craig Moffett writes to clients",
    "domain": "business",
    "location": "national",
    "published": "Sat, 26 Apr 2025 18:05:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Craig Moffett of MoffettNathanson reacts to the report Apple was aiming to shift production toward India."
    ],
    "image_url": "",
    "titles": [
      "Unrealistic to shift all U.S. iPhone assembly to India, Apple bear Craig Moffett writes to clients"
    ],
    "summary": "Craig Moffett, from MoffettNathanson, responded to reports that Apple intends to move some of its production to India. This move is part of Apple's strategy to diversify its manufacturing base beyond China. Moffett's reaction indicates that this shift could have significant implications for Apple's supply chain and global production strategy.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful context about Apple's production strategy, potentially influencing investor decisions.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.911,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.444,
    "normalized_score": 4.85
  },
  {
    "title": "Warren Buffett's top stock picks and Berkshire Hathaway come with 15% income bonus in this new fund",
    "domain": "business",
    "location": "national",
    "published": "Sat, 26 Apr 2025 17:05:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new ETF gives investors access to Warren Buffett's top stock holdings and Berkshire Hathaway shares, with an extra income-producing options strategy."
    ],
    "image_url": "",
    "titles": [
      "Warren Buffett's top stock picks and Berkshire Hathaway come with 15% income bonus in this new fund"
    ],
    "summary": "A newly launched ETF offers investors the opportunity to invest in a portfolio that mirrors Warren Buffett's top stock picks and includes shares of Berkshire Hathaway. Additionally, the ETF employs an income-generating options strategy to enhance returns.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights a new investment opportunity, providing empowering knowledge for potential investors.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.897,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.444,
    "normalized_score": 4.85
  },
  {
    "title": "Trump floats tougher Russia sanctions, meets Zelenskyy for first time since Oval Office blowup",
    "domain": "business",
    "location": "national",
    "published": "Sat, 26 Apr 2025 16:55:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "President Donald Trump's Truth Social post comes as he ramps up pressure on Russia and Ukraine to strike a deal to end their war."
    ],
    "image_url": "",
    "titles": [
      "Trump floats tougher Russia sanctions, meets Zelenskyy for first time since Oval Office blowup"
    ],
    "summary": "President Donald Trump has increased pressure on Russia and Ukraine, urging both countries to reach an agreement to end their ongoing conflict. He conveyed this message through a post on his Truth Social platform.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about President Trump's stance on Russia and Ukraine, potentially influencing readers' understanding of international politics.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.895,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.42,
    "normalized_score": 3.61
  },
  {
    "title": "Less intensive farming works best for agricultural soil",
    "domain": "science",
    "location": "global",
    "published": "Fri, 25 Apr 2025 23:05:26 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The less intensively you manage the soil, the better the soil can function. Such as not plowing as often or using more grass-clover mixtures as cover crops. Surprisingly, it applies to both conventional and organic farming."
    ],
    "image_url": "",
    "titles": [
      "Less intensive farming works best for agricultural soil"
    ],
    "summary": "Research indicates that minimal soil management improves its functionality, benefiting both conventional and organic farming practices. Techniques include reduced plowing frequency and the use of grass-clover mixtures as cover crops. This approach enhances soil health across different farming methods.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "The story clearly highlights research findings about farming practices, providing empowering knowledge that could influence agricultural decision-making.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.647,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.472,
    "normalized_score": 6.29
  }
]