[
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:07:53 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Washington Post",
      "The Guardian",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Gustavo Petro told US soldiers to \"disobey Trump's orders\" while addressing a protest in New York.",
      "The US says it will revoke the visa of Colombian President Gustavo Petro, who urged US soldiers to disobey Trump.",
      "The Colombian leader was filmed joining thousands of pro-Palestinian protesters outside UN headquarters in New York.",
      "The left-wing Colombian president is a critic of Trump and vocally opposes Israel's operation in Gaza. Petro is in New York for the UN General Assembly and had called on US soldiers to disobey Trump.",
      "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for h",
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5875/live/f9f37d30-9b6d-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "US revokes Colombian president's visa over 'reckless and incendiary' remarks",
      "US to revoke Colombian President’s visa after Gaza protest speech",
      "US to revoke Colombian President Petro’s visa over call to ‘disobey’ Trump",
      "Gustavo Petro: US to revoke visa of leftist Colombian leader",
      "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "State Department revokes visa for Colombian President Gustavo Petro",
      "U.S. Says It Will Revoke Colombian President’s Visa"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.919,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "West Ham Fires Coach Potter, Nuno Espirito Santo to Take Over",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 11:59:18 GMT",
    "source": "BBC",
    "sources": [
      "CBS Sports",
      "The Guardian",
      "ESPN",
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.cbssports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "West Ham are set to appoint former Nottingham Forest boss Nuno Espirito Santo  after sacking head coach Graham Potter just two days before they face Everton.",
      "Graham Potter has been fired by West Ham after a dismal start to the season, and sources have told ESPN that Nuno Espirito Santo will replace him.",
      "Nuno was replaced at Nottingham Forest by Ange Postecoglou following a falling out with management",
      "West Ham are set to appoint former Nottingham Forest boss Nuno Espirito Santo after sacking head coach Graham Potter just two days before they face Everton.",
      "<ul><li><p>West Ham lost opening three home league games</p></li><li><p>Former Nottingham Forest manager in the frame</p></li></ul><p>Graham Potter has been sacked by West Ham five games into the league season and after only nine months in the job.</p><p>The former Chelsea and Brighton manager was r"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6e0e/live/fadf3690-9b8a-11f0-96fc-07d17b5e3a9f.jpg",
    "titles": [
      "Nuno set to take over at West Ham after Potter sacking",
      "West Ham fires Potter; sources say Nuno hired",
      "West Ham sack Graham Potter: Hammers set to turn to Nuno Espirito Santo in attempt to turn season around",
      "Nuno set to take over at West Ham after Potter sacking",
      "West Ham line up Nuno as manager as Graham Potter is sacked after nine months in charge"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.976,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "West Ham has dismissed head coach Graham Potter after a disappointing start to the season, including losing their first three home league games. Nuno Espirito Santo, previously with Nottingham Forest, is set to replace him. This change comes just two days before West Ham's match against Everton. Potter was fired five games into the league season, having served for nine months.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk, Thiel, Bannon Named in Event Document; Musk Declined Invitation",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 03:39:38 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "CNBC",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "More documents related to the late convicted paedophile Jeffrey Epstein have been released by lawmakers in the US.",
      "One calendar entry, dated December 6, 2014, reads: &#039;Reminder: Elon Musk to island Dec. 6 (is this still happening?)&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOWnljQzJ2czNBZjBYNGtWTFdOd0c5N2QtSnpFZzVZNDZ2cDZ3dlhJTVllY3pQbHlCbktVaW43Y1ljQVA2VEhXNExOTVpjVkhtNkk5dU1HOWt1M2Q1WVJCVXBzVDFzM0tEaDNKZ2hkWGRJVEJQWXF0c1lPbFBCTEdCUnpEX3BDSHlG?oc=5\" target=\"_blank\">Elon Musk, Peter Thiel and Steve Bannon nam",
      "In partially redacted files released by House Democrats appeared the names of Elon Musk, Peter Thiel and Steve Bannon.",
      "<p>Prince Andrew and Steve Bannon also referenced in six-page batch of documents made public with redactions</p><p>Democratic lawmakers on Friday released documents from the investigation into Jeffrey Epstein that may show interactions between the disgraced financier and prominent conservatives, inc"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e42/live/89472f60-9b53-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Elon Musk and Prince Andrew named in new Epstein files",
      "Elon Musk, Peter Thiel, Steve Bannon among names in new Epstein documents",
      "Elon Musk, Peter Thiel and Steve Bannon named in Epstein files released by Democrats - Axios",
      "Musk, Thiel, Bannon named in partially redacted Epstein documents released by Democrats",
      "Elon Musk and Peter Thiel mentioned in Epstein documents released by Democrats"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.82,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.793,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk, along with Peter Thiel and Steve Bannon, were named in a document related to a scheduled event on an island on December 6. However, Musk, the Tesla executive, has previously stated that he declined invitations to such events.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sinclair, Nexstar End Boycott of \"Jimmy Kimmel Live!\", Resume Airing",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 06:49:57 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios",
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com",
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQcS1vVldJUUsyYmtBTXdWS1FtQllsaWhPMHB1Z0lLc18zMGlvTzVGTVRXQlpGTlBlYmpIX1YyUEpRS01RRFBqbzNSTS1Qb3h2QXVnN2JkcUI3bUxNaTZwdXdHV3V4QTdITV9NUUFoRVJ5YVotQmZQVnR1RlczQzJXdUhRVQ?oc=5\" target=\"_blank\">Jimmy Kimmel to return to Nexstar and Sinclair's ",
      "Broadcast station owners Sinclair and Nexstar will begin airing \"Jimmy Kimmel Live!\" after three days of preempting the program since its return.",
      "Local-television giants Sinclair Inc. and Nexstar Media Group Inc. said Friday that they were ending their boycott of late-night talk-show host Jimmy Kimmel’s program, returning “Jimmy Kimmel Live!” to the companies’ ABC affiliate stations.",
      "Sorry, Brendan Carr: Sinclair and Nexstar stop preempting Kimmel on ABC affiliates."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel to return to Nexstar and Sinclair's ABC affiliates Friday - Axios",
      "Sinclair, Nexstar will bring 'Jimmy Kimmel Live' back to owned ABC stations on Friday",
      "Sinclair, Nexstar end boycott of Jimmy Kimmel show",
      "Sinclair gets nothing it asked for, puts Jimmy Kimmel back on anyway"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.876,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sinclair Broadcast Group and Nexstar Media Group have ended their boycott of \"Jimmy Kimmel Live!\", agreeing to resume airing the late-night show on their ABC affiliate stations starting Friday night. This decision comes after a three-day preemption that left approximately 25% of US TV viewers unable to watch the program.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fugitive Assata Shakur Dies in Cuba at 78",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 18:26:35 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Assata Shakur, a Black liberation activist who was given political asylum in Cuba after her 1979 escape from a U.S. prison, has died. Officials in New Jersey, where Shakur had been arrested, convicted and imprisoned, said she was 78.",
      "Assata Shakur had lived in exile in Cuba since 1979, after escaping a prison sentence for killing a police officer.",
      "<p>Shakur spent decades exiled after she was convicted of killing a state trooper in 1977 and escaped from prison</p><p>On 25 September, Assata Shakur, a former member of the Black Liberation Army, died aged 78 in Havana, Cuba, according to <a href=\"https://cubaminrex.cu/es/nota-de-prensa-del-minist",
      "Convicted of murdering a New Jersey state trooper, she escaped prison and fled the country. She called herself “a 20th-century escaped slave.”"
    ],
    "image_url": "",
    "titles": [
      "Assata Shakur, a fugitive Black militant sought by the U.S. since 1979, dies in Cuba",
      "Assata Shakur: Fugitive Black activist dies in exile in Cuba",
      "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
      "Assata Shakur, Black Power militant who fled to Cuba, dies at 78"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.751,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.764,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Assata Shakur, a fugitive and former member of the Black Liberation Army who was convicted of killing a state trooper in 1977 and escaped from a US jail in 1979, has died at the age of 78 in Havana, Cuba. Shakur, also known by her legal name Chesimard and mentioned in Public Enemy's 1988 song \"Rebel Without a Pause,\" spent decades in exile after fleeing to Cuba.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Leads USA 5.5-2.5 After Ryder Cup Day 1 at Bethpage Black",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 07:23:26 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Europe has a three-point after the first day of the Ryder Cup. Can the U.S. mount a comeback at Bethpage Black?",
      "Europe leads 5.5-2.5 after the first day. Relive the best highlights from Round 1 right here.",
      "Find out where to watch the second day of action at the 45th Ryder Cup live from Bethpage Black in New York",
      "Bradley hopes sticking with mostly the same players will lead the Americans to a significant comeback at the 2025 Ryder Cup",
      "<p>⛳ Ryder Cup updates from Bethpage Black</p><p>⛳ <a href=\"https://www.theguardian.com/sport/2025/sep/26/tommy-fleetwood-jon-rahm-rory-mcilroy-ryder-cup-europe-usa\">Ewan Murray’s day-one report</a> | <a href=\"https://www.theguardian.com/sport/2025/sep/25/bethpage-black-hole-by-hole-course-guide-202"
    ],
    "image_url": "",
    "titles": [
      "Ryder Cup 2025: Best moments from Day 2",
      "Ryder Cup 2025 best moments: U.S. trails Europe after Day 1",
      "How to watch Ryder Cup 2025: TV schedule, tee times, live stream Saturday, watch online coverage on Day 2",
      "2025 Ryder Cup schedule, matchups: Keegan Bradley surprises with pairings for Saturday foursomes on Day 2",
      "Ryder Cup 2025: day two – live"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Europe took a significant three-point lead over the USA, with a score of 5.5-2.5, after the first day of the Ryder Cup at Bethpage Black in New York. Key players for Europe, including Tommy Fleetwood, Rory McIlroy, and Jon Rahm, did not lose a match, contributing to their team's lead. Despite a missed shot by McIlroy in the evening, the European team ended the day ahead, having won both the foursomes and fourballs sessions, marking their first lead on American soil at the end of the opening day of the Ryder Cup in 21 years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pickard Shuts Out Jets 4-0, Oilers Shine in Pre-Season Victory",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 04:27:59 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Calvin Pickard had a 21-save shutout as the Edmonton Oilers defeated the Winnipeg Jets 4-0 on Friday night in NHL pre-season action.",
      "Domenic DiVincentiis stopped 16 shots as the Jets dropped their third straight pre-season game.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNUF9mZlB0Z0R5WUpiYTFjY2ZfTEJ1UXQzVkludHVpSHJreFM0U1pGaUloazQyRWRjUmdraXVnWFVqWkdBMTl4V0NESUtyYm9Tbkhzc3JaMVA0M3pCNk9fc2IxYkJCMldmY1huc1RObnJOSVJvSGIzUGdHMlRubUFzOWpYRnJBWEpYa2c?oc=5\" target=\"_blank\">PROJECTED LINEUP: Oilers vs. Jets (Prese",
      "<p>Suddenly, there are only three pre-season games remaining. Noah Philp, David Tomasek and Josh Samanski did their best to make a case to stay with the Oilers in a 4-0 win over the Jets on Friday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/89d362b4acddbb53a44f10d6c4416ab03e0390b2d363dcb9f155d8fd2f5009d2.jpg?quality=65&strip=all",
    "titles": [
      "Oilers blank Jets 4-0 in pre-season action",
      "Winnipeg Jets lose 4-0 in Edmonton in third pre-season game",
      "PROJECTED LINEUP: Oilers vs. Jets (Preseason) - NHL.com",
      "Oilers takeaways: Edmonton hopefuls step up in pre-season win over Jets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Calvin Pickard led the Edmonton Oilers to a 4-0 victory over the Winnipeg Jets with a 21-save shutout in NHL pre-season action on Friday. Domenic DiVincentiis made 16 saves for the Jets, who suffered their third consecutive pre-season loss. With only three pre-season games left, players Noah Philp, David Tomasek, and Josh Samanski aimed to secure their spots on the Oilers' roster through their performance in the win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran Recalls Ambassadors from E3 Over Nuclear Sanctions Move",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 08:31:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The E3 countries triggered the mechanism one month ago to reimpose sanctions, which come into effect on Sunday.",
      "DUBAI, United Arab Emirates (AP) — Iran recalls its ambassadors from France, Germany and the United Kingdom ahead of U.N. nuclear sanctions being reimposed. The Associated Press",
      "As Iran braces for potential sanctions, it has recalled its ambassadors to Germany, France and the UK. Meanwhile, Lebanon's Hezbollah group marks the first anniversary of the killing of its leader Nasrallah. Follow DW."
    ],
    "image_url": "",
    "titles": [
      "Iran recalls envoys to UK, France, Germany as UN sanctions reimposed",
      "Iran recalls its ambassadors from France, Germany and the United Kingdom ahead of U.N. nuclear sanctions being reimposed",
      "Iran summons European envoys ahead of expected sanctions"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.927,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Iran has recalled its ambassadors from France, Germany, and the UK in response to the E3 countries triggering a mechanism to reimpose U.N. nuclear sanctions, set to take effect on Sunday. This move comes as Iran prepares for the potential impact of these sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Sanctions on Iran to Be Reimposed After Russian-Chinese Bid Fails",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 23:52:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "All UN sanctions on Iran are set to be reimposed on Saturday after a Russian-Chinese bid to delay them failed.",
      "Rebuffed by the Trump administration, Iran failed Friday in a last-ditch effort to prevent the “snapback” of global sanctions that were lifted as part of the 2015 nuclear deal.",
      "The unsuccessful bid to put off the sanctions for six months over Iran’s nuclear program means they would go into effect early Sunday in Iran."
    ],
    "image_url": "",
    "titles": [
      "UN sanctions on Iran set to return after failed delay bid",
      "U.N. to reimpose sanctions on Iran after weeks of failed diplomacy",
      "Russia and China Fail to Delay U.N. ‘Snapback’ Sanctions Against Iran Over Nuclear Program"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UN sanctions on Iran, lifted under the 2015 nuclear deal, are set to be reimposed early Sunday after a Russian-Chinese bid to delay them failed. The Security Council voted against the delay, and Iran's last-ditch effort to prevent the sanctions' \"snapback\" was unsuccessful. This development follows the Trump administration's rebuff of Iran's attempts to avoid these sanctions over its nuclear program.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers' Barkov Undergoes Knee Surgery, Could Miss Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 19:30:00 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Florida Panthers captain Aleksander Barkov is expected to miss seven to nine months after having surgery to address ACL and MCL injuries to his right knee, the team announced Friday.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQcFJ3V25ndVNpZWxPSGQxVDF5c09kNTY5a2UwM0RlQ0l5RmVfTGlDMDFNVW1fUC1jWXVvVkJPbGxnRmVTWDRnNGtIanVSSUcxbmhMMlNKUFp6YXlYWWZtVHkyeW5QZUtlTU1jeGtxUVBkN2xuX1RhWWVScEttZERtYUwzbFNnN2s1LTR2SDluNkUwSGN0OEQ3WVFHUQ?oc=5\" target=\"_blank\">Barkov out 7-9 mo",
      "<p>The Florida Panthers could be without their captain for the entire season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers star Barkov has surgery on ACL, MCL",
      "Barkov out 7-9 months for Panthers following ACL, MCL surgery - NHL.com",
      "Panthers captain Aleksander Barkov has knee surgery, could miss season"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.768,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Florida Panthers captain Aleksander Barkov underwent knee surgery and may miss the entire regular season. This leaves the team without their leader for potentially the whole season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Calls for Firing of Microsoft Exec Lisa Monaco Over Biden Ties",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 23:52:11 GMT",
    "source": "Axios",
    "sources": [
      "The Verge",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1RaVR3bjljR29POWhyZ1hONlY1XzB0RktWN1J3d1o1anE3ZHdhbDZXZ1VlbDV3VWFJTUMtdFRteFo4WDlqOHBMYmxoeWdtTzN3VkliRDlBYU91OWhOUGFmMlZzd0dVcE5ZNzlNRg?oc=5\" target=\"_blank\">Trump demands Microsoft oust global affairs chief over Biden-era ties</a>&nbsp;&n",
      "Fox Business anchor Maria Bartiromo brought up Monaco's position at Microsoft during her show. The appointment happened in July.",
      "After successfully manipulating Intel CEO Lip-Bu Tan and eventually failing to cancel Jimmy Kimmel, President Donald Trump has named his next target for retribution: Microsoft head of global affairs Lisa Monaco. He’s calling for her to be fired. On Truth Social, Trump claims that Monaco, who just to"
    ],
    "image_url": "",
    "titles": [
      "Trump demands Microsoft oust global affairs chief over Biden-era ties - Axios",
      "Trump calls for the firing of Lisa Monaco, Microsoft president of global affairs",
      "Trump’s new target: Microsoft head of global affairs Lisa Monaco"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.758,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump called for the firing of Microsoft's President of Global Affairs, Lisa Monaco, on Truth Social. Trump's demand comes after Monaco's appointment in July, citing her ties to the Biden era. This move follows Trump's previous attempts to influence corporate leadership, including Intel CEO Lip-Bu Tan and a failed effort to cancel Jimmy Kimmel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx Coach Reeve Blasts Officiating, Calls It \"Malpractice\" After Ejection",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 02:44:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ejected late in Game 3, Lynx coach Cheryl Reeve was critical of the officials Friday night, saying it was \"malpractice\" to have them work a semifinal playoff game.",
      "<p>Minnesota Lynx head coach Cheryl Reeve speaks out against the league leadership and playoff officiating after superstar Napheesa Collier sustained an injury in loss to Phoenix Mercury. </p>"
    ],
    "image_url": "",
    "titles": [
      "Lynx's Reeve blasts refs after Collier hurt in loss",
      "Reeve calls out leadership, refs for ‘malpractice’ after Collier injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minnesota Lynx head coach Cheryl Reeve criticized the officiating after being ejected from Game 3 of the semifinals, labeling it \"malpractice.\" Her comments followed a loss to Phoenix Mercury, where Lynx star Napheesa Collier was injured. Reeve's critique targets both the game officials and league leadership for the handling of the playoff game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Wins Overtime Thriller Against Minnesota in WNBA Semifinals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 23:51:00 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "In the 2025 WNBA semifinals, Phoenix leads 1-seed Minnesota 2-1 while Las Vegas is up 2-1 over Indiana.",
      "We're down to the final four in the 2025 WNBA playoffs",
      "The series shifts to Phoenix for a pivotal Game 3 on Friday",
      "The best-of-five series is all square at 1-1 heading into Friday night's Game 3"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Mercury take 2-1 lead over Lynx, Aces up 2-1 over Fever",
      "WNBA playoff bracket, where to watch: Schedule, scores, TV channel for Fever vs. Aces, Mercury vs. Lynx",
      "Lynx vs. Mercury schedule: Game times, where to watch and what to know about WNBA playoff semifinals",
      "Aces vs. Fever schedule: Game times, where to watch and what to know about WNBA playoff semifinals"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.841,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In the 2025 WNBA semifinals, Phoenix defeated Minnesota in an overtime match that was hailed as an instant classic. Despite this loss, Minnesota aims to secure a 2-0 series lead in their next game on Tuesday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mbeumo Returns to Brentford with Man Utd for First Time Since Transfer",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:40:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "onefootball.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A special match for Bryan Mbeumo in the PLBryan Mbeumo/@BBCHaving transferred this summer from Brentford to Manchester United, Bryan Mbeumo is set to make his return to the Gtech Community Stadium, wh...",
      "<p>⚽ Premier League updates from 12.30pm BST</p><p>⚽ <a href=\"https://www.theguardian.com/football/2025/sep/26/premier-league-10-things-to-look-out-for-this-weekend\">Ten things to look out for this weekend</a> | <a href=\"mailto:barry.glendenning@theguardian.com\">Email Barry</a></p><p><strong>Ruben A"
    ],
    "image_url": "",
    "titles": [
      "Premier League: Brentford-Manchester United, a special match for Bryan Mbeumo",
      "Brentford v Manchester United: Premier League – live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bryan Mbeumo, having moved from Brentford to Manchester United this summer, is set to make his return to the Gtech Community Stadium in a Premier League match. This marks a special occasion for Mbeumo as he faces his former team for the first time since transferring.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamine Yamal Fit for Selection, Confirms Barcelona Coach Flick",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:38:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "onefootball.com",
      "news.google.com"
    ],
    "snippets": [
      "Barcelona head coach Hansi Flick has provided an update on the wellbeing of attacking star Lamine Yamal.This comes amid confirmation that the 18-year-old is back available for selection.Wide-man Lamin...",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxNMnFuaGxMeDNFWVdoNHI1OEs1d1UwNFpkX3dIU0FDZlladVVlN3lMemxqOGFYeXFLMzA5bXVsektRRV9wNGNxTFhtcFpxU1pNRFRaSWs4Wldzb09ybzkwbHdabG9LR2tzb25YdHEtS1ZYVTBZT0hGQ1NmZ2lZZXVLVDFjMmlYb1BPT18xVWppaF8?oc=5\" target=\"_blank\">Hansi Flick Sent Blunt Message O"
    ],
    "image_url": "",
    "titles": [
      "Hansi Flick provides Lamine Yamal injury update before Barcelona vs Real Sociedad",
      "Hansi Flick Sent Blunt Message Over Lamine Yamal Injury Complaints - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Barcelona's head coach, Hansi Flick, has confirmed that 18-year-old attacking star Lamine Yamal is back available for selection. This update indicates Yamal has recovered from his previous condition and is ready to rejoin the team for upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iraq Resumes Northern Oil Exports After 2-Year Halt, Aiming to Boost Global Supp",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:57:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "Control over lucrative exports was a major point of contention between Baghdad and Kurdistan region.",
      "Iraq resumed oil exports from its northern region Saturday after a more than two-year halt, adding supply to a global market that’s widely expected to move into a heavy surplus."
    ],
    "image_url": "",
    "titles": [
      "Iraq resumes Kurdish oil exports to Turkiye after two-and-a-half-year halt",
      "Iraq Resumes Kurdistan Oil Exports After Halt of Two Years"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Iraq restarted oil exports from its northern region on Saturday after a stoppage exceeding two years, resolving a dispute over export control with the Kurdistan region. This move aims to increase supply in a global market anticipated to face a significant surplus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Women Die Crossing Channel to Britain in Makeshift Boat",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:54:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Authorities say the pair died off the coast of northern France after about 100 people set off by makeshift boat.",
      "<p>French authorities say about 100 people were attempting to reach the UK on a makeshift boat</p><p>Two women have died while trying to cross the Channel to Britain, French authorities said.</p><p>The incident occurred south of the beaches of Neufchâtel-Hardelot, where about 100 people were trying "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9fb/live/b3e81c80-9b8e-11f0-bdeb-9de9348d5d1d.jpg",
    "titles": [
      "Two women die during failed Channel crossing attempt",
      "Two women die trying to cross Channel from France"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two women died attempting to cross the Channel to Britain in a makeshift boat, according to French authorities. The incident involved around 100 people and occurred south of Neufchâtel-Hardelot, off the coast of northern France.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Backs Trump, Allows $5bn Foreign Aid Freeze",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 19:06:30 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "The court's majority said Trump's foreign policy authority outweighed the harms claimed by the international aid groups suing.",
      "The $4 billion aid package was appropriated by the US Congress. The conservative-majority court said the freeze may continue, with the three liberal justices in dissent."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to withhold $4 billion in foreign aid",
      "US Supreme Court allows Trump's massive foreign aid freeze"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.762,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court ruled in favor of Donald Trump's administration, allowing it to keep nearly $5bn in foreign aid frozen, marking another victory for Trump in disputes over presidential power. The court decided Trump's foreign policy authority was more significant than the harms claimed by suing international aid groups. This decision overrides a lower court's order to disburse the congressionally approved aid before its expiration.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T10:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "<p>Unidentified drones spotted at several military sites including the Karup airbase on Friday night </p><p>Unidentified drones flew over Danish military sites including its biggest base during Friday night, the latest in a slew of sightings officials have called a “hybrid attack” and hinted at poss"
    ],
    "image_url": "",
    "titles": [
      "Denmark: New drone sightings over military infrastructure",
      "Denmark reports new drone sightings over its biggest military base"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova Court Bans Pro-Russia Party from Election Over Alleged Misconduct",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 22:39:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Moldova election rocked by bans on pro-Russian parties as EU path hangs in balance.",
      "The pro-Russia Heart of Moldova party was barred from the election after a court ruling limited the party's activities for one year, over allegations of voter bribery, illegal party financing and money laundering."
    ],
    "image_url": "",
    "titles": [
      "Moldova bans pro-Russian parties ahead of Sunday’s election",
      "Moldova bars pro-Russia party from parliamentary elections"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldova's election faced controversy as the pro-Russia Heart of Moldova party was banned from participating due to a court ruling. The court accused the party of voter bribery, illegal financing, and money laundering, restricting its activities for one year. This development has significant implications for Moldova's political direction and its potential path towards the EU.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Proposal Seeks to Clarify Social Security Benefit Claiming Ages\"",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 13:55:41 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Deciding when to claim Social Security retirement benefits is a big decision. A new proposal calls for changing the way those ages are described.",
      "The Claiming Age Clarity Act would change the wording on different benchmark ages to claim benefits."
    ],
    "image_url": "",
    "titles": [
      "Social Security's retirement age wording may change. Here’s what to know",
      "The new bill tweaking Social Security’s retirement-age language may be fixing the wrong problem"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.616,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A new proposal, the Claiming Age Clarity Act, aims to modify the terminology used to describe benchmark ages for claiming Social Security retirement benefits. This initiative seeks to provide clearer guidance on when individuals can access their benefits.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Calls Palestinian State \"Madness\"; Speaks to Mostly Empty Room",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-26T16:06:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "Israel's prime minister said it would be \"madness\" for Israel to allow a Palestinian state to be established. Many delegates left the room before Benjamin Netanyahu began his speech. DW has more.",
      "Defiant Israeli PM addressed mostly empty seats as he reiterated demands for Hamas to disarm and release hostages"
    ],
    "image_url": "",
    "titles": [
      "UNGA: Netanyahu rejects Palestinian state in fiery speech",
      "Netanyahu vows to prevent Palestinian state in UN address"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.658,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.587,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Benjamin Netanyahu stated that allowing a Palestinian state would be \"madness\" during a speech with many delegates exiting before he began. He also demanded that Hamas disarm and release hostages, addressing a largely empty room.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Chief Comey Indicted for False Statement, Obstruction",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 11:36:56 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The former FBI director has been indicted on charges of making a false statement and obstruction related to his testimony before the Senate Judiciary Committee in 2020.",
      "President Donald Trump gloated about the filing of criminal charges against James Comey, whom he fired as FBI director in 2017, in his first White House term."
    ],
    "image_url": "https://s.abcnews.com/images/US/250926_abc_soc_comey_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Former FBI Director James Comey reacts to indictment",
      "Former FBI Director James Comey indicted after Trump called for charges"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.652,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey was indicted for making a false statement and obstruction during his 2020 Senate Judiciary Committee testimony. This indictment was notably highlighted by President Donald Trump, who had previously dismissed Comey from his FBI position in 2017.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025-2026 DWU Challenges: High School Engineering, Middle School Aviation",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 26 Sep 2025 16:31:42 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "2025-2026 DWU: High School Engineering Challenge Challenge Materials Challenge Materials The 2025 Challenge Materials are coming soon. Register now to get copies as soon as they are released. Overview: What is an Uncrewed Aircraft System?&#160; An uncrewed aircraft system (UAS) can be defined as an ",
      "2025-2026 DWU: Middle School Aviation Challenge Challenge Theme AgAir: Integrating UAS into the Agriculture Industry The agricultural industry is an important part of life in the US and around the world by providing food, fuel, economic development, and more. It has been increasingly important to st"
    ],
    "image_url": "",
    "titles": [
      "2025-2026 DWU: High School Engineering Challenge",
      "2025-2026 DWU: Middle School Aviation Challenge"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.664,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The 2025-2026 DWU High School and Middle School Challenges focus on engineering and aviation, respectively. The High School Engineering Challenge materials are pending release, urging early registration. The theme for the Middle School Aviation Challenge is \"AgAir: Integrating UAS into the Agriculture Industry,\" highlighting the significance of uncrewed aircraft systems (UAS) in agriculture for food, fuel, and economic development. Participants are encouraged to explore the impact of UAS technology in the agricultural sector.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Studies Shed Light on Bigscale Pomfret and Gaslighting Mechanisms",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 13:12:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/what-is-the-bigscale-pomfret-scientists-unravel-secrets-of-an-oceanic-enigma/\" rel=\"nofollow\" title=\"What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma\"><img alt=\"Big Scale Pomfret\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"512\"",
      "<a href=\"https://scitechdaily.com/scientists-unravel-secrets-of-how-gaslighting-really-works/\" rel=\"nofollow\" title=\"Scientists Unravel Secrets of How Gaslighting Really Works\"><img alt=\"Marriage Problems Boyfriend Girlfriend Arguing\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma",
      "Scientists Unravel Secrets of How Gaslighting Really Works"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.62,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.402,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have conducted studies on the Bigscale Pomfret, revealing new insights into this oceanic species. In separate research, experts have also uncovered the mechanisms behind gaslighting, offering a deeper understanding of this psychological manipulation technique. Both studies contribute to our knowledge of marine biology and human behavior, respectively.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  }
]