[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff shared insights on a variety of items ranging from recent purchases to products they've owned for years, including smart tech, office tools, and kitchen gadgets. This collection showcases the diverse and long-term interests in gadgets among the staff."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9371408707754629,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44428521769386575,
    "summary": "The Verge staff discussed a range of products they've bought recently or have owned for years, highlighting their interest in various gadgets. The discussion covered smart technology, office equipment, and kitchen devices, reflecting the team's diverse and enduring gadget preferences."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale, coinciding with the start of warmer months, is currently underway and will continue until March 31, 2025. The event features significant discounts on a variety of items, including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.757349203587963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3993373008969907,
    "summary": "Amazon's Big Spring Sale is happening now through March 31, 2025, offering substantial discounts on items such as gardening supplies and bedding, in celebration of the warmer months ahead."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, offering a challenging yet rewarding experience. This version emphasizes precision, marking a significant achievement for the franchise in these gameplay aspects."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7061339253935185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3865334813483796,
    "summary": "Assassin's Creed Shadows introduces new advanced stealth and assassination mechanics, focusing on precision. This version marks a significant achievement in gameplay for the franchise, offering a challenging and rewarding experience."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is marketed as a gaming-centric alternative to the MacBook Pro, featuring a return to a thinner and lighter chassis design compared to its previous, bulkier generation. This model aims to blend gaming performance with the aesthetics of a conventional laptop."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6644672583333333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37611681458333335,
    "summary": "The Razer Blade 16 is presented as a gaming-focused laptop that offers a slimmer and lighter design than its predecessors, aiming to combine gaming capabilities with the sleek look of a traditional laptop, positioning itself as an alternative to the MacBook Pro."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor light, is a versatile, rechargeable work lamp offering 3000 lumens of brightness through three adjustable LED panels. It's designed for various settings, including campsites, workspaces, and more, due to its compact size and functionality as a flashlight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3805320727199074,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30513301817997684,
    "summary": "BougeRV has released a LED lantern designed for outdoor use, featuring 3000 lumens of brightness with three adjustable LED panels. This versatile, rechargeable lamp is suitable for various settings such as campsites and workspaces, and can also function as a flashlight due to its compact size."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) during ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.046770498240740754,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.22169262456018518,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction that stops the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) while legal proceedings are ongoing."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has announced that in the latest Windows 11 Insider Preview, it will remove a bypass script that previously allowed users to set up Windows 11 devices without an internet connection or logging into an account."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.042777442280092615,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.22069436057002315,
    "summary": "Microsoft will eliminate a bypass script in the latest Windows 11 Insider Preview, which previously let users set up the system without an internet connection or a Microsoft account."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently ongoing until March 31st, offering numerous deals on a wide range of products, accessible without an Amazon Prime membership. The sale includes over 100 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.03450197891203699,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.21862549472800924,
    "summary": "Amazon's Big Spring Sale is happening now through March 31st, featuring over 100 deals on a variety of products. These deals are available to all customers, not just Amazon Prime members, and include popular items as well as affordable alternatives."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X, previously known as Twitter, in an all-stock deal. Musk, who bought Twitter a few years ago for $44 billion, announced the transaction values xAI at $80 billion and X at $33 billion, which includes $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.02854133037037032,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.21713533259259257,
    "summary": "Elon Musk's AI company, xAI, has purchased the social media platform X (formerly Twitter) in an all-stock transaction. Musk, who previously acquired Twitter for $44 billion, values xAI at $80 billion and X at $33 billion, with the deal incorporating $12 billion of debt."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653), a feature aimed at enabling IT professionals to remotely recover Windows 11 devices that won't boot. This development comes as a response to prevent incidents similar to the previous year's Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.021157070717592652,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.21528926767939816,
    "summary": "Microsoft is testing a new feature called Quick Machine Recovery in the latest Windows Insider Preview build (6120.3653) for Windows 11. This tool is designed to help IT professionals remotely recover devices that cannot boot, a move to prevent issues like last year's Crowdstrike incident."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Search efforts for survivors are being significantly hindered by a severe shortage of equipment, inconsistent communication capabilities, and extensive damage to roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Search operations for survivors are facing major challenges due to a lack of necessary equipment, problems with communication, and widespread damage to infrastructure, particularly roads."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with the BBC, describing it as \"incredible\" that bombs were dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur condemned the military for dropping bombs during rescue operations in an interview with the BBC, highlighting the severity of the actions."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescue teams are actively engaged in extracting individuals from the debris of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescue teams are currently working to rescue people trapped in the rubble of a tower that collapsed on Friday."
  },
  {
    "title": "Pro-democracy protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 20:43:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Demonstrators rallied in support of opposition leader Ekrem Imamoglu, protesting his arrest which he claims is politically motivated."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Supporters of opposition leader Ekrem Imamoglu gathered for demonstrations against his arrest, which he alleges is based on political motives."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk in the Danish territory, Andrew Harding reports that many locals feel bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During a visit to Nuuk in the Danish territory, reporter Andrew Harding found that many locals feel bullied by the United States."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city resulted in 21 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city led to 21 people being injured and ignited a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya has temporarily closed its doors following reports from customers who discovered an insect and a rat in their meals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a dining establishment, has temporarily shut down after customers reported finding an insect and a rat in their food."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul announced that Ms. Hall is currently under the care of Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul stated that Ms. Hall is in the care of Qatari officials and is anticipated to return home shortly."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki faced criticism for wearing a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki was criticized for disguising himself to promote his book on TV."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase are not under Somalia's jurisdiction to be offered to others."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that Somalia does not have the authority to grant access to the Berbera port and airbase, as these are not under Somalia's jurisdiction."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of individuals who have disappeared in Antigua have expressed their distress during interviews with the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have shared their distress in interviews with the BBC, highlighting the emotional impact of their loved ones' disappearances."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence at the time of the pardon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year sentence, has been pardoned for health reasons."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to regulate diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation to scrutinize diversity and inclusion programs as part of a wider initiative to regulate these efforts."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed against a controversial influencer, accusing him of assault and making threats in Beverly Hills. The influencer has denied these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a controversial influencer of assault and making threats in Beverly Hills, which the influencer denies."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific website. The initiative aims to improve the visual content by replacing or enhancing the existing images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to improve the quality of photos, particularly of celebrities, on a certain website. The project focuses on either replacing or enhancing the current images to address issues with poor quality."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An earthquake's large magnitude and the extensive length of its fault line were significant factors in the resulting widespread devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A large-magnitude earthquake, along with its extensive fault line, caused widespread devastation."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing widespread destruction in the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices for cars have significantly increased, according to a car seller interviewed by the BBC, with expectations for further rises."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, as reported by a car seller to the BBC. There are expectations for further increases in prices."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the highest price achieved by the artist's work."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their performance while conducting an evacuation at a South Sudan military base, despite being attacked."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere globally. Some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers successfully carried 30-year-old Phyu Lay Khaing to safety on a stretcher, receiving cheers from onlookers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was safely rescued and carried on a stretcher, receiving applause from spectators."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed following a powerful earthquake in neighboring Myanmar, leaving dozens of people unaccounted for."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-story building that was under construction collapsed due to a powerful earthquake in neighboring Myanmar, resulting in dozens of people being reported missing."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that mutations in VPS35, a crucial element in a pathway that uses reactive oxygen species (ROS) to destroy cancer cells, may lead to chemotherapy resistance in some cancers. This finding could aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that mutations in VPS35, a key component in a pathway that employs reactive oxygen species (ROS) to eliminate cancer cells, may cause some cancers to resist chemotherapy. This discovery could help identify tumors that are resistant to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study reveals that over 50% of US adults have faced discrimination, significantly impacting mental health. Those highly exposed to discrimination are over five times more likely to show signs of depression and anxiety. Adults experiencing such mistreatment have almost nine times higher odds of screening positive for both mental health conditions compared to those without such experiences."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study indicates that over half of US adults have encountered discrimination, which greatly affects their mental health. Individuals highly exposed to discrimination are more than five times as likely to exhibit depression and anxiety symptoms. Furthermore, adults facing mistreatment have nearly nine times higher chances of testing positive for both mental health issues compared to those who have not experienced discrimination."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new 3D printed hydrogel designed for treating various types of meniscal tears showed promising results in preclinical trials. This customizable hydrogel could potentially offer a tailored solution for individuals with knee injuries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new customizable 3D printed hydrogel has shown promise in preclinical trials for treating different types of meniscal tears in the knee. This advancement could provide personalized treatment options for those with knee injuries."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study found that immersing in cold water for seven days boosts cellular resilience and autophagic function, enhancing cells' ability to handle stress. This adaptation may improve health, prevent diseases, and slow aging at the cellular level."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study discovered that seven days of cold water immersion enhances cellular resilience and autophagic function, which helps cells manage stress better. This adaptation could potentially improve overall health, prevent diseases, and decelerate aging at the cellular level."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Around one-third of women aged 14-49 in the US experience bacterial vaginosis (BV), marked by odors and discomfort, with over half not responding to initial antibiotic treatment. Researchers have now created a DNA PCR-based lab test to improve treatment by identifying the specific bacteria causing BV, aiming to enhance prescription accuracy for patients."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a DNA PCR-based lab test aimed at improving the treatment of bacterial vaginosis (BV), a condition affecting one-third of US women aged 14-49. The test identifies the specific bacteria responsible for BV, which is characterized by odors and discomfort. This innovation could lead to more accurate prescriptions for the over half of patients who do not respond to initial antibiotic treatments."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that red meat, enhanced with scent oils, is the most effective bait for capturing weasel images on camera traps. This finding is crucial for conservationists who struggle to monitor weasel populations due to their elusive nature."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that red meat treated with scent oils is the best bait for photographing weasels on camera traps. This discovery is important for conservationists aiming to monitor the hard-to-detect weasel populations effectively."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that can learn independently, closely mirroring biological neurons. These 'infomorphic neurons' form artificial neural networks that self-organize and adapt by gathering information from their network environment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created new artificial neurons, named 'infomorphic neurons', that can independently learn and adapt, similar to human neurons. These neurons form networks that self-organize by collecting information from their surroundings."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st off Cortes; win 20-9",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit nine home runs in a 20-9 victory over the Brewers, with four homers off Nestor Cortes in the first inning alone, during Saturday's game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In Saturday's game, the Yankees achieved a 20-9 win against the Brewers, marking a significant victory by hitting nine home runs, including four off pitcher Nestor Cortes in the first inning alone."
  },
  {
    "title": "Van Lith's 26-point day leads TCU past N. Dame",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "TCU's Hailey Van Lith scored 26 points, leading the Horned Frogs to a 71-62 victory against Notre Dame in the Sweet 16 round of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith of TCU scored 26 points, leading her team to a 71-62 win over Notre Dame in the Sweet 16 round of the women's NCAA tournament."
  },
  {
    "title": "Grizz GM: No player input on call to fire Jenkins",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Grizzlies General Manager Zach Kleiman made the decision to fire coach Taylor Jenkins without consulting any players on the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Grizzlies General Manager Zach Kleiman decided to terminate the employment of coach Taylor Jenkins. This decision was made without seeking input from any of the team's players."
  },
  {
    "title": "Sources: Kansas frosh Bidunga to enter portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kansas freshman Flory Bidunga plans to enter the transfer portal, according to information provided to the coaching staff, sources informed ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kansas freshman Flory Bidunga intends to enter the transfer portal, as reported to the coaching staff, according to sources cited by ESPN."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is declaring for the NBA draft and entering the transfer portal, according to his agent's statement to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, has decided to declare for the NBA draft and will also enter the transfer portal, as confirmed by his agent to ESPN."
  },
  {
    "title": "Paopao: South Carolina should be 'punching first'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "South Carolina guard Te-Hina Paopao emphasized the importance of a strong start for her team in the upcoming Elite Eight game against Duke, stating they need to \"punch first\" to avoid slow beginnings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "South Carolina guard Te-Hina Paopao stressed the significance of initiating the Elite Eight game against Duke with a strong start. She highlighted the team's need to \"punch first\" to prevent slow openings in the match."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trinity Rodman, a player for the US Women's National Soccer Team, has publicly stated that she believes her back problems will never completely heal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Trinity Rodman, a member of the US Women's National Soccer Team, has publicly stated that she expects her back problems to persist indefinitely, indicating that she believes the condition will not fully heal."
  },
  {
    "title": "Bills, CB Benford agree to 4-year, $76M extension",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:20:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Buffalo Bills have finalized a four-year contract extension with cornerback Christian Benford, valued at $76 million, according to his agents and reported by ESPN's Adam Schefter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Buffalo Bills have secured a four-year, $76 million contract extension with cornerback Christian Benford, as confirmed by his agents and reported by ESPN's Adam Schefter."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:36:59 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Friday night's sports action featured victories for Auburn and Houston, with detailed analysis available on their performances and strategies leading to their wins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, both Auburn and Houston secured victories in their respective sports matches. Detailed analyses of their games highlight the effective strategies and performances that contributed to their wins."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:38:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have been played. This phase of the tournament is a key part of the competition, determining which teams advance closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has advanced to the Sweet 16, with the first four games completed. This stage is crucial in deciding which teams move closer to winning the championship."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The content discusses the implications of various sports matchups, including their potential impact on playoff projections and draft lottery standings. It also provides updates on these aspects and more, related to the outcomes of the games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent sports matchups have influenced playoff projections and draft lottery standings, with outcomes affecting team rankings and future prospects. Updates on these developments highlight the significant impact of game results on teams' positions within their leagues."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on the team standings, with the results and each team's schedule up to April 17 now available for review."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's outlook is now clearer after a panel voted on team standings, with the results and each team's schedule until April 17 made public for review."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, leading to a focus on future team building, including portal priorities and incoming recruits, as they look ahead to next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded, shifting the team's attention to future development through transfer portal priorities and recruiting new players for the upcoming season."
  },
  {
    "title": "Three-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:18:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 2024-25 NBA season has seen a record-breaking number of 3-point shot attempts, raising questions about whether the league should limit the use of 3-pointers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The 2024-25 NBA season has set a new record for the number of 3-point shot attempts. This surge in 3-pointers has sparked a debate on whether the NBA should implement restrictions on their use."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting lines, spreads, totals, and Basketball Power Index (BPI) ratings have been released for every game in the Women's basketball tournament, providing detailed forecasts and expectations for each matchup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting lines, spreads, totals, and Basketball Power Index (BPI) ratings for every game in the Women's basketball tournament have been released, offering detailed forecasts and expectations for each matchup."
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:34:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's UFC Fight Night has garnered predictions from both an MMA coach and a betting insider, each making their picks on who they believe has the upper hand in the upcoming fights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This week's UFC Fight Night has sparked interest, with an MMA coach and a betting insider sharing their predictions on the fighters they think will win."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in a span of just four days. This rapid conversion involved extensive logistical and operational efforts to accommodate the event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' ballpark was created from the Yankees' spring training facility for Opening Day within four days, showcasing significant logistical and operational work to facilitate the event."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All UFL teams aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "All teams in the UFL are striving to outperform Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze played a key role in Crystal Palace's victory over Fulham, scoring a goal and providing an assist in their 3-0 win on Saturday. This victory secured Crystal Palace a spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze contributed significantly to Crystal Palace's 3-0 win against Fulham, scoring a goal and assisting another, on Saturday. This victory ensured Crystal Palace's advancement to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, resulting in a jury awarding him over $20 million."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. The win was challenging, but it helped maintain Bayern Munich's position as the leaders of the Bundesliga."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half, helping Bayern Munich secure a 3-2 win over St Pauli on Saturday. This victory allowed Bayern Munich to continue leading the Bundesliga standings."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Espanyol, facing relegation, secured a 1-1 draw against third-placed Atletico Madrid in LaLiga on Saturday. Cesar Azpilicueta scored for Atletico in the first half, but Javi Puado's penalty for Espanyol evened the score."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol, threatened by relegation, managed a 1-1 draw with Atletico Madrid, who are third in LaLiga, on Saturday. Atletico's Cesar Azpilicueta scored in the first half, but Espanyol's Javi Puado equalized with a penalty."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:36:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle celebrated winning a major domestic trophy for the first time in 70 years with an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle marked their first major domestic trophy win in 70 years with an open-top bus parade through the city, celebrating their achievement with fans."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 16:21:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazil Football Confederation (CBF) has fired head coach Dorival Júnior following the team's defeat by Argentina on Tuesday."
  }
]