[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for the delegation of tasks to automated systems, such as self-driving cars and cleaning robots. While most people may not be able to afford advanced humanoid robots, robot vacuums offer a more accessible option for automated assistance in cleaning tasks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5702565172569445,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3525641293142361,
    "summary": "Technology today enables tasks to be automated, with examples including self-driving cars and cleaning robots. Although advanced humanoid robots may be expensive, robot vacuums provide a more affordable solution for automated cleaning assistance."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. The event runs until March 31, 2025, offering discounts on gardening supplies, bedding, and more."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5202233657986111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34005584144965273,
    "summary": "Amazon has initiated its Big Spring Sale, which will last until March 31, 2025. This sale event, marking the onset of spring, features discounts on various items including gardening supplies and bedding."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream. This revelation came via its website, which discussed the new Virtual Game Card lending system. The announcement was not initially planned for today's event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5138577136921296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33846442842303237,
    "summary": "Nintendo has announced \"Switch 2 Edition\" games and a new Virtual Game Card lending system, revealed unexpectedly on its website following the Nintendo Direct stream. This announcement was not scheduled for today's event."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting conservative podcasters for extensive access to senior officials from the Trump Administration. This initiative aims to engage alternative media and is planned to be a recurring event, highlighting the administration's focus on incorporating new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4914846036111111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33287115090277775,
    "summary": "On Thursday, the White House initiated Podcast Row, granting conservative podcasters access to Trump Administration senior officials. This move, aimed at engaging alternative media, is set to become a recurring event, emphasizing the administration's effort to include new media outlets."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale features discounts on various e-readers, including its first color model. The Kindle Scribe, notable for its note-taking capability, is on sale at a record low price for the 16GB version."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.482873135775463,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3307182839438657,
    "summary": "Amazon has launched its Big Spring Sale, offering discounts on various e-readers, including its first-ever color model. The sale features the Kindle Scribe, known for its note-taking feature, at a record low price for the 16GB version."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Federal Trade Commission (FTC) staff have been directed to stop describing the agency as \"independent\" in complaints. This instruction was communicated in an email from Christopher Mufarrige, the Director of the Bureau of Consumer Protection, as reported by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4555454874652778,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3238863718663194,
    "summary": "The Federal Trade Commission (FTC) staff were instructed by Christopher Mufarrige, the Director of the Bureau of Consumer Protection, to refrain from labeling the agency as \"independent\" in complaints, according to an email reported by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian tech firm, has introduced the Classic 2, an updated version of its open-source trackball mouse. Maintaining the original's design and ergonomics, the new model features enhanced connectivity, a more precise scroll wheel, and an improved design for easier 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4504428241666666,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32261070604166664,
    "summary": "Canadian tech company Ploopy has launched the Classic 2, an upgrade of its open-source trackball mouse. The new version retains the original's design and ergonomics but offers better connectivity, a more accurate scroll wheel, and a redesigned structure for simpler 3D printing."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway, ending on Monday, March 31st. The sale features numerous deals across a wide range of products, accessible without an Amazon Prime membership. A comprehensive roundup includes over 90 deals on popular gear, alongside a selection of low-cost alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.42369857643518516,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3159246441087963,
    "summary": "Amazon's Big Spring Sale, ending on March 31st, offers a variety of deals on a wide range of products, available to all customers without needing an Amazon Prime membership. The sale includes a roundup of over 90 deals on popular items and affordable alternatives."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft announced it is creating a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises, with Tencent investing approximately $1.3 billion for a 25% stake. This values the new subsidiary at around $4.3 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4193229276041667,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3148307319010417,
    "summary": "Ubisoft is establishing a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six series, with Tencent acquiring a 25% share for about $1.3 billion. This investment values the subsidiary at approximately $4.3 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, offering significant discounts on a variety of gadgets and gear, including Apple MacBooks. These MacBooks feature Apple's M-series chips and come in various sizes and price points. Notably, the M1 MacBook Air has been discontinued."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.41423364855324085,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31355841213831026,
    "summary": "Amazon has launched its Big Spring Sale, featuring substantial discounts on numerous items, including Apple MacBooks with M-series chips. The sale covers various models and prices, although the M1 MacBook Air is no longer available."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building has collapsed in Thailand's capital, leading to concerns that workers may be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed, raising fears of trapped workers."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but clarified they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" but stated they are not connected to Moscow's activities in the region."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been affected by tariffs introduced by Trump, putting at risk future collaborative efforts between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader announced that tariffs implemented by the Trump administration have strained Canada-US relations, potentially jeopardizing future cooperation between the two countries."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:46:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected the idea proposed by JD Vance and his wife, following Donald Trump's earlier suggestion of taking control of the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has dismissed a proposal, previously suggested by Donald Trump and recently brought up by JD Vance and his wife, to take control of the island."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has instructed his vice-president to prioritize work related to the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children have died in a recent incident, with no additional details about the victims provided."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who has been transferred to a prison in El Salvador by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC that she has not received any information about her son, who was transferred from the United States to a prison in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amidst a challenge from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The perpetrator's initial request for parole was rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the person who founded her fan club. In Texas, the killer's first request to be released early from prison was denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against Washington, accusing the United States of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies, among them China, have committed to taking retaliatory measures against the United States. They accuse Washington of violating international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's development was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The development of the technology was reportedly supported by Russia, as stated by analysts."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while covering protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist working for the BBC, was arrested during his coverage of protests in Istanbul. Following his arrest, he was deported back to the UK."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The film featuring Robert Downey Jr as Doctor Doom is scheduled for release in May 2026."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A movie starring Robert Downey Jr as Doctor Doom is set to be released in May 2026."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect has been arrested with assistance from a local resident, according to police reports. The resident helped overpower the suspect, leading to the arrest."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect was arrested after a local resident assisted police by helping to overpower the individual, according to police reports."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found evidence of blunt trauma on a toddler's remains, as reported in a recent update."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed when the child reported seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained when a convoy of 20 armed vehicles arrived at his home, according to his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained following the arrival of a convoy consisting of 20 armed vehicles at his residence, as reported by his political party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Algerian author Boualem Sansal, aged 80, stated in an interview with a far-right news outlet that colonial France allocated an excessive amount of land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Algerian author Boualem Sansal, 80, claimed in a far-right news outlet interview that colonial France gave too much land to Algeria."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals have lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the death of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky expressed appreciation for Europe's support amid ongoing conflicts, highlighting his country's resilience. He emphasized the importance of solidarity and the strength demonstrated by Ukraine in the face of challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky thanked Europe for its support during Ukraine's ongoing conflicts. He stressed the significance of unity and praised Ukraine's resilience and strength in overcoming challenges."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and national issues has made the government's attempt to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government's efforts to win a second term are facing difficulties due to a combination of domestic and international issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India has experienced growth due to affluent urban residents increasingly pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India has seen growth as more affluent urban dwellers are spending more on their pets, particularly dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that strong winds, dry conditions, and pine trees significantly increase the risk of wildfires, creating a hazardous combination."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts caution that the combination of strong winds, dry conditions, and the presence of pine trees greatly elevates the risk of wildfires, posing a significant danger."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that allows individuals to view their family tree in a dynamic, movie-like format, showcasing the global movements of their ancestors over time. This innovative approach can also be applied to track the spread of diseases and analyze animal migration patterns across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that transforms family trees into dynamic, movie-like visualizations, illustrating ancestors' global movements over time. This method can also track disease spread and animal migration patterns across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the discrepancy between predicted and observed ocean temperatures around Antarctica over several decades is largely due to increased meltwater and rain, accounting for 60% of the mismatch."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the difference between expected and actual ocean temperatures near Antarctica is mainly caused by a 60% increase in meltwater and rain, explaining the discrepancy observed over many years."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that many people with Long COVID often feel ignored, disbelieved, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit differences in gene regulation. This discovery highlights a potential factor contributing to the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from different parts of the body come from various precursor cells and show differences in gene regulation. This finding may help explain the evolutionary success of vertebrates."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will motivate scientists to address the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, suggests adding eugenics to college genetics curriculums. He argues this could help scientists tackle the misuse of science for political reasons."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed higher contamination of infective roundworm eggs at park entrances compared to other park areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from 12 parks in Dublin, Ireland, showed higher levels of infective roundworm eggs near the entrances than in other parts of the parks."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:20:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The NCAA basketball tournament has progressed, with the original 68 teams now reduced to 12 following Thursday's matches."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The NCAA basketball tournament has advanced, narrowing down from 68 to 12 teams after Thursday's games."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas. This win, achieved after overcoming a 16-point deficit, secured Texas Tech a place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored a crucial basket with 7.3 seconds left in overtime, securing Texas Tech an 85-83 win over Arkansas. This victory, following a comeback from a 16-point deficit, advances Texas Tech to the Elite Eight."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Duke's Cooper Flagg led his team to a 100-93 victory over Arizona, securing a spot in the Elite Eight for the second consecutive season. Flagg contributed 30 points, 6 rebounds, 7 assists, and 3 blocks in the win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg of Duke University played a pivotal role in his team's 100-93 win against Arizona, ensuring their advancement to the Elite Eight for the second year in a row. Flagg's performance included 30 points, 6 rebounds, 7 assists, and 3 blocks."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers on Thursday. This shot is considered one of the season's most dramatic endings in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers on Thursday. This event is highlighted as one of the NBA season's most dramatic endings."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kevin Willard, the coach of Maryland's men's basketball team, did not make a clear statement regarding his future with the Terrapins following their Sweet 16 elimination by Florida."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kevin Willard, the coach of Maryland's men's basketball team, did not provide a definitive answer about his future with the team after they were eliminated from the Sweet 16 by Florida."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU in an East Region semifinal. Mark Sears led the team in this achievement, breaking a 35-year-old record."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by making 25 3-pointers in their 113-88 victory over BYU in an East Region semifinal. Mark Sears was the leading contributor in breaking the 35-year-old record."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut game for the Mets on Thursday, Juan Soto struck out with two outs in the ninth inning, missing the opportunity to tie the game. This resulted in the Astros securing a 3-1 victory."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing a game tie. This led to the Astros winning 3-1."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, following an offseason filled with trade rumors. His performance was met with enthusiasm from Cardinals fans, earning him a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amidst offseason trade speculation. His performance was celebrated by Cardinals fans, leading to a curtain call."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to blame him unjustly."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the organization conspired with the university to unfairly blame him."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders analyze major NBA awards, focusing on the MVP race between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are examining the race for the league's major awards, with particular attention on the MVP competition between Nikola Jokic and Shai Gilgeous-Alexander."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record number of 3-point attempts in the league, raising questions about whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts. This surge in frequency has sparked discussions on whether there should be actions taken to reduce the number of 3-point attempts."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts have made predictions for the 2025 baseball season, including whether the Dodgers can win again and potential MVP winners."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts have predicted outcomes for the 2025 baseball season, focusing on the Los Angeles Dodgers' chances of winning and identifying potential Most Valuable Player (MVP) candidates."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This message provides information relevant to teams preparing for an event in 2025, offering support regardless of their current status as favorites or underdogs aiming for a surprise success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This message offers support to teams preparing for a 2025 event, addressing both favorites and underdogs, and encouraging all participants to aim for success."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are featured in the latest Sweet 16 player rankings, with discussions around which of them has taken the top position."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the newest Sweet 16 player rankings. There is ongoing discussion regarding who occupies the number one spot among them."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team towards a championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team toward a championship, serving as pivotal players in the team's success."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, a former NFL executive, created a mock draft where he made his own selections for the first round, acting in the role of a general manager."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, a former NFL executive, conducted a mock draft, making first-round selections as if he were a general manager."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised widespread concern across college athletics, prompting fears about the potential number of other athletes who might be victims."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concern in college athletics over the possibility of more athletes being victims."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in some of Europe's top football leagues are as follows: In the Premier League, a player has emerged as the top scorer. Similarly, individual players lead the scoring charts in LaLiga, Bundesliga, Serie A, and Ligue 1, showcasing their skills and contributions to their respective teams across these competitive leagues."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Top scorers in Europe's major football leagues have been identified in the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1. These players lead the scoring charts, highlighting their significant contributions and skills within their respective teams and leagues."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona won against Osasuna 3-0, but coach Hansi Flick stated the victory came at a \"high price\" due to Dani Olmo's injury during the Thursday match."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona defeated Osasuna 3-0 in a recent match. However, the victory was overshadowed by an injury to Dani Olmo, as described by coach Hansi Flick, who called the win a \"high price\" for the team."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced on Thursday that it is investigating alleged \"indecent conduct\" by four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid, as announced on Thursday."
  },
  {
    "title": "Ronaldo to lead CONMEBOL anti-racism task force",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "CONMEBOL has appointed Ronaldo Nazario to head a task force aimed at addressing racism and violence in South American soccer. The announcement was made on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "CONMEBOL has named Ronaldo Nazario as the leader of a new task force focused on tackling racism and violence in South American soccer. This decision was announced on Thursday."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, unlike the situation a year ago, indicating no immediate changes are expected regarding his future with the team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, is not currently receiving offers from other clubs, suggesting he will likely stay with the team for the foreseeable future, in contrast to the situation a year ago."
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:41 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Qatar Sport Investment (QSI), which owns Paris Saint-Germain, is in the final stages of acquiring the Spanish football club Malaga, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is reportedly close to finalizing the purchase of the Spanish football club Malaga, as per a source mentioned by ESPN."
  },
  {
    "title": "Bompastor hails Chelsea's 'perfect night' in UWCL",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea's manager Sonia Bompastor described their recent victory over Manchester City as a \"perfect night,\" which secured their advancement to a third consecutive Champions League semifinal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea's manager, Sonia Bompastor, called their recent win against Manchester City a \"perfect night.\" This victory ensured Chelsea's progression to their third consecutive Champions League semifinal."
  }
]