[
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:24:36 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "CNBC",
      "Al Jazeera",
      "BBC",
      "Forbes",
      "Financial Times",
      "The Guardian",
      "Deutsche Welle",
      "Washington Post",
      "NPR",
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.cnbc.com",
      "ottawa.citynews.ca",
      "www.npr.org",
      "abcnews.go.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.forbes.com",
      "www.ft.com"
    ],
    "snippets": [
      "The deal raises the possibility that the war may now be over, ending the  bloodiest fighting ever between Israelis and Palestinians.",
      "Donald Trump says all hostages will be released and Israel will withdraw troops to an \"agreed upon line\", but there is no update to other aspects of his 20-point peace plan.",
      "Emotional scenes unfolded as Palestinians in Gaza celebrated the announcement of a Gaza ceasefire deal.",
      "Leaders and groups around the world celebrate negotiators signing off on first phase of the Gaza ceasefire agreement.",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”",
      "Gaza ceasefire breakthrough announced by US President Donald Trump on third day of talks in Egypt’s Sharm el-Sheikh.",
      "Mediator Qatar said that more details of the agreement would be announced at a later date.",
      "US President Donald Trump said this means that all of the hostages will be released very soon and Israel will withdraw troops. DW has the latest.",
      "President Donald Trump said earlier Wednesday he may go to the Middle East in the coming days.",
      "Trump announced that Israel and Hamas had agreed on the first phase of a peace plan which could put an end to the two-year war and free hostages.",
      "US president says all hostages to be released ‘very soon’ as he hails breakthrough deal",
      "<p>Donald Trump announces all hostages will be released ‘very soon’ and Israel will withdraw troops to an agreed timeline</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dang",
      "Prime Minister Benjamin Netanyahu of Israel said he would convene his government on Thursday to sign off on the agreement. Hamas said that the agreement would lead to the end of the war, but many of the details were unclear.",
      "<p>Want to get this in your inbox every weekday? <a href=\"https://www.theguardian.com/australia-news/2022/oct/13/afternoon-update-newsletter-best-daily-news-email-guardian-australia-free-sign-up?CMP=cvau_sfl&amp;CMP=au_sfl\">Sign up for the Afternoon Update here</a>, and start your day with <a href=\"",
      "President Donald Trump suggested he may travel to Gaza.",
      "U.S. President Donald Trump has announced that Israel and Hamas have agreed to the “first phase” of his peace plan to pause fighting and release at least some hostages and prisoners. “This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed u",
      "<p>An initially improbable peace plan put forward by US president Donald Trump was on Thursday agreed to in its ‘initial phase’ by Israel and Hamas</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza"
    ],
    "image_url": "",
    "titles": [
      "Israel and Hamas agree on the 'first phase' of Gaza ceasefire deal",
      "What we know about the 'first phase' of the Gaza peace deal",
      "Palestinians in Gaza celebrate news of ceasefire deal",
      "World reacts to Gaza ceasefire deal announced by Trump",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’",
      "LIVE: Trump says Israel, Hamas agree on ‘first phase’ of Gaza ceasefire",
      "Trump says Israel and Hamas sign off on first phase of Gaza ceasefire plan",
      "Israel, Hamas sign off on 'phase 1' of Gaza peace plan, Trump says",
      "Israel-Gaza live updates: Trump says Israel and Hamas signed off on 1st phase of deal",
      "Israel, Hamas agree to first phase of Gaza peace plan, allowing release of hostages and prisoners",
      "Trump says Israel and Hamas have agreed first phase of Gaza peace plan",
      "‘First phase’ of ceasefire deal to end war in Gaza agreed by Israel and Hamas",
      "President Trump Says Israel and Hamas Agree to First Phase of Peace Plan",
      "Afternoon Update: Israel and Hamas agree to ‘first phase’ of peace plan; Australia’s best-ranked university; and falcon chick ‘watch parties’",
      "Trump Says Israel And Hamas Have Agreed To First Phase Of Peace Deal—IDF Readies Partial Troop Withdrawal",
      "Israel and Hamas agree to ‘first phase’ of plan to end fighting and release hostages, Trump says",
      "Tears of joy and celebratory gunfire: how Gaza and Israel reacted to news of ceasefire deal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.832,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Yankees 5-2, Advance to ALCS for First Time Since 2016",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 02:55:06 EST",
    "source": "ESPN",
    "sources": [
      "Global News",
      "ESPN",
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Blue Jays advanced to the club's first ALCS since 2016 after defeating the Yankees 5-2 on Wednesday.",
      "There was no Aaron Judge magic this time around. No five-run comeback either.",
      "Toronto fans erupted in jubilation Wednesday night after watching the Blue Jays advance to the American League Championship Series for the first time since 2016.",
      "<p>Once again, the Blue Jays used collective contributions from across their roster, as they so often have in this convention-defying season, and are now on their way to the ALCS. </p>",
      "The Blue Jays have won 5-2 in Game 4 of the American League Division Series against the New York Yankees. After two wins in Toronto, one loss in New York on Tuesday, the team made a comeback Wednesday after defeating the Yankees. The Jays are now advancing to the the American League Championship Ser"
    ],
    "image_url": "",
    "titles": [
      "Jays knock out Yankees, reach 1st ALCS since '16",
      "Blue Jays beat Yankees, advance to ALCS",
      "Blue Jays fans celebrate as team advances to ALCS",
      "Blue Jays use collective effort to eliminate Yankees, advance to ALCS",
      "Blue Jays beat Yankees 5-2, advance to the ALCS"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.973,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.809,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays advanced to the American League Championship Series (ALCS) for the first time since 2016 by defeating the New York Yankees 5-2 in Game 4 of the ALDS. Key contributions came from Vladimir Guerrero Jr. and George Springer, with eight pitchers collectively shutting down the Yankees. This victory follows a regular season where the Blue Jays won eight of thirteen games against their AL East rivals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguars Trade for Browns' Newsome, Campbell Moves to Cleveland",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 02:55:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Jaguars and Browns agreed to a trade of cornerbacks Wednesday night, with Greg Newsome heading to Jacksonville and Tyson Campbell going to Cleveland, sources told ESPN's Adam Schefter.",
      "The Browns have made a second trade in two days",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNTDVEUHUzMUREb2pjSjhFQ05jSkRXZlg5YTdxYnEtbUJjSFJkOW11SDBuLUJZZzRCT0tBRUFHUW5DVUhqS01VNDJXenAxRDVCQlRJbHIzZlExTUhXeF9fREQ1X0M4ZXJWczV2TlpBc2RxSUZUMTFuQTR2SHduZ01NTlBBY3RtTG5jRDVRSU5Obl9Zdw?oc=5\" target=\"_blank\">3 Instant Observations to Jag"
    ],
    "image_url": "",
    "titles": [
      "Sources: Jags get Newsome; Campbell to Browns",
      "Browns trade CB Greg Newsome II to Jaguars for CB Tyson Campbell, per reports",
      "3 Instant Observations to Jaguars' Tyson Campbell Trade - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Jaguars and Browns have completed a cornerback trade, with Greg Newsome moving to Jacksonville and Tyson Campbell heading to Cleveland, as reported by ESPN's Adam Schefter. This marks the Browns' second trade in two days, indicating active roster adjustments by both teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Take 2-0 Series Lead as Wilson Shines, Sabally Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 00:47:54 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Everything that happened in Game 3, including A'ja Wilson's historic night and Satou Sabally's injury.",
      "The Aces have taken a commanding 2-0 lead, but now the series will shift to Phoenix for Game 3",
      "<p>Though the Phoenix Mercury fought admirably, A&#8217;ja Wilson&#8217;s inevitability prevailed in the final seconds. Now the WNBA great and her Las Vegas Aces are one win away from history. </p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals Game 3 takeaways: How Aces beat Mercury to go up 3-0",
      "2025 WNBA Finals: Aces vs. Mercury schedule, Game 3 prediction, odds, pick, where to watch",
      "WNBA Finals Game 3 Takeaways: Aces on brink of dynasty after last-second win"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.931,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Game 3 of the series, A'ja Wilson had a historic night, contributing significantly to the team's performance. However, the game was also marked by Satou Sabally's injury. Despite these events, the Aces secured a 2-0 lead in the series. The next game is set to take place in Phoenix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man United Co-owner Backs Coach Amorim, Offers 3-Year Window to Prove Worth",
    "domain": "sports",
    "source_domain": "footballtoday.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 07:06:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "footballtoday.com"
    ],
    "snippets": [
      "Manchester United co-owner Sir Jim Ratcliffe has pledged to give Ruben Amorim three years to prove himself at Manchester United. Amorim joined United in November 2024 following an impressive four-yea...",
      "<ul><li><p>Minority owner moves to clarify coach’s future</p></li><li><p>‘You can’t run a club like United on kneejerk reactions’</p></li></ul><p>Sir Jim Ratcliffe insists he will not take a “kneejerk” decision to sack Ruben Amorim and has indicated he will afford the head coach three years to demon",
      "Manchester United minority owner Sir Jim Ratcliffe has said he wants to give under-pressure head coach Ruben Amorim three years in the job to prove himself."
    ],
    "image_url": "",
    "titles": [
      "Is Sir Jim Ratcliffe right to give Ruben Amorim three years at Manchester United?",
      "Ratcliffe says Ruben Amorim has three years to prove himself at Manchester United",
      "Ratcliffe: I want to give Amorim three years to prove himself at Man Utd"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester United co-owner Sir Jim Ratcliffe supports head coach Ruben Amorim, stating he will not make a \"kneejerk\" decision regarding his position. Ratcliffe emphasizes the importance of stability and has indicated Amorim will be given three years to demonstrate his capabilities and prove he is a \"great\" coach for the club.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Yankees 5-2, Reach ALCS First Time Since 2016",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 04:09:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Seven teams remain in the 2025 baseball postseason",
      "On this episode of Baseball Bar-B-Cast, Jake and Jordan talk about the Blue Jays eliminating the Yankees, a pivotal ALDS Game 5 and the NLDS tightening up with the Cubs and Phillies forcing Game 4s.",
      "<p>Nathan Lukes knocked a two-run single and the Toronto Blue Jays bullpen allowed just six New York Yankees hits as they took a 5-2 win to advance to the American League Championship Series for the first time since 2016.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/09/2c9ae628-a16a-49e5-8f03-d7b14fd6d532/mlb-bracket-blue-jays-advance.jpg",
    "titles": [
      "2025 MLB playoff bracket: Schedule, ALDS, NLDS scores as Blue Jays eliminate Yankees, Phillies stay alive",
      "Blue Jays eliminate the Yankees, Tigers-Mariners go to Game 5 and Phillies & Cubs force Game 4 in NLDS",
      "MLB Game 4 Highlights: Blue Jays 5, Yankees 2"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays defeated the New York Yankees 5-2, advancing to the American League Championship Series for the first time since 2016, thanks to Nathan Lukes' two-run single and their bullpen's strong performance. Meanwhile, the baseball postseason continues with seven teams remaining, as the Cubs and Phillies force Game 4s in the NLDS, tightening the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Accuses Pritzker, Chicago Leaders Without Evidence",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:28:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "LA Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as US troops arrive in state.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNODU0dE5Ea1BGZFR0dl8yOWs0c1MtMnlpV2JmLVpZUUJ6em5Ta3lIOXhCLWdmZ1FPOG9NTnlwUHhWSkU2ekhaXy1jRVFhTElkS2VfR0hPT21taTJadkpVd3c5VWRZZDJTQjlHQ2RGemNOTWtWZ0JQdGNZUmZid0lDbzFTRUd5Zw?oc=5\" target=\"_blank\">Trump baselessly calls for Pritzker, Chicago ",
      "<p>President Trump continued to campaign for deploying National Guard troops to Chicago and Portland, Ore., despite opposition from local and state leaders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump calls to jail Chicago mayor, Illinois governor in immigration dispute",
      "Trump baselessly calls for Pritzker, Chicago mayor to be jailed - Axios",
      "Trump says Chicago mayor, Illinois governor should be jailed amid militarized campaign"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.799,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump made baseless accusations against Governor Pritzker and Chicago's leadership, alleging their failure to protect ICE officers. No evidence was provided to support his claims.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Reach AL Championship Series for 8th Time Since 2016",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 09 Oct 2025 08:02:49 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays are heading to their eighth American League Championship Series — and their first since 2016.",
      "<p>Shi Davidi joins Sportsnet Central to look ahead to the American League Championship Series, discussing whether the Toronto Blue Jays should have a preference between playing the Seattle Mariners or the Detroit Tigers.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f50aa9e04a851cef1deb6bafc50ef0c8dc8b64d91f2775f3fea95a3543717a4f.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays set for ALCS against Tigers or Mariners",
      "Should Blue Jays have a preference between Tigers, Mariners for ALCS?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have advanced to the American League Championship Series for the eighth time, marking their first appearance since 2016. Shi Davidi discussed on Sportsnet Central the team's potential preferences for their opponent, debating between the Seattle Mariners and the Detroit Tigers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested for Historic LA Fire, AI Image Found on Devices",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 19:48:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Police say 29-year-old Jonathan Rinderknecht was behind fire that destroyed much of the Pacific Palisades neighbourhood.",
      "Authorities announced the arrest of a 29-year-old man for allegedly starting the devastating fire in the Los Angeles neighborhood of Pacific Palisades in January. It is considered the worst fire in the city's history.",
      "<p>Jonathan Rinderknecht allegedly started blaze that destroyed over 6,800 structures in California</p><p>A 29-year-old man has been arrested and charged with igniting the fire that days later became the devastating Palisades blaze, which killed 12 people and destroyed more than 6,800 structures in "
    ],
    "image_url": "",
    "titles": [
      "Suspect charged with starting deadly Los Angeles Palisades fire",
      "US police arrest man suspected of starting deadly LA fire",
      "Man charged with starting Palisades fire that killed 12 people"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.772,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jonathan Rinderknecht, 29, was arrested for starting a fire in Los Angeles' Pacific Palisades neighborhood, considered the worst in the city's history. Evidence from his devices included an AI image of a burning city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flight Delays Rise Amid Controller Shortage and Government Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:00:17 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQWE1tajBMMWdsc0h1dTlycUx1clJBLU5HSDBSV3pnWmhDU1ZvM0dzemVtUFJNZXJYVU0yQWlWNmt4NDZOM3dSMXNSUmZUQXpmZGhrSFhBS1hCSnFON1hQRFRNaE91dVM2Yktoc0lvYURuaDNmZTBSWWFVR0Z4dlRCTndrZmtpbEhEWGc?oc=5\" target=\"_blank\">How air traffic controllers could help e",
      "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.",
      "The government shutdown is exacerbating concerns about the strain on air traffic controllers, a shortage of whom has vexed airline executives for years."
    ],
    "image_url": "",
    "titles": [
      "How air traffic controllers could help end the shutdown - Axios",
      "WATCH:  Air traffic controller shortages amid shutdown lead to canceled flights, delays",
      "Air traffic control shortages add to U.S. flight delays, FAA says"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.759,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Flight delays and cancellations are increasing due to a shortage of air traffic controllers caused by sickness-related absences. The ongoing government shutdown is worsening the situation, highlighting a long-standing issue of controller shortages that has troubled airline executives for years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tuchel Calls England 2026 World Cup \"Underdogs,\" Stresses Unity and Cohesion",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:21:46 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Thomas Tuchel believes England will go into the World Cup as \"underdogs\" and says they have \"no chance\" of succeeding unless the team unite.",
      "The 2026 FIFA World Cup is set to be the most expensive, polluting and political yet.",
      "<ul><li><p>Tuchel: ‘I don’t see why we should burden ourselves’</p></li><li><p>Head coach ‘not just collecting most talented players’</p></li></ul><p>Thomas Tuchel has said England would be underdogs at the World Cup and would be stronger if they did not allow themselves to become burdened by expect"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4684/live/c0c65910-a487-11f0-961e-13040d1e97f4.jpg",
    "titles": [
      "England will be 'underdogs' at World Cup - Tuchel",
      "Will the 2026 World Cup be a disaster for fans?",
      "Tuchel insists England should embrace underdog status at 2026 World Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.781,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Thomas Tuchel, addressing England's prospects for the 2026 FIFA World Cup, labeled the team as \"underdogs\" and emphasized the necessity of unity for any chance of success. He highlighted the importance of not overburdening themselves with expectations. Additionally, Tuchel mentioned his approach to team selection, focusing on cohesion over merely gathering the most talented players. The 2026 World Cup is noted for being anticipated as the most expensive, environmentally taxing, and politically charged iteration to date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oilers Sign Ekholm for $12M, Acquire Roslovic in Roster Boost",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 09 Oct 2025 04:07:10 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Edmonton Oilers signed defenceman Mattias Ekholm to a three-year, US$12-million contract extension and added free agent forward Jack Roslovic on a one-year, $1.5-million deal Wednesday.",
      "<p>The Edmonton Oilers are adding an experienced depth centre to the mix.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2019/03/nhl_triggerheaders_edmonton.png",
    "titles": [
      "Edmonton Oilers extend Ekholm, sign Roslovic",
      "Oilers set sign centre Jack Roslovic to one-year deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Edmonton Oilers have signed defenceman Mattias Ekholm to a three-year, $12 million contract extension and acquired free agent forward Jack Roslovic on a one-year, $1.5 million deal to bolster their roster.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ceasefire in Gaza: Hostages Released, Israeli Troops to Withdraw",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 05:55:53 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>In today’s newsletter: A ceasefire between Israel and Hamas will see the release of hostages and the withdrawal of most of Israel’s troops</p><p>Good morning. After more than two years of devastating war, a ceasefire has finally been announced in Gaza.</p><p>US president Donald Trump said Israel ",
      "President Trump’s plan contains elements that Hamas has resisted in the past, and which may yet prove to be sticking points."
    ],
    "image_url": "https://i.guim.co.uk/img/media/42684000f384b5ad0960cdd629b40a3720859fa0/342_0_2700_2160/master/2700.jpg?width=140&quality=85&auto=format&fit=max&s=cce7ba6afdf665daca33a66bb9f58d14",
    "titles": [
      "Thursday briefing: What the first phase of a Gaza peace plan will bring",
      "What Trump’s 20-Point Gaza Peace Plan Envisions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A ceasefire agreement in Gaza, announced today, will result in the release of hostages and the withdrawal of most Israeli troops after over two years of conflict. The plan, supported by US President Donald Trump, includes elements previously resisted by Hamas, which could pose future challenges.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Upholds Trump's Military Authority Without Congress Approval",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 07:08:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Democrats say President Donald Trump does not have the power to use force without the approval of Congress.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE50LVBHQ1dYZTZfWDVkWmNFYkN6eWJYcFJ5RHlQV0x3UDZVUEhQVGJISUVwQjNYVXk0QVpYSjZOUDV5VURERmRsdlBiamtHTHk4Y0dDSGFqbWVTVHlfeEtRMDl1emwwell1QTR6dTFNNTdiN2NvRUZ1cA?oc=5\" target=\"_blank\">Senate rejects effort to curb Trump's power to target alleged dru"
    ],
    "image_url": "",
    "titles": [
      "US Senate fails to curb Trump’s power to strike drug cartels",
      "Senate rejects effort to curb Trump's power to target alleged drug boats - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Senate rejected an effort to limit President Donald Trump's authority to use military force without Congressional approval. This decision upholds the president's power to act in matters of military engagement without needing prior consent from Congress.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Announces First Phase of Gaza Peace Plan; Hostages to be Released",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 06:47:48 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The agreement of the first-phase of the peace plan for Gaza, announced by US President Donald Trump, is a big moment.",
      "Israel and Hamas have reached an agreement to release hostages and prisoners. Our colleague Jodi Rudoren explains this critical moment."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0df1/live/895db150-a4da-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Ceasefire deal a major breakthrough, but war not over yet",
      "A Gaza Breakthrough"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US, under President Donald Trump, announced the first phase of a peace plan for Gaza, marking a significant development. Israel and Hamas have agreed to release hostages and prisoners, as explained by Jodi Rudoren. This agreement is a critical step towards peace in the region.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nobel Chemistry Prize Awarded for Metal-Organic Frameworks Innovation",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:58:33 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Ars Technica",
      "Phys.org"
    ],
    "domains": [
      "www.newscientist.com",
      "phys.org",
      "arstechnica.com"
    ],
    "snippets": [
      "Susumu Kitagawa, Richard Robson and Omar Yaghi have been honoured for the development of metal-organic frameworks, porous materials that can capture water or pollutants",
      "Three scientists have been awarded the 2025 Nobel prize in chemistry for discovering a new form of molecular architecture: crystals that contain large cavities.",
      "Three researchers share prize for structured polymers called metal-organic frameworks."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/10/08110541/SEI_269475037.jpg",
    "titles": [
      "Nobel prize in chemistry awarded for work on molecular architecture",
      "Nobel chemistry prize awarded for crystal materials that could revolutionize green technology",
      "Chemistry Nobel prize awarded for building ordered polymers with metal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.642,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the Nobel Prize in Chemistry for creating metal-organic frameworks. These innovative porous materials have applications ranging from capturing water in deserts to storing gases and delivering drugs. This recognition highlights their significant contribution to science and various industries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Watchdog Approves Bill Hike for Five Water Companies",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 07:28:03 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Five water companies win permission for higher bills as they seek more investment to fix outdated infrastructure.",
      "<p>Competition watchdog agrees requests from Anglian, Northumbrian, Southern, Wessex and South East to raise household bills</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/357a/live/0446f820-a4d3-11f0-9f74-77bc8773bf41.jpg",
    "titles": [
      "Water bills to rise further for millions after regulator backs extra price increases",
      "Millions of households face jump in water bills after regulator backs more price rises"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Five UK water companies, Anglian, Northumbrian, Southern, Wessex, and South East, have been granted approval by the competition watchdog to increase household bills. The decision aims to support investments in updating their outdated infrastructure.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SoftBank Acquires ABB's Robotics Division for $5.4 Billion to Boost AI Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 03:10:53 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The S&amp;P 500 and Nasdaq Composite scored new intraday and closing highs Wednesday stateside.",
      "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier."
    ],
    "image_url": "",
    "titles": [
      "SoftBank shares soar 13% after it agrees to buy ABB robotics unit for $5.4 billion",
      "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.882,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SoftBank Group announced its acquisition of the robotics division of ABB, a Swiss engineering firm, for $5.4 billion. This move aims to expand SoftBank's involvement in robotics, emphasizing the company's focus on physical AI as a key area of future development.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolly Parton Debunks Health Rumors: \"I Ain't Dead Yet!\"",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-09T03:49:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Legendary American singer Dolly Parton put the buzz of a health scare to bed in a social media post. The 79-year-old said she was okay after her sister made comments about her health, sending fans in a tailspin.",
      "<p>Country music star shares buoyant video on social media after rumors swirl about her health</p><p>Dolly Parton has taken to social media to clarify she “ain’t dead yet!”</p><p>In a <a href=\"https://www.instagram.com/reel/DPjkor7kfeb/?utm_source=ig_embed&amp;ig_rid=f6a18523-b270-4635-8cd2-e641914e"
    ],
    "image_url": "",
    "titles": [
      "'Ain't dead yet,' says Dolly Parton amid health rumors",
      "Dolly Parton addresses health concerns in new video: ‘I ain’t dead yet!’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Dolly Parton addressed health rumors by posting a video on social media, asserting \"I ain't dead yet!\" following concerns raised after her sister asked fans for prayers and Parton postponed gigs due to health issues. She aimed to clarify her current well-being to her fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Peptide Blocks Alpha-Synuclein Misfolding, Aids Parkinson’s Research",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:24:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain dis",
      "<a href=\"https://scitechdaily.com/scientists-discover-food-molecules-that-trick-cells-into-staying-young/\" rel=\"nofollow\" title=\"Scientists Discover Food Molecules That Trick Cells Into Staying Young\"><img alt=\"Energy Vitality Human Health Lifespan\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a molecule that could stop Parkinson’s in its tracks",
      "Scientists Discover Food Molecules That Trick Cells Into Staying Young"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers have developed a peptide that inhibits the harmful misfolding of alpha-synuclein, a protein associated with Parkinson’s disease and some forms of dementia. In laboratory and animal studies, this peptide stabilized the protein and enhanced motor functions, showcasing the potential of rational drug design in addressing neurodegenerative disorders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Investors Seek Diverse Assets Amid Concerns Over Government Debt Control",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 05:30:07 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "The yellow metal says one thing; Treasuries and the dollar another",
      "<p>Investors fear governments will not – or cannot – rein in borrowing so are putting their money elsewhere</p><ul><li><p><a href=\"https://www.theguardian.com/technology/nils-pratley-on-finance/2025/oct/08/the-ai-valuation-bubble-is-now-getting-silly\">Nils Pratley: the AI valuation bubble is now get"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F32c6b0e8-01b1-4152-89a4-1fcfe18a6df9.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Gold as ‘debasement trade’ doesn’t add up",
      "‘The debasement trade’: is this what’s driving gold, bitcoin and shares to record highs?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Investors are diversifying their portfolios due to concerns that governments will not be able to control borrowing. They are moving their investments to different assets, reflecting in the mixed signals from the rising value of gold, contrasting movements in Treasuries, and fluctuations in the dollar's value. This trend indicates a lack of confidence in government fiscal policies and a search for stability elsewhere.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Event Committee Offers First Behind-the-Scenes Look, US President Seeks Honor",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 05:04:22 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "For the first time in its 125-year history, the committee allows an exclusive behind-the-scenes glimpse.",
      "US president pressures Norwegian government and independent committee to select him on Friday"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82b8/live/08f12510-a46c-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Inside the room where Nobel Peace Prize is decided – but will Trump get his wish?",
      "Trump looms large over Nobel Peace Prize"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "For the first time in its 125-year history, the committee behind a prestigious event offered an exclusive behind-the-scenes look. Meanwhile, the US President has been pressuring the Norwegian government and the independent committee to select him for an unspecified honor on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 22:18:28 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "",
    "titles": [
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.797,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shutdown Begins Amid Funding Deal Stalemate",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 23:44:14 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1IR0s3dmdnRTJjb1ZzelM5d2lSaC0zSHJDaWdYMzBCamhKVU5seHBCRXNZUUFTYUNxbmktTUstWURTODVidXZmNjRzdUI0XzRTWlJJcjZjdVNHbGppT0pVcTNuZlBQaWlaT2hKejZocVFBUW16Z2c?oc=5\" target=\"_blank\">The retiring Senate Democrat leading quiet government shutdown talks",
      "President Donald Trump and Republicans accuse Democrats, who want any funding bill to include health-care protections, of holding the government hostage."
    ],
    "image_url": "",
    "titles": [
      "The retiring Senate Democrat leading quiet government shutdown talks - Axios",
      "Senate again rejects funding bills as government shutdown enters second week"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government shutdown began at midnight on October 1, following a failure to reach a funding deal, with Democrats demanding health-care protections in any bill and Republicans, led by President Donald Trump, accusing them of holding the government hostage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Policy Shifts Raise Concerns Amid Global Energy Transition",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 02:58:47 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Policy reversals in the U.S. have created a barrage of headlines which might create the impression that the global energy transition is reversing - this is not the case.",
      "Energy-related exports exhibit a two-way race between U.S. and China. The discrepancy may have geopolitical repercussions that disadvantage the U.S."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e759a13ae7e90b6c145a87/0x0.jpg?width=960",
    "titles": [
      "The Global Energy Transition Rolls On—Even As The U.S. Hits Reverse",
      "Is The Energy Transition Unraveling—Part 1"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.974,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Recent U.S. policy reversals have led to concerns about the global energy transition's direction, but the transition continues. The U.S. and China are competing in energy-related exports, a rivalry with potential geopolitical consequences that could disadvantage the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Prime Big Deal Days End; Walmart Continues Matching Sales",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-09T00:25:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Editor’s note:&#160;That’s a wrap, folks! As Prime Big Deal Days draws to a close, we’ll no longer be updating this article with additional deals and insights. Plenty of great deals remain, however, so be sure to check out&#160;all of our Prime Day 2.0 coverage&#160;for anything you may have missed.",
      "Walmart has proven to be a great place to shop during Amazon’s October Prime Day event, matching the prices on several discounts and marking down many other tech products that we think you’ll like. While Amazon’s event is ending soon, Walmart’s sale event, simply called “Walmart Deals,” runs through"
    ],
    "image_url": "",
    "titles": [
      "October’s Prime Day event is almost over, but our favorite deals are still live",
      "Prime Day ends soon, but these deals are still going at Walmart"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.924,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days has ended, with no further updates to deals being posted. However, many deals are still available for those interested. Concurrently, Walmart has matched several of Amazon's discounts and offered additional markdowns on tech products during the event. Walmart's sale, named \"Walmart Deals,\" will continue beyond the conclusion of Amazon's event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prime Big Deal Days: Top Picks on Tech and 4K Blu-rays at Low Prices",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-08T19:58:35-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "All of the deals we’ve recommended from Prime Big Deal Days are for products our team has tested and can personally vouch for, whether it be a streaming device, a laptop, or a pair of noise-canceling earbuds. However, there are also plenty of other gadgets that the&#160;Verge&#160;staff genuinely lo",
      "Movie streaming services are fine, but as their respective libraries and monthly rates change, nothing compares to having the 4K Blu-rays of your favorite movies to play whenever you want. If you want to add some titles to your collection, several great films and box sets are selling at the lowest p"
    ],
    "image_url": "",
    "titles": [
      "You still have time to save on Verge-favorite gadgets before Prime Day ends",
      "There’s still time to stock up on Blu-ray deals before the end of Prime Day"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.842,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During Prime Big Deal Days, the team recommended various tested products, including streaming devices, laptops, and noise-canceling earbuds. Additionally, with changing libraries and rates of movie streaming services, the appeal of owning 4K Blu-rays for uninterrupted access to favorite films is highlighted, noting that several titles are currently available at their lowest prices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]