[
  {
    "title": "U.S.-China Deal on TikTok Ensures American Control, Awaiting Beijing's Response",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 23:16:40 GMT",
    "source": "Axios",
    "sources": [
      "Financial Post",
      "Axios",
      "Global News",
      "CityNews",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com",
      "ottawa.citynews.ca",
      "globalnews.ca",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE1sX2dONGlOeWtIZ2xuYkgxZDZGUEdsaUtsRTF5Q0dHR1lPU1VxMDZvR05KMHJHRUdBVEZscG9TQW44cVNWSVpWMTdHR3UyWlNJS2JCQjlabnduWTZNVUtJcEM4OA?oc=5\" target=\"_blank\">TikTok deal will be signed soon, with U.S. control of algorithm, White House says</a>&nbsp;&n",
      "White House press secretary Karoline Leavitt expressed confidence that the agreement would be finalized soon, saying she anticipates it will happen 'in the coming days.'",
      "The White House said Oracle would be responsible for TikTok's data and security and that Americans will control six of the seven seats for a planned board.",
      "WASHINGTON (AP) &#8212; An emerging TikTok deal with China will ensure that U.S. companies control the algorithm that powers the app&#8217;s video feed and Americans will hold a majority of seats on a board overseeing U.S. operations, the White House said Saturday. A central question to the tug of w",
      "WASHINGTON (AP) — An emerging TikTok deal with China will ensure that U.S. companies control the algorithm that powers the app&#8217;s video feed and Americans will hold a majority of seats on a board overseeing U.S. operations, the White House said Saturday. A central question to the tug of war bet"
    ],
    "image_url": "",
    "titles": [
      "TikTok deal will be signed soon, with U.S. control of algorithm, White House says - Axios",
      "Emerging TikTok deal ensures U.S. oversight of algorithm, White House says",
      "U.S. would control TikTok’s board and algorithm under emerging deal with China, White House says",
      "Emerging TikTok deal with China ensures US control of board and crucial algorithm, White House says",
      "Emerging TikTok deal with China ensures US control of board and crucial algorithm, White House says"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.814,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.831,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House announced an upcoming deal with China regarding TikTok, stating that it will ensure U.S. control over the app's algorithm and a majority of seats on its board overseeing U.S. operations. Oracle is set to handle TikTok's data and security. The deal, aimed at keeping TikTok online in the U.S., has been signaled as \"approved\" by President Trump, although Beijing has not yet commented. The agreement is expected to be finalized \"in the coming days.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK to Recognize Palestinian State Amid Israel Crisis",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 06:12:00 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A host of countries, including France and Canada, are expected to do the same when world leaders gather at the UN General Assembly next week.",
      "The PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza.",
      "The UK and Portugal are poised to announce their recognition of the state of Palestine ahead of a key week at the UN General Assembly. Several other Western nations are set to follow suit in the coming days. DW has more.",
      "Move comes as Israel intensifies military action in Gaza and expansion of settlements in the West Bank",
      "<p>Keir Starmer expected to confirm move after concluding the situation has worsened significantly in recent weeks</p><p>The UK is expected to <a href=\"https://www.theguardian.com/world/2025/sep/19/what-uk-recognition-palestine-state-will-mean\">recognise a Palestinian state</a> on Sunday after Israe"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9c9b/live/cd279bf0-965f-11f0-937e-e53bdd730b8c.jpg",
    "titles": [
      "Starmer set to announce UK recognition of Palestinian state",
      "Why Starmer decided the time was right to recognise a Palestinian state",
      "Middle East: UK, Portugal set to recognize Palestinian state",
      "Starmer set to announce UK recognition of Palestinian state",
      "UK set to recognise Palestinian state on Sunday"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.94,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK is set to recognize a Palestinian state on Sunday, following a worsening situation in Israel. This decision comes as other countries, including France and Canada, plan similar announcements at the upcoming UN General Assembly. The move was hinted at by the Prime Minister, contingent on Israel not taking steps towards peace, such as agreeing to a ceasefire in Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former Liverpool Women's Manager Matt Beard Dies at 47",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 07:42:53 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Former Liverpool manager Matt Beard has died at the age of 47, the Women's Super League club announces.",
      "<ul><li><p>Beard guided Liverpool to WSL titles in 2013 and 2014</p></li><li><p>Club say they are ‘deeply shocked and saddened’</p></li></ul><p>The former Liverpool manager Matt Beard has died at the age of 47, the Women’s Super League club have announced. A Liverpool statement expressed the club’s ",
      "Former Liverpool Women manager Matt Beard has died aged 47.&#160;"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d0e/live/9df73270-9662-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Former Liverpool manager Beard dies aged 47",
      "Matt Beard, former manager of Liverpool Women, dies aged 47",
      "Former Liverpool Women manager Matt Beard dies aged 47"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Liverpool Women's manager, Matt Beard, has passed away at the age of 47, as announced by the Women's Super League club. Beard led Liverpool to Women's Super League titles in 2013 and 2014. The club expressed being \"deeply shocked and saddened\" by his death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyberattack Hits Major European Airports, Causes Delays and Cancellations",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 04:14:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "London&#039;s Heathrow and Brussel airports tell passengers to expect more delays on Sunday as interruption persists.",
      "<p>Attack raises questions over security as Brussels and Berlin airports’ check-in and boarding systems also affected</p><p>Flights have been delayed and cancelled at three leading European airports – including London’s largest, Heathrow – after the company behind the software used for check-in and ",
      "A disruption to check-in and boarding systems had snarled departures through Saturday at airports in Berlin, Brussels, Dublin and London."
    ],
    "image_url": "",
    "titles": [
      "Delays continue to affect thousands as cyberattack hits Europe’s airports",
      "Heathrow flights delayed and cancelled as cyber-attack hits European airports",
      "Cyberattack Causes Delays at Heathrow and Other Airports in Europe"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.922,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A cyberattack disrupted check-in and boarding systems at several major European airports, including Heathrow, Brussels, and Berlin's Brandenburg, causing delays and cancellations. The attack targeted a service provider used by these airports, leading to a reliance on manual processes. Despite the disruptions, the impact on travelers was described as limited, but the incident highlighted security vulnerabilities in airport systems.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stanton Hits 450th Career HR, Ranks 41st All-Time in MLB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 00:58:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Giancarlo Stanton became the sixth player to hit his 450th career home run in a New York Yankees uniform in Saturday's 6-1 victory over the Baltimore Orioles.",
      "<p>Watch as New York Yankees outfielder Giancarlo Stanton hits a three-run homer in the first inning of the team&#8217;s matchup against the Baltimore Orioles, giving him 450 home runs in his career.</p>"
    ],
    "image_url": "",
    "titles": [
      "Stanton making HOF case with 450th career HR",
      "Yankees’ Stanton hits three-run blast for 450th career home run"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Giancarlo Stanton hit a three-run homer in the first inning during a game against the Baltimore Orioles at Camden Yards. This home run marked his 450th career homer, placing him in sole possession of 41st place on MLB's all-time home run list.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rangers Preseason Game Schedule, TV Info, and Centennial Jersey Details Released",
    "domain": "sports",
    "source_domain": "www.lohud.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 07:01:09 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "NHL",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "www.lohud.com"
    ],
    "snippets": [
      "Here's how to watch the Rangers preseason game, including time, TV schedule and streaming information.",
      "<a href=\"https://news.google.com/rss/articles/CBMiWEFVX3lxTE9NeWs2RXRsa0Q3dFZzNWg5R3k1WExQWE05eFVJaG54b3pRcGlPZ1ZSNm55Y2VGMUlrbFpwYUJaSHBiSGN6VDhMRW1Bc2VvM2dTUzFkRVBtQVg?oc=5\" target=\"_blank\">Centennial Jersey | New York Rangers | New York Rangers</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL.com</font>"
    ],
    "image_url": "",
    "titles": [
      "What channel is New York Rangers vs New Jersey Devils on today? Time, TV, streaming",
      "Centennial Jersey | New York Rangers | New York Rangers - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Rangers preseason game details are available, including the time, TV schedule, and streaming information. Additionally, there's information on the New York Rangers' Centennial Jersey. For more details, refer to the provided link.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Eyes Role as Europe's Key Energy and Defense Supplier",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 20 Sep 2025 19:03:07 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "The federal finance minister spoke in Europe about the benefits for both Canada and the European Union in solidifying trade deals and other agreements.",
      "OTTAWA &#8212; Canada&#8217;s finance minister says the country could be a &#8220;supplier of choice&#8221; for European markets looking to bolster energy security and defence capabilities. Following a meeting in Denmark with European Union finance ministers, Francois-Philippe Champagne said Saturda"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/78e279cfa1f05ad313e6e3b7b61122a33e857e11fbc92b1623a9ce91506051bf_ae5958.jpg?quality=65&strip=all",
    "titles": [
      "Champagne promoting Canadian critical mineral and energy exports in Europe",
      "Champagne tries to sell Europe on Canadian energy, critical mineral exports"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.761,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.657,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada's Finance Minister, Francois-Philippe Champagne, highlighted the potential benefits of Canada as a \"supplier of choice\" for Europe in energy security and defense during a meeting with EU finance ministers in Denmark. This aims to strengthen trade and agreements between Canada and the European Union.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Couple Detained by Taliban Freed, Arrive in UK",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 07:13:14 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Their son tells the BBC he is \"overwhelmed\" by release after nearly eight months in prison.",
      "<p>Barbie Reynolds, 76, and husband Peter, 80, were released after being held without charge for nearly eight months</p><p>A British couple who were detained without charge for nearly eight months by the Taliban in Afghanistan have arrived in the UK.</p><p>Barbie Reynolds, 76, and her husband Peter,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8ab3/live/923ef370-9629-11f0-8115-2505008faa13.jpg",
    "titles": [
      "British couple held by Taliban arrive in UK after release",
      "British couple detained by Taliban in Afghanistan return to UK"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A British couple, Barbie Reynolds, 76, and Peter Reynolds, 80, were detained by the Taliban in Afghanistan for nearly eight months without charges. They have now arrived in the UK, their son expressing he is \"overwhelmed\" by their release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Law Bans Police from Wearing Facial Coverings",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 20 Sep 2025 18:02:48 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "NPR"
    ],
    "domains": [
      "globalnews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "The law, opposed by police organizations, was aimed by lawmakers at immigration agents and will test state powers over the conduct of federal officials.",
      "The new law prohibits neck gators, ski masks and other facial coverings for local and federal officers, while they conduct official business."
    ],
    "image_url": "",
    "titles": [
      "California bans masks meant to hide law enforcement officers' identities",
      "California bans mask use for most law enforcement officers during operations"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.81,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A new law, opposed by police organizations but supported by lawmakers, restricts local and federal officers from wearing neck gators, ski masks, and other facial coverings while conducting official business. This legislation aims to test state powers over federal officials' conduct, particularly targeting immigration agents.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube Suspends Venezuelan President Maduro's Account",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 06:57:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "State TV channel Telesur reports that Maduro’s channel has been &#039;eliminated&#039;.",
      "BOGOTA, Colombia (AP) &#8212; The YouTube account of Venezuelan President Nicolas Maduro was offline Saturday, with Venezuelan state-run channel Telesur claiming in a message on X that it was &#8220;eliminated&#8221; late the previous night without justification. YouTube&#8217;s parent company Googl"
    ],
    "image_url": "",
    "titles": [
      "YouTube account for Venezuela’s Maduro is down as tensions with US escalate",
      "Venezuelan president’s YouTube account offline as tensions with US escalate"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The YouTube account of Venezuelan President Nicolas Maduro was taken offline, as reported by state TV channel Telesur and confirmed by the situation on Saturday. Telesur claimed the account was \"eliminated\" without justification late Friday night. This incident has been noted without a detailed explanation from YouTube or its parent company, Google.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 4 College Football Puts Coaches' Futures in Jeopardy",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:49:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Several hot seat coaches ran into major problems in Week 4",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPMlZwOWVwaDl2SmlLTVV4SmJOTGN4VVI1ZjF5OUxEQW82U2VJbnpTdU5FREpWMGFKYmhRWjduZTJGZVE0ZXhXZ0ctSlg3dHpRZkZaYUZYS3pNV0U3QWJtUHRUVVludE5PQlRRdkREb3d4MUtfckxKcEdSTXpHTFVmVDhVb3BIWk5VWWp4ejVVSUF0N3VNNW9uT1J4X28?oc=5\" target=\"_blank\">B/R's 2025 Colle",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPUk82RkgwLUZJbk1scVBDRm92TExBR0pPeTVVNFVxX0dZVmpRdGl6LUFubnREWWJodUhlVzVVNWVDRk5QTDBpc0w0ZENPamxfLTBZcExHVnZ6V3JoVWViOGdlalVvSG16bDZPS1VPN193SUVSanlvSWxjRS15RUdMMHcxbUVsSVN6Y19IN1VDeTF0d2Zvbm9paGV0elc?oc=5\" target=\"_blank\">Texas Tech Is Co"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/9c9b1aab-7421-4b2d-b271-94f3980f8db3/david-stone-1.jpg",
    "titles": [
      "College football winners, losers in Week 4: Oklahoma wreaking havoc up front, seat grows red-hot at Wisconsin",
      "B/R's 2025 College Football Winners and Losers from Week 4 - Bleacher Report",
      "Texas Tech Is College Football's Next Powerhouse in the Making - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Several coaches on the hot seat faced significant challenges in Week 4 of the college football season. The outcomes of these games have intensified discussions about their future in their respective programs. The specific issues and results for these coaches were highlighted, indicating that their positions may be increasingly precarious.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Trout Hits 400th Career HR, Becoming 59th Player to Reach Milestone",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:43:09 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Trout is one of two active players with 400 home runs",
      "Stanton is the active leader in career homers",
      "<p>Los Angeles Angels superstar Mike Trout hits his 400th career home run vs. the Colorado Rockies, becoming the just the 59th player to accomplish the feat. </p>",
      "<p>A difficult season for Mike Trout and his Los Angeles Angels team came with a historical benchmark Saturday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/b17398ba-94ef-46b2-a8ff-079dba68b021/mike-trout-hr.jpg",
    "titles": [
      "Mike Trout hits career home run No. 400: Angels slugger becomes just 59th MLB player to reach milestone",
      "Giancarlo Stanton crushes 450th career home run vs. Orioles, becomes fifth-fastest player to milestone",
      "Angels’ Trout launches 400th career home run",
      "Angels’ Trout hits 400th career homer in win, 59th player in majors to reach mark"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mike Trout of the Los Angeles Angels hit his 400th career home run against the Colorado Rockies, becoming the 59th player in history to reach this milestone. This achievement comes during a challenging season for both Trout and his team. Trout is now one of two active players with at least 400 home runs, with Stanton leading as the active career homer leader.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New H-1B Visa Fee Applies Only to New Applicants, White House Clarifies",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 03:25:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "As Trump&#039;s order stirs anxiety, White House says the fee applies to new applicants and will be levied per application.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTFBpZG1iRlJ6VGhuWlJGdFJjblR5TS1ZTEdaMzFLeFk0UUh2RGNraWpMU3hvMmZkU2tLSXBNUFRaQVktX1JQbGUxZ25JVE9jLU8xSDJlZm1lRFB2MzgyTTlCMkcwNTFHRHFUVk5MaHBR?oc=5\" target=\"_blank\">New H-1B visa fee will not apply to existing holders, official says</a>&nbsp;&n"
    ],
    "image_url": "",
    "titles": [
      "US says $100,000 fee for H-1B visas will not apply to existing holders",
      "New H-1B visa fee will not apply to existing holders, official says - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House clarified that a new fee for H-1B visa applications will only affect new applicants, not existing visa holders. This decision comes amid concerns over the financial impact on those seeking work in the U.S. under this program.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Duc Phuc Wins Intervision Contest in Moscow, Vietnam Triumphs",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 04:17:42 GMT",
    "source": "BBC",
    "sources": [
      "Financial Post",
      "BBC"
    ],
    "domains": [
      "financialpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Vietnam was among 23 countries competing in a glitzy Russian song contest, revived three years after Russia was banned from Eurovision.",
      "When Vietnamese singer Duc Phuc held aloft the crystal cup trophy in Moscow&#8217;s Live Arena on Saturday night, he became the inaugural winner of new song contest Intervision &#8212; a Russian answer to Eurovision that some say is as much about politics and power as it is about performance. In a s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0844/live/1559a530-9697-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Vietnamese singer Duc Phuc wins Russia's Intervision song contest",
      "Power, politics and performance: Russia’s revamped Intervision song contest names a winner"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Vietnamese singer Duc Phuc won the inaugural Intervision song contest in Moscow, marking Vietnam's victory among 23 competing countries. This event comes three years after Russia's ban from Eurovision, suggesting Intervision serves as a Russian alternative to the popular European contest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Raises H-1B Visa Fees; Tech Firms Advise Workers to Stay in US",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-20T21:53:57Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The Trump administration said Friday it would raise application fees for the H-1B visa, causing companies and lawyers to scramble to advise workers.",
      "Large tech companies have responded to President Donald Trump’s dramatic changes to H-1B visa applications by telling employees with those visas to remain in the United States for now."
    ],
    "image_url": "https://i.insider.com/68cea97357d362d375e8914b?format=jpeg",
    "titles": [
      "Read the memos sent to Amazon, Microsoft, Google, and Goldman Sachs staff about Trump's H-1B fees: 'Stay in the country for now'",
      "Amazon, Google, Microsoft reportedly warn H-1B employees to stay in the US"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.807,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration announced an increase in H-1B visa application fees, prompting companies and lawyers to quickly advise affected workers. In response, large tech firms advised employees holding H-1B visas to stay in the U.S. due to the changes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frost Leads UCF to 3-0 Start, Jackson Shines in 34-9 Win Over North Carolina",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 01:05:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "In his return to Orlando, Frost is 3-0 this season with the Knights after beating the Tar Heels",
      "<p>UCF&#8217;s Tayven Jackson threw for 223 yards and scored a passing and rushing touchdown to guide UCF to a 34-9 victory over North Carolina.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/726eb584-499c-4223-ab4b-0b6d9eb8734d/frost.png",
    "titles": [
      "Scott Frost says 'Central Florida' remark from Bill Belichick was 'ammo for UCF' after win over North Carolina",
      "Bill Belichick, North Carolina lose badly against UCF"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his return to Orlando, Coach Frost has led UCF to a 3-0 season start, including a 34-9 win over North Carolina. UCF's Tayven Jackson contributed with 223 passing yards, along with a passing and rushing touchdown, securing the victory for the Knights.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers' Clayton Kershaw Announces Retirement After Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 12:42:15 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Clayton Kershaw, a three-time National League Cy Young Award winner and 11-time All-Star with the Dodgers, will retire after this season. \"I'm at peace with it,\" he said. \"I think it's the right time.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPUUFqYjdQWE5BQ1phMjItZWxzMUJ5LWwwRHp0OGJQandYNDFuVFBRNmg2YVlDVHdjaEM3YXdjT3MwX2JjX0lhOC1va3BMM2J6VG5ESU1TdkFVbnZveHFqSmQ3TjFOTGNOalZ0U18zYWJpYk1SbGZtMkEybVp1RmlucHl3SjB3UDA4Vy1OWg?oc=5\" target=\"_blank\">Giants Pitcher in Awe of Dodgers' Cla"
    ],
    "image_url": "",
    "titles": [
      "⚾ Dodgers' Clayton Kershaw to retire after season",
      "Giants Pitcher in Awe of Dodgers' Clayton Kershaw - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.725,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Clayton Kershaw, a celebrated pitcher for the Dodgers, announced his retirement after the season. A three-time National League Cy Young Award winner and 11-time All-Star, Kershaw expressed being at peace with his decision, believing it to be the right time to retire.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Takes Pole in Chaotic Azerbaijan GP Qualifying with 6 Red Flags",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 10:26:51 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com"
    ],
    "snippets": [
      "Max Verstappen denied Carlos Sainz and Williams a shock pole position in one of the great Formula 1 qualifying sessions, featuring six red flags.",
      "<ul><li><p>Session marred by driver mishaps, rain and six red flags</p></li><li><p>McLaren drivers make big errors in marathon session</p></li></ul><p>Misjudgment and error left Formula One’s leading lights flailing on the streets of Baku, but Max Verstappen delivered pole position for the Azerbaija"
    ],
    "image_url": "",
    "titles": [
      "F1 chaos! Verstappen on pole, Piastri 1 of 6 crashes",
      "Verstappen grabs pole for Azerbaijan GP as Piastri crashes out in F1 qualifying chaos"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.691,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.625,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Max Verstappen secured pole position in a dramatic Azerbaijan Grand Prix qualifying session, overshadowed by six red flags due to multiple crashes and driver errors, including those from McLaren drivers and championship leader Oscar Piastri. The session was further complicated by adverse weather conditions, making it a challenging day for teams and drivers alike.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Imposes $100K Fee on H-1B Visas, Sparks Corporate Concern",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 21:45:46 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The announcement to impose a $100,000 annual fee on H-1B visas sent shockwaves through corporate America.",
      "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers."
    ],
    "image_url": "",
    "titles": [
      "Big Tech companies, foreign governments scramble after Trump slaps $100,000 fee on H-1B visas",
      "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.789,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump signed a proclamation imposing a $100,000 annual fee on H-1B visas, aimed at skilled foreign workers. This move has caused significant concern among corporations in America and has been criticized by immigration hard-liners for allegedly replacing American workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seattle's Bryan Woo Day to Day with Pectoral Inflammation",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 22:00:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Seattle is trying to avoid a stint on the injured list ahead of the playoffs",
      "<p>Seattle right-hander Bryan Woo has “minor inflammation” in his pectoral muscle and is listed as day to day, manager Dan Wilson said Saturday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/20/1e2acc8e-30a3-42af-8c2f-4808c28cc083/bryan-woo-mariners-g.jpg",
    "titles": [
      "Bryan Woo injury update: Mariners starter dealing with pec muscle inflammation after leaving start vs. Astros",
      "Mariners’ Bryan Woo day-to-day with minor pectoral inflammation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.809,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Seattle's right-hander Bryan Woo is dealing with \"minor inflammation\" in his pectoral muscle, making him day to day, according to manager Dan Wilson. This situation arises as Seattle aims to keep its players off the injured list before the playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Approves $14.1B Takeover with \"Golden Share\" Condition",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 17:43:33 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "The intervention marked Trump's first use of so-called \"golden share\" rights, a condition of the $14.1 billion takeover cleared in June.",
      "This marks the latest move by the administration to exert power over private industry."
    ],
    "image_url": "",
    "titles": [
      "Trump wields ‘golden share’ to halt U.S. Steel plant shutdown, WSJ reports",
      "Trump is already wielding his ‘golden share’ authority at U.S. Steel, overriding the company’s plans for an Illinois plant, report says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.725,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In June, the administration approved a $14.1 billion takeover, which included a condition allowing the use of \"golden share\" rights. This intervention marks the first time those rights have been utilized by Trump, highlighting the administration's ongoing efforts to exert influence over private industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Estonia Seeks NATO Talks After Russian Jets Violate Airspace",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Sat, 20 Sep 2025 15:54:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Estonia has asked to consult other Nato members after warplanes violated its airspace.",
      "After entering Estonian airspace without clearance on Friday, officials now say the Russian pilots ignored warnings from NATO aircraft."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "Russian Warplanes Breach Nato Airspace",
      "Russian jets violating Estonia airspace ignored NATO warning, officials say"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.698,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Estonia has requested consultations with NATO members following an airspace violation by Russian warplanes on Friday. The officials reported that the Russian pilots entered Estonian airspace without permission and ignored warnings from NATO aircraft.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brock Lesnar Triumphs at WWE WrestlePalooza 2025 in Indianapolis",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 22:18:10 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "WWE WrestlePalooza 2025 marked a controversial win for Cody Rhodes, who beat Drew McIntyre thanks to a few mistakes by the referee.",
      "WWE Wrestlepalooza results, winners and grades from the Gainbridge Fieldhouse in Indianapolis, IN. Cody Rhodes defended the WWE Title against Drew McIntyre.",
      "AJ Lee submitted Becky Lynch with a Black Widow as Lynch and CM Punk exacted revenge on Seth Rollins and Becky Lynch.",
      "AJ Lee and CM Punk beat Becky Lynch and Seth Rollins at WWE WrestlePalooza 2025 when Lee submitted \"The Man\" to win her first match in a decade.",
      "Congratulations poured in after Stephanie Vaquer won the WWE Women's Championship, but Naomi had some spice to add to the moment.",
      "WWE Wrestlepalooza 2025 results as Stephanie Vaquer captures the WWE Women's World Championship, defeating Iyo Sky.",
      "Stephanie Vaquer beat Iyo Sky at WWE WrestlePalooza 2025 in a stellar match to win the Women's World Championship.",
      "The Vision defeated The Usos in a brutal tag-team match that left Jey Uso legitimately busted open. Here's how it happened.",
      "The Vision spoiled the Usos' reunion at WWE WrestlePalooza 2025 as Bronson Reed and Bron Breakker picked up an important win.",
      "Brock Lesnar destroyed John Cena with several F-5's as the Beast returned to dominant form, physically looking as big as he's ever looked.",
      "WWE WrestlePalooza 2025 marked an epic return for Brock Lesnar, who absolutely dismantled John Cena in a lopsided match."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cf5721051a61b965ab54af/0x0.jpg?width=960",
    "titles": [
      "WWE WrestlePalooza 2025 Results As Cody Rhodes Topples Drew McIntyre",
      "WWE Wrestlepalooza 2025 Results, Winners And Grades On September 20",
      "WWE Wrestlepalooza 2025 Results As AJ Lee Taps Out Becky Lynch, CM Punk Gets Revenge",
      "WWE WrestlePalooza 2025 Results As AJ Lee Submits Becky Lynch",
      "WWE Wrestlepalooza Results: Naomi Sends A Message After Vaquer’s Win",
      "WWE Wrestlepalooza 2025 Results As Stephanie Vaquer Beats Iyo Sky In A Classic",
      "WWE WrestlePalooza 2025 Results As Stephanie Vaquer Defeats Iyo Sky In Instant Classic",
      "WWE Wrestlepalooza Results: How Jey Uso Got Busted Open",
      "WWE WrestlePalooza 2025 Results As Bron Breakker And Bronson Reed Beat The Usos",
      "WWE Wrestlepalooza 2025 Results As Brock Lesnar Easily Destroys John Cena",
      "WWE WrestlePalooza 2025 Results As Brock Lesnar Demolishes John Cena"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.885,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "WWE WrestlePalooza 2025 in Indianapolis featured Brock Lesnar's dominant return, defeating John Cena with multiple F-5s. The event, WWE's first Premium Live on ESPN Unlimited, also starred Seth Rollins, Cody Rhodes, and others.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "AEW All Out 2025 Elevates Competition with WWE at Scotiabank Arena",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 22:15:34 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "All Out signaled a change of direction for AEW across the board, so what stood out from a packed night of in-ring action?",
      "AEW All Out 2025 results, winners and match grades from the Scotiabank Arena in Toronto, Ontario-Canada. AEW All Out will compete with WWE Wrestlepalooza."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cf5c2489982f8db0d7afd8/0x0.jpg?width=960",
    "titles": [
      "AEW All Out 2025 Results: 4 Takeaways That Mark A Turning Point",
      "AEW All Out 2025 Results, Winners And Match Grades On September 20"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.884,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "AEW All Out 2025, held at the Scotiabank Arena in Toronto, marked a significant shift for AEW with notable in-ring action. The event featured various matches, winners, and grades, positioning AEW to compete directly with WWE's Wrestlepalooza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]