[
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "summary": "Journalist Mark Lowen, who was covering protests in Istanbul, was arrested and then deported to the UK, as reported by the BBC.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "summary": "The current government is at risk of being the first in almost 100 years to not win re-election for a second term.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:40:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care",
    "summary": "The Trump administration intends to save $11.4 billion by stopping and withdrawing COVID-19 era grants. Addiction specialists express concern that this decision may risk patient health by limiting access to essential care.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:22:09 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "The Trump administration restructures federal health agencies, cuts 20,000 jobs",
    "summary": "The Department of Health and Human Services is restructuring, decreasing its divisions from 28 to 15 and implementing a workforce reduction.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:50:01 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "summary": "Ubisoft has established a subsidiary focused on its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six series. Tencent has acquired a 25% stake in this subsidiary with an investment of about $1.3 billion, valuing the company at approximately $4.3 billion.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "RFK to slash 10,000 jobs in major overhaul of US health agencies",
    "summary": "The U.S. Department of Health and Human Services (HHS) has unveiled a plan to restructure the agency in response to recent instability and rumors of widespread layoffs.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:06:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the NCAA collaborated with the university to unjustly make him the scapegoat in a situation, referring to himself as a \"sacrificial lamb.\"",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "NWSL: Denver details plans for temporary stadium",
    "summary": "Denver's newly announced NWSL expansion team plans to build a training center and a temporary 12,000-seat stadium in Centennial, Colorado, as revealed on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:10:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "One room, 300 clubs, 80 agencies, 3,500 meetings: Inside soccer's secret transfer space",
    "summary": "TransferRoom is a platform designed for soccer industry professionals to connect, often compared to \"speed dating\" for its quick-meeting format, as noted by Rob Dawson.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "'I feel like I have everything in front of me': Inside the $765 million marriage of Juan Soto and the Mets",
    "summary": "The New York Mets have initiated a significant change by signing a free agent to a substantial contract, marking a new phase for both the team and Major League Baseball (MLB).",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:10:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Betting buzz: Gator fan's $5 parlay worth $168K ... if Duke wins",
    "summary": "A Florida Gator fan is considering whether to accept a $168,000 payout from a parlay bet, contingent on Duke winning their next game.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "summary": "Researchers have created a new statistical method that enables people to explore their family history through a dynamic, movie-like representation, illustrating the global movements of their ancestors. This method can also be used to model the spread of diseases and track animal migration patterns across various regions.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "summary": "Researchers found that increased meltwater and rainfall account for 60% of the observed gap between predicted and actual ocean temperatures near Antarctica in recent years.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "summary": "A recent study highlights that many Long COVID patients feel neglected and doubted by their healthcare providers, indicating a lack of support and understanding for their condition.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "summary": "Researchers discovered that vertebrate skeletal cells come from different precursor cells depending on their body region and have unique gene regulation patterns. This diversity in gene regulation could be key to vertebrates' evolutionary success.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, is advocating for the inclusion of eugenics in college genetics curriculums. He argues that this will aid scientists in countering the misuse of science for political purposes by encouraging them to voice their concerns.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "summary": "Soil analysis in twelve Dublin parks revealed that entrances have higher contamination of infective roundworm eggs than other park areas.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "summary": "Experts caution that the risk of wildfires is heightened due to a mix of strong winds, dry weather, and the presence of pine trees.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Pro-Palestinian student awaits court ruling on deportation from the US",
    "summary": "Momodou Taal, a PhD student from The Gambia studying at Cornell University, faces the possibility of deportation from the United States.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:31:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "summary": "Experts have predicted outcomes for the 2025 baseball season, focusing on the Los Angeles Dodgers' championship prospects and identifying potential Most Valuable Player (MVP) candidates.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "summary": "Premier League clubs will have an early 10-day transfer window in June to prepare for the FIFA Club World Cup. The transfer window will then reopen on June 16, according to an announcement from the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "We answered the biggest college softball questions: POY, WCWS picks and sleepers",
    "summary": "Midseason discussions by college softball experts highlight that several teams face major challenges ahead. These teams are under scrutiny to show their potential and ability to succeed in the rest of the season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:19:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "First bets: Early picks for 2025 NFL season win totals",
    "summary": "Experts have shared their predictions on the opening season win totals for different teams, highlighting specific totals they believe are worth betting on for those interested.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "The woman who killed Tejano music icon Selena in 1995 has been denied parole",
    "summary": "Yolanda Saldívar, who was convicted in the 1995 murder of singer Selena Quintanilla-Perez in Texas, has been denied parole. Saldívar has served decades in prison since the incident, which occurred at a motel.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:37:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump's new tariffs on imported cars could have a clear winner: Tesla",
    "summary": "President Trump announced a 25% tariff on imported cars, expected to increase vehicle prices significantly. Tesla is predicted to be less impacted by this tariff compared to other car manufacturers.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:36:20 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge accuses Trump administration of trying to undermine judiciary",
    "summary": "The Justice Department has charged Howell with displaying consistent bias against President Trump by stopping the enforcement of one of his executive orders.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:49:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "GOP leaders accused of making threats to block bill to let new moms vote remotely",
    "summary": "Bipartisan lawmakers are advocating for a House vote on a proposal that would allow new parents to vote by proxy for 12 weeks. House Speaker Mike Johnson opposes the proposal, citing Constitutional concerns.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:23:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "China Tries to Reboot Its Economy as Competitors Circle",
    "summary": "China is facing economic difficulties, such as falling demand for its products, surplus industrial capacity, and high debt, exacerbated by a tariff conflict with the US. To counter these issues, the Chinese government is trying to encourage business investment. Concurrently, Vietnam is capitalizing on China's economic challenges by experiencing an increase in manufacturing activities.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 16:43:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Food is running out in Gaza nearly a month into Israeli blockade",
    "summary": "The World Food Programme has reported a severe shortage of supplies in Gaza, stating it has only enough flour to last five days and a two-week supply of other food items.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:40:14 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Syria's transitional leader is a former jihadist. Can he help stabilize the region?",
    "summary": "Ahmed al-Sharaa, the founder of the Syrian branch of Al-Qaeda, is advocating for unity. Robert Worth, writing for The Atlantic, examines al-Sharaa's leadership efforts. Additionally, Worth discusses the Trump administration's employment of a Signal group chat in his analysis.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:12:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" but stated they are not connected to Moscow.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "summary": "The Canadian leader announced that Trump's tariffs have changed the Canada-US relationship, potentially impacting future cooperation between the nations.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "summary": "Greenland has declined a proposal for JD Vance and his wife to take control of the island, a concept previously supported by Donald Trump.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Six dead after tourist submarine sinks in Red Sea",
    "summary": "A tourist boat sank near Hurghada's promenade in the Red Sea on Thursday morning. Local officials confirmed that 39 individuals were rescued after the incident.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:42:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "summary": "Gertrudis Pineda told the BBC that she has no information about her son after he was transferred from the United States to a prison in El Salvador.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Germany leads defiance to Trump car tariffs, saying it 'will not give in'",
    "summary": "Major economies have pledged to take action following accusations by China that Washington has violated international trade rules.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "summary": "A former police officer has been found guilty of manslaughter relating to the death of Clare Nowland.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:50:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "summary": "A new technology has been developed, with analysts indicating that there was likely support from Russia in its development.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "summary": "A film starring Robert Downey Jr as Doctor Doom is set to be released in May 2026.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "summary": "A suspect was apprehended after a police operation, during which a local resident helped subdue the individual, as confirmed by police statements.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "summary": "In Kansas, a babysitter found a man hiding under a bed after a child she was looking after mentioned seeing a \"monster.\"",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'They invited me - now they're attacking me': Signal chat journalist speaks to BBC",
    "summary": "Jeffrey Goldberg, a journalist, was mistakenly included in a group chat with senior Trump administration officials. This incident has led to him becoming a focal point in political debates.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:17:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "summary": "Poland has passed a law allowing authorities to temporarily suspend asylum rights at its border with Belarus.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "summary": "Riek Machar and his wife were detained following the arrival of a convoy of 20 armed vehicles at his residence, as stated by his party.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "summary": "Algerian author Boualem Sansal, 80, claimed in an interview with a far-right news outlet that colonial France gave Algeria too much land during its colonial era.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "summary": "Six people died after a submarine sank near Hurghada, a popular tourist destination.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "summary": "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine, emphasizing his country's resilience amid ongoing challenges.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "summary": "The pet care industry in India is expanding as more wealthy city dwellers are spending on luxury items and services for their pets, particularly dogs and cats.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "summary": "A South East Asian country is ranked third for having the largest trade surplus with the United States, trailing behind China and Mexico.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How will Australia choose its next prime minister?",
    "summary": "As the nation nears its election on 3 May, a guide has been released to explain the electoral system and identify important elements to watch during the voting process.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:44:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "India: Why are private firms not investing despite record profits?",
    "summary": "A report has found that growth plans are being slowed down due to low domestic consumption and weak export demand.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:29:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ros Atkins on... Trump's plan for Greenland",
    "summary": "US Vice-President JD Vance will visit Greenland on Friday, highlighting the United States' increasing focus on the territory. The specific reasons for this interest were not disclosed.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:35:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Satellite images reveal how South Korea wildfires spread",
    "summary": "BBC Verify conducted an analysis on the rapid spread of wildfires in Korea, identifying various factors that contribute to their quick expansion.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:03:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Watch: How the South Korea wildfires became so deadly",
    "summary": "Rachel Lee of the BBC conducted an investigation into the causes behind the swift proliferation of wildfires, examining various contributing factors.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:01:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "summary": "Technology enables tasks to be automated by devices like self-driving cars and cleaning robots. While highly advanced sentient robots may remain out of financial reach for many, robot vacuums provide a more affordable solution for automating household chores.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "summary": "Amazon has initiated its Big Spring Sale, offering discounts on items such as gardening supplies and bedding. This sale event began with the arrival of the warmer months and is set to run until Monday, March 31, 2025.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "summary": "Nintendo announced \"Switch 2 Edition\" games after its Nintendo Direct stream, revealing them on a webpage for its forthcoming Virtual Game Card lending system, reported by VGC. This system is expected to launch soon.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "summary": "On Thursday, the White House initiated Podcast Row, granting several conservative podcasters access to senior officials from the Trump Administration. This event, intended to involve alternative media more closely, is set to be a regular occurrence, emphasizing the administration's effort to include new media channels.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "summary": "During Amazon's Big Spring Sale, discounts are available on several e-readers, including their first color model. The Kindle Scribe, unique for its note-taking capability, has its 16GB version priced at an all-time low.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "summary": "The Federal Trade Commission (FTC) staff have been instructed not to label the agency as \"independent\" in complaints, following guidance from Christopher Mufarrige, the Bureau of Consumer Protection Director. This directive was disclosed through an email obtained by The Verge.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "summary": "Canadian company Ploopy has launched the Classic 2 trackball mouse, an update of their original model. This new version features improved connectivity, a more accurate scroll wheel, and a redesigned structure that simplifies 3D printing, while still preserving the original design.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "summary": "Amazon's Big Spring Sale, running until March 31st, features over 90 deals on popular items. These offers are available to all customers, not just Amazon Prime members, and include a variety of affordable alternatives.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The best deals on MacBooks right now",
    "summary": "Amazon's Big Spring Sale is currently happening, offering notable discounts on a range of gadgets, including Apple MacBooks with M-series chips, as recommended by Verge. The sale features MacBooks in various sizes and prices. It's important to note that the M1 MacBook Air has been discontinued.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Panama approves embattled ex-President Martinelli’s passage to Nicaragua",
    "summary": "Former Panamanian President Ricardo Martinelli was convicted of money laundering and sentenced to 10 years in prison by a court in Panama.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:01:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "‘We won’t back down’: Global leaders threaten backlash to Trump auto tariff",
    "summary": "Canadian Prime Minister Mark Carney announced that Canada is exploring a variety of retaliatory measures in response to the imposition of 25-percent tariffs, though specific actions have not been detailed.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:33 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barcelona beat Osasuna to move three points clear in LaLiga",
    "summary": "The LaLiga leaders increased their lead to three points at the top of the table after securing a 3-0 win against Osasuna.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:39:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge orders Trump administration to preserve Signal texts on Houthi attack",
    "summary": "Judge James Boasberg issued a temporary restraining order to halt the deletion of messages involved in a controversial chat, ensuring that all communications are preserved for further review.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:52:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "German civil servant fired for Pro-Palestinian comment",
    "summary": "An individual was fired from their position for expressing support for Palestine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:10:59 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Will Donald Trump take Greenland by force?",
    "summary": "The US President has stated an interest in buying territory from Denmark, mentioning 'international safety and security' as the motivation behind this proposal.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:05:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Iran responds to Trump letter on nuclear talks, state media reports",
    "summary": "Iran's foreign minister has conveyed through Oman that Iran is willing to proceed with indirect talks.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:59:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Russia’s Putin eyes Arctic cooperation despite geopolitical tensions",
    "summary": "Russian President Vladimir Putin remarked that US President Donald Trump's proposal to buy Greenland was made with serious intent.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:39:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Families say loved ones wrongly deported from US based on tattoos",
    "summary": "In Venezuela, there are reports of individuals being wrongfully accused of being gang members and facing deportation due to their tattoos. Critics claim these tattoos are harmless and do not prove any criminal connections.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:09:43 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French-Algerian author Boualem Sansal sentenced to five years in prison",
    "summary": "Algeria has jailed a writer due to remarks made about its border with Morocco, heightening tensions with France.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:21:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israel’s parliament passes law to expand control over judge appointments",
    "summary": "Israel's government has made changes to the judiciary, sparking protests and concerns about the impact on the country's democratic principles.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:20:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Colombia and the US agree to collect and share biometric data for migrants",
    "summary": "Homeland Security Secretary Kristi Noem announced a new memorandum focused on decreasing undocumented migration by strengthening enforcement efforts.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:17:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mbappe, Vinicius among four Real Madrid players being investigated by UEFA",
    "summary": "The European football authority is investigating allegations of indecent behavior by four Real Madrid players after a match with Atletico Madrid.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:03:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five wounded in Amsterdam stabbing attack, police say",
    "summary": "Dutch authorities have detained one individual in connection to an attack near Dam Square in Amsterdam.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:10:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who’s winning the global race for critical minerals?",
    "summary": "US President Donald Trump has invoked wartime powers to boost the production of critical minerals.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "France’s Macron says not all European countries agree on force for Ukraine",
    "summary": "French President Macron proposed a 'reassurance force' amid tensions with Russia. In a related development, UK opposition leader Starmer criticized Russia for 'playing games' geopolitically.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:05:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who are the students Trump wants to deport?",
    "summary": "Several students, among them Rumeysa Ozturk, Mahmoud Khalil, and Badar Khan Suri, were targeted by former President Donald Trump.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "South Sudan opposition says vice president’s arrest ends peace deal",
    "summary": "The power-sharing agreement in South Sudan between leaders Kiir and Machar has failed, leading to worries about the return of civil violence in the country.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:56:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "US immigration officials detain Turkish student over pro-Palestine views",
    "summary": "A video has emerged displaying US federal agents, including both masked individuals and those in plain clothes, apprehending a Turkish PhD student from Tufts University.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:35:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Kids Under Fire",
    "summary": "American doctors volunteering in Gaza have reported observing a pattern where children are being shot by the Israeli military.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:30:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
    "summary": "In 2022, Europe increased its imports of Russian gas, as reported by the energy think tank Ember. This rise in imports resulted in billions of dollars flowing to Russia, which has been linked to funding its military actions in Ukraine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:25:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What’s happened in Sudan’s civil war after new Khartoum battles?",
    "summary": "The Sudanese army is seeking major wins in the capital, aiming for a pivotal moment in its clash with the RSF paramilitary forces.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:07:48 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Follow live: 1-seed Florida creating distance down the stretch vs. 4-seed Maryland",
    "summary": "Please provide the news content you need summarized.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:27:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "summary": "In his first game with the Mets, Juan Soto struck out with two outs in the ninth inning, leading to a 3-1 defeat against the Astros.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "O'Neill extends Opening Day home run record",
    "summary": "Orioles outfielder Tyler O'Neill established a new major league record by hitting a home run on Opening Day for the sixth straight year.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NBA 'digesting' Celtics sale before expansion talk",
    "summary": "NBA Commissioner Adam Silver stated the league plans to closely examine the potential for expansion following the completion of the Celtics' sale.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Harper's HR silences boos in Phillies' win vs. Nats",
    "summary": "On Opening Day, Bryce Harper, now with the Phillies, was booed by Nationals fans. Despite the negative reception, Harper hit a solo home run, aiding the Phillies in a 7-3 win against his former team, the Nationals.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "summary": "Former NFL player LeShon Johnson faces federal charges linked to dogfighting after 190 dogs were seized from his property last year.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Crosby breaks Gretzky's point-per-game record",
    "summary": "Sidney Crosby has broken the NHL record for the most consistent point-per-game performance in his career, overtaking the previous record shared with Wayne Gretzky.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Flyers GM: Fired Tortorella a 'complicated man'",
    "summary": "The Philadelphia Flyers have dismissed their coach, John Tortorella, as announced by General Manager Daniel Briere on Thursday. The decision was based on differing opinions between Briere and Tortorella, with Briere referring to Tortorella as a \"complicated man\" in relation to the firing.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:26:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The Calipari divorce worked out not only for Kentucky, but for Arkansas and BYU, too",
    "summary": "Three teams have advanced to the second weekend of competition following coaching changes across each team.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "From a famed Russian basketball academy to Provo, Egor Demin is dialed in",
    "summary": "Demin has pursued his dream across the globe and is now on the verge of guiding Brigham Young University (BYU) to notable achievements.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "summary": "NBA insiders are focusing on the season's MVP race, highlighting the competition between Nikola Jokic and Shai Gilgeous-Alexander.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "summary": "This basketball season has seen a record-breaking number of 3-point shot attempts, leading to debates on whether there should be a limit on how often these shots are taken in the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NHL playoff watch: Are the Minnesota Wild in trouble?",
    "summary": "A team's secure spot in the playoff standings has become uncertain, affecting projections for the entire postseason bracket.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:35:17 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Everything you need to know for MLB Opening Day, from lineups to live updates and takeaways",
    "summary": "The baseball season has begun, marking the start of all opening games and related activities.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted in the newest Sweet 16 player rankings. The rankings have sparked conversations about who among them deserves the number one position.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron have been instrumental in Notre Dame's basketball team's pursuit of a championship title this season, significantly impacting the team's performance.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "summary": "Mike Tannenbaum, acting as a general manager, participated in a hypothetical exercise where he made first-round selections for a draft.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "summary": "Recent allegations have sparked concern in college athletics over the potential for further athlete victimization.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "summary": "The top scorers in Europe's major football leagues, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1, are making significant impacts on their teams by leading the scoring charts with outstanding performances.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid, as announced on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, is not currently receiving any offers from other clubs, contrasting with his situation a year ago. This indicates that he does not have to make any immediate decisions about his future with the team.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "summary": "Barcelona's women's team moved into the Women's Champions League semi-finals by beating VfL Wolfsburg 6-1 in the second leg of their quarter-final, achieving a 10-2 win on aggregate. This victory underscores their strong performance as the defending champions.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "summary": "Manchester City will postpone any decisions about Claudio Echeverri's future with the team until the summer, as reported by ESPN from a source.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Davies' agent slams Canada staff over ACL tear",
    "summary": "Alphonso Davies' agent accused Canada's soccer team staff of mishandling the player by pressuring him to play against the United States, despite not being fully fit. This situation led to Davies tearing his ACL during the match.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Transfer rumors, news: Griezmann plans to stay at Atletico, eyes MLS for 2026",
    "summary": "Antoine Griezmann has chosen to stay at Atletico Madrid, putting off a potential move to the MLS until 2026, as per Transfer Talk reports.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Inside Brandon Graham's final, turbulent, triumphant season as an Eagle",
    "summary": "Graham and his family looked back on his 15-year career as he entered his final season.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:58:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "For Notre Dame and Marcus Freeman, writing a different ending is the final step",
    "summary": "The Fighting Irish team, following their appearance in the national title game last season, is gearing up for their upcoming season with an emphasis on sustaining their strong performance to achieve success in future contests.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:37:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "A pair of Queens: Maryland star Derik Queen signs NIL deal with Dairy Queen",
    "summary": "The Terrapins moved on to the Sweet 16 in the basketball tournament after their star center scored a game-winning buzzer-beater against Colorado State in the round of 32.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'Richie's Tater Shots': BYU's Saunders signs NIL deal with company founded by great-grandfather",
    "summary": "Saunders' great-grandfather was one of the founders of Ore-Ida, the company known for inventing the Tater Tot.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "summary": "This week's UFC Fight Night is drawing attention as both an MMA coach and a betting insider have shared their predictions for the fights, providing insights based on their professional expertise.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:02:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What the numbers tell us about Mayer vs. Ryan and Zepeda vs. Farmer",
    "summary": "On Saturday, scheduled rematches will take place in Las Vegas and Mexico, with an analytical focus on the numerical data related to the fights.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mikaela Mayer-Sandy Ryan rivalry explained: All you need to know",
    "summary": "The Mayer vs. Ryan boxing rematch is set for Saturday, drawing attention to their ongoing feud highlighted by a recent incident involving paint.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "summary": "The UFL season starts on Friday night, with all teams set to challenge Birmingham's top spot in the competition.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Logos, coaches, key players and more",
    "summary": "The UFL is launching its second season, showcasing teams, their coaches, and standout players. This development signifies the league's ongoing expansion and its success in drawing talent from the wider football community.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump pulls Stefanik nomination for U.N. ambassador because of thin GOP House majority",
    "summary": "The nomination of a Republican congresswoman for the Senate is now uncertain because some Republicans worry it might risk their narrow majority in the House of Representatives. Initially, her nomination was expected to proceed smoothly.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:33:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is reportedly close to buying Spanish football club Malaga, as per a source mentioned by ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.333
  }
]