[
  {
    "title": "Sinner to Face Alcaraz in US Open Final, Trump to Attend",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 01:16:32 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "BBC",
      "NPR",
      "CityNews",
      "ESPN",
      "Sky Sports",
      "Yahoo Sports",
      "Sports Illustrated",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "dpa-international.com",
      "www.espn.com",
      "ottawa.citynews.ca",
      "www.npr.org",
      "news.google.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Sinner is trying to become the first repeat men's champion in New York since Roger Federer won the tournament five years in a row. Alcaraz hasn't dropped a set as he pursues his second U.S. Open title.",
      "Jannik Sinner comes through an injury scare to win his US Open semi-final against Felix Auger-Aliassime and set up another tantalising Grand Slam final with Carlos Alcaraz.",
      "Jannik Sinner overcame Felix Auger-Aliassime to set up another final with Carlos Alcaraz, who defeated Novak Djokovic.",
      "Carlos Alcaraz and Jannik Sinner will meet for the third Grand Slam final in a row when they play for the US Open title.",
      "US President Donald Trump plans to watch the men's final of the US Open tennis tournament in person in New York on Sunday, organizers have confirmed. Trump will attend as the guest of a client at the Arthur Ashe Stadium and will watch from their suite as Spain's Carlos Alcaraz takes on Italy's Janni",
      "<ul><li><p>Sinner defeats Auger-Aliassime 6-1, 3-6, 6-3, 6-4</p></li><li><p>Italian joins Laver, Federer, Djokovic with slam feat</p></li><li><p>Alcaraz showdown will decide world No 1 ranking</p></li></ul><p>Jannik Sinner will meet Carlos Alcaraz for the US Open title after the defending champion s",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxObkhOZERaa2RoRnAwcEJTRjVhWlp5S2w3QWxNUlU4d2hlZm5ZMkZwMVd2cFNtdTNtQXpVcUxsMm0zMDVkUW12dFZVOFV5Y2RrRlh1YmJfdVBkRUtkWEZrTkRzdF8xdlR6aDAzWnpfcktEcnJ2TnVUMFUwTlNDejNTdHZnNWpCZ2VpZHhjeGlOMzFKYklIb1ZrTFkwMA?oc=5\" target=\"_blank\">Jannik Sinner Rea",
      "Carlos Alcaraz soaked up everything Novak Djokovic could throw at him before marching into his second US Open final and denying the 38-year-old a shot at a record-breaking 25th Grand Slam title.",
      "NEW YORK (AP) — Jannik Sinner beats Felix Auger-Aliassime at U.S. Open, will face Carlos Alcaraz in 3rd Grand Slam final in a row. The Associated Press",
      "Novak Djokovic has said he will not give up up on Grand Slams and will 'keep fighting' after he was knocked out of the US Open by Carlos Alcaraz in the semi-finals."
    ],
    "image_url": "",
    "titles": [
      "Alcaraz beats Djokovic at the U.S. Open and will meet Sinner for Grand Slam final",
      "Sinner wins to set up Alcaraz final at US Open",
      "US Open final: Alcaraz to play Sinner after ousting Djokovic",
      "Alcaraz vs. Sinner showdown set for US Open final",
      "Trump set to watch US Open final",
      "Sinner sees off Auger-Aliassime to reach historic US Open final with Alcaraz",
      "Jannik Sinner Reaches U.S. Open Final, Match With Carlos Alcaraz to Decide World No. 1 - Sports Illustrated",
      "Alcaraz and Sinner to renew rivalry in blockbuster US Open final",
      "Jannik Sinner beats Felix Auger-Aliassime at U.S. Open, will face Carlos Alcaraz in 3rd Grand Slam final in a row",
      "Djokovic will 'keep fighting' at majors but Alcaraz and Sinner 'too good'"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.942,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.873,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jannik Sinner defeated Felix Auger-Aliassime to reach the US Open final, where he will face Carlos Alcaraz, who beat Novak Djokovic in the semi-finals. This marks the third consecutive Grand Slam final between Sinner and Alcaraz. The winner will decide the world No. 1 ranking. US President Donald Trump plans to attend the final in New York.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Agrees to $1.5B AI Copyright Settlement, Pays Authors $3,000/Book",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T00:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CNBC",
      "Ars Technica",
      "The Verge",
      "Fortune",
      "Business Insider",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com",
      "www.businessinsider.com",
      "fortune.com",
      "news.google.com",
      "www.dw.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "If the court approves the deal, it will be the largest in the history of US copyright cases, according to lawyers for the authors.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFBERV9wVGlXZHdncG8tbnV1aVEwcHpxaGxZZzlSTHdQUkpkMHJkMGpkNG0wbGlFaDhMUUtWT2FxZGVrWjRrVTJYeGxKS2xxZTRVLXdmTmF0djVwZzFqckdka1VIOEFkam93dVFzN1drbmp3dkdR?oc=5\" target=\"_blank\">Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlemen",
      "Authors had sued Anthropic, claiming the artificial intelligence startup had illegally used their books to train its models.",
      "Anthropic agreed to pay over $1.5 billion to settle a lawsuit brought by authors who say the company used their pirated books to train its AI.",
      "Anthropic’s deal with authors may accelerate a shift toward licensing copyrighted material needed to train AI models, legal experts say",
      "In what’s potentially the first major payout to creatives whose work was used to train AI systems, Anthropic has reached an agreement to pay “at least” a staggering $1.5 billion, plus interest, to authors to settle its class-action lawsuit. The amount breaks down to smaller payouts expected to be ap",
      "Settlement shows AI companies can face consequences for pirated training data."
    ],
    "image_url": "",
    "titles": [
      "US: Anthropic to pay $1.5 billion in AI lawsuit settlement",
      "Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlement - Axios",
      "Anthropic agrees to pay $1.5 billion to settle authors' copyright lawsuit",
      "Anthropic agrees to pay authors over $1.5 billion for using their work to train AI, totaling around $3,000 a book",
      "Anthropic reaches $1.5 Billion settlement with authors in landmark copyright case",
      "Anthropic to pay $1.5 billion to authors in landmark AI settlement",
      "“First of its kind” AI settlement: Anthropic to pay authors $1.5 billion"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.859,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic has agreed to a $1.5 billion AI copyright settlement, under which it will pay authors $3,000 per book. This deal is seen by legal experts as potentially accelerating the trend towards licensing copyrighted material for AI model training.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers Beat Chiefs 27-21 in NFL Opener in Brazil, Ending Losing Streak",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 02:47:40 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.espn.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Chargers hold on for win at Corinthians Arena in São Paulo in the potentially critical AFC West battle.",
      "Justin Herbert stars for the Los Angeles Chargers as they beat the Kansas City Chiefs 27-21 in their NFL opener in Sao Paulo, Brazil.",
      "Justin Herbert finished off the Los Angeles Chargers' season-opening victory in style, sliding for a first down that effectively ended the game.",
      "<p>Justin Herbert threw for 318 yards and three touchdowns in outdueling Patrick Mahomes, and the Los Angeles Chargers beat Kansas City 27-21 on Friday night in Sao Paulo, snapping a seven-game skid to the Chiefs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Herbert shines as Chargers earn AFC West win over Chiefs in Brazil",
      "Herbert inspires Chargers to win against Chiefs",
      "Chargers stun Chiefs with 'monumental' win in Brazil",
      "Herbert outduels Mahomes to help Chargers beat Chiefs in Brazil"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.972,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Chargers defeated the Kansas City Chiefs 27-21 in their NFL season opener in São Paulo, Brazil. Justin Herbert led the Chargers with 318 passing yards and three touchdowns, outperforming Patrick Mahomes. This victory ended the Chargers' seven-game losing streak against the Chiefs and took place at the Corinthians Arena. Herbert's late-game slide for a first down sealed the win for the Chargers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Unveils $1T Potential Compensation Plan for Musk, Targets $8.5T Valuation",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T07:55:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ABC News",
      "Business Insider",
      "TechCrunch",
      "Deutsche Welle"
    ],
    "domains": [
      "www.businessinsider.com",
      "abcnews.go.com",
      "www.dw.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Tesla's board said the controversial CEO has threatened to leave the company more than once. The staggering pay package is designed to make him stay.",
      "Elon Musk is already the wealthiest person in the world.",
      "Elon Musk's $1 trillion Tesla pay package requires finding a successor, which could be a tall order for a brand so tied to its CEO.",
      "Tesla Chair Robyn Denholm said the proposed pay package for Elon Musk is meant to keep his \"focus and attention\" on the EV maker.",
      "Tesla has proposed a new 10-year compensation plan for CEO Elon Musk that could be worth as much as $1 trillion even as the EV maker's car business stumbles and it sets its sights on humanoid robotics and AI."
    ],
    "image_url": "",
    "titles": [
      "Tesla board proposes $1 trillion pay package for Elon Musk",
      "Tesla's proposed pay package could make Elon Musk a trillionaire",
      "Elon Musk could get a $1 trillion pay package &mdash; but he has to find his successor first",
      "Tesla's $1 trillion pay package for Elon Musk boils down to one thing: Keeping the attention of the world's richest man",
      "Tesla proposes new pay package for Elon Musk worth up to $1T"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.995,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla has introduced a new 10-year compensation plan for CEO Elon Musk, potentially worth up to $1 trillion. This plan requires Musk to increase Tesla's value from just over $1tn to $8.5tn. The proposal is notable for its ambitious growth target and the significant potential payout, amidst Tesla's focus on expanding into humanoid robotics and AI, despite challenges in its electric vehicle business.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "16 Killed in Lisbon Funicular Derailment; Mechanical Fault Suspected",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 00:58:15 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.nytimes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Authorities have confirmed three Brits are among 16 people who were killed in Wednesday's accident.",
      "<p>Kayleigh Smith, 36, and William Nelson, 44, among passengers who died when the Elevador da Glória derailed </p><p>A British couple killed in Lisbon after a <a href=\"https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-crash\">funicular streetc",
      "The crash, at a popular tourist site, killed at least 16 people. The authorities were working to identify the victims, who included an American citizen.",
      "At least 16 people were killed after the Glória funicular, one of the city’s most popular tourist attractions, crashed.",
      "Two Quebec archeologists were among 16 people killed in Wednesday&#8217;s funicular crash in Lisbon, the Quebec government has confirmed. André Bergeron and Blandine Daux were a couple and had worked as part of a specialized team of archeologists in Quebec&#8217;s Culture Department, restoring histo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5855/live/ae84b1f0-8a3f-11f0-a107-b1e54fc8eabd.jpg",
    "titles": [
      "Three British nationals among 16 killed in Lisbon crash",
      "British couple killed in Lisbon funicular crash named",
      "Portugal Searches for Cause of Lisbon Funicular Crash as Death Toll Rises",
      "Lisbon Funicular Crash: What to Know About the Cause and Victims",
      "Two Quebecers identified among 16 dead in Lisbon funicular crash"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.843,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sixteen people, including three Brits, two Canadians, five Portuguese, two South Koreans, one American, one French, one Swiss, and one Ukrainian, were killed in a funicular derailment in Lisbon. Portuguese investigators have ruled out sabotage, focusing on mechanical or maintenance issues as the likely cause. Recovery efforts have highlighted damage to a cable connecting the funicular's cars.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sabalenka to Face Anisimova in US Open Final",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 16:00:35 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "Sky Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "sports.yahoo.com",
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "No. 1 Sabalenka will take on No. 8 Anisimova in the US Open final Saturday. Who will prevail? It's not as straightforward as it seems on paper.",
      "Aryna Sabalenka will be seeking her fourth Grand Slam title overall and second straight at the U.S. Open when she faces Amanda Anisimova in the women's final at Arthur Ashe Stadium on Saturday.  The No. 1-seeded Sabalenka is a 27-year-old from Belarus who will be playing in her third major title mat",
      "Aryna Sabalenka and Amanda Anisimova meet in the U.S. Open final on Saturday. Both have suffered traumatic slam experiences this season which could make it very nervy.",
      "Latest tennis scores from the US Open at Flushing Meadows, New York.",
      "The stage for the US Open women's final is set as defending champion Aryna Sabalenka takes on home favourite Amanda Anisimova from 9pm on Saturday, live on <em>Sky Sports.</em>"
    ],
    "image_url": "",
    "titles": [
      "Sabalenka vs. Anisimova: Who will win the US Open title?",
      "Aryna Sabalenka eyes a 2nd consecutive US Open title when she plays Amanda Anisimova in the final",
      "Sabalenka And Anisimova Must Face Their Fears In U.S. Open Final",
      "Latest US Open scores: Women's finals day with Sabalenka vs Anisimova from 9pm",
      "Anisimova bids for first Grand Slam as Sabalenka looks to continue US Open reign"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.776,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.769,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aryna Sabalenka, the defending champion and world No. 1, is set to compete against No. 8 seed Amanda Anisimova in the US Open women's final on Saturday. Both players have faced challenges in Grand Slam tournaments this season, adding a layer of anticipation to the match. The event will be broadcast live on Sky Sports starting at 9pm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signs Order for \"Department of War\" as Secondary Title",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 21:14:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.dw.com"
    ],
    "snippets": [
      "Pentagon chief Pete Hegseth says the name change signals a more offensive approach for the US military under Trump.",
      "US President Donald Trump signed an executive order to change the name of the Department of Defense to the \"Department of War.\" This move revives a name that was abandoned over seven decades ago.",
      "President Trump signed an executive order renaming the Department of Defense the Department of War, though a formal name change would require Congress to act.",
      "<p>Directive will make Department of War secondary title and is way to get around need for congressional approval</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> signed an executive order on Friday to rebrand the Department of Defense as the Department of War, a call"
    ],
    "image_url": "",
    "titles": [
      "Trump changes the Department of Defense’s name to ‘Department of War’",
      "US: Trump signs order renaming Pentagon 'Department of War'",
      "Trump signs order renaming Pentagon 'Department of War'",
      "Trump signs executive order rebranding Pentagon as Department of War"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.797,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump signed an executive order to rename the Department of Defense as the \"Department of War,\" a title last used over 70 years ago. While the change signals a more offensive military posture, a formal name change requires Congressional approval. The executive order makes \"Department of War\" a secondary title to circumvent the need for Congress's approval.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chicago Sky's Angel Reese Suspended for Detrimental Comments",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 01:26:37 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Angel Reese was suspended by the Chicago Sky for the first half of Sunday's matchup against the Las Vegas Aces for comments she made that were \"detrimental to the team.\"",
      "Reese will now serve two suspensions over the Sky's next two games",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNNFA4LXlNa1loM2hzMnMxUlA2V1lEdHlNSXlGZGhXVExCZWxYUkZpdWZjTVBtMDhrLWRGaVZPSy1WOUk5UkFTSVZSbk5ITE9iaHo0amFrREotZURzR0VzX3ZCYTZxSlh4b1oyZXhYVmJfX3Z1S2htWWQ4b0tCNk1BSEtJR0pFNW1rVUlOQ3ZsM0tpdEk?oc=5\" target=\"_blank\">Chicago Sky Hit Angel Reese "
    ],
    "image_url": "",
    "titles": [
      "Sky suspend Reese for 'detrimental' comments",
      "Chicago Sky suspend Angel Reese for one half after 'detrimental' comments made about teammates",
      "Chicago Sky Hit Angel Reese With Bizarre Suspension After Comments Critical of Team - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Angel Reese, a player for the Chicago Sky, has been suspended for the first half of a game against the Las Vegas Aces and will face additional suspensions in the next two games. The suspension is due to comments she made that were considered detrimental to the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Surfer Dies in Shark Attack off Australian Coast; Beaches Closed",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 05:06:06 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A morning surfer \"died at the scene\" after being pulled out of the water, Australian police say.",
      "Middle-aged victim reportedly lost both his legs in the attack while his surfboard was cut in half.",
      "<p>Beaches from Manly to Narrabeen closed after death of 57-year-old who leaves behind wife and child</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theg"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a1f9/live/3a6d1d00-8ad2-11f0-aac3-89eb0eb0ce4d.jpg",
    "titles": [
      "Man dies after suspected shark attack in Sydney",
      "Shark attack kills surfer off Sydney beach in Australia",
      "‘A great tragedy’: man dies in shark attack near Dee Why on Sydney’s northern beaches"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 57-year-old surfer died after a shark attack off the coast of Australia, resulting in the loss of both his legs. The incident led to the closure of beaches from Manly to Narrabeen. The victim, who was attacked while surfing, died at the scene and is survived by a wife and child.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Dismisses Newsmax Antitrust Lawsuit Against Fox News",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 06 Sep 2025 00:00:34 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1Na0hrUmtnQmFmQWpvUzhPTUhXVDNjcThxOU5MMkkyWFRJanNweU0wTTdNOVQzaXZRTGN1TGxLSkMwZzE0dGUwbTQ2TFVFVDV6ZnJYbHpUMTkxUGplVjFhWEVqcHZpY1pqZ3JUVU9lVmU0QzAzU09DXw?oc=5\" target=\"_blank\">Judge dismisses Newsmax's antitrust lawsuit against Fox</a>&nbsp;",
      "Judge Aileen Cannon is best known for presiding over a criminal case against President Trump for retaining classified government records after his first term.",
      "US District Judge Aileen Cannon dismissed the lawsuit just two days after Newsmax filed it against Fox News and its parent company."
    ],
    "image_url": "",
    "titles": [
      "Judge dismisses Newsmax's antitrust lawsuit against Fox - Axios",
      "Judge dismisses Newsmax's antitrust suit against Fox News, but will allow amended complaint",
      "Federal judge dismisses Newsmax's 'shotgun' antitrust lawsuit against Fox News"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.827,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US District Judge Aileen Cannon dismissed Newsmax's antitrust lawsuit against Fox News and its parent company, just two days after it was filed. Judge Cannon is known for overseeing a criminal case against President Trump related to classified records.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angela Rayner Resigns After Ethics Breach, Shaking Starmer's Leadership",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:46:05 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Her departure comes after the PM's ethics adviser concludes that she breached ministerial rules.",
      "In a blow to Prime Minister Keir Starmer, Ms. Rayner said she would step down after an ethics adviser found she had breached a code of conduct for government ministers.",
      "<p>Guardian columnist Gaby Hinsliff talks through the tax row that brought down the now former deputy prime minister</p><p>Angela Rayner’s political stock had never been higher.</p><p>After a difficult summer for the government, Rayner was more popular than ever with Labour’s backbench MPs. She was ",
      "Keir Starmer rearranges his top team after losing his deputy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82ab/live/8a7bc150-8a48-11f0-94f4-77b666520245.jpg",
    "titles": [
      "Angela Rayner resigns after underpaying tax on Hove flat",
      "Angela Rayner, UK Deputy Prime Minister, Resigns After Underpaying Tax",
      "Angela Rayner resigns – Today in Focus Extra",
      "Angela Rayner: Resignationcast AND a Reshuffle!"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.711,
      "consensus": 0.809,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Angela Rayner resigned following a breach of ministerial rules, as determined by the Prime Minister's ethics adviser. This decision comes amid Keir Starmer's refusal to discuss her potential dismissal and has led to turmoil within his administration. Rayner's resignation is seen as a significant setback for Starmer, who had previously supported her.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Trump Effort to End Protections for Haitian, Venezuelan Immigrants",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 01:40:53 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "A federal judge on Friday blocked the Trump administration from ending temporary legal protections for more than 1 million people from Haiti and Venezuela who live in the United States.",
      "<p>Homeland security had tried to end temporary protected status granted by the Biden administration</p><p>A federal judge on Friday ruled against the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> from ending temporary legal protections that have granted"
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump administration's ending of protections for Venezuelans and Haitians",
      "Judge blocks ending of legal protections for 1m Venezuelans and Haitians in US"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge blocked the Trump administration's attempt to end temporary legal protections for over 1 million Haitian and Venezuelan immigrants in the U.S. This decision preserves the temporary protected status granted by the Biden administration, ensuring these individuals maintain their legal status in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rare \"Blood Moon\" Eclipse Visible in UK Sunday Evening",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-05T12:22:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Phys.org",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "phys.org"
    ],
    "snippets": [
      "A total lunar eclipse makes the moon shine with all the sunrises and sunsets on Earth — at the same time. But how? The moon is in Earth's shadow! Here's what’s going on.",
      "<p>The satellite will turn deep red as the Earth passes between the sun and the moon at about 7.30pm on Sunday</p><p>A rare total lunar eclipse “blood moon” will be visible from the UK on Sunday night for the first time since 2022.</p><p>The moon is expected to turn a deep, dark red as the Earth pas",
      "The year's second total lunar eclipse is coming up fast, and this time Asia will have the best seats in the cosmos."
    ],
    "image_url": "",
    "titles": [
      "Blood Moon this Sunday: What makes a total lunar eclipse",
      "Rare total lunar eclipse ‘blood moon’ to be visible from UK",
      "Asia will get a prime view of this weekend's total lunar eclipse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.662,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A rare total lunar eclipse, known as a \"blood moon,\" will be visible from parts of the UK on Sunday evening, weather permitting. This phenomenon, where the moon turns deep red, occurs when the Earth passes between the sun and the moon. This will be the first such event visible from the UK since 2022, expected to start around 7:30 pm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thunder Rookie Sorber Out for Season with ACL Tear",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 01:26:37 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Thunder rookie big man Thomas Sorber tore the ACL in his right knee and will miss the 2025-26 season, the team announced.",
      "Sorber is the latest in a string of bad luck for Thunder draft picks in their rookie years"
    ],
    "image_url": "",
    "titles": [
      "OKC rookie Sorber out for season with torn ACL",
      "Thunder 2025 first-round pick Thomas Sorber suffers torn ACL, expected to miss entire 2025-2026 season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Thomas Sorber, a rookie for the Oklahoma City Thunder, has torn the ACL in his right knee and will miss the entire 2025-26 NBA season, the team confirmed. This marks the second year in a row that a Thunder first-round draft pick has been sidelined for an entire season due to an ACL injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies Resolve Dispute, Young Fan Meets Bader After Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 01:26:37 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "The Philadelphia Phillies invited a young fan to meet center fielder Harrison Bader after a home run ball dispute during their 9-3 win over the Miami Marlins on Friday night.",
      "Find the &quot;Karen&quot; says Phillies fan."
    ],
    "image_url": "",
    "titles": [
      "Young fan meets Bader after HR ball taken away",
      "Phillies fan labeled 'Karen' goes viral after taking Harrison Bader HR ball from young fan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Philadelphia Phillies resolved a dispute over a home run ball by inviting a young fan to meet center fielder Harrison Bader following their 9-3 victory against the Miami Marlins on Friday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Clay's Playbook Adds Shadow Report for Week 1 NFL Fantasy Insights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 01:26:37 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Mike Clay's Playbook now includes Shadow Reports, providing an all-encompassing look at Week 1's matchups to exploit and avoid in fantasy.",
      "Matchup ratings for every player in Week 1 for PPR leagues",
      "Matchup ratings for every player in Week 1 for non-PPR leagues"
    ],
    "image_url": "",
    "titles": [
      "🏈 The Playbook: Week 1 fantasy football guide",
      "Fantasy Football 2025 Week 1 PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football 2025 Week 1 Non-PPR Cheat Sheet: Player ratings to guide your toughest lineup calls"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Clay's Playbook has expanded to include the Shadow Report, offering detailed insights on Week 1 NFL matchups for fantasy football players. This comprehensive guide aims to help users make informed decisions on starting or sitting players based on matchups and weather forecasts, among other factors. All relevant fantasy football content for Week 1 is now accessible in one location to assist players in dominating their matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "James Madison vs. Louisville Week 2: SportsLine Releases Best Bets",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 23:59:53 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "James Madison will look to make a statement on the road against Louisville wearing a slick all-white look.",
      "SportsLine's computer model simulated James Madison Dukes vs. Louisville Cardinals 10,000 times and released its college football best bets for Week 2"
    ],
    "image_url": "",
    "titles": [
      "James Madison's icy white look headlines best Week 2 college football uniforms",
      "Louisville vs. James Madison prediction, odds: Model reveals free Week 2 college football picks for Friday"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "James Madison Dukes will face Louisville Cardinals in Week 2 of college football, aiming to impress with an all-white uniform. SportsLine's computer model, after simulating the game 10,000 times, has released its best bets for this matchup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Method Converts PET Waste into CO2-Capturing Material",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 22:22:50 EDT",
    "source": "ScienceDaily",
    "sources": [
      "Phys.org",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "phys.org"
    ],
    "snippets": [
      "A team of chemists has discovered how to transform PET plastic waste into BAETA, a material that captures CO2 with remarkable efficiency. Instead of ending up as microplastics in the environment, discarded bottles and textiles could become tools to combat climate change. The method is energy-friendl",
      "Chemists at the University of Copenhagen have developed a method to convert plastic waste into a climate solution for efficient and sustainable CO2 capture. This is killing two birds with one stone as they address two of the world's biggest challenges: plastic pollution and the climate crisis."
    ],
    "image_url": "",
    "titles": [
      "Scientists made plastic that eats carbon",
      "Scientists transform plastic waste into efficient CO₂ capture materials"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.887,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chemists at the University of Copenhagen have developed a method to convert PET plastic waste into BAETA, a material that efficiently captures CO2, addressing plastic pollution and climate change simultaneously. This innovative, energy-friendly process offers a dual solution to major environmental challenges.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Special Forces Accidentally Kill North Korean Fishermen in Covert Mission",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 02:41:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US special forces killed several North Korean fishermen diving for shellfish after encountering them by accident.",
      "<p>New York Times says Trump authorized mission to plant listening device; team killed fishers they encountered</p><p>US Navy Seals shot and killed a number of <a href=\"https://www.theguardian.com/world/north-korea\">North Korean</a> civilians during a botched covert mission to plant a listening devi"
    ],
    "image_url": "",
    "titles": [
      "US Navy SEALs killed North Korean civilians during botched mission: Report",
      "US Navy Seals killed North Korean civilians in botched 2019 mission, report says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US special forces, on a covert mission authorized by Trump to plant a listening device, accidentally encountered and killed several North Korean fishermen diving for shellfish. The operation, involving US Navy Seals, resulted in the unintended deaths of these civilians.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korea Protests ICE Raid at Hyundai Plant, 475 Arrested",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 05 Sep 2025 10:58:37 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "\"The business activities of our investors and the rights of our nationals must not be unjustly infringed,\" a foreign ministry spokesman said after about 300 South Koreans were detained.",
      "Most of the 475 people arrested in a raid on a Hyundai-LG battery factory under construction in the state of Georgia were from South Korea. Relations between Washington and Seoul have become strained of late."
    ],
    "image_url": "",
    "titles": [
      "Hundreds of South Koreans are among 475 detained in a Georgia immigration raid",
      "US: South Koreans detained in ICE raid on Hyundai plant"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.699,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In a recent ICE raid at a Georgia-based Hyundai plant, approximately 475 individuals were arrested, with a significant number being South Korean nationals. This action prompted South Korea to demand protection for its nationals and investors, labeling the raid as an unjust infringement of rights. The foreign ministry emphasized the importance of not unjustly infringing on the business activities and rights of their nationals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "HHS Report to Explore Possible Tylenol-Autism Link, Kenvue Denies Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 21:00:48 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFBJOTNyNW83bjNKYkZZU1Q1eXU2cmhBalV3bTZCeFlHakM4bWh3SWVWNUlPeUVSclJUSnVNZVZhUUN2T0QxWk9LVFJTem02eDRpOUZ6UEVodUJmaGMzYkV3NUpuWkJtSnY3Um44Yk1VbURqX2ZjMV9TcFFUTXVBaDQ?oc=5\" target=\"_blank\">RFK Jr. to draw link between Tylenol and autism, new rep",
      "HHS will release the report that could draw that link between the pain medication and autism this month, according to the Wall Street Journal."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. to draw link between Tylenol and autism, new report says - Axios",
      "Kenvue stock drops 10% on report RFK Jr. will link autism to Tylenol use during pregnancy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Department of Health and Human Services (HHS) is set to release a report this month that may suggest a link between Tylenol and autism, as reported by the Wall Street Journal. Kenvue, the manufacturer of Tylenol, denies any connection as alleged in the upcoming report.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. May Bar Foreign Leaders from UN Assembly Over Detentions",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 22:09:09 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "Move raises possibility the administration could bar some foreign leaders from attending upcoming UN General Assembly",
      "The move empowers the State Department to impose sanctions and other punitive measures on governments that hold Americans without justification."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa136e9ff-fe1e-4b5b-93b7-840465867727.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump issues order to penalise countries that detain American citizens",
      "Trump executive order targets nations that detain U.S. citizens"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.795,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. administration's recent action could lead to barring certain foreign leaders from the UN General Assembly. This move allows the State Department to apply sanctions against governments detaining Americans without valid reasons.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warner Bros. Sues Midjourney Over Copyright Infringement Claims",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:56:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "Warner Bros. case builds on arguments raised in a Disney/Universal lawsuit."
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "Warner Bros. sues Midjourney to stop AI knockoffs of Batman, Scooby-Doo"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.728,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Warner Bros. accuses Midjourney of intentionally allowing users to generate content from copyrighted images after lifting previous restrictions. This case follows similar legal arguments made in a Disney/Universal lawsuit against Midjourney.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Keir Starmer Reshuffles Cabinet to Boost Labour Party's Effectiveness",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 17:56:30 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "An in-depth look at which Labour MPs are currently serving in Prime Minister Keir Starmer's cabinet.",
      "Overhaul of top team hands experienced ministers and fast risers new briefs and challenges"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/32a4/live/ebb32100-8a4f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Who's in Keir Starmer's new cabinet?",
      "Who’s who in Starmer’s new cabinet?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.728,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Prime Minister Keir Starmer has reshuffled his cabinet, assigning new roles and challenges to both seasoned ministers and rapidly advancing members of the Labour Party. This move aims to strengthen the team's effectiveness and address current political demands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]