[
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 05:40:23 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera",
      "Financial Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Dozens of flights were cancelled or redirected at Munich International Airport after drone sightings.",
      "The sightings follow similar incidents in Denmark and Norway last week.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "Flights were diverted or cancelled in latest incident involving unidentified objects in European airspace",
      "<p>The German airport was forced to suspend operations, in the latest drone disruption to European aviation</p><p>Drone sightings over Munich airport on Thursday evening forced air traffic control to suspend operations, leading to the cancellation of 17 flights and disrupting travel for nearly 3,000",
      "The airport in Germany was the latest in Europe to shut because of drone sightings that officials have blamed on Russia, which has denied the accusations."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bfe7/live/25831280-9ffb-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Munich airport reopens after drone sightings force closure",
      "Munich airport resumes flights after drone sightings; passengers stranded",
      "Germany: Drone sightings disrupt Munich airport",
      "Munich airport closed after drone sightings",
      "Munich drone sightings force airport to cancel flights in latest Europe disruption",
      "Flights Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.929,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift Drops 12th Album, Eyes 1M First-Week Sales",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 04:01:53 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC",
      "Business Insider",
      "Le Monde",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.lemonde.fr",
      "www.forbes.com",
      "www.bbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Taylor Swift's 12th album is a breathtakingly fun pop record, capturing the joy of falling in love.",
      "Entre confidences intimes et règlements de comptes, la star orchestre une sortie mondiale inédite mêlant pop, country et rendez-vous exclusifs au cinéma pour ses fans.",
      "The new Taylor Swift release 'The Life of a Showgirl' could join the less than 30 albums to sell more than 1 million copies in their first week. She has done it before.",
      "Taylor Swift released her new album on Friday. \"The Life of a Showgirl\" is full of upbeat pop songs about love, rivalry, artifice, and fame.",
      "Who is Taylor Swift’s heir apparent? Her 12th album, “The Life of a Showgirl,” offers an answer. It’s Taylor Swift. Her last album, “The Tortured Poets Department,” ended with the cautionary “Clara Bow,” an allegory that seemed to suggest her tenure atop the cultural mainstream was inherited from st"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d309/live/0fb41d10-9f69-11f0-b741-177e3e2c2fc7.png",
    "titles": [
      "Taylor Swift: The Life of a Showgirl is a triumphant pop victory lap",
      "Taylor Swift dévoile « The Life of a Showgirl », son douzième album",
      "Taylor Swift ‘Life Of A Showgirl’ Sales Prediction: Will New Album Set A Record?",
      "Taylor Swift's new album 'The Life of a Showgirl' has some of her best songs in years &mdash; and some of her cringiest",
      "On Taylor Swift’s ‘The Life of a Showgirl,’ love and reputation are on the line"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.897,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th album, \"The Life of a Showgirl,\" featuring a mix of pop and country music, along with themes of love, rivalry, and fame. The album, celebrated for its joyful pop records, has been uniquely promoted with global releases and exclusive cinema events for fans. It is anticipated to sell over 1 million copies in its first week, a milestone Swift has achieved before. The release underscores Swift's continued dominance in the music industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 19:57:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Residents in UK&#039;s Crumpsall say they are shocked after a car and knife attack near synagogue kills two people.",
      "UK police have confirmed the identity of a man who was shot by police after attacking a synagogue in Manchester. Three other people have been arrested in connection with what police have called a 'terrorist incident.\"",
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said.",
      "The police said Adrian Daulby, 53, and Melvin Cravitz, 66, were killed Thursday outside the Heaton Park Congregation synagogue in northwestern England.",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "<p>Witnesses screamed ‘he’s got a bomb’ and ‘shoot him’ before suspect was killed by armed police</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates\">Manchester syna",
      "Many Orthodox Jews who live in the area reacted with horror to an attack that killed two people and seriously injured three on Yom Kippur, Judaism’s holiest day."
    ],
    "image_url": "",
    "titles": [
      "Shock and disbelief as Manchester community reels from synagogue attack",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Two killed in attack at synagogue on Yom Kippur in England",
      "2 Victims Named After Manchester Synagogue Terrorist Attack",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Six minutes of terror: how Manchester synagogue attack unfolded",
      "‘A Crazy Moment’: Shock and Terror Spreads in Manchester Synagogue’s Community"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.774,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 16:24:50 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "As Israel intercepted the aid ships, an airstrike also killed at least one aid worker in Gaza.",
      "Israel&#039;s army issues &#039;final warning&#039; for hundreds of thousands of people to flee main urban centre as attacks escalate.",
      "The Israeli navy has intercepted all the ships that formed the 44-strong Global Sumud Flotilla.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war.",
      "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave.",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza."
    ],
    "image_url": "",
    "titles": [
      "Israel intercepts aid flotilla headed for Gaza",
      "LIVE: Israel bombs Gaza homes; military intercepts last flotilla boat",
      "Last remaining boat in Gaza humanitarian flotilla intercepted by Israel",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
      "Israel Detains Activists After Intercepting Flotilla Headed to Gaza: What to Know",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.782,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Wings Beat Maple Leafs 3-1 in Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 03 Oct 2025 01:54:35 +0000",
    "source": "Global News",
    "sources": [
      "NHL",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Anthony Stolarz was stellar with 40 saves, Auston Matthews opened the scoring with a power-play goal but it wasn't enough as the Toronto Maple Leafs gave up three third-period goals to fall 3-1 to the Detroit Red Wings in pre-season action on Thursday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNMWRndGlzT3VzTzd2eFk2WG54SVprWWZXUXZjRmdCRDFQTFJsZTVGZTludmRjbTlSUGNaWWN4cHpNeVNQc0U2TGFNWkhyY3pVdzZ6YXdrNmd4eWUzT21QME9TLXl3c0RmTTNnMUZNWnNrcmc0ZVlueXNEMGp3ZUZfTnlR?oc=5\" target=\"_blank\">Red Wings trim preseason roster to 28</a>&nbsp;&nbs",
      "<p>Alex DeBrincat and Dylan Larkin each scored, Cam Talbot made 18 saves on the night, and the Detroit Red Wings took a 3-1 win over the Toronto Maple Leafs in pre-season action.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/0334b4bda60ce972e9f645b336a1a4fcbd1c00237f5c0ce9794795d63cae6908.jpg?quality=65&strip=all",
    "titles": [
      "Leafs fall 3-1 to Red Wings in pre-season action",
      "Red Wings trim preseason roster to 28 - NHL.com",
      "NHL Pre-Season Highlights: Red Wings 3, Maple Leafs 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.877,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.762,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthony Stolarz made 40 saves and Auston Matthews scored a power-play goal, but the Toronto Maple Leafs lost 3-1 to the Detroit Red Wings in a pre-season game. The Red Wings scored three goals in the third period, with Alex DeBrincat and Dylan Larkin among the scorers. Cam Talbot contributed with 18 saves for Detroit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FDA Approves Low-Cost Generic Abortion Pill Amid Mixed Reactions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:45:38 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Drugmaker Evita Solutions announced on its website that the Food and Drug Administration signed off on its low-cost form of the pill, which is approved to end pregnancies through 10 weeks.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPUTNLODBzOTJZNnpQRjJSV2wyY3BObGs2dXdfYmdyZFQtYjNSVDByanJCLWNDMkRabTJDUFdMWTc5WlVlS1Utc3MzUFBKNFZvS3BkZklLVGNrOHNiN1VseGFkRENyUU5RUWxLdXdOazlNZmZ1R3JkZjZKNWwtTTZ1VWRfYw?oc=5\" target=\"_blank\">Conservatives rage after FDA approves generic abo",
      "<p>Abortion rights supporters hail win for evidence-backed medicine as Evita Solutions’ generic version of mifepristone given approval</p><p>In a move that has left anti-abortion advocates reeling, the US Food and Drug Administration (FDA) quietly approved a request to manufacture a new abortion pil"
    ],
    "image_url": "",
    "titles": [
      "FDA approves another generic abortion pill, prompting outrage from conservatives",
      "Conservatives rage after FDA approves generic abortion drug - Axios",
      "Anti-abortion groups furious as FDA approves generic abortion pill"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FDA approved Evita Solutions' low-cost generic version of mifepristone, a pill approved to end pregnancies through 10 weeks. This decision was celebrated by abortion rights supporters as a victory for evidence-based medicine, while drawing criticism from conservatives.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Beat Red Sox 2-1, Advance to ALDS Against Blue Jays",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 00:06:25 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Global News",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The entire LDS field is set! Here's how every showdown stacks up.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after dispatching the archrival Boston Red Sox in a Wild Card Series.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after defeating the archrival Boston Red Sox 4-0 to win their wild-card series 2-1.",
      "<p>Arden Zwelling joins Evanka Osmak and Ken Reid to set up the Blue Jays&#8217; ALDS matchup against the Yankees, who we should expect to start Game 1 for both teams, New York&#8217;s improved defence, who gets left off Toronto&#8217;s ALDS roster, and more.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees or Blue Jays? Cubs or Brewers? First look at every division series matchup",
      "Blue Jays to face division rival Yankees in ALDS",
      "NewsAlert: Blue Jays to face Yankees in ALDS",
      "Breaking down top storylines ahead of Blue Jays vs. Yankees ALDS tilt"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.918,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Yankees advanced to the American League Division Series (ALDS) to face the Toronto Blue Jays after winning their wild-card series against the Boston Red Sox 2-1, with a final game score of 4-0. Discussions are ongoing about game strategies, including starting pitchers for Game 1, the Yankees' defense improvements, and roster decisions for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CNBC",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Apple removes ICE tracking apps after Trump AG pressure"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 00:38:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "New York Times",
      "TechCrunch"
    ],
    "domains": [
      "www.nytimes.com",
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Energy Department's cancellations of projects directly affected 16 states won by Kamala Harris in the 2024 presidential election.",
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "",
    "titles": [
      "Shutdown fallout: Energy Dept. axes billions for green projects in blue states",
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.836,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Claims \"Armed Conflict\" Justifies Strikes on Venezuelan Drug Boats",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 21:05:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Memo reported by US media shows Trump justification for strikes on alleged drug smugglers experts say likely illegal.",
      "<p>Administration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’</p><p>The Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress."
    ],
    "image_url": "",
    "titles": [
      "Trump memo says US in ‘non-international armed conflict’ with cartels",
      "Trump officials push claim that US in ‘armed conflict’ with drug cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.793,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has attempted to justify strikes on alleged Venezuelan drug boats by claiming the U.S. is in a \"non-international armed conflict\" with drug cartels, based on a novel legal theory. This justification, aimed at allowing military action against narcotics distributors, has been reported by US media and critiqued by experts as likely illegal. President Trump has notified Congress of this determination, framing it as a response to an \"armed attack\" by drug cartels on the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cubs Beat Padres 3-1, Advance to NL Division Series Against Brewers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 02:55:15 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Cubs held off a ninth-inning rally by the Padres for a clinching 3-1 victory Thursday night that sends them to the NL Division Series against the Brewers.",
      "<p>The Chicago Cubs downed the San Diego Padres in Game 3 of the wild-card round on Thursday to advance in the MLB playoffs, setting up a best-of-five against the Milwaukee Brewers.</p>",
      "<p>Michael Busch had three hits and a solo home run, Pete Crow-Armstrong added three hits of his own and drove in a run, and the Chicago Cubs took Game 3 and the Wild Card Series win over the Chicago Cubs 3-1.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cubs quash Padres' threat in 9th to make NLDS",
      "Cubs down Padres in Game 3 to reach NLDS vs. Brewers",
      "MLB Game 3 Highlights: Cubs 3, Padres 1"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Chicago Cubs defeated the San Diego Padres 3-1 on Thursday night, overcoming a ninth-inning rally to advance to the NL Division Series. They will face the Milwaukee Brewers in a best-of-five series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nevada Supreme Court Rules Against NFL in Jon Gruden Case",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 02:55:15 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Thursday's unanimous ruling by the Nevada Supreme Court means the last option for the NFL is to appeal to the U.S. Supreme Court, which sources told ESPN is likely.",
      "Gruden sued the NFL and Roger Goodell in November 2021"
    ],
    "image_url": "",
    "titles": [
      "Nev. court rejects NFL plea for Gruden rehearing",
      "Jon Gruden vs. NFL lawsuit: Nevada Supreme Court rejects league's petition in latest legal win for ex-coach"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Nevada Supreme Court ruled unanimously on Thursday against the NFL in a case involving Jon Gruden, who sued the NFL and Commissioner Roger Goodell in November 2021. This decision leaves the NFL with the option to appeal to the U.S. Supreme Court, a step sources told ESPN is likely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Navy Stops Aid Flotilla to Gaza, Arrests Activists Including Thunberg",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 07:05:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Marinette is the last vessel of the Global Sumud Flotilla still heading towards Gaza.",
      "<p>Activists from Global Sumud flotilla including Greta Thunberg arrested as final boat is presumed intercepted in Palestinian waters</p><p>Israel says it has stopped a pro-Palestinian flotilla carrying aid from reaching Gaza, with its navy intercepting all but one of the vessels trying to breach th"
    ],
    "image_url": "",
    "titles": [
      "Last Gaza Flotilla boat ‘still sailing strong’",
      "Israel stops 41 boats in aid flotilla with one ‘still sailing strong’"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel's navy intercepted the Global Sumud Flotilla, aiming to deliver aid to Gaza, arresting activists including Greta Thunberg. The Marinette, the last of the flotilla's vessels, was presumed stopped in Palestinian waters, marking the interception of all boats involved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Postecoglou Faces Early Setback as Nottingham Forest Loses in Europa League",
    "domain": "sports",
    "source_domain": "eplindex.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 07:59:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "eplindex.com",
      "www.independent.co.uk",
      "www.theguardian.com"
    ],
    "snippets": [
      "Postecoglou Faces Mounting Pressure as Nottingham Forest Fans Recall Nuno Espirito SantoAnge Postecoglou’s early tenure at Nottingham Forest took another difficult turn on Thursday night as his side...",
      "Postecoglou is the first Forest manager in a century to not win any of his first six games",
      "<p>Ange Postecoglou finds himself in an ominously tight spot after 23 days in the job. As Midtjylland streamed forward on the counterattack in the 88th minute, the Nottingham Forest manager rested his hands on his head, convinced how the next few seconds would play out. Forest, as he feared, would c"
    ],
    "image_url": "",
    "titles": [
      "Ange Postecoglou reacts to Nottingham Forest&#8217;s Europa League defeat",
      "Ange Postecoglou unfazed by Nottingham Forest fan anger after latest defeat",
      "Nottingham Forest fans call for Postecoglou axe after 23 days following European defeat"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ange Postecoglou, the Nottingham Forest manager, experienced a challenging moment 23 days into his job when his team lost to FC Midtjylland in the Europa League. The defeat came after a counterattack by Midtjylland in the 88th minute, leaving Postecoglou visibly distressed. Sky Sports reporter Anton Toloui and journalist Adam Bate discussed the match's outcome and its implications for Postecoglou's tenure at Nottingham Forest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Boston Bruins Beat Washington Capitals 3-1 in Preseason Game",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 02:32:44 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNdGlqRWFpamxWcnNaUzhWSE9jWHVqUHhOM25UajFzWE5seUxNQ2lROVgxMVdaQ2w5QlI5SU1NdV8xREVUREVtcVJxbFotM2FBM1hPY0FqQ3hXVTV4YjduaVBvNHliWVpnaG5GODhJMXlDUTJ4RXpMSmxreVU0Z2tUQU43YkJTZkFQSnc?oc=5\" target=\"_blank\">Ovechkin makes preseason debut for Capit",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE0yVWo4YndGTGZsTHo4MUNtMlFmM1hHRFVPUU1ISGEwNVdTSGVsOVZBOUtScE5Gc3MzUk1aeUdYWHRDUTRtUTJCcFI0SnZQWXp1aHVjTmpWVkFCczQ2N3ZLQUUwek5lellBTW5NUUF3S2RVMkdlal9nVw?oc=5\" target=\"_blank\">Need to Know: Bruins at Capitals</a>&nbsp;&nbsp;<font color=\"#6f6",
      "<p>Brett Harrison scored two goals, Joonas Korpisalo made 33 saves, and the Boston Bruins earned a 3-1 win over the Washington Capitals.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ovechkin makes preseason debut for Capitals in loss to Bruins - NHL.com",
      "Need to Know: Bruins at Capitals - NHL.com",
      "NHL Pre-Season Highlights: Bruins 3, Capitals 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In a preseason game, the Boston Bruins defeated the Washington Capitals with a score of 3-1. Brett Harrison led the Bruins by scoring two goals, while Joonas Korpisalo contributed with 33 saves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shuts Down as Congress Misses Funding Deadline",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 06:53:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "White House says it plans to cut &#039;thousands&#039; of federal jobs as it freezes funding to Democratic states.",
      "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill.",
      "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown."
    ],
    "image_url": "",
    "titles": [
      "US government shutdown enters third day, expected to last past weekend",
      "WATCH:  Government shutdown enters day 2",
      "WATCH:  What does the government shutdown mean for you and your family?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government officially shut down on Oct. 1 after Congress failed to reach a funding agreement. ABC News' Selina Wang, as the senior White House correspondent, addressed the most searched questions regarding the shutdown on its first day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 02:42:32 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The crowd-sourced app was used to monitor and report the presence of ICE agents at any location.",
      "Apple on Thursday removed the immigration enforcement tracking app, ICEBlock, from the App Store, citing \"safety risks.\""
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68df6fdf1cc9143131a8f01b/0x0.jpg?width=960&precrop=1970%2C1109%2Cx0%2Cy40",
    "titles": [
      "Apple Takes Down ICEBlock App After DOJ Demand—Here’s What We Know",
      "Apple removes ICEBlock app from App Store"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Sox Season Ends with Loss to Yankees in Wild Card Series Game 3",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:25:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Red Sox gave up four runs in the fourth in their season-ending loss",
      "<p>Watch as the Boston Red Sox make a pair of defensive miscues leading to a massive four-run fourth inning from the New York Yankees in Game 3 of their Wild Card Series.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/3d655032-dbf0-4c38-b86a-ec257199c0b1/red-sox-getty.png",
    "titles": [
      "How the Red Sox's season slipped away: Defensive lapses cost Boston in fateful fourth inning vs. Yankees",
      "Red Sox’s pair of defensive miscues lead to massive inning for Yankees"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Boston Red Sox suffered a season-ending loss after conceding four runs in the fourth inning due to defensive errors, during Game 3 of their Wild Card Series against the New York Yankees.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Broberg Leads Blues to 7-1 Pre-Season Victory Over Senators",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:22:42 EDT",
    "source": "Sportsnet",
    "sources": [
      "Ottawa Citizen",
      "Sportsnet"
    ],
    "domains": [
      "ottawacitizen.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>Philip Broberg had two goals and one assist, Robert Thomas added a goal and two assists and the St. Louis Blues hammered the Ottawa Senators 7-1.</p>",
      "The Ottawa Senators have six days to get their act together. The good news for the Senators is that the results of pre-season games are meaningless, but they were no match for the St. Louis Blues in a 7-1 loss on Thursday night at the Enterprise Center. Coming off a 5-0 loss to the Montreal [&#8230;"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/10/Zetterlund.jpg",
    "titles": [
      "Zetterlund scores Senators’ lone goal in rough pre-season loss to Blues",
      "Takeaways: Ottawa Senators pre-season struggles continue with loss to the St. Louis Blues"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Philip Broberg led the St. Louis Blues with two goals and one assist in a dominant 7-1 victory over the Ottawa Senators. Robert Thomas also contributed significantly with a goal and two assists. The match took place at the Enterprise Center, marking another significant loss for the Senators following a 5-0 defeat to Montreal. Despite the pre-season context, indicating the results do not count towards regular season standings, the Senators face a critical period of reassessment before their next game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Asahi Group Halts Beer Production After Cyberattack",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-03T04:25:43Z",
    "source": "Business Insider",
    "sources": [
      "Ars Technica",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Asahi Group Holdings was hit with a cyberattack this week, which has halted its operations, including production of Japan's favorite Asahi Super Dry.",
      "Asahi Super Dry production at Japanese breweries halted after cyberattack."
    ],
    "image_url": "https://i.insider.com/68df39921c1f80efbec4d5a4?format=jpeg",
    "titles": [
      "Why Japan is about to run out of its favorite beer",
      "Japan is running out of its favorite beer after ransomware attack"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Asahi Group Holdings experienced a cyberattack this week, leading to the suspension of its operations and the production of Asahi Super Dry, a popular beer in Japan. The company's breweries in Japan have ceased production as a result of the attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gateway Church Founder Admits to 1980s Sexual Abuse of Minor",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 04:19:26 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQUk1GRkJJUlJtWE1DYWtGTDNzaS1ZSGRZUnItak9VU0xmM2hGcmlTeXVRTjJQLXFtR0xhR21JZDBZcTU4ZHFScUEyaVAza25uYndKbVlqcnBxc041WDdVTnlLd21WSktQb2pUMXlmZWg1RF84VThZTlJuYkhia1NucTRPdHlkUUU5RVdScVJOZnVPSEU?oc=5\" target=\"_blank\">Texas megachurch pastor plea",
      "Robert Morris, the founder of Gateway Church, which has one of the nation’s largest congregations, admitted to sexually abusing a child in the 1980s."
    ],
    "image_url": "",
    "titles": [
      "Texas megachurch pastor pleads guilty to child sexual abuse charges - Axios",
      "Texas Megachurch Pastor Pleads Guilty to Child Sex Abuse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Robert Morris, founder of Gateway Church, a major US megachurch, admitted to sexually abusing a 12-year-old girl in the 1980s. This admission has brought significant attention to his actions and the church.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President, Budget Director Discuss Shutdown on Day 2 Amid Firing Warnings",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 23:41:59 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "He said the shutdown could be an opportunity to \"clear out dead wood\", giving no hint of concessions to Democrats.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTh3VTFKSEYxa3hFRVpxN2xuang0cHJGNHVmSkVfaWtKU3F5Y2MtUFVGWndNRGN1d2o4VzdmVFBQTjd5azNYRU1fV2dIeTNKNWp1MWVRWjZleVB4cWFNdWNuamg4U3VpLXlsd253ZERBT2p3R19fNlR0SHducTFCcElKalFOcUtrZDExY3pyZkplSkk?oc=5\" target=\"_blank\">Trump admin uses government "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f7f5/live/aeebe790-9fdd-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Trump wields axe over 'Democrat Agencies' as shutdown blame game rages",
      "Trump admin uses government sites to blame Democrats for shutdown - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President met with the White House budget director as the government shutdown entered its second day due to a stalemate. During this period, the White House warned of a \"very real\" risk of mass firings among federal workers. Democrats have accused the administration of using the shutdown as an opportunity to reduce the size of the government.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Perplexity's Comet Browser Now Free, Aims to Elevate Content Quality",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:56:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Perplexity initially launched Comet in July to Perplexity Max subscribers for $200 a month",
      "AI search startup Perplexity is making its new Comet browser available to everyone in the world for free as it works to position the product against big browsers and search engines. For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via "
    ],
    "image_url": "",
    "titles": [
      "Perplexity AI rolls out Comet browser for free worldwide",
      "Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Perplexity launched its Comet browser in July for $200 a month to Perplexity Max subscribers. Now, the AI startup has made Comet free for all users, aiming to combat low-quality content and collaborating with publishers like CNN and The Washington Post. This move positions Comet as a competitor to major browsers and includes a 'background assistant' feature for certain paid subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FAA Reports Substantial Damage in Two-Drone Crash, Investigation Underway",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:43:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The drones sustained \"substantial\" damage from the crash, the Federal Aviation Administration said in a preliminary incident report.",
      "Investigations by the National Transportation Safety Board and Federal Aviation Administration are underway."
    ],
    "image_url": "",
    "titles": [
      "Amazon faces FAA, NTSB probe after two delivery drones crashed into crane in Arizona",
      "Amazon to resume drone delivery following crash in Arizona"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two drones were involved in a crash that resulted in \"substantial\" damage, according to a preliminary report by the Federal Aviation Administration. The National Transportation Safety Board and the Federal Aviation Administration are currently investigating the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]