[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for tasks to be automated by devices such as self-driving cars and cleaning robots. While advanced sentient robots may not be widely affordable in our lifetimes, robot vacuums offer a more accessible option for automating household chores."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6123172821875,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.363079320546875,
    "summary": "In today's technological age, devices like self-driving cars and robot vacuums are automating tasks. Although highly advanced sentient robots may remain out of financial reach for many during their lifetimes, robot vacuums present a more affordable solution for automating home cleaning."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. The event, which offers discounts on gardening supplies, bedding, and more, runs until Monday, March 31, 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5622815807060186,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3505703951765047,
    "summary": "Amazon has initiated its Big Spring Sale, offering discounts on items such as gardening supplies and bedding. This sale event started with the onset of the warmer season and will continue until Monday, March 31, 2025."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream, revealing the titles on its webpage dedicated to the new Virtual Game Card lending system. This system is set to launch in the near future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5559188427893518,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3489797106973379,
    "summary": "Nintendo has announced \"Switch 2 Edition\" games after its Nintendo Direct stream, revealing them on a webpage for its upcoming Virtual Game Card lending system, which is expected to launch soon."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting conservative podcasters for extensive access to senior Trump Administration officials. This initiative, aimed at engaging alternative media, is planned to be a recurring event, highlighting the administration's focus on incorporating new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5335445855208334,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.34338614638020837,
    "summary": "On Thursday, the White House initiated Podcast Row, offering conservative podcasters extensive access to senior officials from the Trump Administration. This event, aimed at integrating alternative media, is set to become a recurring initiative, underscoring the administration's commitment to embracing new media platforms."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers, including its first color model, are being discounted. Among these, the Kindle Scribe, notable for its note-taking capability, is on sale. The 16GB version of this latest model has reached its lowest price ever."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5249348708101853,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3412337177025463,
    "summary": "Amazon's Big Spring Sale features discounts on e-readers, including the Kindle Scribe with note-taking features. The 16GB model is at its lowest price yet."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission (FTC) have been directed by Bureau of Consumer Protection Director Christopher Mufarrige to stop describing the agency as \"independent\" in complaints, based on an email revealed by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.49760833281249994,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33440208320312503,
    "summary": "The Bureau of Consumer Protection Director, Christopher Mufarrige, has instructed FTC staff to cease referring to the agency as \"independent\" in their complaints. This directive was disclosed through an email obtained by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian firm, has released the Classic 2, an enhanced version of its original trackball mouse. Maintaining the same design and ergonomics, the new model features better connectivity, a more precise scroll wheel, and an updated design that simplifies 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4924911259837963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3331227814959491,
    "summary": "Ploopy, a Canadian company, has launched the Classic 2, an updated version of its trackball mouse. It retains the original's design and comfort but adds improved connectivity, a more accurate scroll wheel, and a design easier to 3D print."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon is hosting its Big Spring Sale until Monday, March 31st, offering numerous deals on a wide range of products. The sale is open to all customers, not just Amazon Prime members. A comprehensive roundup includes over 90 deals on popular items, alongside a selection of affordable alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.46574346848379633,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3264358671209491,
    "summary": "Amazon's Big Spring Sale, running until March 31st, features a wide variety of products on discount. This sale is accessible to all customers, not exclusively Amazon Prime members. The event showcases more than 90 deals on popular items, as well as a range of cost-effective alternatives."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft is creating a subsidiary for Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six, with Tencent investing €1.16 billion for a 25% stake. The new entity is valued at approximately €4 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.46136906915509257,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32534226728877313,
    "summary": "Ubisoft is forming a subsidiary focused on Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six. Tencent will invest €1.16 billion for a 25% share, valuing the new company at around €4 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on a variety of gadgets and gear, including Apple's M-series chip-equipped MacBooks. These MacBooks, available in various sizes and price points, have been highlighted as some of the best deals, despite Apple discontinuing the M1 MacBook Air."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.45627830950231474,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.32406957737557873,
    "summary": "Amazon's Big Spring Sale is currently happening, offering major discounts on numerous items, notably including Apple MacBooks with M-series chips. Despite the discontinuation of the M1 MacBook Air, these MacBooks, which come in different sizes and prices, are among the top deals featured."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's president commented on Trump's plans, describing them as \"serious\" but stated they were unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's president described Trump's Arctic plans as \"serious\" but clarified they are not connected to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered because of tariffs imposed by Trump, putting at risk future collaborations between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader highlighted that tariffs introduced by Trump have changed the Canada-US relationship, potentially jeopardizing future cooperation between the two countries."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:46:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has expressed opposition to JD Vance and his wife following Donald Trump's vow to assert control over the territory."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has voiced opposition to JD Vance and his wife after Donald Trump promised to take control of the territory."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has instructed his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, though further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children died in a recent incident. Further information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was moved from the US to a detention facility in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing competition from a growing opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was murdered by the founder of her fan club. The perpetrator's initial request for parole in Texas has been rejected."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's first parole request in Texas was denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies have pledged to respond after China accused Washington of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies have committed to taking action following accusations by China that Washington has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer was convicted of manslaughter for causing the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer has been found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new technology was developed with assistance from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed with the help of Russian expertise, analysts report."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist, was arrested during his coverage of protests in Istanbul and later deported to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The film, scheduled for release in May 2026, will feature Robert Downey Jr in the role of Doctor Doom."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming film set for May 2026 will star Robert Downey Jr as Doctor Doom."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been arrested with the help of a local resident, as reported by the police."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter found a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter discovered a man concealed under a child's bed following the child's report of seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his home, according to his party's statement."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as stated by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Algerian author Boualem Sansal, aged 80, stated in an interview with a far-right news outlet that colonial France allocated excessive land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Algerian author Boualem Sansal, in an interview with a far-right news outlet at the age of 80, claimed that colonial France gave Algeria too much land."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the death of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky expressed his views on the support Ukraine has received from Europe and highlighted the resilience of his country amid ongoing challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky discussed the support Ukraine has received from Europe and emphasized his country's resilience amid its current challenges."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and national factors has made the government's pursuit of re-election more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government's re-election efforts are facing difficulties due to a combination of global and domestic issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to the increasing trend among affluent, urban Indians of pampering their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is witnessing growth, driven by the rising trend of affluent, urban Indians indulging their pets, particularly dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that strong winds, dry conditions, and pine trees significantly increase the risk of wildfires, highlighting a dangerous combination of factors that can lead to rapid fire spread."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts warn of an elevated wildfire risk due to strong winds, dry conditions, and pine trees, noting these factors can cause fires to spread quickly."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed his willingness to spend the entire day playing golf with the US president if it would bring advantages to his nation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister stated he is ready to play golf for an entire day with the US president if it benefits his country."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms family trees into dynamic movies, illustrating the global movements of ancestors over time. This innovative approach not only provides a visual representation of genealogical data but also holds potential for modeling disease spread and tracking animal migration across different geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method to turn family trees into animated movies, showing how ancestors moved globally over time. This method offers a visual way to see genealogical data and could help model the spread of diseases and track animal migration across various regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers discovered that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that increased meltwater and rainfall account for 60% of the unexpected differences in ocean temperatures around Antarctica over recent decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study has found that people with Long COVID often feel ignored, disbelieved, and unsupported by their healthcare providers."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions originate from distinct precursor cells and differ in gene regulation. This variation in gene regulation among skeletal cells may contribute to vertebrates' evolutionary success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from various body parts come from unique precursor cells and show differences in gene regulation. This finding suggests that such gene regulation diversity among skeletal cells could play a role in the evolutionary success of vertebrates."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, advocates for the inclusion of eugenics in college genetics curriculums. He believes this will help scientists identify and counteract the misuse of science for political agendas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, supports adding eugenics to college genetics curriculums. He argues that this will enable scientists to recognize and address the misuse of science for political purposes."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing soil samples from twelve Dublin parks found higher contamination levels of infective roundworm eggs at park entrances compared to other park areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study examining soil samples from twelve parks in Dublin revealed that areas near park entrances have higher levels of roundworm egg contamination compared to other parts of the parks."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:20:05 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The tournament started with 68 teams, and after Thursday's games, only 12 teams remain in contention."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament began with a lineup of 68 teams. Following the games held on Thursday, the competition has narrowed down to 12 teams still vying for the title."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech's place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored the winning basket with 7.3 seconds left in overtime, giving Texas Tech an 85-83 win over Arkansas. This victory, achieved after rallying from a 16-point deficit, advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cooper Flagg of Duke University showcased an impressive performance in a basketball game against Arizona, scoring 30 points, grabbing 6 rebounds, providing 7 assists, and blocking 3 shots. This contributed to Duke's 100-93 victory, securing their place in the Elite Eight for the second consecutive season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg, a Duke University basketball player, significantly contributed to Duke's 100-93 win over Arizona by scoring 30 points, securing 6 rebounds, delivering 7 assists, and making 3 blocks. This victory advanced Duke to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win over the Los Angeles Lakers on Thursday night. This shot is considered one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey from the Chicago Bulls hit a 47-foot 3-pointer from half court at the buzzer, leading his team to a 119-117 victory against the Los Angeles Lakers on Thursday. This shot is highlighted as one of the NBA season's most dramatic finishes."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After the Maryland men's basketball team was eliminated from the Sweet 16 by Florida, Coach Kevin Willard did not make a clear statement regarding his future with the Terrapins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following the Maryland men's basketball team's Sweet 16 elimination by Florida, Coach Kevin Willard did not provide a definitive statement about his future with the Terrapins."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU during the East Region semifinal. Mark Sears led the team in this achievement, breaking a 35-year-old record for most 3-pointers in a tournament game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in the East Region semifinal. Mark Sears was the leading contributor in surpassing the 35-year-old record for the most 3-pointers in a single tournament game."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, failing to tie the game, which resulted in a 3-1 victory for the Astros."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his debut game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing a game tie. This led to a 3-1 win for the Astros."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, which was especially meaningful as he had been a topic of trade discussions during the offseason. His performance was celebrated by Cardinals fans, who gave him a curtain call."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amidst offseason trade discussions. His performance earned a curtain call from Cardinals fans, highlighting his significant contribution to the game."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:01:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging a conspiracy with the university to scapegoat him."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the organization conspired with the university to make him a scapegoat."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders analyze key NBA awards debates, focusing on the MVP race between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are closely examining the competition for key awards, with significant attention on the Most Valuable Player (MVP) race. The main contenders for the MVP title are Nikola Jokic and Shai Gilgeous-Alexander, indicating a tight contest between the two standout players."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, the number of 3-point attempts has reached a historic high, prompting discussions on whether the league should limit the frequency of these shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season has seen a record number of 3-point shot attempts in the league, leading to debates about potentially limiting how often these shots are taken."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts have made their predictions for the 2025 baseball season, including whether the Dodgers can repeat their success and who might win the MVP award."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts have predicted the outcomes for the 2025 baseball season, focusing on the Los Angeles Dodgers' potential to replicate their previous success and identifying candidates likely to win the Most Valuable Player (MVP) award."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This message addresses sports teams and their fans, offering support regardless of whether a team is already favored to win or is aiming to be the unexpected success story of 2025."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This message extends support to sports teams and their fans, emphasizing backing for both teams predicted to win and those hoping to become the surprise success stories of 2025."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are contenders for the top spot in Sweet 16 player rankings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are highlighted as leading contenders in the Sweet 16 player rankings, indicating their prominence and skill level in the competition."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's women's basketball team towards a championship. Their performances on the court are significantly contributing to the team's success this season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are pivotal in driving Notre Dame's women's basketball team's success this season, playing crucial roles in leading the team towards a championship."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical role, made his own selections for the first round of the draft, applying his experience as a former general manager."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, leveraging his background as a former general manager, made hypothetical selections for the first round of the draft in a simulated exercise."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised concerns within college athletics about the potential for other athletes to be victims of similar issues."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concerns in college athletics regarding the possibility that more athletes may have faced similar issues."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The leading scorers in Europe's top football leagues are currently dominating the charts in the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1. Each player is showcasing exceptional talent and skill, contributing significantly to their respective teams' performances in these highly competitive leagues."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top scorers in Europe's major football leagues, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1, are significantly impacting their teams' success with their remarkable talent and skill."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona won against Osasuna 3-0, but coach Hansi Flick stated the victory came at a \"high price\" due to Dani Olmo's injury during the Thursday match."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona secured a 3-0 win over Osasuna, but the victory was overshadowed by Dani Olmo's injury, as described by coach Hansi Flick, who called it a \"high price\" for the win."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced an investigation into alleged \"indecent conduct\" by four Real Madrid players, Kylian Mbappé and Vinícius Júnior among them, during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid."
  },
  {
    "title": "Ronaldo to lead CONMEBOL anti-racism task force",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "CONMEBOL has appointed Ronaldo Nazario to head a task force aimed at tackling racism and violence in South American soccer, as announced on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "CONMEBOL announced on Thursday that Ronaldo Nazario will lead a new task force focused on addressing racism and violence in South American soccer."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Xabi Alonso, the coach of Bayer Leverkusen, currently has no offers from other clubs, contrasting with the situation a year ago, indicating no immediate decisions about his future are needed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, does not have any offers from other clubs currently, unlike the situation a year ago. This means there are no immediate decisions required regarding his future."
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:41 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Qatar Sport Investment (QSI), the entity owning Paris Saint-Germain, is in the final stages of acquiring the Spanish football club Malaga, according to a source reported by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is reportedly close to buying the Spanish football club Malaga, as per a source mentioned by ESPN."
  },
  {
    "title": "Bompastor hails Chelsea's 'perfect night' in UWCL",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 01:28:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea manager Sonia Bompastor celebrated a significant victory at Stamford Bridge, where her team overturned a 2-0 deficit against Manchester City, ensuring their advancement to a third consecutive Champions League semifinal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea manager Sonia Bompastor led her team to a comeback victory at Stamford Bridge, overcoming a 2-0 deficit against Manchester City. This win secured Chelsea's place in the Champions League semifinals for the third consecutive year."
  }
]