[
  {
    "title": "Israeli Airstrike Kills Yemeni Houthi PM and Ministers in Sanaa",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 10:28:55 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "CityNews",
      "Al Jazeera",
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "ottawa.citynews.ca",
      "www.dw.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Iranian-backed Houthis said an Israeli airstrike killed the prime minister of the rebel-controlled government in the Yemeni capital, Sanaa.",
      "Houthis say Ahmed al-Rahawi and a number of ministers were killed in Israel&#039;s attack on Sanaa this week.",
      "The Iranian-backed militants said Prime Minister Ahmed al-Rahawi was killed on Thursday in Sanaa. Israel's military said it \"precisely struck\" a Houthi target in Yemen. Follow DW.",
      "Prime Minister Ahmad al-Rahawi and several ministers were killed in an Israeli strike Thursday on Sanaa, the Houthis said.",
      "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel.",
      "CAIRO (AP) — The Houthis said Saturday an Israeli airstrike killed the prime minister of the rebel-controlled government in Yemen&#8217;s capital, Sanaa, the most senior Houthi official killed in the Israeli-U.S. campaign against the Iranian-backed rebels. Ahmed al-Rahawi was killed in a Thursday st"
    ],
    "image_url": "",
    "titles": [
      "Houthi rebels say Israeli airstrike killed their prime minister in Yemen's capital",
      "Yemen’s Houthis confirm Israeli strike killed group’s prime minister",
      "Yemen Houthis confirm PM killed in Israeli airstrike",
      "Israeli strike killed Houthi prime minister, rebel group says",
      "Houthis Say Prime Minister Was Killed in Israeli Attack",
      "Israeli airstrike kills Houthi rebel prime minister in Sanaa"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.965,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.868,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ahmed al-Rahawi, the Prime Minister of the Houthi-controlled government in Yemen, and several ministers were killed in an Israeli airstrike on Sanaa. The strike, confirmed by Israel's military as targeting a Houthi location, represents a significant escalation in the conflict involving the Iranian-backed Houthis. Al-Rahawi's death marks the highest-profile casualty in the ongoing Israeli-U.S. campaign against the rebels. Despite his killing, it is reported that the incident is unlikely to stop the Houthis' missile attacks on Israel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spirit Airlines Files for Bankruptcy Again Amid Financial Struggles",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 08:26:13 -0400",
    "source": "NPR",
    "sources": [
      "MarketWatch",
      "CNBC",
      "NPR",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "news.google.com",
      "www.cnbc.com",
      "www.marketwatch.com",
      "www.npr.org"
    ],
    "snippets": [
      "The budget carrier filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The airline said it plans to keep flying as usual during the restructuring process.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE9TZENHc1lvay10a016NFlfS0toVlpqVDFRaEhvUmtDaXhkMEpaNGd4OWtwSjc4bWZ4WXpWYWw0Qm1jempOa3RtWC1MVUlTamdUN1RTUEFSU2s4RXlEMHdRNlh1emVwM3d6YmU3a1lGZG5keU0?oc=5\" target=\"_blank\">Spirit Airlines is back in bankruptcy</a>&nbsp;&nbsp;<font color=\"#6f6f6",
      "Spirit Airlines filed for bankruptcy protection again, just months after the budget carrier came out of Chapter 11 protection earlier this year.",
      "Budget carriers like Spirit are under pressure by bigger airlines, which have rolled out their own low-cost offerings.",
      "The move comes after the budget airline emerged from bankruptcy in March."
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines files for bankruptcy for 2nd time in less than a year",
      "Spirit Airlines is back in bankruptcy - Axios",
      "Spirit Airlines files for Chapter 11 bankruptcy protection for the second time in a year",
      "Spirit Airlines files for bankruptcy again, and flight attendants union warns to ‘prepare for all possible scenarios’",
      "Spirit Airlines files for bankruptcy again, has this to say about its Labor Day flights"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.925,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Spirit Airlines has filed for Chapter 11 bankruptcy protection for the second time within a year, citing dwindling cash reserves and increasing losses exacerbated by Trump tariffs. Despite emerging from a previous bankruptcy in March, the low-cost carrier has struggled to recover, leading to this latest filing. Spirit intends to continue operating normally during the restructuring process, allowing passengers to book flights as usual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Piastri Takes Pole at Dutch GP, Narrowly Beats Norris",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:01:22 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Sportsnet",
      "BBC",
      "ESPN"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Oscar Piastri beats McLaren team-mate Lando Norris to pole position at the Dutch Grand Prix by 0.012 seconds.",
      "Oscar Piastri secured pole position after beating his teammate and title rival Lando Norris.",
      "<ul><li><p>Australian gives himself chance to extend title advantage</p></li><li><p>Isack Hadjar takes career-best fourth for Racing Bulls</p></li></ul><p>Oscar Piastri claimed pole for the Dutch Grand Prix with a mighty lap for McLaren at Zandvoort to beat his teammate Lando Norris into second plac",
      "Oscar Piastri turned the tables on Lando Norris when it mattered most to claim pole position for the Dutch Grand Prix after a gripping qualifying duel between the title-contending McLaren drivers.",
      "<p>Oscar Piastri beat his teammate Lando Norris by just over one-hundredth of a second to take pole position for the Dutch Grand Prix in qualifying on Saturday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7861/live/b62591f0-85ac-11f0-96c7-ef884a3c7963.jpg",
    "titles": [
      "Piastri pips title rival Norris to Dutch GP pole",
      "Piastri takes pole ahead of Norris at Dutch GP",
      "Oscar Piastri earns F1 Dutch GP pole by finest margin ahead of Lando Norris",
      "Piastri wins gripping Dutch GP pole duel to turn tables on Norris",
      "Piastri edges McLaren teammate Norris for pole at Dutch Grand Prix"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.956,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.82,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oscar Piastri secured pole position for the Dutch Grand Prix, edging out his McLaren teammate Lando Norris by a mere 0.012 seconds in a closely contested qualifying session. This achievement gives Piastri an opportunity to extend his lead in the title race, while Isack Hadjar achieved a career-best fourth place for Racing Bulls.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Rules Most Trump Tariffs Illegal, Exceeding Authority",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:13:05 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "CNBC",
      "BBC",
      "Global News"
    ],
    "domains": [
      "www.bbc.com",
      "globalnews.ca",
      "www.ft.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A US appeals court has ruled that most of Trump’s tariffs are illegal - so what happens now?",
      "The appeals court stayed its ruling until Oct. 14, giving the Trump administration time to ask the Supreme Court to hear the case.",
      "Judges uphold ruling that the president exceeded his authority",
      "A U.S. appeals court ruled many Trump-era tariffs illegal but allowed them to remain in place as the case moves toward the Supreme Court."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2329/live/1132b900-859a-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "What happens next after Trump tariffs ruled illegal?",
      "Most Trump tariffs ruled illegal by appeals court, dealing major blow to trade policy",
      "Trump’s tariffs ruled illegal by US appeals court but stay in place",
      "U.S. federal appeals court rules some of Trump’s tariffs illegal"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.96,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A U.S. federal appeals court ruled that most of the tariffs imposed by President Donald Trump are illegal, stating he exceeded his authority. The decision, which upholds a trade court's ruling, is based on violations of a 1977 law and the U.S. Constitution. Although the tariffs remain in effect temporarily to allow time for an expected appeal, the outcome represents a significant challenge to Trump's trade policies. The Supreme Court is anticipated to review the case following the appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia Protests: Buildings Torched, 3 Dead Amid Economic, Police Unrest",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 05:13:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "An angry mob set fire to a local parliament building in an Indonesian provincial capital, leaving at least three people dead and five others hospitalized, officials said.",
      "At least three people were killed and several injured in a fire blamed on protesters in Sulawesi island.",
      "<p>Cities in Indonesia rocked by protests after motorcycle taxi driver run over by police tactical vehicle</p><p>Protesters have torched parliamentary buildings in three further Indonesian provinces, a day after at least three people were killed by a fire started by demonstrators at a council buildi",
      "The student-led demonstrations in Indonesia are against President Prabowo Subianto’s economic policies and fatal police brutality."
    ],
    "image_url": "",
    "titles": [
      "3 dead after mob sets fire to Indonesian regional parliament building",
      "Three killed in fire at Indonesian government building blamed on protesters",
      "Fire kills three people in Indonesia after protesters torch council buildings",
      "3 Dead in Indonesia After Jumping From Building Protesters Set on Fire, Official Says"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.865,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Indonesia, protests against President Prabowo Subianto's economic policies and police brutality have escalated, leading to the torching of parliamentary buildings in four provinces, including Sulawesi Island. The unrest, sparked by a police vehicle running over a motorcycle taxi driver, has resulted in at least three deaths and several injuries. In one incident, a local parliament building was set ablaze, killing at least three people and hospitalizing five.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Blocks Palestinian President from UN General Assembly Attendance",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 07:22:55 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "New York Times",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "news.google.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The decision comes as France leads international efforts to recognise a Palestinian state at the UN meeting next month.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOZGV4bUNVVGFaRWxOV3hYTVBrOFpPN0FMTjZEcV8yYmlyVlU0eEFFUUl5czBueGotR0ZHRnpTclpjRkVkcXJxWHVwUjhEX2VibWkwN3hZYkRjbFFiYUpoQlVGTnhyZFpmTTZSS1NrQWZGMDE1U204M3pJTUktVXpBbU1fdjh0Zw?oc=5\" target=\"_blank\">U.S. blocks Palestinian president from attend",
      "The move comes as U.S. allies prepare to recognize Palestinian statehood next month.",
      "The United States generally allows foreign officials to attend the United Nations General Assembly. The administration’s move comes amid a new push for Palestinian statehood."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa76/live/913f1f60-8501-11f0-bf6f-0d0a8492a6fd.jpg",
    "titles": [
      "US blocks Palestinian leader from attending UN meeting in New York",
      "U.S. blocks Palestinian president from attending UN General Assembly - Axios",
      "U.S. denies visas to Palestinian officials ahead of U.N. General Assembly",
      "Trump Administration Bars Palestinian Officials From U.N. Meeting in New York"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.816,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United States has blocked the Palestinian president from attending the UN General Assembly next month, amid efforts led by France to recognize a Palestinian state. This decision marks a significant move by the U.S. administration, contrasting with the general practice of allowing foreign officials to attend the assembly.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Maclean Brothers Set Record with Fastest Pacific Row in 140 Days",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 09:10:34 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Jamie, Ewan and Lachlan Maclean completed the fastest unsupported row across the Pacific, arriving in Cairns, Australia, on Saturday. They rowed over 9,000 miles non-stop from Peru.",
      "Jamie, Ewan and Lachlan Maclean endured violent tropical storms during their 140-day journey.",
      "<p>Jamie, Ewan and Lachlan Maclean set world record as they arrive in Australia after rowing 14,000km from Peru to Cairns</p><p>Three Scottish brothers have set a new record for rowing nonstop across the world’s largest ocean, arriving in Australia to the tune of bagpipes and a fresh pizza after 140"
    ],
    "image_url": "",
    "titles": [
      "139 days: 3 Scottish brothers set a record for fastest row across the Pacific",
      "Brothers set new record for 9,000-mile Pacific row",
      "‘Do you have pizza and beer?’ Scottish brothers complete 140-day nonstop row across Pacific"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.94,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.75,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jamie, Ewan, and Lachlan Maclean set a world record by completing the fastest unsupported row across the Pacific Ocean, covering over 14,000km from Peru to Cairns, Australia, in 140 days. They faced violent tropical storms during their journey but successfully arrived to celebrations, including bagpipes and pizza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Condemns Assassination of Ex-Speaker Parubiy in Ukraine",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:18:38 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.ft.com"
    ],
    "snippets": [
      "President Zelensky said the killing of Parubiy was a \"terrible murder\" - with a manhunt under way.",
      "Ukrainian President Volodymyr Zelenskyy condemns killing of prominent politician Andriy Parubiy as &#039;horrendous murder&#039;.",
      "Assassination of former parliament speaker Andriy Parubiy is the most significant in a series of high-profile killings"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6bad/live/f1197b20-858c-11f0-ab22-d347aa25866a.jpg",
    "titles": [
      "Prominent Ukrainian politician Andriy Parubiy shot dead in Lviv",
      "Former Ukrainian parliament speaker shot dead in Lviv",
      "Prominent Ukrainian nationalist politician shot dead in Lviv"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.962,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy condemned the assassination of Andriy Parubiy, a former parliament speaker, calling it a \"horrendous murder.\" This incident marks a significant event in a series of high-profile killings in Ukraine. A manhunt is currently underway to find those responsible for Parubiy's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Rules Most Trump Tariffs Illegal, Exceeding Authority",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-29T22:07:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CityNews",
      "New York Times",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A US appeals court ruled that most tariffs imposed by President Donald Trump are illegal. The Trump administration has said it will appeal the ruling to the Supreme Court.",
      "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court.",
      "A U.S. court ruled Trump overstepped by imposing sweeping tariffs under emergency powers, dealing a major blow to his trade agenda as he vows to appeal.",
      "WASHINGTON (AP) — A federal appeals court ruled Friday that President Donald Trump had no legal right to impose&#160;sweeping tariffs&#160;on almost every country on earth but left in place for now his effort to build a protectionist wall around the American economy. The ruling from the U.S. Court o"
    ],
    "image_url": "",
    "titles": [
      "US President Trump's sweeping tariffs largely illegal, but can stay in place for now, appeals court rules",
      "Trump’s Sweeping Tariffs Invalidated by Appeals Court",
      "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
      "Court finds Trump’s tariffs against Canada, other countries illegal, but leaves them in place for now"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.687,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A U.S. federal appeals court ruled that most of the tariffs imposed by President Donald Trump are illegal, stating he exceeded his authority. The decision, which upholds a trade court's ruling, is based on violations of a 1977 law and the U.S. Constitution. Although the tariffs remain in effect temporarily to allow time for an expected appeal, the outcome represents a significant challenge to Trump's trade policies. The Supreme Court is anticipated to review the case following the appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Attacks 14 Ukrainian Regions; 1 Dead, 30 Injured",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:37:54 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Russia hits 14 Ukrainian regions, Kyiv says, with at least one person reported killed and 30 injured.",
      "At least one person has been killed and 28 wounded, including children, in attack that targeted Zaporizhia.",
      "Explosions were reported in the cities of Dnipro and Pavlograd in Dnipropetrovsk, authorities said. Follow DW for the latest."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c18f/live/86114700-8581-11f0-ab22-d347aa25866a.jpg",
    "titles": [
      "Russia launches massive attack on Ukraine, as Kyiv hits oil refineries",
      "Russia attacks Ukraine’s Zaporizhia; Kyiv hits Russian oil refineries",
      "Ukraine updates: Russia launches 'massive attack' on Ukraine's Dnipropetrovsk region"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia launched attacks across 14 Ukrainian regions, resulting in at least one death and 30 injuries, as reported by Kyiv. Among the affected areas, Zaporizhia saw at least one fatality and 28 wounded, including children. Explosions also occurred in Dnipro and Pavlograd, Dnipropetrovsk region, according to authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Cuts $4.9B in 'Woke' Funding from USAID, State Dept.",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-30T00:32:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ABC News",
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "US President Donald Trump has bypassed Congress to cut nearly $5 billion in funding earmarked for international aid. The move could spark a fight over who truly holds the power of the purse in the United States.",
      "President Donald Trump told Congress that he will slash $4.9 billion of congressionally-approved USAID and State Department foreign aid funding.",
      "US president makes new effort to assert power over Congress with bid to cut ‘woke’ funding"
    ],
    "image_url": "",
    "titles": [
      "Trump cuts billions more in approved US foreign aid",
      "WATCH:  Trump cuts nearly $5B of foreign aid",
      "Trump moves to scrap $4.9bn in already allocated US foreign aid"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.722,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump has unilaterally cut $4.9 billion in congressionally-approved funding for USAID and the State Department, aiming to assert his power over Congress. This move, described as an effort to cut 'woke' funding, may lead to a dispute regarding the constitutional power of the purse in the United States.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Schefter Shares Top Fantasy Picks; Gibbs Unveils 2025 PPR Rankings",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 11:11:18 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "No one is more plugged in to the latest buzz around the NFL than Adam Schefter. We asked him to share his favorite values in fantasy drafts with you.",
      "Jacob Gibbs, a CBS Sports data analyst whose work can be found in the Fantasy Football Today newsletter, shares his 2025 PPR Fantasy football rankings"
    ],
    "image_url": "",
    "titles": [
      "🏈 Adam Schefter's fantasy football cheat sheet",
      "2025 Fantasy football draft strategy: Tiers, cheat sheet, top PPR deep sleepers, breakouts from NFL expert"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Adam Schefter, known for his deep NFL insights, shared his top fantasy draft picks, offering valuable advice for fantasy football enthusiasts. Meanwhile, Jacob Gibbs, a CBS Sports data analyst, has released his 2025 PPR Fantasy Football rankings in the Fantasy Football Today newsletter, providing a comprehensive guide for players planning their strategies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers, Yankees, Pirates, and Giants Secure Wins in MLB Highlights",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 02:08:50 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Andruw Monasterio's solo shot in the sixth started a five-run inning as the Milwaukee Brewers routed the Toronto Blue Jays 7-2 on Friday in a showdown between the American and National League leaders.",
      "<p>Andrew Vaughn had three hits and two RBIs on the night, Freddy Peralta struck out eight batters in six innings, and the Milwaukee Brewers took a 7-2 win over the Toronto Blue Jays.</p>",
      "<p>Trent Grisham crushed his fourth career grand slam, Anthony Volpe tacked on a two-run shot, and Carlos Rodon allowed a run over six innings as the New York Yankees trounced the Chicago White Sox 10-2.</p>",
      "<p>Tommy Pham drove in a pair of runs, Paul Skenes struck out six batters in six innings, and the Pittsburgh Pirates took a 4-2 win over the Boston Red Sox.</p>",
      "<p>Blaze Alexander homered for the Arizona Diamondbacks while Zac Gallen tossed six shutout innings striking out eight batters as the Diamondbacks beat the Los Angeles Dodgers 3-0.</p>",
      "<p>Canadian Jonah Tong punched out six batters in his MLB debut, Brandon Nimmo hit two of the Mets&#8217; six home runs on the night, and New York crushed the Miami Marlins 19-9.</p>",
      "<p>Riley Greene had three knocks bringing in two runners while catcher Dillon Dingler smashed a solo shot home run to help the Detroit Tigers beat the Kansas City Royals 5-3.</p>",
      "<p>Dominic Smith hit a two-run shot and drove in four runs, Luis Matos added a solo shot and three RBIs to his season tally, and the San Francisco Giants took a 15-8 win over the Baltimore Orioles.</p>",
      "<p>Brandon Marsh added two hits and an RBI to his season tally, Ranger Suárez allowed just one run in five innings, and the Philadelphia Phillies earned a narrow 2-1 win over the Atlanta Braves.</p>",
      "<p>Logan Allen struck out five batters in six innings, Kyle Manzardo and Nolan Jones each hit solo home runs on two hits, and the Cleveland Guardians took a 5-4 win over the Seattle Mariners.</p>",
      "<p>Masyn Winn drove in three runs, including knocking in a key insurance run in extra innings, to lead the St. Louis Cardinals past the Cincinnati Reds 7-5.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/d8948af34131e6f7641e02b780d2f027ecb93bcbd88e93551a8d3192b276e15b.jpg?quality=65&strip=all",
    "titles": [
      "Monasterio, Peralta lead Brewers past Blue Jays",
      "MLB Highlights: Brewers 7, Blue Jays 2",
      "MLB Highlights: Yankees 10, White Sox 2",
      "MLB Highlights: Pirates 4, Red Sox 2",
      "MLB Highlights: Diamondbacks 3, Dodgers 0",
      "MLB Highlights: Mets 19, Marlins 9",
      "MLB Highlights: Tigers 5, Royals 3",
      "MLB Highlights: Giants 15, Orioles 8",
      "MLB Highlights: Phillies 2, Braves 1",
      "MLB Highlights: Guardians 5, Mariners 4",
      "MLB Highlights: Cardinals 7, Reds 5 (F/10)"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.747,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Milwaukee Brewers defeated the Toronto Blue Jays 7-2, with Andruw Monasterio igniting a five-run inning. Other MLB highlights include the New York Yankees' 10-2 victory over the Chicago White Sox, the Pittsburgh Pirates winning 4-2 against the Boston Red Sox, the Arizona Diamondbacks shutting out the Los Angeles Dodgers 3-0, the New York Mets overpowering the Miami Marlins 19-9, the Detroit Tigers beating the Kansas City Royals 5-3, the San Francisco Giants securing a 15-8 win over the Baltimore Orioles, the Philadelphia Phillies narrowly defeating the Atlanta Braves 2-1, the Cleveland Gua",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Adam Thielen, Vikings Restructure Contract to Continue Partnership",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 15:35:48 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "vikingswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Thielen spent the first nine seasons of his career with the Vikings",
      "The Vikings and Adam Thielen came to an agreement on a contract restructure."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/30/e8df7991-77a7-428c-9878-03b9902d0d47/adam-t-getty.png",
    "titles": [
      "Why Vikings' Adam Thielen reportedly agreed to revised contract, reduced salary after trade from Panthers",
      "Minnesota Vikings, Adam Thielen agree to contract revision after trade"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Adam Thielen and the Vikings agreed to restructure his contract after he spent the first nine seasons of his career with the team. This agreement allows Thielen to continue his tenure with the Vikings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 1 NFL and College Football Betting Picks Released by Experts",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 15:00:57 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bigblueview.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's advanced model has locked in its Week 1 NFL betting picks from 10,000 simulations",
      "Thomas Casale has locked in his top three college football picks for Week 1 and his CFB parlay could pay out around +600",
      "SportsLine expert Emory Hunt has revealed his Syracuse vs. Tennessee picks for the 2025 Aflac Kickoff Game in Atlanta",
      "SportsLine's model reveals its Week 1 college football parlay picks and best bets for Saturday",
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 1 college football schedule",
      "SportsLine expert Bruce Marshall has revealed his college football prediction for Jeremiah Smith and Ohio State vs. Arch Manning and Texas on Saturday",
      "SportsLine's advanced computer model has revealed its 2025 Week 1 college football picks",
      "Games and players to watch in the first week of college football"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/06/89ad01cf-1580-48b6-8837-3f9adba1af42/josh-jacobs-imagn-1.jpg",
    "titles": [
      "Week 1 NFL odds, lines, betting picks, spreads, best bets, 2025 predictions: Model backing Packers, Bengals",
      "2025 college football picks, Week 1 odds, lines, best bets from Vegas expert: This parlay could return +600",
      "Tennessee vs. Syracuse prediction, odds, time: 2025 college football Week 1 picks via expert on 16-8 roll",
      "2025 Week 1 college football betting picks, odds, lines: This college football parlay pays almost 6-1",
      "2025 college football Week 1 picks against the spread, betting odds, lines, trends: Expert reveals picks",
      "Texas vs. Ohio State prediction, odds, time: 2025 Week 1 college football picks from expert who's 64-43",
      "College football odds, picks, predictions for Week 1, 2025: Model likes Alabama and UCLA in best bets",
      "College football 2025 Week 1: Playoff matchups in August"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's advanced model and experts, including Thomas Casale and Emory Hunt, have released their NFL and college football betting picks and predictions for Week 1, based on thousands of simulations and analyses. The predictions cover various games, including Syracuse vs. Tennessee in the 2025 Aflac Kickoff Game and Ohio State vs. Texas, highlighting key players like Jeremiah Smith and Arch Manning. Additionally, legendary Vegas handicapper Bruce Marshall shared his top betting values for the week's college football schedule, offering insights into potential high-payout parlays and best bet",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Updates on 5pm BST Kick-off at Franklin's Gardens",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:57:00 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Updates from the 5pm BST kick-off at Franklin’s Gardens</p></li><li><p><a href=\"mailto:daniel.gallan@theguardian.com\">Email Daniel</a> | <a href=\"https://www.theguardian.com/sport/2016/aug/18/sign-up-to-the-breakdown\">Sign up for the Breakdown</a></p></li></ul><p><strong>The anthems are r",
      "<p>Canada overwhelmed Wales 42-0 with an impressive six-try display to move to the brink of the Women&#8217;s Rugby World Cup quarterfinals on Saturday.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/5413f41a99f4c805250ad94b2b954f34409d0d5b/529_0_3750_3000/master/3750.jpg?width=140&quality=85&auto=format&fit=max&s=e2e820a4853b87ef10bcd51799bb6f59",
    "titles": [
      "England v Samoa: Women’s Rugby World Cup 2025 – live",
      "Canada crushes Wales with 6 tries and nears Women’s Rugby World Cup quarterfinals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<ul><li><p>Updates from the 5pm BST kick-off at Franklin’s Gardens</p></li><li><p><a href=\"mailto:daniel.gallan@theguardian.com\">Email Daniel</a> | <a href=\"https://www.theguardian.com/sport/2016/aug/18/sign-up-to-the-breakdown\">Sign up for the Breakdown</a></p></li></ul><p><strong>The anthems are r",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Open Sparks Debate on Tennis Etiquette and Unwritten Rules",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 09:54:57 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>There’s been a lot of talk about the unwritten rules of tennis during Week 1 of this US Open, whether it&#8217;s the necessity of a “sorry, not sorry&#8221; raised hand after a let cord or the proper way to warm up with an opponent or the legitimacy of an underarm serve.</p>",
      "NEW YORK (AP) — There’s been a lot of talk about the unwritten rules of tennis during Week 1 of this U.S. Open, whether it&#8217;s the necessity of a “ sorry, not sorry ” raised hand after a let cord or the proper way to warm up with an opponent or the legitimacy of an [&#8230;]"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/altmaier-tsitsipas.jpg",
    "titles": [
      "Why post-match handshakes sometimes go awry at US Open",
      "The unwritten rules of tennis and why postmatch handshakes sometimes go awry at the US Open"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During the first week of the U.S. Open, discussions have emerged about tennis's unwritten rules, including the etiquette of acknowledging a let cord with a raised hand, proper warm-up procedures with an opponent, and the use of underarm serves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Sales Promote Early Buys Ahead of Furniture Tariff Hikes",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 12:46:29 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9OVXBaODkwRzEyaVNjeHIyT3VBQnZpZTdoWWZrZDJGNTk3dTZTbERhRVVoN0l4Ri1ZX29lV1dXbW5yWXR3NTFrYjVGcXQ0azJycVpxQWYwdTBaNG85YzRFeWtjSVkxMmJ5c1YyU0NISFZ1NC1ndFBmVjRPMnJ5RkU?oc=5\" target=\"_blank\">Labor Day sales warn shoppers to \"buy now before prices ",
      "Haggling for a lower price could prove valuable if new furniture tariffs raise prices further."
    ],
    "image_url": "",
    "titles": [
      "Labor Day sales warn shoppers to \"buy now before prices rise\" - Axios",
      "Shopping Labor Day furniture sales? 5 tips to bargain for the best prices."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Labor Day sales are urging shoppers to purchase items now due to the potential increase in furniture prices from new tariffs. Consumers are advised that haggling might secure better deals before these price hikes take effect.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisa Cook's Fed Governor Role Uncertain Amid Hearing on Trump's Firing Attempt",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 08:43:36 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZEFVX3lxTE90NTdRbm5HcjJaS21HZGxndGVObUpCelQ2UEIzUExiRzNjU1liUk1raVBoenNCR3p5eXZaZGpWeW9DLWJYN2pNWGFiWkUwUHB6VVhWVGRVTmVVeFl3aXQyc3A5cjM?oc=5\" target=\"_blank\">Status of Fed governor Cook uncertain after first hearing on Trump firing</a>&nbsp;&nbsp;<fo",
      "Lisa Cook's lawyer said \"crazy midnight tweets\" by housing official Bill Pulte about alleged mortgage fraud do not give President Trump cause to remove her."
    ],
    "image_url": "",
    "titles": [
      "Status of Fed governor Cook uncertain after first hearing on Trump firing - Axios",
      "Fate of Fed Gov. Lisa Cook still up in the air after court hearing on Trump firing bid"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lisa Cook's status as a Fed governor remains uncertain following her first hearing regarding President Trump's attempt to fire her. Her lawyer argued that Bill Pulte's \"crazy midnight tweets\" about supposed mortgage fraud don't justify her removal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Schroder Faces Racial Abuse as Germany Advances at EuroBasket",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 15:57:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Germany captain Dennis Schroder faced racial abuse during his team’s 107-88 victory over Lithuania at EuroBasket on Saturday.  The German Basketball Association said two people were identified as the alleged perpetrators of the abuse and they were subsequently ejected from the arena in Tampere, Finl",
      "<p>Sacramento Kings point guard Dennis Schroder scored 26 points as Germany beat Lithuania 107-88 to become the first team to qualify for the final 16 of EuroBasket on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Germany guard Schroder targeted by racial abuse during EuroBasket game",
      "Dennis Schroder leads Germany to knockout round at EuroBasket"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.629,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During Germany's 107-88 win over Lithuania at EuroBasket, captain Dennis Schroder was subjected to racial abuse. The German Basketball Association reported that two individuals were identified and removed from the arena in Tampere, Finland. Meanwhile, Schroder, who is also a Sacramento Kings point guard, scored 26 points, helping Germany become the first team to reach the final 16 of the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amorim's Emotional Style Spurs Debate on Manchester United Strategy",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 04:00:37 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Forbes"
    ],
    "domains": [
      "www.ft.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The club shows the value of ‘satisficing’ rather than optimising",
      "When Amorim arrived at Manchester United England, I was one of many who wondered if there was some unseen strategy behind his regular emotional outbursts."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F38168eaf-6b88-4061-9030-c07703599135.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Manchester United: lessons from the fall",
      "Clues The End Of Manchester United And Ruben Amorim Is Soon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.76,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amorim's arrival at Manchester United sparked speculation about his frequent emotional outbursts, leading to discussions on the value of 'satisficing' over optimizing in the club's strategy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TikTok Adds Voice Messages and Image Sharing to Direct Messaging",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-29T15:53:06-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Every platform wants to be the place you hang with friends — even Spotify as of this week — so it’s apparently time for TikTok to shore up its direct messaging feature! It told TechCrunch that over the next few weeks, all users should see voice messages and image sharing options arrive in their DMs.",
      "The new capabilities bring TikTok’s messaging experience more in line with that of other popular social apps and services."
    ],
    "image_url": "",
    "titles": [
      "TikTok is now letting everyone DM each other with voice memos and pictures",
      "TikTok now lets users send voice notes and images in DMs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.655,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TikTok is enhancing its direct messaging feature by introducing voice messages and image sharing options, as confirmed to TechCrunch. This update, rolling out over the next few weeks, aims to make TikTok's messaging capabilities comparable to other leading social apps.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Crash in Key Largo Kills One, Injures Another; Legal Battle Ensues",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 17:34:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Tesla collision in Key Largo, Florida, killed 22-year-old Naibel Benavides and severely injured her boyfriend, Dillon Angulo.",
      "The company's lawyers blame the driver (who settled with the victims separately) for the crash, and the plaintiffs' lawyers for \"overwhelming\" the jury with \"irrelevant evidence.\""
    ],
    "image_url": "",
    "titles": [
      "Tesla asks for $243 million verdict to be tossed in fatal Autopilot crash suit",
      "Tesla challenges $243 million verdict in Autopilot death trial"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.612,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.577,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Key Largo, Florida, a Tesla crash resulted in the death of 22-year-old Naibel Benavides and serious injuries to Dillon Angulo. Tesla's legal team attributes the accident to the driver, who has already settled with the victims. They accuse the plaintiffs' lawyers of biasing the jury with irrelevant evidence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Sales Start Early: Discounts on TVs, Gear, and MacBooks",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-30T10:37:17-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Labor Day weekend has finally arrived, and after a week of early discounts trickling in, the sales are now in full swing. From big-screen OLED TVs and outdoor gear to back-to-school essentials like the latest MacBook Air, we rounded up a guide of almost 100 deals we think are worth your time and mon",
      "Labor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment, at least there is always a great selection of deals to combat the post-summer blues. You’ll have to wait until September 1st to celebrate the actual holiday, sure, but i"
    ],
    "image_url": "",
    "titles": [
      "The 20 best Labor Day deals you can grab for $100 or less",
      "The 91 best Labor Day deals we’ve found so far"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.968,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.462,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Labor Day weekend sales have begun, offering significant discounts on a wide range of products, including big-screen OLED TVs, outdoor gear, and back-to-school essentials like the latest MacBook Air. This marks the unofficial end of summer, with deals aimed at easing the transition into cooler weather and shorter days. The sales are highlighted as an opportunity to combat post-summer blues, starting before September 1st, the actual holiday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]