[
  {
    "title": "Trump Praises Kirk at Memorial, Widow Forgives Gunman; Musk Appears",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 02:09:32 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "The Guardian",
      "Global News",
      "ABC News",
      "Financial Times",
      "Business Insider",
      "BBC",
      "Forbes"
    ],
    "domains": [
      "www.ft.com",
      "globalnews.ca",
      "www.forbes.com",
      "www.businessinsider.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The US president broke with the forgiveness message of Kirk's widow, Erika, to say he hated his opponents.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBJLVJlb2hyTEJaMVp1TDZxWWxNTE94bnh1WWJqWmFieXJBbFlMYWlZQ1FKNDdSWXRnYXlVckp0T2ZZcDFUWGNCbXlWd0E1d3dnU3JHZWh2MWZSSEs2QTBISDZ5aURDVFNhcHpleGdZaEo0amR4bTlJTA?oc=5\" target=\"_blank\">Photos: Scenes from Charlie Kirk's memorial service</a>&nbsp;&nbs",
      "Tens of thousands packed State Farm Stadium on Sunday as President Donald Trump, Vice President JD Vance, Erika Kirk and more paid tribute to Charlie Kirk.",
      "President Donald Trump is among those who will speak at the memorial serve for conservative activist Charlie Kirk in Arizona.",
      "US president and senior Republicans mix faith and politics in commemoration that draws tens of thousands",
      "Scheduled speakers at the service include Trump, Vance, Health and Human Services Secretary Robert F. Kennedy Jr. and Defense Secretary Pete Hegseth.",
      "At Charlie Kirk's memorial, Elon Musk and Donald Trump were seen together for the first time since their public fall out over Trump's spending bill.",
      "<p>President delivers mix of eulogy and campaign speech while JD Vance calls Kirk ‘martyr for the Christian faith’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/21/erika-kirk-charlie-kirk-killing\">Erika Kirk, Charlie Kirk’s widow, says she forgives man accused of murder</a></p>",
      "Erika Kirk, the slain activist’s widow who took over as CEO of Turning Point USA, also addressed the crowd of mourners at State Farm Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fb56/live/e9a18490-9780-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Trump hails Charlie Kirk as 'martyr' as thousands fill memorial service",
      "Photos: Scenes from Charlie Kirk's memorial service - Axios",
      "Key takeaways from Charlie Kirk's memorial service",
      "Trump admin live updates: Trump at Charlie Kirk memorial service",
      "Trump hails Charlie Kirk as conservative ‘martyr’ in memorial service",
      "Trump to lead high-profile lineup honouring Charlie Kirk at Arizona service",
      "Elon Musk and Donald Trump reunite for the first time in months at Charlie Kirk's memorial service",
      "Charlie Kirk memorial: Trump says he ‘hates’ his opponents at event attended by tens of thousands",
      "Charlie Kirk Memorial: Trump Says He’ll Award Kirk Presidential Medal Of Freedom"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.864,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.823,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At Charlie Kirk's memorial service, President Trump praised the late activist as the \"greatest evangelist for American liberty\" and his widow, Erika Kirk, forgave the alleged gunman. Erika, now CEO of Turning Point USA, spoke to mourners at State Farm Stadium. The event also marked the first public appearance together of Trump and Elon Musk since their disagreement over a spending bill.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France, UK Among 11 Nations to Recognize Palestinian Statehood at UN Assembly",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:38:17 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Axios",
      "The Guardian",
      "NPR",
      "BBC",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org",
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The designation from U.S. allies follows U.K. Prime Minister Keir Starmer's meeting with President Trump last week.",
      "Canada, Australia and Portugal also announced the move on Sunday, with Israeli PM Benjamin Netanyahu accusing leaders of giving a \"huge reward to terrorism\".",
      "Despite widespread international recognition of Palestine, some Western nations have said they will only endorse Palestinian statehood as part of a comprehensive peace agreement with Israel. But the tide is changing.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBFbkY3Skk2YnFfT1B0eTlIUVFEbm1rWnMyQWZ3bWZkd1p6VjhTaUI2TzRlbmRhRGJDQXBiU1FwTGN5QUxHNHczMmUwanE4VW5OTGpyN2JyUDhOa3NXMHZ3R3k3b3Z6T3lVdGFHMnlMbUd0ang4aUw3dGdB?oc=5\" target=\"_blank\">UK, Canada and Australia formally recognize Palestinian state</",
      "<p>As well as being deeply symbolic, the move is also a major foreign policy shift for the Labour government</p><p>The UK’s formal recognition of Palestinian statehood is deeply symbolic on the world stage, but the major foreign policy shift is also a significant political step for the Labour govern",
      "The three major U.S. allies reversed decades of unwillingness to accept Palestinians as a sovereign nation until their conflict with Israel was settled.",
      "Anger over Israel’s war in Gaza has left it increasingly isolated, as Britain, Canada and Australia all announced they were recognizing a Palestinian state.",
      "The moves came just before the annual U.N. General Assembly, increasing pressure on Israel and putting key allies at odds with the Trump administration.",
      "<p>Move comes as Anthony Albanese tries to secure meeting with Donald Trump and amid warnings that recognition could spark ‘punitive measures’ from the US</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine"
    ],
    "image_url": "",
    "titles": [
      "U.K., Canada and Australia recognize a Palestinian state, despite U.S. opposition",
      "UK formally recognises Palestinian state",
      "Which countries recognize Palestinian statehood?",
      "UK, Canada and Australia formally recognize Palestinian state - Axios",
      "How will recognition of Palestinian statehood be greeted in the UK?",
      "U.K., Canada, Australia recognize Palestine as a state, breaking with U.S.",
      "Here are countries that recognize a Palestinian state — or may do so soon",
      "Britain, Australia, Canada and Portugal Recognize a Palestinian State",
      "Australia joins UK and Canada in formally recognising Palestinian state"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.625,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.81,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the upcoming UN General Assembly, France, the UK, and nine other countries plan to recognize Palestinian statehood. This move comes despite some Western nations' stance of only endorsing Palestinian statehood within a comprehensive peace agreement with Israel, indicating a shift in international policy towards Palestine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Notes Ellison, Dell in TikTok Deal; US to Dominate Board, Control Algorith",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 21:35:04 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Global News",
      "Al Jazeera",
      "BBC",
      "CNBC",
      "TechCrunch",
      "CityNews",
      "Fortune"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "techcrunch.com",
      "www.cnbc.com",
      "globalnews.ca",
      "www.aljazeera.com",
      "fortune.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Oracle chairman Larry Ellison and Dell founder Michael Dell are also both involved, the president tells Fox News.",
      "Murdoch will be part of a group of US investors - including Trump allies - trying to take over TikTok&#039;s US operations.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE1ZREhDMGtuaTBVeGFEbWpNTENhUnlFOVVGbE9qRGg4WU1qYkVOUV9oUzJmZ0haOUlaTEIzeHNEdVNKaTBhUG9oTjRXNnEyQjlZMF9UX2ZONEJ6Y25yNXN2Mk5CYXN4bU0?oc=5\" target=\"_blank\">Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says</a>&nbsp;&nbsp;",
      "President Donald Trump also said that Larry Ellison and Michael Dell are also likely to be involved in the TikTok deal.",
      "Rupert Murdoch and Michael Dell were revealed by U.S. President Donald Trump as being part of a potential deal to acquire control of TikTok in America.",
      "The White House announced on Saturday that the US operations of TikTok will be majority-owned and controlled by American investors.",
      "The Trump administration has been talking up a potential TikTok deal this weekend, with President Donald Trump telling Fox News on Sunday that Rupert Murdoch and his son Lachlan are \"probably\" going to be involved.",
      "President Donald Trump said prominent billionaires – including media mogul Rupert Murdoch and tech founder Michael Dell – could be part of a deal in which the U.S. will take control of the social video platform TikTok. Trump namedropped the 94-year-old Murdoch and his son Lachlan Murdoch, the head o"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/090f/live/87a858f0-9720-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Murdochs likely to be involved in US TikTok deal, Trump says",
      "Trump says Lachlan Murdoch part of proposed TikTok deal",
      "Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says - Axios",
      "Trump says Murdochs are potential TikTok deal partners",
      "Trump says US TikTok deal could include Rupert Murdoch, Michael Dell",
      "Trump suggests Murdochs will have role in new TikTok deal",
      "Trump says Lachlan and Rupert Murdoch might invest in TikTok deal",
      "Trump reveals Murdochs and Dell could potentially take part in TikTok deal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.785,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.807,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump mentioned Larry Ellison and Michael Dell's potential involvement in the TikTok deal. The White House press secretary announced that in the restructured TikTok, Americans will occupy six out of seven board seats, and control over the app's algorithm will be in U.S. hands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Najee Harris Suffers Serious Achilles Injury in Game Against Broncos",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 02:21:13 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Chargers running back Najee Harris had what preliminary tests revealed was an Achilles injury during Sunday's 23-20 win against the Denver Broncos, coach Jim Harbaugh said after the game.",
      "The injury doesn't look good for Harris and the Chargers",
      "<p>Los Angeles Chargers running back Najee Harris hurt his left ankle on a non-contact play in the second quarter Sunday against the Denver Broncos.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chargers' Harris carted off with Achilles injury",
      "Najee Harris injury update: Chargers RB injured Achilles vs. Broncos, Jim Harbaugh confirms",
      "Chargers’ Najee Harris injures ankle during non-contact play vs. Broncos"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Najee Harris, running back for the Los Angeles Chargers, sustained an Achilles injury during a game against the Denver Broncos, as confirmed by coach Jim Harbaugh. The injury occurred in the second quarter on a non-contact play. Preliminary tests indicate it's serious, impacting Harris and the Chargers' lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardinals' James Conner to Miss Season, Requires Ankle Surgery",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 02:21:13 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Cardinals running back James Conner suffered a season-ending right ankle injury during Sunday's loss to the 49ers, and he will require surgery, a source told ESPN.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQWGFHc1pOZF8xSDFBVDBhd0RsbjNtVzBBdVpqT3RmbHdNNTIyMVMzVnZoSlA5ZTZhbi1VYnZQOVVnTGl6Y1BhZGJOVlNnTXk1MFNYWTE1YlU0U3liV3pLWnpDcEhWOVdmblZBZ29YZnFtNjZJVDRWNHkzLUNINGZvNmR6OExDaG55QnlTUmpPbklYMFdQLWRtN2R3?oc=5\" target=\"_blank\">Arizona Cardinals L",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQSHJLYkNzbF9RTmVvbkcwWDN1WHRPWTNNTHdYTmtlTDBFcl91TTlDT1F0VkhUT1pjTnRneF9QZ2tIbnZoZXp2U0dST09ZYUNZbmttRTlLUGFzRWJMYnJOb05aRXh6OWRYblNyWVFiODhnU2NPc3dKeUd1dnN4Z2IzLXRKUjRCQ1dEekt4NktR?oc=5\" target=\"_blank\">Eagles Get Crucial Lane Johnson Inj",
      "<p>Arizona Cardinals running back James Conner was taken off the field on a cart with a right ankle injury in the third quarter of Sunday&#8217;s game against the San Francisco 49ers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: RB Conner suffers season-ending injury",
      "Arizona Cardinals Lose James Conner to Season-Ending Injury - Sports Illustrated",
      "Eagles Get Crucial Lane Johnson Injury Update - Sports Illustrated",
      "Report: Cardinals’ James Conner suffers season-ending ankle injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "James Conner, the running back for the Arizona Cardinals, suffered a right ankle injury during the game against the 49ers, leading to his season ending prematurely. He will undergo surgery for this injury, as confirmed by a source to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO Jets Track Russian Plane Over Baltic Amid Ignored Contact Attempts",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 20:12:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "This was the latest event after a series of incursions by Russian military aircraft into NATO airspace in September, leading to heightened tensions between NATO and Russia.",
      "German Air Force says its &#039;quick reaction alert force&#039; was ordered by NATO to investigate plane in neutral airspace.",
      "<p>Russian Il-20M reconnaissance plane ignored requests to make contact, in latest of what are seen as provocative acts by Kremlin</p><p>Two German Eurofighter jets <a href=\"https://www.spiegel.de/ausland/ostsee-russisches-militaerflugzeug-loest-alarmstart-von-eurofightern-aus-a-178ec37b-61dc-48b4-8"
    ],
    "image_url": "",
    "titles": [
      "German and Swedish jets intercept Russian military plane over Baltic Sea",
      "Germany scrambles jets after Russia military aircraft flies over Baltic Sea",
      "German jets scrambled after Russian military plane flies over Baltic Sea"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.847,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NATO ordered German air force's quick reaction alert force to investigate a Russian Il-20M reconnaissance plane flying in neutral airspace over the Baltic Sea after it ignored contact requests. German and Swedish fighter jets tracked the aircraft, marking another incident in a series of what are considered provocative acts by the Kremlin.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Ragasa Prompts Evacuations in Philippines, Heads to China",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 07:00:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Phys.org",
      "Deutsche Welle"
    ],
    "domains": [
      "phys.org",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Ragasa is forecast to hit northern Philippines on its way to southern China later this week.",
      "Ahead of Typhoon Ragasa's landing, Filipino authorities warned of floods, landslides, and power outages as evacuations began. Flights and ferries were canceled, and schools and offices were closed.",
      "The Philippines and Taiwan ordered evacuations Sunday ahead of possible flooding and landslides as Super Typhoon Ragasa approached, gaining strength on its way to an eventual collision with southern China."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cf1c/live/4b055c30-976c-11f0-aeb5-dbb80ec4859e.jpg",
    "titles": [
      "Super typhoon nears Philippines as thousands evacuate",
      "Evacuations begin as Typhoon Ragasa nears Philippines",
      "Evacuations in Philippines, Taiwan as super typhoon nears"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.955,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Typhoon Ragasa is expected to impact the northern Philippines before moving towards southern China. Authorities in the Philippines have initiated evacuations, warning of potential floods, landslides, and power outages. Transportation services, including flights and ferries, have been canceled, and educational and governmental offices are closed. Both the Philippines and Taiwan have conducted evacuations in anticipation of the typhoon, which is gaining strength.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indian IT Stocks Fall as U.S. Hikes H-1B Visa Fee",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 07:48:29 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian",
      "Fortune"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "fortune.com"
    ],
    "snippets": [
      "Investors shed shares of IT outsourcing firms of all sizes, including Infosys, Tech Mahindra, Wipro, HCL Technologies and Tata Consultancy Services.",
      "<p>India has been one of the largest beneficiaries of H-1B visas, accounting for 71% of approved visas in 2024</p><p>India has hit back at Donald Trump’s decision to impose a $100,000 fee on H1-B visas for skilled foreign workers in the US, sparking warnings by the Indian government that it would ha",
      "The United States awards 85,000 H-1B visas per year on a lottery system, with India accounting for around three-quarters of the recipients."
    ],
    "image_url": "",
    "titles": [
      "How India will feel the sting of Trump's H-1B visa fee hike",
      "‘Afraid of our talent’: India hits back against Trump’s H1-B visa fee hike",
      "‘My main dream is derailed’ — Trump’s $100,000 H-1B visa fee shatters U.S. hopes for many in India"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shares of major Indian IT outsourcing firms, including Infosys, Tech Mahindra, Wipro, HCL Technologies, and Tata Consultancy Services, declined after the U.S. imposed a $100,000 fee on H-1B visas. India, which accounts for 71% of the approved H-1B visas and benefits significantly from the 85,000 visas awarded annually, criticized the decision, warning of negative impacts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyber Incident at Collins Aerospace Disrupts European Flights",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 05:50:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "TechCrunch",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Brussels Airport asks airlines to cancel nearly half of their outgoing flights on Monday.",
      "<p>Zaventem asks airlines to cancel half of Monday departures, while most of Heathrow flights expected to operate </p><p>Hundreds of thousands of passengers at Heathrow and Berlin airports faced flight delays on Sunday after a <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport",
      "Travelers at major European airports including Heathrow, Brussels, and Berlin faced significant delays this weekend following what Collins Aerospace described as a “cyber-related incident.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2e68/live/ce6975a0-976e-11f0-90f2-5f87cb020b24.jpg",
    "titles": [
      "European airport disruption continues after weekend cyber-attack",
      "Disruption continues at Heathrow, Brussels and Berlin airports after cyber-attack",
      "Hundreds of flights delayed at Heathrow and other airports after apparent cyberattack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A cyber-related incident by Collins Aerospace led to major disruptions at European airports, including Heathrow, Brussels, and Berlin, causing hundreds of flight delays and cancellations over the weekend. Zaventem Airport requested airlines to cancel half of Monday's departures, though most of Heathrow's flights were expected to operate normally.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kim Jong-un Open to U.S. Talks Without Denuclearization Demand",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 03:08:49 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPV2V2Qm5EQktqclFWazI2cGxCNkFyRnRyaDJPT1NnVnlRdkJkXzR6VnNRZTJXMVlJZmg2d2tkRm1kaG1IV1hnWGZSbjg0bld0Q3pjWGh5VDkyZUNfaWZKdDhXVDl0QUo3N2FfMGRLNnM1QlZqUzdQc29MNXdRUEdMNkVn?oc=5\" target=\"_blank\">Kim says he's open to talks with U.S., has \"fond\" m",
      "<p>Comments from North Korea’s leader come as South Korea’s Lee Jae Myung says he could accept a deal that sees the North retain its nuclear weapons</p><p>The North Korean leader, Kim Jong-un, has suggested he would be open to talks with the US, while South Korea’s president has hinted he would acce",
      "The North Korean leader, however, insisted the U.S. must abandon its push to denuclearize his country for there to be any chance of dialogue."
    ],
    "image_url": "",
    "titles": [
      "Kim says he's open to talks with U.S., has \"fond\" memories of Trump - Axios",
      "Kim Jong-un open to nuclear talks with US, saying he has ‘fond memories’ of previous Trump meeting",
      "Kim Jong-Un Says He Has ‘Fond Memories’ Of Trump And Is Open To Talks With U.S."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.882,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "North Korean leader Kim Jong-un expressed openness to dialogue with the U.S., conditional on the cessation of U.S. demands for denuclearization. Concurrently, South Korea's President Lee Jae Myung indicated a willingness to consider a deal allowing North Korea to retain its nuclear arsenal. This development marks a significant stance from both Koreas regarding nuclear negotiations with the U.S.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ousmane Dembele Favored for 2025 Ballon d'Or, Won't Attend Ceremony",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 05:51:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.independent.co.uk",
      "www.bbc.com"
    ],
    "snippets": [
      "We look at how six of the key contenders for the 2025 men's and women's Ballon d'Or awards performed last season.",
      "The awards by France Football and Fifa are decided in different ways and carry different prestige too",
      "Paris Saint-Germain forward Ousmane Dembele is the clear bookmakers' favourite to win his first Ballon d&#8217;Or when the ceremony takes place on Monday night - although the Champions League winner won't be there to pick up the prize if he is successful."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/02c9/live/ee839350-977a-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Who are contenders for 2025 men's & women's Ballon d'Or awards?",
      "What is the difference between the Ballon d’Or and The Best Fifa Awards?",
      "Dembele favourite to win Ballon d'Or with Lionesses in mix for women's awards"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A review of six key contenders for the 2025 Ballon d'Or awards highlights their performances last season. The awards, organized by France Football and FIFA, have distinct selection criteria and prestige levels. Paris Saint-Germain forward Ousmane Dembele emerges as the favorite to win his first Ballon d'Or, according to bookmakers. However, despite being a favorite, Dembele will not attend the ceremony.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "A'ja Wilson Wins WNBA MVP Again, First to Claim Title Four Times",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 13:32:26 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Wilson, a 6-foot-4 center for the Las Vegas Aces, has dominated this year. In her eighth season, she finished in the top five in points, rebounds, blocks and steals.",
      "Las Vegas Aces' A'ja Wilson was awarded 2025 WNBA MVP, her fourth win in eight seasons. Wilson stands as the only player in league history to win the award four times.",
      "<p>Las Vegas Aces star A&#8217;ja Wilson is in a class by herself, winning the WNBA MVP for an unprecedented fourth time.</p>"
    ],
    "image_url": "",
    "titles": [
      "A'ja Wilson snags a record fourth WNBA MVP",
      "Las Vegas Aces A’ja Wilson Sets New Standard, Wins Fourth MVP",
      "Aces’ Aja Wilson named WNBA MVP, becomes first four-time winner"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.737,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A'ja Wilson has been named the WNBA's MVP for the second consecutive year, marking her as the league's first four-time MVP. This achievement highlights her continued excellence and record-breaking performance in women's basketball.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NY Giants' Gano's Sunday Game Status Uncertain Despite Normal Warmup",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 00:48:33 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.bigblueview.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "It's unknown whether Gano will kick on Sunday night",
      "Gano said he had a “normal warmup” and had no injuries coming into the game",
      "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxPcF9ENGl4eTVTaHkwS2NpWmkwZFZQR2lPS1VKUEZRYW1NYktQRG4zTWcycGktT1R1anQzLWVlWTdUc3dEcFZtVDJraDd5VDNpVHBlNnpES0ZUNUlYcDdnRnd4NldVVUl6MWNOZ2FtWUI3NEJkZ2t5QVFtUTlBSFZVRV9sVFQyRTl1YWtXQU1zeHVSYnBZUlFyMVR4X2dtS21B?oc=5\" target=\"_blank\">NY Giants K"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/c30293b9-c85e-42a9-b2de-21e59fd88069/gano.jpg",
    "titles": [
      "Giants' Graham Gano questionable to kick vs. Chiefs after suffering groin injury in warmups, per report",
      "Giants’ PK Graham Gano frustrated by pre-game groin injury",
      "NY Giants Kicker Graham Gano Suffers Critical Pregame Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.858,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Graham Gano, kicker for the NY Giants, is uncertain to play in Sunday night's game. Despite having a \"normal warmup\" and reporting no injuries prior to the game, his status remains unclear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration to Endorse Leucovorin for Autism Treatment",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 01:18:33 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5nYUx4cVlYemFCdDVHM2hoc2RYVWQ1N3hmd2l5V0w1TlBHLXFRTm1pZ1VWcmxMMk50bE91WjhBLUJpeDRYMGFuc21iU2pIQlRzYThfcDhwb1RZY3F0R3c1dTNBYWdjeVl1YkFpQjVSaXdZaklN?oc=5\" target=\"_blank\">Trump to link autism to Tylenol use during pregnancy</a>&nbsp;&nbsp;<fo",
      "Federal health officials also are expected to highlight leucovorin as a potential autism treatment, according to The Washington Post.",
      "<p>Washington Post says announcement imminent despite guidelines showing drug – known as paracetamol elsewhere - is safe for pregnant women to take</p><p>Donald Trump’s <a href=\"https://www.theguardian.com/us-news/trump-administration\">administration</a> is on Monday expected to tie pregnant women’s"
    ],
    "image_url": "",
    "titles": [
      "Trump to link autism to Tylenol use during pregnancy - Axios",
      "Trump administration reportedly plans to link autism to Tylenol use during pregnancy",
      "Trump officials reportedly set to tie Tylenol to autism risk"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.849,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Federal health officials are expected to endorse leucovorin as a potential autism treatment, as per The Washington Post. Despite guidelines indicating the safety of paracetamol (known as leucovorin elsewhere) for pregnant women, this announcement is anticipated to come from Donald Trump's administration on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cal Raleigh Hits Season-High 58th HR, Mariners Sweep Astros",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 02:21:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mariners star Cal Raleigh hit his MLB-leading 58th home run Sunday night as Seattle completed a three-game sweep of Houston.",
      "<p>Seattle’s Cal Raleigh hit his MLB-leading 58th home run on Sunday night, a two-run shot in the second inning against the Houston Astros.</p>"
    ],
    "image_url": "",
    "titles": [
      "Raleigh's 58th HR fuels Mariners' sweep of Astros",
      "Crawford’s grand slam, Raleigh’s 58th HR lead Mariners to sweep over Astros"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seattle Mariners' Cal Raleigh hit his 58th home run of the season, the highest in MLB this year, during a game against the Houston Astros on Sunday night. This achievement came as the Mariners completed a three-game sweep of Houston.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Blue Jays Secure Playoff Berth After Defeating Royals 8-5",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 21 Sep 2025 21:07:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays officially clinched a playoff berth after defeating the Kansas City Royals 8-5 on Sunday.",
      "<p>The Toronto Blue Jays are headed to the post-season for the 11th time in franchise history.</p>",
      "<p>Watch as Toronto Blue Jays manager John Schneider speaks to the team after defeating the Kansas City Royals and clinching a playoff spot.</p>",
      "<p>Toronto Blue Jays&#8217; George Springer joins Arden Zwelling during the locker room celebrations, saying he loves his teammates and thinks they have a special group.</p>",
      "<p>Brad Fay and Joe Siddall discuss how the Blue Jays clinched a post-season berth after a four-game losing streak, and how they relied on the depth of this roster, which has been their strength and identity all season long.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/493fe94fe28bfe9696917b57df022a61a228163296fc99ff377fee40007723a0_6c824d.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays clinch playoff spot with win over Royals",
      "Blue Jays clinch post-season berth with win over Royals",
      "Schneider delivers speech to Blue Jays after clinching post-season berth",
      "‘It’s special’: Springer on Blue Jays making the post-season",
      "Blue Jays lean on depth to snap their slump and clinch playoff berth"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.794,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.664,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have clinched a playoff berth for the 11th time in franchise history and for the third time in four years after defeating the Kansas City Royals 8-5. This victory came following a four-game losing streak, showcasing the team's depth and resilience, which have been pivotal to their success this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 3 Analysis: Bengals QB Support and Eagles Passing Strategy Reviewed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 23:46:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Do the Bengals need QB help? Should the Eagles throw the ball way more? We sized up Week 3 overreactions.",
      "Which overreactions are out of left field and which have some merit?"
    ],
    "image_url": "",
    "titles": [
      "Week 3 overreactions: Eagles need to throw more; Bengals need Cousins",
      "NFL Week 3 overreactions: Time for Falcons to go back to Kirk Cousins? Bengals should move on from Zac Taylor?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Analyzing Week 3 NFL discussions, experts evaluate if the Bengals require quarterback assistance and if the Eagles should increase their passing game. The review distinguishes between exaggerated reactions and those with valid points, aiming to provide a balanced perspective on team strategies moving forward.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Nominate Halligan as Virginia Chief Prosecutor, Urges Legal Action",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 06:06:39 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Fortune"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com"
    ],
    "snippets": [
      "President Donald Trump said Saturday that he would be nominating senior White House aide Lindsey Halligan to serve as the top federal prosecutor for the Virginia office that was thrown into turmoil when its U.S. attorney was pushed out Friday.",
      "The announcement came as Trump pressed Attorney General Pam Bondi to move forward with pursuing cases against some of his political opponents."
    ],
    "image_url": "",
    "titles": [
      "Trump nominates White House aide to be top US prosecutor for office probing Letitia James",
      "Trump nominates White House aide to replace U.S. attorney who was forced out after failing to prosecute president’s adversaries"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.631,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.613,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced his intention to nominate Lindsey Halligan, a senior White House aide, as the chief federal prosecutor for the Virginia office, following the recent ousting of its U.S. attorney. Concurrently, Trump has urged Attorney General Pam Bondi to advance legal actions against his political adversaries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints for NYT Strands Puzzle and Connections Game Now Online",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 19:00:18 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Strands puzzle? Here's an extra hint to help you uncover the right words, as well as all of today's answers and Spangram.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/661994c1a11cd45a738c205f/0x0.jpg?width=960",
    "titles": [
      "NYT Strands Today: Hints, Spangram And Answers For Monday, September 22nd — ‘Find An Opening’",
      "Today’s NYT ‘Connections’ Hints And Answers For Sunday, September 21st"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.826,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.443,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hints and solutions for today's New York Times Strands puzzle and Connections game are available online. These resources offer extra help for players seeking to uncover the right words in Strands and solve the Connections game, providing both hints and complete answers.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  }
]