[
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various lighting needs. It features a rechargeable, compact design with three adjustable LED panels that emit 3000 lumens, ideal for illuminating campsites, workspaces, or engine blocks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7547919191550926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3986979797887732,
    "summary": "BougeRV has released an LED lantern designed for outdoor camping, which also serves as a multifunctional work lamp. It boasts a rechargeable, compact form and has three adjustable LED panels that produce 3000 lumens, making it suitable for lighting up campsites, workspaces, and engine blocks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction to prevent the Trump administration and the Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of an ongoing court case."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4210303446875,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31525758617187505,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction halting efforts by the Trump administration and the Department of Government Efficiency to dismantle the Consumer Financial Protection Bureau (CFPB). This decision will remain in effect until the resolution of an active court case."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has announced that in the latest Windows 11 Insider Preview, it will remove a bypass script that previously allowed users to set up Windows 11 devices without an internet connection and logging in. This move enforces the requirement for all Windows 11 devices to be connected to the internet and to have a user account for setup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4170372888425926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3142593222106481,
    "summary": "Microsoft will update the Windows 11 Insider Preview to eliminate a script that let users set up the system without an internet connection or logging in. This change mandates that all Windows 11 devices must be connected to the internet and require a user account for setup."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features a wide range of deals that are accessible without an Amazon Prime membership. A comprehensive roundup includes over 100 deals on popular gear, alongside a selection of low-cost alternatives for budget-conscious shoppers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4087618256018518,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31219045640046295,
    "summary": "Amazon's Big Spring Sale is happening now through March 31st, offering a variety of deals on over 100 items, including popular gear and budget-friendly options. The sale is open to all shoppers, not just Amazon Prime members."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X, previously known as Twitter, in an all-stock deal. Musk, who bought Twitter for $44 billion years earlier, announced the acquisition, valuing xAI at $80 billion and X at $33 billion, with the latter carrying $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.40280117718749997,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31070029429687496,
    "summary": "Elon Musk's AI firm, xAI, has bought the social media platform X (formerly Twitter) in an all-stock transaction. The deal values xAI at $80 billion and X at $33 billion, despite X having $12 billion in debt. Musk, who previously purchased Twitter for $44 billion, announced this acquisition."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11. This feature, aimed at IT professionals, enables the remote recovery of devices that are unable to boot. The development follows Microsoft's announcement last year, intending to prevent incidents similar to the previous Crowdstrike catastrophe."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.395416917662037,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3088542294155092,
    "summary": "Microsoft has introduced a new feature called Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653) for Windows 11. This feature is designed for IT professionals to remotely recover devices that cannot boot. This development comes after Microsoft's announcement last year, aiming to avoid situations like the Crowdstrike incident."
  },
  {
    "title": "The Fitbit-to-Google account migration deadline moves to 2026",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:10:26-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google has extended the deadline for Fitbit users to migrate their accounts to a Google account until next year. This update comes after Google acquired Fitbit in early 2021 and initially set a 2025 deadline for account migration."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3793058062962963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30482645157407406,
    "summary": "Google has postponed the deadline for Fitbit users to switch their accounts to Google accounts to next year. This decision follows Google's acquisition of Fitbit in early 2021, where they initially set a 2025 deadline for users to migrate their accounts."
  },
  {
    "title": "The Trump administration could green-light deep-sea mining for the first time",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:55:24-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Metals Company (TMC), aiming to initiate deep-sea mining, has sought closer ties with the Trump administration following challenges in international talks. Initially sponsored by Nauru, TMC's efforts in 2021 accelerated the push to establish regulatory frameworks for deep-sea mining."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.36886599121527774,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30221649780381943,
    "summary": "The Metals Company (TMC), focused on starting deep-sea mining, sought to strengthen its relationship with the Trump administration amid difficulties in global discussions. Sponsored by Nauru, TMC's actions in 2021 hastened efforts to create regulations for deep-sea mining."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 101 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:42:23-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. This sale event, running until March 31, 2025, offers significant discounts on a variety of products including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3598266391087963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2999566597771991,
    "summary": "Amazon has initiated its Big Spring Sale, offering substantial discounts on a range of items such as gardening supplies and bedding. This sale event is scheduled to run until March 31, 2025, aligning with the onset of spring."
  },
  {
    "title": "MrBeast co-wrote a book with James Patterson",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T16:27:34-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "MrBeast and author James Patterson are co-writing a thriller novel with similarities to Squid Game. The untitled book, which involves players surviving deadly tests, has received eight-figure bids for publishing rights, as reported by Deadline."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3495372870023148,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2973843217505787,
    "summary": "MrBeast and James Patterson are collaborating on a thriller novel, drawing comparisons to Squid Game, about players navigating lethal challenges. The yet-to-be-titled book has attracted eight-figure publishing bids, according to Deadline."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, prompting rescue operations to save individuals trapped in the debris. Rescuers are currently working to extract survivors from the wreckage."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to ongoing rescue efforts to save people trapped under the debris. Rescuers are actively working to extract survivors from the rubble."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 21 people being injured and caused a restaurant along with several other buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "Vance scolds Denmark during Greenland trip",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 10:58:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Denmark's Prime Minister criticized the visit by the US Vice President and other top officials, stating it demonstrated a \"lack of respect.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Denmark's Prime Minister expressed criticism towards a visit by the US Vice President and other senior officials, describing it as showing a \"lack of respect.\""
  },
  {
    "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 23:44:51 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president labeled the discussions with Canada as \"extremely productive\" and announced plans for a meeting with Canadian leaders following the upcoming elections in Canada."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The US president described recent talks with Canada as \"extremely productive\" and announced intentions to meet with Canadian leaders after Canada's forthcoming elections."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their experiences of distress and suffering with the BBC, highlighting the emotional toll of their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing people in Antigua have expressed their distress and suffering to the BBC, emphasizing the emotional impact of their loved ones' disappearances."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki has been criticized for wearing a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise while promoting his book on TV."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed against a controversial influencer, accusing him of assault and threats during an incident in Beverly Hills. The influencer has denied the allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit has been filed against a controversial influencer, alleging assault and threats during an incident in Beverly Hills. The influencer denies the claims."
  },
  {
    "title": "Academy apologises for statement on Palestinian Oscar winner attack",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:47:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The academy issued an apology following criticism from celebrities such as Mark Ruffalo, Javier Bardem, and Emma Thompson."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The academy has issued an apology after receiving criticism from well-known actors including Mark Ruffalo, Javier Bardem, and Emma Thompson."
  },
  {
    "title": "Prominent Jewish figures boycott Israel antisemitism event over far-right guests",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 16:31:14 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Several key leaders did not attend an event due to the participation of far-right European politicians."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several key leaders skipped an event because far-right European politicians were participating."
  },
  {
    "title": "'Then, the phone rang': BBC's Mark Lowen on being deported from Turkey",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:04:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A BBC correspondent was deported from Turkey following their coverage of mass protests in the country."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A BBC correspondent was deported from Turkey after reporting on mass protests in the country."
  },
  {
    "title": "Top US vaccine official forced to resign, reports say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 03:05:26 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Peter Marks resigned, citing in his resignation letter that his new boss, Robert F Kennedy Jr., supports \"misinformation and lies.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Peter Marks resigned from his position due to disagreements with his new boss, Robert F Kennedy Jr., accusing him of supporting \"misinformation and lies\" in his resignation letter."
  },
  {
    "title": "Israel conducts first strike on Beirut since Hezbollah ceasefire",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 14:51:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel conducted a strike on a Hezbollah site, following the launch of two rockets from southern Lebanon into northern Israel. This incident marks a significant escalation in the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Israel launched a strike on a Hezbollah location in response to two rockets fired from southern Lebanon into northern Israel, marking a notable increase in tensions in the area."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action is viewed as an effort to question the legitimacy of the current government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event is being interpreted as an attempt to challenge the legitimacy of the government in Kyiv."
  },
  {
    "title": "'People are screaming help me': Myanmar earthquake survivors describe horror",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:26:19 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 7.7 magnitude earthquake struck Myanmar, causing significant damage. In Mandalay, a rescuer reported digging through the rubble with his bare hands in an effort to find survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 7.7 magnitude earthquake hit Myanmar, resulting in considerable destruction. In Mandalay, rescuers are searching through debris manually to locate survivors."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 07:19:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing widespread damage in the area."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by MF Husain, measuring 14 feet in width, was sold for $13.8 million in New York last week, setting a new record for the artist's work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold for $13.8 million in New York, setting a new record for the sale of his artwork."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their role in a successful evacuation mission at a military base in South Sudan, despite coming under attack."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further escalation, according to a car seller interviewed by the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices for cars have risen significantly, with further increases anticipated, as reported by a car seller to the BBC."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed following a powerful earthquake in Myanmar. Dozens of people are reported missing in the aftermath of the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction in Myanmar collapsed due to a powerful earthquake. Reports indicate dozens of people are missing following the incident."
  },
  {
    "title": "Watch: Moment baby is born on Bangkok street after quake evacuation",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 18:30:40 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A woman gave birth to her baby shortly after being evacuated from a hospital."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A woman delivered her baby soon after being evacuated from a hospital."
  },
  {
    "title": "Pagoda collapses in Myanmar after earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:06:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Shwe Sar Yan Pagoda, located south-east of Mandalay in Myanmar, experienced a collapse at its top due to an earthquake."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Shwe Sar Yan Pagoda, situated southeast of Mandalay in Myanmar, suffered a collapse at its top following an earthquake."
  },
  {
    "title": "Why can’t we remember our early years? Do babies make memories at all?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:22:26 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have for the first time observed the formation of memories in babies' brains as they happen."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have observed the formation of memories in babies' brains in real-time for the first time."
  },
  {
    "title": "Rival rallies erupt in South Korea over President Yoon’s impeachment",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:04:01 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Supporters and critics of South Korean President Yoon Suk Yeol protested in Seoul during his impeachment trial."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Seoul, both supporters and critics of South Korean President Yoon Suk Yeol gathered to protest amid his impeachment trial."
  },
  {
    "title": "Is Sudan’s war merging with South Sudanese conflicts?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:50:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The conflict in Sudan is extending into South Sudan, with both the Sudanese army and the Rapid Support Forces (RSF) looking for new allies and proxy groups in the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The conflict in Sudan has spread into South Sudan as the Sudanese army and the Rapid Support Forces (RSF) seek new allies and proxy groups in the area."
  },
  {
    "title": "New approach could treat anthrax beyond the 'point of no return'",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:28:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a treatment using a mix of growth factors that reversed severe cell damage in mice infected with anthrax. This finding suggests the potential for adapting this method to treat anthrax in humans."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a treatment with growth factors that successfully reversed severe cell damage in mice with anthrax, indicating a possibility of adapting this approach for human anthrax treatment."
  },
  {
    "title": "AI meets oncology: New model personalizes bladder cancer treatment",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:53 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have created an advanced AI model that improves predictions on chemotherapy responses in muscle-invasive bladder cancer patients. This model uniquely combines whole-slide tumor imaging with gene expression analysis, offering more accurate predictions than earlier methods relying on a single data type."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new AI model that enhances the accuracy of predicting chemotherapy outcomes for muscle-invasive bladder cancer patients by integrating whole-slide tumor imaging with gene expression analysis. This approach outperforms previous methods that used only one type of data."
  },
  {
    "title": "PET imaging confirms direct involvement of dopamine in cognitive flexibility",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:47 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Scientists have discovered a link between dopamine and cognitive flexibility, showing through PET imaging that increased dopamine production in the brain during challenging tasks improves task efficiency. This finding could lead to better treatment options for neurological and psychiatric disorders."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Scientists have found that higher dopamine production in the brain is linked to improved cognitive flexibility, making tasks more efficient. This discovery, made using PET imaging during challenging tasks, could enhance treatments for neurological and psychiatric disorders."
  },
  {
    "title": "Understanding the immune response to a persistent pathogen",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that the immune system can identify and manage the dormant phase of Toxoplasma gondii, a parasite. This insight could help understand how to control latency in other nervous system infections."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that the immune system can detect and control the inactive stage of Toxoplasma gondii, a parasite. This discovery may aid in understanding how to manage dormant infections in the nervous system."
  },
  {
    "title": "Global patterns in seed plant distribution over millions of years",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:25:39 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing nearly 270,000 seed plant species globally has examined why certain plants prosper in specific areas but not in others, focusing on the impact of environmental conditions and dispersal barriers. The research aims to understand the distribution patterns of plant diversity and their evolution over millions of years."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A global study of nearly 270,000 seed plant species aimed to understand why some plants thrive in certain regions but not in others, focusing on the role of environmental conditions and dispersal barriers. The research explores the distribution and evolution of plant diversity over millions of years."
  },
  {
    "title": "Houston survives on 'beautiful' last-second play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:15:42 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "No. 1 Houston secured a 62-60 victory over Purdue, advancing to the Elite Eight, thanks to a successfully executed inbounds play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "No. 1 Houston won against Purdue with a score of 62-60, moving on to the Elite Eight after a successful inbounds play."
  },
  {
    "title": "'Generational' talent Betts keeps No. 1 UCLA rolling",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lauren Betts scored 31 points and secured 10 rebounds, leading UCLA to a 76-62 victory over Ole Miss, advancing them to the Elite Eight for the first time since 2018."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Lauren Betts led UCLA to a 76-62 win over Ole Miss with a performance of 31 points and 10 rebounds, taking the team to the Elite Eight for the first time since 2018."
  },
  {
    "title": "Betts revels in walk-off HR after emotional week",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:13:45 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mookie Betts hit a walk-off homer on Friday, an emotional highlight after a challenging start to the season. Betts had lost nearly 20 pounds due to an illness."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mookie Betts hit a walk-off homer on Friday, marking a significant moment following a tough season start, during which he lost nearly 20 pounds because of an illness."
  },
  {
    "title": "Dominant Morrow puts LSU in 3rd straight Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aneesah Morrow scored 30 points and grabbed 19 rebounds, leading LSU to an 80-73 victory over NC State, securing their third consecutive Elite Eight appearance in the tournament. This performance came as Flau'Jae Johnson had a challenging game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aneesah Morrow led LSU to an 80-73 win over NC State with a 30-point, 19-rebound performance, marking LSU's third straight Elite Eight appearance in the tournament. This standout performance occurred as teammate Flau'Jae Johnson faced difficulties in the game."
  },
  {
    "title": "Gottlieb defends MSU: JuJu not hurt on dirty play",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USC coach Lindsay Gottlieb spoke out against the online bullying directed at Mississippi State's Chandler Prater, defending her by stating that JuJu Watkins' ACL injury was not caused by a dirty play."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "USC coach Lindsay Gottlieb defended Mississippi State's Chandler Prater against online bullying, stating that the ACL injury of JuJu Watkins was not the result of a dirty play."
  },
  {
    "title": "Giannis on LeBron's praise: Unfair to compare eras",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Giannis Antetokounmpo responded to LeBron James' suggestion that he could have scored 250 points in a 1970s game by stating it's not possible to compare different basketball eras."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Giannis Antetokounmpo disagreed with LeBron James' claim that he could score 250 points in a 1970s basketball game, emphasizing the impossibility of comparing players across different eras."
  },
  {
    "title": "Liu ends U.S. drought, wins figure skating worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alysa Liu became the first American woman to win the world figure skating championship since 2006, defeating three-time defending champion Kaori Sakamoto."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alysa Liu won the world figure skating championship, becoming the first American woman to achieve this feat since 2006. She defeated the three-time defending champion, Kaori Sakamoto."
  },
  {
    "title": "UCLA lands MWC Player of Year Dent from portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 03:25:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists for New Mexico this season, has committed to UCLA following his entry into the transfer portal."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Donovan Dent, a guard who averaged 20.4 points and 6.5 assists per game this season with New Mexico, has decided to transfer to UCLA."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:41:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have taken place. This phase of the tournament is crucial as teams compete for a spot in the Elite Eight, moving one step closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has reached the Sweet 16 stage, with the first four games completed. Teams are now competing for a place in the Elite Eight, advancing towards the championship."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 02:00:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston secured victories in their respective games. The event featured detailed analysis of both teams' performances, offering insights into how each team achieved their win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston both won their respective games. Post-game analysis provided insights into the strategies and performance of each team, explaining the factors behind their victories."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State has been eliminated from their current season. The focus now shifts to the team's future, including priorities for player transfers and the introduction of new recruits. The Wolfpack is looking ahead to next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's season has ended, leading the team to concentrate on future strategies. This includes seeking player transfers and welcoming new recruits as they prepare for the next season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:07:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in a span of four days. This rapid conversion showcases the flexibility and adaptability of the facility to accommodate major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly transformed into the Tampa Bay Rays' ballpark for Opening Day within four days, demonstrating the venue's capability to host major league games with flexibility and efficiency."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In discussions about the current state of play, players, executives, and analysts are debating whether there has been a shift towards cleaner gameplay or if referees have become less inclined to call fouls."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In the sports community, there is an ongoing debate about changes in the game's dynamics. Participants, including players, executives, and analysts, are discussing whether there has been a move towards cleaner gameplay or if referees are now less likely to call fouls."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 14:49:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, accompanied by the schedule of each team through April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff lineup is becoming more defined following a panel's voting process, with the team schedules now set until April 17."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The snowboarder, who has faced challenges with depression, is now aiming to qualify for the 2026 Olympics. She will be competing in the World Championships on Saturday, having rediscovered her passion for the sport."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, previously struggling with depression, is now targeting qualification for the 2026 Olympics. She is set to compete in the World Championships this Saturday, having reignited her love for snowboarding."
  },
  {
    "title": "Robinson's rise has Fulham dreaming of Europe and the U.S. a World Cup",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 09:27:34 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonee Robinson of Fulham has had an exceptional season, establishing himself as one of the top left backs globally. He aspires to achieve significant accomplishments with the U.S. national team."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antonee Robinson, a Fulham player, has had an outstanding season, earning recognition as one of the world's leading left backs. He aims to reach major achievements with the U.S. national team."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Every team in the UFL is striving to outperform Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Helen Hu's unexpected path back to NCAA gymnastics",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 15:57:16 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A year ago, Helen Hu, a former gymnast, was working at a hostel in Ecuador. Recently, she achieved a significant milestone by winning the SEC beam title in gymnastics."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Helen Hu, once a hostel worker in Ecuador and a former gymnast, has won the SEC beam title in gymnastics, marking a significant achievement in her athletic career."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 07:39:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that they have dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday, as announced on Friday."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 07:39:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving over $20 million from a jury award."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Osasuna appeal, say Barça player was ineligible",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 07:39:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Osasuna appealed to the Spanish football federation (RFEF) asserting that Barcelona improperly played defender Iñigo Martínez in a LaLiga match, due to a technicality linked to his absence from Spain's games because of an injury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Osasuna has filed an appeal with the Spanish football federation (RFEF), claiming Barcelona fielded defender Iñigo Martínez in a LaLiga match in violation of regulations, citing a technicality related to his non-participation in Spain's matches due to injury."
  },
  {
    "title": "USWNT's Davidson (knee) exits Gotham FC draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 07:39:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will undergo an evaluation for a left knee injury sustained during a 0-0 match against the Houston Dash on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Tierna Davidson, a defender for NJ/NY Gotham FC and the U.S. women's national team, will be evaluated for a left knee injury she suffered during a 0-0 match against the Houston Dash on Friday."
  },
  {
    "title": "James blasts FIFA 'injustice' over León CWC axing",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 07:39:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "León captain James Rodríguez and coach Eduardo Berizzo have requested FIFA to reconsider the decision to exclude the Mexican team from the Club World Cup."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "León captain James Rodríguez and coach Eduardo Berizzo have appealed to FIFA, asking the organization to reevaluate its decision to disqualify the Mexican team from participating in the Club World Cup."
  },
  {
    "title": "Bayern threaten to sue Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 06:34:39 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich is contemplating taking legal action against the Canadian soccer federation due to a significant knee injury sustained by player Alphonso Davies."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich is considering legal action against the Canadian soccer federation after Alphonso Davies, a player for the club, suffered a major knee injury."
  }
]