[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff shared insights on a variety of items they use, ranging from recent purchases to gadgets they've owned for years or even decades. This collection highlights diverse personal and office tools, kitchen gadgets, and smart tech, reflecting a wide range of interests and uses."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8540425689351852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4235106422337963,
    "summary": "The Verge staff discussed a range of items they utilize, from newly acquired gadgets to tools and smart technology they've had for years. This collection showcases a variety of personal, office, and kitchen devices, indicating diverse interests and applications."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the onset of warmer months. This sale, which runs until March 31, 2025, offers significant discounts on a variety of items including gardening supplies and bedding."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6742509019444445,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37856272548611114,
    "summary": "Amazon has initiated its Big Spring Sale, offering substantial discounts on numerous products such as gardening supplies and bedding. This sale is scheduled to last until March 31, 2025, aligning with the start of the spring season."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces the most advanced stealth and assassination mechanics in the franchise, offering a rewarding experience for players. The game emphasizes precision, making the role of a shinobi challenging yet fulfilling."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6230356239120369,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3657589059780092,
    "summary": "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, focusing on precision to provide a challenging and rewarding experience for players, emphasizing the role of a shinobi."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is positioned as a gaming-focused alternative to the MacBook Pro, featuring a return to a thinner and lighter chassis design. This change comes after the previous generation's design was considered bulkier. The laptop aims to blend gaming performance with a more conventional laptop appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5813689570023148,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35534223925057873,
    "summary": "The Razer Blade 16 is introduced as a gaming laptop alternative to the MacBook Pro, emphasizing a slimmer and lighter design compared to its bulkier predecessor. It seeks to combine gaming performance with a traditional laptop look."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various lighting needs. It features a rechargeable, compact design with three adjustable LED panels emitting 3000 lumens, ideal for illuminating campsites, workspaces, or engine blocks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.297433771550926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2843584428877315,
    "summary": "BougeRV has launched a new LED lantern designed for outdoor camping, which can also serve as a work lamp. It has a rechargeable and compact structure, with three LED panels that can be adjusted to emit up to 3000 lumens, making it suitable for lighting up campsites, work areas, or engine blocks."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The search for survivors is being hindered by a severe shortage of equipment, inconsistent communication networks, and damaged roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The search for survivors is facing challenges due to a lack of necessary equipment, unreliable communication networks, and roads that have been damaged."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with the BBC, describing it as \"incredible\" that bombs were being dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur criticized the military for dropping bombs during rescue operations in an interview with the BBC, describing the actions as \"incredible.\""
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, and rescuers are currently engaged in efforts to extract individuals trapped within the debris."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, leading to ongoing rescue operations to save people trapped in the rubble."
  },
  {
    "title": "Protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pro-democracy demonstrators rallied to support Ekrem Imamoglu, a detained opposition leader."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Pro-democracy demonstrators gathered to show support for Ekrem Imamoglu, an opposition leader who has been detained."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk, the capital of Greenland, journalist Andrew Harding reports that numerous residents of the Danish territory express feelings of being bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During a visit to Nuuk, Greenland's capital, journalist Andrew Harding found that many locals feel bullied by the United States, according to their expressions."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has resulted in 21 people being injured, with a restaurant and several other buildings catching fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city led to 21 people getting injured and caused a restaurant along with several other buildings to catch fire, local officials reported."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya has temporarily closed its doors following reports from customers who discovered an insect and a rat in their meals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a restaurant, has temporarily shut down after customers reported finding an insect and a rat in their food."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US's former envoy to Kabul has stated that Ms. Hall, who was previously under unspecified circumstances, is now with Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul announced that Ms. Hall, previously in an unspecified situation, is now with Qatari officials and is anticipated to return home shortly."
  },
  {
    "title": "US marine park investigated over animal-welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki has been criticized for wearing a disguise to promote his own book during a television appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise while promoting his book on TV."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase are not under Somalia's jurisdiction to be offered to another entity."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that Somalia does not have the authority to grant access to the Berbera port and airbase to any other party, as these facilities are not under Somalia's jurisdiction."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing individuals in Antigua have shared their experiences of distress with the BBC, highlighting the emotional impact of their loved ones' disappearances."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing persons in Antigua have expressed their emotional distress to the BBC, discussing the impact of their loved ones' disappearances."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence when the pardon was granted."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, previously sentenced to 20 years in prison, has been pardoned less than a year into his sentence due to health concerns."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to regulate diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation aimed at regulating diversity and inclusion initiatives as part of a wider effort."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. The initiative aims to replace these images with better ones."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to improve the quality of celebrity photos on a particular website by replacing poor-quality images with higher-quality ones."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The earthquake's severity and the extensive length of the fault line it occurred on were major factors in the resulting devastation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The earthquake caused significant destruction due to its high magnitude and the extensive length of the fault line where it happened."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A significant earthquake struck central Myanmar, resulting in widespread destruction across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A major earthquake hit central Myanmar, causing extensive damage throughout the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further rises, according to a car seller's statement to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices have risen significantly, with further increases anticipated, a car seller told the BBC."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions after being shot at while evacuating a military base in South Sudan."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their response during an evacuation of a military base in South Sudan, after coming under fire."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, some regions in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere in the world. However, certain areas in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers received applause for successfully carrying 30-year-old Phyu Lay Khaing to safety on a stretcher."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was successfully rescued and carried to safety on a stretcher, receiving applause from onlookers."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday due to a powerful earthquake originating from neighboring Myanmar. Dozens of people are still missing following the incident."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to a powerful earthquake from neighboring Myanmar, leaving dozens of people missing."
  },
  {
    "title": "Barcelona vs Girona – LaLiga preview: Team news, kickoff time, stream",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 22:38:44 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona aims to increase their lead in LaLiga to three points by playing against Girona at home."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Barcelona is set to play against Girona at home, aiming to extend their lead in LaLiga by three points."
  },
  {
    "title": "Protesters in Tel Aviv say government responsible for captives’ fate",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:01:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Demonstrators in Israel are protesting, urging the government to take action to ensure the release of individuals being held captive in Gaza."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Demonstrators in Israel are calling on the government to act to secure the release of people held captive in Gaza."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st in 'crazy' 20-9 win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit a total of nine home runs in a game against the Brewers, with four homers scored off pitcher Nestor Cortes in the first inning, leading to a 20-9 victory on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees secured a 20-9 win over the Brewers, hitting a total of nine home runs during the game. Four of these homers came in the first inning off pitcher Nestor Cortes, setting the pace for their victory on Saturday."
  },
  {
    "title": "TCU wins as Van Lith into Elite Eight for 5th time",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hailey Van Lith scored 26 points, leading TCU to a 71-62 victory over Notre Dame in the Sweet 16 of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith led TCU to a 71-62 win against Notre Dame in the Sweet 16 of the women's NCAA tournament, scoring 26 points."
  },
  {
    "title": "Auburn's Pearl not buying MSU as underdogs",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Auburn coach Bruce Pearl stated he will not consider Michigan State as underdogs in the NCAA tournament, citing the program's historical success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Auburn coach Bruce Pearl has said he does not view Michigan State as underdogs in the NCAA tournament, pointing to the program's history of success as the reason."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "USWNT player Trinity Rodman has stated that she believes her back issues will never fully heal, offering a candid evaluation of her health concerns."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Trinity Rodman, a player for the US Women's National Soccer Team (USWNT), has shared that she expects her back problems to persist indefinitely, providing a straightforward assessment of her ongoing health issues."
  },
  {
    "title": "Scherzer (lat) leaves Jays debut after 3 innings",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut as a Toronto Blue Jay, 40-year-old Max Scherzer, a pitcher with two World Series titles, exited the game after three innings due to right lat soreness. This occurred during the team's 9-5 defeat to the Baltimore Orioles. Scherzer had joined the Blue Jays in January."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Toronto Blue Jays, 40-year-old pitcher Max Scherzer, who has won two World Series titles, left the game after three innings because of right lat soreness. This happened during the Blue Jays' 9-5 loss to the Baltimore Orioles. Scherzer had signed with the Blue Jays in January."
  },
  {
    "title": "Sources: Kansas frosh Bidunga to enter portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kansas freshman Flory Bidunga plans to enter the transfer portal, according to sources reported by ESPN. He has communicated his intentions to the Kansas coaching staff."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Flory Bidunga, a freshman at Kansas, intends to enter the transfer portal, as reported by ESPN. He has informed the Kansas coaching staff of his decision."
  },
  {
    "title": "Sabalenka, 'best player in the world,' wins Miami",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aryna Sabalenka, the No. 1 seed from Belarus and a three-time Grand Slam champion, won the Miami Open by defeating Jessica Pegula 7-5, 6-2 on Saturday. This victory came in a rematch of the 2024 US Open final."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aryna Sabalenka from Belarus, ranked No. 1 and a three-time Grand Slam winner, secured the Miami Open title by beating Jessica Pegula with scores of 7-5, 6-2. This match was a follow-up to their encounter at the 2024 US Open final."
  },
  {
    "title": "No. 2 WNBA prospect Miles still deciding future",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:54:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Notre Dame basketball player Olivia Miles, anticipated to be the second pick in the WNBA draft, has stated she is considering entering the draft but has not made a final decision."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Notre Dame basketball player Olivia Miles, expected to be the second pick in the upcoming WNBA draft, is currently contemplating whether to enter the draft. She has not yet reached a final decision."
  },
  {
    "title": "Men's Elite Eight live tracker: Highlights, updates on Florida vs. Texas Tech",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:59:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Saturday night featured college basketball games including Florida vs. Texas Tech and Duke vs. Alabama. Fans were encouraged to follow the action as these teams competed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Saturday night, college basketball games took place with Florida facing Texas Tech and Duke playing against Alabama. Fans were invited to watch as these teams competed in the evening's matchups."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:13:44 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Friday night featured significant victories for Auburn and Houston, with detailed analysis available on their respective wins and additional insights on other games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston both secured significant victories in their games. Detailed analyses of these wins, along with insights on other matches from the same night, are available for those interested in more in-depth information."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:15:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, with the first four games being closely monitored. This phase of the tournament highlights the competition among the remaining teams vying for the championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has advanced to the Sweet 16 stage, with the first four games underway. This phase showcases the competition among the remaining teams competing for the championship title."
  },
  {
    "title": "What this historic day of home runs says about Aaron Judge, Yankees",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:59:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In a recent game, Judge hit three home runs, leading New York to set a new record in long ball history. This performance highlighted Judge's exceptional skill as a baseball player."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Judge hit three home runs in a recent game, leading New York to break a record in baseball's long ball history. This achievement underscores Judge's extraordinary talent as a player."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article provides an overview of the current sports landscape, detailing the implications of upcoming matchups, updated playoff projections, and draft lottery standings, among other information."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article offers an overview of the current sports scene, highlighting the impact of forthcoming games, playoff predictions, and draft lottery rankings."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on team rankings. These rankings, along with the schedule for each team up until April 17, have been published to provide insights into the playoff landscape."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A panel has voted on team rankings, clarifying the playoff field. These rankings and the teams' schedules up until April 17 have been released, offering insights into the upcoming playoff scenario."
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:41:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's UFC Fight Night predictions come from an MMA coach and a betting insider, who have shared their picks for the event."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This week's UFC Fight Night predictions were made public by an MMA coach and a betting insider, offering their choices for the upcoming event."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has ended, leading to a focus on future team development. The team is now concentrating on portal priorities and welcoming new recruits as they prepare for the next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's season has concluded, prompting a shift in focus towards building for the future. The team is prioritizing portal acquisitions and integrating new recruits in preparation for the upcoming season."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting information, including lines, spreads, totals, and Basketball Power Index (BPI) ratings, for all games in the Women's basketball tournament, has been released."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting details for all games in the Women's basketball tournament, such as lines, spreads, totals, and Basketball Power Index (BPI) ratings, are now available."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' Opening Day ballpark in just four days. This rapid conversion involved extensive preparations and adjustments to accommodate a major league game, showcasing the flexibility and capability of the facility to host such events."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Tampa Bay Rays' Opening Day game was held at the Yankees' spring training facility, which was transformed into a major league ballpark in just four days. This quick conversion demonstrates the facility's ability to adapt and host significant events."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze led Crystal Palace to a 3-0 victory over Fulham on Saturday, securing their spot in the FA Cup semifinals with a goal and an assist."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze played a key role in Crystal Palace's 3-0 win against Fulham on Saturday, scoring a goal and providing an assist. This victory secured Crystal Palace's place in the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving over $20 million from a jury award."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two second-half goals, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, the Bundesliga leaders secured the win at home."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to secure a 3-2 win for Bayern Munich against St Pauli on Saturday. The victory at home helped the Bundesliga leaders overcome the challenge posed by their opponents."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:31 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In a LaLiga match on Saturday, Espanyol and Atletico Madrid drew 1-1. Cesar Azpilicueta scored for Atletico Madrid in the first half, but Espanyol's captain, Javi Puado, equalized with a penalty. The result impacts Espanyol's fight against relegation and Atletico Madrid's position in third place."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In a LaLiga match, Espanyol and Atletico Madrid ended in a 1-1 draw. Cesar Azpilicueta scored for Atletico Madrid, while Espanyol's Javi Puado equalized with a penalty. This outcome affects Espanyol's relegation battle and keeps Atletico Madrid in third place."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle marked the end of a 70-year wait for a major domestic trophy by holding an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle celebrated winning a major domestic trophy for the first time in 70 years with an open-top bus parade through the city."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that head coach Dorival Júnior has been dismissed following a loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Brazilian Football Confederation (CBF) announced the dismissal of head coach Dorival Júnior on Friday, following Brazil's defeat to Argentina on Tuesday."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Investigators have discovered that mutations to VPS35, a crucial component in a pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapies. This finding could aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that mutations in VPS35, a key part of the pathway that employs reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy treatments. This discovery may help identify tumors that are resistant to therapy."
  }
]