[
  {
    "title": "Trump blames Zelensky for starting war after massive Russian attack",
    "domain": "general",
    "location": "global",
    "published": "Tue, 15 Apr 2025 14:59:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president apportioned blame to Ukraine's leader hours after the deadliest strike on civilians this year."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6dd4/live/59660af0-19da-11f0-8a1e-3ff815141b98.jpg",
    "summary": "The US president made a statement highlighting the impracticality of initiating conflict with a nation significantly larger in size, specifically mentioning the unrealistic expectation for support in the form of missiles from others under such circumstances.",
    "titles": [
      "Trump blames Zelensky for starting war after massive Russian attack"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.986,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.49250000000000005,
    "normalized_score": 10.0
  },
  {
    "title": "Israel has killed at least 71 civilians in Lebanon since ceasefire, UN says",
    "domain": "general",
    "location": "global",
    "published": "Tue, 15 Apr 2025 14:51:01 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Death toll announced as Israel launches new attack in southern Lebanon, killing one person and injuring three."
    ],
    "image_url": "",
    "summary": "Israel launched an attack in southern Lebanon, resulting in one fatality and three injuries. This marks a new escalation in the conflict between Israel and Lebanon.",
    "titles": [
      "Israel has killed at least 71 civilians in Lebanon since ceasefire, UN says"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.492,
    "normalized_score": 9.98
  },
  {
    "title": "Who is Gout Gout, Australia’s record-breaking teenage sprint sensation?",
    "domain": "general",
    "location": "global",
    "published": "Tue, 15 Apr 2025 12:00:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Al Jazeera&#039;s lowdown on the 17-year-old sprinter of South Sudanese heritage who is drawing comparisons with Usain Bolt."
    ],
    "image_url": "",
    "summary": "A 17-year-old sprinter of South Sudanese heritage has been highlighted by Al Jazeera for drawing comparisons to Usain Bolt. The coverage suggests significant attention on the young athlete's potential in the sport.",
    "titles": [
      "Who is Gout Gout, Australia’s record-breaking teenage sprint sensation?"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.476,
    "normalized_score": 9.27
  },
  {
    "title": "Trump-China trade war: Which US companies could be worst hit",
    "domain": "general",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:37:15 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tech companies, fashion firms and agribusinesses face body blows from Trump&#039;s eye-watering tariffs on China."
    ],
    "image_url": "",
    "summary": "Tech companies, fashion firms, and agribusinesses are significantly impacted by President Trump's substantial tariffs on China. These measures have resulted in financial challenges for industries reliant on Chinese imports, affecting their operations and profitability.",
    "titles": [
      "Trump-China trade war: Which US companies could be worst hit"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.994,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47050000000000003,
    "normalized_score": 9.03
  },
  {
    "title": "After freezing $2 bn in funds for Harvard, Trump takes aim at university's tax break",
    "domain": "general",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:33:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Universities, as well as many charities and religious groups, are exempted from paying federal income taxes."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a8b2/live/53340650-1a11-11f0-b1b3-7358f8d35a35.jpg",
    "summary": "Universities, along with various charities and religious organizations, are not required to pay federal income taxes due to exemptions granted to them. This policy allows these institutions to operate without the financial burden of federal tax obligations.",
    "titles": [
      "After freezing $2 bn in funds for Harvard, Trump takes aim at university's tax break"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.01
  },
  {
    "title": "Former New York Giants TE Don Hasselbeck dead at age 70",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 15 Apr 2025 15:48:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New York Giants TE Don Hasselbeck, father of ex-Giants QB Tim Hasselbeck, has passed away at the age of 70."
    ],
    "image_url": "",
    "summary": "Former New York Giants tight end Don Hasselbeck, who is also the father of former Giants quarterback Tim Hasselbeck, has died at the age of 70.",
    "titles": [
      "Former New York Giants TE Don Hasselbeck dead at age 70"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3792500000000001,
    "normalized_score": 4.98
  },
  {
    "title": "Canadiens: Lane Hutson Beats Chris Chelios’ Record",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 15 Apr 2025 15:31:08 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "With only one game left in Lane Hutson’s historical rookie season, the Montreal Canadiens blueliner still leads all rookies in points, two ahead of San Jose Sharks’ Macklin Celebrini and five in front of Philadelphia Flyers’ Matvei Michkov. On Monday night against the Chicago Blackhawks, he finally beat Chris Chelios’s record and became the highest-scoring rookie defenseman in franchise history."
    ],
    "image_url": "",
    "summary": "Lane Hutson, a rookie defenseman for the Montreal Canadiens, has become the highest-scoring rookie defenseman in the franchise's history, surpassing Chris Chelios's record. Heading into the final game of his rookie season, Hutson leads all NHL rookies in points, holding a two-point lead over Macklin Celebrini of the San Jose Sharks and a five-point advantage over Matvei Michkov of the Philadelphia Flyers. This achievement was secured during a Monday night game against the Chicago Blackhawks.",
    "titles": [
      "Canadiens: Lane Hutson Beats Chris Chelios’ Record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3782500000000001,
    "normalized_score": 4.94
  },
  {
    "title": "Why Luis Robert Jr. could be MLB trade deadline's most sought-after slugger",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 15 Apr 2025 10:48:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "He had a disastrous 2024, but if Robert can play to his potential, the phones in Chicago will be ringing off the hook."
    ],
    "image_url": "",
    "summary": "Robert experienced a challenging year in 2024, impacting his performance. However, there is optimism that if he can perform at his expected level, there will be significant interest in him from others, specifically leading to increased activity on Chicago's phones, indicating potential discussions or negotiations.",
    "titles": [
      "Why Luis Robert Jr. could be MLB trade deadline's most sought-after slugger"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.928,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3620000000000001,
    "normalized_score": 4.22
  },
  {
    "title": "Jalen Ramsey wants out of Miami and the Saints are a logical destination",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 15 Apr 2025 15:34:18 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jalen Ramsey is working on a trade from the Dolphins. Landing in New Orleans with his old coach Brandon Staley would be a win for him and the Saints."
    ],
    "image_url": "",
    "summary": "Jalen Ramsey is actively seeking a trade from the Miami Dolphins, aiming to join the New Orleans Saints. This move would reunite him with his former coach, Brandon Staley, and is viewed as beneficial for both Ramsey and the Saints.",
    "titles": [
      "Jalen Ramsey wants out of Miami and the Saints are a logical destination"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 3.89
  },
  {
    "title": "Columbus Blue Jackets Lines, Defensive Pairings, & Scratches For Tonight's Game vs. Philadelphia Flyers",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 15 Apr 2025 15:32:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Columbus Blue Jackets and the Philadelphia Flyers play the final game of their season series on Sunday. The Jackets are 1-1-1 against the Flyers this season."
    ],
    "image_url": "",
    "summary": "The Columbus Blue Jackets and the Philadelphia Flyers are set to play their season series finale on Sunday. So far in their matchups this season, the Blue Jackets have a record of 1 win, 1 loss, and 1 overtime loss against the Flyers.",
    "titles": [
      "Columbus Blue Jackets Lines, Defensive Pairings, & Scratches For Tonight's Game vs. Philadelphia Flyers"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35425000000000006,
    "normalized_score": 3.88
  },
  {
    "title": "Watch These Apple Price Levels After Gains on Tech Tariff Exemptions",
    "domain": "business",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:14:15 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/uRl-rIbkn2ZpBA01HE-ATeYdqvQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/AAPLChart-5a0a921c15604abcbcba9d9b51ef82d1.gif\" title=\"This image depicts the AAPL chart.\" /><figcaption><i>Source: TradingView.com</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Apple shares wavered between gains and losses in early trading Tuesday after posting gains Monday on the Trump administration’s decision to temporarily exempt many electronic goods from import tariffs.</li><li>The stock has possibly completed an Elliott Wave pattern with five distinct price swings after which sentiment typically shifts.</li><li>Investors should watch crucial support levels on Apple's chart around $183 and $169, while also monitoring resistance levels near $220 and $247.</li></ul><br /><br /><p>Apple (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;aapl\">AAPL</a>) shares wavered between gains and losses in early trading Tuesday after posting gains Monday on the Trump administration’s decision to <a href=\"https://www.investopedia.com/apple-dell-and-other-tech-stocks-climb-on-tariff-exemptions-11714493\">temporarily exempt many electronic goods from import tariffs</a>.</p><p>Apple, which assembles a majority of its devices in China, has seen its stock come under considerable pressure in recent weeks amid an intensifying trade war between Washington and Beijing that has resulted in <a href=\"https://www.investopedia.com/china-raises-us-tariffs-to-125-percent-in-latest-escalation-of-trade-war-11713392\">escalating tit-for-tat tariffs</a>, prompting concerns that increasing manufacturing costs could weigh on consumer demand.</p><p>The iPhone maker’s shares rebounded 5% last week but have lost about a fifth of their value since the start of the year. By comparison, the <a href=\"https://www.investopedia.com/terms/s/sp500.asp\">S&amp;P 500</a> jumped 6% last week and is down about 8% for the year so far.</p><p>Below, we break down the <a href=\"https://www.investopedia.com/technical-analysis-4689657\">technicals</a> on Apple’s chart and point out crucial price levels worth watching.</p><h2>Possible Elliot Wave Completion</h2><p>After setting their <a href=\"https://www.investopedia.com/terms/r/record_high.asp\">record high</a> in late December, Apple shares have trended lower, possibly completing an <a href=\"https://www.investopedia.com/terms/e/elliottwavetheory.asp\">Elliott Wave</a> pattern, with five distinct price swings after which sentiment typically shifts.</p><p>The stock appeared to gain momentum in recent trading sessions following last Wednesday’s <a href=\"https://www.investopedia.com/apple-stock-leads-big-tech-rebound-tariff-sell-off-11712003\">record-breaking relief rally</a> that saw the stock log its largest one-day gain in nearly three decades.<span class=\"ql-inline-citation\"></span></p><p>The shares have recorded above-average <a href=\"https://www.investopedia.com/terms/v/volume.asp\">volume</a> since President Trump announced sweeping tariffs earlier this month, signaling increased trading activity as market participants position for further news-driven price swings.</p><p>Let’s identify crucial <a href=\"https://www.investopedia.com/trading/support-and-resistance-basics/\">support and resistance</a> levels on Apple’s chart that could grab investors’ attention.</p><h2>Support Levels To Watch</h2><p>A loss of momentum in the stock could see the shares initially fall to around $183. This area on the chart may provide support near a <a href=\"https://www.investopedia.com/terms/h/horizontal-line.asp\">horizontal line</a> that connects a range of <a href=\"https://www.investopedia.com/terms/p/price-action.asp\">price action</a> stretching back to January last year.</p><p>Selling below this level opens the door for a retest of lower support at $169. Investors may look to scoop up shares in this region near last week’s low, which also closely aligns with a period of <a href=\"https://www.investopedia.com/terms/s/sidewaysmarket.asp\">sideways drift</a> on the chart throughout March and April last year.</p><h2>Resistance Levels To Monitor</h2><p>Further buying this week could see the shares touch overhead resistance around $220. Tactical traders who have <a href=\"https://www.investopedia.com/terms/a/accumulating-shares.asp#:~:text&#61;Accumulating%20shares%20is%20a%20compensation,to%20the%20time%20of%20sale.\">accumulated shares</a> at lower levels may decide to <a href=\"https://www.investopedia.com/terms/l/lock_in_profits.asp\">lock in profits</a> in this region near a trendline that links last June’s prominent <a href=\"https://www.investopedia.com/trading/peak-and-trough-analysis/\">peak</a> with several troughs spanning from July to January.</p><p>Finally, a <a href=\"https://www.investopedia.com/articles/trading/08/trading-breakouts.asp\">breakout</a> above this area could trigger a move to the $247 level. Apple shares may attract overhead selling pressure in this location near the notable late February <a href=\"https://www.investopedia.com/terms/s/swinghigh.asp\">swing high</a> and an array of price points positioned just beneath the stock’s record high.</p><p><em>The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our <a href=\"https://www.investopedia.com/legal-4768893#toc-warranty-and-liability-disclaimer\">warranty and liability disclaimer</a> for more info.</em></p><p><em>As of the date this article was written, the author does not own any of the above securities.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/uRl-rIbkn2ZpBA01HE-ATeYdqvQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/AAPLChart-5a0a921c15604abcbcba9d9b51ef82d1.gif",
    "summary": "Apple shares experienced fluctuation in early trading on Tuesday after an initial gain on Monday, following the Trump administration's decision to exempt many electronic goods from import tariffs. The stock's movement is attributed to the ongoing trade war between the U.S. and China, which has pressured Apple's stock due to increased manufacturing costs. Apple's stock has possibly completed an Elliott Wave pattern, indicating a potential shift in sentiment. Investors are advised to watch for key support levels at $183 and $169, and resistance levels at $220 and $247, to gauge future movements.",
    "titles": [
      "Watch These Apple Price Levels After Gains on Tech Tariff Exemptions"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.989,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46924999999999994,
    "normalized_score": 8.97
  },
  {
    "title": "Experts Warn Weakening Dollar Signals 'Crisis of Confidence' in Backbone of Global Markets",
    "domain": "business",
    "location": "global",
    "published": "Tue, 15 Apr 2025 10:00:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Andrew Harrer / Bloomberg / Getty Images\" src=\"https://www.investopedia.com/thmb/wE0_H629ZEcfHmUhlYPswGam3fo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-167323643-e56a522b607d4929968c5483222ae811.jpg\" title=\"Shredded currency surrounds a U.S. one dollar bill.\" /><figcaption><i><p>Andrew Harrer / Bloomberg / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The U.S. Dollar Index is on track to have its worst two-month stretch since 2002. </li><li>Former Treasury Secretary Janet Yellen warned on Monday the simultaneous sell-off of dollars and Treasury bonds could signal crumbling faith in the stability of U.S. assets that have long been the backbone of global finance. </li><li>MUFG analysts in a note on Monday expressed skepticism that the Trump administration would take any steps in the near term to shore up confidence in the dollar. </li></ul><br /><br /><p>The U.S. dollar is on track to have its worst month in years, a development that has alarmed some experts worried about crumbling faith in U.S. financial stability.</p><p>The <a href=\"https://www.investopedia.com/terms/u/usdx.asp\">U.S. Dollar Index</a> has declined more than 4.3% since the start of the month. If the index held steady for the remainder of April, it would be the U.S. dollar’s worst month since November 2022 and its ninth-worst since 2000. With March’s 3.2% decline, the dollar is on track to have its worst two-month stretch since 2002. </p><h2>Are Investors Shunning Dollar-Based Assets?</h2><p>The dollar’s decline has puzzled market watchers, including former Treasury Secretary Janet Yellen, who called the recent moves in <a href=\"https://www.investopedia.com/articles/forex-currencies/092316/how-us-dollar-became-worlds-reserve-currency.asp\">the world's reserve currency</a> part of “a very unusual pattern” during an interview with <em>CNBC</em> on Monday. </p><p>Yellen explained that investors tend to gravitate to <a href=\"https://www.investopedia.com/terms/s/safe-haven.asp\">safe havens</a> like U.S. Treasury securities during times of market uncertainty. Increased demand for Treasurys, she said, usually boosts the dollar since Treasury bonds can only be traded in dollars. But recently Treasury yields have skyrocketed and the dollar has declined. </p><p>“And what that suggests is that investors are beginning to shun dollar-based assets, and [are] calling into question the safety of what is the bedrock of the global financial system, namely U.S. Treasurys,” said Yellen.<span class=\"ql-inline-citation\"></span> </p><h2>Why Are Treasurys and the Dollar Falling?</h2><p>Experts <a href=\"https://www.investopedia.com/three-major-questions-facing-the-beautiful-bond-market-11712580\">have several theories</a> about why investors aren’t flocking to Treasurys amid all the market turmoil. Some have speculated it’s because tariffs threaten to fuel U.S. inflation, which would force the Federal Reserve to keep interest rates elevated. Another possible reason is reduced demand from international investors and other countries spooked by the Trump administration’s unpredictability and hostility to the global order. </p><p>Some have speculated that China, one of the largest <a href=\"https://www.investopedia.com/articles/markets-economy/090616/5-countries-own-most-us-debt.asp\">foreign owners of Treasury debt</a>, is dumping its bonds to retaliate against Trump. There’s very little data available to support that theory, according to a research note from MUFG published Monday. Though they note China has reduced its Treasury holdings by about 25% since the end of 2021, “possibly anticipating what lies ahead.”<span class=\"ql-inline-citation\"></span> China has also been a major advocate for global <a href=\"https://www.investopedia.com/what-is-de-dollarization-7559514\">de-dollarization</a>.</p><p>Yellen on Monday said China dumping Treasurys and dollars would create “risks to the Treasury market and to global financial stability that would harm them and would represent a very significant escalation. So, it’s not something that I would expect China to do.”</p><h2>Can Trump Restore Faith in the Dollar?</h2><p>Analysts are concerned Trump’s <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">on-again, off-again approach</a> to tariffs has eroded confidence in U.S. assets. MUFG analysts cited a disconnect between the U.S. dollar’s value and rate spreads for their assessment that Trump’s tariffs have created “a crisis of confidence” in the dollar. Yellen said the \"loss of confidence in U.S. economic policy and the safety of bedrock financial assets is really very worrisome.\"</p><p>Restoring faith in the stability of the dollar and Treasurys may be difficult. Equity markets <a href=\"https://www.investopedia.com/dow-jones-today-04142025-11714514\">were buoyed</a> on Monday by <a href=\"https://www.investopedia.com/trump-exempts-smartphones-computers-chips-from-tariffs-11714237\">Trump’s announcement</a> over the weekend that semiconductors and many consumer electronics wouldn’t be subject to so-called reciprocal tariffs. But to the analysts at MUFG, “the reprieve is just another example of the elevated level of policy uncertainty that will continue to undermine confidence in US assets.”<span class=\"ql-inline-citation\"></span></p><p>Rebuilding trust would require Trump and China to backtrack on their recent tariff increases, and Congress to develop a plan to narrow the deficit, MUFG analysts said. Neither is likely in their view. </p><p>“In the near-term it is difficult to see any fundamental factor that will likely improve investor sentiment,” the analysts wrote. “And rhetoric from Trump and (Commerce Secretary) Lutnick, despite the reprieve, does not point to any reason for optimism on a more fundamental shift in policy that would prompt a dollar recovery.”</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/wE0_H629ZEcfHmUhlYPswGam3fo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-167323643-e56a522b607d4929968c5483222ae811.jpg",
    "summary": "The U.S. Dollar Index is experiencing its worst two-month decline since 2002, raising concerns about the stability of U.S. financial assets. Former Treasury Secretary Janet Yellen and analysts from MUFG have expressed worries over the declining confidence in the dollar and U.S. Treasurys, attributing it to factors such as potential retaliation from China, the impact of tariffs, and policy unpredictability under the Trump administration. Despite a recent reprieve in tariffs on certain consumer electronics, analysts remain skeptical about any near-term improvement in investor sentiment towards U",
    "titles": [
      "Experts Warn Weakening Dollar Signals 'Crisis of Confidence' in Backbone of Global Markets"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.916,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.469,
    "normalized_score": 8.96
  },
  {
    "title": "The Economy Is on Solid Footing Despite Tariff Turmoil, Bank of America CEO Says",
    "domain": "business",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:57:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"John Lamparski / Getty Images Chairman and CEO of Bank of America, Brian Moynihan\" src=\"https://www.investopedia.com/thmb/lq2xGI3hzg0eqKbYT0Iswd3nGJM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207234662-70477dddb27b46cc9c7b8707c179ddd8.jpg\" title=\"Chairman and CEO of Bank of America Brian Moynihan visits Fox Business' \" /><figcaption><i><p>John Lamparski / Getty Images</p> Chairman and CEO of Bank of America, Brian Moynihan</i></figcaption></figure><p>Risks are mounting, but the economy is still in a good place, according to Bank of America CEO Brian Moynihan. </p><p>Moynihan on the company's first-quarter earnings call Tuesday morning said the bank's research team \"does not currently believe we’ll see a recession in 2025,” though it has lowered its growth rate estimates for US gross domestic product. The bank doesn't expect the Fed to cut rates this year, he said.</p><p>Bank of America (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BAC\">BAC</a>) <a href=\"https://www.investopedia.com/bank-of-america-q1-fy2025-earnings-11714904\">topped first-quarter earnings estimates</a> on Tuesday. Other big banks have also reported better-than-expected results for the quarter when market volatility fueled big gains in trading revenue for many. </p><p>Moynihan joined other big bank executives in <a href=\"https://www.investopedia.com/here-is-what-big-bank-ceos-are-saying-about-tariffs-and-the-economy-11713438\">expressing some concern</a> about economic uncertainty. He noted that the odds of a recession had increased recently, but added it would be “a very slight recession, and we should fare well on that.” </p><p>Moynihan pointed to healthy consumer spending and business data as reasons for optimism. Consumer spending, he said, continued to grow at a strong clip in the first quarter <a href=\"https://www.investopedia.com/will-consumer-fears-show-up-in-the-march-retail-sales-report-11714988\">despite concerns</a> that tariffs will force Americans to rein in their spending. Certain retailers may be seeing slower sales, he said, “but in the aggregate, the consumer keeps pushing money into the economy.” </p><p>BofA’s business clients also ended the quarter on stable footing, according to Moynihan. “As we look at our business side and what our business clients are telling [us], in the current setting they remain profitable, liquid and have strong results,” he said.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/lq2xGI3hzg0eqKbYT0Iswd3nGJM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207234662-70477dddb27b46cc9c7b8707c179ddd8.jpg",
    "summary": "Bank of America CEO Brian Moynihan stated the economy remains strong despite increasing risks, during the company's first-quarter earnings call. He mentioned that while the bank's research team has lowered its growth rate estimates for the US GDP, they do not foresee a recession in 2025. Bank of America exceeded first-quarter earnings expectations, in line with other major banks benefiting from market volatility. Moynihan acknowledged a slight chance of recession but remains optimistic due to healthy consumer spending and the stable condition of business clients. The Federal Reserve's rates ar",
    "titles": [
      "The Economy Is on Solid Footing Despite Tariff Turmoil, Bank of America CEO Says"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.999,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46575,
    "normalized_score": 8.82
  },
  {
    "title": "Luxury waits for the US kitten-heeled mule to drop",
    "domain": "business",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:32:13 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "LVMH’s reported figures don’t yet reflect much of a softening in the American market"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F297bf2ea-52c3-442c-a5eb-f8b5bf3ea729.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "LVMH's recently reported financial figures indicate that the company has not experienced significant softening in the American market. This suggests that consumer demand for LVMH products in the U.S. remains strong, despite broader economic concerns.",
    "titles": [
      "Luxury waits for the US kitten-heeled mule to drop"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46425000000000005,
    "normalized_score": 8.75
  },
  {
    "title": "American Airlines to Launch Free Wi-Fi for Rewards Members in 2026",
    "domain": "business",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:06:39 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Kevin Carter / Getty Images\" src=\"https://www.investopedia.com/thmb/F90tY8F85mlbTQpvj_i7qVMHAgY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207486707-1b2497ff0ad440a2af69152804872600.jpg\" title=\"Several American Airlines planes are seen at an airport.\" /><figcaption><i><p>Kevin Carter / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>American Airlines on Tuesday announced that it will launch free Wi-Fi for its rewards members in January 2026.</li><li>The company is partnering with AT&amp;T, and said the service will be available on about 90% of its fleet by the rollout.</li><li>Delta already has free Wi-Fi on most domestic flights for loyalty members and United is in the process of rolling out free Starlink satellite internet.</li></ul><br /><br /><p>American Airlines (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AAL\">AAL</a>) said Tuesday that it will introduce free Wi-Fi on flights for its \"AAdvantage\" rewards members starting in January 2026.<span class=\"ql-inline-citation\"></span></p><p>The airline is partnering with AT&amp;T (<a href=\"https://www.tradingview.com/symbols/NYSE-T/\" rel=\"nofollow\">T</a>) to introduce the service, which it says will be available \"on all aircraft equipped with Viasat and Intelsat high-speed satellite connectivity, accounting for roughly 90% of its fleet.\" American said it recently conducted a test on select flight routes, which surpassed its own expectations.</p><p>Chief Customer Officer Heather Garboden said the company has been \"working diligently to outfit our aircraft\" with the necessary technology.</p><h2>Delta Already Has Free Wi-Fi; United Rolling Out Free Starlink Satellite Internet</h2><p>Last month, rival United Airlines (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;UAL\">UAL</a>)—which is set to report its latest quarterly earnings after the bell Tuesday—<a href=\"https://www.investopedia.com/united-to-launch-first-flight-with-free-starlink-wifi-in-may-11706054\">won government approval</a> to launch its first commercial flight with free Starlink satellite internet service in May.<span class=\"ql-inline-citation\"></span> United had <a href=\"https://www.investopedia.com/united-airlines-bringing-free-starlink-wi-fi-to-all-flights-8712029\">signed a deal</a> with Starlink, a division of <a href=\"https://www.investopedia.com/articles/personal-finance/061015/how-elon-musk-became-elon-musk.asp\">Elon Musk's</a> SpaceX, last September to bring satellite internet to its more than 1,000 planes over the next several years.</p><p>Delta Air Lines (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;DAL\">DAL</a>), which already has free Wi-Fi on most domestic flights for loyalty members, announced earlier this month that it would be expanding its service to Europe, Israel and West Africa through its partnership with T-Mobile (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TMUS\">TMUS</a>).<span class=\"ql-inline-citation\"></span></p><p>American Airlines shares were up 3% in Tuesday morning trading but are <a href=\"https://www.investopedia.com/american-airlines-stock-sinks-on-weak-outlook-8778966\">still down</a> nearly 40% year-to-date.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/F90tY8F85mlbTQpvj_i7qVMHAgY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207486707-1b2497ff0ad440a2af69152804872600.jpg",
    "summary": "American Airlines announced it will offer free Wi-Fi to its AAdvantage rewards members starting January 2026, in partnership with AT&T. This service, utilizing Viasat and Intelsat technology, will cover approximately 90% of its fleet. The decision follows similar moves by competitors, with Delta providing free Wi-Fi for loyalty members on most domestic flights and United Airlines rolling out free Starlink satellite internet. The announcement coincided with a 3% increase in American Airlines' stock, despite a nearly 40% decline year-to-date.",
    "titles": [
      "American Airlines to Launch Free Wi-Fi for Rewards Members in 2026"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.987,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46275,
    "normalized_score": 8.68
  },
  {
    "title": "People are really bad at spotting AI-generated deepfake voices",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:00:00 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tests show that when people hear recordings of real voices and AI-created ones, they mostly fail to spot the fakes – raising concerns about scams involving counterfeit voices"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15110600/SEI_247528962.jpg",
    "summary": "Recent tests have revealed that most individuals are unable to distinguish between real and AI-generated voices in recordings. This difficulty in identifying fake voices has raised concerns about the potential for scams exploiting this technology.",
    "titles": [
      "People are really bad at spotting AI-generated deepfake voices"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45899999999999996,
    "normalized_score": 8.52
  },
  {
    "title": "A timeline of the most important events in quantum mechanics",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 15:00:00 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Explore the key moments in the history of quantum theory, from the early ideas of Albert Einstein and Werner Heisenberg to the discovery of phenomena like superposition and entanglement – and today’s quantum computers"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15134715/a-timeline-of-the-most-important-events-in-quantum-mechanics-scaled.jpg",
    "summary": "The history of quantum theory spans from early 20th-century ideas by Albert Einstein and Werner Heisenberg to groundbreaking discoveries such as superposition and entanglement. This progression has led to the development of today's quantum computers, marking significant advancements in understanding and applying quantum mechanics.",
    "titles": [
      "A timeline of the most important events in quantum mechanics"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45299999999999996,
    "normalized_score": 8.25
  },
  {
    "title": "Drones and sensors could help predict ocean current shutdown",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 11:00:13 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A massive research project will investigate the role of icebergs in driving melting of the Greenland ice sheet, a process that could trigger a catastrophic collapse of the Atlantic meridional overturning circulation"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/14151127/SEI_247547434.jpg",
    "summary": "A large-scale research project has been initiated to study how icebergs contribute to the melting of the Greenland ice sheet. This process poses a risk of causing a catastrophic collapse of the Atlantic meridional overturning circulation, which is crucial for regulating climate. The outcome of this study aims to enhance understanding of the mechanisms behind ice sheet melting and its global implications.",
    "titles": [
      "Drones and sensors could help predict ocean current shutdown"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.916,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43900000000000006,
    "normalized_score": 7.63
  },
  {
    "title": "Southern shrews shrink in winter",
    "domain": "science",
    "location": "global",
    "published": "Tue, 15 Apr 2025 00:12:38 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newly published research shows that the masked shrew, a small, mole-like mammal found in the Appalachian Mountains, shrinks its body and braincase to conserve energy during winter months."
    ],
    "image_url": "",
    "summary": "Recent research reveals that the masked shrew, a small mammal native to the Appalachian Mountains, undergoes a reduction in body and braincase size during winter to save energy. This adaptation helps it survive the colder months.",
    "titles": [
      "Southern shrews shrink in winter"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.78,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.405,
    "normalized_score": 6.12
  },
  {
    "title": "Emotions and levels of threat affect communities' resilience during extreme events",
    "domain": "science",
    "location": "global",
    "published": "Mon, 14 Apr 2025 20:35:49 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers use mathematical modeling to probe whether cohesive communities are more resilient to extreme events, finding that emotional intensity and levels of stress play a big role."
    ],
    "image_url": "",
    "summary": "Researchers employing mathematical modeling have discovered that cohesive communities exhibit greater resilience to extreme events. Their findings highlight the significant roles that emotional intensity and stress levels play in determining a community's ability to withstand such challenges.",
    "titles": [
      "Emotions and levels of threat affect communities' resilience during extreme events"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.73,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39249999999999996,
    "normalized_score": 5.57
  }
]