[
  {
    "title": "Charlie Kirk, Conservative Activist, Killed at Utah Event; Suspect in Custody",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:45:09 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "ABC News",
      "The Verge",
      "Deutsche Welle",
      "The Guardian",
      "Business Insider",
      "NPR",
      "CityNews",
      "Al Jazeera",
      "Fortune"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.businessinsider.com",
      "ottawa.citynews.ca",
      "abcnews.go.com",
      "fortune.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.theverge.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Utah officials say the suspected shooter was dressed in \"all dark clothing\" and fired from a long distance, potentially on a roof.",
      "Charlie Kirk, CEO and co-founder of the conservative youth organization Turning Point USA, was shot Wednesday at an outdoor rally at a Utah college.",
      "Conservative American activist Charlie Kirk was shot during a campus event at Utah Valley University.",
      "Suspect in &#039;political assassination&#039; still at large, authorities say.",
      "Charlie Kirk was fielding questions during a speaking engagement at a university when he was struck in the neck by a gunshot. Authorities say a suspect taken into custody has been released.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1ReTF0LXBBWFYycnJQeTBReEV6UzhrNEg1Q1pUUnlBM25XN2w0TjZFaExWMFJLWlkxWm05clV2a3BobVlyd0tEWXlrZk5RNUFxbUpjeERmbGs1SWdiNk1iQWJRVkdzeUlmRWhOem94d2hERjN2MnBJZjJobDdEdw?oc=5\" target=\"_blank\">Charlie Kirk dies after being shot at campus event in Uta",
      "BREAKING: Charlie Kirk has died after being shot at an event at Utah Valley University on Wednesday, President Trump has said.",
      "Conservative youth activist Charlie Kirk has been shot during an event at Utah Valley University, according to law enforcement sources.",
      "<p>Rightwing commentator killed while speaking at Utah Valley University, as Trump blames ‘radical left’ while suspect remains at large</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\">Ch",
      "Charlie Kirk, the cofounder and executive director of Turning Point USA, was shot and killed at an event at Utah Valley University on Wednesday.",
      "The co-founder and CEO of the youth organization Turning Point USA, the 31-year-old Kirk is the latest victim in a spasm of political violence across the United States.",
      "Charlie Kirk, the influencer and activist who co-founded right-wing group Turning Point USA, has died at the age of 31 after being shot while speaking at an event at Utah Valley University, according to his spokesperson Andrew Kolvet, speaking to the New York Times. Deseret News had earlier reported",
      "OREM, Utah (AP) —&#160;Charlie Kirk, a conservative activist&#160;and close ally of President Donald Trump who played an influential role in rallying young Republican voters, was shot and killed Wednesday at a Utah college event in what the governor called a political assassination carried out from "
    ],
    "image_url": "",
    "titles": [
      "Right-wing activist Charlie Kirk fatally shot at speaking event in Utah",
      "Right-wing activist and media personality Charlie Kirk has been shot and killed",
      "Trump: conservative activist Charlie Kirk dead after being shot",
      "Trump ally and activist Charlie Kirk shot dead at Utah university",
      "US: Conservative pundit Charlie Kirk shot dead in Utah",
      "Charlie Kirk dies after being shot at campus event in Utah - Axios",
      "WATCH:  Conservative activist Charlie Kirk has died, President Trump says",
      "WATCH:  Political activist Charlie Kirk shot at event in Utah, sources say",
      "Charlie Kirk, Trump ally and rightwing activist, shot and killed at Utah university",
      "Charlie Kirk, conservative activist and Trump ally, was shot dead at a Utah campus event",
      "Trump: Conservative activist Charlie Kirk has died after being shot at a Utah college event",
      "Charlie Kirk fatally shot at Turning Point USA event in Utah",
      "Conservative activist Charlie Kirk fatally shot at Utah university; shooter remains at large"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.787,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.832,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, co-founder of Turning Point USA and a prominent conservative activist, was shot and killed during a speaking event at Utah Valley University. The incident has heightened concerns about political violence in the United States. Authorities have reported that a suspect is now in custody in connection with the shooting. Kirk, 31, was known for his influential role in engaging young Americans in conservative politics and had played a significant part in political campaigns, including President Trump's return to the White House.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Conservative Activist Charlie Kirk Fatally Shot in Utah, Prompting Reactions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 04:30:20 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "The Verge",
      "New York Times",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Details of the attack in Utah are still unclear, but a large manhunt is under way for the shooter.",
      "Video of the incident shows Charlie Kirk speaking to a large outdoor crowd when a gunshot rings out.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9JYUxMVGVONlVpQzR3elIzZWpBeEZVclM0cl95WkNqMDh1TkdhMEptZzFmUENvMjVMenJMaEJialJLS1lEZWIxTVhJblBlYW1GclozV05kX29mTW8zZ2VzZXM3bHcwMEluWGg0WTZhbUUtSGwxN3NHSUF2UjViQQ?oc=5\" target=\"_blank\">Chaos erupts on House floor over Charlie Kirk shooting</a",
      "Horrifying videos of influencer and right-wing activist Charlie Kirk being fatally shot were widely available on social media platforms. We’ve reached out to some of the platforms to ask how they will be treating the videos and charged posts about the shooting. So far, we’re aware of responses from ",
      "The explosion of unrest in Nepal — with fires around the capital, Kathmandu, and the prime minister fleeing the country — was years in the making. Alex Travelli, a New York Times correspondent, describes what happened and why it happened now.",
      "The military imposed order after days of unrest led to the resignation of the country’s prime minister. Organizers want a former chief justice to lead Nepal’s interim government.",
      "Protesters set fire to government buildings and the homes of politicians as unrest over corruption, censorship and economic issues stretched into a second day."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b588/live/039c7bc0-8ee4-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "What we know so far",
      "Who was Charlie Kirk? What we know about the shooting and the suspect",
      "Chaos erupts on House floor over Charlie Kirk shooting - Axios",
      "How platforms are responding to the Charlie Kirk shooting",
      "What to Know About the Mass Protests in Nepal",
      "What to Know About the Protests in Nepal",
      "Troops Deployed After Day of Violent Protests in Nepal"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.905,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, a conservative activist and influencer, was fatally shot at an event in Utah, prompting reactions from President Donald Trump and lawmakers from various political affiliations. Videos of the incident have circulated on social media, leading to inquiries about how platforms will handle the content. The current status of platform responses remains partially unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland Reports 19 Airspace Breaches, Blames Belarus and Russia; NATO Responds",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-10T13:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "ABC News",
      "New York Times",
      "Deutsche Welle",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "abcnews.go.com",
      "news.google.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "NATO member Poland said it scrambled defenses in response to 19 airspace breaches. Polish Prime Minister Donald Tusk said many of the drones came from Belarus.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOUFd1dlpHZ1BCMWNTYU84TVNLOHFnM0I2NjcwN0JJQnExNmxONzJNZldXVnpjX0FmUHhRSHpFdGJWN3BRcTJQa29PMEVQbVpvemNIdWtoMU5Oa1dUY1QwU1JiUGZreXV3OFVIc3BrS3pGNk9UanZucWtVSnkwT0VSejdzMlY?oc=5\" target=\"_blank\">Poland, NATO leaders condemn Russian drones in P",
      "Military officials in Poland say the country's airspace was \"repeatedly violated by drone-type objects\" in the overnight hours amid Russian strikes on targets in Ukraine.",
      "<p>Donald Tusk says Poland dealing with a large-scale provocation after at least 19 violations of Polish airspace</p><p>Poland’s prime minister, Donald Tusk, said the country is closer to military conflict “than at any time since the second world war” as Warsaw and Nato allies weighed a response to ",
      "The military called the breach of Poland’s airspace “unprecedented,” and it triggered a request by Warsaw to consult with fellow NATO members.",
      "The incursion was the first time alliance planes had engaged enemy targets in NATO airspace. Poland’s leader called it “a large-scale provocation.”",
      "Poland accused Russia of violating its airspace 19 times overnight, during its bombardment of neighboring Ukraine. Moscow denies the drones are Russian.",
      "Article 4 allows member states to start a formal discussion within the alliance about threats to their security. It does not commit the alliance to military action."
    ],
    "image_url": "",
    "titles": [
      "Poland calls NATO meeting after downing Russian drones",
      "Poland, NATO leaders condemn Russian drones in Polish airspace - Axios",
      "WATCH:  NATO downs Russian drones over Poland",
      "Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to Russian drones",
      "NATO says it scrambled fighter jets, shot down Russian drones over Poland",
      "NATO Says It Scrambled Fighter Jets to Shoot Down Russian Drones Over Poland",
      "What to know as Poland invokes NATO Article 4, citing Russian drone violation",
      "Poland Has Invoked NATO’s Article 4. What Comes Next?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.675,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Poland reported 19 airspace breaches, attributing many to drones from Belarus, and accused Russia of involvement. This prompted Poland to scramble defenses and consult with NATO, marking the first time NATO planes engaged targets within its airspace. The incidents led to NATO deploying fighter jets to counter what was described as a deliberate provocation. Moscow denies the drones were Russian. The situation triggered discussions under NATO's Article 4 but does not automatically lead to military action.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk, Conservative Activist, Killed at Utah Event; Suspect in Custody",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:25:18 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "LA Times",
      "NPR",
      "Financial Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.npr.org",
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "Kirk, the founder of Turning Point USA, was arguably the most influential voice in young conservatism, and played a pivotal role in President Trump's return to the White House.",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE0xMHBJblp6YUhzV1IxYXcwdGpVWFhLNzhMV0VUTlltaVlSTXRzdW1JZlhuUEhVVmRfTk1iX0hlbGh0d0RkUm9ZMWlLT3NjSnFibHhUR2lIYm9HcUxYTXludW5Wbw?oc=5\" target=\"_blank\">Charlie Kirk dies at 31: How the MAGA star built a conservative behemoth</a>&nbsp;&nbsp;<font",
      "US president condemns activist’s death as a ‘heinous assassination’ and a ‘dark moment for America’",
      "<p>Kirk, a founder of Turning Point USA, has been instrumental in recruiting young Americans on college campuses to GOP voter rolls, making himself an indispensable part of Republican campaigns.</p>"
    ],
    "image_url": "",
    "titles": [
      "Charlie Kirk, a Trump ally and voice for young conservatives, dies at age 31",
      "Charlie Kirk dies at 31: How the MAGA star built a conservative behemoth - Axios",
      "Trump ally Charlie Kirk assassinated in Utah",
      "Charlie Kirk was a force with young conservatives, boosting GOP and Trump"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.832,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.781,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, co-founder of Turning Point USA and a prominent conservative activist, was shot and killed during a speaking event at Utah Valley University. The incident has heightened concerns about political violence in the United States. Authorities have reported that a suspect is now in custody in connection with the shooting. Kirk, 31, was known for his influential role in engaging young Americans in conservative politics and had played a significant part in political campaigns, including President Trump's return to the White House.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Finds Potential Signs of Ancient Life in Mars Rock Sample",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:14:56 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "ScienceDaily",
      "NASA",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.nasa.gov",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Ancient organisms may have left microscopic \"biosignatures\" on Mars. That's according to NASA scientists, who say a rock sample offers the most concrete proof yet that the red planet once hosted life.",
      "The discovery is among the strongest evidence yet that the red planet may have once harbored life. . However, scientists say more study is needed, ideally in labs on Earth.",
      "NASA’s Perseverance rover has discovered mudstones in Mars’ Jezero Crater that contain organic carbon and unusual textures hinting at possible biosignatures. These findings suggest that ancient Martian environments may have supported chemical processes similar to those on Earth, where microbial life",
      "Lee este comunicado de prensa en español aquí. A sample collected by NASA’s Perseverance Mars rover from an ancient dry riverbed in Jezero Crater could preserve evidence of ancient microbial life. Taken from a rock named “Cheyava Falls” last year, the sample, called “Sapphire Canyon,” contains poten"
    ],
    "image_url": "",
    "titles": [
      "Life on Mars? NASA says a rock sample shows potential signs of ancient life",
      "NASA rover discovers potential signs of ancient life on Mars",
      "Life on Mars? NASA discovers potential biosignatures in Martian mudstones",
      "NASA Says Mars Rover Discovered Potential Biosignature Last Year"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.778,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA scientists have discovered a rock sample on Mars, named \"Sapphire Canyon,\" which may contain microscopic \"biosignatures\" suggesting ancient microbial life. This evidence, collected by the Perseverance rover from an ancient riverbed in Jezero Crater, represents some of the strongest indications of past life on Mars. Further analysis on Earth is required to confirm these findings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers QB Brock Purdy Likely Out for Saints Game, Coach Says",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 01:52:01 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.forbes.com"
    ],
    "snippets": [
      "49ers quarterback Brock Purdy is \"a long shot\" to play Sunday at the New Orleans Saints, coach Kyle Shanahan told reporters.",
      "San Francisco 49ers head coach Kyle Shanahan called the chances of Brock Purdy playing at quarterback against the New Orleans Saints in NFL Week 2 “a long shot.”",
      "<p>The injury troubles are already piling up for the San Francisco 49ers once again.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers' Purdy unlikely to play, could miss weeks",
      "49ers Brock Purdy Likely To Miss Week 2 With Toe And Shoulder Injuries",
      "49ers’ Purdy a ‘long shot’ to play Week 2, could miss ‘multiple weeks’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "San Francisco 49ers quarterback Brock Purdy is unlikely to play against the New Orleans Saints on Sunday, according to coach Kyle Shanahan. This announcement adds to the team's growing list of injury concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Fantasy Football Rankings and Projections Released, Texas A&M Snubbed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 01:52:01 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Dig into the players who might be tough start/sit calls in your lineup based on game film notes, stats, more",
      "Goff is set to bounce right back in week 2",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxOU2hTWTM4RG9zQXV6UWpuaXh0ZzljaE9CV0JObjZTN3FSaTFWNDVuenR1VHEzOG1WLXB0aGFYeVRkb1hJSWRQVHpKUHNQMmpuWHJOeDRqY0RkaE9oeW94MVhQNEZZVE1YejhjNFJfSlNlQno3LUFfZkpYdjhVVWt2Q2xNdWFnS3JfWjNxQkVtUmxLZEI4NUhKRVdVLUo5d2c?oc=5\" target=\"_blank\">Defense & Ki",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOeGNMVlotREh5QnhtaVVvVjRGQkt4MVc0RFhBb3B3clo2ejNnTENFd2drVGIzdjBKMWJJZjBwUHg4Z3hPUHR3WlpYLW9vdjZHZWJsemIyRFNIZlRFWjlwckxORHJXTXVWY2JaclZ6bXNCVGliTG1iaW5KZGlJZGNTeHdWZUc2ZkxuQVpWa3N0VEh0THZpcjRwOHozN3U?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPWEdtUkp2N3hEckJ1S1BtQ2trX0lFZHVFUU9DbW5tdlBEZElmVjJPeVNieDNib2RITGZPdC1mM2xhOXJZQXR3Y0lNa1ZzWkN5TWlmcW5nUDVwcS14LU44NE1LM2ZXMmtITUptQkxYaUxhRnBIRG5JTWRTY1FubkRJOEZ5NmhYUWVIdmRkZmtGbGJ1RGh5aGhYOQ?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Updated week 2 rankings",
      "Fantasy Football Week 2 lineup decisions: Who to start, who to sit, must-start plays, flex plays and more",
      "Fantasy Football Week 2 Start 'Em & Sit 'Em: Jared Goff gets back on track, plus sleepers at every position",
      "Defense & Kicker Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated",
      "Running Back Start ‘Em, Sit ‘Em For Fantasy Football Week 2 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Weekly fantasy football rankings for PPR and IDP formats, and superflex ranks by Eric Karabell, have been released. SportsLine's model offers Week 2 projections, PPR rankings, and start-sit advice for various platforms. Despite many polls ranking Texas A&M in the top 25, CBS Sports' Brandon Marcello does not include them. Key players like Lamar Jackson, Christian McCaffrey, Ja'Marr Chase, and Brock Bowers are highlighted in Week 2 positional rankings for the 2025 NFL season. Steelers' Chris Boswell made headlines with a 60-yard field goal among his four in Week 1, affecting kicker rankings. Fa",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TV Personality Kirk Shot During Speech, Shooter At Large: FBI Confirms",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 07:00:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.latimes.com"
    ],
    "snippets": [
      "Kirk was a regular presence on cable TV where he leaned into the culture wars and heaped praise on President Trump.",
      "The manhunt for the suspected shooter is still underway and the investigation is still ongoing, according to FBI Director Kash Patel.",
      "<p>Political violence has no place in American democracy. But in this fragile moment, we can't use that violence as an excuse to curb more freedoms.</p>",
      "<p>Videos shared on social media show a seated Kirk speaking through a microphone; a loud pop is heard and he suddenly falls back, blood gushing from his neck.</p>"
    ],
    "image_url": "",
    "titles": [
      "LIVE: Charlie Kirk killing stokes fears of rise in political assassinations",
      "Manhunt for shooter continues after Charlie Kirk killed in 'political assassination'",
      "Chabria: Charlie Kirk's killing is horrific — and likely not the end of political violence",
      "Shooting of Charlie Kirk was 'political assassination,' Utah governor says"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kirk, known for his presence on cable TV and support for President Trump, was shot while speaking, as seen in social media videos. The FBI, under Director Kash Patel, has confirmed the shooter is still at large and the investigation is ongoing. The incident has sparked discussions on political violence and its impact on American democracy, emphasizing that such violence is unacceptable, yet cautioning against using it to restrict freedoms further.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Qatar Denounces Israeli Airstrikes in Doha as \"State Terrorism\"",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:29:19 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Qatar slams Israeli attacks on Hamas leaders in Doha as \"state terrorism\" after the bombardment rocks the tiny U.S. ally and dashes hopes of a ceasefire in Gaza",
      "Gaza City residents face an impossible choice as Israel steps up attacks: Escape and try to survive elsewhere in the enclave, or risk death.",
      "Why did Israel attack? Who was killed? What has been the Qatari response? Here are answers to those and other key questions."
    ],
    "image_url": "",
    "titles": [
      "Israel's attacks on Hamas in Qatar stun the Gulf and dash chances for a Gaza ceasefire",
      "Israel escalates attacks on Gaza City as Qatar strike scuttles ceasefire talks",
      "Israel’s Strike on Hamas in Qatar: What to Know"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.782,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Qatar condemned Israeli airstrikes targeting Hamas leaders in Doha, labeling them \"state terrorism.\" These attacks disrupted prospects for a ceasefire in Gaza, where residents now face the dilemma of fleeing or risking death amid escalating violence. The specifics of casualties and the broader implications of Qatar's response remain central concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mexico City Gas Tanker Explosion Kills 3, Injures 67; Probe Launched",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 06:40:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "An investigation has been launched to determine the cause of the explosion that wounded at least 70 people.",
      "Three people were killed and 67 more were injured after a gas tanker truck exploded on a highway in Mexico City. At least 19 people have severe burns.",
      "The cause of the enormous blast, which created chaos in one of the capital’s most heavily populated areas, was thought to be an accident."
    ],
    "image_url": "",
    "titles": [
      "Three dead, dozens injured in Mexico City gas tanker explosion",
      "Three killed, dozens injured in gas explosion in Mexico City",
      "Mexico City Gas Explosion Kills 3 and Injures at Least 70"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.967,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An investigation is underway to find the cause of a gas tanker truck explosion in Mexico City, which killed three people and injured 67, 19 with severe burns. The blast occurred on a busy highway, causing significant chaos. Initial thoughts suggest the explosion was accidental.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Officials Sue, Claiming Retaliation for Probing Trump",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 19:06:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Fired FBI officials allege dismissals were part of a retaliatory campaign targeting US agents seen as disloyal to Trump.",
      "Three former senior officials have said they were fired without cause as part of a \"campaign of retribution\" against those who had worked on previous criminal investigations against Donald Trump.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE16dnZ5TTRtMlRoSzIxRDRuNGc0aXR4Qm51RzFnYmZXQUkzSDRveVpMamtLdmxyelhMZ2lNM1hSS2EzVzRMdklYZFV2SEZibEJ6ZUlzU0tLTFhrYUluVDBheElGQnhBOVV3QmtLR2hOeGRwVlhhbEE?oc=5\" target=\"_blank\">Former FBI officials fired by Patel and Bondi sue claiming retaliati"
    ],
    "image_url": "",
    "titles": [
      "Fired FBI officials sue Trump administration for ‘illegal retribution’",
      "Former FBI leaders sue Trump administration over firings",
      "Former FBI officials fired by Patel and Bondi sue claiming retaliation - Axios"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.76,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Three former senior FBI officials claim they were unjustly fired as part of a retaliatory campaign for their involvement in criminal investigations against Donald Trump. They allege their dismissals were aimed at agents viewed as disloyal to Trump, marking a significant accusation of retribution within the agency. The officials have taken legal action, suing for what they perceive as wrongful termination.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros Edge Blue Jays 3-2 Despite Late Toronto Comeback Attempt",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 11 Sep 2025 03:13:26 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays were once again mounting a late comeback on Wednesday night with Andres Gimenez and Nathan Lukes hitting RBI singles in the eighth inning to tie up a game with the Houston Astros 2-2.",
      "<p>Jeff Hoffman&#8217;s up-and-down season continued on Wednesday night for the Toronto Blue Jays.</p>",
      "<p>Toronto Blue Jays manager John Schneider discusses the team&#8217;s 3-2 loss to the Houston Astros, saying closer Jeff Hoffman&#8217;s losing outing really just came down to &#8220;one bad pitch&#8221; against Yainer Diaz.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/38a831170ed6ac37cdd4834490484219316aea199cad09b396f426ac7a1cdc99.jpg?quality=65&strip=all",
    "titles": [
      "Schneider sticks with Hoffman as Blue Jays’ closer",
      "Blue Jays’ Schneider ‘still trusts’ Hoffman after latest homer",
      "‘One bad pitch’: Blue Jays’ Schneider on Hoffman’s outing vs. Astros"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays lost to the Houston Astros 3-2 on Wednesday. Despite a late comeback attempt with RBI singles from Andres Gimenez and Nathan Lukes in the eighth inning to tie the game, a critical pitch by closer Jeff Hoffman allowed the Astros to secure the win. Blue Jays manager John Schneider attributed the loss to Hoffman's \"one bad pitch\" against Yainer Diaz.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Four Arrested in Mistaken Identity Shooting of FSU Linebacker",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 01:52:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Four people have been arrested in connection to the shooting of Florida State LB Ethan Pritchard, Florida Department of Law Enforcement Commissioner Mark Glass said Wednesday.",
      "Pritchard's assailants face charges of attempted murder in what is described as a mistaken identity shooting"
    ],
    "image_url": "",
    "titles": [
      "4 arrested in connection with Pritchard shooting",
      "Four arrested in connection to shooting of Florida State linebacker Ethan Pritchard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Four individuals were arrested for the attempted murder of Florida State linebacker Ethan Pritchard, as announced by Florida Department of Law Enforcement Commissioner Mark Glass. The shooting, described as a case of mistaken identity, led to charges against the assailants.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys' DaRon Bland Injures Foot, Could Miss Weeks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 01:52:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Cowboys cornerback DaRon Bland, who injured his right foot in Monday's practice, could be sidelined for a couple of weeks, sources told ESPN.",
      "Bland just signed a four-year extension in the offseason"
    ],
    "image_url": "",
    "titles": [
      "Sources: Cowboys' Bland (foot) could miss weeks",
      "DaRon Bland injury: Cowboys CB could miss multiple weeks with yet another setback, per report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Dallas Cowboys cornerback DaRon Bland injured his right foot in Monday's practice and may be sidelined for several weeks, according to ESPN sources. Bland, who recently signed a four-year extension, is considered a key player in the Cowboys' defense.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Resists US Call for Tariffs on Asia to Curb Russia's War Efforts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 06:45:14 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Europe is unlikely to acquiesce to the White House's request to slap high tariffs on its Asian counterparts.",
      "<p>In effort to end Russia’s war in Ukraine, US president proposes tariffs targeting Putin allies and trade partners</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business live – latest updates</a></p"
    ],
    "image_url": "",
    "titles": [
      "Trump’s pressure on Europe to slap 100% tariffs on India and China raises eyebrows",
      "Trump asks EU to impose tariffs of up to 100% on India and China"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Europe is unlikely to agree to the White House's request for high tariffs on Asian countries. The US president proposed tariffs to end Russia's war in Ukraine, targeting Putin's allies and trade partners. The outcome of this proposal is pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vikings, Falcons Release Injury Reports; Cashman Out with Hamstring Injury",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 07:00:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com",
      "news.google.com"
    ],
    "snippets": [
      "Manchester United’s focus now turns to local rivals Manchester City in the Premier League after the international break.League formThe Red Devils have had a mixed start to the season, losing 0-1 to ...",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPM0gtMzZrZUdXOW9YZlhabF9YZlhDeU9BaDJfLWItb29XcWZpcklJZVdrTjNPeVA1elhGNnM4QVBneUE2bjFzVjVfV3BuM3BfVU1xSWdWN0RXbXNBcW9oY09hUGhTNXVBbVZrRHByTEtzVF81Qjktd0RWZXE2LUdtMEpn?oc=5\" target=\"_blank\">Man City Suffer Major Injury Blow Ahead of Manchest",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNNFgtRWJ3OTkzVHNRSUZaTjZUeEFyd3dPNTBqOFpzbGpYeTJtTV9YSWlRNGxZdmQ4UW9VUUtaTV9aZldoM1J5OTYxdXI5TlgycVVJSWdINlJVWFFjYzZVVkJMRHlEdG9QdTRsSFJOLXU3bVN1VGJhV2lkMktfYkxQNk1uNjJiZkE1bm0wMkJySUVaV3lZbXNiMzRSc3g?oc=5\" target=\"_blank\">Vikings face num",
      "Marmoush Injury Worry: Manchester City Striker Ruled Out of Derby AheadManchester City forward Omar Marmoush has been ruled out of the upcoming Manchester derby following a knee injury sustained durin..."
    ],
    "image_url": "",
    "titles": [
      "Man City face injury headache over four senior players ahead of derby",
      "Man City Suffer Major Injury Blow Ahead of Manchester Derby - Sports Illustrated",
      "Vikings face numerous injury concerns ahead of Falcons clash - Sports Illustrated",
      "Report: Manchester City Injury Worry Casts Doubt Over Derby Ahead"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Minnesota Vikings and Atlanta Falcons have released their initial injury reports ahead of their Sunday game. For the Vikings, Blake Cashman is notable for not participating due to a hamstring injury. The reports detail player participation levels, indicating who may be limited or fully available for the upcoming match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canelo Alvarez vs. Terence Crawford: Historic Title Fight in Las Vegas",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 17:46:15 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The WBC Crown Series Undisputed Championship ring is valued at over $100,000.",
      "'I have to win.' From playing cards to video games, he's as competitive as it gets.",
      "We look at the line-up for the undercard for Saturday's Canelo Alvarez vs. Terence Crawford undisputed super middleweight title fight in Las Vegas."
    ],
    "image_url": "",
    "titles": [
      "WBC reveals championship ring for Canelo vs. Crawford fight",
      "How competition -- in everything -- drives Crawford ahead of Canelo fight",
      "Canelo Alvarez Vs. Terence Crawford Fight Card Undercard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.803,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Saul \"Canelo\" Alvarez and Terence \"Bud\" Crawford are set to face off in a historic undisputed super middleweight title fight in Las Vegas. Seven respected boxing experts have analyzed the match-up, providing insights into who holds the edge. Additionally, the undercard for the event on Saturday has been announced, featuring several bouts leading up to the main event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases Week 2 NFL Survivor Picks for ESPN Challenge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 17:44:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "NFL survivor pool strategy, predictions and picks for ESPN Eliminator Challenge Week 2.",
      "SportsLine's advanced computer model just locked in its top Week 2 NFL survivor picks"
    ],
    "image_url": "",
    "titles": [
      "Survivor pool strategy: The top teams to take in Week 2",
      "NFL football knockout, survivor pool picks, advice, strategy guide for Week 2, 2025: Avoid the Niners"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.803,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine's advanced computer model has released its Week 2 NFL survivor picks for the ESPN Eliminator Challenge. These selections are based on comprehensive data analysis to guide participants in making strategic choices for their survivor pools. The specific picks were not disclosed in the summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Leaders Offer Condolences for Activist's Death; Rightwing Influence Grows",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 03:00:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Trump and other political leaders have sent their condolences after slaying of 31-year-old activist.",
      "Rightwing influencer amplified Maga worldview to a young generation"
    ],
    "image_url": "",
    "titles": [
      "Tributes pour in for slain US conservative activist Charlie Kirk",
      "Charlie Kirk, conservative activist, 1993-2025"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Trump and political leaders expressed condolences for the slaying of a 31-year-old activist. Meanwhile, a rightwing influencer has been noted for spreading a Maga worldview to younger audiences.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Continues Manhunt for Charlie Kirk's Shooter",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 03:00:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQTUJzRXBLQThSdEExVVRzMXpTUHV2VFd2S0k4ZFJBOWc1d0tTUjdnVFJXYjUtMGdnYkUycy1LcWI4Ny00U3dRTUJiOHFFajJfbDZnWkJQbjhaQ0ZDeFpkLWpQU2ZHUjZIdTJUUGROYlpxZnlnYXZwbW8xSk55UTNpZDNhQ0oxQnM?oc=5\" target=\"_blank\">Manhunt underway in Charlie Kirk killing aft",
      "FBI Director Kash Patel said the \"investigation continues\" in the search for the shooter."
    ],
    "image_url": "",
    "titles": [
      "Manhunt underway in Charlie Kirk killing after 2nd suspect released - Axios",
      "Manhunt Still Under Way For Shooter Who Killed Charlie Kirk, As Detained ‘Subject’ Is Released After Questioning (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A manhunt is ongoing following the killing of Charlie Kirk, with the FBI actively searching for the shooter. FBI Director Kash Patel confirmed that the investigation is still in progress.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Buys $300B in Oracle Computing Power in Historic Cloud Deal",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T19:01:10-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "OpenAI and Oracle signed a deal “to purchase $300 billion in computing power over roughly five years,” one of the largest cloud computing deals ever, reports the Wall Street Journal. In July, the two companies revealed their partnership to build data centers worth 4.5 gigawatts of power as part of t",
      "OpenAI and Oracle reportedly signed a deal that includes OpenAI buying $300 billion of compute over a five-year span."
    ],
    "image_url": "",
    "titles": [
      "OpenAI reportedly signs $300 billion Project Stargate cloud deal with Oracle",
      "OpenAI and Oracle reportedly ink historic cloud computing deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.825,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI and Oracle have entered into a significant agreement, with OpenAI set to purchase $300 billion in computing power from Oracle over five years. This deal, one of the largest in cloud computing history, follows their July announcement to construct data centers with a capacity of 4.5 gigawatts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Appeals Decision on Cook's Fed Board Tenure to Supreme Court",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 22:08:53 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9iMUFDcFgzLTlUd096b3VmTEljcnB4VncxbXJLbkRQSEc3dmNvSkRzLTFJOXN5cno4bFAtbnluWWtYcHpfNHgwOUZpODNDMjZobnA5WXEzTVl1N3M4Qy05OVA1N2dSMzBtYXNJTTV3LUZHMUhKbmZSc3VDZ1hVdw?oc=5\" target=\"_blank\">Trump appeals judge's order letting Cook stay on Fed boar",
      "The Supreme Court is expected to make the final decision on the question of whether President Trump has legal cause to remove Cook from the Federal Reserve."
    ],
    "image_url": "",
    "titles": [
      "Trump appeals judge's order letting Cook stay on Fed board - Axios",
      "Trump appeals order blocking him from firing Fed Governor Lisa Cook"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.793,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Trump has appealed a judge's decision that allows Cook to remain on the Federal Reserve board. The Supreme Court is anticipated to resolve whether Trump has the legal authority to remove Cook.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Lawmakers Unite in Condemnation of Violence, Lower Flags",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 00:26:23 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Leaders from both parties condemn incident — but shootings are now a feature of polarised America",
      "<p>US lawmakers, in bipartisan rebuke, say violence has no place in America as Trump orders flags lowered</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\">Charlie Kirk shooting – follow t"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F201f7962-2945-4929-b31e-251db628390c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Charlie Kirk’s killing and the ‘despicable violence’ of US politics",
      "‘Despicable’: Republicans and Democrats condemn violence after Charlie Kirk killing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.832,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US lawmakers from both parties condemned an incident of violence, emphasizing that such acts have no place in America. This bipartisan stance came as President Trump ordered flags to be lowered, signaling a unified response to the incident. The condemnation reflects concerns about the increasing polarization in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sony Launches PlayStation Family App for Parental Controls",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T13:43:34-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "PlayStation is launching a new PlayStation Family app for iOS and Android to help parents manage their child’s playtime on PS5 and PS4. Parents can already set parental control features directly on a console, but this app gives parents another way to set limits and keep track of what their kid is pl",
      "While Sony has long offered parental controls, the new app brings all of these tools into one dedicated place for easier access."
    ],
    "image_url": "",
    "titles": [
      "PlayStation launches new app for parental controls",
      "Sony rolls out new ‘PlayStation Family’ parental controls app"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.738,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sony has released a PlayStation Family app for iOS and Android, designed to help parents manage their child's playtime on PS5 and PS4. This app consolidates existing parental control features into one platform, allowing for easier access to set limits and monitor activity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zoox Begins Free Robotaxi Rides in Select Las Vegas Locations",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 17:01:23 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Amazon's Zoox robotaxi unit is offering free rides in Las Vegas from a few locations, with plans to expand in the city.",
      "Zoox's robotaxi can take riders to five destinations on The Strip. A spokesperson said most of the 50 robotaxis deployed will be in Vegas."
    ],
    "image_url": "",
    "titles": [
      "Amazon's Zoox jumps into U.S. robotaxi race with Las Vegas launch",
      "Amazon's Zoox launches robotaxi with free rides in Las Vegas. San Francisco is next."
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.713,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.598,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon's Zoox robotaxi unit has started offering free rides in Las Vegas at select locations, with intentions to broaden its service in the city. While currently not a commercial operation, these complimentary rides mark the beginning of its service expansion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Set for SF, Focus on AI Voice Tech with ElevenLabs CEO",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 17:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "TechCrunch Disrupt 2025 is bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "From audiobooks and dubbing to gaming and avatars, AI-generated voice is breaking into the mainstream — and Mati Staniszewski, CEO and co-founder of ElevenLabs, is helping lead the charge. At TechCrunch Disrupt 2025, he’ll take the stage to talk about what it takes to make voice AI truly human."
    ],
    "image_url": "",
    "titles": [
      "Humanoids, AVs, and what’s next in AI hardware at TechCrunch Disrupt 2025",
      "Exploring the future of voice AI with Mati Staniszewski at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.727,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025 will be held at Moscone West in San Francisco from October 27 to 29, attracting over 10,000 startup and VC leaders for discussions on innovative technology. A highlight will be Mati Staniszewski, CEO of ElevenLabs, discussing the advancement of AI-generated voice technology towards human-like quality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]