[
  {
    "title": "WhatsApp users can now add music to their status",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "WhatsApp introduces a feature enabling users to add temporary music clips to their profile updates. This new function allows snippets from popular songs to be featured in WhatsApp statuses. The global rollout of this feature is underway and will continue to expand in the coming weeks, as announced by Meta, WhatsApp's parent company."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9963495824537038,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45908739561342593,
    "summary": "WhatsApp has launched a new feature that lets users include short music clips in their profile updates. This update, which allows for snippets from popular songs to be added to WhatsApp statuses, is being released worldwide. Meta, the parent company of WhatsApp, has announced that the rollout will continue to expand in the coming weeks."
  },
  {
    "title": "OpenAI has a Studio Ghibli problem",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T08:58:44-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent internet trends show users creating a range of art using AI, from stylized family portraits to variations of the Distracted Boyfriend meme. This trend highlights the diverse creative potential of AI, producing both beautiful and unsettling artworks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9954530499189815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4588632624797454,
    "summary": "Recent internet trends reveal users utilizing AI to create various artworks, including stylized family portraits and new versions of the Distracted Boyfriend meme. This showcases the wide-ranging creative capabilities of AI, generating art that is both appealing and disturbing."
  },
  {
    "title": "Android Auto’s latest beta brings full Android game support",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T06:56:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Google is introducing gaming support to Android Auto, allowing games like Candy Crush Soda Saga and Angry Birds 2 to be played on the touchscreens of compatible cars. This feature is part of the beta version of Android 14.1, currently available to testers. As of now, only four games are supported."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9104399218055556,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4376099804513889,
    "summary": "Google has launched a beta version of Android 14.1, introducing gaming support to Android Auto. This new feature enables users to play games such as Candy Crush Soda Saga and Angry Birds 2 on the touchscreens of compatible vehicles. Currently, the gaming support includes only four games."
  },
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for the delegation of tasks to automated devices, such as self-driving cars and cleaning robots. While advanced sentient robots may not be affordable for most people in their lifetimes, robot vacuums offer a more accessible option for automated assistance in household chores."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.4452713184953704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3213178296238426,
    "summary": "Technology today enables tasks to be automated with devices like self-driving cars and cleaning robots. Although highly advanced sentient robots may remain out of financial reach for many during their lifetimes, robot vacuums provide a more accessible form of automated help with household chores."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its first major sales event of 2025, named the Big Spring Sale, offering discounts on gardening supplies, bedding, and more. The sale started recently and will continue until Monday, March 31st, coinciding with the onset of warmer months and the blooming of flowers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.39522102502314815,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30880525625578703,
    "summary": "Amazon has initiated its first significant sales event of 2025, dubbed the Big Spring Sale. This event, which offers discounts on items such as gardening supplies and bedding, began recently and is set to run until Monday, March 31st. The sale is timed to align with the start of spring and the flowering season."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream. The revelation came via its website, which introduced a new Virtual Game Card lending system. This announcement marks the first mention of games for the upcoming Switch 2 platform."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.38885378535879633,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30721344633969905,
    "summary": "Nintendo revealed \"Switch 2 Edition\" games and a new Virtual Game Card lending system on its website after a Nintendo Direct stream. This announcement is the first indication of games for the upcoming Switch 2 platform."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting several conservative podcasters for extensive access to senior Trump Administration officials. This initiative, aimed at engaging alternative media, is planned to be a recurring event, highlighting the administration's priority to include new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.36642513638888885,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.30160628409722223,
    "summary": "On Thursday, the White House initiated Podcast Row, granting several conservative podcasters access to senior officials from the Trump Administration. This event, intended to engage alternative media, is set to become a regular occurrence, emphasizing the administration's focus on incorporating new media outlets."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During Amazon's Big Spring Sale, various e-readers are on sale, including its first color e-reader. Notably, the Kindle Scribe, the only Kindle that supports note-taking, is available at a record low price for the 16GB model."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3578134311921296,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2994533577980324,
    "summary": "Amazon's Big Spring Sale features discounts on multiple e-readers, including its inaugural color model. The Kindle Scribe, unique for its note-taking capability, is being offered at an all-time low price for the 16GB version."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission (FTC) have been directed by Bureau of Consumer Protection Director Christopher Mufarrige to stop using the term \"independent\" to describe the agency in complaints, as revealed by an email obtained by The Verge."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.3304880227777778,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2926220056944444,
    "summary": "Christopher Mufarrige, Director of the Bureau of Consumer Protection at the FTC, has instructed staff to refrain from using the term \"independent\" to describe the agency in complaints, according to an email revealed by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian tech firm, has released the Classic 2, an updated version of its open-source trackball mouse. Retaining the original's design and ergonomics, the new model features enhanced connectivity, a more precise scroll wheel, and an improved design for easier 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.32537959783564807,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.29134489945891207,
    "summary": "Ploopy, a tech company from Canada, has launched the Classic 2, an updated open-source trackball mouse. The new version maintains the original's design and ergonomics but adds better connectivity, a more precise scroll wheel, and a design that simplifies 3D printing."
  },
  {
    "title": "State of emergency declared in Myanmar after huge earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 10:17:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A strong earthquake struck central Myanmar, with its tremors being felt in distant regions, including south-west China and Thailand."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, and its tremors were felt in distant areas such as south-west China and Thailand."
  },
  {
    "title": "Moment Bangkok high-rise under construction collapses",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:58:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A high-rise building has collapsed in Thailand's capital, with concerns that workers might be trapped inside."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A high-rise building in Bangkok, Thailand, has collapsed. There are concerns that workers could be trapped in the debris."
  },
  {
    "title": "Putin floats idea of UN-led government in Ukraine",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 12:53:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recent action has been interpreted as an effort to question the validity of the current government in Kyiv."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent event has been seen as an attempt to challenge the legitimacy of the government in Kyiv."
  },
  {
    "title": "Rosenberg: Putin nods to Trump plans to seize Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the Arctic, Russia's President commented on Trump's plans, describing them as \"serious\" but emphasized they are unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Russia's President acknowledged the \"serious\" nature of Trump's plans in the Arctic but clarified that they have no connection to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been altered by tariffs imposed by Trump, potentially affecting future cooperation between the two countries."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader expressed that tariffs introduced by the Trump administration have changed the dynamic of Canada-US relations, which may influence their collaborative efforts moving forward."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 08:46:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has formally rejected the idea of JD Vance and his wife taking control, following a statement by Donald Trump about acquiring the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has officially declined a proposal for JD Vance and his wife to take control of the island, following a statement made by Donald Trump about the possibility of acquiring Greenland."
  },
  {
    "title": "Under-fire Zimbabwe president names new army chief",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 11:22:39 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A group of war veterans has planned protests demanding the resignation of Emmerson Mnangagwa."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A group of war veterans is organizing protests to call for the resignation of Emmerson Mnangagwa."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former President Donald Trump signed an executive order directing his vice president to focus on the Smithsonian Institution's museums. This action aims to address unspecified issues within the institution, which oversees a range of museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Former President Donald Trump issued an executive order instructing his vice president to address issues at the Smithsonian Institution, which manages various museums. The nature of these issues was not specified."
  },
  {
    "title": "Crew questioned after Red Sea submarine sinks killing six",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 04:38:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two children are among the deceased in a recent incident, although further details about the victims have not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Two children are among those who died in a recent incident. Additional information about the victims has not been released."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a detention facility in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was moved from the US to a detention center in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amidst challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a stronger opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The perpetrator's initial parole request was rejected in Texas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A music icon was killed by the founder of her fan club. The killer's first attempt at parole in Texas was denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing Washington of breaching international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Several major economies, with China among them, have committed to taking retaliatory measures against the United States. They accuse Washington of violating international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case involving the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The technology's development was reportedly aided by Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The development of the technology was reportedly supported by Russia, as stated by analysts."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been taken into custody with the help of a local resident, police reported."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to an update from the investigation."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, an investigation update revealed."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a bed after a child reported seeing a \"monster\" there."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a bed after a child she was looking after reported seeing a \"monster.\""
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy consisting of 20 armed vehicles into their home, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered their home, as reported by his party."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine and emphasized his country's resilience amid challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky highlighted Europe's backing for Ukraine and stressed the nation's steadfastness in the face of adversity."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A combination of international and national factors has made the government's effort to secure a second term more challenging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The government's bid for re-election faces increased difficulty due to a mix of global and domestic issues."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India has experienced growth due to affluent, urban Indians increasingly spending on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India has seen growth as more affluent, urban residents are spending more on their pets, including dogs and cats."
  },
  {
    "title": "Superfans and spiderman: Africa's top shots",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 07:46:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's collection of standout photographs showcases a diverse range of moments from across the African continent and beyond. The selection highlights significant events, cultural expressions, and everyday life in various African countries, capturing the vibrant and dynamic essence of the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "This week's standout photographs feature a variety of significant moments, cultural expressions, and aspects of everyday life from across the African continent, showcasing its vibrant and dynamic essence."
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Vietnam's Prime Minister expressed willingness to spend the entire day playing golf with the US president if it would bring advantages to Vietnam."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Vietnam's Prime Minister stated he is open to spending a whole day playing golf with the US president if it would benefit Vietnam."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that transforms the traditional family tree into a dynamic movie, illustrating the global movements of ancestors over time. This innovative approach not only enhances genealogical research but also has applications in tracking disease spread and analyzing animal migration patterns across different regions."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that turns traditional family trees into dynamic movies, showing ancestors' global movements over time. This method improves genealogical research and can be used to track disease spread and study animal migration patterns."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have identified that 60% of the discrepancy between expected and actual ocean temperatures around Antarctica over several decades is due to increased meltwater and rainfall in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that 60% of the difference between predicted and actual ocean temperatures near Antarctica is caused by higher amounts of meltwater and rainfall in the region over several decades."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study reveals that individuals suffering from Long COVID frequently experience feelings of dismissal, disbelief, and lack of support from their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new study has found that people with Long COVID often feel ignored, doubted, and unsupported by their healthcare providers, highlighting a significant challenge in the treatment and understanding of the condition."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, the skeleton's various parts are formed from distinct precursor cells, each with unique gene regulation. This variation in gene regulation among skeletal cells from different body regions could play a crucial role in vertebrates' evolutionary success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that vertebrate skeletons are made from different precursor cells, each with unique gene regulation. This diversity in gene regulation among skeletal cells from various body parts may have significantly contributed to the evolutionary success of vertebrates."
  },
  {
    "title": "Terahertz imaging: Breakthrough in non-invasive cochlear visualization",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:15:48 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a non-invasive, high-resolution THz imaging technique to visualize cochlear structures in mice, enabling 3D reconstructions. This advancement could revolutionize diagnostics for hearing loss and other conditions by potentially leading to the creation of miniaturized THz diagnostic devices, improving diagnostic speed, accuracy, and patient outcomes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a non-invasive, high-resolution imaging method using terahertz (THz) technology to visualize the cochlear structures in mice, allowing for 3D reconstructions. This breakthrough could lead to the development of compact THz diagnostic tools, enhancing the speed and accuracy of diagnosing hearing loss and other conditions, and potentially improving patient outcomes."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Biology professor Mark Peifer from the University of North Carolina at Chapel Hill advocates for the inclusion of eugenics in college genetics curriculums. He believes this will motivate scientists to address the misuse of science for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends incorporating eugenics into college genetics curriculums. He argues that this will encourage scientists to confront the misuse of science for political aims."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Soil samples from twelve parks in Dublin, Ireland, revealed that park entrances have higher levels of infective roundworm eggs compared to other areas within the parks."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Soil samples from twelve Dublin parks show higher levels of infective roundworm eggs at park entrances than in other park areas."
  },
  {
    "title": "Your guide to Day 1 of the men's Sweet 16: High-scoring games, OT and more",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:37:10 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The field of 68 teams in the tournament has been reduced to 12, following the outcomes of Thursday's games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The tournament's original lineup of 68 teams has now dwindled to 12 after Thursday's games concluded."
  },
  {
    "title": "Dani Alves sexual assault conviction overturned",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:45:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Catalonia region's top court in Spain has overturned the sexual assault conviction of Brazilian soccer player Dani Alves."
  },
  {
    "title": "Duke back in Elite 8 behind Flagg's 30-point clinic",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In a recent basketball game, Duke's Cooper Flagg led his team to a 100-93 victory over Arizona with an impressive performance, scoring 30 points, grabbing 6 rebounds, providing 7 assists, and blocking 3 shots. This win has propelled the Blue Devils into the Elite Eight for the second consecutive year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Cooper Flagg of Duke scored 30 points, had 6 rebounds, 7 assists, and 3 blocks in a 100-93 win against Arizona, advancing the Blue Devils to the Elite Eight for the second year in a row."
  },
  {
    "title": "'Special moment': Giddey's 47-footer stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half court at the buzzer, securing a 119-117 win against the Los Angeles Lakers on Thursday night. This shot is considered one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey from the Chicago Bulls hit a 47-foot 3-pointer at the buzzer, leading to a 119-117 victory over the Los Angeles Lakers on Thursday. This dramatic half-court shot is highlighted as one of the NBA season's most remarkable finishes."
  },
  {
    "title": "'Whatever it takes': TTU storms back in OT thriller",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Darrion Williams scored the decisive basket with 7.3 seconds remaining in overtime, leading Texas Tech to an 85-83 victory over Arkansas after overcoming a 16-point deficit. This win secured Texas Tech's place in the Elite Eight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Darrion Williams scored a crucial basket with 7.3 seconds left in overtime, securing an 85-83 win for Texas Tech over Arkansas. This victory, after rallying from a 16-point deficit, advanced Texas Tech to the Elite Eight."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging that it collaborated with the university to unfairly blame him, making him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims the NCAA worked with the university to unjustly make him a scapegoat."
  },
  {
    "title": "Ovi, Caps honor Wild's Fleury with handshakes",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "After Thursday's game, Alex Ovechkin led the Washington Capitals in a postgame handshake with retiring Minnesota Wild goalie Marc-Andre Fleury, ensuring every player participated in the gesture of respect."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following Thursday's game, Alex Ovechkin of the Washington Capitals orchestrated a postgame handshake line with every player to honor retiring Minnesota Wild goalie Marc-Andre Fleury, showcasing a gesture of respect."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking a notable moment after being discussed for trades during the offseason. His performance led to a curtain call from Cardinals fans, acknowledging the importance of his contribution."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, earning a curtain call from Cardinals fans. This came after offseason trade discussions, highlighting his significant contribution to the team."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:36:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not clearly state his future plans with the Terrapins following their Sweet 16 elimination by Florida on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Following the Sweet 16 defeat of the Maryland Terrapins by Florida, head coach Kevin Willard did not specify his future plans with the team."
  },
  {
    "title": "Home of the Rays?! Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:46:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This rapid conversion involved extensive preparations and modifications to accommodate a major league game, showcasing efficient planning and execution by the involved parties."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly converted into the Tampa Bay Rays' ballpark for Opening Day within four days. This transformation required detailed preparations and changes to host a major league game, demonstrating effective planning and execution by the teams involved."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:51:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, there has been a record number of 3-point attempts in the league, sparking discussions on whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The current basketball season has seen a record-breaking number of 3-point shot attempts, leading to debates on whether rules should be introduced to reduce their frequency."
  },
  {
    "title": "Inside Elic Ayomanor's viral night and journey from Canada to the NFL draft",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 06:48:11 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Stanford receiver from Medicine Hat, Alberta, achieved a record-setting performance in a game against Travis Hunter, showcasing his potential for an NFL career."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A Stanford receiver from Medicine Hat, Alberta, set a record in a game against Travis Hunter, demonstrating his NFL potential."
  },
  {
    "title": "Olympic champ Chloe Kim has a new outlook, new tricks -- and the old dominance",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:43:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The snowboarder, who previously faced challenges with depression, has regained her enthusiasm for the sport. She is now aiming to qualify for the 2026 Olympics during the World Championships on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "A snowboarder, who has battled depression, is now focused on qualifying for the 2026 Olympics. Her next opportunity to achieve this goal is at the World Championships on Saturday."
  },
  {
    "title": "Six theories on why penalties (and power plays) are dramatically down this NHL season",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Discussions among players, executives, and analysts are underway regarding whether there is a trend toward cleaner gameplay in sports or if referees are less frequently penalizing infractions. These conversations aim to understand changes in the dynamics of game officiating and player behavior."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Players, executives, and analysts are discussing if sports are witnessing cleaner gameplay or if referees are becoming less strict in penalizing infractions. The talks focus on analyzing shifts in game officiating and player conduct."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes on team standings. The summary includes each team's performance and schedule up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is being defined as a panel has voted on team standings, taking into account each team's performance and their schedule up to April 17."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:24:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are contenders for the top position in the Sweet 16 player rankings, indicating their significant impact and performance in the competition. The specific ranking order among them has not been disclosed."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are key contenders for the top spot in the Sweet 16 player rankings, showcasing their notable performance in the competition. The exact ranking order among the three has yet to be revealed."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:24:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players propelling Notre Dame's basketball team in their pursuit of a championship title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are leading Notre Dame's basketball team towards a championship title, playing pivotal roles in the team's success."
  },
  {
    "title": "U.S.'s Cardoso feels 'valued' by Tottenham links",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "United States international and Real Betis midfielder Johnny Cardoso has stated that rumors linking him with a move to the Premier League have boosted his confidence."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Johnny Cardoso, a midfielder for Real Betis and the U.S. national team, expressed that rumors of a potential move to the Premier League have increased his confidence."
  },
  {
    "title": "Sources: Griezmann to delay Atleti exit for MLS",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antoine Griezmann is expected to remain with Atlético Madrid for the next season, according to sources cited by ESPN. This is despite his previously expressed desire to play in Major League Soccer (MLS)."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Antoine Griezmann is set to stay at Atlético Madrid for the upcoming season, despite his interest in moving to Major League Soccer (MLS), as reported by ESPN sources."
  },
  {
    "title": "Bayern blast 'sloppy' Canada over Davies injury",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich has requested an explanation from Canada's team officials following a ligament tear injury sustained by defender Alphonso Davies while on international duty."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayern Munich has sought clarification from Canada's team officials regarding a ligament tear injury Alphonso Davies suffered while playing for the national team."
  },
  {
    "title": "Chelsea captain Bright warns Barça : 'Bring it on'",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chelsea captain Millie Bright praised her team's exceptional mentality and expressed enthusiasm for the upcoming challenge against Barcelona in the UEFA Women's Champions League semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Chelsea captain Millie Bright commended her team's strong mentality and showed excitement for facing Barcelona in the UEFA Women's Champions League semifinals."
  },
  {
    "title": "Barça vent anger over schedule as Olmo injured",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:49:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Barcelona's coach, Hansi Flick, stated the team suffered a significant loss despite their 3-0 victory over Osasuna, as Dani Olmo was injured during the Thursday match."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona's coach, Hansi Flick, reported a major setback for the team as Dani Olmo was injured during their 3-0 win against Osasuna on Thursday."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:29:27 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced an investigation into alleged \"indecent conduct\" by four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid."
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "domain": "Sports",
    "location": "National",
    "published": "Fri, 28 Mar 2025 08:20:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Qatar Sport Investment (QSI), which owns Paris Saint-Germain, is in the final stages of acquiring the Spanish football club Malaga, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is reportedly close to buying the Spanish football club Malaga, as per a source mentioned by ESPN."
  }
]