[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff members share insights on a variety of items they own, ranging from recent purchases to products acquired over a decade ago. The discussion includes smart tech, office tools, and kitchen gadgets, highlighting a mix of new and old belongings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8119690796180555,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4129922699045139,
    "summary": "Verge staff members discussed a range of personal items they own, from newly bought to those owned for over ten years. The conversation covered smart technology, office equipment, and kitchen devices, showcasing a variety of both modern and older products."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale for 2025, running until March 31st. The sale offers significant discounts on gardening supplies, bedding, and more, coinciding with the start of the warmer months."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6321774126041666,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36804435315104167,
    "summary": "Amazon's Big Spring Sale for 2025 is underway until March 31st, offering discounts on gardening supplies, bedding, and other items to mark the beginning of warmer months."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces highly refined stealth and assassination mechanics, presenting a challenging yet rewarding experience as a shinobi. This installment is praised for achieving the most impressive gameplay in these aspects within the franchise."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5809621345601852,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35524053364004626,
    "summary": "Assassin's Creed Shadows is commended for its advanced stealth and assassination gameplay, offering a challenging and satisfying experience as a shinobi. It is recognized for setting a new standard in gameplay within the series."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is introduced as a gaming-focused counterpart to the MacBook Pro, emphasizing a return to a thinner and lighter design after its predecessor's bulkier build. This model aims to appeal to users seeking a gaming laptop with a conventional appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.539295467638889,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3448238669097222,
    "summary": "The Razer Blade 16 has been launched as a gaming laptop with a focus on a slimmer and lighter design, targeting users who desire gaming performance in a more traditional-looking laptop, positioning it as an alternative to the MacBook Pro."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed for outdoor use, doubles as a versatile work lamp with three adjustable LED panels. It emits 3000 lumens, making it suitable for various settings such as campsites, workspaces, or under the hood of a car. The device is rechargeable and compact, allowing it to also function as a durable flashlight."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.25536028219907403,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2738400705497685,
    "summary": "BougeRV has released an LED lantern designed for outdoor activities that can also be used as a work lamp. It features three adjustable LED panels, producing 3000 lumens of light, making it versatile for use in places like campsites, workspaces, or for car maintenance. The lantern is rechargeable, compact, and doubles as a durable flashlight."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The search for survivors is being hindered by a severe shortage of equipment, inconsistent communication abilities, and extensive damage to roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The search for survivors faces challenges due to a critical lack of equipment, poor communication capabilities, and significant road damage."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with the BBC, describing it as \"incredible\" that bombs would be dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur criticized the military in a BBC interview for dropping bombs during rescue operations, describing the action as \"incredible.\""
  },
  {
    "title": "Israel-Hamas ceasefire back on table in new negotiations",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 23:05:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hamas has reportedly agreed to a proposal for the release of five hostages in exchange for a 50-day truce."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Hamas has reportedly agreed to a proposal that involves releasing five hostages in exchange for a 50-day truce."
  },
  {
    "title": "Protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 21:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Pro-democracy demonstrators rallied in support of Ekrem Imamoglu, a detained opposition leader."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Pro-democracy demonstrators gathered to support Ekrem Imamoglu, an opposition leader who has been detained."
  },
  {
    "title": "US marine park investigated over animal-welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have passed away at Gulf World Marine Park in Florida over the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have died at Gulf World Marine Park in Florida within the past year."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya, a food chain, temporarily closed after reports emerged of an insect and a rat found in meals by customers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a food chain, has temporarily shut down following customer reports of finding an insect and a rat in their meals."
  },
  {
    "title": "No survivors after plane crashes into house in Minnesota",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 22:44:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A plane crash occurred, and officials have not confirmed the number of passengers. The local fire chief reported that there were no survivors."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A plane crash has been reported, with the local fire chief stating that there were no survivors. The exact number of passengers on board has not yet been confirmed by officials."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul announced that Ms. Hall is currently with Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul stated that Ms. Hall is with Qatari officials and is anticipated to return home shortly."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire in a city has resulted in 21 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple buildings, local officials reported."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki is being criticized for wearing a disguise to promote his own book on a television program."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise while promoting his book on a TV show."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase do not belong to Somalia, implying they should not have the authority to make decisions regarding their use or ownership."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic argues that Somalia does not have the right to control or own the Berbera port and airbase, suggesting these facilities are not under Somali jurisdiction."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of missing persons in Antigua have expressed their distress during interviews with the BBC, sharing their experiences of anguish."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing persons in Antigua have conveyed their distress and anguish in interviews with the BBC, detailing their emotional experiences."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence at the time of the pardon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year prison sentence, has been pardoned for health reasons."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to scrutinize diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has launched an investigation into diversity and inclusion programs as part of a wider review of such initiatives."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk in the Danish territory, Andrew Harding reports that numerous locals feel pressured or bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During a trip to Nuuk in Greenland, a Danish territory, Andrew Harding found that many residents feel pressured or intimidated by the United States."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rescuers are currently engaged in efforts to rescue individuals trapped in the debris of a tower that collapsed on Friday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Rescue teams are working to save people trapped under the rubble of a tower that fell on Friday."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to improve the quality of photos on a website known for having poor images of celebrities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative has been launched to enhance the quality of celebrity photographs on a website criticized for its low-quality images."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An earthquake caused significant destruction, with its impact heightened by its magnitude and the extent of the fault line it occurred along."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An earthquake resulted in considerable damage, attributed to its high magnitude and the large area of the fault line where it happened."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A large earthquake struck central Myanmar, resulting in extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A significant earthquake hit central Myanmar, causing widespread destruction in the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Car prices in the wholesale market have significantly increased, with expectations of a further rise, according to a car seller speaking to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Car prices in the wholesale market have risen significantly, with further increases expected, a car seller told the BBC."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation at a military base in South Sudan. The crew successfully completed their mission despite coming under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for safely completing an evacuation mission at a South Sudan military base, despite being under attack."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An upcoming eclipse will not be total in any location worldwide, but certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An upcoming eclipse will be almost total in some parts of Canada, but no location worldwide will experience a total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers received applause for successfully carrying 30-year-old Phyu Lay Khaing to safety on a stretcher."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, 30-year-old Phyu Lay Khaing was successfully rescued and carried to safety on a stretcher, an effort that garnered applause from onlookers."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed following a powerful earthquake in neighboring Myanmar, leaving dozens of people unaccounted for."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed due to a powerful earthquake in Myanmar, with dozens of people reported missing."
  },
  {
    "title": "Men's Elite Eight live tracker: Highlights, updates on Florida vs. Texas Tech",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:51:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Saturday night features college basketball games with Florida facing Texas Tech and Duke playing against Alabama. The outcomes of these matchups are being closely tracked."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Saturday night, college basketball games include Florida playing against Texas Tech and Duke facing off against Alabama. The results of these games are being closely monitored."
  },
  {
    "title": "Yankees slug 9 HRs, 4 in 1st in 'crazy' 20-9 win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit nine home runs in a 20-9 victory over the Brewers, with four homers off Nestor Cortes in the first inning alone."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees secured a 20-9 win against the Brewers, marking a significant victory by hitting nine home runs, including four in the first inning off pitcher Nestor Cortes."
  },
  {
    "title": "TCU wins as Van Lith into Elite Eight for 5th time",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hailey Van Lith of TCU scored 26 points, leading the Horned Frogs to a 71-62 victory against Notre Dame in the Sweet 16 round of the women's NCAA tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith from TCU scored 26 points, guiding the Horned Frogs to a 71-62 win over Notre Dame in the women's NCAA tournament Sweet 16 round."
  },
  {
    "title": "Auburn's Pearl not buying Izzo, MSU as underdogs",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Auburn coach Bruce Pearl stated he will not consider Michigan State as underdogs in the NCAA tournament, emphasizing the program's historical success in the competition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Auburn coach Bruce Pearl declared he won't view Michigan State as underdogs in the NCAA tournament, highlighting the team's strong historical performance in the event."
  },
  {
    "title": "Trinity Rodman: Back likely never will be 100%",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Trinity Rodman, a player for the US Women's National Soccer Team, has stated that she believes her back problems will not completely heal, indicating a long-term health concern."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Trinity Rodman, a member of the US Women's National Soccer Team, has expressed that her back issues are expected to be a persistent health problem, signaling they may not fully resolve."
  },
  {
    "title": "Scherzer (lat) leaves Jays debut after 3 innings",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Max Scherzer, 40, a two-time World Series champion, left his first start for the Toronto Blue Jays after three innings due to right lat soreness. This occurred during the team's 9-5 loss to the Baltimore Orioles. Scherzer had joined the Blue Jays in January."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Max Scherzer, 40, a pitcher for the Toronto Blue Jays and two-time World Series champion, exited his first game with the team after three innings due to right lat soreness. This happened during a 9-5 loss to the Baltimore Orioles. Scherzer had signed with the Blue Jays in January."
  },
  {
    "title": "Sources: Kansas frosh Bidunga to enter portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kansas freshman Flory Bidunga plans to enter the transfer portal, as confirmed by sources to ESPN. He has communicated his intentions to the Kansas coaching staff."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Kansas freshman Flory Bidunga intends to enter the transfer portal, as confirmed by sources to ESPN. He has informed the Kansas coaching staff of his decision."
  },
  {
    "title": "Sabalenka, 'best player in the world,' wins Miami",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aryna Sabalenka, the No. 1 seed from Belarus, won the Miami Open by defeating Jessica Pegula with a score of 7-5, 6-2. This victory follows their previous encounter in the 2024 US Open final, marking Sabalenka's third Grand Slam title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aryna Sabalenka from Belarus, the top seed, won the Miami Open by beating Jessica Pegula 7-5, 6-2. This win comes after their match in the 2024 US Open final and is Sabalenka's third Grand Slam title."
  },
  {
    "title": "No. 2 WNBA prospect Miles still deciding future",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:35:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Notre Dame basketball player Olivia Miles, who is expected to be the second pick in the WNBA draft, has stated she is considering entering the draft but has not made a final decision."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Notre Dame basketball player Olivia Miles, anticipated to be the second pick in the WNBA draft, is contemplating entering the draft. However, she has not yet made a definitive decision."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:13:44 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Friday night featured notable victories for Auburn and Houston, with detailed analysis available on their respective wins. The coverage includes a comprehensive breakdown of the games' key moments and strategies leading to their successes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston secured significant victories in their games. The coverage provided detailed analysis on the key moments and strategies that contributed to their success, highlighting the pivotal plays and tactical decisions that led to their wins."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:15:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have been played. This marks a crucial phase in the competition as teams vie for a spot in the upcoming rounds."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has advanced to the Sweet 16 stage, with the first four games completed. Teams are competing for a chance to progress in the tournament."
  },
  {
    "title": "What this historic day of home runs says about Aaron Judge, Yankees",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:59:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Aaron Judge hit three home runs in a game, leading the New York Yankees to set a new record for home runs. This performance highlighted Judge's exceptional talent as a power hitter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Aaron Judge hit three home runs in a single game, contributing to the New York Yankees setting a new record for team home runs. This achievement underscores Judge's prowess as a power hitter."
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:14:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This week's UFC Fight Night is being closely analyzed, with an MMA coach and a betting insider sharing their predictions on who has the advantage in the upcoming fights."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This week's UFC Fight Night is under scrutiny as both an MMA coach and a betting insider offer their predictions on the fighters' advantages in the upcoming matches."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This article discusses the implications of upcoming sports matchups, including their impact on playoff projections and draft lottery standings. It provides updated information on what is at stake for the teams involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This article provides an overview of significant upcoming sports matchups, highlighting their potential effects on playoff positions and draft lottery standings. It details the stakes for the involved teams, offering updated insights into their current standing and what they could gain or lose in the upcoming games."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, evaluating each team's performance up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field is being determined as a panel has voted to evaluate the performance of each team up to April 17, clarifying which teams will advance."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's season has come to an end. Looking forward to next season, the focus shifts to portal priorities and incoming recruits for the Wolfpack."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's football season has concluded. The team is now concentrating on enhancing its roster through the transfer portal and integrating new recruits as they prepare for the next season."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Tampa Bay Rays' ballpark for Opening Day in just four days. This rapid conversion showcases the flexibility and adaptability of the facility to accommodate major league games."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly transformed into the Tampa Bay Rays' ballpark for Opening Day within four days, demonstrating the facility's capacity for fast adaptation to host major league games."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze scored a goal and provided an assist in Crystal Palace's 3-0 victory over Fulham on Saturday, securing their spot in the FA Cup semifinals."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze contributed a goal and an assist in Crystal Palace's 3-0 win against Fulham on Saturday, helping his team advance to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:32:43 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won over $20 million in a medical malpractice lawsuit against Richard H. Edelson, the team doctor for Portland Timbers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson was awarded over $20 million in a medical malpractice lawsuit. The lawsuit was against Richard H. Edelson, who was the team doctor for the Portland Timbers, Gleeson's former team."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite challenges, the Bundesliga leaders secured the win at home."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to help Bayern Munich secure a 3-2 win over St Pauli at home on Saturday. The victory maintained Bayern Munich's lead in the Bundesliga standings."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 19:32:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Espanyol and Atletico Madrid drew 1-1 in LaLiga on Saturday. Cesar Azpilicueta scored for Atletico in the first half, but Javi Puado's penalty equalized for Espanyol. The result impacts Espanyol's fight against relegation and Atletico's position in third place."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol and Atletico Madrid ended in a 1-1 draw in their LaLiga match on Saturday. Cesar Azpilicueta scored for Atletico Madrid in the first half, with Javi Puado equalizing for Espanyol through a penalty. The draw affects Espanyol's battle against relegation and keeps Atletico Madrid in third place."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle marked the end of a 70-year wait for a major domestic trophy by hosting an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle celebrated their first major domestic trophy in 70 years with an open-top bus parade through the city."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:29 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced the dismissal of head coach Dorival Júnior after Brazil's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) has fired head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 18:56:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to Crystal Palace's starting lineup on Saturday for his first game since his ear was severely injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played his first game for Crystal Palace on Saturday since suffering a severe ear injury, marking his return to the starting lineup."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that mutations in VPS35, a critical component in the pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapy treatments. This finding may aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that mutations in VPS35, a key part of the process that uses reactive oxygen species (ROS) to destroy cancer cells, can cause resistance to chemotherapy. This discovery could help identify tumors that won't respond to treatment."
  }
]