[
  {
    "title": "Amazon Spring Sale deals on Verge staff favorites",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T15:32:39-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Verge staff members shared their experiences with various products, ranging from recent purchases to items they've owned for years or even decades. The discussion covered a wide array of gadgets, including smart technology, office equipment, and kitchen tools."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.9788266291435185,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45470665728587967,
    "summary": "Verge staff members discussed their experiences with a variety of products, from newly acquired items to those they've had for many years. The conversation spanned across different categories such as smart technology, office equipment, and kitchen gadgets."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 100 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T11:13:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale, coinciding with the start of the warmer months. The event, which runs until March 31, 2025, features discounts on gardening supplies, bedding, and other items."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7990349618402778,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.40975874046006944,
    "summary": "Amazon has started its Big Spring Sale, offering discounts on gardening supplies, bedding, and more. The sale, marking the beginning of the warmer months, will last until March 31, 2025."
  },
  {
    "title": "Assassin’s Creed Shadows lives up to the series’ name",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T10:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Assassin's Creed Shadows introduces advanced stealth and assassination mechanics, making it a rewarding experience despite its challenges. The game has been praised for achieving a high level of precision in its gameplay, marking a significant development in the Assassin's Creed series."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7478196836111111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39695492090277773,
    "summary": "Assassin's Creed Shadows has been commended for introducing advanced stealth and assassination mechanics, offering a rewarding gameplay experience. It is noted for its precise gameplay, marking a significant advancement in the Assassin's Creed series."
  },
  {
    "title": "I’m still testing the new Razer Blade 16 and I have mixed feelings",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T09:00:00-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Razer Blade 16 is positioned as a gaming-focused alternative to the MacBook Pro, featuring a return to a thinner and lighter chassis design after its predecessor's bulkier build. This model aims to appeal to users who prefer gaming laptops with a more conventional appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7061530156944444,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3865382539236111,
    "summary": "The Razer Blade 16 is a gaming laptop designed to be a thinner, lighter alternative to the MacBook Pro, targeting users who favor gaming devices with a traditional look, moving away from the bulkier design of its predecessor."
  },
  {
    "title": "BougeRV’s telescopic lantern is ridiculously versatile",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-29T02:11:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "BougeRV's LED lantern, marketed as an outdoor camplight, functions as a versatile work lamp suitable for various settings needing additional lighting. It is rechargeable, compact, and features three adjustable LED panels that emit up to 3000 lumens, making it ideal for use in campsites, workspaces, or for mechanical work."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.42221782997685187,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.31555445749421296,
    "summary": "BougeRV has introduced a LED lantern designed for outdoor camping that also serves as a multi-purpose work lamp. This rechargeable, compact device offers three adjustable LED panels with a brightness of up to 3000 lumens, making it suitable for lighting campsites, workspaces, and for mechanical tasks."
  },
  {
    "title": "Judge saves the CFPB, for now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:10:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday, Judge Amy Berman Jackson issued a preliminary injunction preventing the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) pending the outcome of ongoing legal proceedings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.08845625545138891,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.23211406386284722,
    "summary": "On Friday, Judge Amy Berman Jackson issued a preliminary injunction blocking the Trump administration and its Department of Government Efficiency from dismantling the Consumer Financial Protection Bureau (CFPB) until the ongoing legal proceedings are resolved."
  },
  {
    "title": "Windows 11 is closing a loophole that let you skip making a Microsoft account",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T18:04:46-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft announced in its latest Windows 11 Insider Preview that it will remove a bypass script previously used to skip the requirement for devices to be connected to the internet and logged in during setup. This change enforces the need for an internet-connected account for all Windows 11 devices."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.08446319944444447,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.2311157998611111,
    "summary": "Microsoft will eliminate a bypass script in its new Windows 11 Insider Preview, making internet connection and account login mandatory during setup for all Windows 11 devices."
  },
  {
    "title": "The 30 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:52:51-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features dozens of deals across a wide range of products, accessible to all customers without the need for an Amazon Prime membership. A comprehensive roundup includes over 100 deals on popular items, alongside a selection of budget-friendly alternatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.07618773604166662,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.22904693401041665,
    "summary": "Amazon's Big Spring Sale is happening now and will end on March 31st. It offers numerous deals on a variety of products, available to all customers without requiring an Amazon Prime membership. The sale includes a list of over 100 deals on popular items and budget-friendly options."
  },
  {
    "title": "Elon Musk’s xAI buys Elon Musk’s X for $33 billion on paper",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:44:16-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Elon Musk's AI company, xAI, has acquired the social media platform X (previously Twitter) in an all-stock deal. Musk, who bought Twitter a few years ago for $44 billion, valued xAI at $80 billion and X at $33 billion, with the latter carrying $12 billion in debt."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.07022708746527784,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.22755677186631945,
    "summary": "Elon Musk's AI company, xAI, has purchased the social media platform X (formerly Twitter) through an all-stock transaction. Musk, who acquired Twitter for $44 billion, has now valued xAI at $80 billion and X at $33 billion, despite X having $12 billion in debt."
  },
  {
    "title": "Microsoft tests Quick Machine Recovery to restore PCs that can&#8217;t boot",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-28T17:33:38-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Microsoft has begun testing Quick Machine Recovery in its latest Windows Insider Preview build (6120.3653), aimed at enabling IT professionals to remotely recover Windows 11 devices that won't boot. This feature was announced following the Crowdstrike incident last year, as part of Microsoft's efforts to enhance device recovery capabilities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.06284282777777783,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.22571070694444445,
    "summary": "Microsoft has introduced Quick Machine Recovery in its new Windows Insider Preview build (6120.3653) for Windows 11. This feature, designed for IT professionals, allows the remote recovery of devices that fail to boot. It's part of Microsoft's initiative to improve device recovery options, following the Crowdstrike incident last year."
  },
  {
    "title": "Myanmar quake toll passes 1,600 as people dig for survivors with bare hands",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:45:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The search for survivors is being hindered by a severe shortage of equipment, inconsistent communication, and damaged roads."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The search for survivors faces obstacles due to a lack of necessary equipment, problems with communication, and destruction of roads."
  },
  {
    "title": "Myanmar junta continues air strikes after devastating earthquake",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:04:50 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A UN Special Rapporteur criticized the military's actions in an interview with the BBC, describing it as \"incredible\" that bombs were being dropped during rescue operations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A UN Special Rapporteur condemned the military for dropping bombs during rescue operations, as reported in a BBC interview, highlighting the severity of the actions."
  },
  {
    "title": "At least 15 still alive under Bangkok skyscraper rubble, rescuers say",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:37:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A tower collapsed on Friday, leading to ongoing rescue efforts to save individuals trapped in the debris."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tower collapsed on Friday, triggering rescue operations to save people trapped under the debris."
  },
  {
    "title": "Pro-democracy protesters return to Istanbul's streets for huge rally",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:52:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Demonstrators rallied in support of opposition leader Ekrem Imamoglu, who claims his arrest was politically motivated."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Supporters of opposition leader Ekrem Imamoglu gathered for demonstrations, protesting what they assert is a politically motivated arrest."
  },
  {
    "title": "JD Vance's ominous pitch to Greenland",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:19:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a visit to Nuuk in the Danish territory, Andrew Harding reports that numerous locals feel pressured or bullied by the United States."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "During Andrew Harding's visit to Nuuk in the Danish territory, he reports that many locals express feelings of being pressured or bullied by the United States."
  },
  {
    "title": "Four killed in mass Russian drone attack on Dnipro, Ukraine says",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 11:13:48 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A fire incident in a city resulted in 21 people being injured and caused a restaurant along with several buildings to catch fire, according to local officials."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A fire in a city injured 21 people and spread to a restaurant and multiple buildings, as reported by local officials."
  },
  {
    "title": "Japan chain shuts shops after pests found in food",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:50:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sukiya, a food chain, temporarily shut down after reports emerged of an insect and a rat discovered in meals by customers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Sukiya, a food chain, temporarily closed its doors following customer reports of finding an insect and a rat in their meals."
  },
  {
    "title": "Taliban releases detained US citizen Faye Hall",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 19:47:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The former US envoy to Kabul reported that Ms. Hall is currently with Qatari officials and is expected to return home soon."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The former US envoy to Kabul has stated that Ms. Hall is currently in the company of Qatari officials and is anticipated to return home in the near future."
  },
  {
    "title": "US marine park investigated over animal welfare concerns",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:38:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Four dolphins have died at Gulf World Marine Park in Florida within the last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Four dolphins have passed away at Gulf World Marine Park in Florida over the past year."
  },
  {
    "title": "Polish presidential candidate ridiculed for donning disguise to promote book",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:07:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Karol Nawrocki is being criticized for wearing a disguise to promote his own book during a TV appearance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Karol Nawrocki faced criticism for wearing a disguise while promoting his book on TV."
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 17:19:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The breakaway republic contends that the Berbera port and airbase are not under Somalia's jurisdiction to be offered to another party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The breakaway republic asserts that the Berbera port and airbase fall outside of Somalia's control, arguing that Somalia cannot legally offer these facilities to another entity."
  },
  {
    "title": "Mysterious disappearances spook residents of Caribbean island",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 02:15:59 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Relatives and friends of individuals who have disappeared in Antigua have shared their experiences of anguish with the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Relatives and friends of missing individuals in Antigua have expressed their distress over their loved ones' disappearances in discussions with the BBC."
  },
  {
    "title": "Guinea's ex-military ruler pardoned over stadium massacre",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 16:50:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Moussa Dadis Camara, who was serving a 20-year sentence, has been pardoned due to health reasons. He was less than a year into his sentence when the pardon was granted."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Moussa Dadis Camara, who was less than a year into a 20-year prison sentence, has been pardoned for health reasons."
  },
  {
    "title": "Disney faces US investigation over DEI practices",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 15:09:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Trump administration is conducting an investigation as part of a broader effort to regulate diversity and inclusion initiatives."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Trump administration has initiated an investigation aimed at regulating diversity and inclusion programs. This move is part of a wider effort to oversee such initiatives."
  },
  {
    "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:50:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A lawsuit has been filed against a controversial influencer, accusing him of assault and making threats during an incident in Beverly Hills. The influencer denies these allegations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A lawsuit accuses a controversial influencer of assault and making threats in Beverly Hills. The influencer has denied the allegations."
  },
  {
    "title": "Amateur photographers hope to fix Wikipedia's 'terrible' pictures",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:42:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A volunteer project is underway to address the issue of poor-quality photos, especially of celebrities, on a specific site. The initiative aims to improve the visual content by replacing or enhancing these images."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A volunteer initiative is focused on improving the quality of photos, particularly those of celebrities, on a specific website. The project seeks to either replace or enhance these poor-quality images to improve visual content."
  },
  {
    "title": "What caused the Myanmar earthquake - and why did it make a tower in Bangkok collapse?",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:00:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An earthquake caused significant destruction due to its magnitude and the extensive length of the fault line on which it occurred."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "An earthquake resulted in significant damage due to its large magnitude and the long fault line it occurred on."
  },
  {
    "title": "Myanmar earthquake: What we know",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:37:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A powerful earthquake struck central Myanmar, causing extensive damage across the region."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A strong earthquake hit central Myanmar, resulting in widespread damage throughout the area."
  },
  {
    "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 00:38:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Wholesale market prices have significantly increased, with expectations of further rises, according to a car seller's statement to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Wholesale market prices have risen significantly, with further increases anticipated, a car seller told the BBC."
  },
  {
    "title": "Indian mural that spent decades on Norwegian hospital wall sells for record $13.8m",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 22:20:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mural by MF Husain, measuring 14 feet in width, was sold for a record $13.8 million in New York last week."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 14-foot-wide mural by artist MF Husain was sold in New York for a record price of $13.8 million last week."
  },
  {
    "title": "Helicopter pilot recounts flying under gunfire in daring rescue mission",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 01:17:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A Ukrainian helicopter crew was praised for their actions during an evacuation mission at a military base in South Sudan, where they came under fire."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A Ukrainian helicopter crew received commendation for their performance during an evacuation operation at a South Sudan military base, where they were subjected to gunfire."
  },
  {
    "title": "Partial eclipse darkens sky over UK and abroad",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 13:52:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The upcoming eclipse will not be a total eclipse in any part of the world. However, certain areas in Canada will experience a near-total eclipse."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The upcoming eclipse will not be a total eclipse anywhere in the world, but some regions in Canada will witness a near-total eclipse."
  },
  {
    "title": "Watch: Applause as rescuers pull woman alive from rubble in Myanmar",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 14:44:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Myanmar, rescuers received applause as they successfully carried 30-year-old Phyu Lay Khaing to safety on a stretcher."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Myanmar, a rescue operation successfully saved 30-year-old Phyu Lay Khaing. She was carried to safety on a stretcher, receiving applause from onlookers."
  },
  {
    "title": "'We told each other to run': Survivors recount Bangkok building collapse",
    "domain": "General",
    "location": "Global",
    "published": "Sat, 29 Mar 2025 09:17:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A 33-storey building under construction collapsed on Friday following a powerful earthquake in neighboring Myanmar, leaving dozens of people unaccounted for."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A 33-storey building under construction collapsed on Friday due to a powerful earthquake in neighboring Myanmar, resulting in dozens of people missing."
  },
  {
    "title": "Researchers identify mutations that can lead to resistance to some chemotherapies",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 20:10:46 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that mutations in VPS35, a component involved in a pathway that uses reactive oxygen species (ROS) to eliminate cancer cells, can lead to resistance against chemotherapy treatments. This finding could aid in identifying tumors that are resistant to treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found mutations in VPS35, a part of the pathway that uses reactive oxygen species (ROS) to kill cancer cells, can cause resistance to chemotherapy. This discovery may help identify tumors that won't respond to treatment."
  },
  {
    "title": "Discrimination-related depression, anxiety pronounced among multiracial, White, Asian populations",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:32 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study revealed that over 50% of US adults have faced discrimination, significantly impacting mental health. Those highly exposed to discrimination are over five times more likely to show signs of depression and anxiety. Additionally, individuals experiencing discrimination are nearly nine times more likely to test positive for both conditions compared to those who haven't faced such treatment."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study found that over half of US adults have experienced discrimination, which greatly affects their mental health. Those facing high levels of discrimination are more than five times likely to exhibit depression and anxiety symptoms. Furthermore, people who have encountered discrimination are almost nine times more likely to have both depression and anxiety than those who have not."
  },
  {
    "title": "Meniscus injuries may soon be treated by customizable hydrogel",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:18 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new customizable hydrogel, created using 3D printing, showed promising results in preclinical trials for treating various types of meniscal tears."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a new hydrogel using 3D printing technology that has shown potential in preclinical trials for repairing different types of meniscal tears."
  },
  {
    "title": "Cold plunges actually change your cells",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:35:16 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study finds that immersing in cold water for seven days can improve cellular resilience and autophagic function, aiding in stress management at the cellular level. This adaptation may boost health, prevent diseases, and slow aging."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study has discovered that taking cold water immersions for seven days can enhance cellular resilience and autophagic function, which helps cells manage stress better. This process could potentially improve overall health, prevent diseases, and decelerate the aging process."
  },
  {
    "title": "Researchers develop new DNA test for personalized treatment of bacterial vaginosis",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:55 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Approximately one-third of women aged 14-49 in the U.S. experience bacterial vaginosis (BV), marked by odors and discomfort, with over half not responding to initial antibiotic treatment. Researchers have now created a DNA PCR-based lab test for a more precise diagnosis, aiming to improve treatment by targeting the specific bacteria responsible for the infection."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have developed a DNA PCR-based lab test for bacterial vaginosis, a condition affecting about one-third of U.S. women aged 14-49, characterized by odors and discomfort. This new test aims for a more accurate diagnosis by identifying the specific bacteria causing the infection, addressing the issue that over half of the affected women do not respond to initial antibiotic treatments."
  },
  {
    "title": "Why scientists are worried about weasels",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:50 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that red meat, enhanced with scent oils, is the most effective bait for capturing weasels on camera traps. This finding is significant for conservationists who struggle to monitor weasel populations due to their elusive nature."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have found that red meat laced with scent oils is the best bait for photographing weasels with camera traps. This discovery is important for conservationists working to track the difficult-to-observe weasel populations."
  },
  {
    "title": "Artificial neurons organize themselves",
    "domain": "Science",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 17:29:44 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed novel artificial neurons that can learn independently, closely resembling their biological counterparts. These \"infomorphic neurons\" have been used to create artificial neural networks that learn in a self-organized manner, extracting information directly from their surroundings within the network."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created \"infomorphic neurons,\" a type of artificial neuron that mimics biological ones by learning independently. These neurons are used in artificial neural networks, enabling them to learn self-organized patterns and extract information directly from their environment."
  },
  {
    "title": "Yankees slug 8 HRs, 4 in 1st inning off Cortes",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:22 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees hit eight home runs in a game against the Brewers, with four of those homers coming off pitcher Nestor Cortes in the first inning of the Saturday game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees achieved eight home runs in a single game against the Brewers, setting a notable performance. Remarkably, four of these home runs were scored off pitcher Nestor Cortes during the first inning of the Saturday match."
  },
  {
    "title": "Van Lith's 26-point day leads TCU past N. Dame",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hailey Van Lith scored 26 points for TCU, leading the Horned Frogs to a 71-62 victory over Notre Dame in the Sweet 16 round of the women's NCAA Tournament."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hailey Van Lith scored 26 points, leading TCU to a 71-62 win over Notre Dame in the Sweet 16 of the women's NCAA Tournament."
  },
  {
    "title": "Grizz GM: No player input on call to fire Jenkins",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Grizzlies General Manager Zach Kleiman confirmed he did not consult any team members before deciding to dismiss Taylor Jenkins from his position as head coach."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Grizzlies General Manager Zach Kleiman announced that he made the decision to fire Taylor Jenkins as the team's head coach without consulting any team members."
  },
  {
    "title": "St. John's Luis entering NBA draft, transfer portal",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "RJ Luis Jr., the Big East Player of the Year from St. John's, is declaring for the NBA draft and entering the transfer portal, according to his agent's statement to ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "RJ Luis Jr., the Big East Player of the Year from St. John's, is declaring for the NBA draft and also entering the transfer portal, as confirmed by his agent to ESPN."
  },
  {
    "title": "Paopao: South Carolina should be 'punching first'",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:22 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "South Carolina guard Te-Hina Paopao emphasized the importance of the team initiating strong starts, advocating for a proactive approach in their Elite Eight game against Duke, highlighting the need to \"punch first\" to avoid slow beginnings."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "South Carolina guard Te-Hina Paopao stressed the significance of the team having strong starts in their Elite Eight game against Duke. She advocated for a proactive strategy, emphasizing the need to \"punch first\" to prevent slow openings in the game."
  },
  {
    "title": "Kim wins halfpipe gold at snowboard worlds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "American snowboarder Chloe Kim and Australian snowboarder Scotty James secured gold medals in the halfpipe event at the world championships."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "American snowboarder Chloe Kim and Australian snowboarder Scotty James won gold medals in the halfpipe event at the world championships."
  },
  {
    "title": "Bills, CB Benford agree to 4-year, $76M extension",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:24 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Buffalo Bills have signed cornerback Christian Benford to a four-year contract extension worth $76 million, according to his agents and reported by ESPN's Adam Schefter."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Buffalo Bills have extended cornerback Christian Benford's contract for four years at a value of $76 million, as confirmed by his agents and reported by ESPN's Adam Schefter."
  },
  {
    "title": "2-time WNBA MVP Stewart re-signs with Liberty",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:50:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Breanna Stewart has re-signed with the Liberty, following her pivotal role in leading the team to its first WNBA championship last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Breanna Stewart has re-signed with the New York Liberty after playing a key role in winning the team's first WNBA championship last year."
  },
  {
    "title": "Your guide to the final men's Sweet 16 games: Game winners, keys to the Elite Eight",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:36:59 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Friday night, Auburn and Houston secured victories in their respective games. The event was followed by detailed analysis of both teams' performances, highlighting key moments and strategies that led to their wins."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "On Friday night, Auburn and Houston both won their games. Post-game analyses focused on the strategies and key moments that contributed to their victories."
  },
  {
    "title": "Your guide to the women's Sweet 16: Pair of 1-seeds advance, Morrow and Betts star",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:38:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The women's NCAA tournament has progressed to the Sweet 16 stage, where the first four games have been played. This phase of the tournament is a key milestone in determining the top teams that will move closer to the championship."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The women's NCAA tournament has reached the Sweet 16 stage, with the first four games completed. This crucial phase helps identify the leading teams advancing towards the championship."
  },
  {
    "title": "Follow live: Yankees having home run party",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:54:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm sorry, but it seems like there was no content provided for me to summarize. Could you please share the news content you'd like summarized?"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "As no specific news content was provided, there is no information available to summarize. Please provide the content or details of the news you would like summarized."
  },
  {
    "title": "NHL playoff watch: Guide to a pivotal 11-game Saturday",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This report provides an overview of the current status in sports, detailing the implications of upcoming matchups, updated playoff projections, draft lottery standings, and additional relevant information."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This report offers an update on the sports sector, focusing on the consequences of forthcoming games, revised playoff forecasts, draft lottery positions, and other pertinent details."
  },
  {
    "title": "NHL Power Rankings: Latest updated poll, plus each team's strength of schedule",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 12:16:23 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The playoff field is becoming clearer as a panel has cast their votes, detailing team rankings and their schedules up to April 17."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The playoff field's details have been outlined as a panel voted on team rankings and schedules, extending through April 17."
  },
  {
    "title": "Forecasting next season for women's eliminated top seeds",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:09:30 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "NC State's team has been eliminated from their current competition. Looking forward, the focus shifts to assessing portal priorities and integrating incoming recruits in preparation for the Wolfpack's next season."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NC State's team was knocked out of their recent competition. The team is now concentrating on evaluating their needs through the transfer portal and incorporating new recruits to strengthen the squad for the upcoming season."
  },
  {
    "title": "Women's tournament: Saturday and Sunday betting odds, lines, spread",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 09:32:03 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Betting information for every game of the Women's tournament, including lines, spreads, totals, and BPI, has been released."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Betting details for every match of the Women's tournament have been made available, covering lines, spreads, totals, and Basketball Power Index (BPI) data."
  },
  {
    "title": "Inside the unprecedented transformation of Steinbrenner Field",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:40:01 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yankees' spring training facility was transformed into the Rays' ballpark for Opening Day in just four days. This rapid conversion demonstrates significant logistical and operational efficiency in preparing the venue for a major league game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The Yankees' spring training facility was quickly turned into the Rays' ballpark for Opening Day within four days, showcasing a high level of logistical and operational efficiency in getting the venue ready for a major league baseball game."
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 01:37:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All teams in the UFL aim to challenge Birmingham's leading position in the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Every team in the UFL is working to compete against Birmingham, which currently holds the top spot in the league."
  },
  {
    "title": "Palace book Wembley trip with win over Fulham",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:36:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eberechi Eze scored a goal and provided an assist in Crystal Palace's 3-0 victory over Fulham, securing their spot in the FA Cup semifinals. The match took place on Saturday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Eberechi Eze scored a goal and assisted another in Crystal Palace's 3-0 win against Fulham on Saturday, advancing them to the FA Cup semifinals."
  },
  {
    "title": "Ex-Timber awarded $20M in malpractice lawsuit",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:35:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, receiving an award of over $20 million from a jury."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former New Zealand soccer player Jake Gleeson won a medical malpractice lawsuit against Portland Timbers' team doctor, Richard H. Edelson, and was awarded over $20 million by a jury."
  },
  {
    "title": "Bayern hold off St. Pauli, keep title tilt on track",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:35:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leroy Sane scored two goals in the second half, leading Bayern Munich to a 3-2 victory against St Pauli on Saturday. Despite the challenge, Bayern Munich, the Bundesliga leaders, secured the win."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Leroy Sane scored twice in the second half to help Bayern Munich win 3-2 against St Pauli on Saturday. With this victory, the Bundesliga leaders overcame a tough challenge to secure the win."
  },
  {
    "title": "Azpilicueta scores stunner in Atlético draw",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:35:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Espanyol and Atletico Madrid drew 1-1 in LaLiga on Saturday. Cesar Azpilicueta scored for Atletico Madrid in the first half, but Javi Puado's penalty equalized for relegation-threatened Espanyol."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Espanyol and Atletico Madrid ended in a 1-1 draw in LaLiga on Saturday. Cesar Azpilicueta scored for Atletico Madrid in the first half. Javi Puado later equalized for Espanyol with a penalty, as the team fights against relegation."
  },
  {
    "title": "Newcastle throw open-top bus parade for cup win",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:36:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Newcastle celebrated their first major domestic trophy in 70 years with an open-top bus parade through the city."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Newcastle marked their achievement of winning their first major domestic trophy in 70 years by holding an open-top bus parade through the city."
  },
  {
    "title": "Brazil fires coach Dorival after loss to Argentina",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:35:50 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Brazil's Football Confederation (CBF) announced on Friday that it has dismissed head coach Dorival Júnior after the team's loss to Argentina on Tuesday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Brazil's Football Confederation (CBF) terminated the contract of head coach Dorival Júnior following the team's defeat to Argentina on Tuesday."
  },
  {
    "title": "Mateta wears protective cap on Palace return",
    "domain": "Sports",
    "location": "National",
    "published": "Sat, 29 Mar 2025 15:35:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jean-Philippe Mateta returned to Crystal Palace's starting lineup on Saturday for the first time since his ear was significantly injured."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Jean-Philippe Mateta played for Crystal Palace on Saturday, marking his first game back since suffering a major ear injury."
  }
]