[
  {
    "title": "Raducanu Retires from Wuhan Open Match; Alexandrova Defeats Mboko",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 07:52:01 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "British number one Emma Raducanu looks devoid of energy and appears to struggle with the hot and humid conditions before retiring in China.",
      "<ul><li><p>World No 30 struggled throughout match against Ann Li</p></li><li><p>Raducanu retired trailing 6-1, 4-1 after a medical timeout</p></li></ul><p>A listless Emma Raducanu retired from her first-round match at the Wuhan Open against Ann Li after struggling throughout the match on a stiflingl",
      "Emma Raducanu retired from her first-round match at the Wuhan Open against Ann Li as she appeared to struggle with the humid conditions.",
      "<p>Canada&#8217;s Victoria Mboko is out of the Wuhan Open tennis tournament after a 6-3, 6-2 loss to Russia&#8217;s Ekaterina Alexandrova on Monday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/185e/live/8240b260-a34e-11f0-9a02-114bd53bb5d7.jpg",
    "titles": [
      "Raducanu retires in first round of Wuhan Open",
      "Listless Raducanu retires from first-round match at stiflingly hot Wuhan Open",
      "Raducanu retires from Wuhan Open first round",
      "Canada’s Mboko, Fernandez eliminated in first round of Wuhan Open"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.973,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Emma Raducanu retired from her Wuhan Open first-round match against Ann Li, trailing 6-1, 4-1, after struggling with hot and humid conditions and taking a medical timeout. The British number one looked devoid of energy throughout the match. In another match, Canada's Victoria Mboko was defeated by Russia's Ekaterina Alexandrova with scores of 6-3, 6-2.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lawrence's Last-Minute TD Lifts Jaguars to 31-28 Win Over Chiefs",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 07:21:34 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Quarterback Trevor Lawrence scores a one-yard touchdown with 23 seconds left to give the Jacksonville Jaguars a dramatic win over the Kansas City Chiefs.",
      "Quarterback Trevor Lawrence scores a one-yard touchdown with 23 seconds left to give the Jacksonville Jaguars a dramatic win over the Kansas City Chiefs.",
      "Trevor Lawrence tripped and fell to the ground, stumbled trying to get up, finally got back on his feet and then scrambled for a one-yard touchdown with 23 seconds left to lift the Jacksonville Jaguars to a 31-28 win over the Kansas City Chiefs on Monday night.&#160;"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e966/live/56465980-a344-11f0-b7cd-65ba7d624d13.jpg",
    "titles": [
      "Late Lawrence touchdown for Jaguars as Chiefs lose again",
      "Late Lawrence touchdown for Jaguars stuns Chiefs",
      "Jags beat Chiefs after Lawrence's comical late touchdown"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.962,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Quarterback Trevor Lawrence scored a one-yard touchdown with 23 seconds remaining, leading the Jacksonville Jaguars to a 31-28 victory over the Kansas City Chiefs. Lawrence's touchdown, achieved after he stumbled and fell, then recovered, secured a dramatic win for the Jaguars on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Champions League Season Begins with New Format and Focus on Women's Game",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T09:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Financial Post",
      "Deutsche Welle",
      "Yahoo Sports"
    ],
    "domains": [
      "www.dw.com",
      "www.sportingnews.com",
      "www.theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "The new Champions League season is here with a new format, new rising stars and a big challenge for Bayern Munich.",
      "Arsenal vs. Lyon kickoff time: Here’s how to watch the Women's Champions League match on TV and live stream. The Sporting News takes you through all the information you need to follow the game",
      "<p>As the new league phase kicks off we look at what to expect from a tournament full of even more European club talent</p><p>Four years after the introduction of a group stage to bring the Women’s Champions League in line with the men’s competition, change is afoot again with a new 18-team league p",
      "AMSTERDAM, Oct. 07, 2025 (GLOBE NEWSWIRE) &#8212; Heineken® and UC3 are proud to announce the renewal of Heineken®’s partnership with the UEFA Women’s Champions League, extending the agreement until June 2030. Heineken® has renewed its role as official partner of the UEFA Women’s Champions League fo"
    ],
    "image_url": "",
    "titles": [
      "What to know about the 2025-26 Women's Champions League",
      "Where to watch Arsenal vs. Lyon live stream, TV channel, start time for Women's Champions League match",
      "Revamped Women’s Champions League: what has changed and who will win it?",
      "Heineken® extends partnership with UEFA Women’s Champions League until 2030"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.617,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The new Champions League season has started, featuring a new format and emerging talents, with a focus on the Women's Champions League. Arsenal and Lyon are set to play, with details on how to watch provided by The Sporting News. The tournament, now with a 18-team league phase, aims to showcase more European club talent. Additionally, Heineken® has renewed its partnership with the UEFA Women’s Champions League until June 2030, continuing its support for the competition.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Shutdown Enters Second Week; Negotiations Ongoing",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-07T02:09:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Forbes",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Democrats and Republicans traded blame for the ongoing shutdown as the Senate rejected two proposals to fund the federal government.",
      "<p>Competing bills fail to pass 60-vote threshold, while Trump hints at possible deal with Democrats over health subsidies </p><p>The US government shutdown entered its second week as the Senate again rejected rival bills to restart funding and Donald Trump suggested he might be open to negotiating ",
      "The government shut down began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "US in shutdown impasse as Senate again rejects funding bill",
      "US shutdown enters second week as Senate again rejects rival funding bills",
      "Government Shutdown: Deadlocked Senate Again Fails To Pass Funding Bills As Shutdown Hits Week 2"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.881,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US government shutdown extended into its second week after the Senate failed to pass both Democratic and Republican funding bills. Negotiations continue as President Trump hints at a possible compromise involving health subsidies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ICC Convicts Janjaweed Leader of War Crimes in Darfur",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:05:55 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "The International Criminal Court in The Hague handed down its first-ever Darfur war crimes conviction, finding Janjaweed leader Ali Kushayb, guilty of atrocities committed more than two decades ago.",
      "For the first time, the ICC has found a militia leader guilty of war crimes committed in Sudan's Darfur region more than 20 years ago.",
      "<p>Janjaweed commander Ali Muhammad Ali Abd-al-Rahman, known as Ali Kushayb, found guilty over atrocities</p><p>The international criminal court has convicted a leader of the Janjaweed militia of playing a leading role in a campaign of atrocities committed in the Sudanese region of Darfur more than "
    ],
    "image_url": "",
    "titles": [
      "ICC finds former Sudan militia leader guilty of war crimes in Darfur",
      "Darfur militia leader convicted by ICC for war crimes",
      "ICC convicts former Sudan militia leader for war crimes in Darfur"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.761,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The International Criminal Court (ICC) has convicted Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman, known as Ali Kushayb, of war crimes in Sudan's Darfur region, marking the court's first conviction for crimes in this area. Abd-Al-Rahman was found guilty on 27 counts of war crimes committed over 20 years ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Deports 10 More to Eswatini Amid Human Rights Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:31:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Trump administration continues to send individuals to countries where they have no ties amid mass deportation push.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE51Y3ozUTlFV25zWEtiNmlNbDMyS05wdk1QZHJ5ZUp2NTJyOGc3TWJ2ZE5IT1RGYWxPeW5CbklNU3dJaFhJT1JnYVZ1NHVueVVPbk9BZ1VtUzNfOWgwZ1ZadTh5RDBudVU?oc=5\" target=\"_blank\">10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement</",
      "<p>African kingdom receives second group of third-country nationals in what NGOs and lawyers say is violation of human rights</p><p>Ten people deported by the US have arrived in Eswatini, its government said, the second group of third-country deportees to be sent to the southern African kingdom by t"
    ],
    "image_url": "",
    "titles": [
      "US sends another ‘third-country’ deportation flight to Eswatini",
      "10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement - Axios",
      "Eswatini confirms arrival of 10 more people as part of US deportation deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.817,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. has deported ten more individuals to Eswatini as part of its third-country deportation policy, despite criticisms from NGOs and lawyers who argue this violates human rights. This marks the second instance of deportees with no ties to the African kingdom being sent there, following an agreement between the U.S. and Eswatini.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Harry Kane Open to New Contract Talks with Bayern, Less Keen on Premier League R",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:00:58 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.independent.co.uk",
      "bulinews.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Harry Kane says his interest in returning to the Premier League has cooled and he is willing to open talks with Bayern Munich over a new contract.",
      "New Tottenham manager Thomas Frank has offered a way back for the England captain but the likelihood of a return to the Premier League is diminishing",
      "With Harry Kane’s contract running until 2027 and reportedly containing a €65 million release clause for next year, speculation has arisen about a potential return to the English Premier League in...",
      "Harry Kane has revealed that his desire to play in the Premier League again has cooled, as he suggested he is open to extending his Bayern Munich stay."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8504/live/d1758290-a2f2-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "'I'm fully all in with Bayern' - Kane cools on Premier League return",
      "Harry Kane ‘all in’ for Bayern Munich as England captain shares stance on potential Premier League return",
      "&quot;I am fully all in with Bayern&quot; – Harry Kane discusses possible Premier League return",
      "Kane open to new Bayern deal as he dampens Premier League return talk"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.792,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Harry Kane has expressed a diminished interest in returning to the Premier League, indicating openness to discussing a new contract with Bayern Munich. His current deal with the German club is set to expire in 2027, and he sees potential for an extended stay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ghislaine Maxwell's Supreme Court Appeal Declined, Transferred to Texas Camp",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 21:08:14 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE10cURkM1huYWlic0RVWWJVQ0F1ZUprbUYzdkE3Y0VhTUZSR04yV2s4Y0hoWHlvMU9aWkRabVdpTzNxc1h0N05SUGphQUxEUEh2azBRRUFhb2xrYmY5SHBUYkFoUzYxTmthQjhyTV9nejE5OUNBZ0JsZzhNSUQ?oc=5\" target=\"_blank\">Supreme Court rejects Epstein associate Ghislaine Maxwell's ",
      "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.",
      "Ghislaine Maxwell, the convicted procurer of Jeffrey Epstein, may now focus efforts to get a pardon or sentence commutation from President Donald Trump."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court rejects Epstein associate Ghislaine Maxwell's appeal - Axios",
      "WATCH:  Supreme Court denies Ghislaine Maxwell appeal",
      "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ghislaine Maxwell, associated with Jeffrey Epstein, is serving a 20-year sentence for sex trafficking and related crimes as of 2022. Her appeal to the US Supreme Court was declined. Maxwell attempted to argue her indictment was invalid due to Epstein's 2007 non-prosecution agreement. Recently, she was transferred from a low-security prison in Florida to a minimum-security camp in Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers Beat Phillies 4-3 in NLDS Game 2, Snell Dominates",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 02:11:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "With a dominant effort from Blake Snell, a well-executed wheel play and one fortuitous scoop from Freddie Freeman for the final out, the Los Angeles Dodgers escaped with a 4-3 victory over the Philadelphia Phillies on Monday in Game 2 of the NLDS.",
      "<p>Blake Snell stuck out nine over six shutout innings of one-hit ball for the Dodgers before relievers Alex Vesia and Roki Sasaki thwarted Philadelphia&#8217;s ninth-inning rally, sending Los Angeles to a 4-3 victory over the Phillies in Game 2 of their NL Division Series on Monday night.</p>",
      "<p>Andrew Vaughn and Jackson Chourio each hit a three-run homer, William Contreras added a solo shot and the Milwaukee Brewers beat the Chicago Cubs 7-3 on Monday night to move one win from a trip to the National League Championship Series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dodgers spin wheel play into win, 2-0 NLDS lead",
      "Dodgers’ bullpen holds off Phillies for commanding 2-0 lead in NLDS",
      "Misiorowski-led bullpen leads Brewers past Cubs for 2-0 lead in NLDS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Los Angeles Dodgers won 4-3 against the Philadelphia Phillies in Game 2 of the NLDS, thanks to Blake Snell's six shutout innings with nine strikeouts and one hit allowed. Key defensive plays and effective relief pitching from Alex Vesia and Roki Sasaki halted a late Phillies rally, securing the Dodgers' victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Omarion Hampton on Injured Reserve, Haskins and Vidal to Step Up",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 02:11:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Chargers starting running back Omarion Hampton will be placed on injured reserve due to an ankle injury, coach Jim Harbaugh said Monday.",
      "Hassan Haskins and Kimani Vidal are next up in the Chargers' backfield"
    ],
    "image_url": "",
    "titles": [
      "Chargers placing top RB Hampton (ankle) on IR",
      "Omarion Hampton injury update: Chargers RB (ankle) joins Najee Harris on IR, will miss at least four games"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Los Angeles Chargers' starting running back, Omarion Hampton, has been placed on injured reserve due to an ankle injury, as announced by coach Jim Harbaugh. Hassan Haskins and Kimani Vidal are set to take over duties in the Chargers' backfield following Hampton's injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Charged With Felony Battery After Altercation in Indianapolis",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 02:11:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mark Sanchez is facing a felony battery charge over the altercation between the former NFL quarterback and a 69-year-old truck driver early Saturday in Indianapolis.",
      "<p>Former NFL quarterback Mark Sanchez is now facing a felony charge of battery involving serious bodily injury in addition to the misdemeanor charges stemming from a weekend incident in Indianapolis that led to his arrest.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sanchez now facing felony charge for altercation",
      "Former NFL QB Mark Sanchez facing felony charge in Indianapolis altercation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports commentator Mark Sanchez has been charged with felony battery following an altercation with a 69-year-old truck driver in Indianapolis early Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bills' Keon Coleman Benched for Discipline, Coach Seeks Consistency",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 02:11:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series of Sunday night's loss to the New England Patriots for \"discipline,\" head coach Sean McDermott said Monday.",
      "McDermott wants to see 'more consistency' from the second-year wideout"
    ],
    "image_url": "",
    "titles": [
      "Bills benched WR Coleman for disciplinary reasons",
      "Bills benched Keon Coleman for first series vs. Patriots due to disciplinary reasons, Sean McDermott reveals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series during Sunday night's game against the New England Patriots as a disciplinary action, according to head coach Sean McDermott. McDermott emphasized the need for \"more consistency\" from the second-year player.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T09:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New Scientist",
      "Deutsche Welle",
      "Ars Technica"
    ],
    "domains": [
      "www.dw.com",
      "arstechnica.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control",
      "Their work revealed a peripheral mechanism that keeps immune system from causing harm."
    ],
    "image_url": "",
    "titles": [
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance",
      "Discovery of cells that keep immune responses in check wins medicine Nobel Prize"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.628,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Chief Named IRS CEO in Major Leadership Shift",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 01:49:33 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Social Security Administration Commissioner Frank Bisignano was named to the newly created position of CEO of the IRS on Monday, making him the latest member of the Trump administration to be put in charge of multiple federal agencies.",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1xMHpJeXhtOHM1YXpzNjVRSk9ibVZTT25WMTc5MkJxNjJEXzZVSTFLSjNFRXVlY3JZbS1Eb3RrWkh5c183cTVkNC1LWkNkdzhTTG5oQXlnZTN2S0NZZU1sLWRRMkUyamlQS2JrUA?oc=5\" target=\"_blank\">Social Security chief to be IRS CEO</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f"
    ],
    "image_url": "",
    "titles": [
      "Social Security administrator is named to the newly created position of IRS CEO",
      "Social Security chief to be IRS CEO - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Social Security chief has been appointed as the IRS CEO, a position that does not require Senate confirmation. This move marks a significant leadership change within two major U.S. government agencies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel-Hamas Negotiations Begin in Egypt Amid Mourning",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 06:31:54 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.co.uk",
      "www.bbc.com"
    ],
    "snippets": [
      "Negotiators from Israel and Hamas are heading to Sharm El-Sheikh, Egypt, to start indirect talks about ending the Israel-Gaza war.",
      "Trump urges mediators to “move fast” as key Gaza talks begin.",
      "As Israelis brace for a day of mourning and commemoration, negotiators for Israel and Hamas met with mediators in Egypt to hash out an end to the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a650/live/54b668f0-a2bb-11f0-b2c5-019105d9c0cd.jpg",
    "titles": [
      "What are the key sticking points in Trump's Gaza peace plan?",
      "Will Trump’s Gaza Peace Plan Work?",
      "Israel and Hamas Meet in Egypt to Discuss Gaza Peace Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.946,
      "consensus": 0.611,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Negotiators from Israel and Hamas have begun indirect talks in Sharm El-Sheikh, Egypt, aimed at ending the Israel-Gaza war. The talks, urged by Trump to proceed quickly, coincide with a day of mourning in Israel. The negotiations are facilitated by mediators in an effort to reach a resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Victims of October 7 Attacks Remembered; Peace Talks Underway in Egypt",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-07T06:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Friends and relatives gathered at the Nova music festival site to mourn the loved ones they lost in the October 7 attacks two years ago. In Egypt, talks on Trump's 20-point plan are ongoing. DW has more.",
      "The second anniversary of the Oct. 7 attacks comes with peace talks underway, but with hostages still in Gaza, more than 67,000 Palestinians dead and Israel more isolated than ever before."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Israel marks October 7 anniversary",
      "Israel Marks Two-Year Anniversary of Oct. 7 in Subdued Fashion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the second anniversary of the October 7 attacks, friends and relatives commemorated victims at the Nova music festival site. Concurrently, peace talks related to Trump's 20-point plan are happening in Egypt, amidst a backdrop of ongoing hostage situations in Gaza, over 67,000 Palestinian deaths, and increased isolation for Israel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Consulting Firm to Refund for Report Errors, Admits Using GPT-4o",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 07:15:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "financialpost.com"
    ],
    "snippets": [
      "MELBOURNE, Australia (AP) &#8212; Deloitte Australia will partially refund the 440,000 Australian dollars ($290,000) paid by the Australian government for a report that was littered with apparent AI-generated errors, including a fabricated quote from a federal court judgment and references to nonexi",
      "Consulting firm quietly admitted to GPT-4o use after fake citations were found in August."
    ],
    "image_url": "",
    "titles": [
      "Deloitte to partially refund Australian government for report with apparent AI-generated errors",
      "Deloitte will refund Australian government for AI hallucination-filled report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A consulting firm will issue a partial refund due to multiple errors, including fake citations, found in a compliance framework report. The errors were acknowledged after the firm admitted to using GPT-4o in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Mulls Long-Range Missiles, Denmark Ups Oil Tanker Inspections",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 05:10:01 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9LeUp1TTBtc0J2Uk1XLWxwUWpTWjJuSGQwYU9vQ3V3ejdvNWtiU0R1bTUxZ1RmNlFTSmhPOFk3UDBUZEdMbXB0MVFQVWc5ckQ1SlJKdUo1a0Z4el94TmtVUTAtUU40eUNoSUlGdlhBdnBGYkROU2hJODU2UQ?oc=5\" target=\"_blank\">Trump says he's \"sort of made a decision\" on supplying Tomaha",
      "<p>US president says he has ‘sort of made a decision’ on whether to supply long-range missiles; Denmark to step up checks on oil tankers after drone sightings. What we know on day 1,322</p><ul><li><p><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></p></li></u"
    ],
    "image_url": "",
    "titles": [
      "Trump says he's \"sort of made a decision\" on supplying Tomahawk missiles to Ukraine - Axios",
      "Ukraine war briefing: Trump says he would want to know Kyiv’s plans for Tomahawk missiles before supplying them"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President has indicated a tentative decision regarding the provision of long-range missiles, coinciding with Denmark's announcement to increase inspections on oil tankers following drone sightings. This development is part of the ongoing Ukraine war context, now in its 1,322nd day. Further details on the President's stance or the specifics of Denmark's security measures were not disclosed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Talks with Democrats Post-Shutdown; Asserts Authority in Portland Crackdo",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 03:11:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.latimes.com"
    ],
    "snippets": [
      "US President Donald Trump says Democrats must end the shutdown before talks can start after six days of gridlock.",
      "<p>Miller's rhetoric comes amid a federal crackdown on Portland, Ore., where he says the president has unchecked authority to protect federal lives and property.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump walks back offer to talk to Democrats as government shutdown extends",
      "Trump advisors amp up extreme rhetoric against Democrats during government shutdown, immigration raids"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump stated that discussions with Democrats would only begin after the shutdown ends, amidst a six-day gridlock. Concurrently, amid a federal crackdown in Portland, Oregon, Miller emphasized the president's authority to safeguard federal lives and property.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shadow Justice Secretary to Challenge Conservative Leader Badenoch",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 07:46:42 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Shadow justice secretary is widely seen as the favourite to challenge Conservative leader Kemi Badenoch",
      "<p>Conservative leader suggests remarks in Guardian report could have been taken out of context and he was ‘making an observation’</p><p>Asked about the Jenrick story, <strong>Badenoch</strong> again suggests Guardian reporting is reliable.</p><p><em>Q: Jenrick was making a distinction between white"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa5ff8b29-f3f3-41ba-97f8-680fe9650903.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Jenrick defends ‘didn’t see another white face’ comment",
      "Badenoch defends Jenrick over comments that he ‘did not see another white face’ in Birmingham – UK politics live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The shadow justice secretary is considered the leading candidate to challenge Conservative leader Kemi Badenoch. Badenoch suggested comments reported by the Guardian might be out of context, stating they were observational. When questioned about the Jenrick story, Badenoch affirmed the reliability of the Guardian's reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel, Hamas Show Optimism in Egypt Talks on US Ceasefire Proposal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 01:51:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Sources familiar with the talks say there was progress on Monday, and negotiations will continue on Tuesday.",
      "<p>Hamas’s acceptance of key conditions of deal galvanises momentum but large gaps remain between camps</p><p>Israel and Hamas have begun indirect talks in Egypt on a US ceasefire proposal amid cautious optimism that the nearly two-year war in Gaza may be nearing its end, despite deep divisions betw"
    ],
    "image_url": "",
    "titles": [
      "Day one of Israel and Hamas indirect talks ends on ‘positive’ note in Egypt",
      "Israel and Hamas begin indirect talks as hopes rise of ending Gaza war"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel and Hamas, engaged in indirect talks in Egypt regarding a US ceasefire proposal, show cautious optimism toward ending the nearly two-year conflict in Gaza. Progress was made in negotiations, with Hamas accepting key deal conditions, yet significant differences remain. Talks are set to continue, signaling a possible approach towards resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas Takes 2-0 Lead in Best-of-Seven Finals Series",
    "domain": "business",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:13:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "Las Vegas has a 2-0 lead in the best-of-seven Finals series. Here's how it happened.",
      "A'ja Wilson and Jackie Young combined for 60 points to give the Aces the edge in the best-of-seven WNBA Finals series"
    ],
    "image_url": "",
    "titles": [
      "Your guide to the Aces going up 2-0 against the Mercury in the 2025 WNBA Finals",
      "Aces Cruise Past Mercury In Game 2 Of The WNBA Finals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.633,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Las Vegas has a 2-0 lead in the best-of-seven Finals series. Here's how it happened.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paramount Skydance Acquires The Free Press for $150M",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 20:11:57 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOMFB6eHNlOTdvV1NnV2tueE9QOW9VRTlBcnctbnZfX1hNQURLQ0JJbFJ4RXFkTUJEUDJ0NlI5VXlIQWM3UW5Ic2FsM3RMUExuNVNoYk9UQTBQSkNpcW4yRVZsa1JFUUtmMWgxeG1kYWgzMk5HTGtJT21BN2FRTGdzYw?oc=5\" target=\"_blank\">Paramount Skydance acquires The Free Press for $150M<",
      "Paramount Skydance has agreed to acquire online publication The Free Press, founded by Bari Weiss."
    ],
    "image_url": "",
    "titles": [
      "Paramount Skydance acquires The Free Press for $150M - Axios",
      "Paramount Skydance to acquire Bari Weiss-founded Free Press"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paramount Skydance has purchased The Free Press for $150 million. The online publication was founded by Bari Weiss. The acquisition marks a significant development in the media industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Enables App Creation Inside ChatGPT Conversations",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 18:54:57 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
      "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches new feature to integrate third-party apps - Axios",
      "OpenAI launches apps inside of ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.743,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI has introduced a feature allowing developers to create apps within ChatGPT conversations. This new integration aims to enhance user experience and functionality within the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Contest Judged by Celebrities Amid Payout Cuts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:00:45 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Winners will be chosen by a panel including Instagram chief Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs and YouTuber Marques Brownlee.",
      "The move comes as Meta has been scaling back its creator payout programs over the past few years."
    ],
    "image_url": "",
    "titles": [
      "Instagram will award top creators with a gold ring. But no cash",
      "Instagram introduces new ‘Ring’ award for top creators"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.685,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.592,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Meta has announced a competition with winners selected by a panel featuring Instagram's Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs, and YouTuber Marques Brownlee. This occurs as Meta reduces its creator payout programs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WWE Raw Builds Momentum for Crown Jewel with Key Matches",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 23:37:53 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "WWE Raw showcased its go-home episode before the Crown Jewel premium live event. Who stood out on Monday night?",
      "WWE Raw on Netflix results ahead of WWE Crown Jewel with winners and grades from the American Airlines Center on October 6, 2025."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e489e48963581ea6d5baaa/0x0.jpg?width=960",
    "titles": [
      "WWE Raw Results: Takeaways From October 6, 2025",
      "WWE Raw Results, Winners And Grades On October 6, 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.909,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The WWE Raw go-home episode before the Crown Jewel event aired on October 6, 2025, from the American Airlines Center. It featured matches and segments intended to build up storylines and momentum heading into the premium live event. Specific winners and match grades were provided, highlighting standout performances and setting the stage for Crown Jewel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]