[
  {
    "title": "James Comey Pleads Not Guilty to Lying to Congress, Trial Set for Jan 5",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 10:52:38 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "ABC News",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "news.google.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "The former FBI director, who has long been one of President Trump's most vocal critics, was indicted last month on two counts stemming from his testimony before the Senate Judiciary Committee in September 2020.",
      "Trump critic James Comey pleads not guilty to charges that he made false statements to Congress.",
      "The former FBI director is accused of lying to Congress. Comey's defense team had said the charges brought on by Trump's justice department are politically motivated and should be thrown out.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPcnZXUWR0bExjVmltdEE0LU1pd0pXWjBkV21uSkVfdXRIUHk4dE9jODBqemdmXzVOODNRSnppV2ZyeUZ0TC1mZkJkcXN6X0o0RVEyTHludnEtWTZmLW13S2RQdndCM1BlOHFiQlBncW0wMmMwSi1IMWUwb1RtV1J6N3RxTQ?oc=5\" target=\"_blank\">Comey pleads not guilty to charges from Trump's D",
      "Former FBI Director James Comey pleaded not guilty on Wednesday. He is charged with one count of false statements and one count of obstruction of a congressional proceeding."
    ],
    "image_url": "",
    "titles": [
      "Former FBI director Comey pleads not guilty to federal charges of lying to Congress",
      "Trump live: Ex-FBI chief Comey pleads not guilty",
      "Former-FBI director James Comey enters not guilty plea",
      "Comey pleads not guilty to charges from Trump's DOJ - Axios",
      "WATCH:  Ex-FBI Director James Comey pleads not guilty"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.893,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.843,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey, a critic of President Trump, pleaded not guilty to charges of making false statements to Congress during his 2020 testimony regarding the FBI's investigation into Russian election interference. His indictment and arraignment mark a significant development in what critics see as Trump's attempt to use the Justice Department against political adversaries. Comey's trial is scheduled for January 5. Reports suggest the case against Comey may lack strength.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attack on Manchester Synagogue on Holy Day Kills Two; Assailant Claims IS Ties",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 19:37:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Police confirm the attacker made the call after he crashed his car into a brick wall.",
      "Police said Jihad al-Shamie called emergency services to declare allegiance to armed group as he carried out the attack.",
      "Jihad al-Shamie, who attacked a Manchester synagogue on the holiest day of the Jewish calendar, called the emergency services during the attack to claim responsibility.",
      "<p>Police say Jihad al-Shamie made call to emergency services during attack that resulted in the deaths of two worshippers</p><p>The Manchester synagogue terrorist rang 999 during his deadly attack pledging allegiance to the terror group Islamic State, police have said.</p><p>Jihad al-Shamie, 35, ma"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a5fb/live/0efb21c0-a455-11f0-8a21-ff96e44d1cc2.jpg",
    "titles": [
      "Synagogue attacker pledged allegiance to 'Islamic State' in 999 call",
      "Manchester synagogue attacker claimed allegiance to ISIS, UK police say",
      "Manchester Synagogue Attacker Pledged Allegiance to ISIS, Police Say",
      "Manchester synagogue terrorist pledged allegiance to Islamic State in 999 call"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.966,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jihad al-Shamie attacked a Manchester synagogue on the Jewish calendar's holiest day, killing two worshippers. During the attack, he crashed his car into a brick wall, then called emergency services to claim responsibility and pledge allegiance to the Islamic State, according to police.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Joe Flacco Named Bengals' Starting QB for Week 6 Against Packers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 15:58:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "brownswire.usatoday.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Bengals will start newly acquired quarterback Joe Flacco this Sunday against the Packers, coach Zac Taylor announced Wednesday.",
      "Taylor went over the game plan with Flacco on the phone on his drive from Cleveland to Cincinnati",
      "Recently acquired Bengals quarterback Joe Flacco will officially become the teams starter in Week 6 against the Green Bay Packers."
    ],
    "image_url": "",
    "titles": [
      "Bengals to start Flacco at QB against Packers",
      "Joe Flacco to start against Packers: Bengals' Zac Taylor explains why veteran QB is best fit for Cincinnati",
      "Recently traded Browns QB Joe Flacco will start for the Bengals in Week 6"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Joe Flacco has been named the starting quarterback for the Cincinnati Bengals in their Week 6 game against the Green Bay Packers, as announced by coach Zac Taylor. Flacco, who was recently acquired by the Bengals, discussed the game plan with Taylor while traveling from Cleveland to Cincinnati.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Winnipeg Jets Sign Kyle Connor to $96M, Eight-Year Extension",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 15:58:47 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "NHL",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Winnipeg Jets have signed star forward Kyle Connor to an eight-year, $96 million extension, the team announced on Wednesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNYTBSYy1FTHpWemx3TVBHbU1qTEhNVS1EbFItd3RBN3FlVTMxOU1valNoTHpWWGQ0Ym8wVjhiYUhJcmJ2SHgzSENMcU9QT3RTRHBSek1rSEtYRUFYTHJ1SkEwbzFQU2tvcWhRWGtlbElKbnBoVkhEZDNoNkdYQUFrMDhFNENYSXIwX2ViNjR5Y2N2Z0dwN1RwVWE5RQ?oc=5\" target=\"_blank\">RELEASE: Jets sig",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQV0xLQ1l3TDRFN255SE1Qc0x2U0FiSWptNEJYNm5VLVVyWDc4OFBKRldHenVPU296TDJGak9UUm1iajhhMHRVeS1LQXVyV0pCR3dCb1dqVGdOQWpKQmVsUlNhNEFzMkJ5aEt0RkZSaXFBQW1UUERyYXJBY0VVSWotWkwwMERzWDR2d19nUQ?oc=5\" target=\"_blank\">Glendening Signs 1-Year Contract | RE",
      "<p>Sean Reynolds catches up with Winnipeg Jets&#8217; Kyle Connor after signing an eight-year extension with the organization to discuss what the deciding factors were for him and his close connections with his teammates and the city of Winnipeg.</p>",
      "<p>Everyone from members of the Jets organization to Kyle Connor himself must be happy with how things played out. As another core piece signs long-term, that stereotype that nobody wants to play in Winnipeg is evaporating fast.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jets lock up forward Connor with $96M extension",
      "RELEASE: Jets sign Connor to an eight-year contract extension - NHL.com",
      "Glendening Signs 1-Year Contract | RELEASE - NHL.com",
      "Why Connor decided to ink eight-year extension with Jets",
      "With Kyle Connor extension, ‘top-notch’ Jets lock up yet another core piece"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Winnipeg Jets have signed Kyle Connor, a star forward, to an eight-year, $96 million extension. The team announced this on Wednesday. The deal secures Connor's future with the Jets for a significant period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "IRS Furloughs Workers Amid Ongoing Government Shutdown",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:00:29 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The IRS furloughs came on the same day that the Senate again fell short of passing a funding resolution that would end the federal government shutdown.",
      "The Senate failed Wednesday to approve spending plans to reopen the government.",
      "Last week Trump said roughly 750,000 federal workers nationwide were expected to be furloughed across agencies, with some potentially fired."
    ],
    "image_url": "",
    "titles": [
      "IRS furloughs nearly half of its workforce due to government shutdown",
      "IRS Furloughs Nearly Half Of Its Staff Amid Government Shutdown",
      "IRS to furlough almost half its workforce under contingency plan for government shutdown"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The IRS furloughed employees as the Senate failed to pass a funding resolution, continuing the federal government shutdown. Despite efforts, no spending plans were approved to reopen the government. President Trump previously stated that about 750,000 federal workers could be furloughed or fired due to the shutdown.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man United Co-owner Backs Coach Amorim, Offers 3-Year Window to Prove Worth",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:08:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Manchester United co-owner Sir Jim Ratcliffe says manager Ruben Amorim needs three years to prove he is a \"great\" coach.",
      "<ul><li><p>Minority owner moves to clarify coach’s future</p></li><li><p>‘You can’t run a club like United on kneejerk reactions’</p></li></ul><p>Sir Jim Ratcliffe insists he will not take a “kneejerk” decision to sack Ruben Amorim and has indicated he will afford the head coach three years to demon",
      "Manchester United minority owner Sir Jim Ratcliffe has said he wants to give under-pressure head coach Ruben Amorim three years in the job to prove himself."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aed/live/3ebc1c60-a45b-11f0-bf2c-b564608f4fa4.jpg",
    "titles": [
      "Amorim needs three years at Man Utd - Ratcliffe",
      "Ratcliffe says Ruben Amorim has three years to prove himself at Manchester United",
      "Ratcliffe: I want to give Amorim three years to prove himself at Man Utd"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Manchester United co-owner Sir Jim Ratcliffe supports head coach Ruben Amorim, stating he will not make a \"kneejerk\" decision regarding his position. Ratcliffe emphasizes the importance of stability and has indicated Amorim will be given three years to demonstrate his capabilities and prove he is a \"great\" coach for the club.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Officials Split on Rate Cuts Amid Inflation Concerns",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 18:42:14 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE4tMnZYV3RzYmo1c0FVUUYwaEktTWl5ZlZ6VzlrT3lFb2lYRnc5SVRBWTg3OTlISEhnNXNud3BlMFhDNTZuN3p6NC1KV0JiUEtHdzR1UmZyNjRNQ29GRnE1QVAtUGg0MDNOaFNqRGpJQURkRXc3QjFZ?oc=5\" target=\"_blank\">Fed minutes show some officials cautious about recent rate cut</a>&",
      "Minutes from US central bank’s September meeting showed lingering concern about price pressures",
      "New projections released showed Fed officials expected two additional quarter-point cuts by year’s end"
    ],
    "image_url": "",
    "titles": [
      "Fed minutes show some officials cautious about recent rate cut - Axios",
      "Fed officials were cautious about inflation as they agreed rate cuts",
      "Fed minutes show caution over inflation even as officials cut rates"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Minutes from the US Federal Reserve's September meeting revealed that some officials were hesitant about the recent decision to cut rates, due to ongoing concerns about inflation. Despite this, new projections indicated that the Fed anticipates two more quarter-point rate reductions by the end of the year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolly Parton Debunks Health Rumors: \"I Ain't Dead Yet!\"",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:12:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The singer's sister had asked fans to pray for her after the star postponed gigs due to health issues.",
      "<p>Country music star shares buoyant video on social media after rumors swirl about her health</p><p>Dolly Parton has taken to social media to clarify she “ain’t dead yet!”</p><p>In a <a href=\"https://www.instagram.com/reel/DPjkor7kfeb/?utm_source=ig_embed&amp;ig_rid=f6a18523-b270-4635-8cd2-e641914e",
      "After her sister’s emotional post asking for prayers sparked concern, Dolly Parton set the record straight about her health in a new video. Here's what she said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/810e/live/e81213b0-a3f1-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Dolly Parton posts 'I ain't dead yet' after sister sparks health concerns",
      "Dolly Parton addresses health concerns in new video: ‘I ain’t dead yet!’",
      "Dolly Parton Breaks Silence Amid Health Concerns: ‘I’m Not Ready To Die Yet’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dolly Parton addressed health rumors by posting a video on social media, asserting \"I ain't dead yet!\" following concerns raised after her sister asked fans for prayers and Parton postponed gigs due to health issues. She aimed to clarify her current well-being to her fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Wildfire Kills 12; Man Charged with Arson",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:55:18 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "fortune.com"
    ],
    "snippets": [
      "The Palisades Fire in early January burned thousands of homes and killed multiple people as flames spread rapidly in heavy winds up to 100 miles per hour.",
      "<p>Jonathan Rinderknecht allegedly started blaze that destroyed over 6,800 structures in California</p><p>A 29-year-old man has been arrested and charged with igniting the fire that days later became the devastating Palisades blaze, which killed 12 people and destroyed more than 6,800 structures in ",
      "The complaint said the suspect, Jonathan Rinderknecht, asking a question to ChatGPT about lighting a cigarette in an effort to cover his tracks."
    ],
    "image_url": "",
    "titles": [
      "Florida man charged with intentionally setting Pacific Palisades fire in LA",
      "Man charged with starting Palisades fire that killed 12 people",
      "29-year-old charged with starting the fire that destroyed LA’s Pacific Palisades"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In early January, the Palisades Fire in California, fueled by winds up to 100 mph, killed 12 people and destroyed over 6,800 structures. Jonathan Rinderknecht, 29, has been arrested and charged with starting the fire. He allegedly sought to cover his tracks by inquiring about lighting a cigarette.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Parliament Bans Meat Terms for Plant-Based Products Amid Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 16:55:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Pressure to ban meat labels for plant-based products comes from Europe's livestock farmers.",
      "<p>Proponents say move would strengthen position of farmers in supply chain but critics dismiss it as ‘hotdog populism’</p><p>Veggie burgers, tofu steak and cauliflower schnitzel will be off the menu if the European parliament gets its way after a vote on food names.</p><p>MEPs voted on Wednesday by",
      "More and more European shoppers are buying imitation schnitzel, bratwurst and steak made from plants but some politicians say only real meat should use those names."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/62fd/live/09d090f0-a45e-11f0-a789-358ea6d9d143.jpg",
    "titles": [
      "No more veggie burgers? EU parliament votes to ban meat names for plant-based foods",
      "‘Veggie burgers’ could be off EU menu as MEPs back renaming plant-based foods",
      "That’s no schnitzel! E.U. moves to ban using meat names for veggie fare."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "European Parliament voted to restrict plant-based products from using meat-related terms like 'burger' or 'steak'. This decision, supported by livestock farmers aiming to strengthen their market position, faces criticism for potentially misleading consumers and limiting choice. Critics label it as 'hotdog populism'. The outcome impacts labeling of plant-based foods across Europe, with opponents arguing it could confuse shoppers accustomed to such terms for vegetarian options.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kemi Badenoch Pledges to Scrap Stamp Duty on Primary Homes to Cut Deficit",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:50:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Tory leader says the move would help millions buy a home, in her annual conference speech.",
      "Leader pitches Conservatives as party of spending control with promise to drive down Britain’s deficit",
      "<p>Leader announces tax cut plan for England and Northern Ireland in speech aimed at boosting fiscal credibility</p><p>The Conservatives will scrap stamp duty on sales of primary residences if they win the next election, Kemi Badenoch has said, in a policy-heavy speech designed to improve her standi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3560/live/3eedd230-a444-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Conservatives would scrap stamp duty on main homes, Badenoch says",
      "Badenoch vows to scrap stamp duty",
      "Tories will scrap stamp duty on primary residences, Kemi Badenoch tells conference"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.95,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Conservative Party leader, Kemi Badenoch, has promised to eliminate stamp duty on sales of primary residences to reduce Britain's deficit and boost the party's fiscal reputation. This policy, aimed at freeing up the housing market and enhancing social mobility, was announced in a speech focusing on fiscal responsibility. Concurrently, the Labour deputy leadership election begins, with Lucy Powell viewed as the frontrunner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rangers to Discuss Managerial Role with Steven Gerrard in London",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:33:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Rangers are poised to hold talks this week with Steven Gerrard over their managerial vacancy.",
      "Rangers are poised to hold talks this week with Steven Gerrard over their managerial vacancy.",
      "Steven Gerrard will meet Rangers' owners in London over the coming days to hold talks over a sensational return to Ibrox."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0743/live/058979f0-a475-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Gerrard poised to hold talks over Rangers return",
      "Gerrard poised to hold talks over Rangers return",
      "Gerrard set to hold talks with Rangers owners in London"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.945,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rangers are set to discuss their managerial vacancy with Steven Gerrard this week. Gerrard is scheduled to meet the team's owners in London in the coming days to talk about a potential return to Ibrox.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nathan Lukes to Play Left Field, Bat Second in ALDS Game 4 for Blue Jays",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:52:57 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Nathan Lukes will play in left field and bat second for the Toronto Blue Jays in Game 4 of their American League Division Series against New York.",
      "<p>An oddly poor night in the field cost the Blue Jays in Game 3 against the Yankees. It may be more blip than trend, but either way, the defence must be rectified immediately if Toronto wants to advance.</p>",
      "<p>Chess moves for Game 4 of the ALDS have already begun.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/ba8ef56a4c0ec29da536e3ad64d115f95f66fed471b526c4ce0d420a8624d106.jpg?quality=65&strip=all",
    "titles": [
      "Lukes back in lineup for Blue Jays in Game 4",
      "Blue Jays must tighten up defence ahead of Game 4",
      "Yankees roll out balanced lineup for Game 4 against Blue Jays"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.713,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nathan Lukes is set to play left field and bat second for the Toronto Blue Jays in Game 4 of the American League Division Series (ALDS) against New York. Following a disappointing performance in the field during Game 3, which contributed to a loss against the Yankees, the Blue Jays are making strategic adjustments. The team aims to improve its defense to secure a win in the upcoming game and advance in the series.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "BOLO Program Updates Canada's Top 25 Most Wanted; Rewards Offered",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:14:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "A new list of Canada's 25 most wanted fugitives includes 14 suspects wanted by Ontario police agencies, with others sought by authorities in Manitoba, Quebec, B.C. and Alberta.",
      "Three Winnipeggers have the dubious honour of appearing on the latest Top 25 Most Wanted List from the nationwide BOLO Program, police say.",
      "Two of the top 25 most wanted people across Canada are charged by Ottawa police with murder. The Bolo program shared an updated list of Canada’s top 25 most wanted fugitives on Wednesday, and investigators are offering financial rewards to anyone with information about their whereabouts. Topping the"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/PREVIL-BOLO-TN.jpg?quality=65&strip=all",
    "titles": [
      "Canada’s top 25 most wanted includes 17 who face murder charges",
      "‘On the lookout’: 3 Winnipeggers in Canada’s top 25 most wanted list",
      "Two fugitives charged by Ottawa police still on top 25 most wanted list"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The BOLO Program has updated its list of Canada's top 25 most wanted fugitives, featuring 14 suspects from Ontario and others from Manitoba, Quebec, B.C., and Alberta. This list includes three individuals from Winnipeg and two charged with murder by Ottawa police. Authorities are offering financial rewards for information leading to the apprehension of these fugitives.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flight Delays Rise Amid Controller Shortage and Government Shutdown",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 15:08:39 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.",
      "The government shutdown is exacerbating concerns about the strain on air traffic controllers, a shortage of whom has vexed airline executives for years."
    ],
    "image_url": "https://s.abcnews.com/images/US/251008_abc_social_sweeney_shutdown1_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Air traffic controller shortages amid shutdown lead to canceled flights, delays",
      "Air traffic control shortages add to U.S. flight delays, FAA says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Flight delays and cancellations are increasing due to a shortage of air traffic controllers caused by sickness-related absences. The ongoing government shutdown is worsening the situation, highlighting a long-standing issue of controller shortages that has troubled airline executives for years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jon Rahm Leads Europe to Ryder Cup Victory, Shines in Spain Return",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 18:56:22 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Rahm was dominant helping lead Europe to a relatively dominant win over the United States",
      "Jon Rahm is back in action at his home tournament in Spain following what he considered the \"toughest week mentally\" of his career during the Ryder Cup in New York."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/08/e4e8606b-0ea9-4348-b432-3c464a747b41/jon-rahm-champagne-ryder-cup.jpg",
    "titles": [
      "Jon Rahm explains why 2025 Ryder Cup was the toughest week of his career from a mental standpoint",
      "Rahm returns to home event after 'toughest week' of career at Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jon Rahm played a key role in Europe's win over the United States at the Ryder Cup in New York, a victory he described as resulting from the \"toughest week mentally\" of his career. Following this, Rahm returned to compete in his home tournament in Spain, demonstrating his resilience and skill on the golf course.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shutdown Begins Amid Funding Deal Stalemate",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:29:20 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "President Donald Trump and Republicans accuse Democrats, who want any funding bill to include health-care protections, of holding the government hostage.",
      "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "Senate again rejects funding bills as government shutdown enters second week",
      "Government Shutdown: Senate Blocks Bills To Reopen Government"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government shutdown began at midnight on October 1, following a failure to reach a funding deal, with Democrats demanding health-care protections in any bill and Republicans, led by President Donald Trump, accusing them of holding the government hostage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Football Tips: QB Picks and Giants' Player Updates",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:58:21 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Quarterbacks you want in Week 6 lineups, and those you should avoid",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxQR055MnVlcEQzVHd1VmJjQUFLbkRGZEFfRmIweTNGelhuNGdMUWoxNFc5elg5SjlHMnFIWTc5ZTFlOTZrRDEtMk01NGxrNGZKUk4wbVZGNlB2ZTh2SGJ5dDMxSEdDZVg4Wk5QZmx3ekQ5eHZPTVhONnBrUlZ2OGN1djdfZlZsTW5wOUJTM25pTGdFVE5LeGtvQTYyQ04?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOQzhzN3JiTHR4RVBDVnJzTVV3a0I2Sy1kZk96eVBzanprLXEydGN6aEVGNmlTeVhJM2tiV0diU1dCZUU2NE1iY1RfcFNpSXZvcXQzeUJNLTR0UTI5Y0VxZG03elZMM2gyZDZfNEt2SDVXbHozeE9BemFlNFhJZ3AtbXBDS1JueFNjX05MN2JtRlZJRFVDQm1UVw?oc=5\" target=\"_blank\">Tight End Start 'Em, ",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxQSk14QUFMTTFyLUZITWIzNVJTRjFLVm03ZDgtUG1vT05UR2FWeTVOcmRYN0F6WlQ3cVBraVlxS2lNM2VZbU1hOU1TTlNOdWRra1laVU1Bc2hGZFVTU0ZKUncwWm4zUkJVV3pxVmx2VGZpbkVnTXNqZlF2dmVDckpMQUlqWjUyYVowNjRWY0JyY0wxOE05V0E?oc=5\" target=\"_blank\">Giants Rule Out Three fo"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/29/0a2438cf-86c3-4725-80a2-e68b12020889/matthew-stafford-los-angeles-rams-imagn-images.jpg",
    "titles": [
      "Fantasy Football Week 6 Start 'Em & Sit 'Em Quarterbacks: Stafford stays red-hot against banged-up Ravens",
      "Running Back Start 'Em, Sit 'Em For Fantasy Football Week 6 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 6 - Sports Illustrated",
      "Giants Rule Out Three for Week 6 Game vs. Eagles - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 6 fantasy football, certain quarterbacks are recommended for lineups, while others are advised against. Additionally, guidance is provided for selecting running backs and tight ends. The New York Giants have ruled out three players for their upcoming game. The details on which quarterbacks to choose or avoid were not specified in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jim Harbaugh Trades for Oweh, Boosts Chargers' Lineup",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:57:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "chargerswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jim Harbaugh made a trade with his brother to land Oweh",
      "Jim Harbaugh spoke highly of the newest member of the Chargers on Wednesday."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/08/c582f172-0ac7-47f6-9a16-db6bc08bf3df/oweh.jpg",
    "titles": [
      "Jim Harbaugh says new Chargers pass rusher Odafe Oweh reminds him of Khalil Mack",
      "Jim Harbaugh speaks on the addition of Odafe Oweh: 'He’s a lot like Khalil Mack'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jim Harbaugh, involved in a trade with his brother, successfully acquired Oweh for the Chargers. He praised Oweh's abilities and potential contribution to the team during a Wednesday announcement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Germany Extends Citizenship Waiting Period from 3 to 5 Years",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T17:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Crossing fast-track citizenship off the books was a key migration-related election campaign promise from Chancellor Merz's CDU. Critics argue that this will deter highly qualified immigrants from coming to Germany.",
      "<p>Friedrich Merz’s conservatives had pledged to rescind legislation, which allowed citizenship in three years instead of five</p><p>Germany’s parliament has rescinded a fast-track citizenship programme, reflecting the rapidly shifting mood on migration in Europe’s labour-hungry economic powerhouse."
    ],
    "image_url": "",
    "titles": [
      "German parliament votes to get rid of fast-track citizenship",
      "Germany ends fast-track citizenship as mood on migration shifts"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Germany's parliament has repealed a program that enabled fast-track citizenship, changing the waiting period from three to five years. This move fulfills a campaign promise of Chancellor Friedrich Merz's CDU party, amid concerns that it may discourage highly skilled immigrants from moving to Germany. The decision reflects a changing attitude towards migration in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "High-Level Officials Join Israel-Hamas Talks in Egypt, Boosting Peace Hopes",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:02:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>US Middle East envoy Steve Witkoff, Trump’s son-in-law Jared Kushner, Qatar’s PM and Turkey’s intelligence chief gather in Egypt</p><p>US, Qatari and Turkish officials joined the third day of indirect negotiations between Israel and Hamas in Egypt, as cautious optimism grew that a lasting truce t",
      "CAIRO (AP) — The United States&#8217; top Middle East adviser, the prime minister of Qatar and other senior officials joined the third day of peace talks between Israel and Hamas in an Egyptian resort on Wednesday, a sign that negotiators aim to dive deeply into the toughest issues of an American pl"
    ],
    "image_url": "https://i.guim.co.uk/img/media/bb0a47aa52ae4077a116c5eb8a05306de294b93a/953_0_4116_3294/master/4116.jpg?width=140&quality=85&auto=format&fit=max&s=573a700566947bc5e7e9bff8df2f966b",
    "titles": [
      "Optimism grows for Gaza peace deal as top US, Qatari and Turkish officials join talks",
      "Top officials from US and Qatar join talks aimed at brokering peace in Gaza"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US Middle East envoy Steve Witkoff, Jared Kushner, Qatar's PM, and Turkey's intelligence chief attended the third day of indirect Israel-Hamas peace talks in Egypt. With senior officials from the US, Qatar, and Turkey joining, there's cautious optimism for a lasting truce. This high-level involvement indicates a deep dive into resolving critical issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lecornu Resigns 14 Hours After Cabinet Announcement, Lowers Election Odds",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T18:39:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "Lecornu resigned on Monday only 14 hours after naming his Cabinet, which had met resistance from rival political parties.",
      "Sébastien Lecornu says prospect of a snap parliamentary election is receding"
    ],
    "image_url": "",
    "titles": [
      "France: Lecornu says there could be new PM in 48 hours",
      "Macron could name a new French PM in next 48 hours, says outgoing premier"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sébastien Lecornu resigned as a minister 14 hours after announcing his Cabinet, facing opposition from rival parties. Following his resignation, Lecornu stated that the likelihood of a snap parliamentary election is decreasing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon and Walmart Compete with Major Discounts in October Sales Event",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-08T14:21:47-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Amazon is the retailer to beat when it comes to offering deals that compete with Amazon’s October Prime Day event. Walmart has proven to be a contender this year, matching the prices on several discounts and marking down many other tech products that we think you’ll like. Its sale event, simply call",
      "Updated deals on keyboards, laptops, chargers, cameras, and lots of other stuff!"
    ],
    "image_url": "",
    "titles": [
      "The best October Prime Day deals at Walmart",
      "It’s Prime Day 2025 part two, and here are more of the best deals we could find"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days event, running from October 7-10, 2025, features major discounts across a wide range of products, including tech gadgets like Bose QuietComfort headphones and high-spec Android tablets, pet supplies such as Greenies treats and PetSafe litter boxes, and brands like Cetaphil, Calvin Klein, Dyson, Shark, and Samsung. Concurrently, Walmart is competing by matching several of Amazon's discounts and offering additional deals on tech products.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Stops Flotilla Trying to Break Gaza Blockade, Detains Activists",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:28:18 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>New group of vessels intercepted in international waters while at least seven people from previous flotilla still held</p><p>A Gaza-bound humanitarian flotilla aimed at breaking Israel’s naval blockade has been intercepted by the Israeli military, days after the detention of activists on an earli",
      "It was the second attempt in as many weeks to breach the restrictions around the Gaza Strip. Neither has succeeded."
    ],
    "image_url": "https://i.guim.co.uk/img/media/300d199ae1759e9f15131c5c96115464947dd5a0/77_0_2433_1947/master/2433.jpg?width=140&quality=85&auto=format&fit=max&s=c84fed7503fa6253762f877289148d27",
    "titles": [
      "Israel halts another Gaza aid flotilla as MEPs demand activists’ release",
      "Israel Intercepts Another Activist Flotilla Aiming to Break Gaza Blockade"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli military intercepted a nine-boat flotilla attempting to break Israel's naval blockade of Gaza in the Mediterranean Sea, detaining scores of activists. This incident marks the second unsuccessful attempt in recent weeks to breach the blockade, with at least seven activists from a previous flotilla still being held.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Julia Wandelt on Trial for Alleged Harassment of McCann Family",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 17:13:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Mrs McCann says she also received a letter signed off with her missing daughter's name and a kiss.",
      "<p>Julia Wandelt is on trial accused of targeting the McCann family with a two-and-a-half-year harassment campaign</p><p>Kate McCann has said it was hard to hear an alleged stalker refer to her as “Mum”, as she gave evidence in the trial of a woman who claimed to be her missing daughter.</p><p>Speak"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/65f8/live/be1661d0-a467-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Kate McCann tells court alleged stalker's contact with Maddie's sister was 'final straw'",
      "Kate McCann tells court of stress caused by alleged stalker calling her ‘Mum’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Julia Wandelt is on trial for allegedly harassing the McCann family for over two years, including sending a letter signed with their missing daughter's name. Kate McCann testified, finding it difficult to hear Wandelt call her \"Mum.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel in Chemistry for Pioneers of Pollution-Fighting Frameworks",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T09:50:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Ars Technica",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The work that won Susumu Kitagawa, Richard Robson and Omar M. Yaghi the 2025 Nobel Prize in chemistry could help tackle challenges such as climate change and lack of fresh water.",
      "Three researchers share prize for structured polymers called metal-organic frameworks."
    ],
    "image_url": "",
    "titles": [
      "Trio wins chemistry Nobel Prize for metal organic framework",
      "Chemistry Nobel prize awarded for building ordered polymers with metal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.804,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar M. Yaghi were awarded the 2025 Nobel Prize in Chemistry for their development of metal–organic frameworks. These structures are capable of capturing carbon dioxide, storing toxic gases, catalyzing chemical reactions, and harvesting water from desert air. Their groundbreaking work offers potential solutions to global challenges like climate change and water scarcity.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Chemistry Awarded for Crystal Discovery",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 09:52:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.bbc.com"
    ],
    "snippets": [
      "The winners of the prestigious science prize were announced by the Nobel committee in Sweden.",
      "Three scientists have been awarded the 2025 Nobel prize in chemistry for discovering a new form of molecular architecture: crystals that contain large cavities."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aa4/live/fd3c2950-a451-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Chemistry Nobel goes to work on new materials that could help planet",
      "Nobel chemistry prize awarded for crystal materials that could revolutionize green technology"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.788,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Nobel committee in Sweden announced that three scientists won the 2025 Nobel Prize in Chemistry for their discovery of a new molecular architecture: crystals with large cavities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]