[
  {
    "title": "Netanyahu Vows to Continue Hamas War Amid Global Criticism at UN",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 26 Sep 2025 10:24:31 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "Al Jazeera",
      "The Guardian",
      "CityNews",
      "NPR"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Israeli prime minister's speech was defiant, despite his growing international isolation over his refusal to end the devastating war to eradicate Hamas.",
      "The Israeli leader rails against critics and denounces Western allies for recognising Palestine in fiery UN address.",
      "<p>Israeli PM rebuked Western nations for embracing Palestinian statehood after scores of delegates left the hall in protest</p><p><strong>Palestinians</strong> living in poverty were also affected, the Palestinian prime minister’s spokesperson <strong>Mohammad Abu al-Rob</strong> told Agence France",
      "<p>Israeli prime minister said recognition of Palestinian state is ‘insane’ days after countries such as UK and France did so</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
      "Netanyahu faces international isolation, accusations of war crimes and growing pressure to end a conflict he has continued to escalate.",
      "UNITED NATIONS (AP) — Encircled by critics and protesters at the United Nations, Israeli Prime Minister Benjamin Netanyahu told fellow world leaders on Friday that his nation “must finish the job” against Hamas in Gaza, giving a defiant speech despite growing international isolation over his refusal"
    ],
    "image_url": "",
    "titles": [
      "At U.N., amid jeers and cheers, Netanyahu says Israel 'must finish the job' in Gaza",
      "Netanyahu tells UN that Israel must ‘finish job’ in Gaza",
      "Netanyahu tells UN that Israel ‘must finish the job’ in Gaza after dozens of delegates walk out in protest - Middle East crisis live",
      "Netanyahu’s vows to ‘finish job’ in Gaza during UN speech as delegates walk out",
      "Netanyahu addresses UN as dozens of delegates walk out",
      "Facing global isolation at UN, a defiant Netanyahu says Israel ‘must finish the job’ against Hamas"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.964,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.847,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Benjamin Netanyahu delivered a defiant speech at the United Nations, insisting on continuing the war against Hamas despite international isolation and criticism, including from Western allies who have recognized Palestinian statehood. His remarks followed actions by countries like the UK and France in recognizing Palestine, which led to protests and walkouts during his address. Netanyahu's stance has drawn accusations of war crimes and increased pressure to end the conflict, amidst reports of Palestinians living in poverty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Opposes West Bank Annexation by Israel",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 09:15:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "US President Donald Trump has publicly stated he will not allow Israel to formally annex the occupied West Bank.",
      "US President Donald Trump said an Israeli annexation of the West Bank is \"not going to happen.\" It comes as several Israeli ministers have pushed for the idea. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5xZkgzaURWUUR4SzA0dVpWenFadHFkTWdFQ21UZ2xubmJ3eUFIY3Brc2VlcjlVeTVTRTFMTFJZYU03VDUyM1VLRElGU2VvYXpXS2RObHFsUmFDMWctVVp5YUZtWWpGRWlxZmFhSUo5aENoOTN4WWlsMjRiZw?oc=5\" target=\"_blank\">Trump says he won't let Netanyahu annex the West Bank</a>&nbs",
      "<p>British officials said they feared Trump would recognise Israeli control over the West Bank in retaliation for the UK, Australia, France and others recognising Palestine</p><p>Donald Trump has said he will not allow Israel to annex the occupied West Bank, rejecting calls from some far-right polit",
      "After more countries recognized a Palestinian state this week, President Trump said on Thursday that he would not permit Israel to take over the territory."
    ],
    "image_url": "",
    "titles": [
      "Trump says he will not allow Israel to annex the occupied West Bank",
      "Middle East: Trump says Israel will not annex West Bank",
      "Trump says he won't let Netanyahu annex the West Bank - Axios",
      "Trump says he ‘will not allow’ Israel to annex West Bank after lobbying from allies",
      "Trump Says He Won’t Allow Israel to Annex the West Bank"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.865,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.816,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump announced he will not allow the annexation of the West Bank by Israel, despite several Israeli ministers advocating for it. This statement follows the recognition of a Palestinian state by more countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Director Comey Indicted for False Statements, Obstruction",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-26T00:43:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CNBC",
      "Deutsche Welle",
      "ABC News",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.theguardian.com",
      "www.dw.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Comey is accused of making false statements and obstructing justice. Trump fired Comey in 2017, as he investigated the Trump 2016 presidential campaign's possible collusion with Russia.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5uWmNkeTh6bko1VlN5ejdWM255Q3cxajNQMFJKbDhCTkN0UnlBTXhHRHlvWWZvRWVqZEpjZVVMUGxxbEtSekF0UkdsYUtJSE9IVFNNeVBtUmFpVDJQMUdxTUVaNE1Sd0phVjk5RzFmekZQdndDaG9oN2pOOGc0Zw?oc=5\" target=\"_blank\">Read: Former FBI chief Comey indicted on two charges</a>&",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5xbUxMdkxzOUNVRkF5UEtQU0hxb1p6UnJBTnVFLVZINGRRQjlHLVlBTkRlWEdOT2JucW1yZzdGcWFYUWp3REIyVUF5dEtVQV9vUi1RV2szNUxFT3lGenhhaHY3cVpVQVJXQmZ4bGZCMWFDYnZrVXAzWGh6dGZ2NlU?oc=5\" target=\"_blank\">Former FBI director James Comey indicted</a>&nbsp;&nbsp;",
      "The former FBI director has been indicted on charges of making a false statement and obstruction related to his testimony before the Senate Judiciary Committee in 2020.",
      "President Donald Trump gloated about the filing of criminal charges against James Comey, whom he fired as FBI director in 2017, in his first White House term.",
      "<p>Comey, one of Trump’s frequent targets, indicted on counts of making false statements and obstruction of a congressional proceeding</p><p><a href=\"https://www.theguardian.com/us-news/james-comey\">James Comey</a>, the former <a href=\"https://www.theguardian.com/us-news/fbi\">FBI</a> director and on"
    ],
    "image_url": "",
    "titles": [
      "Former FBI Director James Comey indicted on two counts",
      "Read: Former FBI chief Comey indicted on two charges - Axios",
      "Former FBI director James Comey indicted - Axios",
      "WATCH:  Former FBI Director James Comey reacts to indictment",
      "Former FBI Director James Comey indicted after Trump called for charges",
      "Ex-FBI director James Comey indicted on two charges as Trump pushes to prosecute political enemies"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.724,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey has been indicted by a federal grand jury on charges of making false statements and obstruction of justice. These charges are connected to his actions while investigating the Trump 2016 presidential campaign's potential collusion with Russia. President Donald Trump, who fired Comey in 2017, publicly expressed satisfaction over the indictment. The current status is that Comey faces legal proceedings for the accusations against him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signs Deal Allowing TikTok U.S. Operations with Majority American Ownershi",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 13:48:07 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiX0FVX3lxTE5lOEY1LVpzU2RvdUFaRW1tbkxPdmpsTDE0cmRpVnJoOFhSb0Eyd3oyS1pnc2stT1VfSEZSYkt5UHhDeWExU1cta20zWU1fS3VVdGJiVnoxT1pPbmRjbjBj?oc=5\" target=\"_blank\">Trump signs order allowing TikTok deal to proceed</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "<p>Agreement separates app from Chinese owner ByteDance and allows US investors to take 80% stake</p><p>Donald Trump signed an executive order on Thursday <strong> </strong>outlining<strong> </strong>the terms of a deal to transfer TikTok to a US owner.</p><p>Trump said he and China’s president Xi J",
      "Trump's executive order essentially bars the attorney general or Department of Justice from enforcing that law for 120 days while the divestiture plan presented to the president is executed."
    ],
    "image_url": "",
    "titles": [
      "Trump signs order allowing TikTok deal to proceed - Axios",
      "Trump signs executive order to transfer TikTok to US owners",
      "Trump signs executive order to facilitate TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.932,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.765,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump signed an executive order approving a deal for TikTok to transfer a majority stake to U.S. investors, allowing the app to continue operating in the U.S. The agreement involves separating TikTok from its Chinese owner ByteDance, with U.S. investors taking an 80% stake. Oracle will audit TikTok's algorithm and ensure data security. This move meets Congressional requirements and prevents the Department of Justice from enforcing any law that could shut down TikTok in the U.S. for 120 days while the plan is implemented.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Hints at More Charges After Comey Indictment, ACLU Criticizes Action",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 11:53:04 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "Financial Times",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.ft.com"
    ],
    "snippets": [
      "President Trump on Friday weighed in on the indictment of former FBI Director James Comey and predicted there would be more people who face charges.",
      "President warns his administration will go after ‘corrupt, radical-left Democrats’",
      "<p>President says ‘it’s about justice, it’s not about revenge’ but adds he hopes that others will be prosecuted as ACLU calls indictment ‘grotesque abuse of power’</p><p><strong>Well, the president is awake.</strong></p><p>Donald Trump has posted the following on his Truth Social social media networ"
    ],
    "image_url": "https://s.abcnews.com/images/Politics/trump-03-gty-jef-250926_1758895715206_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Trump says 'there will be others' after Comey indictment",
      "Trump says other opponents will be targeted after Comey indictment",
      "Trump says he hopes ‘there will be others’ after James Comey indictment – live updates"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.994,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump commented on the indictment of former FBI Director James Comey, suggesting more charges against others might follow. He framed his administration's actions as a pursuit of justice rather than revenge, despite aiming to target \"corrupt, radical-left Democrats.\" The ACLU criticized the indictment as a \"grotesque abuse of power.\" Trump's statements were made on his Truth Social media platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes New Tariffs on Pharmaceuticals, Furniture from India, Europe",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 11:26:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Global News"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The US largely imports pharmaceutical products from India and Europe.",
      "<p>Britain will ‘actively engage’ with US over possible 100% duties, with truck and cabinet makers also in firing line</p><p>Donald Trump’s threat to impose <a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-tariffs-heavy-trucks-drugs-kitchen-cabinets\">new tariffs from next week on brand",
      "The new Section 232 tariffs also include a 50 per cent rate on imported kitchen cabinets and bathroom vanities and 30 per cent on upholstered furniture."
    ],
    "image_url": "",
    "titles": [
      "Trump’s latest 100 percent tariff on pharmaceuticals: What we know",
      "Trump’s latest tariff threat raises concerns for UK pharmaceuticals",
      "Trump sets 100% tariffs on pharmaceuticals, 25% on heavy trucks for Oct. 1"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.906,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US, which imports pharmaceuticals mainly from India and Europe, faces potential new tariffs by Donald Trump. These include 100% duties on certain goods, with Britain engaging actively with the US over this issue. The proposed tariffs also involve a 50% rate on imported kitchen cabinets and bathroom vanities, and 30% on upholstered furniture, set to start next week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Delegates Walk Out During Netanyahu's Speech, Canada's Rae Stays Seated",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 14:40:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "CityNews"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "UN delegates walked out as Israeli Prime Minister Benjamin Netanyahu took to the podium at the UN General Assembly.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5wc3FGUWtTdktZTEg4SUxEX05uUnZJazdUTHdWLS1vVkRmOWgzbF9zV1lTNlFiU3dUbTk3bDU1WXFINnZlUzZMVXN0TjNlVDV0Smp1WGp2ZlQyRWdMOG1SVnVXV1p5WGJjN1lkaU1WRnROZ1ROZThRZA?oc=5\" target=\"_blank\">Netanyahu faces mass walk out protest at UN speech</a>&nbsp;&nbsp",
      "Canada was not part of a mass walkout this morning during Israeli Prime Minister Benjamin Netanyahu&#8217;s address to the United Nations General Assembly. The office of Canadian Ambassador Bob Rae says he remained seated during Netanyahu&#8217;s address as dozens of diplomats from other countries w"
    ],
    "image_url": "",
    "titles": [
      "Netanyahu faces diplomatic isolation at UN General Assembly",
      "Netanyahu faces mass walk out protest at UN speech - Axios",
      "Canada not part of mass walkout when Israel PM Netanyahu spoke at UN General Assembly"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During Israeli Prime Minister Benjamin Netanyahu's speech at the UN General Assembly, a significant number of UN delegates walked out in protest. However, Canada's Ambassador Bob Rae did not participate in the walkout and remained seated throughout Netanyahu's address.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terrorism Charges Against Rapper Liam Óg Dismissed Due to Filing Error",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 12:21:23 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The case against Liam  Óg Ó hAnnaidh is thrown out following a technical error in the way the charge against him was brought.",
      "Kneecap has generated widespread attention for its solidarity with Palestinians. Liam O'Hanna was facing terrorism charges after waving a flag of the Lebanese militant group Hezbollah during a London concert in 2024.",
      "<p>Chief magistrate at Woolwich crown court rules that charge brought against musician is unlawful and ‘null’</p><p>A terrorism charge against the Kneecap rapper Liam Óg Ó hAnnaidh has been thrown out by the chief magistrate due to a technical error.</p><p>Ó hAnnaidh had been charged with a terroris"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0e0e/live/17ad3130-9ac0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Terror case against Kneecap rapper thrown out",
      "Kneecap: UK throws out terror case against rap group member",
      "Terrorism case against Kneecap rapper Liam Óg Ó hAnnaidh thrown out"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.904,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The terrorism charges against Kneecap rapper Liam Óg Ó hAnnaidh were dismissed by the chief magistrate at Woolwich Crown Court due to a technical error in the filing process, rendering the charge unlawful and 'null'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces New Tariffs; Asian Markets Fall, Drugmakers' Shares Stable",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 07:47:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "The 100% tariff on pharmaceuticals, 25% on trucks, and 30% on furniture will come into effect on October 1.",
      "Asian stock markets fell after US President Donald Trump announced a new wave of tariffs. He said taxes on medicines, imported kitchen cabinets and sofas were needed \"for national security and other reasons.\"",
      "Drugmakers’ shares fall modestly after president exempts companies with big US investments"
    ],
    "image_url": "",
    "titles": [
      "Trump announces ‘national security’ tariffs on drugs, trucks, furniture",
      "US: Trump's new tariffs to target drugs, furniture, trucks",
      "Trump announces 100% tariffs on branded pharmaceutical products"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On October 1, new tariffs announced by US President Donald Trump will take effect, including a 100% tariff on pharmaceuticals, 25% on trucks, and 30% on furniture for reasons cited as national security among others. Following the announcement, Asian stock markets experienced a downturn. However, drugmakers' shares only saw a modest decline after the president exempted companies with significant US investments from the tariffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Assures Safety for 2026 World Cup, Warns Seattle, SF Could Lose Matches",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 08:28:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Sports Illustrated"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "President Donald Trump tells reporters in the Oval Office the US will be \"safe for the World Cup\" next year.",
      "The 2026 edition of the FIFA World Cup is being staged in United States, Canada and Mexico with the final in New Jersey.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQbVIzRkFzSU5sd2xjelk2VFJUV2U5LWYtdnctNDdDMHh6OGJkSUVXZlpsY2QzWTE1bndfZEJKOE5YTUJqQzUxRTRVSjVEV0ZmakxxSmRLRmUyVHBxNmQtdEN5THVuN0lORUp5eVdHb1BHeTU0LUlmN0liN25udmZURVF6UQ?oc=5\" target=\"_blank\">‘If It's Not Safe’—President Trump Threatens to M"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f28b/live/d943c9c0-9ab2-11f0-a90f-d9832abb6eee.jpg",
    "titles": [
      "Trump 'will move World Cup games from unsafe cities'",
      "Trump suggests FIFA World Cup could be moved from unsafe cities",
      "‘If It's Not Safe’—President Trump Threatens to Move 2026 World Cup Games - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.834,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced that the US will be safe for the 2026 FIFA World Cup, to be co-hosted by the US, Canada, and Mexico, with the final in New Jersey. He also warned of moving matches from cities he considers dangerous, specifically mentioning Seattle and San Francisco. The draw for the tournament is scheduled for December 5.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers' Barkov Undergoes Knee Surgery, Could Miss Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 11:53:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Panthers captain Aleksander Barkov could miss the entire regular season after undergoing surgery for a knee injury.",
      "<p>The Florida Panthers could be without their captain for the entire season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers captain Barkov undergoing knee surgery",
      "Panthers captain Aleksander Barkov has knee surgery, could miss season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Florida Panthers captain Aleksander Barkov underwent knee surgery and may miss the entire regular season. This leaves the team without their leader for potentially the whole season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Team USA Seeks Ryder Cup Win; DeChambeau Ignites First Day Action",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 07:40:18 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Team USA looks to take the Ryder Cup back from Team Europe at Bethpage Black. We have the best moments from the first day of action.",
      "<ul><li><p>Foursomes and fourballs from Bethpage Black</p></li><li><p><a href=\"https://www.theguardian.com/sport/2025/sep/25/dechambeau-picked-to-bring-fire-for-us-in-opening-foursomes-against-europe\">DeChambeau to bring ‘fire’</a> | <a href=\"https://www.theguardian.com/sport/2025/sep/25/bethpage-bl"
    ],
    "image_url": "",
    "titles": [
      "Ryder Cup 2025 best moments: U.S. in early hole on Day 1",
      "Ryder Cup 2025: USA 0-3 Europe on day one – live updates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Team USA aims to reclaim the Ryder Cup from Team Europe at Bethpage Black, with action-packed first day highlights including foursomes and fourballs. Bryson DeChambeau was highlighted for bringing 'fire' to the US team in the opening matches against Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Broadcasts Netanyahu's UN Speech in Gaza, Sparks Protests",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 15:33:45 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Operation prompts outrage as Israeli PM criticises western countries for recognising Palestine as a state and pledges to continue war</p><p>Israeli military loudspeaker systems have broadcast Benjamin Netanyahu’s speech to the UN into Gaza in an unprecedented operation that immediately prompted c",
      "Demonstrators gathered early on Friday in Times Square before making their way across town to the United Nations building."
    ],
    "image_url": "https://i.guim.co.uk/img/media/1c801dc7c42e92c2dc7eddc91db64c4d9ef7983c/309_0_3360_2688/master/3360.jpg?width=140&quality=85&auto=format&fit=max&s=6618cc8015f7d3b9594600bbed11711d",
    "titles": [
      "Israeli loudspeakers broadcast Netanyahu’s speech to UN into Gaza",
      "Thousands Protest Netanyahu’s U.N. Speech in NYC"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli military broadcast PM Netanyahu's UN speech into Gaza, sparking outrage. In the speech, Netanyahu criticized Western countries for recognizing Palestine and vowed to continue the conflict. This operation led to demonstrations, with protestors gathering in Times Square and moving towards the UN building.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Speaks to Hostages in UN Speech, PA President Denied US Visa",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 11:58:21 -0400",
    "source": "ABC News",
    "sources": [
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Israel Prime Minister Benjamin Netanyahu directly addressed hostages in his United Nations speech, which he said was being broadcast in Gaza via loudspeakers.",
      "The president of the Palestinian Authority addressed the U.N. General Assembly by video after the U.S. denied him a visa.",
      "The president of the Palestinian Authority addressed the U.N. General Assembly by video after the U.S. denied him a visa."
    ],
    "image_url": "https://s.abcnews.com/images/US/un-1-rt-gmh-250926_1758892239654_hpMain_4x3t_384.jpg",
    "titles": [
      "Delegates walk out as Netanyahu speaks at the United Nations",
      "Abbas’s Message to the United Nations",
      "Abbas’s Message on Gaza to the United Nations"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his United Nations speech, Israel Prime Minister Benjamin Netanyahu spoke directly to hostages, stating the address was broadcast in Gaza through loudspeakers. Meanwhile, the Palestinian Authority President addressed the U.N. General Assembly via video after being denied a visa by the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases NFL Week 4 DFS and Survivor Picks, Fantasy Advice",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 15:21:18 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's NFL DFS optimizer has revealed its top value picks for Sunday daily fantasy football in Week 4",
      "SportsLine's advanced computer model just locked in its top Week 4 NFL survivor picks",
      "NFL 2025 Week 4 and it is time to get your fantasy football team right with the best and worst matchups by position.  Do you dare play Detroit Lions David Montgomery?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/08/46160e95-9301-4fad-8d00-851dc8802646/caleb-williams-bears-imagn-images-3.jpg",
    "titles": [
      "NFL DFS: Optimizer reveals Week 4, 2025 daily fantasy football strategy, picks, advice on DraftKings, FanDuel",
      "NFL football knockout, survivor pool picks, advice, best strategy for Week 4, 2025: Bypass the Patriots",
      "NFL 2025 Week 4: Fantasy Football Best/Worst Matchups By Position"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's NFL DFS optimizer has selected its top value picks for Week 4's daily fantasy football, while its computer model has also made its NFL survivor picks for the same week. Additionally, advice for fantasy football team setups for NFL 2025 Week 4 has been provided, highlighting the best and worst matchups by position, including a focus on whether to play Detroit Lions' David Montgomery.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nursery Worker Sentenced to 8 Years for Abusing 21 Babies",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 15:58:14 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Roksana Lecka, 22, has been jailed for eight years for multiple counts of child cruelty.",
      "<p>Nursery worker Roksana Lecka, who pinched, scratched and kicked children, sentenced to eight years in prison</p><p>A 22-year-old nursery worker has been sentenced to eight years in jail after being convicted of the “sadistic” abuse of 21 babies, including pinching and pushing children and kicking"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b17b/live/33d61150-9ae9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Nursery worker jailed over abuse of 21 babies",
      "Woman, 22, jailed over ‘sadistic’ abuse of 21 babies at London nurseries"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Roksana Lecka, a 22-year-old nursery worker, has been sentenced to eight years in prison for the abuse of 21 babies. Her actions, described as \"sadistic,\" included pinching, scratching, pushing, and kicking the children in her care.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed's Key Inflation Gauge Rises 2.9% Year-on-Year in August",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 08:55:19 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The Federal Reserve&rsquo;s favored inflation gauge accelerated slightly in August from a year earlier",
      "The personal consumption expenditures price index for August was expected to increase 2.9% from a year ago."
    ],
    "image_url": "https://s.abcnews.com/images/Business/wirestory_0a10b8f245eb90115c84026d7061d2b0_4x3_384.jpg",
    "titles": [
      "Fed's favored inflation gauge accelerates slightly in August",
      "Core inflation rate held at 2.9% in August, as expected, Fed’s gauge shows"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In August, the personal consumption expenditures price index, the Federal Reserve's preferred inflation measure, saw a slight acceleration, increasing by 2.9% from the same month the previous year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fleetwood and McIlroy Win, Earn Europe Second Ryder Cup Point",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 15:26:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Watch the moment Tommy Fleetwood putts to seal a win for Europe against the United States' Collin Morikawa and Harris English, continuing his strong Ryder Cup partnership with Rory McIlroy.",
      "Europe claim their second point after Rory McIlroy and Tommy Fleetwood beat Collin Morikawa and Harris English 5&4."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa05/live/08e11220-9aed-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "McIlroy & Fleetwood win point for Europe",
      "McIlroy and Fleetwood cruise through foursomes match to win second point"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tommy Fleetwood and Rory McIlroy secured a victory for Europe against the US team of Collin Morikawa and Harris English in the Ryder Cup, winning 5&4. This win gave Europe their second point in the tournament, continuing Fleetwood and McIlroy's successful partnership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Raspberry Pi 500 Plus Unveiled with SSD Socket and Enhanced Features",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-26T09:34:31-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "After upgrading its original compact computer-in-a-keyboard with its more capable Raspberry Pi 5 microcomputer, the company has announced a new premium version of last year’s model. The Raspberry Pi 500 Plus is the first to feature an M.2 2280 SSD socket for storage in addition to an SD card slot th",
      "Keyboard uses low-profile Gateron Blue switches and an RP2040 controller."
    ],
    "image_url": "",
    "titles": [
      "Raspberry Pi upgraded its keyboard computer with mechanical switches and SSD storage",
      "Raspberry Pi 500+ puts the Pi, 16GB of RAM, and a real SSD in a mechanical keyboard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Raspberry Pi Foundation has released the Raspberry Pi 500 Plus, an upgraded version of its computer-in-a-keyboard concept. This new model introduces an M.2 2280 SSD socket for additional storage alongside the traditional SD card slot. It also features low-profile Gateron Blue switches and an RP2040 controller, marking a significant enhancement from last year's model.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tottenham Spurs Reject American Takeover Bid, Club Not for Sale",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 12:53:40 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Tottenham have \"unequivocally rejected\" an informal expression of interest from a consortium led by American tech entrepreneur Brooklyn Earick.",
      "Tottenham Hotspur have rejected a takeover proposal from an American consortium and have reaffirmed their \"not for sale\" stance regarding the club."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d9c4/live/5740e7d0-9acd-11f0-abef-4bf262341dd3.jpg",
    "titles": [
      "Tottenham reject takeover interest from third group",
      "Spurs reject takeover proposal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tottenham Hotspur has officially turned down a takeover bid from an American consortium led by tech entrepreneur Brooklyn Earick, reaffirming their position that the club is not for sale.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Electrons Travel Underground, Linking Chemical Zones for Ecosystem Health",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 07:26:22 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "Phys.org"
    ],
    "domains": [
      "www.sciencedaily.com",
      "phys.org"
    ],
    "snippets": [
      "Electrons flow underground in ways far more extensive than once believed, forming networks that link distant chemical zones. Minerals, organic molecules, and specialized bacteria can act as bridges, creating long-distance electron highways. These discoveries hold promise for pollution cleanup strate",
      "Beneath our feet, an invisible world of electron exchanges quietly drives the chemistry that sustains ecosystems, controls water quality, and even determines the fate of pollutants."
    ],
    "image_url": "",
    "titles": [
      "Hidden “electron highways” beneath our feet could revolutionize pollution cleanup",
      "Study reveals hidden 'electron highways' that power underground chemistry and pollution cleanup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Researchers have discovered that electrons can travel underground over long distances, connecting separate chemical zones through networks formed by minerals, organic molecules, and bacteria. This process, crucial for ecosystem sustainability, water quality, and pollutant degradation, suggests new methods for environmental cleanup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fan Rewarded for Returning Home Run Ball, Shares Gift with Kids",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 20:10:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The fan who gave a 12-year-old boy Cal Raleigh's 60th home run ball Wednesday night in Seattle returned to T-Mobile Park on Thursday and was gifted a signed Raleigh bat and two baseball -- which he gave to his kids.",
      "<p>On this edition of a Central Sixty, Ken Reid brings you the heartwarming story of Cal Raleigh&#8217;s 60th home run ball, and the strange sight of Mitch Marner donning a Vegas Golden Knights jersey.</p>"
    ],
    "image_url": "",
    "titles": [
      "Raleigh meets fan who gave 60th HR ball to boy",
      "Mariners’ Raleigh shows love for fan who gave milestone ball to kid"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.716,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.623,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fan who returned Cal Raleigh's 60th home run ball to a 12-year-old boy in Seattle was rewarded with a signed bat and two baseballs at T-Mobile Park. The fan then gave the baseballs to his children. This event was featured in a heartwarming story alongside the unusual sight of Mitch Marner in a Vegas Golden Knights jersey on Central Sixty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "West Virginia, Boise State Reveal New Game Gear; Week 5 College Football Picks U",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 18:41:26 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "West Virginia will don a look that throws things back all the way to 1965, while Boise State is making waves with incredibly detailed, hand-painted helmets.",
      "The SportsLine Projection Model has revealed its FSU vs. Virginia matchup on Friday",
      "The SportsLine Projection Model has revealed its Texas A&amp;M Aggies vs. Auburn Tigers  picks for Saturday",
      "SportsLine expert Jimmie Kaylor has revealed his Virginia Cavaliers vs. FSU Seminoles picks, predictions, and best bets for Friday's game",
      "Thomas Casale has locked in his top three college football picks for Week 5 and his CFB parlay could pay out around +600",
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 5 college football schedule"
    ],
    "image_url": "",
    "titles": [
      "West Virginia, Boise State lead best uniforms from college football Week 5",
      "Virginia vs. Florida State prediction, odds, line, time: 2025 college football Week 5 picks by proven model",
      "Auburn vs. Texas A&M prediction, odds, line, time: 2025 college football Week 5 picks by proven model",
      "Florida State vs. Virginia prediction, odds: 2025 college football Week 5 picks by expert who's up 102 units",
      "2025 college football picks, Week 5 odds, spreads, predictions via proven expert: This parlay returns 6-1",
      "2025 college football Week 5 picks against the spread, odds, lines, trends: CFB expert reveals best bets"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.694,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.619,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "West Virginia introduces a retro 1965-inspired look, and Boise State unveils detailed, hand-painted helmets for their upcoming games. SportsLine's Projection Model has released its predictions for the FSU vs. Virginia and Texas A&M vs. Auburn matchups. Experts Jimmie Kaylor and Thomas Casale have shared their picks and predictions for the FSU vs. Virginia game and Week 5 college football games, respectively. Additionally, Bruce Marshall, a renowned Vegas handicapper, has identified top betting values for Week 5 of the college football season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Settles for $2.5B Over Prime Subscription Deception Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 00:48:02 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOVHZfNFRhbnRJcUdkQUViQWlta041LWJOYVpnYjA1SUlhMU5yNVFaRl9tR09sSTkxXzZ3S1JqeGVkZlA5Y2tnTzVXZFdpNnFPV01iaFBEV1B2Vms2Smd1YUhjX085a3F1QVljQ0o5eGdrakt0cUJjQlFMMGNiYkk3bzBXdW1YUQ?oc=5\" target=\"_blank\">How to get a refund from the Amazon Prime FTC",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTFA1WXVkbk5XT0tOa2t6cUJkMHlUR1ZfVENEZmpkNWtVQ21QU19JRnRoYmFQdHRLNzFOaUxVdWRwaHNXUGZBcTZUZjUtODNCZzlMTzBrejZTdEVzRWxnSjZWWmV4b0I5RFVUNm5WRw?oc=5\" target=\"_blank\">Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit</a>&nbsp;&nbsp;<f",
      "Amazon’s $2.5 billion settlement includes $1.5 billion for customer refunds; here’s who’s eligible, who isn’t, and how automatic payouts and claims will work after court approval."
    ],
    "image_url": "",
    "titles": [
      "How to get a refund from the Amazon Prime FTC settlement - Axios",
      "Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit - Axios",
      "Amazon Prime settlement: How to claim up to $51, who qualifies, and when refunds arrive"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.711,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon has agreed to a $2.5 billion settlement with federal regulators over allegations of deceptive web designs that tricked millions into unwanted Prime subscriptions and made cancellation difficult. The settlement includes a $1 billion civil penalty and $1.5 billion in consumer refunds for the estimated 35 million affected. The FTC accused Amazon of using \"dark patterns\" for auto-renewals and a complex cancellation process. This resolution follows a lawsuit and a Business Insider investigation into Amazon Prime's practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Appeals to EPA Amidst Musk's Controversial $300M Actions",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:45:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBKSVU5MmZrS1BEZGRNSVRpaENOZGZkN2RZaldLQ2NrVnFhZmdGdnRtNWc2RXAzeHRuNXlUSnoydzRZWHNwNWtsZTNqaXZpNWtPZnFYNXZmOHA4R192OVdmSnp1dEFJY28?oc=5\" target=\"_blank\">Tesla urges EPA not to smash foundation for climate rules</a>&nbsp;&nbsp;<font color=\"#6",
      "The company's regulatory policy team is trying to clean up a mess that CEO Elon Musk spent $300 million to help create."
    ],
    "image_url": "",
    "titles": [
      "Tesla urges EPA not to smash foundation for climate rules - Axios",
      "Tesla asks EPA not to roll back emissions rules as Trump calls climate change a ‘con job’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.614,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.578,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla has urged the EPA not to dismantle the foundation for climate regulations, addressing a situation complicated by CEO Elon Musk's actions, which involved a $300 million expenditure. The company's regulatory policy team is actively working to mitigate the fallout from Musk's decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Maintains Tech Lead with Innovation and Strong Brand Loyalty",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 13:00:06 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxOdVh3SERlU3FtOUhZaDQ3eDNZVHE5bTJIRHFiWjhFeXd3WkEzMEhJUlFOc1dsa09naEtmX2drWnREU0JJNnI1OUdXZjljX3dPaXlPdGxmNUpGb25oVWlqWEVpV1hVV2tCZFRYTjRxUGhNR3ZRUGlVQ3RCbzlWVm5uR3FpM0Jud2RJOW8wTzE3YVdIT0dtZXZMMkpMdzBndw?oc=5\" target=\"_blank\">Why America W",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPQmhZMmtMcDVZcXZFZXlnbUgzRGNLa2lnV1B1M1NZMzMybmh0TVktOGFhVFZDUEZsY2VxRWZBaTRmMWdwMUVZamJGbWFTSkRuNlB2YnJkblp6UUd3YVRaTjAtd0JoeUEzbWt5MXFtVk9fdWdZaExIUFNQakU2V3VIWU5vZUt1LXNxVU5QbktrMWRxZkhD?oc=5\" target=\"_blank\">Video: Why Apple Still Hasn"
    ],
    "image_url": "",
    "titles": [
      "Why America Will Lose Its Mercantilist Game - Bloomberg.com",
      "Video: Why Apple Still Hasn’t Cracked AI - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.916,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple continues to dominate the tech industry due to its strategic product innovation and market positioning. Despite challenges, the company maintains a strong brand loyalty and innovative product lineup, which keeps it at the forefront of consumer technology. This enduring success is attributed to Apple's commitment to quality, user experience, and a comprehensive ecosystem of devices and services.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Studies Shed Light on Bigscale Pomfret and Gaslighting Mechanisms",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 13:12:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/what-is-the-bigscale-pomfret-scientists-unravel-secrets-of-an-oceanic-enigma/\" rel=\"nofollow\" title=\"What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma\"><img alt=\"Big Scale Pomfret\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"512\"",
      "<a href=\"https://scitechdaily.com/scientists-unravel-secrets-of-how-gaslighting-really-works/\" rel=\"nofollow\" title=\"Scientists Unravel Secrets of How Gaslighting Really Works\"><img alt=\"Marriage Problems Boyfriend Girlfriend Arguing\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "What Is the Bigscale Pomfret? Scientists Unravel Secrets of an Oceanic Enigma",
      "Scientists Unravel Secrets of How Gaslighting Really Works"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.94,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists have conducted studies on the Bigscale Pomfret, revealing new insights into this oceanic species. In separate research, experts have also uncovered the mechanisms behind gaslighting, offering a deeper understanding of this psychological manipulation technique. Both studies contribute to our knowledge of marine biology and human behavior, respectively.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  }
]