[
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "summary": "Mark Lowen, a journalist working for the BBC, was arrested in Istanbul during his coverage of protests. Following his arrest, he was deported back to the UK.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "summary": "The current government is at risk of being the first in almost 100 years to not win a second term in office.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:40:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.4
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "summary": "Ubisoft has created a subsidiary for its Assassin’s Creed, Far Cry, and Rainbow Six franchises. Tencent has invested about $1.3 billion for a 25% share in this new entity, valuing it at approximately $4.3 billion.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "RFK to slash 10,000 jobs in major overhaul of US health agencies",
    "summary": "The Department of Health and Human Services (HHS) has unveiled a plan to restructure the organization after a period marked by instability and speculation about staff layoffs.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:06:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. He claims that the NCAA and the university conspired to make him a scapegoat.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "NWSL: Denver details plans for temporary stadium",
    "summary": "Denver's National Women's Soccer League expansion team revealed plans on Thursday to build a training center and a 12,000-seat temporary stadium in Centennial, Colorado.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:10:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "One room, 300 clubs, 80 agencies, 3,500 meetings: Inside soccer's secret transfer space",
    "summary": "TransferRoom is described as a \"speed dating\" platform for the soccer industry, a concept noted by Rob Dawson. This innovative approach facilitates quick and efficient connections within the soccer community.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "'I feel like I have everything in front of me': Inside the $765 million marriage of Juan Soto and the Mets",
    "summary": "A free agent has signed a megadeal with the New York Mets, starting a new chapter for the team and Major League Baseball (MLB) this offseason.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:10:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Betting buzz: Gator fan's $5 parlay worth $168K ... if Duke wins",
    "summary": "A Florida Gator fan could win $168,000 if Duke wins their upcoming game, due to a parlay bet placed by the fan.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:00 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.38
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care",
    "summary": "The Trump administration intends to halt and retract grants from the COVID-era, aiming to save $11.4 billion. Addiction specialists are concerned that this withdrawal of federal support might risk patients' well-being by affecting the quality of their care.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:22:09 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.372
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "summary": "Researchers have created a new statistical method that turns traditional family trees into dynamic movies, showing how ancestors migrated globally over time. This technique can also track disease spread and animal migration patterns across various regions.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "summary": "Researchers found that increased meltwater and rainfall account for 60% of the observed difference between expected and actual ocean temperatures around Antarctica over recent decades.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "summary": "A recent study highlights that many people suffering from Long COVID feel ignored, doubted, and unsupported by their healthcare providers, indicating a gap in patient-caregiver communication and understanding regarding this condition.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "summary": "Researchers have discovered that in vertebrates, skeletal cells from different body regions come from various precursor cells and are controlled by unique gene regulations. This finding could explain a key factor in vertebrates' evolutionary success.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.367
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, supports adding eugenics to college genetics curriculums. He argues this will aid in preventing the political misuse of science.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "summary": "Soil samples from twelve parks in Dublin, Ireland, showed that areas near park entrances had higher concentrations of infective roundworm eggs than other parts of the parks.",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.36
  },
  {
    "title": "Trump executive order seeks to 'restore' American history through Smithsonian overhaul",
    "summary": "The \"Restoring Truth and Sanity to American History\" order is designed to remove what it terms as \"divisive, race-centered ideology\" from Smithsonian museums, educational and research centers, and the National Zoo.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:45:55 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "summary": "A technology has been developed with support from Russian experts, analysts report.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "summary": "Experts caution that strong winds, dry conditions, and pine trees greatly elevate wildfire risks, emphasizing the high potential for fast-spreading fires in such environments.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "summary": "Staff at the Federal Trade Commission have been instructed by Bureau of Consumer Protection Director Christopher Mufarrige to stop describing the agency as \"independent\" in official complaints, according to a report by The Verge.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "Predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "summary": "Experts predict the outcomes of the 2025 baseball season, focusing on the Los Angeles Dodgers' chances of winning and identifying potential MVP candidates.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:53:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "We answered the biggest college softball questions: POY, WCWS picks and sleepers",
    "summary": "Midseason analysis by college softball experts highlights several teams with untapped potential, indicating they could achieve more success as the season progresses.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:19:47 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "First bets: Early picks for 2025 NFL season win totals",
    "summary": "Experts have shared their predictions on the opening season win totals for various teams, highlighting specific totals they believe are worth considering for early bets.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:33:21 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.348
  },
  {
    "title": "The woman who killed Tejano music icon Selena in 1995 has been denied parole",
    "summary": "Yolanda Saldívar, who was found guilty of murdering the singer Selena Quintanilla-Perez in 1995 at a Texas motel, has had her parole request denied. She remains in prison years after the crime.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:37:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump's new tariffs on imported cars could have a clear winner: Tesla",
    "summary": "President Trump has implemented a 25% tariff on imported cars, a move predicted to increase vehicle prices. Tesla is anticipated to be less impacted by this tariff compared to other car manufacturers.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:36:20 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge accuses Trump administration of trying to undermine judiciary",
    "summary": "The Justice Department has accused Howell of displaying bias against President Trump by halting the enforcement of one of his executive orders.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:49:51 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "GOP leaders accused of making threats to block bill to let new moms vote remotely",
    "summary": "Bipartisan lawmakers proposed a House vote to allow new parents to vote by proxy for 12 weeks. House Speaker Mike Johnson objected due to Constitutional concerns.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:23:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "China Tries to Reboot Its Economy as Competitors Circle",
    "summary": "China's economy faces issues such as falling demand for products, surplus industrial capacity, and high debt, further strained by a tariff conflict with the US. To counter these challenges, the Chinese government is seeking to increase business investment, despite past tensions with entrepreneurs. Concurrently, Vietnam is capitalizing on China's economic predicaments, witnessing a manufacturing boom as it seeks to become a regional alternative.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 16:43:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump pulls Stefanik nomination for U.N. ambassador because of thin GOP House majority",
    "summary": "A Republican congresswoman's Senate nomination, initially expected to proceed without issues, is now facing scrutiny from Republicans worried about preserving their narrow majority in the House of Representatives.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 14:33:08 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Food is running out in Gaza nearly a month into Israeli blockade",
    "summary": "The World Food Programme reports critical shortages in Gaza, with a supply of flour that will last only five days and other food items expected to run out in two weeks.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:40:14 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Syria's transitional leader is a former jihadist. Can he help stabilize the region?",
    "summary": "Ahmed al-Sharaa, the founder of Al-Qaeda's Syrian branch, is advocating for unity, as reported by Robert Worth in The Atlantic. The article also reveals that the Trump administration held discussions about al-Sharaa's leadership via the Signal messaging app.",
    "domain": "General",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:12:16 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "summary": "Russia's president described Trump's Arctic plans as \"serious,\" while specifying that they have no connection to Moscow's activities in the region.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "summary": "The Canadian leader announced that Trump's tariffs have changed the Canada-US relationship, potentially jeopardizing future collaborations.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "summary": "Greenland has expressed disapproval towards JD Vance and his wife after Donald Trump announced plans to take control of the island.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Six dead after tourist submarine sinks in Red Sea",
    "summary": "A tourist boat sank near Hurghada in the Red Sea on Thursday morning. Local officials confirmed that 39 passengers were rescued following the incident.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:42:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "summary": "Australian Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a growing opposition.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "summary": "Gertrudis Pineda told the BBC that she has not received any information about her son since he was transferred from the United States to a prison in El Salvador.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Germany leads defiance to Trump car tariffs, saying it 'will not give in'",
    "summary": "Several major economies, led by China, have announced plans to retaliate against the United States, accusing it of violating international trade rules.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "summary": "A former police officer was found guilty of manslaughter in connection with the death of Clare Nowland.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:50:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "summary": "The upcoming movie set for release in May 2026 will star Robert Downey Jr. as Doctor Doom.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "summary": "A suspect was apprehended after a police operation, with assistance from a local resident who helped subdue the individual, as reported by the police.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "summary": "Police discovered evidence of blunt trauma on a toddler's remains, recent updates confirm.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed after the child reported seeing what they described as a \"monster.\"",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'They invited me - now they're attacking me': Signal chat journalist speaks to BBC",
    "summary": "Jeffrey Goldberg was mistakenly included in a chat with senior Trump administration officials, leading to his involvement in political debates.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:17:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "summary": "Poland has enacted a law that allows officials to suspend the right to seek asylum temporarily at its border with Belarus.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles arrived at his residence, as reported by his party.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "summary": "Boualem Sansal, an 80-year-old, stated in an interview with a far-right news outlet that colonial France gave too much land to Algeria.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the death of six people.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "summary": "Ukrainian President Volodymyr Zelensky discussed Europe's support for Ukraine, emphasizing the country's resilience amid challenges.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "summary": "The pet care industry in India has seen growth, driven by affluent urban dwellers who are increasingly spending more on their dogs and cats.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Can Vietnam golf its way out of new Trump tariffs?",
    "summary": "A South East Asian country is now the third largest in terms of trade surplus with the United States, coming after China and Mexico.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:13:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How will Australia choose its next prime minister?",
    "summary": "The nation will hold elections on May 3. A guide is available to help voters understand the electoral system and highlight important issues for the upcoming polls.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:44:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "India: Why are private firms not investing despite record profits?",
    "summary": "A report has found that growth plans are being impacted by two main factors: limited domestic consumption and low demand for exports.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 03:29:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ros Atkins on... Trump's plan for Greenland",
    "summary": "US Vice-President JD Vance is set to visit Greenland on Friday, highlighting the United States' increasing focus on the territory. The specific motivations behind this interest were not disclosed.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:35:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Satellite images reveal how South Korea wildfires spread",
    "summary": "BBC Verify reported on the swift escalation of wildfires in Korea, analyzing the reasons behind their rapid spread.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:03:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Watch: How the South Korea wildfires became so deadly",
    "summary": "Rachel Lee from the BBC conducted an investigation into the causes behind the rapid spread of wildfires. Her analysis aimed at uncovering the reasons for the fires' intense and swift expansion.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 11:01:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "summary": "In the modern age, technology enables tasks to be automated with devices such as self-driving cars and robot vacuums. While highly advanced sentient robots may remain out of financial reach for many during their lifetimes, robot vacuums provide a more affordable means to automate household cleaning tasks.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "summary": "Amazon's Big Spring Sale for 2025 is underway until March 31st, offering discounts on items such as gardening supplies and bedding to mark the beginning of the warmer season.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "summary": "Nintendo revealed \"Switch 2 Edition\" games after its Nintendo Direct stream, announcing the news on its webpage for the new Virtual Game Card lending system.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "summary": "On Thursday, the White House initiated Podcast Row, granting several conservative podcasters access to senior officials from the Trump Administration. This event, intended to connect with alternative media, is set to become a regular occurrence, demonstrating the administration's commitment to integrating new media platforms.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "summary": "Amazon's Big Spring Sale offers discounts on various e-readers, including its first color model. The sale features the Kindle Scribe, known for its note-taking feature, at a record low price for the 16GB version.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "summary": "Canadian company Ploopy has launched the Classic 2 trackball mouse, an update on their original model. This new version features improved connectivity and scroll wheel precision, along with a design optimized for simpler 3D printing.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "summary": "Amazon's Big Spring Sale, running until March 31st, features over 90 deals on a variety of products. The sale is available to all customers, including those without Amazon Prime membership, offering significant discounts on popular items.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The best deals on MacBooks right now",
    "summary": "Amazon's Big Spring Sale is currently happening, offering substantial discounts on numerous items, including Apple MacBooks. These MacBooks come with Apple's M-series chips, available in different sizes and price points. However, the M1 MacBook Air is no longer available.",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Panama approves embattled ex-President Martinelli’s passage to Nicaragua",
    "summary": "Former Panamanian President Ricardo Martinelli was convicted of money laundering and received a 10-year prison sentence in Panama.",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:01:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "‘We won’t back down’: Global leaders threaten backlash to Trump auto tariff",
    "summary": "Canadian Prime Minister Mark Carney announced that the country is exploring various responses to the 25% tariffs imposed, signaling a possibility of implementing a wide array of retaliatory actions.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:33 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barcelona beat Osasuna to move three points clear in LaLiga",
    "summary": "The LaLiga leaders increased their lead to three points at the top of the table with a 3-0 win against Osasuna.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 22:39:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Judge orders Trump administration to preserve Signal texts on Houthi attack",
    "summary": "Judge James Boasberg issued a temporary restraining order to halt the deletion of messages involved in a contentious chat case, ensuring the preservation of potentially relevant communications.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:52:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "German civil servant fired for Pro-Palestinian comment",
    "summary": "An individual was fired from their position because of comments they made in favor of Palestine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:10:59 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Will Donald Trump take Greenland by force?",
    "summary": "The US president has stated an interest in purchasing territory from Denmark, highlighting 'international safety and security' as the motivation behind this desire.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:05:45 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Iran responds to Trump letter on nuclear talks, state media reports",
    "summary": "Iran's foreign minister has confirmed the country's willingness to proceed with indirect negotiations, as indicated by a response sent to Oman. This move underscores Iran's commitment to diplomatic engagement.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:59:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Russia’s Putin eyes Arctic cooperation despite geopolitical tensions",
    "summary": "Russian President Vladimir Putin stated that US President Donald Trump's interest in buying Greenland is considered 'serious.'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:39:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Pro-Palestinian student awaits court ruling on deportation from the US",
    "summary": "Cornell University PhD student Momodou Taal faces the possibility of deportation from the United States.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:31:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Families say loved ones wrongly deported from US based on tattoos",
    "summary": "In Venezuela, there is controversy over tattoos being mistakenly associated with gang activity, resulting in individuals facing unfounded accusations and deportations. Critics highlight the issue of misinterpretation of tattoos, emphasizing the need for a more accurate assessment of such personal expressions without presuming criminal connections.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 20:09:43 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "French-Algerian author Boualem Sansal sentenced to five years in prison",
    "summary": "Algeria has incarcerated a writer due to remarks made concerning its border with Morocco, which has intensified its already strained relations with France.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:21:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Israel’s parliament passes law to expand control over judge appointments",
    "summary": "Israel's government has enacted judiciary reforms, sparking widespread protests and raising concerns about the potential effects on the nation's democracy.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:20:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Colombia and the US agree to collect and share biometric data for migrants",
    "summary": "Homeland Security Secretary Kristi Noem announced a memorandum focused on reducing undocumented migration. This initiative is designed to strengthen enforcement efforts related to immigration.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:17:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mbappe, Vinicius among four Real Madrid players being investigated by UEFA",
    "summary": "The European football governing body is investigating four Real Madrid players for alleged 'indecent conduct' after a match with Atletico Madrid.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:03:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Five wounded in Amsterdam stabbing attack, police say",
    "summary": "Authorities in the Netherlands have arrested a suspect after an attack near Dam Square in Amsterdam.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:10:23 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who’s winning the global race for critical minerals?",
    "summary": "US President Donald Trump has invoked wartime powers to boost the production of critical minerals.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "France’s Macron says not all European countries agree on force for Ukraine",
    "summary": "French President Emmanuel Macron proposed a 'reassurance force' amid geopolitical tensions, though details were not provided. UK opposition leader Keir Starmer criticized Russia for 'playing games' internationally, suggesting manipulative actions.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:05:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who are the students Trump wants to deport?",
    "summary": "Several students, namely Rumeysa Ozturk, Mahmoud Khalil, and Badar Khan Suri, were targeted by Trump.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "South Sudan opposition says vice president’s arrest ends peace deal",
    "summary": "The power-sharing deal between South Sudan's leaders, Kiir and Machar, has fallen apart. This development has sparked fears of a possible return to the violent civil strife that has previously affected the country.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:56:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "US immigration officials detain Turkish student over pro-Palestine views",
    "summary": "US federal agents, including some wearing masks and others in plain clothes, were documented detaining a Turkish PhD student from Tufts University.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:35:40 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Kids Under Fire",
    "summary": "American doctors volunteering in Gaza have reported observing a trend where children are being shot by the Israeli military.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:30:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
    "summary": "In the past year, Europe increased its imports of Russian gas, as reported by Ember. This surge in imports contributed billions of dollars to Russia, which have been linked to funding the country's military actions in Ukraine.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:25:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What’s happened in Sudan’s civil war after new Khartoum battles?",
    "summary": "The Sudanese army is targeting major wins in the capital, aiming to change the course of their conflict with the RSF paramilitary group.",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:07:48 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Men's Sweet 16 live tracker: Highlights, updates and more",
    "summary": "The NCAA basketball tournament has narrowed down from 68 teams to the Sweet 16 stage. The competition continues with four games scheduled for Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:50:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "summary": "Alabama basketball team set an NCAA tournament record by scoring 25 3-pointers in a 113-88 victory against BYU in the East Region semifinal. Mark Sears was the leading contributor in surpassing the previous 35-year-old record.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "summary": "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing the team from scoring tying runs. This led to the Astros winning the game with a final score of 3-1.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "O'Neill extends Opening Day home run record",
    "summary": "Orioles outfielder Tyler O'Neill achieved a new major league record by hitting a home run on Opening Day for the sixth consecutive time.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Harper's HR silences boos in Phillies' win vs. Nats",
    "summary": "On Opening Day, Bryce Harper of the Phillies was booed by fans of his former team, the Nationals. Despite the negative reception, Harper hit a solo home run, helping the Phillies secure a 7-3 win over the Nationals.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "summary": "Former NFL player LeShon Johnson has been charged in a federal dogfighting investigation after 190 dogs were seized from his property last year.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Crosby breaks Gretzky's point-per-game record",
    "summary": "Sidney Crosby has broken the NHL record by consistently achieving a point-per-game rate throughout his career, surpassing the mark he previously shared with Wayne Gretzky.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "NBA 'digesting' Celtics sale before expansion talk",
    "summary": "NBA Commissioner Adam Silver stated on Thursday that the league is considering expanding after the sale process of the Celtics is finalized.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:52:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The Calipari divorce worked out not only for Kentucky, but for Arkansas and BYU, too",
    "summary": "Coaching changes in three different teams have resulted in each team advancing to the second weekend of their competitions.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "From a famed Russian basketball academy to Provo, Egor Demin is dialed in",
    "summary": "Demin has pursued his dream globally and is now on the verge of guiding Brigham Young University (BYU) towards notable achievements.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 12:59:36 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "summary": "NBA insiders are focusing on the MVP race, highlighting the competition between Nikola Jokic and Shai Gilgeous-Alexander.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "summary": "This season, the league has seen a record number of 3-point shot attempts, leading to discussions about potentially implementing measures to limit them.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Everything you need to know for MLB Opening Day, from lineups to live updates and takeaways",
    "summary": "The baseball season has started, providing a detailed overview of all the opening events and the latest updates.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 21:53:58 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "summary": "The latest Sweet 16 player rankings have been updated, yet it has not been disclosed whether Paige Bueckers, Lauren Betts, or Hannah Hidalgo is ranked as the number one player.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players for Notre Dame's basketball team, significantly contributing to the team's pursuit of a championship. Their performances are crucial to the team's success.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "summary": "Mike Tannenbaum, in a hypothetical scenario, made first-round picks for an unspecified event, likely related to sports or talent drafting.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "summary": "Recent allegations have sparked significant concern in college athletics, leading to worries that more athletes may have been victimized.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "summary": "The leading goal scorers in Europe's top football leagues, including the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1, have been identified for the current season. Each league features its top player(s) with the highest number of goals scored to date.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "summary": "UEFA is investigating four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League game against Atlético Madrid, as announced on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "summary": "Xabi Alonso, the coach of Bayer Leverkusen, currently does not have any offers from other clubs, suggesting his position with the team is stable for now, with no expected changes to his future with the team.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "summary": "Barcelona's women's team progressed to the Champions League semi-finals by beating VfL Wolfsburg 6-1 in the second leg of their quarter-final, achieving a 10-2 aggregate victory.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "summary": "Premier League clubs will have an early 10-day transfer window in June to prepare for the FIFA Club World Cup, before it reopens on June 16, as announced by the league on Thursday.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "summary": "Manchester City will make a decision on Claudio Echeverri's future at the club during the summer, as reported by ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Source: PSG owners finalizing Málaga purchase",
    "summary": "Qatar Sport Investment (QSI), the owner of Paris Saint-Germain, is close to purchasing the Spanish football club Malaga, as confirmed by a source to ESPN.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Davies' agent slams Canada staff over ACL tear",
    "summary": "Alphonso Davies' agent has accused the staff of Canada's national team of pressuring him to play against the United States despite not being fully fit, resulting in a torn ACL injury for the Bayern Munich player.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Transfer rumors, news: Griezmann plans to stay at Atletico, eyes MLS for 2026",
    "summary": "Antoine Griezmann has chosen to stay at Atletico Madrid, putting off a move to Major League Soccer (MLS) until 2026, as reported by Transfer Talk.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 20:26:14 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Inside Brandon Graham's final, turbulent, triumphant season as an Eagle",
    "summary": "Graham and his family are reflecting on his final season, concluding a 15-year career.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:58:04 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "For Notre Dame and Marcus Freeman, writing a different ending is the final step",
    "summary": "The Fighting Irish team, having reached the national title game in the previous season, is focusing on their future performances.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:37:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "A pair of Queens: Maryland star Derik Queen signs NIL deal with Dairy Queen",
    "summary": "The Maryland Terrapins moved on to the Sweet 16 in the NCAA basketball tournament by defeating Colorado State. The victory was clinched with a buzzer-beater shot by their star center during the round of 32 game.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "'Richie's Tater Shots': BYU's Saunders signs NIL deal with company founded by great-grandfather",
    "summary": "Saunders' great-grandfather was one of the co-founders of Ore-Ida, the company known for inventing the Tater Tot.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:51:18 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Expert picks, best bets: Moreno's path to victory over Erceg at UFC Fight Night",
    "summary": "This week's UFC Fight Night predictions have been shared by an MMA coach and a betting insider, offering their insights on which fighters they believe will come out on top in the upcoming matches.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:02:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "What the numbers tell us about Mayer vs. Ryan and Zepeda vs. Farmer",
    "summary": "On Saturday, two major rematch fights are scheduled, one in Las Vegas and the other in Mexico. These events are drawing attention for their statistical analyses.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Mikaela Mayer-Sandy Ryan rivalry explained: All you need to know",
    "summary": "The Mayer vs. Ryan rematch is scheduled for Saturday, drawing attention to their ongoing feud. A significant event in their rivalry includes an incident involving paint.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:47:53 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "2025 preview: Skip Holtz looks to keep Birmingham on top, Bob Stoops takes aim",
    "summary": "The UFL season is set to start on Friday night, with every team gearing up to challenge Birmingham, the current frontrunners in the league.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  },
  {
    "title": "Logos, coaches, key players and more",
    "summary": "The UFL is kicking off its second season, showcasing multiple teams along with their coaches and standout players. This season is set to offer competitive matches as teams compete for the win.",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 10:39:13 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "score": 0.34
  }
]