[
  {
    "title": "US Airstrikes Target Iran's Nuclear Sites, Escalate Regional Tensions",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:05:17 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Bloomberg",
      "Global News",
      "New York Times",
      "Business Insider",
      "Forbes",
      "CBC News",
      "BBC",
      "The Guardian",
      "CNBC",
      "LA Times",
      "CityNews",
      "ABC News",
      "Washington Post",
      "Fortune",
      "Axios",
      "Investopedia",
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Iran's threat to block the world's most vital oil transit point has raised fears of major global economic consequences.",
      "Maybe don't put it on your pancakes, ok?",
      "Iranian officials have threatened to mine the waterway, which is a key shipping route for oil and gas.",
      "All eyes are now on the Strait of Hormuz, a 90-mile strip critical to global oil prices.",
      "A notable event occurred between early Sunday and early Monday, when at least six vessels diverted their courses.",
      "The operation to destroy Iranian nuclear facilities has been hailed as a success. How much damage as actually been inflicted and how do we know?",
      "Pictures show the destruction at the Isfahan facility doesn’t include the buildings likely housing three research reactors.",
      "Vice President JD Vance's remarks come after Defense Secretary Pete Hegseth said Iran's \"nuclear ambitions have been obliterated\" following Saturday's strikes.",
      "Iranian Canadians and Jewish groups turned worried eyes to the Middle East on Sunday, as U.S. strikes against three Iranian nuclear sites raised fears of escalating violence. Nimâ Machouf, a member of a Montreal Iranian women&#8217;s association, said family members in Iran are living &#8220;from on",
      "Both elation and fear were widespread in Israel amid uncertainty over what comes next.",
      "NATO leaders meeting this week in The Hague will confront the prospect of another open-ended U.S.-led war outside the North Atlantic region the alliance was created to defend.",
      "Iran’s foreign minister called the attack a “betrayal” in the middle of negotiations and said it would have “everlasting consequences.”",
      "The mood in the government after the U.S. attacks is one of defeat and humiliation. But state media are showing people going about their daily routines.",
      "<p>Oil prices could rise if Iran goes ahead with threat to shut down shipping in the strait of Hormuz</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jun/23/oil-price-imf-iran-strikes-stock-markets-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>U",
      "The rhetoric belies a more complicated reality, as Beijing has been one of Tehran’s biggest backers.",
      "<img alt=\"A satellite image is shown of a mountainous and sparsely populated area with a few buildings.\" height=\"349\" src=\"https://i.cbc.ca/1.7568294.1750676499!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/iran-nuclear-usa-damage.JPG\" title=\"A satellite view shows an overview of Fordow un",
      "The joint attacks against Iran aim to sow chaos and instability in order to secure regional domination.",
      "President Trump avoided asking Congress for permission before striking Iran, despite the Constitution saying only the legislature can declare war.",
      "Israel’s military struck entrances to the detention facility in Tehran, where dissidents and political prisoners are held. Human rights groups say the prison is a symbol of repression.",
      "The nation’s supreme leader may choose to back down after a first round of retaliation, or prefer martyrdom and building a nuclear weapon.",
      "<p>Australia, like Little Sir Echo, whimpers after the world’s premier bully bombs the ‘bully of the Middle East’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"http",
      "Iran’s foreign minister warned that the U.S. decision to join Israel’s war against Iran would have “everlasting consequences.”",
      "He should persuade the leadership in Tehran that this is still possible",
      "Meron Rapoport says Netanyahu&#039;s Iran strikes distract from Gaza &amp; asks if he would oppose Iran without a nuclear threat.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1LTmJvc0tPZ0t1NjBVOUN0ZFU1c19uU0c5S082N3daR1cxTnV6UFd2cHJTWE9PeWVWNHVPU2ItRjFvMFltRGZMV2UtdElTdTdhR0VoZ1hVLTJPUmQzYnRTRnltbEdubjRlNlpabTJvMmE0bHhNR2RhV3ZVcw?oc=5\" target=\"_blank\">At Trump's request, Israel cleared way for U.S. bombers in Ir",
      "<a href=\"https://news.google.com/rss/articles/CBMiZkFVX3lxTE5hS25BY2JXY2phVGNDbGdaV3A2QUxLNXB0U2VHdV9udlp4NHMxdUlFbEk1Yi1xX2FkN0p6YnliSlNSNlFMRnVzTFpFSGFfU0VUVjl6WmdsMEd4ZUNnTXNfNnpBSXZPdw?oc=5\" target=\"_blank\">Trump urges \"drill, baby, drill,\" but U.S. producers are cautious</a>&nbsp;&nbsp;<font co",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE10ZGFnQjA2NkRVeTlxcnJNVU5wZEZhY0wxVWRhdnVucUlINDFSSjdfQXJmOFJmS2tXc0J3NWx2NUkyVjFhOTJLNnZIMDFYVlJfSU90UGFBYkFKMlN5YkhacmRlUWtuSFJWelh1em5R?oc=5\" target=\"_blank\">Oil prices climb but don't soar after U.S. strike, Iranian threats</a>&nbsp;&nb",
      "<p>Trump says former Russian president’s nuclear threat ‘should not be treated so casually’ and warns raising oil prices would be ‘playing right into the hands of the enemy’</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/23/trump-talks-of-regime-change-in-iran-and-insists-us-oblit",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1pa0o0V05oMFZneUNQTWZsNFE0OENkWUUxUE84RVVvcmFycmtadkFTVTBJZ0dxS3RCZzBCSll0TW03ZFhhQ21acW4zcURJMUk1dHFOUWU2anRHSHgxTmsyQ1BndDJ3ekQxTFNEUjBaajI4VE0?oc=5\" target=\"_blank\">Oil market's ho-hum response to Iran strike seen as \"remarkable\"</a>&nbs",
      "Markets across the Middle East ended mostly higher on Sunday after the U.S. entered the war between Israel and Iran.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWWhOa1oyTURGNnpWLXdWQlVid3h6NUpUbGhjQ1dWbmlPM2o0MVZKOGt4NzV0MHM4ejd2NDUwcDJNXzN6UEZWUXIwREt3VlNHYWhFYkxqSzBaeVJkY2MxMnNTVERteVdBRlJNOV9YcG5fZERwY1E?oc=5\" target=\"_blank\">Trump administration says U.S. does not seek regime change in Iran</",
      "Trump said the U.S. hit the Fordow, Natanz and Isfahan nuclear sites. Iran’s foreign minister called it a “dangerous military operation” against his country.",
      "The risk of a spiraling conflagration that pulls the U.S. in deeper flies in the face of Trump’s own rhetoric about righting the wrongs of an earlier era of U.S. overreach.",
      "Europe may have drawn the economic short straw after the U.S. intervened in Middle East tensions, while JPMorgan warns the volatility may be set to last.",
      "Iran reiterated its right to self-defense as President Donald Trump repeated his claim that U.S. strikes caused “monumental damage” to Iranian nuclear sites.",
      "U.S. aircraft attacked three facilities in Iran related to the country's nuclear program on Saturday.",
      "See which sites the U.S., Iran and Israel have hit in the escalating  conflict.",
      "The U.S. issued a 'worldwide caution security alert' amid the ongoing conflict between Israel and Iran and urges Americans to exercise 'increased caution' if travelling abroad.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOU2Vrd05uekpSN3gzTXJZMXV0OTBPY1N2bEZWTEczYU1CaDBFWEZjMHBpRExSQ2NMZDA3TFRtXzQ2MXdyeHY4MUtqWVRPTkgtRjlQR2JEZlVMNnZTWWowcEdwNXFzWjNEbWplM3lmaFZNMFhRc0hsX09weHQ0cUZtUA?oc=5\" target=\"_blank\">U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnig",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1zTEFvazFLblpzaENEZ3JNWU0xZGZ5VG9hal9GY00xNjluVnVpVmhPYXd1V1JfMWwzUGRGMks4RlB5bjI2YTdtQVI0OWJPaE5Fcm1sVkxpNm5tYkpHUzFleVJpeW5rMV9KbTNJNUVxbFlxWVd1N192emJFMA?oc=5\" target=\"_blank\">\"It was a headfake\": Inside Trump's secret orders to strike I",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTFBQYnFkWGR1ZTY3WDk4M3pxWnBwdTJWbnpnRUNESUJTRTlPck5DYzdNWXdRUEhHM2JmTTFiSFhKektSdWNtUllCQlZ0a2FOZjZMekNSTFF6QWxQdXBRZGZ1VEUwdjBlZ3Rr?oc=5\" target=\"_blank\">Trump floats regime change in Iran</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "Rep. Jim Himes said it was still too soon to know if U.S. strikes against Iranian facilities had substantially weakened the country’s nuclear program.",
      "Iran’s foreign minister is in Moscow seeking support, but other than condemning the attack, Putin has not taken any major moves to back Iran.",
      "<p>Penny Wong refuses to say whether Pine Gap communications facility in NT was used in US bombing of three Iranian nuclear sites</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> ",
      "President Vladimir V. Putin met with Iran’s foreign minister on Monday, but did not explicitly call out Israel or the United States for their strikes on Russia’s longtime ally.",
      "<p>International Atomic Energy Agency head says no one in a position to fully assess damage to Iran’s nuclear capabilities</p><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">• Live coverage: Iran’s Fordo",
      "The \"tortuous\" US-Iran relationship was tested at least once before, but this is of far greater magnitude",
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/BOORCuWqSZ2q-AR3ONcANUowmfk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/BTCUSDChart-89b67e04e3c44a6e81098116335de71b.gif\" title=\"This image depicts the BTCUSD chart.\" /><figcaption><i>Source: Tradi",
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images U.S. stock futures are muted in premarket trading Monday, June 23, 2025.\" src=\"https://www.investopedia.com/thmb/a7qXgYJkvWEzU8VnoA0pooE2BI4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2220349086-97e4622246",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFBES2RreWtON200V3dyck9sYnJTLXlsVFlyRks4ZDhLQnBmU2EwVmJtZGJsNUNYTTV5UFh6MDY1SGpuSW50bGJFUWJQX25fbUNWdU5zeDQxZ3U2bWtLOUZ4WmxlUVZTLWpFbnluSWM4djNsSjZJaHc?oc=5\" target=\"_blank\">U.S. braces for heightened threats in wake of Iran strikes</a>&nbsp;",
      "<p>U.S. military officials said its precision strikes against Iran's three main nuclear facilities caused \"extremely severe damage and destruction.\"</p>",
      "Tehran is weighing its military options as it follows up internationally on the US and Israeli strikes.",
      "Ottawa's response will include 24-7 assistance and consular access for Canadians in the region, Global Affairs Canada said in a statement late Sunday night.",
      "Video shows protests across the world in response to US air strikes on Iran.",
      "Plus, a farmer’s fire brigade in Canada.",
      "Ageing US mine-sweeping fleet ill-matched to counter a possible revival of 1980s campaign to blockade waterway",
      "The last-minute demonstrations drew hundreds of people in some cities, fewer in others. Many expressed displeasure with the Iranian leadership but were against any more U.S. involvement in another war.",
      "NATO Secretary General Mark Rutte denied that the military alliance is acting hypocritically over the US strike on Iran.",
      "A senior Iranian diplomat condemned the US strikes on its nuclear sites, after attending an emergency IAEA meeting.",
      "BBC security analyst Gordon Corera examines how much damage is likely to have been caused to Iran's nuclear sites.",
      "<p>Why does a country with large oil reserves feel such a need to have home-grown civil nuclear energy?</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis – live updates</a></p",
      "Through revolution and upheaval, the program has become intertwined with the country’s security and national identity.",
      "<p>Israel says it has attacked Iranian security command centres, targets in Tehran including Evin prison, and access routes to the Fordow nuclear site</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/16/living-in-iran-how-have-you-been-affected-by-the-recent-conflict-israel-strikes\"",
      "Washington&#039;s support for Kyiv, already in doubt under President Trump, is set to decline further, analysts say.",
      "Code-named \"Operation Midnight Hammer,\" the top-secret U.S. attack on Iran's nuclear facilities was launched overnight .",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE8tMXlsbHBKS1pQLUgzTlFhNDVYS2lGU3g3eC1OUGUzQ0duSzlONUZxU2d2X2VPVUo0RU9TdWFwc1hpWGZ3WWYxMy1EUFNzcHpOTUlELVdjaWVuZVhFY1dXVmxrRTF3NTdvaFlUVQ?oc=5\" target=\"_blank\">U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says</a>&nb",
      "Ventilation shafts “are probably the most vulnerable points of the facility,” one expert said.",
      "Initial military assessments of the buried nuclear site contrast with the statement on the strike there made by President Trump.",
      "Donald Trump has said the images showing the aftermath of Iran’s nuclear sites following the US attack reveal &quot;success&quot;.",
      "Tehran has criticised Rafael Grossi for rhetoric it believes helped pave way for strikes, mulling exit from NPT.",
      "Already up 15% over the last two weeks, prices for the Brent crude oil international benchmark could soar to its highest level in years if Iran blocks a key oil chokepoint.",
      "<p>Rolling coverage of the latest economic and financial news</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/23/what-is-the-strait-of-hormuz-iran-threat-close-global-trade-oil-shipping\">The strait of Hormuz: what is it, and why does it matter to global trade?</a></p></li><li><p><a",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE11NldzRS1CR2dBVFFCdWo4bGxYWTJ6WGliUGQ0NURBNm15ZmczWnI5N3I0Y3FzQUhqcXV4WFE4N0RaNnVNN01yOXFhLUdDa1BWUENPY3c4RXJ3QmFVVXFRZS1mOWRVVzRsZ1JhckNSWQ?oc=5\" target=\"_blank\">Iran parliament reportedly backs closing Strait of Hormuz, which could spike ",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10YUtRd3lzVXY5bFRDZ2c5WUotYlRTbUlpcGl4SVFpT1ZqczFNNnlWWTduUVdSbTVvZmJDbDlydHBPTUFkcFpaWGJmd0k0ZWZvR2I3WWZ2cER4QURwLUdIVi1JZTZMTUxwSVZTcGxNempXc1l5UE0zeER3?oc=5\" target=\"_blank\">Live: US Says It Launched Airstrikes on Iran Nuclear Sites</a>&",
      "After the Iran bombings, more officers were placed at religious, cultural and diplomatic locations, Mayor Eric Adams said. The M.T.A. and the Port Authority have activated counterterrorism protocols.",
      "In phone interviews, people in Iran voiced fear, sorrow and grief after waking up to the news of strikes on the country’s nuclear facilities.",
      "Saudi Arabia, Qatar and other Gulf Arab countries expressed dismay over the American attack, but stopped short of condemning the United States, a key ally.",
      "In interviews, Trump supporters expressed a range of emotions — anger, wariness and avid support. But the dominant theme? Anxiety about what comes next.",
      "<figure><img alt=\"Carlos Barria / Pool / Getty Images Middle East equities were rallying Sunday on hopes U.S. attack would hasten a resolution.\" src=\"https://www.investopedia.com/thmb/FVFtXMfh6dCMA0p_sPsSGGYfXmY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2220645738-",
      "The attacks on Iran&#039;s nuclear enrichment facilities have not increased radioactivity so far.",
      "Iran may close the vital maritime route, through which one-fifth of the world’s oil supply is shipped every day."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/28b8/live/599b5910-500f-11f0-8c0a-5b816c079050.jpg",
    "titles": [
      "What is the Strait of Hormuz and why does it matter?",
      "What the heck is ‘breakfast ketchup’ and why is Heinz pushing it?",
      "What Is the Strait of Hormuz and Why Is It Important?",
      "The US bombed Iran. Now, the whole world is watching the Strait of Hormuz.",
      "Tankers showing caution around Strait of Hormuz after U.S. attack on Iran nuclear sites",
      "Total Obliteration? Voids, J-Hooks And Damage At Iran’s Nuclear Sites",
      "Satellite Images Suggest US Avoided Iran’s Nuclear Reactors",
      "U.S. isn't at war with Iran, 'we're at war with Iran's nuclear program,' Vance says",
      "Iranian Canadians and others watch and worry after U.S. strikes on nuclear sites",
      "Some Israelis Expect New Era After U.S. Strikes on Iran. Others Are Skeptical.",
      "U.S. strikes on Iran upstage NATO leaders summit tailored for Trump",
      "After U.S. Strikes on Iran, Prospects for Diplomacy Look Dim",
      "After U.S. Strikes, Iranian Officials Try to Project a Sense of Normalcy",
      "US strikes on Iran could damage global growth, says IMF chief",
      "China Says the U.S. Damaged Its Own Credibility by Striking Iran",
      "Iran says its Fordow nuclear facility has been struck again",
      "What the US and Israel really want from Iran",
      "Is the U.S. at War With Iran? What to Know About Trump, Congress and War Powers",
      "What to Know About Iran’s Notorious Evin Prison",
      "Will Iran Decide to Retaliate Against the U.S.?",
      "As the US chooses destruction over diplomacy in Iran, Australia has to decide between principle and prostration | Allan Behm",
      "Iran Had Vowed to Retaliate. Now, It Faces Grim Choices.",
      "Real success for Trump in Iran will require de-escalation",
      "“Will Israel accept” Iran if it’s not a nuclear threat?",
      "At Trump's request, Israel cleared way for U.S. bombers in Iran - Axios",
      "Trump urges \"drill, baby, drill,\" but U.S. producers are cautious - Axios",
      "Oil prices climb but don't soar after U.S. strike, Iranian threats - Axios",
      "Trump rants about Medvedev and oil prices on social media as questions remain about effectiveness of US strike on Iran – live",
      "Oil market's ho-hum response to Iran strike seen as \"remarkable\" - Axios",
      "Gulf markets end higher, shielded from major turmoil after the U.S. strike on Iran",
      "Trump administration says U.S. does not seek regime change in Iran - Axios",
      "Officials assess damage from U.S. strikes; Trump raises possibility of regime change in Iran",
      "Trump bombs Iran, talks regime change, raises the ghosts of Iraq",
      "As Trump floats regime change to ‘Make Iran Great Again’, Deutsche Bank warns Europe has drawn the short straw in escalating conflict",
      "Israel-Iran live updates: IDF expands scope of attacks; Trump raises prospect of regime change in Iran",
      "Israel-Iran live updates: White House 'confident' strikes hit enriched uranium store",
      "Mapping strikes in the Israel-Iran conflict",
      "U.S. issues ‘worldwide caution’ alert as Israel-Iran conflict intensifies",
      "U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnight Hammer\" strikes on Iran - Axios",
      "\"It was a headfake\": Inside Trump's secret orders to strike Iran - Axios",
      "Trump floats regime change in Iran - Axios",
      "Top Democrat says Trump strikes on Iran a 'massive, massive gamble'",
      "Russia condemns U.S. strikes on Iran but takes no concrete actions",
      "PM backs Iran strikes but says Australia is ‘deeply concerned about any escalation’",
      "Putin Condemns Strikes on Iran but Stops Short of Offering Concrete Support",
      "Trump insists ‘monumental damage’ done by US strikes in Iran but others are more cautious",
      "Lyse Doucet: What US and Iran do next could be even more momentous",
      "Watch These Bitcoin Price Levels Amid Volatile Trading After U.S. Strikes Iran",
      "Global Stocks Edge Higher, Oil Pares Gains After US Strikes Iran",
      "U.S. braces for heightened threats in wake of Iran strikes - Axios",
      "With 40,000 troops in the region, U.S. braces for response as Iran weighs its options",
      "Iran vows response to US strikes as it hits back at Israel",
      "Canada deploys ‘crisis emergency response’ as Iran-Israel strikes continue",
      "Global protests over US strikes on Iran",
      "Monday Briefing: The U.S. Struck Iran",
      "Military briefing: will Iran start a new ‘tanker war’?",
      "Small Protests Against the U.S. Attack in Iran Sprouted Up Over the Weekend",
      "NATO chief denies being hypocritical over US strikes on Iran",
      "Iranian ambassador condemns US strikes after IAEA meeting",
      "Watch: How successful have the US strikes on Iran been?",
      "Why is Iran’s nuclear programme so essential to its identity?",
      "Iran’s Nuclear Dreams May Survive Even a Devastating American Blow",
      "Israel-Iran war live: Israel strikes Iran’s Fordow nuclear site and targets in Tehran",
      "As Israel-Iran war escalates, Ukraine fears ‘more losses’ to Russia",
      "How bunker-busters and B-2 stealth bombers hit Iran's nuclear program",
      "U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says - Axios",
      "Satellite Images Show What U.S. May Have Targeted at Iran’s Fordo Nuclear Site",
      "Iran’s Fordo Nuclear Site Said to Look Severely Damaged, Not Destroyed",
      "Trump claims ‘bullseye’ after pictures of Iran’s nuclear sites emerge",
      "UN nuclear chief estimates damage to Iran’s facilities ‘very significant’",
      "Rising Oil Prices Could Spike Another 30% If Iran Blocks Strait Of Hormuz, Goldman Warns",
      "Goldman Sachs warns Brent crude could hit $100 per barrel if strait of Hormuz is disrupted; oil dips as Trump demands lower prices – as it happened",
      "Iran parliament reportedly backs closing Strait of Hormuz, which could spike oil prices - Axios",
      "Live: US Says It Launched Airstrikes on Iran Nuclear Sites - Bloomberg",
      "NYC Increases Police Presence at Vulnerable Sites After U.S. Bombings in Iran",
      "‘We’re All in Shock’: Iranians React to U.S. Attack on Nuclear Sites",
      "Gulf Countries Voice Concern After U.S. Attack on Iran Nuclear Sites",
      "6 Trump Voters React to the U.S.’ Bombing of Nuclear Sites in Iran",
      "Investors Brace for Market Fallout From U.S. Strike on Iran Nuclear Sites",
      "US, Israeli strikes on Iran nuclear sites: How big are radiation risks?",
      "Can Iran really shut down the Strait of Hormuz?"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.88,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.883,
    "summary": "The United States conducted airstrikes on three nuclear sites in Iran, marking a significant escalation in the conflict between Israel and Iran. The operation, named \"Operation Midnight Hammer,\" involved B-2 stealth bombers, fighter aircraft, and submarine-launched cruise missiles targeting the Fordo, Natanz, and Isfahan sites. The strikes have led to widespread reactions, including fear and anger within Iran, international calls for de-escalation, and varied responses from global leaders. Initial assessments suggest the attacks caused massive damage to Iran's nuclear capabilities. President D",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant international event, offering readers some insight into the geopolitical situation. However, it does not suggest any solutions, improvements, or innovations, and it does not provide a comprehensive understanding of the causes or impacts of the situation."
  },
  {
    "title": "Keegan Bradley Eyes Potential as First Playing-Captain in 60 Years After Win",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 10:13:33 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After winning the Travelers Championship, will Keegan Bradley be a playing captain for the U.S. at the Ryder Cup in September? That's a decision only he can make.",
      "Keegan Bradley believes there is more chance of him becoming the first playing-captain of the Ryder Cup in over 60 years after snatching a dramatic victory at the Travelers Championship.",
      "It was always going to come down to this – should U.S. Ryder Cup Captain Keegan Bradley pick himself to be on the 12-man team later this year.",
      "The U.S. captain moved into the top 10 of the U.S. Ryder Cup standings and world rankings with his win at the Travelers Championship"
    ],
    "image_url": "",
    "titles": [
      "Bradley win 'opens the door' as playing captain",
      "Will Bradley be Ryder Cup playing captain? Winning changes things!",
      "Schupak: Keegan Bradley must play at 2025 Ryder Cup, but he doesn't have to be captain, too",
      "2025 Ryder Cup standings: Keegan Bradley not playing as captain would create bigger distraction for U.S."
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.959,
      "consensus": 0.935,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.868,
    "summary": "Keegan Bradley, following his victory at the Travelers Championship, has positioned himself as a potential playing captain for the U.S. Ryder Cup team in September. This win propelled him into the top 10 of both the U.S. Ryder Cup standings and world rankings, intensifying speculation about whether he will select himself as part of the 12-man team. Bradley acknowledges the possibility of becoming the first playing-captain in over 60 years, but the final decision rests solely with him.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Keegan Bradley's potential role in the U.S. Ryder Cup team and the implications of his recent win. It increases awareness about the rarity of a playing-captain in the sport. However, it does not report on solutions or improvements, nor does it give the reader actionable insights."
  },
  {
    "title": "Tesla Launches Robotaxi Service in Austin with Select Model Y Fleet",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:52:41 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "Axios",
      "Investopedia",
      "BBC",
      "TechCrunch"
    ],
    "domains": [
      "business",
      "general",
      "technology"
    ],
    "snippets": [
      "Tesla hopes to rival firms already offering driverless ride-hailing in the US and around the world, such as Waymo, Zoox and Baidu.",
      "Tesla has started giving rides in driverless Model Y SUVs in Austin. Details are still sparse, but limited service is open to vetted and invited riders.",
      "The launch puts Tesla head-to-head with Alphabet-backed Waymo, which is already operating a fleet of robotaxis in several cities.",
      "<figure><img alt=\"Tim Goessman / Bloomberg / Getty Images Tesla launched its autonomous vehicle service on Sunday, with several Model Y vehicles operating without anyone in the driver's seat\" src=\"https://www.investopedia.com/thmb/7D1IPM8GnyPk3FZ4pIa43kEQctY=/filters:no_upscale():max_bytes(150000):s",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1HVzBvU3pmSmNucGlRS2hnR1hxUEdNYTlzTnJQeWFfbXN3SV9lZTBkTFptQm44YVN2WnNKbXIyUWdzZTNyb201T3JaT0ViUF92WUl3cFFvcnZSNHFQakhpc2RRaTFEUlo5TUJFSUNPVmk?oc=5\" target=\"_blank\">Tesla's robotaxi service begins cautiously in Texas</a>&nbsp;&nbsp;<font col",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPbWhMeTJCcGRObkhOOTR2dzNGZkh2MlFaVTBhZ0dtOVMxRVh3VzVfcjF1WFFGczhucVBIc0VkVnhYdVpUSWI5Q0dTUWJUQVNqZF9KRE1WendBRWMtcThXaExMZzhwemllY2lRY0gxV1JKcWxnMng0WmVnSXFUNUFsWnk3UmVudjlINl9SYy1WTTBEYlZFTFF3TlFR?oc=5\" target=\"_blank\">Delta-8 THC will st"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9039/live/9d4cfc60-501c-11f0-b2cc-8d0e5d29c10e.jpg",
    "titles": [
      "Tesla launches its long-awaited robotaxis in Texas",
      "Tesla launches robotaxi rides in Austin with big promises and unanswered questions",
      "Tesla stock pops 10% as Musk touts 'successful' robotaxi Austin launch",
      "Tesla Stock Jumps Following Robotaxi Service Launch",
      "Tesla's robotaxi service begins cautiously in Texas - Axios",
      "Delta-8 THC will stay legal in Texas - Axios"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.895,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.849,
    "summary": "Tesla has launched its Robotaxi service in Austin, Texas, deploying a small fleet of driverless Model Y SUVs. Initially, the service is available to a select group of vetted and invited riders. The operation is confined to a limited, geofenced area in the city, with only 10 to 12 vehicles being used for the launch.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress and innovation in the field of autonomous vehicles. It provides useful information about Tesla's new service, which can help readers understand the current state of autonomous vehicle technology and its implementation. It also increases awareness about the systems and trends in this field."
  },
  {
    "title": "UK to Ban Palestine Action Group Under Anti-Terror Laws After RAF Base Attack",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 15:47:40 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "It comes after what she called a \"disgraceful attack\" on an RAF base and as a protest takes place in central London.",
      "<p>Home secretary to ignore warning from group’s lawyers that doing so would be ‘unlawful, dangerous and ill thought out’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/jun/23/david-lammy-us-strikes-iran-labour-keir-starmer-uk-politics-latest-updates-news\">UK politics live – l",
      "The British government announced plans to proscribe the group, Palestine Action, after members broke into a military air base.",
      "British government will use antiterrorism laws to ban campaign organisation in wake of damage to planes by activists."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a7a2/live/02b500e0-5039-11f0-8c47-237c2e4015f5.jpg",
    "titles": [
      "Palestine Action to be banned under anti-terror law, home secretary confirms",
      "Yvette Cooper vows to ban Palestine Action under anti-terrorism laws",
      "U.K. to Ban Palestine Action Group as Terrorist Organization",
      "UK to ban Palestine Action, police clash with group’s supporters in London"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.991,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary": "The British government has announced its intention to ban the campaign group Palestine Action, using anti-terrorism laws, following a break-in and damage to planes at a military airbase. This decision comes despite warnings from the group's lawyers that such a move would be \"unlawful, dangerous, and ill thought out.\" The announcement was made after what was described as a \"disgraceful attack\" on an RAF base, coinciding with a protest in central London.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the British government's decision to ban the Palestine Action group, providing context about the reasons behind this decision. However, it doesn't offer any solutions or improvements, nor does it provide a deep understanding of the systems or causes behind the issue."
  },
  {
    "title": "White Sox Rally to Beat Blue Jays 4-2, Notch First Late-Game Win",
    "domain": "general",
    "location": "national",
    "published": "Mon, 23 Jun 2025 09:17:40 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "Sky Sports",
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated",
      "CityNews",
      "ABC News",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "business",
      "general",
      "sports"
    ],
    "snippets": [
      "The Oklahoma City Thunder made history to become the 2025 champions, dominating the Indiana Pacers 103-91 in Game 7 of the NBA Finals.",
      "<p>With Oklahoma City&#8217;s championship season now cemented, here are some of the sports world&#8217;s best reactions to the Thunder finally hoisting the Larry O&#8217;Brien Trophy.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNV0Z1VUxnQWoyYkhrZEN4NEMxdnZYUjdDT2xWRXkzcEx2OXRrYXIzZTJjYWY4bFB2OHJKUk1RczNBREh0WHI1alRJenAyX3lfWkhxYzRqNGx0VDZCNWRucG84bTlKblozU19pNTkzelJPbmdnYWltNmpUTVFwTXUxUUpCYUVaZnk2eDRCdA?oc=5\" target=\"_blank\">One Stat Summed Up Thunder's Game 7 W",
      "Oklahoma City Thunder capped an extraordinary season by defeating Indiana Pacers 103-91 in Game 7 of the NBA Finals to win the franchise's first title since relocating from Seattle in 2008.",
      "<p>Shai Gilgeous-Alexander poured in 29 points and dished 12 assists, earning Finals MVP honours as the Oklahoma City Thunder topped the Indiana Pacers 103-91 in Game 7 of the NBA Finals for the city&#8217;s first championship win.</p>",
      "<p>Parker Meadows blasted a three-run homer, Wenceel Pérez added a two-run shot, and the Detroit Tigers crushed the Tampa Bay Rays 9-3.</p>",
      "<p>Jose Iglesias got his team on the board with a two-run single in the seventh and walked it off with an RBI fielder&#8217;s choice in the ninth as the San Diego Padres rallied to defeat the Kansas City Royals 3-2.</p>",
      "<p>Kyle Stowers hit his first home run in 31 games, Otto Lopez drove in a pair of runs, and Sandy Alcantara allowed three runs over six quality innings as the Miami Marlins defeated the Atlanta Braves 5-3.</p>",
      "<p>Tommy Pham drove in three runs on three hits, Bailey Falter pitched into the sixth inning, and the Pittsburgh Pirates cruised to an 8-3 win over the Texas Rangers.</p>",
      "<p>Jazz Chisholm Jr. added two hits and two RBIs to his season tally, Will Warren pitched into the seventh inning, striking out six, and the New York Yankees took a 4-2 win over the Baltimore Orioles.</p>",
      "<p>Cal Raleigh continued his hot streak with a two-run blast, Donovan Solano smacked a pair of two-run shots, and the Seattle Mariners crushed the Chicago Cubs 14-6.</p>",
      "<p>Max Muncy crushed a three-run and a two-run shot, driving in seven runs on the day, Shohei Ohtani recorded his first strikeout in a Dodgers uniform, and Los Angeles earned a 13-7 win over the Washington Nationals.</p>",
      "<p>Shohei Ohtani pitched one hitless inning Sunday in his second mound start for the Los Angeles Dodgers, striking out two and allowing just one baserunner on an error by Mookie Betts.</p>",
      "<p>Miguel Vargas added two hits and two RBIs to his season tally, Adrian Houser pitched into the seventh inning, and the Chicago White Sox took a 4-2 win over the Toronto Blue Jays.</p>",
      "<p>Chris Bassitt tossed six strong innings in a loss to the White Sox on Sunday, once again providing the type of rotation steadiness that has become a Blue Jays cornerstone.</p>",
      "The explosive final season of \"Squid Game\" is almost here. Here's what to know about Season 3, including the release date, returning cast, plot details and more.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9FOTZKalkxMnl1b0ZGcjhhSExHbTdfSXpDdlliNjkxRVJyTjZpcVo3SjJ5TF9XV29vRE9mNEpJejhaYVU0bVBJMTZCT3VGY29yNWxMVXJ5SGdUSERjbm1VX0dOaUVtdEhRMWMxX0hhWS1vcmdHUm9oZG1kdUM?oc=5\" target=\"_blank\">Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First ",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQejJyNmFfQ3paWHhBejJ0WXNBbDBSbW16TzRMYU9Wb29LLTl6QzB1VEdEOXRYN1pONDhoQjVHeGNVcDBDekVsZGJxRWEtb2dmdXEwRzNpVkt0VWxaQXo5eERxNzd5QklISmNaX1F2andUNTJjYkxCTGtOQ0NFUkJYN0JTOE9BX01yVlE?oc=5\" target=\"_blank\">Bayern Munich ‘Targeting Second Liverpoo",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPcVJiM2xWNWRCZmo5NjRPZ0JUYTlEYlR6d2ZVUFB3R2xQSVZPVE5GSXdUWi1ESUtoUWVla0dud2d1R1lGdEFKRVZubG1CWDdFQ19xWlB3SnVENVUwNV95Ny1tRHBzaHFCWk1XYlAzcUtEcEV4VzlXM0FHcEZJUlppcnA3QUUwMUFscTJKNWVweEVqVDg?oc=5\" target=\"_blank\">Former Atlanta Braves All-St",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQblFTeHZ4LV9TQnFnSEx4WTBVNWpTSGQwTUdmUGJ2MXFLNnFLRzJnaUlXUGFNRVlXMVlMQ3NfdE9xNFJXRFlDNGlxOUZNMkZqMExxSUVQUDNZY1JKVVY5OXV3YTQyRVZ1QzJRTVlidnp3YkFnWk9pdzFRR1hwTzFxX0dBS2xXTkRwNWVJUkFJcTN4MGhEcjFpYThB?oc=5\" target=\"_blank\">NBA Insider Gives U",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNNEtoVnFRbWk2OXpZR1VKVE9TQmpYLWNObkhIX253bU8wdHVrT2k2d1R6bl9lX2ZWazdhRmNnTmxpNFg3X1BTTVZxVGNHREtJbVRxOTdrRDZqejYyRlJZVzVFMXlJS3lQWXhaSjNXbkpDMUc0cjY4YzFnRFd5MnNHQllINmc?oc=5\" target=\"_blank\">Inter Miami CF Predicted Lineup vs. Palmeiras: H",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPNDNlMk8tNWtIOTRSXzBfS09GTXJsdkVhTXVlMjV6N3pvUGY4QzFhWXdOTHRMY3ZpSnh3cG5Ya1V4b2xWc3MxUXZFazlxOXQ5V3FJWUMtMXBWU25Vb3d5MVJHOGlmWXVITGxialFqOTFuMDBTOWctemFFNXJpeTI0cTNKVGtJNGwwV2VRQw?oc=5\" target=\"_blank\">Ben Griffin Responds to Jack Nicklaus",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1qcTJSNGoyMkhVeDVBb09Kb2gzc3R2c3lKWk4weWxaZ0huZzNEd1JsZ2d6YlJHd3FaNVF4R3U5SnVvU24tWFh4dm5UZzM1NV9WU0RmeUpVVXhvVUV4aWJPZUdvbkNJVjlvVGxlOGs1RFlPLU1GYmJDWTFSaw?oc=5\" target=\"_blank\">Ilkay Gundogan Responds to Transfer Speculation, Man City Tea",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1PeDJNNUVsajFsMG5xTTRscG1NdGF1cUx5Q216cDZlNUlDXzZrVEwxZmNKUEtzcVkyOFpBSWY4TUxVVkY4aWxvX0o2UzV1TlRzdkxidDhjME5zem42Vlh1QzVjUDFENllqR0JDSEZKbURwSEswSlRN?oc=5\" target=\"_blank\">‘Not Giving Up’—Barcelona Suffer Blow in Nico Williams Transfer Rac",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPOFQtN0hEaVlXVDRKMFVPLVBvWWNYRkFLNWhpUzB2RDk4S0ZDWjE2UUlHdV9BRFpfTTdtZ3hpWkdIVzUxRmx1SjdtUzdoMmR5RVNLajZONFBkWWllTzNEeEpLMmtfV09hcTBlUWV3WTgzRkRPbFpIcWVlRXpOeDVpVGQ1VG5GdzZXVUp6Ni1TOEUzdw?oc=5\" target=\"_blank\">Broncos DC Explains How Hufan",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9EQjE2SjUzc19MSEFNNDVMQkhrQjZQYXlMS2p4Xy01SHN1WS0zSkpjRTNnZS0tU2lGa2N3NFZDdU1EVjBqUGZva0pZWWh5VnZTb0lsanlkTEZmUHdYTm5qb296dDVCVnpjYmZLNVdnbFVoVVR3Vk53UXpTanZrV1E?oc=5\" target=\"_blank\">Rockets Acquire Kevin Durant in Blockbuster Trade With S",
      "<p>Kevin Durant is set to add another chapter to his long and winding NBA story.</p>\n<p>The Phoenix Suns have dealt the 15-time All-Star to the Houston Rockets in exchange for Jalen Green, Dillon Brooks, the No. 10 pick in the 2025 draft and five second-round picks ending his fruitless run in the de",
      "Shai Gilgeous-Alexander joins select company as NBA Finals MVP",
      "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxOX05ReHNIOG55Tm1WcHA2Q3ZWRk01SXp3NEt4b01VbHVoeUZXSkQ1QWZXbmZ5V2IzajJHdWNELV9WTllxSjdqTC0yVjVpYm5iY1FBa0pTT2ZqaHNON1Vsa3ZjNXZlbGFieHljc3g3c2VsWEhkNHJHWGc4Q213UDZaVHJRMFhhR1Z2UnVqVHdLQzdmZFA4VS1qbFc4SGZkU3kt?oc=5\" target=\"_blank\">New York Kn",
      "Shai Gilgeous-Alexander joins select company as NBA Finals MVP",
      "The Rockets' trade for Kevin Durant and the injury suffered by the Pacers' Tyrese Haliburton shook up the early odds to win next season's NBA title, but the clear-cut favorite remains the champion Thunder.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxONmxVaTBHT2JtM09menZwcUdWbWlqVjFhaTZqRi1UU2FDUGhNTXVuRVpEeGRpTHlRWm5fMGV5WktDNDZsNUEySHlCMEZoQm90VGdNTzN1b2ZhYlNxT2JKaEpKd2kwNkxDZENSYUNKV1A4N2NHRXpvZnktMUhqdGFmNFlUamRxT210VnhtQmMyNVU2UFVR?oc=5\" target=\"_blank\">Details of Heat’s Failed Fi",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQanlLb3pnUFp6QTFrYWFtSThqVG5ZZUR3WTRxcGhqM2hjYmI1X0NYaFQ5SV91ekFEQkhEQ09iVVNmRmxUUFgxdGpMMjh1Tlc2V1RBT2tnNm9qOWNkS1FpRmE2Y0E3b2ZSeTBmXzA1anNuOWpaMnk3ZFZwTEZLNjhxb201SDhsUzV4enAzaFNXUE5sUWx6eWlKM3ZR?oc=5\" target=\"_blank\">Maple Leafs Reporte",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPekh6eTZ6b2NITzdkd2taRGFTMGoycUZvNUZUNlgteHFiZm1WTndoUHNySjNRNnNuTFA0VmQtQmF4eUkxOG1wMFR5MWMxOG96T3pESTQ1X1hQSF9Gam5NVmxmRGVhbzlKTVFMWmhKZlp3RjAxNmIzOXhHT05LZU9fNnJSeEJNekRxMml6Mi1BLVZ2NlBw?oc=5\" target=\"_blank\">Travis Hunter Makes NFL His",
      "<p>Two-way college star and reigning Heisman Trophy winner Travis Hunter, the second overall pick in April&#8217;s NFL draft, signed a four-year, $46.6 million contract with the Jacksonville Jaguars on Sunday.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNb2pBNTI2dC1iM0RldzBUT3BGZzdjRy1sTVFmZU9GUnRSRGxuMlBVTkhIOTk5akM3R2Z2anJocENNa1NHLWVrMDc2Z1IxdGpjTlQ1ZG5pam1ibEY1dXVSa2xHWGUtXy1rUWEzVHpBdEhZb1JkdHZLX3M2aHpOdFlDc19STmRGeHc?oc=5\" target=\"_blank\">Magic Johnson Makes Prediction for Rockets A",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPeXFGaG1YTElQb1E0Qk1LR2JwYklnZnpNVzVBRUJUcXhUcWk2OTFzazBMYlFDOHEtOTdoNlYwZEZ3RDVCeTVFRXZLV3htZ2NHdUJ5ZVNDbE9VNnA1eS1hZXBacEk2VzlCLS1HRV9hRmhHekVia2RfMzhOSE0xcm1zSlhPUWJJelhpcHBWcXY4T21UMHlkbkYtNg?oc=5\" target=\"_blank\">Details Released Abou",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxOWEVqV2s5aHEtd2w3SGtTNmdtOVlLaWFPbnVET0pvMEVuSWV2ajJKS1ZGbERwZC1VVTdrZXpEODJiSkNocW50T3I1QUhuUHRZM3RvaS1Xd1VPM1VXS1QwNTEzSlQtMjg2cklRS0hxeXpsekgzS0ZkRzFYNWczWm5rQ0tYcTNpbzFvMFZZMmYwZmE5OUhHTkZpNExqdw?oc=5\" target=\"_blank\">Braves' Brian Sni",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPeWU5SHpXdjFwemszb042U1R3eGg5bmpIQjBvaXNwVk9CVmRqZTJhdElxUUEzR0NQRXBGVEdHeE1GTWs1WnhvZjFoaGo3V0xYS2lGeWhnYWxEVUhqMk1oMDA3cHlKa0F6NXhaV3NkRktsYWd2STRhel96ZGt3WjZmYmtNY0c5UlhCaEkyOHl4Rmc0dw?oc=5\" target=\"_blank\">New York Yankees Surprisingly",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPb3RpTlFHR2xIRFAtelZqcGV0Mlg2WDdHZ3FqVG1sZ0dvQXY4U1VLcnlrdnZHZEZPTU8yQ2lqS004UUUzdHc5RGVBQ0dxQTdIX3gwVU1Hc1c3bzhqdmVHSS1GdTU2eTM5d0xhWTFSS0N2aUcxczFzeEY1REQzOXN5djJiSE5GaldhSXB4ZVh4TVRhNm1QZklkTw?oc=5\" target=\"_blank\">Rockets New Look Star",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOS0Jyb3VWYldtTHFrZWd5RUdvdU9jX3BwLXpPR1pZVWt0SWctYmt2SEpJQk43THBsRU0yQTNZeVloU2lzcjV0dnBsaVk4UTYyazA3NlhyWjlKU3RuUWZEWVVqbGZwTkFRY01vVnVBdXUzR0dJVUpmZHV1QmJ3emh6Mm82OG43QU9HNnRQek9tY3EweUFzS0w0Vg?oc=5\" target=\"_blank\">Braves Outright DFA'd",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE85NkR2ZjZQaExEM0pvUG52V3NQNlVSQnA1aHdwaXJLZThnLTFTME1pVmhqVGcyVDJyUEtvTE1NTjZhSmNyVmlIN293QXZ1Y2JkTnFpR2hyQkUtRjdmSU1yRm5Zd3F3dFBwMHBQVUJIUXhVaFZidzM1Yw?oc=5\" target=\"_blank\">‘Be Smarter’—Thibaut Courtois Slams Real Madrid Teammate</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNNTJoNmZYX2tNRnRsbE1MOFc2UjZyMU83Tkc2OGlRRmh1T3RRakNZZTJBMEVuNVdUbUJ4X2xXeUZ5R2taTGJBVEVMTlczQzZCbWZtejE3dDdONmhnLUlhVnZMNEpwMWVMN25DanlGTmdRdkRPU3ZWVEVZZjlJOXctS01uSG41RDhzYzFkZEZ6dw?oc=5\" target=\"_blank\">Roundtable: Lions Player Not Gett",
      "Claudio Echeverri's 45-minute cameo has given Pep Guardiola plenty to think about, while Xabi Alonso got his first win as Real Madrid coach. Here's what you need to know from Sunday's Club World Cup action.",
      "Pep Guardiola has hailed Claudio Echeverri as an \"incredible player\" after the Argentinian youngster scored his first goal for Manchester City.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOOHVod2xqekNQcGpOR0MyNzRteE5zUkFSQ1pXaHpPN2xGMGlwVTZwUjBTako3eEZiSk1zYjF6eDRtVko0Y0l5bFdpdmszMWpOT1dNc2gwc190am9uZjljVU9tVFJzSHRoREVYeEEtdVdFVlhhZmtqZUtzS2xqb25fTTJtaw?oc=5\" target=\"_blank\">Shedeur Sanders Trolled by Brother Shilo for Spee",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQTVJsbi1ReVRjRGRIWm9DbHBVX0plMENFZVZHRWJpZ0Qzb0xzeUVWWmNyMFI0Z2JPMnhEaEJMQUlzYWk1UUMtYjY2ZW54V2pKZzQzWDFEOGE4SmRFc3NyZGpyU1lOZWp3ZWcxQm96dHNsQ0g5SUplTGF4Qk5tYzJxV01wRXpQdUtMVmptMVdUeWZKUQ?oc=5\" target=\"_blank\">Caitlin Clark Had Brutally Ho",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOMDJySEVpVmQ0U2RJMzluQ1RLNDhXWlpfSS1kcUJqcW9WWDBNQ0pXR2V0alR2VXRPOHpXT1pleDhZR09fWTBDUmRhYmI3U0NraU9VWnhyN3BkNEl4YzJDZUR4SzJSYkpTVV9RX2pqMGt4TXUyVmlIaEY4MmttQldRNzBOa0VydW9kQUFEaVM1MWtwMTRkbHBFYUln?oc=5\" target=\"_blank\">Here's Where LSU's ",
      "<p>LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the College World Series finals.</p>",
      "LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning, and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the Men's College World Series finals.",
      "Kevin Schnall says his ejection was unwarranted and revealed he was wrongfully accused of bumping an umpire",
      "<p>Coastal Carolina coach Kevin Schnall, tossed from the game along with first base coach Matt Schilling in the first inning of the College World Series finals Sunday, said his ejection wasn&#8217;t justified and he was wrongly accused of bumping an umpire.</p>",
      "With LSU winning all of its eight titles since 1991, the Tigers are college baseball's best program.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNUW45VENoNGVNTjB0X2JhM2hHa3BBMkV1R2toZUhoS0NUNHNVQTlieFlrMDh4ZXItUDJrSGYxMDVxLVk2OGR3cjNRdmdmTUtrZ1lOU0ZYc2NoTnBrdFMtNE41Y2lGQmFDenVPYllJc0RyZ0RsNXNDcnVwSkx3QWh3SlpMTnNHUk5GNWc?oc=5\" target=\"_blank\">LeBron James Reacted to Tyrese Haliburto",
      "<p>This is not how Indiana star Tyrese Haliburton saw the season ending.</p>",
      "Haliburton, who strained his calf earlier in the series, went down with an Achilles injury in Game 7 of the NBA Finals",
      "Pacers star Tyrese Haliburton was helped off the court in the first quarter of Game 7 with what his father told ESPN is an Achilles injury.",
      "The entire league landscape changed when the Pacers star went down in Game 7 on Sunday night",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9WT0RCNU1MT28zVjFoa0lOY00xNUhNbjBORjFwdkNkNmUzVFlTdHE2emI4Nl9Rc25VS25Xa1hRU2RJM21HM3JtMWw4bU9NR3FXSGpOdmpSVzNFM2VPTHBRMnBMMG5NQTNhY3UxN20xblQ4X1dxcWIwYzU3R1hudw?oc=5\" target=\"_blank\">Chet Holmgren Sent Classy Four-Word Message to Tyrese Hal",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBsUE9uLTI2Xy04ckRrYXMtYjBCODRtYVFGcklVX0VMbjJILXowTmpwWHN1RW02RWtPS3czcHJYNU5sMlpGWXNGMVEyMUpKdE5yNnl5RHNiX0ZLQmZPdDFxYVBNQlVSMUs3UDlKcGt4VW4zRHM?oc=5\" target=\"_blank\">Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to N",
      "Durant previously starred for the franchise and helped OKC reach the Finals in 2012",
      "Fresh off their first title, the Oklahoma City Thunder are unanimous favorites to repeat as NBA Finals champions in 2025-26, according to the oddsmakers.",
      "Shai Gilgeous-Alexander of Hamilton, Ont., walked off the court for the final time this season, collapsed into the arms of coach Mark Daigneault and finally smiled. It was over. The climb is complete. The rebuild is done. The Oklahoma City Thunder are NBA champions. The best team all season was the ",
      "<p>The list of Canadians to win the NBA title has just added two new names. </p>",
      "<p>Oklahoma City Thunder swingman and Montreal, Que. native Luguentz Dort speaks after an NBA title win, shouting out Canada as well as his parents&#8217; homeland of Haiti and saying he&#8217;s proud to rep his two countries on the biggest stage.</p>",
      "<p>He&#8217;s the most valuable player. The scoring champion. And now, an NBA champion along with NBA Finals MVP.</p>\n<p>All in one season.</p>",
      "<p>Shai Gilgeous-Alexander cemented his legacy as perhaps the best Canadian basketball player of all time, capping off a 68-win season by leading the Thunder to their first NBA championship.</p>"
    ],
    "image_url": "https://s.abcnews.com/images/GMA/250623_gma_ally_oklahomacity1_0731_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  OKC Thunder storm their way to 1st NBA title",
      "‘Start of a dynasty?’: Sports world reacts to Thunder winning NBA title",
      "One Stat Summed Up Thunder's Game 7 Win Over Pacers to Claim First NBA Title - Sports Illustrated",
      "Thunder cap incredible season by beating Pacers in Game 7 to win NBA Finals",
      "NBA Finals Game 7 Highlights: Thunder 103, Pacers 91",
      "MLB Highlights: Tigers 9, Rays 3",
      "MLB Highlights: Padres 3, Royals 2",
      "MLB Highlights: Marlins 5, Braves 3",
      "MLB Highlights: Pirates 8, Rangers 3",
      "MLB Highlights: Yankees 4, Orioles 2",
      "MLB Highlights: Mariners 14, Cubs 6",
      "MLB Highlights: Dodgers 13, Nationals 7",
      "Ohtani pitches sharp inning, hits homer in Dodgers’ win over Nationals",
      "MLB Highlights: White Sox 4, Blue Jays 2",
      "Bassitt provides stability for Blue Jays pitchers despite loss to White Sox",
      "‘Squid Game’ Season 3: Everything To Know About The Thrilling Final Season",
      "Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First Win of the Alonso Era - Sports Illustrated",
      "Bayern Munich ‘Targeting Second Liverpool Star’ Alongside Cody Gakpo - Sports Illustrated",
      "Former Atlanta Braves All-Star Outfielder DFA'd By Padres - Sports Illustrated",
      "NBA Insider Gives Update on Rumored Paul George Trade - Sports Illustrated",
      "Inter Miami CF Predicted Lineup vs. Palmeiras: Herons Try for Round of 16 Berth - Sports Illustrated",
      "Ben Griffin Responds to Jack Nicklaus's Subtle Stray After the Memorial Tournament - Sports Illustrated",
      "Ilkay Gundogan Responds to Transfer Speculation, Man City Teammate Sends Same Message - Sports Illustrated",
      "‘Not Giving Up’—Barcelona Suffer Blow in Nico Williams Transfer Race - Sports Illustrated",
      "Broncos DC Explains How Hufanga & Greenlaw Will Elevate This Defense - Sports Illustrated",
      "Rockets Acquire Kevin Durant in Blockbuster Trade With Suns - Sports Illustrated",
      "AP Source: Suns trade Kevin Durant to Rockets",
      "Thunder become NBA champions; Tyrese Haliburton injured; Rockets land Kevin Durant",
      "New York Knicks Stars Send Well Wishes to Injured Tyrese Haliburton - Sports Illustrated",
      "Thunder are NBA champions | Tyrese Haliburton injured | Rockets acquire Kevin Durant",
      "Durant deal, Haliburton injury shake up title odds",
      "Details of Heat’s Failed Final Trade Offer for Kevin Durant Revealed - Sports Illustrated",
      "Maple Leafs Reportedly Lowball John Tavares With Initial Contract Offer - Sports Illustrated",
      "Travis Hunter Makes NFL History With Huge Payout on Rookie Contract - Sports Illustrated",
      "No. 2 pick Travis Hunter signs 4-year, $46.6M rookie contract with Jaguars",
      "Magic Johnson Makes Prediction for Rockets After Kevin Durant Trade - Sports Illustrated",
      "Details Released About Celtic's Deal For Benjamin Nygren - Sports Illustrated",
      "Braves' Brian Snitker Declines to Place Blame on Michael Harris II - Sports Illustrated",
      "New York Yankees Surprisingly Call Up New Starter - Sports Illustrated",
      "Rockets New Look Starting Lineup Likely Set for 2025-2026. - Sports Illustrated",
      "Braves Outright DFA'd Reliever to Triple-A - Sports Illustrated",
      "‘Be Smarter’—Thibaut Courtois Slams Real Madrid Teammate - Sports Illustrated",
      "Roundtable: Lions Player Not Getting Enough Attention - Sports Illustrated",
      "Echeverri shows he can shine for Man City, Alonso gets first Madrid win",
      "Guardiola hails Echeverri after first City goal",
      "Shedeur Sanders Trolled by Brother Shilo for Speeding Tickets - Sports Illustrated",
      "Caitlin Clark Had Brutally Honest Take on Her Shooting Struggles in Fever’s Loss - Sports Illustrated",
      "Here's Where LSU's Eighth Men's College World Series Title Ranks All-Time - Sports Illustrated",
      "LSU sweeps Coastal Carolina in College World Series finals for second title in three years",
      "LSU chases Coastal, wins 2nd MCWS in 3 years",
      "Coastal Carolina coach sounds off after College World Series ejection, school issues statement after LSU loss",
      "Coastal Carolina coach says CWS ejection was unwarranted, wrongly accused of bumping ump",
      "LSU's latest MCWS title makes the Tigers college baseball's best of all time",
      "LeBron James Reacted to Tyrese Haliburton Injury With One NSFW Word - Sports Illustrated",
      "Pacers’ Tyrese Haliburton exits Game 7, ruled out with right Achilles injury",
      "Tyrese Haliburton's Achilles injury raises many concerns, but there was no question he was playing in Game 7",
      "Haliburton's early exit deflates Pacers in Game 7",
      "Tyrese Haliburton just suffered the most devastating injury in NBA history, and it impacts the whole league",
      "Chet Holmgren Sent Classy Four-Word Message to Tyrese Haliburton After Thunder Won Title - Sports Illustrated",
      "Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to NBA Title - Sports Illustrated",
      "Kevin Durant reacts to Thunder NBA Finals Game 7 victory after joining Rockets",
      "Oklahoma City Thunder unanimous favorites for 2026 NBA title",
      "Canada’s Shai Gilgeous-Alexander leads Oklahoma City to NBA title",
      "Gilgeous-Alexander, Dort join growing list of Canadians to win NBA title",
      "‘My people’: Thunder’s Dort sends love to Canada, Haiti after title win",
      "Canada’s Shai Gilgeous-Alexander captures Finals MVP award",
      "Gilgeous-Alexander, Thunder cement legacy with NBA championship"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.941,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.818,
    "summary": "The Chicago White Sox overcame a late-game deficit to beat the Toronto Blue Jays 4-2, marking their first win of the season when trailing after seven innings. Miguel Vargas played a key role, driving in two runs in the eighth inning. Adrian Houser contributed with a strong pitching performance into the seventh inning. The game was part of a series of MLB matches that also saw wins for the Miami Marlins, Pittsburgh Pirates, New York Yankees, Detroit Tigers, and Seattle Mariners, with notable performances from players across the league.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the game's outcome and key players' performances, but it doesn't offer deeper insights into strategies, implications for the season, or the significance of the win beyond the immediate game."
  },
  {
    "title": "Orcas Use Kelp for Massage in First Marine Mammal Tool Use Discovery",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 15:02:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Phys.org",
      "The Guardian"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "Orcas have been filmed using kelp as a tool to massage each other",
      "Killer whales have been seen detaching lengths of seaweed and using them to massage each other—the first evidence of tool-making by marine mammals. The whales bite off the end of a kelp stalk, position it between themselves and a partner, and roll the kelp between their bodies for prolonged periods.",
      "<p>Behavior in orca population off coast of US and Canada captured by scientists using drone observation</p><p>Killer whales have been observed mutually grooming each other with a type of seaweed, the first known instance of a marine animal using tools in a way that was previously thought to be the "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/47b9/live/c8173050-503f-11f0-86d5-3b52b53af158.jpg",
    "titles": [
      "Killer whales 'massage' each other using kelp",
      "Killer whales make seaweed 'tools' to scratch each other's backs",
      "Killer whales seen grooming each other with kelp in first for marine tool use"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.976,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary": "Scientists have observed killer whales off the coast of the US and Canada using kelp as a tool for mutual massage, marking the first evidence of tool use for grooming in marine mammals. The orcas detach kelp stalks and use them to roll between their bodies and those of their partners, a behavior captured through drone observations. This discovery challenges previous assumptions about tool use in marine animals.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a new discovery in marine biology, providing empowering knowledge about orcas' behavior. It increases clarity around animal behavior, challenging previous assumptions about tool use in marine animals. This new understanding could potentially impact future research and conservation efforts."
  },
  {
    "title": "Trump Media Launches $400M Buyback as Shares Plunge; Trump Remains Top Holder",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 13:28:53 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump indirectly owns more than 114 million shares of the company through a revocable trust and is the largest shareholder.",
      "<figure><img alt=\"Beata Zawrzel / NurPhoto via Getty Images Shares of Trump Media &amp; Technology Group have lost nearly half of their value in 2025\" src=\"https://www.investopedia.com/thmb/zADKMFq6AhkjKtr7s733eu1YNos=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-21999",
      "Trump Media, the parent of President Donald Trump’s social-media platform Truth Social, announced a $400 million stock-repurchase program, which could reduce the number of shares outstanding by 10%."
    ],
    "image_url": "",
    "titles": [
      "Trump Media approves $400 million stock buyback",
      "Trump Media Stock Gains as Truth Social Parent Plans $400M Stock Buyback",
      "Trump Media’s ‘DJT’ stock jumps, as planned buybacks could cut share count by 10%"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.944,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary": "President Donald Trump, through a revocable trust, indirectly owns over 114 million shares, making him the largest shareholder of Trump Media & Technology Group, the parent company of Truth Social. The company's shares have significantly dropped in value by nearly half in 2025. In response, Trump Media announced a $400 million stock-repurchase program aimed at reducing the shares outstanding by 10%.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the significant drop in the value of Trump Media & Technology Group's shares and the company's response to this situation. It provides actionable insights for shareholders and potential investors. However, it does not delve into the reasons behind the share plunge or the potential impacts of the buyback program."
  },
  {
    "title": "1985 Air India Bombing Kills 329, Mostly Canadians, Over Atlantic",
    "domain": "general",
    "location": "local",
    "published": "Mon, 23 Jun 2025 08:00:00 EDT",
    "source": "CBC",
    "sources": [
      "Ottawa Citizen",
      "CBC",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<img alt=\"An old family photo of a mother, father and son enjoying a birthday celebration\" height=\"349\" src=\"https://i.cbc.ca/1.7567631.1750463222!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/susheel-gupta-and-family.JPG\" title=\"Susheel Gupta (left) pictured with his father Bal and mother",
      "329 people died aboard Flight 182 on June 23, 2025. The vast majority were Canadians. Twenty-eight were from Ottawa. Yet far too many Canadians have little to no knowledge of the terrorist attack.",
      "Forty years ago, 329 people on board Air India Flight 182 were instantly killed when a bomb inside the aircraft exploded over the Atlantic Ocean, just off the coast of Ireland. On June 23, 1985, Flight 182 departed from Toronto, en route to Mumbai, India. Almost simultaneously, a related bombing at "
    ],
    "image_url": "",
    "titles": [
      "40 years after Air India bombing, son's grief fuels his work in counterterrorism and victim support",
      "Kurl: 40 Years On, we owe it to the victims of the Air India bombing to remember",
      "The victims of Air India Flight 182 remembered"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.916,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.777,
    "summary": "On June 23, 1985, Air India Flight 182 was destroyed by a bomb over the Atlantic Ocean, killing all 329 people aboard, including 28 from Ottawa. The majority of the victims were Canadian. This terrorist attack, one of the deadliest in aviation history, remains relatively unknown in Canada despite its significant impact.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about a historical event, it lacks depth and insight. There's no discussion of the causes, impacts, or any attempts to prevent similar incidents in the future. Therefore, it doesn't contribute meaningfully to the reader's understanding or decision-making."
  },
  {
    "title": "Manchester City Beats Al Ain 6-0, Advances to Club World Cup Last 16",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:39:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "What do PSG, Real Madrid and Inter Miami need? Can Al Hilal and Sundowns still qualify? Al Jazeera explains.",
      "Ilkay Gundogan scored twice as Manchester City thrashed Al Ain 6-0 to secure their place in the last 16 of the Club World Cup.",
      "<p>Flamengo, Botafogo, Palmeiras and Fluminense are not as rich as European clubs but they have heart and heritage</p><p>“The graveyard of football is full of ‘favourites’,” warned Botafogo manager Renato Paiva in what has proven to be this summer’s coldest line in sweltering United States heat. Gri"
    ],
    "image_url": "",
    "titles": [
      "Which teams have qualified for the FIFA Club World Cup round of 16?",
      "Man City score six to reach Club World Cup last 16",
      "Brazilian clubs are upending the global order at the Club World Cup"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.891,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary": "Manchester City advanced to the last 16 of the Club World Cup after defeating Al Ain 6-0, with Ilkay Gundogan scoring twice. The article also touches on the needs and qualifications of various football clubs, including PSG, Real Madrid, and Inter Miami, and mentions the potential for Al Hilal and Sundowns to still qualify. It highlights the passion and heritage of Brazilian clubs Flamengo, Botafogo, Palmeiras, and Fluminense, despite their financial disparities with European teams, underscoring a cautionary note from Botafogo manager Renato Paiva about underestimating teams with heart.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful context about the Club World Cup and the status of various football clubs. It also increases awareness about the financial disparities between clubs and the importance of passion and heritage in the sport. However, it does not provide actionable insights or report on solutions or improvements."
  },
  {
    "title": "Antonio Filosa Named New CEO of Stellantis Amid Challenges, Share Decline",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 13:53:56 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ottawa Citizen",
      "Investopedia"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Antonio Filosa, a 51-year-old Italian native, is taking over as CEO as the automaker deals with fractured relationships, regulatory uncertainty and more.",
      "Even with funding guaranteed, a new school in central Ottawa is a decade away. A little co-operation between school boards could provide a temporary fix, but there's little sign of it.",
      "<figure><img alt=\"Kent Nishimura / Bloomberg via Getty Images Shares of Jeep parent Stellantis have lost nearly 30% of their value this year.\" src=\"https://www.investopedia.com/thmb/pb_fOCn7SkwLB6-f903bRXZ65BA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217020329-91"
    ],
    "image_url": "",
    "titles": [
      "New Stellantis CEO faces slew of challenges, vows to avoid 'mediocrity'",
      "Mault: New Ottawa French-language high school still faces challenges",
      "New Stellantis CEO Shakes Up Executive Team in First Day on the Job"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.953,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary": "Antonio Filosa, 51, has been appointed as the new CEO of Stellantis, an automaker facing challenges including fractured relationships and regulatory uncertainty. Meanwhile, in central Ottawa, despite funding, a new school's construction is delayed by a decade due to lack of cooperation between school boards. Additionally, Stellantis, the parent company of Jeep, has seen its shares decline by nearly 30% this year, as reported by Bloomberg via Getty Images.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the change in leadership at Stellantis and the challenges the company is facing. However, it does not offer any solutions or improvements being made to address these issues, nor does it provide a deep understanding of the causes or impacts of the company's current situation."
  },
  {
    "title": "Lions Demand Top Wallabies for Pre-Test Matches, Threaten Contract Breach",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:08:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The British and Irish Lions have warned Australia the Wallabies' superstars must appear for their Super Rugby sides in the tourists' pre-Test series matches.",
      "<ul><li><p>Ben Calveley expects competitive Force side to face Lions</p></li><li><p>Tour could open up to other countries such as France</p></li></ul><p>Every big tour is a hectic learning curve as the 2025 British &amp; Irish Lions are already finding. The squad had to call off their post-arrival r",
      "The British and Irish Lions have warned Australia they will be in breach of contract if they fail to release their Test stars for all tour games involving Super Rugby teams."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fef4/live/ff2cc350-501e-11f0-a466-d54f65b60deb.jpg",
    "titles": [
      "Lions demand Wallaby stars play in tour games",
      "Lions warn Joe Schmidt over Wallabies player release for tour matches",
      "Lions warn Australia of contract breach if Test players not released"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.9,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary": "The British and Irish Lions have issued a warning to Australia, demanding that the Wallabies' top players participate in the pre-Test series matches against Super Rugby teams. Ben Calveley, representing the Lions, expects a competitive match against the Force and suggests the tour could expand to include other countries like France. The Lions have also stated that Australia would breach their contract if they do not release their Test stars for these games. This development comes as part of the preparations for the 2025 tour, emphasizing the importance of competitive matches in the lead-up to ",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the contractual obligations of the Wallabies and the expectations of the British and Irish Lions. It also raises awareness about the importance of competitive matches. However, it does not report on solutions or improvements, nor does it offer actionable insights."
  },
  {
    "title": "Florida Panthers Celebrate Stanley Cup Win with Fort Lauderdale Parade",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 15:24:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "NHL",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Panthers have won back-to-back championships and held a parade on Sunday.",
      "<p>Champagne was swilled and spilled, cigars were smoked and the Stanley Cup was hoisted a few more times, all with about 400,000 people watching.</p>",
      "<p>Martine Gaillard runs us through the best 60 seconds in sports, and this one was all about the Florida Panthers celebrating their back-to-back Stanley Cup championship run, down in Sunrise, Florida.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPUVZrWkxpVXVySW9XeUNfVG5XdmRzTEZuVVFEeGJoeF9sOGNfRVctLVVxelN3VzhjT0taY1liVEJnTE9icXpJVk1KNDdFUHpZWmdOTE1YSDRrbDQ5Y3h4dzV1UjBQeFlkaExrMWZhZFFhR0R1b0lhY3lLRURraDYyeF9qZw?oc=5\" target=\"_blank\">Panthers continue Stanley Cup revelry with beachf",
      "<p>The Stanley Cup celebrations continue in Fort Lauderdale as the Florida Panthers took to the streets Sunday. Here are some of the top sights and sounds from the parade.</p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers Take Major Heat for What They Did During Victory Parade",
      "‘This is amazing’: Panthers celebrate Stanley Cup with another parade",
      "‘We do what the bleep we want’: Best moments from Panthers’ Cup parade",
      "Panthers continue Stanley Cup revelry with beachfront parade - NHL.com",
      "Sights and sounds from Panthers’ Stanley Cup parade"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.983,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary": "The Florida Panthers celebrated their Stanley Cup victory in Fort Lauderdale with a parade attended by approximately 400,000 fans. The event featured champagne, cigars, and multiple instances of the Stanley Cup being hoisted. This celebration is part of ongoing Stanley Cup revelry involving the team and its supporters.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is primarily celebratory in nature, reporting on the Florida Panthers' Stanley Cup victory and subsequent parade. It doesn't offer much in terms of actionable insights or deeper understanding. It doesn't report on solutions, improvements, or innovations, and doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Health Insurers to Cut Prior Authorizations, Aiding 257M Americans",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 14:09:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Insurers such as CVS and UnitedHealthcare will implement the changes across commercial, Medicare and Medicaid plans, benefiting 257 million Americans.",
      "<figure><img alt=\"Stephen Maturen / Getty Images UnitedHealthcare is among the health insurers that would be affected by reducing prior authorizations.\" src=\"https://www.investopedia.com/thmb/8OIJIEeNj2XF6EqVVEiNttgGh2k=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-218"
    ],
    "image_url": "",
    "titles": [
      "Major U.S. health insurers say they will streamline controversial process for approving care",
      "Major Health Insurers Agree to Simplify Prior Authorizations"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.958,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary": "Health insurers, including CVS and UnitedHealthcare, are set to reduce prior authorizations in their commercial, Medicare, and Medicaid plans. This change is expected to benefit approximately 257 million Americans. The adjustment aims to streamline the process for patients and providers, potentially improving access to necessary medical care and treatments for a significant portion of the U.S. population.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a solution that could improve access to medical care for millions of Americans. It provides readers with a clear understanding of the change being made and its potential impact. The story could be further improved by providing more context on the issue of prior authorizations and why this change is necessary."
  },
  {
    "title": "Study Expands Venomous Animal Definition to Include Snails, Aphids",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 09:36:26 +0000",
    "source": "SciTechDaily",
    "sources": [
      "Phys.org",
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-study-reveals-why-pterosaurs-took-off-during-the-triassic/\" rel=\"nofollow\" title=\"New Study Reveals Why Pterosaurs Took Off During the Triassic\"><img alt=\"Scleromochlus taylori\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"487\" src=\"https://scitechdaily.",
      "Garden snails and aphids are venomous animals. This is the startling outcome of a new study that argues for a radical shift in how we think about venom. It proposes a wider definition that would also include animals that inject toxins into plants and members of their own species."
    ],
    "image_url": "",
    "titles": [
      "New Study Reveals Why Pterosaurs Took Off During the Triassic",
      "Your garden is harboring venomous wildlife, new study reveals"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.871,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary": "A new study has expanded the definition of venomous animals to include species like garden snails and aphids, which were previously not considered. This research suggests that venomous creatures are not limited to those injecting toxins into other animals but also include those that deliver toxins to plants or their own species. This broader understanding of venom challenges traditional views and calls for a reevaluation of venomous biology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an innovation in the understanding of venomous biology. It provides a deeper understanding of the topic and increases clarity around the system of classifying animals as venomous. The story is empowering in the sense that it challenges traditional views and calls for a reevaluation, which can stimulate further research and discussion."
  },
  {
    "title": "Nike Stock Falls 20% YTD, AMD Poised for Growth with AI Chip Demand",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:00:00 GMT",
    "source": "Investopedia",
    "sources": [
      "MarketWatch",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Emily Elconin / Bloomberg / Getty Images Nike shares have lost roughly a fifth of their value since the start of the year\" src=\"https://www.investopedia.com/thmb/0Dxe40-w7RG2ywGjzrKlHB76U60=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2218493327-4166",
      "Melius analysts expect more AI-chip sales as demand grows for running AI models and for AMD’s new offerings to attract hyperscaler and sovereign customers."
    ],
    "image_url": "https://www.investopedia.com/thmb/0Dxe40-w7RG2ywGjzrKlHB76U60=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2218493327-41663a901c4c4310995d85e61b162d05.jpg",
    "titles": [
      "What Analysts Think of Nike Stock Ahead of Earnings",
      "Here’s why these analysts see ‘a lot more to go’ for AMD’s stock in the next few years"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.878,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "Nike's stock has declined by approximately 20% since the beginning of the year. Meanwhile, analysts from Melius anticipate an increase in AI-chip sales due to rising demand for AI model processing. They also predict that AMD's latest products will appeal to both hyperscaler and sovereign customers, potentially boosting the company's market position.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the stock market performance of Nike and AMD, which can aid in decision-making for investors. It also highlights the rising demand for AI model processing, a trend that could have broader implications. However, it doesn't explicitly report on solutions or improvements."
  },
  {
    "title": "Paul Returns to UFC for 317: Topuria vs. Oliveira Showdown",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 13:30:37 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Paul returns seven months after beating 'Iron' Mike Tyson",
      "2025 UFC International Fight Week features one of the best fights the promotion can make",
      "<p>VSiN By The Books&#8217; Dave Ross and Jensen Lewis take an early look at the betting lines for UFC 317: Topuria vs. Oliveira, and offer up a nice way to bet the main event.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/12/2a898558-b499-44af-8205-86f5c62745bc/jake-paul-julio-cesar-chavez-jr.jpg",
    "titles": [
      "Jake Paul vs. Julio Cesar Chavez Jr.: Fight card, date, odds, rumors, PPV price, location, complete guide",
      "UFC 317 -- Ilia Topuria vs. Charles Oliveira: Fight card, date, odds, rumors, time, location, complete guide",
      "Best way to approach betting Topuria vs. Oliveira main event at UFC 317"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.945,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "Seven months after defeating Mike Tyson, Paul is set to return to the UFC. The 2025 UFC International Fight Week will highlight a highly anticipated fight, UFC 317: Topuria vs. Oliveira. Betting experts Dave Ross and Jensen Lewis have provided early insights into the betting lines for this main event, suggesting a promising approach for bettors.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for UFC fans and bettors, offering insights into the upcoming fight and betting lines. However, it doesn't report on progress, solutions, or improvements, nor does it increase awareness about broader trends or impacts."
  },
  {
    "title": "Jets Owner Buys 43% of Crystal Palace for £190M",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 10:13:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "New York Jets owner Woody Johnson has agreed on a £190 million deal ($254m) to buy a 43% stake in Premier League team Crystal Palace from American businessman John Textor, the club announced on Monday.",
      "New York Jets owner Woody Johnson is finally set to get his hands on an English soccer team.  Premier League side Crystal Palace announced on Monday that Johnson has signed “a legally binding contract” to buy the shares of fellow American John Textor, who has a 43% stake in the London club.  “Whilst"
    ],
    "image_url": "",
    "titles": [
      "N.Y. Jets owner buys stake in Crystal Palace team",
      "Jets owner Woody Johnson buys 43% stake in English soccer club Crystal Palace"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.959,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary": "New York Jets owner Woody Johnson has acquired a 43% stake in Premier League club Crystal Palace for £190 million ($254 million), purchasing it from American businessman John Textor. This transaction was confirmed by Crystal Palace on Monday, stating that a legally binding contract has been signed between Johnson and Textor for the sale of the stake.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a significant transaction in the sports world. However, it does not provide deeper insights into the implications of this move, the strategy behind it, or how it might affect the teams involved."
  },
  {
    "title": "Chromebook Plus laptops like Lenovo’s sleek, new 14-incher are getting free Gemini AI features",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google announced a handful of new Gemini AI features for Chromebook Plus laptops, including a sleek, new 14-inch flagship device from Lenovo that I got to handle recently. The new AI functions include select to search, which allows you to long press the launcher icon or take a screenshot and do a Go",
      "Google's adding a slew of AI features to the Chromebook Plus line, including a search and text capture tool, NotebookLM, and a tool for simplifying text."
    ],
    "image_url": "",
    "titles": [
      "Chromebook Plus laptops like Lenovo’s sleek, new 14-incher are getting free Gemini AI features",
      "Google adds AI features to Chromebook Plus devices"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.935,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.662,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "Without a summary, it's difficult to fully evaluate the story. However, the title suggests it may offer basic awareness about new features in Chromebook Plus laptops, but it doesn't provide depth or insight into what the Gemini AI features are or why they matter."
  },
  {
    "title": "Max Scherzer Returns to Blue Jays After Injury Hiatus",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 13:29:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Scherzer has been out since late March with thumb inflammation",
      "<p>The Toronto Blue Jays are set to welcome back a three-time Cy Young award winner.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/23/fd7455ba-be8c-4c3e-a7a9-b7e4ce9625d4/scherzer-getty.png",
    "titles": [
      "Blue Jays veteran Max Scherzer set to return from injury Wednesday: 'Just have to get out there'",
      "Blue Jays’ Max Scherzer to start Wednesday vs. Guardians"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.945,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Three-time Cy Young award winner Max Scherzer is set to return to the Toronto Blue Jays after being sidelined since late March due to thumb inflammation. His return is a significant boost for the team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the return of a key player to the team after an injury, which is useful for fans and those following the team. However, it lacks depth or insight into the implications of this return, the player's recovery process, or the team's strategies moving forward."
  },
  {
    "title": "Princeton Names Courtney Kessel as Women's Hockey Coach",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 15:40:20 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Princeton made it official on Monday in announcing Courtney Kessel’s hiring as coach of the women’s hockey team, a week after the two sides were finalizing the agreement.  Kessel spent the past two years coaching the PWHL Boston Fleet and returns to Princeton where she spent four seasons, from 2019-",
      "<p>Princeton made it official on Monday in announcing Courtney Kessel’s hiring as coach of the women’s hockey team, a week after the two sides were finalizing the agreement.</p>"
    ],
    "image_url": "",
    "titles": [
      "Courtney Kessel leaves PWHL Boston Fleet in return to Princeton as head coach of women's hockey team",
      "Courtney Kessel leaves Fleet to take over as Princeton women’s hockey coach"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.989,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary": "Princeton University announced on Monday the hiring of Courtney Kessel as the coach of the women's hockey team, finalizing an agreement that was in discussion for a week. Kessel, who previously coached the PWHL Boston Fleet for two years, returns to Princeton where she served for four seasons starting in 2019.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story informs readers about a new appointment in a university's sports team. However, it does not delve into the potential impact of this hiring on the team's performance, the coach's plans or strategies, or the significance of this move for women's hockey."
  },
  {
    "title": "Nik Storonsky Secures Musk-Like Share Deal Ahead of SoftBank Funding Round",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 04:00:22 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Nik Storonsky struck deal before SoftBank funding round that awards him more shares if valuation clears set hurdles",
      "<p>Fintech firm’s founder Nik Storonsky has reportedly secured Elon Musk-style deal that would pay out in stages</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jun/23/oil-price-imf-iran-strikes-stock-markets-business-live-news-updates\">Business live – latest updates</a></p></l"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5931e75f-f816-4b02-ba3e-c2497c9018c7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Revolut chief in line for Musk-style payday at $150bn valuation",
      "Revolut CEO ‘could get multibillion-dollar windfall if its value passes $150bn’"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.775,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Nik Storonsky, the founder of a fintech firm, has negotiated a deal similar to one made by Elon Musk, which grants him additional shares if the company's valuation meets certain benchmarks. This agreement was established prior to a funding round led by SoftBank. The deal is structured to reward Storonsky with shares in stages, contingent on the company's valuation surpassing set thresholds.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story offers useful information about a significant business deal, which could be beneficial for those interested in fintech or investment trends. It also provides some insight into how such deals can be structured. However, it doesn't provide a broader context or highlight progress in a broader sense."
  },
  {
    "title": "Boston Bruins Sign Defenseman Mason Lohrei Ahead of Free Agency",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 15:12:59 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQVEZza0NadlNWUjZEb0FCcFE4MllXVVNwX1ZKMFdDWTRWRmtkUkFFUUFlRFFPWTRFQUx6UmZNeHU4UVNMd19PVXI5cVVJQkRiNllKcW1Bc2t4N2padlhabVYxN000bHJHWkVxZktETnpyMHZ1RjVrc3RxWUZrUmdWTnlNb3FGQTRFWXZCbUxiQko?oc=5\" target=\"_blank\">Bruins Sign Mason Lohrei to Two-",
      "<p>The Boston Bruins are locking up one of their young blue-liners before he hits restricted free agency. </p>"
    ],
    "image_url": "",
    "titles": [
      "Bruins Sign Mason Lohrei to Two-Year Contract Extension - NHL.com",
      "Bruins sign Mason Lohrei to two-year, $6.4 million contract extension"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.979,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary": "The Boston Bruins have officially signed defenseman Mason Lohrei ahead of his transition to restricted free agency. This move secures one of the team's promising young players, ensuring his continued presence on their blue line for the foreseeable future.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story reports on a significant event in the sports world, it lacks depth in terms of providing insights into why this move was made, how it could impact the team's performance, or what it means for the player's career."
  },
  {
    "title": "SportsLine Model Identifies Top MLB Pitcher Strikeout Bets for Monday",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 15:38:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Monday's nine-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/12/2eac0d3a-5475-44a2-a720-8fa04b997ea2/blackburn-imagn-images.png",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Mets starter against Braves at plus odds"
    ],
    "score_components": {
      "magnitude": 0.209,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.499,
    "summary": "The SportsLine Projection Model, after running simulations of every MLB game scheduled for Monday 10,000 times, has pinpointed the top three pitcher strikeout prop bets. This analysis is based on a comprehensive review of the day's nine-game MLB schedule.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights for those interested in betting on MLB games, based on a comprehensive review of the day's schedule. It contributes to the reader's understanding and decision-making process, but it doesn't increase awareness of broader trends or impacts in the sport."
  },
  {
    "title": "First Trust Canada Announces Cash Distributions for Multiple ETFs",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 15:03:44 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "TSX: FUD, FSL, ETP, CIBR, QCLN, FHG/FHG.F, FHH/FHH.F, FDL, FINT, FST &#38; BLCK Cboe CA: FJFB, FJFG, SDVY/SDVY.F &#38; SDVD TORONTO, June 23, 2025 (GLOBE NEWSWIRE) &#8212; FT Portfolios Canada Co. (“First Trust Canada”) is pleased to announce cash distributions for its Exchange Traded Funds (“First "
    ],
    "image_url": "",
    "titles": [
      "FT Portfolios Canada Co. Announces Cash Distributions for Its Exchange Traded Funds"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.477,
    "summary": "On June 23, 2025, FT Portfolios Canada Co., also known as First Trust Canada, announced cash distributions for its Exchange Traded Funds (ETFs) listed on the TSX and Cboe CA. The ETFs affected include FUD, FSL, ETP, CIBR, QCLN, FHG/FHG.F, FHH/FHH.F, FDL, FINT, FST, BLCK, FJFB, FJFG, SDVY/SDVY.F, and SDVD. This move indicates a financial action benefiting investors of these specific funds.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information for investors about cash distributions for specific ETFs, which can inform their investment decisions. However, it does not report on solutions, improvements, or innovations, and the depth of insight into the system or causes behind this decision is minimal."
  },
  {
    "title": "Physicists Seek Beyond Standard Model to Explain Universe Mysteries",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:40:35 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "While the Standard Model (SM) describes all known fundamental particles and many of the interactions between them, it fails to explain dark matter, dark energy and the apparent asymmetry between matter and antimatter in the universe. Over the past decades, physicists have thus introduced various fra"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/study-tightens-king-pl.jpg",
    "titles": [
      "Study tightens King plot-based constraints on hypothetical fifth force"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary": "The Standard Model (SM) of particle physics, which outlines known fundamental particles and their interactions, does not account for dark matter, dark energy, or the matter-antimatter asymmetry. In response, physicists have proposed several frameworks over the years to address these gaps, indicating ongoing efforts to expand our understanding of the universe beyond the SM's current scope.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the progress made by physicists in seeking to understand the mysteries of the universe beyond the Standard Model. It provides empowering knowledge about the ongoing efforts and the proposed frameworks to address the gaps in the current understanding of particle physics."
  },
  {
    "title": "AllSpice’s platform is the GitHub for electrical engineering teams",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 23 Jun 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AllSpice's platform has landed customers including Blue Origin and Bose and just raised a $15 million Series A round."
    ],
    "image_url": "",
    "titles": [
      "AllSpice’s platform is the GitHub for electrical engineering teams"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovation in the field of electrical engineering, potentially providing actionable insights for professionals in the field."
  },
  {
    "title": "University of Illinois Studies Impact of Continuous Corn Planting",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:36:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "While the majority of Midwestern farmers rotate corn and soybeans, commodity prices and corn yield advantages compel some to plant corn year after year. Although foundational research on the benefits of corn-soybean rotation goes back decades, University of Illinois Urbana-Champaign scientists are w"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/corn-after-soy-new-stu.jpg",
    "titles": [
      "Corn after soy: New study quantifies rotation benefits and trade-offs"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary": "University of Illinois Urbana-Champaign scientists are exploring the impacts of continuous corn planting, a practice some Midwestern farmers adopt due to commodity prices and corn yield benefits. Despite traditional research supporting corn-soybean rotation for its advantages, this study aims to understand the effects of deviating from that cycle. This investigation highlights the ongoing examination of agricultural practices in response to economic pressures and yield considerations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an ongoing investigation into a specific agricultural practice, providing the reader with an understanding of the issue and the attempts to solve it. It contributes to the reader's understanding of the economic pressures and yield considerations that influence farming practices."
  },
  {
    "title": "Fundraisers Express Ethical Concerns Over AI Use in Donor Interactions",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new report has revealed that fundraisers have concerns around the ethical implications of artificial intelligence (AI) in their work with donors."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/fundraising.jpg",
    "titles": [
      "Ethical concerns a barrier to use of AI tools in fundraising, new report shows"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "A recent report highlights that fundraisers are increasingly worried about the ethical implications of using artificial intelligence (AI) in their interactions with donors. The concerns primarily revolve around how AI might impact the authenticity and integrity of their work, suggesting a need for guidelines and ethical standards in the deployment of AI technologies in fundraising practices.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the ethical concerns of fundraisers regarding the use of AI, thereby increasing awareness about the potential impacts of AI on different sectors. However, it does not mention any solutions or improvements to address these concerns."
  },
  {
    "title": "Hinge CEO Justin McLeod says dating AI chatbots is ‘playing with fire’",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Today, I’m talking with Hinge founder and CEO Justin McLeod. Hinge is one of the biggest dating apps in the United States — it’s rivaled only by Tinder, and both are owned by the massive conglomerate Match Group, which has consolidated a huge chunk of the online dating ecosystem. A fair warning here"
    ],
    "image_url": "",
    "titles": [
      "Hinge CEO Justin McLeod says dating AI chatbots is ‘playing with fire’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.43,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights about the potential dangers of AI in the dating industry. However, it does not provide any solutions or progress towards addressing these issues."
  },
  {
    "title": "Chimpanzees Share Humans' Fascination with Social Interactions",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:35:20 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Ever find yourself people-watching in a cafe, or tuning into reality TV just to see who's arguing with who? You're not alone—and it turns out, you might have more in common with chimpanzees than you think."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nosy-by-nature-chimpan.jpg",
    "titles": [
      "Nosy by nature: Chimpanzees and children share a strong curiosity about the lives of others"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "Humans' interest in observing social interactions, such as people-watching or watching reality TV, is shared with chimpanzees, indicating a common behavioral trait. This suggests that the fascination with social dynamics is not uniquely human but extends to other primates, highlighting a deeper, evolutionary aspect of social curiosity.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the common behavioral traits between humans and chimpanzees, deepening our understanding of social dynamics across species. However, it does not report on progress, solutions, or improvements, nor does it provide actionable insights."
  },
  {
    "title": "Senators urge FTC to investigate Spotify’s higher-priced bundled subscription",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 23 Jun 2025 14:57:21 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Two U.S. senators have requested that the FTC investigate Spotify due to allegations that the company bundled its subscription without user consent, while also undercompensating creators."
    ],
    "image_url": "",
    "titles": [
      "Senators urge FTC to investigate Spotify’s higher-priced bundled subscription"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it informs readers about a current issue in the music streaming industry and the role of regulatory bodies. However, it does not provide actionable insights or report on solutions."
  },
  {
    "title": "$1,400 can get you a powerful (and huge) HP Omen laptop with an RTX 5070",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T11:43:13-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Many people gravitate toward compact laptops for their convenience, but there’s a subset of gamers who want a big ass gaming laptop that offers desktop-class performance. If you fall into the latter bucket, you may appreciate knowing that HP is offering 20 percent off its latest Omen gaming laptops,"
    ],
    "image_url": "",
    "titles": [
      "$1,400 can get you a powerful (and huge) HP Omen laptop with an RTX 5070"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for potential buyers, contributing to their understanding and decision-making. However, it does not report on progress or solutions, nor does it increase awareness around broader systems or trends."
  },
  {
    "title": "Agrifood Systems Strain Under Environmental Challenges",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:55:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Pressures such as population growth, urbanization, and land degradation are straining the global agrifood system, the network connecting all steps of the food supply chain from growing crops in the field to waste elimination or disposal. In turn, the system is a major contributor to greenhouse gas ("
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/food-waste-recycling-n.jpg",
    "titles": [
      "Diverting food waste from landfills to recycling could dramatically offset emissions"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "Global agrifood systems, vital for connecting all stages of the food supply chain from crop cultivation to waste disposal, are under strain due to population growth, urbanization, and land degradation. These pressures are exacerbating the system's role as a significant source of greenhouse gas emissions, highlighting the environmental challenges it faces.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the environmental challenges faced by global agrifood systems. However, it lacks depth and insight into potential solutions or improvements. It does not empower the reader with actionable insights."
  },
  {
    "title": "The new lies spreading about climate change",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T11:18:07-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "New strains of misinformation about climate change are spreading, meant to slow the growth of renewable energy needed to fix the problem. Rather than flat-out denying the mountains of evidence that show that humans are causing climate change, more recent talking points aim to mislead people by casti"
    ],
    "image_url": "",
    "titles": [
      "The new lies spreading about climate change"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story increases awareness about misinformation regarding climate change, but it doesn't provide any actionable insights or report on solutions to combat this misinformation."
  },
  {
    "title": "Doomscrolling May Skew Views on Human Nature, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 10:29:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Are you losing faith in humanity because of everything that is going on right now? If so, that is no surprise. Our habit of \"doomscrolling\" convinces us that people are inherently self-centered and uncaring."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/litter-clean.jpg",
    "titles": [
      "The light triad: Expert explains psychology's answer to our darkest fears about people"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary": "Doomscrolling, the act of continuously scrolling through bad news, may contribute to a perception that humanity is predominantly selfish and indifferent. This behavior can negatively affect one's outlook on society, reinforcing a pessimistic view of human nature.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful awareness about the psychological impact of doomscrolling. However, it does not offer solutions or ways to mitigate this behavior, nor does it provide a deep understanding of the underlying causes."
  },
  {
    "title": "Compass Challenges Zillow Over Real Estate Listing Requirements",
    "domain": "business",
    "location": "global",
    "published": "2025-06-23T15:54:24Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Compass has had enough with Zillow's efforts to force real estate listings to be posted on their platform or else."
    ],
    "image_url": "https://i.insider.com/63d28f27b1f17f001805c2c2?format=jpeg",
    "titles": [
      "The war over real estate listings heats up as Compass targets 'Zillow ban' in new lawsuit"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41,
    "summary": "Compass is challenging Zillow's practices, opposing the requirement for real estate listings to be posted on Zillow's platform. This dispute highlights tensions between the two companies over how listings are shared and displayed in the real estate market.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of a dispute between two real estate companies, but it doesn't provide much depth or insight into the reasons behind the dispute, its potential impact on the real estate market, or any potential solutions. It doesn't empower the reader with actionable insights."
  },
  {
    "title": "Unexpected Turbulence Injures Passengers on Qantas Flight to Brisbane",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 11:09:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Unexpected severe turbulence injured crew and passengers on a Qantas Boeing 737 during descent at Brisbane on May 4, 2024. The subsequent Australian Transport Safety Bureau investigation suggested the severity of the turbulence caught the captain by surprise."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/airplane-land-1.jpg",
    "titles": [
      "Freak wind gusts made worse by climate change threaten airline passenger safety"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407,
    "summary": "On May 4, 2024, a Qantas Boeing 737 experienced severe turbulence while descending into Brisbane, resulting in injuries to passengers and crew. The Australian Transport Safety Bureau's investigation found that the turbulence's intensity was unexpected, catching the captain by surprise.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about an incident of unexpected turbulence on a Qantas flight, but it does not provide any actionable insights or deeper understanding for the reader. It also does not report on any solutions or attempts to prevent such incidents in the future."
  },
  {
    "title": "US Stocks Muted After Attack on Iranian Nuclear Sites",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 14:46:17 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "US stock moves were subdued on Monday following a US attack on Iranian nuclear sites over the weekend as traders speculated the escalation would remain contained."
    ],
    "image_url": "",
    "titles": [
      "S&P 500 Edges Up as Traders Assess Impact of Strike on Iran"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.406,
    "summary": "US stock movements were muted on Monday after the US launched an attack on Iranian nuclear sites over the weekend. Traders appeared to speculate that the escalation in tensions would remain limited, leading to subdued reactions in the stock market.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness of the impact of geopolitical events on the stock market, it doesn't offer deeper insights or actionable information. It also doesn't report on solutions or improvements, or provide a clear understanding of the systems or causes at play."
  },
  {
    "title": "Nintendo’s Switch 2 is available online at Best Buy",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T12:01:39-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The Nintendo Switch 2 has been difficult to find in stock since its June 5th launch, though restocks are beginning to ramp up. If you’re looking for one, head over to Best Buy’s site or use the app. Those who have a free account can get the standalone system ($449.99) and a console bundle ($499.99) "
    ],
    "image_url": "",
    "titles": [
      "Nintendo’s Switch 2 is available online at Best Buy"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.398,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers very basic awareness about the availability of a product, but it doesn't provide any depth, insight, or actionable information beyond that. It doesn't report on progress, solutions, or improvements, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "JLab&#8217;s new party speaker puts a light show in your pocket",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T11:07:13-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "JLab has announced a new Party line of wireless speakers that continues an industry trend of adding animated RGB lighting to anything that plays music. That even includes the new budget-minded JLab Pop Party speaker — which is small enough to squeeze into a pocket but still features customizable LED"
    ],
    "image_url": "",
    "titles": [
      "JLab&#8217;s new party speaker puts a light show in your pocket"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.357,
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  }
]