[
  {
    "title": "Our favorite robot vacuum deals from Amazon’s Big Spring Sale",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T19:46:31-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In the current era, technology allows for tasks to be automated by machines, such as self-driving cars and cleaning robots. While fully autonomous human-like robots may not be financially accessible for most people within their lifetimes, robot vacuums offer a more affordable option for automating household chores."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.8230199254861111,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4157549813715278,
    "summary": "Technology enables the automation of tasks through machines like self-driving cars and cleaning robots. Although fully autonomous robots may remain out of financial reach for many, robot vacuums present a cost-effective solution for automating household chores."
  },
  {
    "title": "Amazon’s big spring sale continues, and we found the 95 best deals",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:34:29-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon has launched its Big Spring Sale for 2025, offering discounts on gardening supplies, bedding, and more. The sale started recently and will continue until Monday, March 31st, coinciding with the onset of warmer months and seasonal changes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7729874625347223,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4032468656336806,
    "summary": "Amazon has initiated its Big Spring Sale for 2025, featuring reduced prices on items such as gardening supplies and bedding. The sale began recently and is set to end on Monday, March 31st, aligning with the start of warmer weather and seasonal shifts."
  },
  {
    "title": "Nintendo digital lending feature reveals &#8216;Switch 2 Edition&#8217; games are on the way",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T18:25:20-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nintendo unexpectedly announced \"Switch 2 Edition\" games following its Nintendo Direct stream. This revelation was made on the company's webpage, detailing the new Virtual Game Card lending system. The announcement came on a day Nintendo had not scheduled to discuss the new system."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7666240862615741,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4016560215653935,
    "summary": "Nintendo unexpectedly revealed \"Switch 2 Edition\" games and a new Virtual Game Card lending system on its website following a Nintendo Direct stream. This announcement was made on a day not previously scheduled for discussing the new system."
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:53:08-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "On Thursday, the White House hosted Podcast Row, inviting conservative podcasters for extensive access to senior Trump Administration officials. This initiative, aimed at engaging alternative media, is planned to be a recurring event to prioritize inclusion of new media outlets."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7442518725578704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3960629681394676,
    "summary": "On Thursday, the White House initiated Podcast Row, granting conservative podcasters access to senior officials from the Trump Administration. This event, designed to engage with alternative media, is set to become a regular occurrence to ensure new media outlets are included."
  },
  {
    "title": "Amazon’s latest Kindle Scribe is the cheapest it’s been in months",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:40:45-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale includes discounts on various e-readers, featuring the first color e-reader. The Kindle Scribe, notable for its note-taking capability, has its 16GB model available at a record low price."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7356428293634258,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3939107073408564,
    "summary": "Amazon's Big Spring Sale offers discounts on e-readers, including the first color model and the Kindle Scribe with note-taking features. The 16GB Kindle Scribe is available at its lowest price ever."
  },
  {
    "title": "FTC tells staff to stop calling the agency ‘independent’ in complaints",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T17:01:25-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Staff at the Federal Trade Commission (FTC) have been directed to stop describing the agency as \"independent\" in complaints, as per an email revealed by The Verge. This guidance was issued by Christopher Mufarrige, the Director of the Bureau of Consumer Protection."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7083184705092593,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3870796176273148,
    "summary": "The Federal Trade Commission's (FTC) Bureau of Consumer Protection Director, Christopher Mufarrige, issued guidance to staff to cease referring to the FTC as \"independent\" in complaints, according to an email disclosed by The Verge."
  },
  {
    "title": "Ploopy upgraded its open-source trackball with better scrolling",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:54:05-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ploopy, a Canadian firm, has released the Classic 2 trackball mouse, maintaining the original's design and ergonomics but featuring enhanced connectivity, a more precise scroll wheel, and an updated design for easier 3D printing."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.7032161847800926,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3858040461950232,
    "summary": "Ploopy, a company based in Canada, has launched the Classic 2 trackball mouse. This new version retains the design and ergonomics of the original model but includes improvements such as better connectivity, a more accurate scroll wheel, and a redesigned structure that simplifies 3D printing."
  },
  {
    "title": "The 24 best Amazon Big Spring Sale deals under $30",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:15:35-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is currently underway and will run until Monday, March 31st. The sale features a wide range of deals, including more than 90 offers on popular gear, and does not require an Amazon Prime membership. Additionally, a selection of low-cost alternatives is highlighted for shoppers seeking budget-friendly options."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6764681175694445,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37911702939236114,
    "summary": "Amazon's Big Spring Sale is happening now and will continue until March 31st. It includes over 90 deals on various items, accessible without needing an Amazon Prime membership. The sale also offers a selection of budget-friendly alternatives for cost-conscious shoppers."
  },
  {
    "title": "Ubisoft&#8217;s $4 billion carveout sells Tencent a 25 percent stake in some of its biggest games",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:09:18-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ubisoft announced the creation of a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six franchises, with Tencent investing approximately $1.3 billion for a 25% stake. This values the new subsidiary at around $4.3 billion."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6720957845833333,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37802394614583334,
    "summary": "Ubisoft has formed a subsidiary for its Assassin’s Creed, Far Cry, and Tom Clancy’s Rainbow Six series, with Tencent acquiring a 25% share for $1.3 billion. This deal values the subsidiary at about $4.3 billion."
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "Tech",
    "location": "Global",
    "published": "2025-03-27T16:01:59-04:00",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Amazon's Big Spring Sale is underway, featuring significant discounts on a variety of gadgets and gear, including Apple's M-series chip-equipped MacBooks. These MacBooks, available in various sizes and price points, have been highlighted as some of the best deals. Notably, the M1 MacBook Air has been discontinued."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.6670056880902777,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3767514220225694,
    "summary": "Amazon's Big Spring Sale is offering major discounts on numerous items, including Apple MacBooks with M-series chips. The sale features deals across different models and prices. The M1 MacBook Air, which has been discontinued, is also mentioned among the top deals."
  },
  {
    "title": "Putin says Greenland 'nothing to do with Russia' in nod to US",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:21:33 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "During a speech in the Arctic, Russia's President commented on Donald Trump's plans, describing them as \"serious\" but clarified that they were unrelated to Moscow."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In a speech in the Arctic, Russia's President described Donald Trump's plans as \"serious\" but stated they were unrelated to Moscow."
  },
  {
    "title": "Canada PM Mark Carney says old relationship with US 'is over'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:17:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Canadian leader stated that the relationship between Canada and the US has been affected by tariffs imposed by Trump, putting at risk future collaborations between the two nations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The Canadian leader mentioned that tariffs introduced by Trump have impacted Canada's relationship with the US, potentially jeopardizing future cooperation between the two countries."
  },
  {
    "title": "Greenlanders prepare for uncomfortable visit from US vice-president",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Greenland has rejected the idea proposed by JD Vance and his wife, following Donald Trump's previous statement about intending to take control of the island."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Greenland has dismissed a proposal by JD Vance and his wife, which followed a prior statement by Donald Trump about his intention to take control of the island."
  },
  {
    "title": "Six dead after tourist submarine sinks in Red Sea",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:42:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A vessel carrying tourists sank in the Red Sea off Hurghada's tourist promenade on Thursday morning, resulting in the rescue of 39 people, according to local authorities."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A tourist boat sank in the Red Sea near Hurghada's tourist promenade on Thursday morning. Local authorities reported that 39 people were rescued following the incident."
  },
  {
    "title": "Vance to purge museums of 'anti-American ideology'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 02:13:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donald Trump has issued an order directing his vice-president to focus on the Smithsonian Institution's museums."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Donald Trump has instructed his vice-president to concentrate efforts on the Smithsonian Institution's museums."
  },
  {
    "title": "Venezuelans deported to mega-prison 'trapped in black hole'",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 00:30:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Gertrudis Pineda reported to the BBC that she lacks any information regarding her son, who was transferred from the US to a prison in El Salvador."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Gertrudis Pineda told the BBC she has no information about her son after he was moved from a US detention facility to a prison in El Salvador."
  },
  {
    "title": "Australia to hold federal election on 3 May",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 21:34:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Prime Minister Anthony Albanese aims to secure a second term in office amid challenges from a strengthening opposition."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Prime Minister Anthony Albanese is seeking re-election, facing increased competition from a growing opposition."
  },
  {
    "title": "Woman who killed music icon Selena denied parole in Texas",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:02:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A music icon was fatally shot by the founder of her fan club. The assailant's initial request for parole in Texas has been denied."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A renowned music artist was killed by the head of their fan club. The perpetrator, now in Texas, sought parole but was denied."
  },
  {
    "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:21:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Major economies, including China, have pledged to retaliate against the United States, accusing it of breaking international trade regulations."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Major economies, such as China, have committed to retaliate against the United States, claiming it has violated international trade rules."
  },
  {
    "title": "Officer spared jail over fatal Tasering of 95-year-old",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:31:06 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A former police officer has been convicted of manslaughter in the case involving the death of Clare Nowland."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A former police officer was found guilty of manslaughter in connection with the death of Clare Nowland."
  },
  {
    "title": "N Korea's Kim inspects test of 'AI suicide attack drones'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 18:12:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new technology was developed with assistance from Russia, according to analysts."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A new technology has been developed with support from Russia, analysts report."
  },
  {
    "title": "BBC's Mark Lowen deported from Turkey after covering protests",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:01:27 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mark Lowen, a journalist, was arrested while reporting on protests in Istanbul and subsequently deported to the UK, according to the BBC."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Lowen, a journalist, was arrested in Istanbul during his coverage of protests and was later deported to the UK, as reported by the BBC."
  },
  {
    "title": "Ian McKellen and Patrick Stewart join Avengers: Doomsday cast",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 12:03:04 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The movie featuring Robert Downey Jr as Doctor Doom is scheduled for release in May 2026."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A movie starring Robert Downey Jr as Doctor Doom is set to be released in May 2026."
  },
  {
    "title": "Five people injured in stabbing in Amsterdam, police say",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 19:51:32 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A suspect was arrested with assistance from a local resident, according to police reports."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A suspect has been apprehended with the help of a local resident, as stated in police reports."
  },
  {
    "title": "Grandparents released in probe into toddler's death in France",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:16:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Police have discovered evidence of blunt trauma on the remains of a toddler, according to a recent update."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Police found signs of blunt trauma on a toddler's remains, recent updates reveal."
  },
  {
    "title": "Babysitter finds man under bed after child complains of 'monster'",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:08:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In Kansas, a babysitter discovered a man hiding under a child's bed after the child reported seeing a \"monster.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "In Kansas, a babysitter found a man hiding under a child's bed after the child mentioned seeing a \"monster.\""
  },
  {
    "title": "Poland suspends migrants' right to apply for asylum",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 06:48:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Poland has passed a law permitting its authorities to temporarily suspend asylum rights at its border with Belarus."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Poland has enacted a law allowing its officials to temporarily suspend the right to seek asylum at its border with Belarus."
  },
  {
    "title": "VP's arrest ends South Sudan peace deal, his party says",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:28:07 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Riek Machar and his wife were detained following the entry of a convoy of 20 armed vehicles into his home, according to statements from his party."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Riek Machar and his wife were detained after a convoy of 20 armed vehicles entered his home, as reported by his party."
  },
  {
    "title": "Macron urges Algeria to free writer jailed for Morocco comments",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 15:33:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Boualem Sansal, an 80-year-old individual, stated in an interview with a far-right news outlet that colonial France allocated an excessive amount of land to Algeria."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Boualem Sansal, an 80-year-old, claimed in an interview with a far-right news outlet that colonial France gave too much land to Algeria."
  },
  {
    "title": "Egypt submarine sinking: What we know so far",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 17:29:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Six individuals lost their lives following the sinking of a submarine near Hurghada, a well-known tourist spot."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A submarine sank near Hurghada, a popular tourist destination, resulting in the deaths of six people."
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe will struggle to guarantee Ukraine's security",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 13:12:22 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky expressed his views on the support Ukraine has received from Europe, highlighting the continent's backing and the resilience of his country amidst challenges."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Ukrainian President Volodymyr Zelensky acknowledged Europe's support for Ukraine, emphasizing the continent's solidarity and Ukraine's resilience in facing challenges."
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "domain": "General",
    "location": "Global",
    "published": "Fri, 28 Mar 2025 03:00:45 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A mix of international and local issues is making it difficult for the government to secure a second term in office."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A combination of global and domestic challenges is hindering the government's efforts to win re-election for a second term."
  },
  {
    "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 23:20:28 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The pet care sector in India is experiencing growth due to affluent, urban Indians spending more on their dogs and cats."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "The pet care sector in India is growing as more affluent, urban residents increase their spending on dogs and cats."
  },
  {
    "title": "Why have the wildfires in S Korea been so devastating?",
    "domain": "General",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 10:26:36 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts warn that the combination of strong winds, dry conditions, and pine trees significantly increases the risk of wildfires."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Experts warn that the risk of wildfires is heightened due to strong winds, dry conditions, and the presence of pine trees, which can all contribute to the rapid spread of fires."
  },
  {
    "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:46:06 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have developed a statistical method that enables visualization of an individual's family tree as a dynamic movie, illustrating the migration patterns of ancestors across the globe over time. This innovative approach is not limited to human ancestry but can also be applied to model the spread of diseases and track animal movements through various geographic areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers have created a new statistical method that allows for the visualization of a person's family tree through a dynamic movie, showing how ancestors migrated around the world over time. This method can also be used to track the spread of diseases and animal movements across different regions."
  },
  {
    "title": "Melting ice, more rain drive Southern Ocean cooling",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 16:45:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have discovered that 60% of the previously unexplained difference between expected and actual ocean temperatures around Antarctica over several decades is due to increased levels of meltwater and rain in the area."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers found that 60% of the unaccounted-for difference between expected and actual ocean temperatures around Antarctica over decades is attributed to rising meltwater and rain levels in the region."
  },
  {
    "title": "Long COVID patients feel pressure to prove their illness is real, study finds",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:19:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new study has found that individuals suffering from Long COVID frequently experience feelings of being dismissed, disbelieved, and unsupported by their healthcare providers."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A recent study highlights that many Long COVID patients feel ignored, doubted, and lacking support from their healthcare providers, indicating a gap in the patient-provider relationship for those with prolonged COVID-19 symptoms."
  },
  {
    "title": "Cartilage and bone development: Three paths to skeleton formation",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:17:22 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Researchers have found that in vertebrates, skeletal cells from different body regions not only originate from various precursor cells but also exhibit distinct gene regulation patterns. This variation in gene regulation among skeletal cells may play a crucial role in the evolutionary success of vertebrates."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Researchers discovered that vertebrates' skeletal cells, originating from different precursor cells across various body regions, show unique gene regulation patterns. This diversity in gene regulation might be key to vertebrates' evolutionary success."
  },
  {
    "title": "We must not ignore eugenics in our genetics curriculum, says professor",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:14:21 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Biology professor Mark Peifer from the University of North Carolina at Chapel Hill suggests adding eugenics to college genetics curriculums. He believes this will motivate scientists to address instances where science is misapplied for political purposes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "Mark Peifer, a biology professor at the University of North Carolina at Chapel Hill, recommends incorporating eugenics into college genetics courses. He argues this inclusion will help scientists confront cases of science being misused for political aims."
  },
  {
    "title": "Park entrances may be hotspots for infective dog roundworm eggs",
    "domain": "Science",
    "location": "Global",
    "published": "Thu, 27 Mar 2025 14:13:59 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A study analyzing soil samples from twelve Dublin parks found higher contamination levels of infective roundworm eggs at park entrances compared to other park areas."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.33499999999999996,
    "summary": "A study examining soil samples from twelve Dublin parks discovered that areas near park entrances contain higher levels of roundworm eggs capable of causing infection, compared to other parts of the parks."
  },
  {
    "title": "Men's Sweet 16 live tracker: 3-seed Texas Tech being challenged for Elite Eight spot, while 1-seed Duke in control",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:36:56 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "I'm ready to help you summarize news content! Please provide the news details you'd like summarized."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Please provide the news content you would like summarized."
  },
  {
    "title": "Giddey's 47-ft, buzzer-beating heave stuns Lakers",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Josh Giddey of the Chicago Bulls scored a 47-foot 3-pointer from half-court at the buzzer, securing a 119-117 win against the Los Angeles Lakers. This shot is highlighted as one of the season's most dramatic finishes in the NBA."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Josh Giddey, playing for the Chicago Bulls, made a 47-foot 3-pointer from half-court at the buzzer, leading his team to a 119-117 victory over the Los Angeles Lakers. This shot is noted as one of the most dramatic finishes of the NBA season."
  },
  {
    "title": "Terps' Willard unsure of future after tourney exit",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Maryland men's basketball coach Kevin Willard did not provide a clear statement on his future with the Terrapins following their Sweet 16 elimination by Florida on Thursday."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Maryland men's basketball coach Kevin Willard did not give a definitive answer about his future with the Terrapins after they were eliminated from the Sweet 16 by Florida."
  },
  {
    "title": "Bama sinks record 25 3-pointers, rolls to Elite 8",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama set a new NCAA tournament record by making 25 3-pointers in a 113-88 win over BYU in the East Region semifinal, led by Mark Sears. This breaks a 35-year-old record for most 3-pointers in a tournament game."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Alabama basketball team set a new NCAA tournament record by scoring 25 3-pointers in a 113-88 victory over BYU in the East Region semifinal. This achievement, led by Mark Sears, surpasses a 35-year-old record for the most 3-pointers in a single tournament game."
  },
  {
    "title": "With game on line, Soto whiffs to end Mets debut",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In his debut game for the Mets on Thursday, Juan Soto struck out with two outs in the ninth inning, failing to deliver tying runs. This led to the Astros securing a 3-1 victory."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "In his first game for the Mets, Juan Soto struck out with two outs in the ninth inning, preventing the team from scoring tying runs. This resulted in a 3-1 win for the Astros."
  },
  {
    "title": "Arenado soaks in emotional post-HR curtain call",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nolan Arenado hit a significant home run in the eighth inning on Thursday, marking a notable moment after his offseason trade speculations. The event was celebrated by Cardinals fans, who gave him a curtain call, acknowledging the importance of his performance."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Nolan Arenado hit a crucial home run in the eighth inning on Thursday, amid offseason trade rumors. His performance was celebrated with a curtain call from Cardinals fans, recognizing its significance."
  },
  {
    "title": "Ex-Vols coach Pruitt sues NCAA, seeking $100M",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former Tennessee football coach Jeremy Pruitt is suing the NCAA for $100 million, alleging that it collaborated with the university to unfairly blame him, effectively making him a \"sacrificial lamb.\""
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former Tennessee football coach Jeremy Pruitt has filed a lawsuit against the NCAA, seeking $100 million in damages. Pruitt claims the NCAA and the university conspired to unjustly make him the scapegoat."
  },
  {
    "title": "Ex-NFL RB Johnson charged in dogfighting case",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former NFL player LeShon Johnson faces charges in a federal dogfighting case, following the seizure of 190 dogs from his property last year."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Former NFL player LeShon Johnson has been charged in a federal dogfighting case. Authorities seized 190 dogs from his property last year, leading to the charges."
  },
  {
    "title": "Crosby breaks Gretzky's point-per-game record",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:20:46 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sidney Crosby has set a new NHL record by maintaining a point-per-game average throughout his career, surpassing a record he previously shared with Wayne Gretzky."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Sidney Crosby has broken an NHL record by keeping a point-per-game average throughout his career, overtaking the previous record held jointly with Wayne Gretzky."
  },
  {
    "title": "How Calipari's departure led to Kentucky, Arkansas and BYU in the Sweet 16",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 23:26:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "All three teams have successfully reached the second weekend of the competition, following a series of coaching changes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Three teams have advanced to the second weekend of the competition after undergoing coaching changes."
  },
  {
    "title": "SGA or Jokic for MVP? Answering the biggest NBA awards questions",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 13:51:35 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Insiders discuss key NBA awards, focusing on the MVP competition between Nikola Jokic and Shai Gilgeous-Alexander."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "NBA insiders are closely analyzing the competition for the MVP award, highlighting the race between Nikola Jokic and Shai Gilgeous-Alexander."
  },
  {
    "title": "3-pointer problem? Why the NBA has no qualms with it -- yet",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 15:40:09 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This season, the number of 3-point attempts in the league has reached a historic high, sparking discussions on whether there should be measures to limit the frequency of 3-point shots."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This season, the league has seen a record number of 3-point shot attempts, leading to debates about possibly implementing rules to reduce their frequency."
  },
  {
    "title": "2025 MLB predictions: From playoffs and World Series to MVPs and Cy Youngs",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:25 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Experts have made their predictions for the 2025 baseball season, including whether the Dodgers can secure another victory and who might win the MVP title."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Experts predict outcomes for the 2025 baseball season, focusing on the potential of the Dodgers to win again and speculating on MVP title contenders."
  },
  {
    "title": "MLB season: Power Rankings, playoff odds and everything you need for all 30 team",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:30:26 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "This message provides information for those interested in teams, regardless of their status as favorites or underdogs, with a focus on the year 2025, indicating support and coverage for all teams involved."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "This message offers information on teams, both favorites and underdogs, for the year 2025, promising support and coverage for all."
  },
  {
    "title": "Ranking the 25 best players in the women's Sweet 16: From Betts and Bueckers to Strong and Van Lith﻿",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are contenders for the top spot in the Sweet 16 player rankings, indicating their significant impact and performance in the sport."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Paige Bueckers, Lauren Betts, and Hannah Hidalgo are leading contenders in the Sweet 16 player rankings, highlighting their notable performance and influence in basketball."
  },
  {
    "title": "The mercurial backcourt motoring Notre Dame's March Madness",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 18:18:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hannah Hidalgo, Olivia Miles, and Sonia Citron are key players leading Notre Dame's basketball team towards a championship title. Their performances have been pivotal in the team's success."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Hannah Hidalgo, Olivia Miles, and Sonia Citron are crucial to Notre Dame's basketball team, significantly contributing to its pursuit of a championship title through their standout performances."
  },
  {
    "title": "Tannenbaum plays GM for every team in Round 1: Should the Giants still take a QB at No. 3?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:59:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mike Tannenbaum, acting in a hypothetical role, made his own selections for the first round of the draft, applying his experience as a former general manager."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Mike Tannenbaum, leveraging his background as a former general manager, conducted a mock draft where he made his own picks for the first round, applying his expertise to each selection."
  },
  {
    "title": "How effects of Michigan hacking are rippling nationwide",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 07:54:55 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Recent allegations have raised widespread concern in college athletics about the potential victimization of other athletes."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Recent allegations have sparked concern regarding the potential victimization of athletes within college sports."
  },
  {
    "title": "Who's leading the Golden Boot races in Europe's top leagues?",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 08:12:48 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The current leading scorers in major European football leagues are highlighted, with top players from the Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1 being recognized for their goal-scoring achievements."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "The top goal scorers in Europe's major football leagues—Premier League, LaLiga, Bundesliga, Serie A, and Ligue 1—have been acknowledged for their scoring prowess this season, highlighting the standout players in each league."
  },
  {
    "title": "UEFA to investigate Mbappé, Vini over Atleti game",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UEFA announced an investigation into alleged \"indecent conduct\" by four Real Madrid players, including Kylian Mbappé and Vinícius Júnior, during a Champions League match against Atlético Madrid."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "UEFA is investigating four Real Madrid players, among them Kylian Mbappé and Vinícius Júnior, for alleged \"indecent conduct\" during a Champions League match against Atlético Madrid."
  },
  {
    "title": "Madrid-linked Alonso: Nothing to decide on future",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayer Leverkusen coach Xabi Alonso currently has no offers from other clubs, contrasting with the situation a year ago, which means he does not have to make any immediate decisions regarding his future."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Bayer Leverkusen coach Xabi Alonso has not received any offers from other clubs, unlike last year, allowing him to avoid making immediate decisions about his future."
  },
  {
    "title": "Barça thrash Wolfsburg 6-1 to reach UWCL semis",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 17:01:02 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Defending champions Barcelona advanced to the Women's Champions League semi-finals after defeating VfL Wolfsburg 6-1 at home in the second leg of their quarter-final match on Thursday. This victory secured them a 10-2 win on aggregate."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Barcelona progressed to the Women's Champions League semi-finals by beating VfL Wolfsburg 6-1 in the second leg of their quarter-final, achieving a 10-2 aggregate victory. The match took place on Thursday, with Barcelona defending their title."
  },
  {
    "title": "EPL to open transfer window early due to CWC",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 19:58:08 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Premier League clubs will have an early 10-day transfer window in June before the FIFA Club World Cup, followed by a reopening on June 16, as announced by the league."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Premier League clubs will experience a 10-day transfer window in early June, specifically designed to accommodate the FIFA Club World Cup schedule. After this period, the transfer window will reopen on June 16, as confirmed by the league."
  },
  {
    "title": "Source: City pausing on Echeverri future decision",
    "domain": "Sports",
    "location": "National",
    "published": "Thu, 27 Mar 2025 22:31:54 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Manchester City plans to decide on Claudio Echeverri's future with the club in the summer, according to a source cited by ESPN."
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.5,
      "proximity": 0.3,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.275,
    "summary": "Manchester City will make a decision on Claudio Echeverri's future at the club in the upcoming summer, based on information from a source reported by ESPN."
  }
]