[
  {
    "title": "Trump Cancels Meeting on Gov Shutdown, Blames Democrats",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:37:53 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "The Guardian",
      "Forbes",
      "MarketWatch"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com",
      "www.forbes.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOWDlTYlFqNlNRRTZVT294VTFRVGhrYlpoV3l5TDdnT0x3N1laNU5nTWFJUXlUOTFnRUpldHVFQ3NHNE1pYms4NXdjeWlWdFU3X3JySjBId3NXVVFFNzU0NTJRbkhBbjRfYnNTWHdoMEdvM2Y4eDlITlI3UEFKLUpCQ2I2OG5DSDJVR0VHblppMkREZw?oc=5\" target=\"_blank\">Trump cancels meeting with to",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQOTY0UmlZZE0tWXBpeGF1dU9mYy1NTnFNalZNeFV5bGxEa0NTdUVzTXpIRFpobjV0V19IZHNNbXlxamktbm1XTGN1T1ViZ2RJU1VPYkoxLUxvcjRzMFRHRm5GbUo5TXJyZ19WUDkyY3VoSzNienI5b2xENFhBb2tCdTBCMmotVERQUkpnV1NicHZKbTUtWFhKaQ?oc=5\" target=\"_blank\">Trump to meet with De",
      "New York Democrats Sen. Chuck Schumer and Rep. Hakeem Jeffries say Trump will take the blame for a federal government shutdown if a deal can't be reached.",
      "<p>Chuck Schumer says Trump is ‘running from negotiating table’ after president wrote meeting wouldn’t be productive</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\">US politics live – latest updates</a></p></",
      "Trump alleged Democrats in Congress “seem to have totally lost their way” in a lengthy Truth Social post announcing his decision.",
      "A federal government shutdown could imperil federal workers’ paychecks, disrupt air travel and delay food stamps."
    ],
    "image_url": "",
    "titles": [
      "Trump cancels meeting with top Democrats as shutdown looms - Axios",
      "Trump to meet with Democratic Hill Leaders over shutdown - Axios",
      "Trump cancels meeting with top Democrats as government shutdown looms",
      "Trump cancels meeting with top Democrats as federal shutdown looms",
      "Trump Calls Off Meeting With Democrats: Blasts ‘Ridiculous Demands’",
      "Chances of a government shutdown spike after Trump cancels meeting with Democrats. Here’s what comes next."
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.947,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.833,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Donald Trump canceled a meeting aimed at preventing a federal government shutdown, blaming Congressional Democrats for the impasse. He accused them of losing their way in a post on Truth Social. New York Democrats Senator Chuck Schumer and Representative Hakeem Jeffries countered by stating Trump would be blamed for the shutdown, criticizing him for avoiding negotiations. The potential shutdown threatens federal workers' pay, air travel, and food stamp distribution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Airs Grievances in U.N. Speech Amid Funding Cuts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 11:00:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "ABC News",
      "Forbes",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "www.nytimes.com",
      "www.forbes.com",
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "First day of high-level meeting to kick off with speeches from world leaders, including from Brazil, US, Turkiye, Qatar.",
      "President Donald Trump is speaking at the United Nations General Assembly, as world leaders convene in New York for the body's 80th session.",
      "US president also warns that immigration and green energy policies will be ‘the death of western Europe’",
      "President Trump’s speech, filled with grievances and false claims, comes as the United States has withdrawn funding and support for U.N. programs. Speaking before him, the U.N.’s secretary general warned that the organization’s principles “are under siege.”",
      "The leaders of Ukraine and the United States will hold talks weeks after President Trump agreed to participate in postwar security guarantees for Ukraine.",
      "The Trump administration has refused to pay some UN dues and has cut about $1 billion in congressionally approved U.N. funding for 2025."
    ],
    "image_url": "",
    "titles": [
      "UN General Assembly 2025 live: World leaders including Trump give speeches",
      "Trump criticizes United Nations, world leaders in General Assembly",
      "Trump hits out at UN in address to General Assembly",
      "Live Updates: Trump Attacks U.N. and Lectures Nations in Address to General Assembly",
      "Zelensky to Meet With Trump on Sidelines of U.N. General Assembly",
      "Trump Expected To Criticize UN In First General Assembly Speech Since 2019"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.896,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the United Nations General Assembly's 80th session in New York, President Donald Trump delivered a speech marked by grievances and inaccuracies, amid the U.S. withdrawing funding for U.N. programs. Trump's address, which included warnings about immigration and green energy policies affecting western Europe, coincided with the U.N. Secretary General's statement on the organization's principles being under threat. Additionally, Trump's participation in talks with Ukraine for postwar security guarantees was noted, alongside the U.S. refusal to pay certain UN dues and a $1 billion cut in U.N. f",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France Recognizes Palestinian Statehood at U.N., Aligns with UK, Australia, Cana",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 12:22:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The State of Palestine is recognised as a sovereign nation by 157 UN member states, representing 81 percent of members.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBPZFN1QXgzNndRQ2tVQzI1MC1ITnBBSXVlcWlYcUcyQnpWX0xkMEpFNi1DaDJ6V041NjVraWM0TUpRSWNlNHVTZVJaU2FTRjV0X0stWXdWTERBSnJGZUJMcUUyVXN0ck9GNzNiczQ0Qzd4cGRfOVZkZVhR?oc=5\" target=\"_blank\">What countries recognize a Palestinian state in 2025?</a>&nbsp;",
      "France, UK and others recognize Palestinian statehood as UN General Assembly convenes. What does it mean?",
      "Ashley Wu, a graphics reporter for The New York Times, walks us through the changing map of Palestinian recognition.",
      "At a meeting ahead of the U.N. General Assembly, France and other U.S. allies made official a breach with Washington that has been years in the making."
    ],
    "image_url": "",
    "titles": [
      "Which are the 150+ countries that have recognised Palestine as of 2025?",
      "What countries recognize a Palestinian state in 2025? - Axios",
      "France, UK and others recognize Palestinian statehood. What does it mean?",
      "Which Countries Recognize a Palestinian State?",
      "World Leaders Recognize Palestinian State, in a Challenge to U.S. and Israel"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.922,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly in New York, France, led by President Emmanuel Macron, formally recognized Palestinian statehood, joining the UK, Australia, and Canada in a move that diverges from U.S. policy. This recognition is part of a broader effort to revive the two-state solution and has been praised by Palestinians. The decision comes amidst calls for peace and an end to conflict in the region, with Macron stating \"the time for peace has come.\" This development marks a significant shift in international relations and increases pressure on Israel regarding its policies in Gaza and the West",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: development, effort, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Philippine President Duterte Arrested on ICC Warrant, Detained in Netherlands",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 07:17:49 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Axios",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Former President Rodrigo Duterte was arrested in March by Philippine authorities on a warrant issued by the International Criminal Court. He is now being held at an ICC facility in the Netherlands.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNWUNTc2RXTkRmTEYxd0J3R3dLM28xbXhNWHJ2M2NZUHZRX0UxQm45eW1qNUxPek1JSU1fa3RWdlBSbktCbW5FNWZ6RXVZMy1JbzVXSGhIbllhcmJaQTZpQUJycmxBVU9QZWVxU29fMG8zMmRiSWtEVFhCRi1OeURIc0IxT2tmTVp3dFRRUEFCaTBMUQ?oc=5\" target=\"_blank\">ICC charges ex-Philippine Pre",
      "<p>Three charges against Duterte stem from his years-long campaign against drug users and dealers that rights groups say killed thousands</p><p>International criminal court prosecutors have charged the former president of the Philippines Rodrigo Duterte with three counts of crimes against humanity o",
      "International Criminal Court prosecutors allege that Rodrigo Duterte carried out crimes against humanity while in office, in pursuit of a brutal war on drugs."
    ],
    "image_url": "",
    "titles": [
      "ICC charges former Philippine President Duterte with crimes against humanity",
      "ICC charges ex-Philippine President Duterte with crimes against humanity - Axios",
      "Rodrigo Duterte, former Philippines president, charged with crimes against humanity at ICC",
      "Duterte, former Philippine president, charged with murder at ICC"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.902,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.802,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Philippine President Rodrigo Duterte was arrested in March by local authorities on an International Criminal Court (ICC) warrant and is currently detained in the Netherlands. The ICC has charged Duterte with three counts of crimes against humanity related to his aggressive anti-drug campaign, which rights groups claim resulted in thousands of deaths.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New York Liberty Parts Ways with Coach Sandy Brondello After Playoff Exit",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 11:22:53 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Liberty announced Tuesday that coach Sandy Brondello was out, a few days after the defending champions were eliminated from the WNBA playoffs.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE15NFBMRVhFaV8ySWRUNFUyLTJOV09ZWFdBV25lUWlZdGJ1ZUdGRFB3WEVrbE1IclZrU1kxRHRhRzNFVERwUDNSZVp4RTNCN2xld2lqRm1wY1pXbG95TC1IY3RJOUdoR3hJZTM3MzlibVlLeTBWSV9hbA?oc=5\" target=\"_blank\">Liberty Parts Ways With Coach Sandy Brondello in Shocking Move</a",
      "<p>A year after hoisting their first WNBA title, the New York Liberty are making a drastic change.</p>"
    ],
    "image_url": "",
    "titles": [
      "Liberty coach Brondello out after first-round exit",
      "Liberty Parts Ways With Coach Sandy Brondello in Shocking Move - Sports Illustrated",
      "Liberty parting ways with head coach Sandy Brondello"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Liberty announced the departure of coach Sandy Brondello shortly after the team, the defending WNBA champions, was eliminated from the playoffs. This move marks a significant change for the team a year after winning their first WNBA title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 3 Power Rankings: Titans' Placement Varies, Defensive Concerns Noted",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 09:35:05 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "www.musiccitymiracles.com",
      "news.google.com",
      "bearswire.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "We stacked every NFL team ahead of Week 4. Who jumped up our 1-32 list? Plus, let's pick out the biggest defensive concerns for each roster.",
      "A look at where the Titans rank in various power rankings around the internet.",
      "With Week 3 of the 2025 NFL season in the books, here are our latest power rankings.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxORVVRQXlkQV8wWlNCWkJ4d1dueUZrR3dkajdIdGFnbVlJMG0wYmo1R2FBaUVqSk91TEhBenNBQ2pfaXNsUUJMMGJkcVdfWXk4TjdHNHBBOEhReFhqYmpoR3lGX3lCVnVXdDFKQnpaVjVCcC1UQmRJTmZ3VXdPd3ZIWHdzRnlsbklS?oc=5\" target=\"_blank\">B/R Experts Week 4 NFL Power Rankings</a>&n"
    ],
    "image_url": "",
    "titles": [
      "📈 NFL Power Rankings: Defensive issues",
      "NFL week four power rankings and the Titans",
      "NFL Week 4 power rankings: Buccaneers rise, Falcons fall",
      "B/R Experts Week 4 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The latest NFL power rankings post-Week 3 of the 2025 season have been released, highlighting the positions of all 32 teams ahead of Week 4. The rankings also identify key defensive concerns for each team. The Tennessee Titans' placement varies across different internet power rankings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Online Retail Giant to Close 19 Shops, 5 to Become Whole Foods",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 13:48:20 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The online retail giant says it would convert five of the 19 shops into Whole Foods stores.",
      "The company's grocery business has undergone significant changes in the past few years, including trimming its brick-and-mortar store footprint.",
      "<p>Company to shut 19 shops and convert five to Whole Foods outlets, after concept of stores without tills fails to catch on</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news\">"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bc2e/live/a738bca0-987e-11f0-b146-278281693603.jpg",
    "titles": [
      "Amazon to close its UK grocery stores",
      "Amazon to close all of its Fresh grocery stores in UK",
      "All Amazon Fresh stores in UK to close"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.931,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An online retail giant announced plans to close 19 shops, with five being converted into Whole Foods stores, as part of a strategy adjustment following the unsuccessful adoption of its till-less store concept. This move reflects significant changes in the company's approach to its grocery business, which has seen a reduction in its physical store presence recently.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Inflation Forecast for 2025 Revised to 3.5% Due to Tax and Price Hikes",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:01:26 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The influential policy group lifts its forecast for UK inflation, saying it will be 3.5% in 2025.",
      "Forecasts come as businesses and households absorb impact of higher payroll taxes and regulated prices",
      "<p>International body warns British rate will be higher than that in US, despite effects of Trump tariffs</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news\">Business live – lat"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/395e/live/5a610f60-9863-11f0-858a-a904eacbef23.jpg",
    "titles": [
      "UK forecast to have highest inflation among richest nations",
      "UK set for highest inflation in G7, says OECD",
      "UK to suffer highest inflation in G7 this year, says OECD"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.955,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The influential policy group has revised its UK inflation forecast to 3.5% for 2025, attributing this increase to the effects of higher payroll taxes and regulated prices. This adjustment comes as both businesses and households navigate these financial pressures. Additionally, the group warns that the UK's inflation rate will surpass that of the US, even considering the impact of Trump tariffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Egyptian-British Activist Alaa Abd El-Fattah Freed After Presidential Pardon",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 11:39:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Egyptian-British activist Alaa Abd El-Fattah was reunited with his family on Tuesday following his release,",
      "<p>Writer, who has served six years for sharing a Facebook post, was given a presidential pardon</p><p>The British-Egyptian human rights activist Alaa Abd el-Fattah has been released from jail after serving six years for sharing a Facebook post.</p><p>Egypt’s president, Abdel Fatah al-Sisi, granted ",
      "Abdel Fattah was a symbol of the 2011 uprising but was arrested two years later. He has since spent almost all of the past 12 years behind bars."
    ],
    "image_url": "",
    "titles": [
      "Activist Alaa Abd El-Fattah reunites with family after release",
      "British-Egyptian activist Alaa Abd el-Fattah freed from prison",
      "Arab Spring activist Alaa Abdel Fattah released after pardon from Egypt’s Sisi"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Egyptian-British activist Alaa Abd El-Fattah was released from jail after serving six years for sharing a Facebook post, following a presidential pardon by Egypt's President Abdel Fatah al-Sisi. Abd El-Fattah, known for his role in the 2011 uprising, has spent nearly 12 years in prison since his arrest in 2013. He was reunited with his family on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jimmy Kimmel's Show to Resume Tuesday After Disney Suspension",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 11:31:12 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "ABC News",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "ottawa.citynews.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "The late-night comic's show will return to air after Disney said it had \"thoughtful conversations\" with him.",
      "Jimmy Kimmel is set to return to the air Tuesday night on ABC, The Walt Disney Company said.",
      "ABC will reinstate Jimmy Kimmel’s late night show in the wake of criticism over his comments about the assassination of conservative activist Charlie Kirk, officials with the network said Monday. &#8220;We have spent the last days having thoughtful conversations with Jimmy, and after those conversat"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6a8f/live/3a2c90b0-97fb-11f0-be80-2974137b337f.jpg",
    "titles": [
      "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
      "WATCH:  Jimmy Kimmel returns to ABC on Tuesday after suspension",
      "ABC ends Jimmy Kimmel’s suspension and his show will return Tuesday"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.887,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jimmy Kimmel's late-night show will return to air on Tuesday after being temporarily pulled by Disney due to his comments about the assassination of Charlie Kirk. Disney described the comments as 'insensitive' but decided to resume the show following \"thoughtful conversations\" with Kimmel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dembélé Wins First Ballon d'Or, Bonmati Secures Women's Award",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-23T09:14:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.dw.com"
    ],
    "snippets": [
      "For Ousmane Dembele it was his first Ballon d'Or, while Aitana Bonmati made history.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1lMjBtQWZIS1lVbnBzMTdCMnh2MEkwbE5VV2dhcGkzUkxQME1qRmlYajBaQjJZTjV6Nm9ZWHpmX0xJX2FoZGR4TnRKazVsZWlMS1lySTlUdTd2TGxGOF9qYWhkbE9kZnhWM3lUTU1Hbw?oc=5\" target=\"_blank\">Ousmane Dembele Wins 2025 Men’s Ballon d’Or</a>&nbsp;&nbsp;<font color=\"#6f6f",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTFBtMWFKUWlNVmV0YzVSTHZLY3pOQ0p3UWZrOXV5d1RZdjhWRVc4dnN1THRvZlVlMnNuVEN3MlBZSkcxYUlkbmJiVThpQVBFeGh3bFo5aWI1Y3p4d3hhUlFVZ1pfYmhqXzhNQk5CTkRGZlZkUQ?oc=5\" target=\"_blank\">Aitana Bonmati Matches Lionel Messi With 2025 Ballon d’Or Feminin Win</a>",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxPY1VNUXF5c2N1T3pNNDNZYlVTdzRtMUNhRm5felRZOGRHWF9qMFotdTZBRlZTc1JUMmdZVE5wOVpfMWVYYzJUaVJNcUZtX2ZqUUR0WXQwLWFPcWEwX3kwc25uRGs3cGp6TjhydFkwS3Zjd2s5TURNdTNXS2ozTG9Bc1cyWWZJcGM?oc=5\" target=\"_blank\">Cole Palmer Secures Remarkable 2025 Ballon d",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE85ckpkejA5TTh4Y2pRaHV5Mm1pRmVJWTd5TWc1TTVERHo1a3BNbTFWQXdkSk1VaUUyS1dJdDJUbWtSS1lRRUVRckcta21vODh5RjM2MzNveHBrSFBOTlQ2YThIa0t6MGRsYk54WGIwZmpQNl9fSGdjdWZFcUM?oc=5\" target=\"_blank\">Mohamed Salah’s 2025 Ballon d’Or Ranking Revealed</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE93VXl3N3BsVUpQbDA5NXk4X3AwTWNvM3R3ZW82dWNBdDA2bDhIMVNZNG5HVnlSVnk5a3hqWnVVV2pMc2Z3N0Q3Rnd5Ykx5dUJkcExnblAxelFIWjBURkxoaDB4bDFJWTFoV2pZSHR6S18wRTNTVEVn?oc=5\" target=\"_blank\">Raphinha Loses Out to Barcelona Teammate in Surprise 2025 Ballon d’",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5mLVpQNTFsOUVIaWZYbjBWTXJmSC1wS3NqdXhySUNjUERnN0JhVlZOZDA2aC02VW16YTMwQWdrVjJ2NlU4OGVaOXZKbWx4aW5QMi0tT0Ixc2VERnJEcU8wQVlQcDh5OXdwbEVSMnNpNURMa1dsb2lnci1XeE4?oc=5\" target=\"_blank\">49ers Lose Nick Bosa for Remainder of 2025 Season with Torn ",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1pcWlMbU1SQkhIa2VBV3lBdHRhckZ2dVl0RlA1ZHhpNWFTREIxOFpObnBoSTNjUGNyck5mMWZfT3lBZVZXbGJfUUVodnpiTVc3bUNla3lWdVF3TERlRXh4NzFabFpNS1MySnQzRUFKNEtZTmlpaVE?oc=5\" target=\"_blank\">Kylian Mbappe Learns 2025 Ballon d’Or Fate After Historic Real Madri",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNdloyaXJSWS1lM3JUX1RTOGNzSkJXeHhDSVg0QVJwV2FLTWY3TEZ6WWtGR1c4RTl4YktVYS1NaVpBRFlTZGFYRDJHcG5QT09BUmN6UFYzX09NWHhadVJkTVJ5djlyNXNBM0dpQ25tXzZ3RTN0RzlFT19iWTRGSmR6WWJVb1JVQlRVSUU0WjJPblY0bnM?oc=5\" target=\"_blank\">Why Kylian Mbappe, Real Madr",
      "<p>After securing a domestic treble and a pair of continental trophies, Ousmane Dembele will have to find room for yet another piece of distinguished hardware on his mantle. </p>"
    ],
    "image_url": "",
    "titles": [
      "Ousmane Dembele and Aitana Bonmati win Ballon d'Or",
      "Ousmane Dembele Wins 2025 Men’s Ballon d’Or - Sports Illustrated",
      "Aitana Bonmati Matches Lionel Messi With 2025 Ballon d’Or Feminin Win - Sports Illustrated",
      "Cole Palmer Secures Remarkable 2025 Ballon d’Or Ranking - Sports Illustrated",
      "Mohamed Salah’s 2025 Ballon d’Or Ranking Revealed - Sports Illustrated",
      "Raphinha Loses Out to Barcelona Teammate in Surprise 2025 Ballon d’Or Ranking - Sports Illustrated",
      "49ers Lose Nick Bosa for Remainder of 2025 Season with Torn ACL - Sports Illustrated",
      "Kylian Mbappe Learns 2025 Ballon d’Or Fate After Historic Real Madrid Debut Season - Sports Illustrated",
      "Why Kylian Mbappe, Real Madrid Aren’t at 2025 Ballon d’Or Ceremony - Sports Illustrated",
      "PSG’s Ousmane Dembele, Barcelona’s Aitana Bonmati win Ballon d’Or awards"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.864,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ousmane Dembélé, Paris Saint-Germain forward, won the 2025 Ballon d'Or, marking his first win of the award for the world's best player. His victory came after a successful season highlighted by Champions League success and a domestic treble. Aitana Bonmati won the women's award at the same ceremony in Paris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Maple Leafs' Woll Takes Leave for Family Matter; Stolarz Steps In",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:46:52 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Toronto Maple Leafs goaltender Joseph Woll has taken a leave of absence to attend to a personal family matter, the club announced Tuesday.",
      "<p>The Toronto Maple Leafs will have to lean on Anthony Stolarz and their backup goalies as the ramp-up to the season rolls on. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5915c16d5adea347724ba5fd353adcc920867a6580343307680a02da929266ba.jpg?quality=65&strip=all",
    "titles": [
      "Leafs G Joseph Woll on leave for personal reasons",
      "Maple Leafs’ Joseph Woll takes leave of absence, no timeline for return"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.709,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Toronto Maple Leafs goaltender Joseph Woll is on a leave of absence due to a personal family matter, as announced by the club. During his absence, Anthony Stolarz and backup goalies will cover for him as the season progresses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Ends Legal Challenges Against U.S. Softwood Duties",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:21:47 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "OTTAWA &#8212; Canada has dropped two legal challenges of United States duties on Canadian softwood lumber. The U.S. has long accused Canada&#8217;s softwood lumber sector of violating rules on anti-dumping &#8212; flooding a market with cheaper, subsidized products to disrupt a domestic industry. T",
      "OTTAWA — Canada has dropped two legal challenges of United States duties on Canadian softwood lumber. The U.S. has long accused Canada&#8217;s softwood lumber sector of violating rules on anti-dumping — flooding a market with cheaper, subsidized products to disrupt a domestic industry. The U.S. Comm"
    ],
    "image_url": "",
    "titles": [
      "Canada drops 2 appeals of U.S. anti-dumping duties on softwood lumber",
      "Canada drops 2 appeals of U.S. anti-dumping duties on softwood lumber"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.708,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada has withdrawn two legal challenges against U.S. duties on its softwood lumber, previously accused by the U.S. of anti-dumping violations. This marks an end to the disputes over these specific duties.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gun-Control Group Calls for SKS Rifle Ban in Federal Buyback Program",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:31:22 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "A gun-control group is pushing the federal government to ban the SKS semi-automatic rifle at the same time it is ramping up a firearm buyback program.",
      "A prominent gun-control group says the federal government&#8217;s buyback of assault-style firearms will be a waste of money unless it includes a prohibition of the semi-automatic SKS rifle. Since May 2020, Ottawa has outlawed approximately 2,500 types of guns on the basis they belong on the battlef"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/bfc85fc73e3e3ea606bf1dc176c79320f8cab03cb9cbe974be7f78f45bd54e32.jpg?quality=65&strip=all",
    "titles": [
      "Ottawa urged to add this ‘assault-style’ firearm to list of banned weapons",
      "Gun-control group urges Ottawa to ban SKS as assault-style firearm buyback ramps up"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A gun-control group is urging the federal government to include the semi-automatic SKS rifle in its firearm buyback program and to ban it, arguing the program will be ineffective without its prohibition. Since May 2020, Ottawa has banned around 2,500 gun types, deemed suitable only for battlefields.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mamdani Leads NYC Mayor Race, Endorsed by Harris Amid Party Hesitancy",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 11:48:26 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Zohran Mamdani is leading in the polls in the NYC Mayor's race. Kamala Harris says he's earned Democratic backing, but some party leaders have been slow to endorse the Democratic-Socialist candidate.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQNW0zZEkyTlFoQnUwbTQwR2R6bWlrOGl1VVlPWFB0clNUZVZWalBybHFSQzA2QWw3ckFxMmNUTHhQNEJuem90OTdSd3B6RkxhSnRmTWtIWVlvZGZTbVRXekFMemhNOUVYUTk5Zk1vR2dsMGV4U1NxekQzQWJBS0EzeGhUenB2OUNLcnVZMzlpanF6SnU5?oc=5\" target=\"_blank\">Harris on endorsing Mamdani"
    ],
    "image_url": "",
    "titles": [
      "Former VP Harris endorses Mamdani for NYC Mayor as some Democrats stay silent",
      "Harris on endorsing Mamdani for NYC mayor: \"I support the Democrat in the race, sure\" - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Zohran Mamdani is currently leading the NYC Mayor's race polls and has received an endorsement from Kamala Harris. Despite his lead and high-profile backing, some Democratic party leaders have been hesitant to support Mamdani, who identifies as a Democratic-Socialist.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Allows Trump to Dismiss FTC's Slaughter Pending Review",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 23:13:28 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPNUpYUlV3ejlreVlOdFBGV1R3d0lLaU9OS2t2QzVQMmw2U1JKOWRMNjk3Q2VMdFgxUFo5MUU4ajA1eWMxWGlhZkNCQVY0dWlrSlJDR0pFcDdQUFh3RmdvcFFVVDJXUFZYUUoxTTRaNWowcjZfbTJTdk9LTlYwTks3anpB?oc=5\" target=\"_blank\">Supreme Court lets Trump fire FTC official as it we",
      "The Supreme Court allowed President Donald Trump to remove Rebecca Slaughter as a member of the Federal Trade Commission while the justices consider her case.",
      "Kagan dissent: Majority is giving Trump \"full control\" of independent agencies."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court lets Trump fire FTC official as it weighs president's power over agencies - Axios",
      "Supreme Court lets Trump fire FTC's Slaughter for now",
      "Supreme Court lets Trump fire FTC Democrat despite 90-year-old precedent"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.687,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court has permitted President Donald Trump to dismiss Rebecca Slaughter from her position at the Federal Trade Commission. This decision is pending as the justices deliberate on whether the president has the authority to remove heads of agencies protected by Congress. Consequently, Slaughter is currently barred from her post.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Marshall Shares Top Week 5 College Football Picks, Washington Favored",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:43:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 5 college football schedule",
      "SportsLine's computer model has revealed its Week 5 college football picks, which include Washington covering versus No. 1 Ohio State",
      "We're here to help with the biggest betting storylines and best bets for Week 5, including an early pick for Oregon-Penn State."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/0da2511b-62b6-467c-9ca1-bb0cf323a1e9/taylen-green-arkansas-razorbacks-imagn-images-1.jpg",
    "titles": [
      "2025 college football Week 5 picks against the spread, odds, lines, key trends: Vegas expert reveals best bets",
      "College football odds, picks, predictions for Week 5, 2025: Model likes Washington, Texas A&M in best bets",
      "College football betting, picks, odds: Early best bets for Week 5's biggest games, including Oregon-Penn State"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Legendary Vegas handicapper Bruce Marshall shared his top betting picks for Week 5 of the college football schedule. Additionally, SportsLine's computer model predicted Washington will cover the spread against No. 1 Ohio State. The week's betting insights also spotlight an early pick for the Oregon-Penn State game, assisting bettors with key storylines and best bets for Week 5.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Desmond Watson Joins Tampa Bay Buccaneers' Practice Squad",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:42:30 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Defensive tackle Desmond Watson was signed to the Tampa Bay Buccaneers’ practice squad on Tuesday, a person with knowledge of the decision told The Associated Press.  Watson, who played at Florida, was originally signed by the Buccaneers after going undrafted in April.  The 6-foot-6 Watson lost 25 t",
      "<p>Defensive tackle Desmond Watson was signed to the Tampa Bay Buccaneers’ practice squad on Tuesday, a person with knowledge of the decision told The Associated Press.</p>"
    ],
    "image_url": "",
    "titles": [
      "Buccaneers sign 400-plus pound defensive tackle Desmond Watson to the practice squad, AP source says",
      "AP Source: Buccaneers sign 400-plus pound DT Desmond Watson to practice squad"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Desmond Watson, a defensive tackle from Florida, was signed to the Tampa Bay Buccaneers' practice squad on Tuesday, according to The Associated Press. Watson, who went undrafted in April, had previously signed with the Buccaneers and is 6-foot-6.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League Teams and Wrexham Join Tuesday's Action",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:17:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "royalbluemersey.sbnation.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The action is back on Tuesday with the Premier League's best joining the competition and Wrexham also involved",
      "Toffees travel to Wolves again looking to progress to the next round of the Carabao Cup"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/f8c3bca9-49e6-4a1d-854d-667565e87b6e/untitled-design-2025-09-22t221914-095.png",
    "titles": [
      "EFL Cup third round: Carabao Cup live stream, how to watch Wrexham, Liverpool, Chelsea and more",
      "Everton at Wolves: Carabao Cup Starting Lineups, TV & Live Stream info and How to Watch Online"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The action is back on Tuesday with the Premier League's best joining the competition and Wrexham also involved",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Integrates Gemini AI for In-Game Hints in Play Store Games",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-23T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Google will soon let you ask its Gemini AI assistant for help progressing in mobile games. On Tuesday, Google announced that a Gemini Live integration will appear within a new overlay on games downloaded from the Play Store, allowing you to ask for some hints without opening a new window. The featur",
      "Here comes another screen overlay."
    ],
    "image_url": "",
    "titles": [
      "Gemini AI will help you play games on Google Play",
      "Google Play is getting a Gemini-powered AI Sidekick to help you in games"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Google announced the integration of its Gemini AI assistant into mobile games via a new overlay feature in the Play Store, enabling players to request hints directly within games. This update aims to provide assistance without the need to open a new window.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Super PAC to Oppose AI Regulation Policies",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 13:36:39 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE5EUTlOMkprWjVvMFZDRkRHekpselFfUkczV05DbXpPY09DZ3hHTl9LV0UtSG5LUVo5dkp3d3djVGVNRC1RWm5iTGFYYWtYMUxqeVVCWXl1VXlDZEZDTXZJVjZoLV9SbzNIYjBDcA?oc=5\" target=\"_blank\">Exclusive: Meta launches super PAC to fight AI regulation</a>&nbsp;&nbsp;<font co",
      "Meta is investing 'tens of millions' into a new pro-AI super PAC called the American Technology Excellence Project to fight state-level tech policy that would regulate AI."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Meta launches super PAC to fight AI regulation - Axios",
      "Meta launches super PAC to fight AI regulation as state policies mount"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.927,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta has launched the American Technology Excellence Project, a super PAC, with an investment of 'tens of millions'. The purpose is to oppose state-level policies aimed at regulating AI technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Secret Service Disrupts Network Aimed at US Official Threats Before UN Assembly",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 12:53:06 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>US agency dismantled hidden telecom network that would have unleashed chaos ahead of UN general assembly</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\">US politics – live updates</a></p></li></ul><p>While",
      "The US Secret Service says it has disrupted a network of devices used to carry out assassination threats against US officials and for anonymous communications between threat actors, according to a report from NBC News. In the Tuesday announcement, the agency revealed that it uncovered the network wi"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0f6981395dd0ae7b945920d3903794cfe1a2752a/34_0_1034_827/master/1034.jpg?width=140&quality=85&auto=format&fit=max&s=514d9ac2371e0a1057d224899123d650",
    "titles": [
      "Secret Service takes down network that could have crippled New York cell service",
      "Secret Service dismantles network capable of shutting down cell service in New York"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Secret Service dismantled a hidden telecom network designed for assassination threats against US officials and secure communications among perpetrators. This action, taken ahead of the UN General Assembly, averted potential chaos. The network's disruption was announced on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scheme Threatens NYC Cell Network, Secret Service Ops at UN Assembly",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 13:46:30 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Investigators say the scheme could have shut down the cellular network in New York City.",
      "The Secret Service said the network posed an “imminent threat” to the agency’s operation protecting the UN General Assembly."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/99d6/live/6a80f7a0-9883-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Secret Service disrupts telecom threat near UN General Assembly",
      "Secret Service Dismantles ‘Telecommunications Threat’ Near UN General Assembly"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Investigators discovered a scheme that risked shutting down New York City's cellular network, posing an \"imminent threat\" to the Secret Service's operations during the UN General Assembly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spirit Airlines to Cut 1,800 Flight Attendant Jobs Amid Financial Struggles",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 17:12:30 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Spirit is planning to cut 1,800 flight attendants as it struggles to cut costs in bankruptcy.",
      "Spirit Airlines is cutting costs wherever it can as it battles through its second bankruptcy in less than a year."
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines to furlough 1,800 flight attendants to cut costs in bankruptcy",
      "Spirit has already axed flights and asked pilots to take a pay cut. Now it's furloughing 1,800 flight attendants."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.606,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spirit Airlines is facing financial challenges and plans to reduce its workforce by cutting 1,800 flight attendants. The airline is making these cuts as part of its efforts to lower costs during its second bankruptcy in less than a year.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Jimmy Kimmel Live!\" Resumes on ABC After Suspension Over Kirk Comments",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 01:57:26 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE9aRUxERGpVTU9EWjJVSDN6ZVdLRnplMFFxaDF6d0VqZThEZkN1OVN3ZXk1OU9fQllTUDQ4ZlBRQ0N0VXZwRUs0MWhBdklCTng3U1JQekY2MElwSEc4OVl0M1dISFVNT1JKQmZLLUpR?oc=5\" target=\"_blank\">Disney bringing Jimmy Kimmel back Tuesday</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">",
      "Disney says \"thoughtful conversations with Jimmy\" led to show's return."
    ],
    "image_url": "",
    "titles": [
      "Disney bringing Jimmy Kimmel back Tuesday - Axios",
      "Disney reinstates Jimmy Kimmel after backlash over capitulation to FCC"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.727,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "\"Jimmy Kimmel Live!\" will return to ABC on Tuesday after being pulled off the air due to comments the host made about the death of conservative activist Charlie Kirk, linking the alleged killer to President Trump's MAGA movement. The Walt Disney Company, ABC's parent company, announced the show's return following a brief suspension and \"thoughtful conversations with Jimmy.\" However, Sinclair, owning ABC affiliate stations, stated it would not air the show following Disney's decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Links Acetaminophen to Autism, Faces Criticism",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 17:21:02 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5rSU5RbGdUTHlsUkR4MXlLbVl6TjJmRmxHZzNnbXVuakhNODlQbDZVLWQ3ai1zZDVXWHdaQlRjZzAzWmVUNDMwZHFQRThZbW5iaFBTSHloZkgtQlNLMlM5QV9tUmpvZmdBNlUxampQZEtwOWUwZEF2T0tWVFctQQ?oc=5\" target=\"_blank\">Tylenol maker Kenvue blasts Trump administration's autism",
      "Economists saw “limited” risk to the pharmaceutical firm’s stock, despite some expected impact on Tylenol consumption."
    ],
    "image_url": "",
    "titles": [
      "Tylenol maker Kenvue blasts Trump administration's autism claim - Axios",
      "Tylenol Maker Kenvue Shares Rebound After Trump Links Drug To Autism"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.608,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration claims a link between acetaminophen use during pregnancy and autism, advising against its use unless necessary and promoting leucovorin as a potential autism treatment. However, there's minimal credible scientific support for these assertions, with experts denying a causal relationship between acetaminophen and autism. The situation has sparked controversy, including criticism from Tylenol's manufacturer, Kenvue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acclaimed Show Premieres on Apple TV+, Netflix Adds Racy New Series",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 10:04:19 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "If you way to watch of the best, most gory, sexy TV shows in recent memory, you should check out what just got added to Netflix today.",
      "The best new show to hit Apple TV+ in a while has arrived with perfect scores from critics, but it may not be for everyone, given its subject matter."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d2a72cc003e376ca0e1813/0x0.jpg?width=960",
    "titles": [
      "One Of TV’s Best, Over-The-Top Action Shows Returns To Netflix Today",
      "One Of TV’s Best Shows Returns With Its Third 100% Scored Season"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.956,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A highly acclaimed new show with perfect critic scores has premiered on Apple TV+, noted for its potentially divisive subject matter. Meanwhile, Netflix has added a new series described as one of the best in terms of gore and sex appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brompton Funds Announces Quarterly Distributions for ETFs, Payable Oct 15",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:38:51 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "TORONTO, Sept. 23, 2025 (GLOBE NEWSWIRE) &#8212;  (TSX: KNGC, KNGU, KNGX) – Brompton Funds announces quarterly distributions payable on October 15, 2025 to unitholders of record on September 30, 2025 for each of the following exchange-traded funds:   Ticker Amount Per Unit Brompton Canadian Cash Flo",
      "TORONTO, Sept. 23, 2025 (GLOBE NEWSWIRE) &#8212; (TSX: BAAA, BAAA.U) Brompton Wellington Square AAA CLO ETF announces distributions payable on October 15, 2025 to unitholders of record at the close of business on September 30, 2025 as follows: Ticker Amount Per Unit BAAA Cdn$0.088 BAAA.U US$0.089   ",
      "TORONTO, Sept. 23, 2025 (GLOBE NEWSWIRE) &#8212; (TSX: DGS, ESP.PR.A, GDV, GDV.PR.A, LBS, LBS.PR.A, LCS, PWI, PWI.PR.A, SBC, SBC.PR.A) – Brompton Funds announces distributions payable on September October 15, 2025 to class A shareholders of record at the close of business on September 30, 2025 for e"
    ],
    "image_url": "",
    "titles": [
      "Brompton Funds Declare Distributions",
      "Brompton Wellington Square AAA CLO ETF Declares Distributions",
      "Brompton Funds Declare Split Share Fund Distributions"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.987,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On September 23, 2025, Brompton Funds announced quarterly distributions for multiple exchange-traded funds (ETFs) and class A shareholders, payable on October 15, 2025. Unitholders and shareholders of record by September 30, 2025, are eligible. The announcement includes specific ETFs such as Brompton Canadian Cash Flow and Brompton Wellington Square AAA CLO ETF, with distribution amounts per unit detailed for some funds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "StrictlyVC Joins TechCrunch Disrupt 2025 with Exclusive LP Track",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 14:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "StrictlyVC joins TechCrunch Disrupt 2025 for an investor-only LP track on October 28. Explore the full agenda and grab your investor tickets before prices rise on Sept 26.",
      "Your window to save up to $668 on TechCrunch Disrupt 2025 closes in just 4 days. Regular Bird pricing ends September 26 at 11:59 p.m. PT. Join 10,000+ founders, investors, and innovators shaping the future of tech at the conference where startup legends like Discord and Mint got their start."
    ],
    "image_url": "",
    "titles": [
      "StrictlyVC at TechCrunch Disrupt 2025: The full LP track agenda revealed",
      "TechCrunch Disrupt 2025 ticket rates increase after just 4 days"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.964,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "StrictlyVC will participate in TechCrunch Disrupt 2025 with an investor-only LP track on October 28. Attendees can save up to $668 on tickets until September 26. The event, known for launching startups like Discord and Mint, expects over 10,000 founders, investors, and innovators.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]