[
  {
    "title": "Fifteen people killed in attack at Hanukkah event in Sydney",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 13:37:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "ABC News",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Axios",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "abcnews.go.com",
      "washingtonpost.com",
      "nytimes.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Shooter responsible for Bondi Beach attack was a licensed firearms holder who owned six firearms, police say.",
      "Prime Minister Albanese said he and state leaders had agreed to several new measures to restrict access to firearms. Fifteen people were killed in an attack on a Jewish celebration at the popular Sydney beach.",
      "The attack left 42 people injured, including two police officers, according to officials.",
      "Police said the shooting, which injured at least 40 people, was a terrorist attack targeting the Jewish community. A gunman was killed.",
      "Officials said the father had been living in Australia since 1998, and that neither man appeared to have a criminal record before the mass shooting on Sunday.",
      "Naveed Akram previously known to security agencies, prime minister says. His gun-owning father, Sajid, was shot dead by police at the scene Victims named so far What we know so far about the Bondi terror attack The alleged gunmen behind the Bondi beach attack are a father-son duo suspected of using",
      "Australia sees deadliest shooting since 1996 at Hanukkah celebration Axios",
      "Two men toting long guns opened fire on hundreds of people who were celebrating Hanukkah on Bondi Beach in Sydney, the core of the Australian city’s Jewish community.",
      "I lived and worked around Bondi for years. The emergency response tells you everything you need to know about the area.",
      "Israeli PM on Sunday accused Anthony Albanese of doing ‘nothing to stop the spread of antisemitism’ Bondi terror attack: full report What we know so far about the attack Australia’s prime minister has rejected accusations from his Israeli counterpart, Benjamin Netanyahu, that Australia’s recognition",
      "The prime minister’s office said officials agreed that Australia needed “immediate” reform, including new restrictions on who is allowed to own firearms.",
      "Australia to tighten gun laws after Bondi Beach Hanukkah massacre AP News"
    ],
    "image_url": "",
    "titles": [
      "Bondi Beach shooting: How tough are Australia’s gun laws?",
      "Bondi Beach shooting: Australia agrees to tougher gun laws",
      "WATCH:  At least 15 killed in shooting at Bondi Beach, Australia, officials say",
      "Live updates: 15 killed in Bondi Beach shooting by father and son, Australian officials allege",
      "Suspects in Bondi Beach Shooting Identified as Father and Son",
      "Bondi beach terror attack: father and son duo allegedly used licensed firearms in shooting",
      "Australia sees deadliest shooting since 1996 at Hanukkah celebration - Axios",
      "How the Bondi Beach Shooting Unfolded at a Hanukkah Celebration",
      "How the Bondi Beach Community Rushed to Help Shooting Victims",
      "Australian PM rejects Netanyahu’s linking of Palestine recognition to Bondi beach attack",
      "Australian Leaders Promise to Tighten Gun Laws After Bondi Beach Attack",
      "Australia to tighten gun laws after Bondi Beach Hanukkah massacre - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/15/bondi-beach-shooting-how-tough-are-australias-gun-laws?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/bondi-beach-shooting-australia-agrees-to-tougher-gun-laws/a-75157432?maca=en-rss-en-top-1022-rdf",
      "https://abcnews.go.com/WNT/video/15-killed-shooting-bondi-beach-australia-officials-128401280",
      "https://www.washingtonpost.com/world/2025/12/14/bondi-beach-shooting-australia/",
      "https://www.nytimes.com/2025/12/14/world/australia/suspects-identified-bondi-beach-attack.html",
      "https://www.theguardian.com/australia-news/2025/dec/15/bondi-beach-terror-attack-father-son-duo-alleged-behind-shooting-licensed-firearms-ntwnfb",
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxQRlhtUmhLY290Q2ExOXRwMHhzS0tYbUkzMHRFV1RLMVZDcTBFdGs2d0tYcHNxWHA4WjN6bVJyUlJYTmdwczlfWi10bER2clZnRnlpNkVOSEQzQ3dpRk9MWXRQRW94TG0wQU40d0JWMlBSay1rZi1CVU1faDBQOGRJRnJOa2xlZw?oc=5",
      "https://www.nytimes.com/2025/12/15/world/australia/bondi-beach-shooting-sydney-australia.html",
      "https://www.nytimes.com/2025/12/15/world/asia/bondi-community-hanukkah-attack.html",
      "https://www.theguardian.com/australia-news/2025/dec/15/australian-pm-rejects-netanyahu-linking-palestine-recognition-bondi-beach-attack",
      "https://www.nytimes.com/2025/12/15/world/australia/australia-gun-laws-bondi-shooting-attack.html",
      "https://news.google.com/rss/articles/CBMingFBVV95cUxQQVhmMzUzZ2g4T3p1MmFnUFRvTVV2OC1XZmhqQ181MW1LTjd2czdpVHh3VTRXUXVyNVN4eGpYQ1dSVldYWTM1VDNYeUd0dmNXUmphQWdKMmFNSTJsZjRjOW41T0RNYy0wa29KUi1GamZrcC14Nk0tMkw4QWUzMFdUdzdvd0lIN3NvTmhQTmQ2SmJwdWVSNEYxZ2oyTmViZw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/15/bondi-beach-shooting-how-tough-are-australias-gun-laws?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.824,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.867,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about Australia's gun laws, contributing to the reader's understanding of the issue. However, it does not report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A terrorist attack at a Hanukkah celebration on Bondi Beach in Sydney left 15 people dead and 42 injured, including two police officers. Police identified the attackers as a father-son duo, both licensed firearms holders with no prior criminal records. The gunman was killed by police at the scene. In response, Prime Minister Albanese and state leaders have agreed to introduce new measures to further restrict access to firearms in Australia.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Sixteen people killed in Sydney Hanukkah celebration shooting",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 13:06:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "Reuters",
      "New York Times",
      "CBC News",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com",
      "news.google.com",
      "nytimes.com",
      "cbc.ca",
      "theguardian.com"
    ],
    "snippets": [
      "Australia’s spy agency has revealed it investigated one the men who carried out the Bondi massacre for links to ISIL.",
      "Sixteen people attending a Hanukkah celebration in the Sydney beachside suburb of Bondi Beach were killed in a mass shooting that is now Australia’s most deadly terror attack.",
      "Two gunmen involved in the attack have been identified by the Australian authorities as a father and son.",
      "What we know about the shooting victims at Sydney's Bondi Beach Jewish event Reuters",
      "At least 15 people were killed in the attack in Sydney, Australia, including a 10-year-old girl, a long-serving rabbi and a Holocaust survivor.",
      "Two gunmen opened fire at dozens of people who were at a Jewish holiday event. At least 15 people were killed in the attack, and so was one of the shooters, the police said.",
      "Among the 15 victims of a mass shooting at Australia's Bondi Beach during an event for the Jewish festival of Hanukkah on Sunday were a rabbi, a Holocaust survivor and a 10-year-old girl, according to interviews, officials and local media reports.",
      "The family of Ahmed al-Ahmed, a Syrian Muslim father of two who tackled one of the alleged attackers during the mass shooting on Sunday at Bondi Beach in Sydney, Australia, has spoken out, hailing their son as a \"hero.\"",
      "Social media video captured people on Bondi beach in Australia fleeing after alleged gunmen opened fire on Sunday during a Hanukah celebration. At least 16 people were killed in the attack, including one of the alleged shooters, police said. At least 29 people were taken to hospital Bondi beach shoo"
    ],
    "image_url": "",
    "titles": [
      "What we know about the Bondi Beach Hanukkah shooting",
      "Bondi Beach attacks: What you need to know",
      "What we know about the Bondi gunmen",
      "What we know about the shooting victims at Sydney's Bondi Beach Jewish event - Reuters",
      "What to Know About the Victims of the Bondi Beach Shooting",
      "What We Know About the Bondi Beach Shooting in Australia",
      "What we know about the victims in the Bondi Beach Hanukkah attack",
      "What we know about Ahmed al-Ahmed, the Bondi Beach bystander who disarmed gunman",
      "What we know about the Bondi beach attack so far – video report"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/15/what-we-know-about-the-bondi-beach-hannukah-shooting?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/bondi-beach-attacks-what-you-need-to-know/a-75166002?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/cpvd8z7k8kwo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxPNGdYRnBGd1JuLTJucThUMGdXTjVGcFVvU1U2bnBlVHVYc1pCZFpzUXo5eGFDSFpHY0kzUTI4VGtuR3JDWEdMUHlXSnhTdl9EWEIwMS1MLU1ld3oxRmJySFBqd1RjMWVfMmUybEJPakp5azAwU2RMOHFUQXdyOS1FQXV2bzByd3lodlZlX1Uxd3kxa0h2Y2xOQ1R5UGlMbDAycGstcnBzRDE4NWVNdkplaEtVQ3E0UkRwQjd5RDFkNlE4cHNT?oc=5",
      "https://www.nytimes.com/2025/12/14/world/australia/australia-shooting-hanukkah-victims-bondi-beach.html",
      "https://www.nytimes.com/2025/12/14/world/australia/what-we-know-bondi-shooting.html",
      "https://www.cbc.ca/news/world/bondi-beach-australia-attack-victims-9.7015944?cmp=rss",
      "https://www.cbc.ca/news/world/bondi-mass-shooting-hannukah-gunmen-hero-9.7015882?cmp=rss",
      "https://www.theguardian.com/australia-news/video/2025/dec/14/bondi-beach-attack-what-we-know-video-report"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/15/what-we-know-about-the-bondi-beach-hannukah-shooting?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.812,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.854,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the incident, potentially helping readers understand the situation better. However, it does not focus on solutions or progress, limiting its constructive value.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Sixteen people were killed and at least 29 injured in a mass shooting at a Hanukkah celebration in Sydney’s Bondi Beach on December 14, 2025. The attack, described as Australia’s deadliest terror incident, was carried out by two gunmen, identified by authorities as a father and son. One shooter was killed at the scene. Victims included a rabbi, a Holocaust survivor, and a 10-year-old girl. Australia’s spy agency confirmed it had previously investigated one of the attackers for links to ISIL.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "iRobot files for bankruptcy and will be bought by Picea Robotics",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 15 Dec 2025 13:24:05 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "The Guardian",
      "Bloomberg",
      "Ars Technica"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "arstechnica.com"
    ],
    "snippets": [
      "iRobot, the U.S. firm that had robots vacuuming homes, will be taken over by its China-based supplier. It's assuring owners that devices will keep working as usual.",
      "Roomba maker iRobot files for bankruptcy, pursues manufacturer buyout Reuters",
      "US-listed company, whose profits have been in decline since the pandemic, will be taken over by Picea Business live – latest updates The US company behind the Roomba robot vacuum cleaner has filed for bankruptcy protection and agreed to be taken over by one of its Chinese suppliers. iRobot, which is",
      "Robot Vacuum Roomba Maker Files for Bankruptcy After 35 Years Bloomberg.com",
      "Shenzhen-based Picea Robotics, its lender and primary supplier, will acquire all of iRobot’s shares."
    ],
    "image_url": "",
    "titles": [
      "Roomba maker files for bankruptcy, weighed down by debt and tariffs",
      "Roomba maker iRobot files for bankruptcy, pursues manufacturer buyout - Reuters",
      "Roomba maker iRobot bought by Chinese supplier after filing for bankruptcy",
      "Robot Vacuum Roomba Maker Files for Bankruptcy After 35 Years - Bloomberg.com",
      "Roomba maker iRobot swept into bankruptcy"
    ],
    "url": "https://www.npr.org/2025/12/15/nx-s1-5644772/tariffs-roomba-irobot-bankruptcy",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxPVGg4UmJKQXlORTljYXhoNFJqaG1tRF9jc1BYVXh1MzMwTEEwX1A4TWtKejhZdnk3WXlnWXV0cTF1NGk0cllQN0laaFhBRndmNTJNS1k0SGdsU1RiRVB4Q2hNdXJKS2U0NWJ0YlJHTUdNcTQ3bEdXM2c5NXg1THB3cnRkWUNmYk1nLVZiQmNjX3NvUDBUcThVT2dLbVViYlpw?oc=5",
      "https://www.theguardian.com/business/2025/dec/15/roomba-vacuum-cleaner-firm-irobot-bankruptcy-picea",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQYVlLc3BqYmpiWmxZRkZHb20xcG5Da2p2cnhBdDlHanlJc3Y1QnFzejdiSWRFMkZZdkVzLTZ6dWlYSlZjNHNYY2RVYm04d2xNaUVNVWxMdnBDaExfdUdmY0ZWTkJKVnR5ZWNHcHp1TDNDbktfbTdmNXZZN3VobEVfZlhjOWhlUlNlQ2l5cGJEREx6ZTRBMk9ZempKRXFmbnRjdHNlRXpkWDBNbmIxV2F5dkdn?oc=5",
      "https://arstechnica.com/information-technology/2025/12/roomba-maker-irobot-swept-into-bankruptcy/"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/15/nx-s1-5644772/tariffs-roomba-irobot-bankruptcy",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.94,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.841,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "iRobot, the U.S. company known for its Roomba robot vacuum cleaners, has filed for bankruptcy after declining profits. The company will be acquired by Shenzhen-based Picea Robotics, its primary supplier and lender. iRobot has assured customers that its devices will continue to function as usual during the transition.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Rob Reiner and wife found dead son arrested police investigate",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 15:55:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "NPR",
      "Reuters",
      "CBC News",
      "Associated Press",
      "Globe and Mail",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "npr.org",
      "news.google.com",
      "cbc.ca",
      "forbes.com"
    ],
    "snippets": [
      "President Trump criticised for remarks blaming Hollywood figure's death on his 'Trump derangement syndrome'.",
      "The son of Rob and Michele Reiner was arrested after the Hollywood director and his wife were found dead in Los Angeles. Authorities were probing an \"apparent homicide.\"",
      "Here's what we know about the mass shooting that left at least 15 people dead. And, authorities found director Rob Reiner and his wife, Michele, dead in their Los Angeles home.",
      "Filmmaker Rob Reiner and wife found dead of apparent homicide, son arrested Reuters",
      "Director-actor Rob Reiner and his wife, Michele, were the two people found dead Sunday at a Los Angeles home owned by Reiner, according to a law enforcement official briefed on the investigation.",
      "Son Nick arrested after Rob Reiner and his wife found dead in Los Angeles home, AP source says AP News",
      "Rob Reiner’s son Nick arrested after filmmaker, wife found dead in L.A. home The Globe and Mail",
      "Rob Reiner and wife, Michele, found dead in LA home in \"apparent homicide\" Axios",
      "Reiner and his wife were found dead in an apparent homicide Sunday that Trump claims was related to the actor’s dislike of the president."
    ],
    "image_url": "",
    "titles": [
      "Police arrest Rob Reiner’s son after director and wife found dead",
      "US: Director Rob Reiner, wife found dead in LA mansion",
      "15 killed in mass shooting in Sydney. And, Rob Reiner and his wife found dead",
      "Filmmaker Rob Reiner and wife found dead of apparent homicide, son arrested - Reuters",
      "Director Rob Reiner and his wife found dead in Los Angeles home, with homicide unit investigating",
      "Son Nick arrested after Rob Reiner and his wife found dead in Los Angeles home, AP source says - AP News",
      "Rob Reiner’s son Nick arrested after filmmaker, wife found dead in L.A. home - The Globe and Mail",
      "Rob Reiner and wife, Michele, found dead in LA home in \"apparent homicide\" - Axios",
      "Furor Follows Trump’s Comments About Rob Reiner’s Murder"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/15/police-take-hollywood-director-actor-rob-reiners-son-into-custody?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/us-director-rob-reiner-wife-found-dead-in-la-mansion/a-75155567?maca=en-rss-en-top-1022-rdf",
      "https://www.npr.org/2025/12/15/g-s1-102270/up-first-newsletter-hanukkah-sydney-bondi-beach-brown-university-shooting-rob-michele-reiner",
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxNcHg1SE1zYm9SWEpMZmJ6Vldzbk1NcDVyc2dkeFVUR01ZbTlZSnlOYXM1bTYzcUc0YTM1QlhVUDJzUXliem9RMF9sVEtCZFJVR2pieGIzbWhNU0xHYWFSS1pBbzctcERVaUhHZV9WWURVaktjMEx1dlZTa3F0aHZYdWd2aHN1SnlnZ1J0ZlJ0NDdOZUJOM1R0WWRRWG5LUTlUSFI0MzN3eHFWVmROZUJWX0MzOXJpd0tDQ3NXVllhNldwVWN1cUFwdDUtNS10dw?oc=5",
      "https://www.cbc.ca/news/entertainment/rob-reiner-home-homicide-investigation-9.7015729?cmp=rss",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxPbFVCUzUtRU1sTGZyUHI3NnpTRUVhTUpJaF9ieWphcjRWN3FKcmpYTVdnczItXzYtUXVTRHpMSlZ5V3IzQy1EV3B1aHpqal9qNmNGSXJEeElsQnlHbktPVVEwcVFYeTNLRE5aekh3U0U4VzU5ZGt4c3lVanRmaUMzT2dYVjB0N1FrQzIxcjN0TjFSX0k?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOV3JGdEFESjRwWllVdm5sdGEtdWFfZTV5T1ZrNXBseWJvbjh1Mlpqbno0bkF0M3FxNENOVVBCX2dING5kQUNmaFY3b0dYRWw2bnlmbGlEV0JtYlNtSWRRUjZtbkhYWWFfVUtOOWV1Y0RjQkozSkdtTjlzLXR2SjBOQmhEVENUT0NRZkU4MGZDbmNnU1hDbzJBUmF6SDZBel9uNWNvd0tOa2tvUWNlVjIyRmIwSjY?oc=5",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxPclJ5a1JUVzNqM2szVE9ybUNsZGZWZ2hVaFNjVkhKeWp5djRobWVmdV8wQ3A4Z2hFWXgzQ1VVWUNYdEdJYWZyZlJKN3luejI2LWhTbEh5aHh4NFR1ODdxeXNFZzN1M2x1U1huNkk2X1VYV25BZFlLNHg4ZzNuWEVKNHY3Sk9PUDZiX1lIbllDUlI?oc=5",
      "https://www.forbes.com/sites/maryroeloffs/2025/12/15/furor-follows-trumps-comments-about-rob-reiners-murder/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/15/police-take-hollywood-director-actor-rob-reiners-son-into-custody?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.878,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.833,
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is reactive and sensational. It does not provide any actionable insights, solutions, or deeper understanding to the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Filmmaker Rob Reiner and his wife, Michele, were found dead in their Los Angeles home on Sunday in what authorities described as an apparent homicide. Their son, Nick Reiner, has been arrested in connection with their deaths. Police are continuing to investigate the case. President Trump has faced criticism for comments linking the deaths to political views.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Rob Reiner and wife found dead son arrested by police",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 15 Dec 2025 05:58:44 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Financial Times",
      "The Guardian",
      "Bloomberg",
      "Forbes",
      "Business Insider",
      "ABC News",
      "CBC News"
    ],
    "domains": [
      "npr.org",
      "ft.com",
      "theguardian.com",
      "news.google.com",
      "forbes.com",
      "businessinsider.com",
      "abcnews.go.com",
      "cbc.ca"
    ],
    "snippets": [
      "Los Angeles Police said Sunday that they had opened a homicide investigation after two bodies were found inside the couple's residence.",
      "LA police investigating killing of ‘Spinal Tap’ director who was praised for his civil rights work",
      "Nick Reiner arrested on suspicion of murder after Rob Reiner and Michele Singer Reiner found dead at their home Rob Reiner and wife Michele found dead in apparent homicide Rob Reiner – a life in pictures Reiner changed Hollywood for ever Nick Reiner has been arrested on suspicion of murder following",
      "Rob Reiner’s Son Nick Arrested Following Stabbing Deaths Bloomberg.com",
      "The iconic actor and director and his wife were found dead in their Brentwood, Los Angeles home on Sunday. Police are interviewing a family member.",
      "Nick Reiner is being held on $4 million bail in connection with the death of his parents, legendary director Rob Reiner and his wife, Michele.",
      "Director Rob Reiner and his wife, Michele Singer, were found stabbed to death in their Los Angeles home on Sunday, and the couple's son, Nick Reiner, is now in custody.",
      "The son of filmmaker Rob Reiner was arrested on homicide charges after the actor-director and his wife were found dead in their Los Angeles home, a police official said Monday."
    ],
    "image_url": "",
    "titles": [
      "Hollywood pays tribute to Rob Reiner; son Nick Reiner arrested",
      "Rob Reiner’s son Nick arrested after deaths of filmmaker and wife",
      "Rob Reiner’s son Nick arrested in connection with deaths of his parents",
      "Rob Reiner’s Son Nick Arrested Following Stabbing Deaths - Bloomberg.com",
      "Rob Reiner’s Son Nick Arrested For Murder After Parents’ Death",
      "Director Rob Reiner's son Nick charged in connection with his parents' death",
      "Rob Reiner's son arrested for murder in stabbing death of famed director, wife",
      "Rob Reiner's son in custody in connection with his parents' killings"
    ],
    "url": "https://www.npr.org/2025/12/15/g-s1-102262/rob-reiner-wife-found-dead-in-los-angeles",
    "alternate_urls": [
      "https://www.ft.com/content/cf9e481e-a316-4b97-a454-044b2cae6716",
      "https://www.theguardian.com/film/2025/dec/15/rob-nick-reiner-arrest",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPUXFHT05DX1NqM19zQU01eDZNcWZCWTBVUzJpY2ZDMk1JS094Y3gxOTVUMHZNcG9zTzB0cnBhakhGdHc3a01WQmFQbG1VakhRQ2l3VVhMWm02N0NJMFVmdV9TZ2dZelNELXp5MzdRNUNIamFsU3lYazdzY3VwYUhqN1hqT0FDa1FQUjNsQ29GODdkSjQ4Z3c1dWhkN2doNVBjZS15WlotSkYyRnc?oc=5",
      "https://www.forbes.com/sites/conormurray/2025/12/15/rob-reiners-son-nick-arrested-for-murder-after-parents-death/",
      "https://www.businessinsider.com/rob-reiner-son-nick-arrested-after-parents-found-dead-2025-12",
      "https://abcnews.go.com/US/2-found-dead-los-angeles-home-owned-director/story?id=128403864",
      "https://www.cbc.ca/news/entertainment/reiners-homicide-investigation-9.7015895?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/15/g-s1-102262/rob-reiner-wife-found-dead-in-los-angeles",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.765,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.804,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Rob Reiner, the acclaimed director and actor, and his wife, Michele Singer Reiner, were found stabbed to death in their Brentwood, Los Angeles home on Sunday. Their son, Nick Reiner, has been arrested on suspicion of murder and is being held on $4 million bail. Police have launched a homicide investigation and are interviewing family members.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Ukraine says underwater drone damaged Russian submarine in port",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:51:31 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times",
      "New York Times",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "ft.com",
      "nytimes.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Ukraine hits Russian submarine in first underwater drone attack Reuters",
      "‘Sub Sea Baby’ critically damages Kilo-class submarine in Novorossiysk port, Ukrainian security official says",
      "As it tries to demonstrate its continuing ability to fight, Ukraine said it had used drones to inflict serious damage on a Russian Kilo-class submarine at a Black Sea port.",
      "Ukraine's internal security agency said the attack damaged and disabled a Russian Kilo-class submarine in the port city of Novorossiysk."
    ],
    "image_url": "",
    "titles": [
      "Ukraine hits Russian submarine in first underwater drone attack - Reuters",
      "Ukraine claims strike on Russian submarine with underwater drones",
      "Ukraine Claims First Strike by Underwater Drone on Russian Submarine",
      "Ukraine says it just carried out the first-ever underwater drone strike on a Russian submarine"
    ],
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPZkJQYW9Ddi1QVGZWWDV4SThjd1JMUmxxLWdrNjk3TWgyTWN4a0RMb3RtN1d0Q1IxSnNFeVF1Q0dsUWFKSFhWTm80TlF6S0J5eGd3ei1xdDdMSTV6aXpvX1JWNUs5NnJoNHBGUEJ5dEtBZTZMTGk4ZldDVW50MXpZdm8zOHE4TnZHV3BmQTkzS3FCRFRXTTNuXzVmcEIxMVNVTUdObm9pYk5HZTBnWUE?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/4a8ba3f9-cfdd-445e-984e-e3d1ff1d845e",
      "https://www.nytimes.com/2025/12/15/world/europe/ukraine-russia-submarine-drones.html",
      "https://www.businessinsider.com/ukraine-carried-out-first-underwater-drone-attack-on-russian-submarine-2025-12"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPZkJQYW9Ddi1QVGZWWDV4SThjd1JMUmxxLWdrNjk3TWgyTWN4a0RMb3RtN1d0Q1IxSnNFeVF1Q0dsUWFKSFhWTm80TlF6S0J5eGd3ei1xdDdMSTV6aXpvX1JWNUs5NnJoNHBGUEJ5dEtBZTZMTGk4ZldDVW50MXpZdm8zOHE4TnZHV3BmQTkzS3FCRFRXTTNuXzVmcEIxMVNVTUdObm9pYk5HZTBnWUE?oc=5",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.952,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukraine's internal security agency reported that it used underwater drones to critically damage and disable a Russian Kilo-class submarine in the port of Novorossiysk. The attack, described as the first of its kind, targeted the vessel with a drone called \"Sub Sea Baby.\" Russian authorities have not commented on the incident.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "José Antonio Kast wins Chile presidential election",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 16:08:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "The president-elect has vowed to tackle crime and tighten immigration policies.",
      "The son of a Nazi party member and an admirer of Pinochet, Kast built his campaign on a promise to expel tens of thousands of undocumented migrants The ultra-conservative former congressman José Antonio Kast has been elected as Chile ’s next president. With more than 99% of polling stations counted,",
      "José Antonio Kast has promised to reverse Chile’s recent surge in violent crime. He also says he will deport undocumented migrants."
    ],
    "image_url": "",
    "titles": [
      "Who is Jose Antonio Kast, Chile’s newly elected far-right leader?",
      "Ultra-conservative José Antonio Kast elected Chile’s next president",
      "José Antonio Kast Elected President of Chile"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/15/who-is-jose-antonio-kast-chiles-newly-elected-far-right-leader?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/15/jose-antonio-kast-wins-election-chile-president",
      "https://www.nytimes.com/2025/12/14/world/americas/chile-election-kast.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/15/who-is-jose-antonio-kast-chiles-newly-elected-far-right-leader?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.883,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.781,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a newly elected leader, which can help readers understand the political landscape in Chile. However, without more context or analysis, it doesn't fully explain the implications or potential impacts of this development.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "José Antonio Kast, an ultra-conservative former congressman, has been elected as Chile’s next president. With over 99% of polling stations counted, Kast has pledged to address rising violent crime and implement stricter immigration policies, including the deportation of undocumented migrants.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Doctors in England plan five day strike over pay dispute",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 16:29:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com",
      "bbc.com"
    ],
    "snippets": [
      "Physicians are seeking a return of salaries to their 2008-2009 levels before they were eroded by inflation.",
      "Five-day strike to start on Wednesday as Wes Streeting’s offer is overwhelmingly rejected by BMA members Resident doctors in England will strike as planned this week after they voted to reject the government’s latest offer to end the long-running pay and jobs dispute. Resident doctors – formerly cal",
      "It comes after ministers made fresh offer amid warning the walkout is risky as NHS battles wave of flu."
    ],
    "image_url": "",
    "titles": [
      "England’s resident doctors to strike for five days",
      "Resident doctors in England vote to go ahead with strike",
      "Resident doctors vote to go ahead with strike in England as hospitals battle flu wave"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/15/englands-resident-doctors-to-strike-for-five-days?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/society/2025/dec/15/resident-doctors-in-england-vote-to-go-ahead-with-strike",
      "https://www.bbc.com/news/articles/c246dnyjylqo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/15/englands-resident-doctors-to-strike-for-five-days?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.892,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.78,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about a current issue, but does not provide any actionable insights or report on solutions. It offers basic awareness, but minimal depth or insight.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Resident doctors in England will begin a five-day strike on Wednesday after rejecting the government's latest offer to resolve a pay and jobs dispute. The British Medical Association reported that its members overwhelmingly voted against the proposal. Physicians are seeking a return to pre-2008-2009 salary levels, citing inflation. The strike comes as the NHS faces increased pressure from a surge in flu cases.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Jets fire Steve Wilks and name Chris Harris new defensive leader",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 14:34:45 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The New York Jets have fired defensive coordinator Steve Wilks and have turned playcalling over to interim DC Chris Harris, who has served as the defensive backs coach and passing game coordinator.",
      "Change is in store for New York after it surrendered 48 points in Sunday's loss",
      "The news of Wilks’ dismissal comes a day after the Jets lost 48-20 to the Jacksonville Jaguars. Chris Harris will take over as the team’s defensive co-ordinator."
    ],
    "image_url": "",
    "titles": [
      "Jets fire DC Wilks after blowout loss to Jaguars",
      "Jets fire DC Steve Wilks: Aaron Glenn, Chris Harris to lead defense after season-worst effort against Jaguars",
      "Jets fire defensive co-ordinator Steve Wilks after blowout loss"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47314072/jets-fire-defensive-coordinator-steve-wilks-loss-jags",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/jets-fire-dc-steve-wilks-aaron-glenn/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47314072/jets-fire-defensive-coordinator-steve-wilks-loss-jags",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.772,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The New York Jets have fired defensive coordinator Steve Wilks following a 48-20 loss to the Jacksonville Jaguars. Chris Harris, previously the defensive backs coach and passing game coordinator, has been named interim defensive coordinator and will assume playcalling duties.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Narges Mohammadi is arrested and taken to hospital in Iran",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:11:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Narges Mohammadi told her family in a phone call that she was beaten on the head and neck by plainclothes agents in Mashhad last week.",
      "Iranian Nobel laureate hospitalised twice after 'violent arrest', say family Reuters",
      "Narges Mohammadi and several other Iranian activists were detained last Friday. She has been beaten, requiring emergency medical treatment, and accused of working with Israel, her family said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5810/live/0947fa70-d9dc-11f0-b67b-690eb873de1b.jpg",
    "titles": [
      "Iranian Nobel laureate taken to hospital after 'violent arrest', family says",
      "Iranian Nobel laureate hospitalised twice after 'violent arrest', say family - Reuters",
      "Iranian Authorities Assaulted Detained Nobel Laureate, Family Says"
    ],
    "url": "https://www.bbc.com/news/articles/c2dz15556l1o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxPSkl0VkRVVDJUcHBfQlJrUHZ1UC1FY3FUVDZVUGowdWVxTUNtRk84cnRjX0ZRMFNTYTNld0gxV3BZVVVudkxJcnNIRWxOOEhJUWhYNkU0NDlMZnduTS1aMWNJUG5QVkE1NnlhdEd0X2V1dmUyYzA5QWJoSkRBdm55OGdiUC1pRFFzQ014M0t0UkxJbmVFWG53bG5fRzBRbTJnOHRqc21ObFVCa1VhY2JsWk5vbmZ4aFFOWXZBZ3FkTTZGUDVtYlE?oc=5",
      "https://www.nytimes.com/2025/12/15/world/middleeast/narge-mohammadi-iran-beating.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c2dz15556l1o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.935,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.766,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story raises awareness about the situation of the Nobel laureate and human rights in Iran, but it doesn't provide much depth or insight into the broader context or implications. It also lacks actionable insights or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Narges Mohammadi, an Iranian Nobel laureate, was detained with other activists in Mashhad last week. According to her family, she was beaten on the head and neck by plainclothes agents, accused of working with Israel, and required emergency medical treatment, being hospitalized twice following her arrest.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "United States promises to help protect Ukraine in conflict",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 17:36:27 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Peace deal gives Ukraine security guarantees similar to Article 5, official says Reuters",
      "U.S. agrees to provide security guarantees for Ukraine in latest peace talks, officials say The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Peace deal gives Ukraine security guarantees similar to Article 5, official says - Reuters",
      "U.S. agrees to provide security guarantees for Ukraine in latest peace talks, officials say - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPeWdGSzB0cGxkS2YxUlB3RU13VThmOHpsNzMyRFhzMnYzaHZldS1sa0NwRHQybzNnamNsa2Z5R1FXTkVYS1Bka2JyMjRWQ0k1RXd6TUZ2Wk5IdnVDemRnZUpUWWNYZzRoT2dnOTViN1RXSGRwTThMOFJIUmNMamxiVkY4MlpRdnQ3eEVTZEo4b0VPVFBlZ21jR2Z2czVKRjNLTm1SUzhuTTdPemVCUW5hZmlkV0pPRXlNQUl2QkFJN0tsWTA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPT0dxTV9oQXhMTVpSa1hRc3BRUmhwVEFudzBQdjY3dXZselNSR2FMeGZMZzcyTWVGbGJPbkkzQldJUHNjWmNsNzAzZEdHcC03c21leTl1QnJwdzdMTm82eHJkU3VPNGpDYUtmNlF6Z1dYOGE5ejVPLTNBbG1ScjB0aW03clJzLWhfU3hJ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPeWdGSzB0cGxkS2YxUlB3RU13VThmOHpsNzMyRFhzMnYzaHZldS1sa0NwRHQybzNnamNsa2Z5R1FXTkVYS1Bka2JyMjRWQ0k1RXd6TUZ2Wk5IdnVDemRnZUpUWWNYZzRoT2dnOTViN1RXSGRwTThMOFJIUmNMamxiVkY4MlpRdnQ3eEVTZEo4b0VPVFBlZ21jR2Z2czVKRjNLTm1SUzhuTTdPemVCUW5hZmlkV0pPRXlNQUl2QkFJN0tsWTA?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.92,
      "consensus": 0.571,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.763,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a peace deal, which is a solution to a problem. It also provides the reader with a deeper understanding of the situation in Ukraine.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The United States has agreed to provide Ukraine with security guarantees as part of recent peace talks, according to officials. These guarantees are described as similar to NATO's Article 5, which commits members to mutual defense. The agreement aims to enhance Ukraine's security amid ongoing conflict.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Police keep looking for Brown University shooter after release",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 10:30:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CBC News",
      "Global News",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Person of interest in Brown University mass shooting is being released, officials say Axios",
      "2 killed, 9 injured in Brown University shooting Axios",
      "Rhode Island officials renewed their search Monday for the gunman who killed two Brown University students and wounded nine others, a day after they released a person of interest and determined the evidence pointed in a different direction.",
      "Authorities said they lacked video of the shooter because Brown University’s engineering building doesn’t have many cameras.",
      "Authorities say they will release person of interest detained in Brown University shooting AP News"
    ],
    "image_url": "",
    "titles": [
      "Person of interest in Brown University mass shooting is being released, officials say - Axios",
      "2 killed, 9 injured in Brown University shooting - Axios",
      "Authorities renew search for Brown University shooter after releasing person of interest",
      "Manhunt continues for Brown University shooter as person of interest released",
      "Authorities say they will release person of interest detained in Brown University shooting - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOby1oYzdkQVhKdUdRcFZIS2owLWNZVjVkSmMxQmlzd0xBMC1NUWkyU0lrQ2JnSmNTeEV6SUhYa2xybGlWWWVVX0ZrVG9EYzEwVS1FVEU2SjN5aXkwTURvU3k1SWVEQ08wcno0ZDJSMXpVLXRhdlFRb3FNUE1maklVcmRIYjdza0RlZlFtdEdpSQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiakFVX3lxTE5KQ1RySzZFVHRwQzg4RWZOYWFlSjBJblN0NnFWUGR0eUtYWWdmZjNqdDB3ZWM4Z0xtbWxnT2g5b1lJR2dVbmptUS1zdFR1LXJoZHczZHB6d05BODhNendBWlJzd1JGYjNzOEE?oc=5",
      "https://www.cbc.ca/news/world/brown-shooting-monday-search-9.7015784?cmp=rss",
      "https://globalnews.ca/news/11578454/brown-university-shooter-person-of-interest-released-manhunt/",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxPOUUxZF9Gb2JXc3ZKWkZRUlZScGVxbWJ2c0ZKek1qM0s3cFdiUWY5ejVvaEpWYlBPcU9sd1R1MHA3VmZHbExQNzJYUkFGd2hDdFoyaUFicVV4NGRGMEdBU2k1OGdESHEzWW5fMG1feE9RYUZoMmo3cHZJa08wdVAyYi0tRGRGcWVDbW5Qb2RkUlVYYlVabkRnc0xlWWJUSXg2Y2c?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOby1oYzdkQVhKdUdRcFZIS2owLWNZVjVkSmMxQmlzd0xBMC1NUWkyU0lrQ2JnSmNTeEV6SUhYa2xybGlWWWVVX0ZrVG9EYzEwVS1FVEU2SjN5aXkwTURvU3k1SWVEQ08wcno0ZDJSMXpVLXRhdlFRb3FNUE1maklVcmRIYjdza0RlZlFtdEdpSQ?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.755,
      "consensus": 0.888,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.752,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the development in a criminal case, but it doesn't offer much in terms of actionable insights, deeper understanding, or solutions to the broader issue of gun violence or campus safety.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Authorities in Rhode Island have released a person of interest in the Brown University shooting after determining evidence pointed elsewhere. The shooting resulted in two student deaths and nine injuries. Officials have renewed their search for the gunman, noting a lack of surveillance footage from the scene. The investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Police look into death of Rob Reiner as possible crime",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 15 Dec 2025 11:14:30 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "Bloomberg"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Officials are investigating the death of the Hollywood director as a homicide.",
      "Trump says Rob Reiner's death caused by \"Trump derangement syndrome\" Axios",
      "Trump Appears to Mock Rob Reiner Death In Social Media Post Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump says Rob Reiner had 'Trump Derangement Syndrome' in post on his death",
      "Trump says Rob Reiner's death caused by \"Trump derangement syndrome\" - Axios",
      "Trump Appears to Mock Rob Reiner Death In Social Media Post - Bloomberg.com"
    ],
    "url": "https://www.npr.org/2025/12/15/nx-s1-5644927/trump-rob-reiner-death-truth-social",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifEFVX3lxTFBjYmpZYVZuSmVScldUTEh5MFNvRXhVblByWlJyU0pkSk9Jamg4azN0eFhRNVdSSUxzMDhTaGRvalh5LXVKcXZueDFZRWh6eEloMThCb1dRN25EX3RxVXNtVTBKcld4ZlpNcDV3Nnh5VFdRWWpCRlJOSkRIQ08?oc=5",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxON01yRnJJdzU2eVBFa0N2U3BFM1RxTTZCNEZWMWpRc0lYRmZsTU1qa1Q1ZlE3YVJoX2tmZ29LVlZXVGowU2hQWldzX3Zxc2VlX0dtSl9rVDFRemRkOGFGbWdaOWotR0lTYzNIQXAxS09yWDR1NDRtaDdJUFN3bUxCWG12bzJzeG81LXFJcTdWeFBUZnJPU1kwR01ZZnEwUGtSVEpzcUh2TGRmaEdqbEQw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/15/nx-s1-5644927/trump-rob-reiner-death-truth-social",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.886,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Officials are investigating the death of Hollywood director Rob Reiner as a homicide. Former President Donald Trump commented on social media, suggesting Reiner's death was caused by \"Trump derangement syndrome\" and appeared to mock Reiner's passing. The investigation into the circumstances of Reiner's death is ongoing.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Luminar files for bankruptcy after year of business troubles",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 19:22:28 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Volvo Supplier Luminar Files Bankruptcy After Contract Dispute Bloomberg.com",
      "Luminar, the lidar manufacturer that rode a wave of self-driving car hype to land deals with major automakers like Volvo and Mercedes-Benz, filed for bankruptcy Monday. The company has been mired in a legal fight with its founder and former CEO, Austin Russell, who was ousted earlier this year follo",
      "The filing marks the end of a tumultuous year full of layoffs, executive departures, and piling debts."
    ],
    "image_url": "",
    "titles": [
      "Volvo Supplier Luminar Files Bankruptcy After Contract Dispute - Bloomberg.com",
      "Lidar-maker Luminar files for bankruptcy"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNMDJZTXhrZFlGaVdGX1BaODE2UDJMV0I3bFcxRXdkdjBmOXg5b05KUndKRXlqMDhCMmx6TVpQZy00Sjh6S1d4WUhQRDlEOFBoTWJQWEFUenF3TkVkV1g3VmFlYVdDZHZROUJkV2hkRXJiSGxKXzZ4MGxSUzNMbEdNN3FHNllLNVZZN1FkNlFvNUpSM2VzSElCY2hBZ09xVHRpZUNxbERtcU5MZm1wMUJ1QTg2bw?oc=5",
    "alternate_urls": [
      "https://www.theverge.com/news/844755/luminar-lidar-chapter-11-bankruptcy",
      "https://techcrunch.com/2025/12/15/lidar-maker-luminar-files-for-bankruptcy/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNMDJZTXhrZFlGaVdGX1BaODE2UDJMV0I3bFcxRXdkdjBmOXg5b05KUndKRXlqMDhCMmx6TVpQZy00Sjh6S1d4WUhQRDlEOFBoTWJQWEFUenF3TkVkV1g3VmFlYVdDZHZROUJkV2hkRXJiSGxKXzZ4MGxSUzNMbEdNN3FHNllLNVZZN1FkNlFvNUpSM2VzSElCY2hBZ09xVHRpZUNxbERtcU5MZm1wMUJ1QTg2bw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.966,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.746,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Luminar, a lidar technology supplier known for deals with automakers such as Volvo and Mercedes-Benz, filed for bankruptcy on Monday. The filing follows a year of layoffs, executive departures, mounting debts, and a contract dispute involving founder and former CEO Austin Russell, who was ousted earlier this year.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Trump asks big tech companies for help with AI workers",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 16:04:23 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Verge"
    ],
    "domains": [
      "news.google.com",
      "theverge.com"
    ],
    "snippets": [
      "Trump turns to Big Tech for AI government workforce Axios",
      "President Donald Trump will recruit workers from Amazon, Apple, Google, Meta, Microsoft, and other tech giants to form the US Tech Force, a new program that aims to \"modernize the federal government,\" according to an announcement on Monday. Under the new program, Trump plans to hire around 1,000 tec"
    ],
    "image_url": "",
    "titles": [
      "Trump turns to Big Tech for AI government workforce - Axios",
      "Trump is recruiting Big Tech workers for the government"
    ],
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5tQi1YNkg4Y3dFbFp3RkZSUUtVVnc4REo3aERyY2pWekh0OEZ3OWtIUERJT1ZRTHNER0NLczFaZUJ2S0xuZFJmd1FpNnVXUklVdkZrX2xHbFBGb2txV2pQeHE5UXpjdkpPMGRtUjVVZGVUMENUVXdVUFhLQQ?oc=5",
    "alternate_urls": [
      "https://www.theverge.com/news/844804/trump-tech-force-usds-apple-google-microsoft"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5tQi1YNkg4Y3dFbFp3RkZSUUtVVnc4REo3aERyY2pWekh0OEZ3OWtIUERJT1ZRTHNER0NLczFaZUJ2S0xuZFJmd1FpNnVXUklVdkZrX2xHbFBGb2txV2pQeHE5UXpjdkpPMGRtUjVVZGVUMENUVXdVUFhLQQ?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.745,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about an interesting intersection of politics, technology, and workforce development. It provides useful context about the role of AI in government, though it could be more constructive with additional details or analysis of the potential impacts or challenges.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Trump turns to Big Tech for AI government workforce Axios",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Jimmy Lai found guilty of colluding with foreign forces in Hong Kong",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-15T03:05:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "CNBC",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "cnbc.com",
      "washingtonpost.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Pro-democracy media tycoon Jimmy Lai was found guilty on charges of colluding with foreign forces and sedition under a Beijing-imposed national security law. The conviction means he could spend life in prison.",
      "Hong Kong convicts media tycoon Jimmy Lai in national security trial Axios",
      "The 78-year-old was charged under Hong Kong's controversial national security law, enacted by Beijing in 2020.",
      "The landmark case exemplifies the way Beijing, through Hong Kong’s national security law, has swept away any last remaining press freedoms and judicial independence in the city.",
      "Jimmy Lai spent decades criticizing China’s rulers. He faces up to life in prison after a court found him guilty of national security crimes.",
      "This blog is now closed Jimmy Lai verdict: Hong Kong pro-democracy figure convicted of national security offences The rise and fall of Jimmy Lai, whose trajectory mirrored that of Hong Kong itself The three high court judges have entered the courtroom and taken their seats. The hearing is due to beg",
      "Former Hong Kong pro-democracy media mogul Jimmy Lai convicted in landmark national security trial AP News"
    ],
    "image_url": "",
    "titles": [
      "Hong Kong court finds pro-democracy tycoon Jimmy Lai guilty",
      "Hong Kong convicts media tycoon Jimmy Lai in national security trial - Axios",
      "Hong Kong court finds pro-democracy activist Jimmy Lai guilty of sedition and collusion with foreign forces",
      "Hong Kong court convicts pro-democracy newspaper founder Jimmy Lai",
      "Hong Kong Media Tycoon Jimmy Lai’s Conviction Was Years in the Making",
      "Hong Kong media tycoon convicted – as it happened",
      "Former Hong Kong pro-democracy media mogul Jimmy Lai convicted in landmark national security trial - AP News"
    ],
    "url": "https://www.dw.com/en/hong-kong-court-finds-pro-democracy-tycoon-jimmy-lai-guilty/a-75155293?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxOVnhpTGt0Um1uWTFHczFSRnlZWU5Ia1F6Ym5HWDA4V1lQTHFOVEo5em9rVWhoTkREUnNKMFdNVWhuZUZVLXlzY0Nfaml2OVFLRlVYWFoyd21mT0szdkhOS0JzUEhrR2FVaHlid19OVE1vTXRpQzFPcHpTa0dUbTNJaDQya3JIT1BqRUhxSm1UTTJmOU1tWFFtWA?oc=5",
      "https://www.cnbc.com/2025/12/15/hong-kong-court-finds-pro-democracy-activist-jimmy-lai-guilty-of-collusion-with-foreign-forces.html",
      "https://www.washingtonpost.com/world/2025/12/14/hong-kong-jimmy-lai-apple-china-verdict/",
      "https://www.nytimes.com/2025/12/15/world/asia/hong-kong-jimmy-lai-tycoon-china.html",
      "https://www.theguardian.com/world/live/2025/dec/15/jimmy-lai-verdict-hong-kong-court-national-security-charges-live",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVk44bWFzZkxad1BqLUh5TTd6RzdMR0lIanBoZW9GWGgyOTc5NUtQTVFfNG9jU3FlU09aTjF1R1B0a2piYnN5eWphUWNQSnhlbG9aeEpFR2F4ODc3R0dHeHViTTFoZGt5ZlVGdklxMThLVVU3RE9kOXYwX1RyYkdsSTNlNUwzS2ZoWGdRbE1kaTNiVGRmcklaVzY0T1hSZ1ZYREVVZEdLZVI?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/hong-kong-court-finds-pro-democracy-tycoon-jimmy-lai-guilty/a-75155293?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.614,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former Hong Kong pro-democracy media tycoon Jimmy Lai was found guilty on charges of colluding with foreign forces and sedition under the national security law imposed by Beijing in 2020. Lai, age 78, faces a possible life sentence. The conviction marks a significant application of the law against press freedom advocates in Hong Kong.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "JetBlue plane avoids crash with US Air Force tanker in air",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:58:08 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "JetBlue flight averts mid-air collision with US Air Force jet Reuters",
      "JetBlue pilot calls incident ‘outrageous’ and says US military refueling tanker didn’t have transponder turned on A JetBlue flight from the small Caribbean nation of Curaçao halted its ascent to avoid colliding with a US air force refueling tanker on Friday, and the pilot blamed the military plane f"
    ],
    "image_url": "",
    "titles": [
      "JetBlue flight averts mid-air collision with US Air Force jet - Reuters",
      "Pilot narrowly avoids ‘midair collision’ with US air force plane near Venezuela"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQcTdPTXhFS3dXdnV4OHQxazFCRFdkWUwtOTNPMV96RTB1ZFJqUjJPc1J6aF9YcXVDRW1ITVZPdFNTeUpLb0pvWXdxNW5kRWRHSUY5bmZKenZaOXNtbkxUYjRHQlp5YklETUthMTF2VWxJSkRQcHdBTVVTTlBxZURmVWIybmVZN1h6LWV2cThUSV9Db1A5MUFuZTVVUTEyVjZrckxOUy1DRFVma19rNXN1dEx3?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/dec/14/jetblue-pilot-avoids-midair-collision-air-force-venezuela"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQcTdPTXhFS3dXdnV4OHQxazFCRFdkWUwtOTNPMV96RTB1ZFJqUjJPc1J6aF9YcXVDRW1ITVZPdFNTeUpLb0pvWXdxNW5kRWRHSUY5bmZKenZaOXNtbkxUYjRHQlp5YklETUthMTF2VWxJSkRQcHdBTVVTTlBxZURmVWIybmVZN1h6LWV2cThUSV9Db1A5MUFuZTVVUTEyVjZrckxOUy1DRFVma19rNXN1dEx3?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about a near-miss aviation incident, potentially prompting readers to question aviation safety standards. However, it doesn't provide much depth or insight into the causes of such incidents or potential solutions to prevent them in the future.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A JetBlue flight from Curaçao narrowly avoided a mid-air collision with a US Air Force refueling tanker on Friday. The JetBlue pilot reported that the military aircraft did not have its transponder activated, prompting the commercial plane to halt its ascent. No injuries were reported, and the incident is under investigation.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US asks tourists from 42 countries for social media details",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:23:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "US Travel Association responds to a government notice requiring tourists from 42 countries to submit social media data.",
      "US social media requirements for foreign visitors could have 'chilling effect' on travel, industry group says Reuters"
    ],
    "image_url": "",
    "titles": [
      "US social media rules for tourists could have ‘chilling effect’ on travel",
      "US social media requirements for foreign visitors could have 'chilling effect' on travel, industry group says - Reuters"
    ],
    "url": "https://www.aljazeera.com/economy/2025/12/15/us-social-media-rules-for-tourists-could-have-chilling-effect-on-travel?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPWm9RMXVIMmhKWmRPQzFJbFFlM0JYWUMzS0FrWUJmdzRickh1dFZLSVlVc0VjdnQtaHhpTEY2T09sR2dvUXRacF9GODNwVmU0QkRUVHBtQmswNVdmMEYzM182NDVvaVRPb2llVE9zZ1FEU3NtV2VhU2g0NktJMm1Ocll0YmUweUtZX2s1UHc2aGotWUg3Yl9XakNRNVFHTVRFYThSeXpvMzJxaTUyWGVZWjVDY2JQeHJEcWFXMjVHdGlsRUpMX2dHWi1xbW5aNUJiVzJMNDJvdVFkMXNFMWV5RzcwQk8tQ0FhejI4?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/12/15/us-social-media-rules-for-tourists-could-have-chilling-effect-on-travel?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about new US social media rules for tourists and their potential impact on travel. It increases clarity around this new system, but doesn't report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US government has introduced a requirement for tourists from 42 countries to provide social media information as part of their entry process. The US Travel Association has expressed concern that this policy could discourage international visitors and negatively impact the travel industry. The measure is currently in effect, and industry groups are urging officials to reconsider its implications.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nebraska quarterback Dylan Raiola plans to transfer schools",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 14:34:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Nebraska QB Dylan Raiola, son of former NFL OL Dominic Raiola, plans to enter the transfer portal, sources told ESPN's Pete Thamel.",
      "Raiola will join an intriguing QB portal class for 2026 with two years of eligibility remaining"
    ],
    "image_url": "",
    "titles": [
      "Sources: Nebraska QB Raiola to enter portal",
      "Nebraska QB Dylan Raiola to enter transfer portal: Oregon a potential suitor for former 5-star recruit"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47315467/nebraska-qb-dylan-raiola-enter-transfer-portal",
    "alternate_urls": [
      "https://www.cbssports.com/college-football/news/nebraska-qb-dylan-raiola-transfer-portal-oregon-5-star-recruit/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47315467/nebraska-qb-dylan-raiola-enter-transfer-portal",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.711,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nebraska quarterback Dylan Raiola, son of former NFL offensive lineman Dominic Raiola, plans to enter the NCAA transfer portal, according to ESPN. Raiola will be part of the 2026 quarterback transfer class and has two years of college eligibility left.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Ohio State has four players on top football team list",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 14:34:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Associated Press"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Four players from Ohio State are among 10 first-team picks from the Big Ten on the Associated Press All-America team released Monday.",
      "Big Ten puts 10 on AP All-America first team, led by 4 from Ohio State and Hoosier star Mendoza AP News"
    ],
    "image_url": "",
    "titles": [
      "Big Ten boasts 10 first-team AP All-Americans",
      "Big Ten puts 10 on AP All-America first team, led by 4 from Ohio State and Hoosier star Mendoza - AP News"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47314562/big-ten-puts-10-players-ap-all-america-first-team",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxPZ005VWJ3TjBVVXprSTlOVlFMN2RnOWU3d1ZLVU1LYlJ5NXhXbmw0TmlxTDNxUkxwalhINU4zZmlKSFVhSXliWVM5STZzTkhsQ1E0cHZKTHBQQUFQSjhEcHVpZ0lzekREdkRmd3BCX21FUjZYaWxGNDM4bXlEam9tY2JBYzJMNGpIazNlUmRCZzZhRGZp?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47314562/big-ten-puts-10-players-ap-all-america-first-team",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.75
    },
    "score": 0.708,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Associated Press released its All-America football team on Monday, naming 10 first-team selections from the Big Ten Conference. Ohio State led with four players on the list. Indiana’s Mendoza was also recognized as a first-team pick. The selections highlight the strong performance of Big Ten athletes in the 2025 season.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Four people arrested for planning bomb attacks in California",
    "domain": "general",
    "source_domain": "latimes.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 18:58:45 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times",
      "CBC News"
    ],
    "domains": [
      "latimes.com",
      "cbc.ca"
    ],
    "snippets": [
      "Federal officials arrested four people described as members of an anti-government group that had planned to bomb several companies in an 'organized, sophisticated and extremely violent' attack.",
      "Federal authorities on Monday announced the arrests of four alleged members of an extremist group who are suspected of planning co-ordinated bombing attacks on New Year’s Eve across Southern California."
    ],
    "image_url": "",
    "titles": [
      "Feds say they foiled New Year's Eve terror plot in L.A., Southern California",
      "4 charged with plotting 'multiple' New Year’s Eve bombing attacks in Southern California"
    ],
    "url": "https://www.latimes.com/california/story/2025-12-15/new-years-eve-terror-plot-charges-southern-california",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/new-years-eve-attack-plot-california-9.7016350?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://www.latimes.com/california/story/2025-12-15/new-years-eve-terror-plot-charges-southern-california",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.706,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a foiled terror plot, but it doesn't offer any deeper insights, solutions or empowering knowledge. It's primarily reactive and sensational.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Federal authorities announced the arrest of four alleged members of an anti-government extremist group accused of planning coordinated bombing attacks on several companies in Southern California on New Year’s Eve. Officials described the plot as organized, sophisticated, and extremely violent. The suspects are now in federal custody.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Ukraine hits Russian oil site with drone for third time",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 13:53:07 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Ukraine strikes Russian oil infrastructure in Caspian Sea for third time, source says Reuters",
      "Ukraine has used long-range drones to attack Russian oil platforms as it expands its strikes on the country's energy sector."
    ],
    "image_url": "",
    "titles": [
      "Ukraine strikes Russian oil infrastructure in Caspian Sea for third time, source says - Reuters",
      "Ukrainian drones struck a Russian oil platform in the Caspian Sea for the third time in a matter of days, security source says"
    ],
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPQUlCVUdIVW1rRF81cUNyUGMyUk83ZFNHZGlJOVhtQWZkYnQ4MDhqVEY1ZzhKTy0tei1HTXdwRW15VkhETkFkYmIxWnNtbmF5VDhPVWJQZzRVeGt2LXpEbURWMWhKWmF3cU9DT3dKZ2tyQWdrRV9Cd1ozUnZqaXhhN3J2Mi0xOUhoLWhuWmlTbDl3X0VJeGFwbkQxejdQYXg1RFB6U1BhMVFKbkRPWnZaV1dKbWxUaU9wQ0tZaHFUSWJtZWwyQUZvNA?oc=5",
    "alternate_urls": [
      "https://www.businessinsider.com/ukrainian-drones-struck-russian-oil-platforms-at-sea-source-2025-12"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPQUlCVUdIVW1rRF81cUNyUGMyUk83ZFNHZGlJOVhtQWZkYnQ4MDhqVEY1ZzhKTy0tei1HTXdwRW15VkhETkFkYmIxWnNtbmF5VDhPVWJQZzRVeGt2LXpEbURWMWhKWmF3cU9DT3dKZ2tyQWdrRV9Cd1ozUnZqaXhhN3J2Mi0xOUhoLWhuWmlTbDl3X0VJeGFwbkQxejdQYXg1RFB6U1BhMVFKbkRPWnZaV1dKbWxUaU9wQ0tZaHFUSWJtZWwyQUZvNA?oc=5",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.829,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.705,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides basic awareness about a current conflict, it lacks depth or insight that would help readers understand the broader context or implications. It's largely reactive, reporting on an event without analyzing its causes or potential effects.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukraine has carried out a third drone strike on Russian oil infrastructure in the Caspian Sea, according to sources cited by Reuters. The attack is part of Ukraine's ongoing campaign to target Russia's energy sector using long-range drones. No further details about damage or casualties have been reported.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Some college football players will not play in 2025 bowl games",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 12:45:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "With bowl season underway, our college football experts provide their MVP picks for each bowl game.",
      "Notable College Football Players Sitting Out of 2025 Bowl Games Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "College football bowl season: MVPs for the first two bowl games of the season",
      "Notable College Football Players Sitting Out of 2025 Bowl Games - Bleacher Report"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47296811/2025-college-football-bowl-game-mvp-picks-36-matchups",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPek9VMTFGLXAxb1U0eGlmdE1fNzE4eFl0VGFaX3JVUS1kdG8yLThUc0tCWm55TzFhQ19kNmZJX0VoVDA4TUFtNVRvdVc3RGFwVUlhQVV3al80cDA0R3NWVUNVeUtvbTg0SXhIMVBzWUhYYUV5OWJla3JJdjFPdjZMOTBFdW1GbzZoYWpfM3hVMklTMXdYd243c29TWHpEMEJENEJoaHdvOFU?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47296811/2025-college-football-bowl-game-mvp-picks-36-matchups",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.691,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several college football players have chosen to sit out the 2025 bowl games, as reported by Bleacher Report. Meanwhile, experts have released their MVP predictions for each matchup as bowl season begins. The decisions by players to skip the games are impacting team lineups and could influence game outcomes.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US offers security deal to Ukraine but land issues remain",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:39:09 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "US Offers Security Deal in Ukraine Talks But Territory Still Key Bloomberg.com",
      "Ukraine and US to Resume Peace-Plan Talks, Focus on Security Bloomberg.com",
      "US negotiators offered more substantial security guarantees to Kyiv as part of President Donald Trump’s renewed push to end the Russia-Ukraine war, but the effort still appeared part of a bid to pressure President Volodymyr Zelenskiy on territory."
    ],
    "image_url": "",
    "titles": [
      "US Offers Security Deal in Ukraine Talks But Territory Still Key - Bloomberg.com",
      "Ukraine and US to Resume Peace-Plan Talks, Focus on Security - Bloomberg.com",
      "US Offers Security Deal in Ukraine Talks But Territory Still Key"
    ],
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxORmJsUGFLNEMzRGl2QmpQSXVFZWliRE5FLUZCTmFCQ2hlTXRCOGFKUXJsTXdEaVQ1emJkSDV4am1lMFFtZVVOV0NMc3pfTkJ1Nmxhd3BEN0F3TXJ5dnppYW1Idm1qVHZVcV9SYWFtOHdoOWJxaEVjZ1p0UzJNaFRoRXJxTmxTYjEzMGc5SVNiNDVTQUJLSEZjejRxNFNQUlh6b2dnUjhtWVJFUVJ6VEJFNlRud25JQQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQWkxraEtUSWNKQ3ROajN5bzJrX0l6M3lfbUVoN2w1ajkweHI0a0hVNGVSdllXanUtc0pzNVlNb2s4N0dwR255OTlxT0R5a2JmbU9ReDh3aXdZbTJLaVZNc1gwbkVBTkh2UHdwdUNYbVl4emdNZjQxdXhlMkFRNmJOcnBUbWdnUDdzb18xejNYX0tsYV9YbUF4OEJQSnB2M01ZRExzWEJUQUVreGhJNjJWZDctSEctdw?oc=5",
      "https://financialpost.com/pmn/business-pmn/us-offers-security-deal-in-ukraine-talks-but-territory-still-key"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxORmJsUGFLNEMzRGl2QmpQSXVFZWliRE5FLUZCTmFCQ2hlTXRCOGFKUXJsTXdEaVQ1emJkSDV4am1lMFFtZVVOV0NMc3pfTkJ1Nmxhd3BEN0F3TXJ5dnppYW1Idm1qVHZVcV9SYWFtOHdoOWJxaEVjZ1p0UzJNaFRoRXJxTmxTYjEzMGc5SVNiNDVTQUJLSEZjejRxNFNQUlh6b2dnUjhtWVJFUVJ6VEJFNlRud25JQQ?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.685,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.10; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "US Offers Security Deal in Ukraine Talks But Territory Still Key Bloomberg.com",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Manchester United coach names team for game against Bournemouth",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 19:40:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "sports.yahoo.com",
      "theguardian.com"
    ],
    "snippets": [
      "Cunha leads the line in Monday night clashRuben Amorim names Manchester United starting lineup for Premier League match vs BournemouthManchester United head coach Ruben Amorim has officially named his...",
      "Updates from the 8pm GMT kick-off at Old Trafford Premier League’s top scorers | Standings | Email Niall In his weekly newsletter, Jonathan Wilson takes a look at Thomas Frank’s fragile tenure at Tottenham. Remember Sergio Reguilón? The former United loanee has signed for Inter Miami, more than six"
    ],
    "image_url": "",
    "titles": [
      "Ruben Amorim names Manchester United starting lineup for Premier League match vs Bournemouth",
      "Manchester United v Bournemouth: Premier League updates – live"
    ],
    "url": "https://sports.yahoo.com/articles/ruben-amorim-names-manchester-united-194000981.html",
    "alternate_urls": [
      "https://www.theguardian.com/football/live/2025/dec/15/manchester-united-v-bournemouth-premier-league-updates-live"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/ruben-amorim-names-manchester-united-194000981.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.684,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: start; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Manchester United head coach Ruben Amorim has announced the team's starting lineup for their Premier League match against Bournemouth, which kicked off at 8pm GMT at Old Trafford. In other football news, former Manchester United loanee Sergio Reguilón has signed with Inter Miami.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Scientists find there may be two trillion galaxies in space",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 15 Dec 2025 14:55:31 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "nasa.gov"
    ],
    "snippets": [
      "Our universe is filled with galaxies, in all directions as far as our instruments can see. Some researchers estimate that there are as many as 2 trillion galaxies in the observable universe. At first glance, these galaxies might appear to be randomly scattered across space, but they're not. Careful",
      "Lee esta nota de prensa en español aquí. Our universe is filled with galaxies, in all directions as far as our instruments can see. Some researchers estimate that there are as many as two trillion galaxies in the observable universe. At first glance, these galaxies might appear to be randomly scatte"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-roman-telescope.jpg",
    "titles": [
      "NASA's Roman telescope will observe thousands of newfound cosmic voids",
      "NASA’s Roman Telescope Will Observe Thousands of Newfound Cosmic Voids"
    ],
    "url": "https://phys.org/news/2025-12-nasa-roman-telescope-thousands-newfound.html",
    "alternate_urls": [
      "https://www.nasa.gov/missions/roman-space-telescope/nasas-roman-telescope-will-observe-thousands-of-newfound-cosmic-voids/"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2025-12-nasa-roman-telescope-thousands-newfound.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.683,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Researchers estimate there are up to two trillion galaxies in the observable universe. Although galaxies seem randomly scattered, studies show they are distributed in specific patterns across space. This large-scale structure helps scientists understand the formation and evolution of the universe.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Cameron Menzies says sorry after hitting table at darts match",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 19:25:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "Cameron Menzies apologises after angrily punching a drinks table after his first-round loss to Charlie Manby at the PDC World Championship.",
      "Cameron Menzies was taken to hospital after punching a table in frustration, which he later apologised for, following his 3-2 defeat to Charlie Manby in the first round of the World Darts Championship."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/89b1/live/064099c0-d9cf-11f0-aae2-2191c0e48a3b.jpg",
    "titles": [
      "Darts star Menzies apologies for punching table after five-set defeat",
      "Menzies apologises for repeatedly punching table after loss",
      "Menzies apologises for punching table after World Championship exit"
    ],
    "url": "https://www.bbc.com/sport/darts/articles/c62vd6n9y5po?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/darts/news/12040/13483663/cameron-menzies-apologises-for-punching-table-after-world-darts-championship-exit-to-20-year-old-debutant-charlie-manby"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/darts/articles/c62vd6n9y5po?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Cameron Menzies apologized after punching a drinks table in frustration following his 3-2 first-round loss to Charlie Manby at the PDC World Darts Championship. Menzies was taken to hospital after the incident.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Green Bay Packers player Micah Parsons out with knee injury",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 15 Dec 2025 18:36:20 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Parsons: 'I may be sidelined, but I am not defeated.'",
      "Micah Parsons Injured, Latest Updates on Packers Star's ACL and Timeline to Return Bleacher Report"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/15/008b457d-c6a9-450d-aaed-0042a0d06958/untitled-design-2025-12-14t170856-008.png",
    "titles": [
      "Micah Parsons injury update: Packers pass rusher tears ACL, now faces nine-month recovery, per report",
      "Micah Parsons Injured, Latest Updates on Packers Star's ACL and Timeline to Return - Bleacher Report"
    ],
    "url": "https://www.cbssports.com/nfl/news/green-bay-packers-micah-parsons-injury-update/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNbFBVcW5rYThCQU0yeDdoTWZyTDZhWXEwN0pZV0NZUDBRX2hDalZlNU0zV09meHd0WldzbVRuYzRabFBUZUFpNUR6Q3NxTHNMdTV0dWpMTWdNcExFTzRSRmJsNlFlQ3BfWGZFdFhDbjVrNFU5aERuLXVjNzJyZ3VBQ2Q5SThEd2RfcjdaMEl0b2JFUUVGUUpHV3VtbE45M1AzWXM5QmJmMHJWR0hUQXN5dkZyQUJsRWU2c3dV?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/green-bay-packers-micah-parsons-injury-update/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "keywords (1): recovery; semantic: pos_sim=0.05, neg_sim=0.11; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Green Bay Packers star Micah Parsons has suffered an ACL injury. According to team reports, Parsons is currently sidelined and undergoing evaluation. While the exact timeline for his return is uncertain, he has stated, \"I may be sidelined, but I am not defeated.\" The team has not provided a specific date for his comeback.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fallout season two will start one day early on Prime Video",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 13:14:41 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "forbes.com",
      "theverge.com"
    ],
    "snippets": [
      "Fallout fans will get to journey to the wasteland, and New Vegas, a bit earlier than expected.",
      "The second season of Fallout is debuting one day earlier than previously announced: the new season will now launch on Tuesday, December 16th at 9PM ET / 6PM PT on Prime Video, Amazon says. The season will have eight episodes that will premiere weekly on Wednesdays (besides this first episode), with"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/69404bfb4dc64d79c93b3c4c/0x0.jpg?width=960",
    "titles": [
      "‘Fallout’ Season 2 Gets A Last-Minute Release Date Change",
      "Fallout season 2 is streaming one day early"
    ],
    "url": "https://www.forbes.com/sites/erikkain/2025/12/15/fallout-season-2-early-release-date-amazon-prime-video/",
    "alternate_urls": [
      "https://www.theverge.com/news/844684/fallout-season-2-premiere-streaming-amazon-prime-video"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/erikkain/2025/12/15/fallout-season-2-early-release-date-amazon-prime-video/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.671,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "actions: release; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Amazon has announced that the second season of Fallout will premiere one day earlier than planned, now launching on Tuesday, December 16, 2025, at 9PM ET / 6PM PT on Prime Video. The season will feature eight episodes, with the first episode debuting on Tuesday and subsequent episodes releasing weekly on Wednesdays.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Russian court bans Pussy Riot group from working in Russia",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 18:09:44 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CBC News"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "Anti-Kremlin punk band 'Pussy Riot' designated an extremist group by Russian court Reuters",
      "The Russian anti-Kremlin feminist punk band and art collective known as Pussy Riot was designated an extremist organization by a Moscow court on Monday, banning its activities inside Russia as part of a wider crackdown on dissenting voices."
    ],
    "image_url": "",
    "titles": [
      "Anti-Kremlin punk band 'Pussy Riot' designated an extremist group by Russian court - Reuters",
      "Anti-Kremlin punk band Pussy Riot designated an extremist group by Russian court"
    ],
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQb2pHTUdaaThiRzEtMDZKSXdOVE1LSnhvQjhzeDRUVjA0RmNXNkxGRFdjWG93eG5oTjhQcEU4VnFTTUxNdWQ4VkhFSDk3R0pyQWJlcjFXZktTZmxMc3V3czhYQ3FYWEM3WUNRTzJ3WHpQSkNDZnlSaHFEdUVuNklDLUJyajF0Y25nY1JzcjhUOTVmMFBVTGxNQVVDdEFWVzl3SmU3allNQUJFTmNhRnVnaGtOSFBvbjU0Zmt6bDJXMURNcUxvUHlXTWNwbGtXUFZkRlA0?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/news/entertainment/pussy-riot-kremlin-terrorist-organization-9.7016622?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQb2pHTUdaaThiRzEtMDZKSXdOVE1LSnhvQjhzeDRUVjA0RmNXNkxGRFdjWG93eG5oTjhQcEU4VnFTTUxNdWQ4VkhFSDk3R0pyQWJlcjFXZktTZmxMc3V3czhYQ3FYWEM3WUNRTzJ3WHpQSkNDZnlSaHFEdUVuNklDLUJyajF0Y25nY1JzcjhUOTVmMFBVTGxNQVVDdEFWVzl3SmU3allNQUJFTmNhRnVnaGtOSFBvbjU0Zmt6bDJXMURNcUxvUHlXTWNwbGtXUFZkRlA0?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.669,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A Moscow court has designated the anti-Kremlin punk band and art collective Pussy Riot as an extremist organization, banning its activities within Russia. This move is part of a broader effort by Russian authorities to suppress dissent. The group is now prohibited from operating in the country.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Rob Reiner changed movies with his famous funny and serious films",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 12:30:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Business Insider"
    ],
    "domains": [
      "bbc.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Reiner was known for his activism as well as favourites like When Harry Met Sally, Stand by Me and Misery.",
      "Rob Reiner created the mockumentary genre with \"This Is Spinal Tap,\" scared us with \"Misery,\" and made us fall in love with \"When Harry Met Sally.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b5f4/live/e393b250-d9b9-11f0-b67b-690eb873de1b.jpg",
    "titles": [
      "Six classic movies from Rob Reiner, the 'big-hearted genius' director",
      "The best 8 movies Rob Reiner directed during his career"
    ],
    "url": "https://www.bbc.com/news/articles/c87l5xlz4rvo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.businessinsider.com/rob-reiner-best-movies-directed-2025-12"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c87l5xlz4rvo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.798,
      "consensus": 0.591,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.668,
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness about the director's work, but it does not offer any deeper insights or actionable information.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Rob Reiner, known for his activism and influential films such as \"When Harry Met Sally,\" \"Stand by Me,\" \"Misery,\" and \"This Is Spinal Tap,\" made a significant impact on both the film industry and public life. He is recognized for creating the mockumentary genre and for his contributions to popular cinema.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Paul Doyle admits driving into Liverpool fans during parade",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 15 Dec 2025 17:13:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Paul Doyle considered himself \"the most important person\" in the area before his attack, a court hears.",
      "Paul Doyle, 54, is due to be sentenced on Tuesday after admitting 31 offences against 21 adults and eight children A former Royal Marine was a “man in a rage” as he mowed down dozens of Liverpool football club fans at a victory parade in what many feared was a terrorist attack, a court has heard. Vi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2944/live/93397af0-d9d3-11f0-9bad-79a2809d3207.jpg",
    "titles": [
      "Liverpool parade attacker lied about 'panicking' and drove at crowds in rage, court told",
      "Man who drove into Liverpool FC parade was ‘in a rage’, court told"
    ],
    "url": "https://www.bbc.com/news/articles/cqjg9vprx4eo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2025/dec/15/man-drove-liverpool-fc-parade-rage-court-told-paul-doyle"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cqjg9vprx4eo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.662,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Paul Doyle, 54, a former Royal Marine, has admitted to 31 offences involving 21 adults and eight children after driving into crowds of Liverpool football club fans during a victory parade. The court heard Doyle described himself as \"the most important person\" in the area and acted in a rage. He is due to be sentenced on Tuesday.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bassac River, Southern Vietnam",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Mon, 15 Dec 2025 17:30:20 +0000",
    "source": "NASA",
    "sources": [
      "NASA",
      "NASA EO"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "A camera on the International Space Station captured this Oct. 2, 2025, photo of the Bassac River in Cù Lao Dung, a river islet district in southern Vietnam. The Bassac River surrounds the district before emptying into the South China Sea. The river’s brown waters at its mouth result from massive am",
      "The Bassac River surrounds Cù Lao Dung, a river islet district in southern Vietnam, before emptying into the South China Sea."
    ],
    "image_url": "",
    "titles": [
      "Bassac River, Southern Vietnam"
    ],
    "url": "https://www.nasa.gov/image-article/bassac-river-southern-vietnam/",
    "alternate_urls": [
      "https://www.nasa.gov/image-detail/gmt275_ehdc2/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-article/bassac-river-southern-vietnam/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Merriam-Webster’s 2025 word of the year is ‘slop’",
    "domain": "science",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-12-15T11:01:53-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Merriam-Webster has settled on a word that represents 2025 - and that word is \"slop.\" The dictionary-maker defines \"slop\" as \"digital content of low quality that is produced usually in quantity by means of artificial intelligence,\" something that many people have become familiar with as AI-generated",
      "AI-generated content has dominated the internet over the past year, and America's dictionary took note."
    ],
    "image_url": "",
    "titles": [
      "Merriam-Webster’s 2025 word of the year is ‘slop’",
      "Merriam-Webster names ‘slop’ the word of the year"
    ],
    "url": "https://www.theverge.com/news/844640/merriam-webster-ai-slop-word-of-the-year-2025",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/15/merriam-webster-names-slop-the-word-of-the-year/"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/news/844640/merriam-webster-ai-slop-word-of-the-year-2025",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.88,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "WATCH:  Video shows moment heroic bystander wrestles gun from alleged Bondi Beach shooter",
    "domain": "politics",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 18:17:13 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Video shared with ABC News shows the moment a heroic bystander wrestled a gun away from the hands of one of the alleged shooters at Australia's Bondi Beach on Sunday.",
      "Australian Prime Minister Anthony Albanese identified the man being hailed a hero as Ahmed al-Ahmed and said he was injured during the attack.",
      "The video, verified by The New York Times, shows a man sneaking up on one of the shooters who targeted a Hanukkah celebration in Sydney on Sunday."
    ],
    "image_url": "https://s.abcnews.com/images/International/251214_abc_social_shooter_australia_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Video shows moment heroic bystander wrestles gun from alleged Bondi Beach shooter",
      "Video shows bystander tackling and disarming Bondi Beach gunman",
      "Man Tackled and Disarmed One of the Bondi Beach Gunmen, Video Shows"
    ],
    "url": "https://abcnews.go.com/International/video/video-shows-moment-heroic-bystander-wrestles-gun-alleged-128397664",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/14/video-bystander-tackle-bondi-beach-gunman/",
      "https://www.nytimes.com/2025/12/14/world/australia/bondi-beach-gunman-tackled-video.html"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/International/video/video-shows-moment-heroic-bystander-wrestles-gun-alleged-128397664",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.553,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.642,
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is largely sensational and reactive, focusing on the dramatic moment of a bystander's intervention. It does not provide useful context, solutions, or insights.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]