{
  "a546ccf8714a0d32c51612799c8efbe5": "Saskatchewan Issues Overdose Alerts for Regina, Saskatoon Amid Drug Spike",
  "a59c679ab657f85b0656bbb37410db95": "Smith Advocates Team Canada Approach for Indigenous Concerns",
  "fffabdfd762eb7d1165ec06066f2734e": "Seawatch Homes' Value Plummets to $2 After Vandalism Surge",
  "6e3f70f7d7680dd5b48d652c4e91ed73": "B.C. Real Estate Sales, Prices Fall for Fifth Consecutive Month",
  "ca5c6c8f5a7d7f8082087d3514e97ba1": "Fire Destroys Historic Robertson's Trading Post in La Ronge",
  "f446f20d8bfd2562075836a11ce596c5": "Verstappen Embraces \"Villain\" Persona Ahead of Canadian Grand Prix",
  "bf681ad0c7fe1fe24ec69b13081f5101": "Republicans Criticize Padilla's Approach in Questioning Noem",
  "02d2fb7d72f28c3acd2ed854e592c39f": "NHS Confederation Chair Highlights Racial Disparities in Healthcare",
  "246156b75979d20712adad1a39f1a944": "Ilia Topuria Targets Paddy Pimblett for Next UFC Fight to Settle Rivalry",
  "7b45921395e8872681e4ecee05141321": "Dimock/Emery Baseball Field in Emery, SD Unveils First Upgrades",
  "c584aae545498c810a1c4c6134daf182": "Philippines Defeats Belgium, Advances to Knockout Stage in Darts World Cup",
  "177570f18cd93266381a1cb884be0fec": "Ohio State Buckeyes Receive Positive Update on Key Playmaker",
  "5a2bcce93addfa54cdfa4a30954d80fc": "Campbell, 39, Prepares for Training Camp with Light Offseason Program",
  "4701a2ebc5d61d8e44053b59681ec96e": "Atlanta Falcons to Offer 11 Open Practices, Including Two with Titans",
  "618b193196107cdb0b271250f33cbe42": "J.K. Dobbins Surprised by Chargers Not Re-signing Him, Explores Free Agency",
  "713143bdfd2dc73d8cc1aa284de8de5d": "Adam Nightingale Signs Contract Extension with MSU",
  "1210b4a613c54ab3540af67ad2c46a89": "Trump Approves U.S. Steel and Nippon Steel Merger After Security Pact",
  "10c0ead8ee2d6d05caa794191633893c": "Oracle Investors See Best Week Since April 2001",
  "7cb5101c4e0bc91477aff7cef5281fdc": "23andMe Co-Founder Wins Bid for Valuable Genetic Data Collection",
  "88148ab33bbe803da26475988dbfa526": "Oracle Shares Rise for Two Straight Sessions, Signaling Market Confidence",
  "9b12e4e0050e5119a9939fc2d74b5484": "Meta's New AI App Raises Privacy Concerns with Public Defaults",
  "365de77fb83b1aeb7aa919e455aa36b2": "JBS Debuts on NYSE with 2% Increase in Shares",
  "7029ec89f383e7ba64c99f6f5b31a2c5": "Senate Reviews GOP Bill to Alter Family Financial Support Based on Income",
  "28b213968d370a7d6dcada046b0b3a78": "Adobe's Sales Forecast Misses Skeptics' Expectations Amid AI Concerns",
  "36cccb02d49f2bfa67e53736143fb432": "USDA Ramps Up Fight Against Deadly Bird Flu Outbreak",
  "cfacb90d06bda0b2c5d6edd049f9b775": "Early Humans Used Fire for Meat Preservation 1M Years Ago",
  "afd07ab5a738e3e9c39f3bd856a2bca0": "New Semiconductor Tech Boosts 6G Performance, Says Bristol Team",
  "8257af8d725913fbbec1ca5dd4352686": "\"Ghost Plume Beneath Oman Reveals Unexpected Earth Core Heat Flow\"",
  "9ad099e4e65259a348e53d78553993ac": "Scientists Uncover Cause of Earth's 9-Day, 90-Second Shake Cycle",
  "0a2e4467b9f90b836c545b15d9a15a95": "Breakthrough in Quantum Computing: Atoms Controlled for 50 Minutes",
  "539d9ec7be832267ed749d0bce74d6e1": "Japan's Weather Chief Debunks Major Earthquake Rumors as Hoax",
  "4833b394675368905347af5f368aeb6f": "Perseverance Rover May Have Samples From Martian Volcano",
  "f4d9f528e5ab07ecd89591e81b924877": "Germany Worries Over US Ties; Locals Near Bases Remain Hopeful",
  "e52bc79142d79eb13c8db04f85324247": "Trump Divided by Party on Israel-Iran Conflict Stance",
  "cfc3377b34f7e081a2ae21f614c3e2e9": "Sam Burns Tops US Open Leaderboard; Notable Players Miss Cut, Clark Returns to W",
  "6f3262e32cb37988421a278689bea847": "Trump Reports Earnings in Millions from Crypto, Golf, and Licensing",
  "4982b36e36e99b566c3833b5ec42614a": "Immigration Raids Disrupt US Farms, Risk Higher Consumer Prices",
  "656cc40511be238e7c8136ac54ee63ee": "Woman Injured in Bear Encounter, Faces Serious Lacerations",
  "cea13c60ac9d8f6c781f4a68fe0b8ec3": "Israeli Evacuations After Iranian Missiles Breach Airspace",
  "ee6fd85394189416cb17b39339c716a1": "Underwater Proposal Captured by B.C. Cinematographer",
  "d51259ff6b6d90c4538a28e94dadd7a6": "Yankees' Boone Ejected for Disputing Call in Loss to Red Sox",
  "bb6fdbd07a6b8e910cb6077498e8100c": "WWE SmackDown: CM Punk, Cena Rivalry Intensifies Ahead of Night of Champions",
  "fc332ea1f39befc83afb767b9f9cd9c8": "White Sox Rally in 7th Inning, Outcome Unclear in Texas Match-up",
  "ea853bc38571bd39d595c3bbb8614ed4": "Mike Sainristil Poised for Breakout Season with Commanders",
  "f40a95b92b36860501e2467619a84c89": "Crochet Leads Red Sox to Victory with Career-High 8.1 Scoreless Innings",
  "411b5542849afaedcaf37793209f3620": "Mets Prospect Parada Hits Home Runs in Consecutive Games, Shows Rising Talent",
  "4c9e68d98bdc0df493ba463672004cc1": "Tyreek Hill Challenges Olympian Noah Lyles in Viral Speed Showcase",
  "25830819e7eb4949d3663cdf1b645261": "News Outlets Shift Focus to Positive Stories Amid Public Demand",
  "a4826764aaba36664835789fa776e49b": "Tesla to Test Robotaxis in Austin Amid Local Protests",
  "6dc14f40962f8c418acdd944cb0a638b": "UFC Atlanta: Usman vs. Buckley Headline June 14 Event at State Farm Arena",
  "c68ce9c00b573c0106b31cbeaae4acb9": "\"Northern Metropolis Project Falls Short in Initial Stage\"",
  "f79777b112beaae72312bff5471a5905": "High Scores Dominate US Open at Oakmont Amid Tough Conditions",
  "fb9b4030a895fe3be2bc8383847fc194": "Chris Brown Releases New Music Amid Tour, UK Assault Case",
  "5fae9c89e3d55b72e5101bb8896a7ce8": "Raye Joins Forces with Mark Ronson on New Single \"Suzanne\"",
  "9c1a77a733df28ffc262282ce078f20b": "UFC Fight Night: Lewis vs. Teixeira Set for July 12 in Nashville",
  "28d6f641f483c4bbb972e7a2604e71d9": "NASA's CODEX Experiment Unveils New Solar Wind Images"
}