{
  "47382b79a8b90bed4e1faab8bc7a003e": "Air India Tragedy Strikes Amid Brand Transformation Efforts",
  "5fc977b5215cc876c05eec2606c51a67": "US Judge Strikes Down Biden's Abortion Privacy Rule",
  "25e91f22849575bf11770f67af7301a9": "Cambodia Bans Thai Produce Amid Escalating Border Dispute",
  "9b06d5cb8f9d4c9d4d9265e5d14296b6": "Court Rules Taxpayers Won't Fund Trump's Appeal in Carroll Defamation Case",
  "17b2dde8e8d3cfe381d2bf71c4e9ec73": "Cuomo Leads Mamdani in NYC Mayoral Race Poll",
  "465eecc3b8abc4f54173ced88b70301b": "Apple Integrates AI in Chip Design, Aims for Enhanced Efficiency",
  "40f9c32377f3e4dcfe9303456cf8df0b": "Senate Sticks to Strict Timeline for Trump Budget Bill",
  "c1e05da0901b4e105bdaf1fda43d7eaa": "Study Shows Larger Life Expectancy Gap for Native Americans",
  "2395bb24e0559a6921195ee0e2d059d1": "Liverpool Eyes Record Bid for Isak, Man Utd Proposes Rashford Swap",
  "b3199385cb00991c044b04515e8b82da": "Roman Josi Expected to Return to Predators Next Season After Recovery",
  "13f84856467190636e76af4f827af119": "Tkachuk Brothers Aim for Gold with U.S. at 2026 Olympics",
  "fd29df33bf4f64c04f26e82abb5121fe": "Chelsea Eyes West Ham's Mohammed Kudus for Transfer",
  "1238bf233d53b7db8377c007348bc458": "Clubs Urged to Limit Spending on Player Transfers",
  "f60945d85bbd4f6d0655ce1a1892ca2e": "College World Series Spotlights Top Draft Picks, No. 1 Contender Emerges",
  "62024da82694ee9ddd1d48cf62646469": "Sun's Mabrey Foul Upgraded to Flagrant 2 After Scuffle with Fever's Clark",
  "8708fd3e8b37737b95ab9886429fef74": "Concacaf Gold Cup Teams Battle for Quarterfinal Spots",
  "6fad7fa64ece820c08948600d0f0267d": "Morgan Stanley Shuts Down Electronic Equity Trading Unit in Strategy Shift",
  "2c1eb6f19d6fc9ac5f9b699c90f74019": "Non-Doms Struggle to Sell Homes in Stagnant London Market",
  "884b5a223de08cfa953277aad064562c": "Trump, Modi Disagree on U.S. Role in India-Pakistan Ceasefire",
  "a65016735e619a4f277f4fc083ebd0a3": "Trump Demands \"Unconditional Surrender\" from Iran, Escalating Tensions",
  "aba40d4af5ebe3467cd9a860fb7f8820": "Foreign Holdings of U.S. Treasuries Stay High Amid Financial Turmoil",
  "ff6132275fbf7d075d597077c1dbcb2b": "Amazon Orders Employees to Relocate to Seattle or Corporate Hubs",
  "9f854dd3bd609d81b06e2efe05786bfb": "Wolfspeed Nears Bankruptcy Deal with Lenders, Including Apollo",
  "57c76b34cd0ee1cac61272455eb585af": "Arnault Battles Historic Downturn at LVMH, Bloomberg Reports",
  "c8d69216fe094f3578c54638c9a47a94": "New \"28 Days Later\" Film Hailed as Series Best by Critic Simon Ings",
  "322fc7f3a4f2170b0324c95e38206b3b": "New Model Boosts OLED Lifespan and Brightness, Enhances Screen Durability",
  "df6cfbc54c5845ab9fc99dd1269ffe6e": "Okra, Fenugreek Extracts Can Remove 90% of Water Microplastics: Study",
  "653b95d40beec7a3bdea842ca7197fa6": "Trump Supports Asbestos Use, Cites Mob Influence on Reputation",
  "5a36916a96f24995ff6963e5961528ef": "Study Finds Physical Therapy, Weight Management Best for Knee Osteoarthritis",
  "2436baebb0621b9fc2955c7818ca985c": "Global Pet Trade of 1,000 Species Impacts Biodiversity, Notes Expert",
  "38e9402336b57cb698b867c329ada1d1": "Immersive Entertainment Grows, Sparks Debate on Cultural Impact",
  "e60d161999ae662deccb3824c7a822fa": "James Kimmel Jr. Explores Revenge as Addiction in New Book"
}