{
  "2bbe63a60d84855ff2ac236e2c0cae1c": "Small City in Los Angeles County Wins National Awards for 1980s Transformation",
  "7f30c5bee76fd988675cc76951f0e813": "Trump Orders National Guard to LA Amid Claims of Chaos, City Life Unaffected",
  "e7bc8e18da907aa94036ee6ac6958b3f": "Supreme Court Rejects Mexico's $10 Billion Lawsuit Against U.S. Gun Makers",
  "7b12deb8996640a7c34b4cfe20ca8485": "Mike Lindell Faces Jury Over False Election Claims",
  "329685439ed51841513128d56f403609": "Democrats Debate Party Identity Amid Trump Opposition",
  "1386e15f2d9b113b4b84451ea02b01f5": "Online Nationalism Spurs Attacks on Critics by Bots and Youths",
  "2d737900fe597c51cf2d706ee4b9e91f": "Wuppertal Schwebebahn Marks 125 Years as a Beloved Historical Transport",
  "82f41d416f8892fe4c7bcd9f57c95b2e": "California National Guard Deployed to Los Angeles on President's Order",
  "a06248ae91a29329e3a5ca94a1e2fcb1": "Thunder Triumph in Game 2 of 2025 NBA Finals",
  "410ee6c1326f976da54e0cac52de6d28": "Thunder Bounce Back, Tie NBA Finals Series with Win Over Pacers",
  "7e37d4732fe8430815c6ab79360b47a8": "Alcaraz Wins French Open, Defends Title After Dramatic Comeback",
  "5e1212c48c46919c8035024c42235050": "Nick Chubb to Sign One-Year Contract with Houston Texans",
  "fde75f11630139e97f0b32ce1c258892": "Sky's Courtney Vandersloot Out for Season with Torn ACL",
  "d65b92f8b5c8da738fcf36e8a7f838a2": "Wander Franco Faces New Charge Amid Ongoing Trial",
  "88e954950898143e26997d1a128c9581": "Pirates Win Despite Ace Skenes' No-Decision Performance",
  "66ed04101aa118c0ac7c26ab4aec729d": "Portugal Wins Second Nations League Title; Ronaldo Elated",
  "db3190a01ce3d47309873c177dfbe413": "Jobs Report Fuels S&P 500 Rally, Nears Record High",
  "4e00c47667205b06816b17d3fab928a9": "Troops to Be Extensively Deployed to Prevent Unspecified Event",
  "1356084fc472ceafd5fa229af9b8d084": "Newsom Criticizes Trump's National Guard Deployment to L.A. as Inflammatory",
  "18d659a505ff719d2f66610a21e15308": "China Faces Economic Concerns as Consumer Demand Drops",
  "eba5e4fdc7bbca503e1529f4486b3a1f": "2025 U.S. Open Set for Oakmont, Broadcast Details Pending",
  "35db3f90b3d5b1e685fe10d369afb19c": "NHS Budget to Rise 2.8% Annually for Better Healthcare Services",
  "aa0304f7d5fd40e375da1630db855940": "Officials Criticize Terry Moran's Late-Night Comments on Platform X",
  "9ef8d428c363ed6777c561b1ec69b357": "U.S. Announces New Travel Ban; Pre-Ban Visas Remain Valid",
  "40195bb5af903a905b715db646068388": "ETH Zurich Scientists Unravel Mystery of Earth's Deep Layer Behavior",
  "42e3a1e8a9b8025b1ee750593cc247f0": "Quantum Computers Boost Machine Learning, Cut Energy Use",
  "c7f9713f6fabdecb7db69ba77dd69358": "Cambridge Develops Superior Quantum Sensor from hBN",
  "8dee074a1d634690ba8228610f0cd723": "Quantum Interferometry Tool Boosts Measurement Precision Beyond Classical Limits",
  "6250d0af394731febd4e6836be79644f": "New Diamond Sensor Merges Quantum Science for Advanced Diagnostics",
  "a7b11602855fa18b01d30dca8394f44b": "South Africa's Rhino Populations Plummet Due to Poaching",
  "4bcd18d64ea2d5f4f4258a0c36ec79ac": "Study Shows Seasonal Sunlight Affects Human Circadian Rhythms",
  "5509c0b033559bf11378a258c450c826": "New Antibiotic, Lariocidin, Discovered After 30 Years"
}