{
  "3a9ec6338afe66eb3a0897188a0093fb": "Heat Wave Hits Ontario and Quebec, Temps Up to 36°C Expected",
  "c148cbcee43948c464474f1741b90804": "Hot-Air Balloon Crash in Brazil Kills 8, Injures 13 in Praia Grande",
  "67f44da53a3cfb4778ace8cb9e01e02b": "Israel-Iran Tensions Escalate with Strikes; US Signals Potential Involvement",
  "23c145019149e5d27640fa26ee5f501e": "Ollie Pope Scores Century in England's Fightback Against India at Headingley",
  "29e19b99569a76fcac1fc7239ee94825": "Trump Administration's Secret Iran Talks Fail Amid Internal Strife",
  "74b34fab2c3ef910a9f059140d1c448c": "Belarus Opposition Leader Tsikhanouski Jailed for 18 Years, Sparks Protests",
  "d37660f93dc8d30dffb9a4280a6af41b": "Real Madrid vs Pachuca in FIFA Club World Cup Amid Low US Attendance",
  "2404acc7d52f6b65ff216b09244613c0": "Motorcyclist Dies in Collision with Parked ATV Near Ottawa",
  "451fb590503dc6f57912e899faf27bff": "Jon Jones Retires; Tom Aspinall Named UFC Heavyweight Champion",
  "905603cc365d142a2d3da28f7f10644f": "Devers Hits First Giants Homer Against Former Team Red Sox",
  "fc997b38eb39a2885406443921183150": "Braves' Sale, Orioles' Rutschman on IL; Teams Recall Replacements",
  "0ea081ad472f522ecedd63fd4ba3587a": "Khalil Rountree Jr. Defeats Jamahal Hill at UFC's First Event in Azerbaijan",
  "b50fc589dc0a2d49c339766f8e3ddcd5": "Arkansas' Wehiwa Aloy Wins Golden Spikes Award as Top Amateur Player",
  "37877bda6892be32e90e0bb59e9673b6": "Cal Raleigh Sets Record: First Catcher to Hit 30 HRs Before All-Star Break",
  "6d0dc7f77650eb2a74a3142e7b139274": "MLB Investigates Abuse Allegations Against Giants' Sean Hjelle",
  "b5a3b1206b2dc32b3a620b136b3ef322": "Dale Earnhardt Jr. Wins Debut as Crew Chief in Xfinity Series Race",
  "820f060f74fe6123cffa9fb292ff6670": "Ukraine Secures $43B for Defense; Russia Recovers 20 Soldiers' Remains",
  "eac8c8b86196b681144eeeea39072477": "Canadian North Resources Inc. Announces Shareholder Meeting Results",
  "abeb0b0159b47800062f60af48467d87": "WB CondoCon Hosts 3rd Annual Board Education Event in Oakville",
  "9a3de2efdbce70f61b5c2921cf16ef0d": "Apple Develops AI Search Engine Amid Google Deal Concerns",
  "039f7fdd91e5c59b97384291aea1f348": "Wind and Solar Emerge as Cost-Effective Electricity Sources",
  "61b5a862bc4f42d6cc1da697f27f5899": "Elon Musk Plans to Revamp Grok Amid Quality Concerns",
  "bfd7c4781af3d235f79faf8025f582cc": "Flights Over Afghanistan Surge 500% Amid Israel-Iran Conflict",
  "7296dd8fd047ffadc5fb53390cc98a00": "Flagg, Harper Lead NBA Draft; Bailey, Clayton Jr. Surprise Picks",
  "043bf8b0f363bcbc5e964164e39b86fe": "Study Links Century-Old North Atlantic Cold Spot to Weakening Ocean Current",
  "8447a6700b2d5e1e302bbc2ad9871c6f": "Study Questions Effectiveness of Current Biodiversity Conservation Strategies",
  "7e9920ba5bdaf1b558ba66332e7db540": "Ancestors of Dinosaurs Made 10,000-Mile \"Hellish\" Migration, Study Finds",
  "14c88a34ee42c31bd0509b374a8db94d": "Scientists Unlock 500-Million-Year-Old Immune System Code",
  "65b7277f82545549079c48db9d3b47a2": "Ice Age Transformed Blue Mountains into Snowy, Treeless Peaks 20,000 Years Ago",
  "9628a4b96228ee3648d49948654591f9": "UK Faces More Frequent Heatwaves Due to Climate Change, Warns Met Office",
  "788daeb447d01817871ee32408a749e0": "New Immunotherapy Reverses Cholesterol Damage in Heart Cells",
  "fe9c181c37bfe5c75d7639d6c4b02806": "Study Finds Some \"Bad\" Fats May Protect Heart, Challenges Dietary Beliefs"
}