[
  {
    "title": "UK Finalizes Sizewell C Nuclear Plant Funding; Households to Pay £1/Month",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 07:43:40 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Financial Post",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Households will pay £1 a month towards the construction of the UK's second new nuclear power plant.",
      "Ministers on Tuesday announced the ‘final investment decision’ for the Suffolk project developed by EDF",
      "<p>Government’s deal with EDF, Centrica and other backers marks end of 15-year journey to win funding for project</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jul/22/astrazeneca-50bn-us-investmentt-tariffs-uk-public-finances-rachel-reeves-bank-of-england-business-live-news-u",
      "The UK announced final approval for the Sizewell C nuclear power plant after securing private investment in the £38 billion ($51 billion) project that will help advance the government’s energy and climate goals."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b3fe/live/1728e740-66d1-11f0-af20-030418be2ca5.jpg",
    "titles": [
      "Sizewell C nuclear power plant costs rise to £38bn",
      "UK’s £38bn Sizewell C nuclear plant secures private investment",
      "UK strikes deal with private investors to build £38bn Sizewell C nuclear power plant",
      "UK Inks Investment Deals on £38 Billion Sizewell C Nuclear Plant"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.991,
      "consensus": 0.985,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.864,
    "summary": "The UK government has finalized the investment decision for the Sizewell C nuclear power plant in Suffolk, with households contributing £1 a month towards its construction. This decision, announced by ministers, comes after a 15-year effort to secure funding for the £38 billion project developed by EDF, Centrica, and other backers. The project aims to support the government's energy and climate objectives.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a significant government decision, explaining how it will be funded and who is involved. It also raises awareness about the UK's energy and climate objectives, and reports on a solution to meet these goals.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "230,000 Pages of Civil Rights Leader's FBI Files Unsealed",
    "domain": "general",
    "location": "national",
    "published": "Mon, 21 Jul 2025 20:43:35 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The release came in response to an executive order issued by President Trump. King's family warned they would object to any use of the records \"to spread falsehoods\" about King's life and legacy.",
      "About 230,000 pages of records are unsealed, despite opposition from some of the King family.",
      "The release of hundreds of thousands of pages related to the civil rights leader comes despite his family&#039;s opposition.",
      "Despite the King family's objection, the US released the FBI's files on the slain civil rights icon, triggering criticism from his relatives and other civil rights activists."
    ],
    "image_url": "",
    "titles": [
      "Trump administration releases trove of files on Martin Luther King Jr. assassination",
      "Trump administration releases files on Martin Luther King Jr",
      "Trump administration declassifies Martin Luther King Jr assassination files",
      "US: Trump administration releases Martin Luther King files"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.856,
      "consensus": 0.935,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.84,
    "summary": "Approximately 230,000 pages of records, including FBI surveillance files related to a civil rights leader, were unsealed despite opposition from some members of his family. The documents' release marks a significant disclosure of historical information.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful historical information, contributing to a deeper understanding of the civil rights movement and the role of the FBI. However, it does not report on any solutions or improvements, nor does it offer actionable insights for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/2910/13928023965_701ce719a1.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/230c2be5-b823-4f73-a55e-721c234c369a/thumb/",
      "alt": "33 Dorothy Drive, Plymouth will be hitting the MLS on Monday for $230,000!",
      "credit": "JonathanBowen / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ex-Officer Hankison Sentenced to 33 Months for Breonna Taylor Case",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 22:37:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Prosecutors had asked that officer Brett Hankison be given a sentence of one day for his role in the fatal shooting.",
      "Breonna Taylor was shot dead by police when they arrived at her home around midnight with a no-knock warrant. The killing of a Black woman in Kentucky sparked a wave of protests across the US.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOZjZWX29pTkFkVmh0Nm1JOWxOQkFHWHBBSi1SMmZBbHlVWWJIYXZZaVR6SE9JYkxTME1zdE9aQk5mVWZnRlYwSFNUTEJuRWQ5bUZSVTBhdzZkVXdFMjRZRC0yalBQcDBEN3h5RzJETGw5X1RmMzdVTm1UbjF6LWpFQzlGVW41ZHAzMXg5SThRYw?oc=5\" target=\"_blank\">Ex-officer in fatal Breonna Taylo",
      "The Justice Department argued there was “no need for a prison sentence” while claiming Hankison was not responsible for Taylor’s death."
    ],
    "image_url": "",
    "titles": [
      "US police officer in Breonna Taylor death sentenced to 33 months in prison",
      "US ex-officer sentenced to prison over Breonna Taylor raid",
      "Ex-officer in fatal Breonna Taylor raid sentenced to 33 months - Axios",
      "Ex-Officer In Breonna Taylor Raid Sentenced To 33 Months In Prison After Trump Administration Requests No Further Jail Time"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.82,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary": "The former Louisville police officer, Brett Hankison, convicted of a civil rights offense related to Breonna Taylor's death, has been sentenced to 33 months in prison. Despite the Trump administration's request for a one-day sentence and the Justice Department's argument against prison time, claiming Hankison was not responsible for Taylor's death, the court decided on a significantly longer sentence.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the sentencing of the ex-officer involved in the Breonna Taylor case. It contextualizes the event by mentioning the contrasting positions of the Trump administration and the Justice Department, contributing to the reader's understanding of the case. However, it doesn't report on solutions, improvements, or attempts to solve systemic problems.",
    "image": {
      "src": "https://live.staticflickr.com/3707/13883908261_c7c0f1f8f8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bf334a36-9a11-4d53-9270-f3543b0cffd0/thumb/",
      "alt": "Fed Ex Office Store",
      "credit": "JeepersMedia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Holloway Eyes Lightweight Title Shot After UFC 318 Win",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 17:49:54 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "Brett Okamoto plays matchmaker and predicts the next move for Holloway and other stars from UFC 318.",
      "Max Holloway's next fight is a hot topic. We look at the betting odds when it comes to who the UFC BMF champion could face after his UFC 318 win over Dustin Poirier.",
      "<p>Max Holloway returned to the lightweight division at UFC 318 with a great performance against Dustin Poirier and now he looks to move closer to a title shot.</p>"
    ],
    "image_url": "",
    "titles": [
      "What's next for Max Holloway and Paulo Costa after UFC 318?",
      "Max Holloway: Betting Odds For His Next Opponent After UFC 318",
      "What’s next for Max Holloway, other standouts after UFC 318?"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.806,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary": "Max Holloway, following his impressive win over Dustin Poirier at UFC 318, is eyeing a move closer to a lightweight title shot. Brett Okamoto speculates on potential matchups for Holloway, with betting odds favoring several contenders. Holloway's victory marks a successful return to the lightweight division, positioning him as a key figure in future title discussions.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Max Holloway's win and his future prospects in the UFC. However, it doesn't provide much depth or insight beyond the context of the sport, nor does it report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/7190/6982864935_6fda7cdb42_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d3278e0a-9c3e-4198-997f-28381ff8694f/thumb/",
      "alt": "Brewery House - 1 to 5 Holloway - Tamworth",
      "credit": "ell brown / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Mbeumo Joins Manchester United for £71m, Eyes Trophies",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 07:29:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The Cameroon international, who recorded career-best figures in the EPL last season, joins the club on a long-term deal.",
      "Bryan Mbeumo has said he wants to win the biggest trophies after completing his transfer to Manchester United from Brentford.Mbeumo has signed a long-term contract at Old Trafford after the two clubs ...",
      "<ul><li><p>Says United are ‘the team whose shirt I wore growing up’</p></li><li><p>Rashford to complete Barcelona loan on Wednesday</p></li></ul><p>Bryan Mbeumo said he had joined “the club of my dreams” after completing a £71m move to Manchester United, where the Cameroon international has signed a"
    ],
    "image_url": "",
    "titles": [
      "Bryan Mbeumo signs with Manchester United from Brentford",
      "Mbeumo eyes biggest trophies after Manchester United move",
      "‘Club of my dreams’: Bryan Mbeumo seals £71m Manchester United move"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.986,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary": "Cameroon international Bryan Mbeumo transferred to Manchester United from Brentford for £71m, signing a long-term contract. Expressing his ambition, Mbeumo aims to win major trophies with Manchester United, a club he has supported since childhood. This move coincides with Marcus Rashford's impending loan to Barcelona.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of a significant transfer in football, it offers minimal depth or insight beyond the immediate facts of the transfer. It does not provide context or analysis that might help readers understand the implications of the move for the teams involved or the player's career.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Bryan_Mbeumo.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/fec5cb09-4e5e-44ac-a9a8-b0f9f6751cac/thumb/",
      "alt": "Bryan Mbeumo",
      "credit": "Pedro Semitiel / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "White House Excludes WSJ from Trump's Scotland Press Pool Over Epstein Report",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 01:44:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Business Insider"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "White House Correspondents&#039; Association condemns White House&#039;s move to exclude newspaper as &#039;deeply troubling&#039;.",
      "<p>As president sues paper over alleged letter, Karoline Leavitt cites ‘fake and defamatory conduct’ for kicking out reporter</p><p>A Wall Street Journal reporter was kicked out of Donald Trump’s press pool for his upcoming weekend trip to Scotland. The removal marked increased retaliation after the",
      "The White House said The Wall Street Journal would not be in the press pool traveling with Trump to Scotland due to its report on the Epstein letter."
    ],
    "image_url": "",
    "titles": [
      "Trump administration bars Wall Street Journal from trip amid Epstein spat",
      "Trump bans Wall Street Journal from Scotland trip press pool over Epstein report",
      "White House pulls The Wall Street Journal from Scotland press pool over Trump-Epstein story"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.874,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary": "The White House excluded The Wall Street Journal from Trump's Scotland press pool in response to the newspaper's coverage of the Epstein letter. The decision was made based on the report's content. The outcome is that The Wall Street Journal was not included in the press pool for the trip.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the exclusion of The Wall Street Journal from Trump's press pool, it lacks depth and insight. It doesn't explain why the Epstein report led to this decision, or what the implications of this exclusion might be. It also doesn't provide actionable insights or a sense of progress.",
    "image": {
      "src": "https://live.staticflickr.com/4052/4497663438_cd4f12a36a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4e70a488-fe63-4122-b504-5a07d7e8f8fe/thumb/",
      "alt": "White lions",
      "credit": "monkeywing / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Surprised by Israeli Strikes in Syria, Contacts Netanyahu",
    "domain": "general",
    "location": "national",
    "published": "Mon, 21 Jul 2025 21:51:49 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5SVHp5VXFCOHJXM0Zjbm9DeTN2VkcxYXBZc3dWem5oUGdIUG1lWWZ4WXlXd2Z5cHd5c3dwaXdRQ0kxeXhwOUFOdFV6bzFDY2otaC1FcW5xMng2VWxTWm1HV2prTkxLSVNGbWhFdzBWZHJOTVBJ?oc=5\" target=\"_blank\">White House confirms Trump objected to Israeli strikes in Syria</a>&nbs",
      "<p>The White House confirmed that Trump called Netanyahu to ‘rectify’ the situation after ongoing clashes in the city of Sweida</p><p>Donald Trump was “caught off guard” by Israeli strikes on Syria last week, the White House has said, adding that the US president called Benjamin Netanyahu to “rectif"
    ],
    "image_url": "",
    "titles": [
      "White House confirms Trump objected to Israeli strikes in Syria - Axios",
      "Trump ‘caught off guard’ by Israeli strikes on Syria last week"
    ],
    "score_components": {
      "magnitude": 0.85,
      "recency": 0.807,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary": "The White House confirmed that Donald Trump was surprised by Israeli strikes in Syria and contacted Prime Minister Benjamin Netanyahu to address the situation following clashes in Sweida. Trump sought to \"rectify\" the developments, indicating a direct engagement to manage the fallout from the military actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical situation between the US, Israel, and Syria. It informs readers about the immediate reaction of the US president to the Israeli strikes, giving some insight into international relations and conflict management. However, it does not provide a deeper understanding of the causes, trends, or impacts of these events.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Malcolm-Jamal Warner Dies at 54 in Accidental Drowning in Costa Rica",
    "domain": "general",
    "location": "national",
    "published": "Mon, 21 Jul 2025 16:02:04 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The actor and Grammy Award winner died in a drowning accident Sunday while on vacation in Costa Rica.",
      "<p>Actor who played Theo Huxtable in long-running sitcom reported to have drowned while on vacation in Costa Rica</p><p><a href=\"https://www.theguardian.com/tv-and-radio/shortcuts/2014/sep/22/cosby-show-turns-30-loved-the-huxtables\">The Cosby Show</a> actor Malcolm-Jamal Warner has died, according t",
      "Malcolm-Jamal Warner the actor who played teenage son Theo Huxtable&#160;on “The Cosby Show,”&#160;has died at age 54 in an accidental drowning in Costa Rica, authorities there said. Costa Rica’s Judicial Investigation Department said Monday that Warner drowned Sunday afternoon on a beach on Costa R"
    ],
    "image_url": "",
    "titles": [
      "Actor Malcolm-Jamal Warner, 'Cosby Show' star, has died at the age of 54",
      "Malcolm-Jamal Warner, The Cosby Show actor, dies at 54",
      "‘The Cosby Show’ actor Malcolm-Jamal Warner dead at 54"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.776,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.717,
    "summary": "Malcolm-Jamal Warner, known for playing Theo Huxtable on \"The Cosby Show,\" has died at age 54 in an accidental drowning in Costa Rica, confirmed by the country's Judicial Investigation Department. The incident occurred on a beach in the southeast of the country while Warner was on vacation.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the tragic event but offers no depth, insight, or actionable takeaways for the reader. It does not contribute to the reader's understanding beyond the immediate news.",
    "image": {
      "src": "https://live.staticflickr.com/7077/6947925914_c7881f6061_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9120904f-8477-4569-b9da-2b34ec4a5b2e/thumb/",
      "alt": "Gift Shop: Harry Potter Tour Warner Bros Studios Leavesden London",
      "credit": "Tips For Travellers / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Blue Jays Set Record with 11th Straight Home Win; Royals Crush Cubs 12-4",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 01:47:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Bo Bichette's two-run double sparked a four-run fifth inning as the Toronto Blue Jays opened a three-game series against the New York Yankees with a 4-1 win on Monday.",
      "<p>The Toronto Blue Jays set a new franchise record, winning their 11th straight home game on the back of seven strong innings from Kevin Gausman and Bo Bichette&#8217;s go-ahead two-run double in the fifth inning to power the Blue Jays to a 4-1 win.</p>",
      "<p>Salvador Perez hit a pair of homers as Jac Caglianone and John Rave added two more to power the Kansas City Royals to a 12-4 win over the Chicago Cubs.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/f804a314daf9a9045aa4d21743408fea24a45dd2e44f5148f9f9ff6ba2371057_fd7604.jpg?quality=65&strip=all",
    "titles": [
      "Bo Bichette lifts Blue Jays over Yankees 4-1",
      "MLB Highlights: Blue Jays 4, Yankees 1",
      "MLB Highlights: Royals 12, Cubs 4"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.875,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.693,
    "summary": "The Toronto Blue Jays defeated the New York Yankees 4-1, with Bo Bichette's two-run double in the fifth inning leading to a four-run rally. This victory set a new franchise record for the Blue Jays, marking their 11th consecutive home win, supported by Kevin Gausman's seven strong innings. In another game, the Kansas City Royals overcame the Chicago Cubs 12-4, thanks to Salvador Perez's two home runs and additional homers from Jac Caglianone and John Rave.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of the outcomes of two baseball games, but it doesn't offer much depth or insight beyond the scores and key players. It doesn't provide actionable insights or deeper understanding, nor does it report on solutions or innovations. It also doesn't increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/151/425965097_9972cce783_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/344cba3d-d932-43a2-8f89-339c72ac29e0/thumb/",
      "alt": "blue",
      "credit": "Muffet / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Bangladesh Jet Crash Kills 20, Injures 200 at Dhaka School",
    "domain": "general",
    "location": "global",
    "published": "2025-07-21T16:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The death toll has risen to 27, with scores more injured, a Bangladesh Air Force plane crashed into a school building in Dhaka. It is the country's deadliest aviation disaster in more than 40 years.",
      "<p>Injured number almost 200 after training jet had technical problem once airborne, with pilot among the dead</p><p>At least 20 people were killed and nearly 200 injured – many of them children – when a Bangladeshi fighter jet on a routine training exercise crashed into a school in Dhaka in the cou",
      "More than 170 people were injured after the training aircraft crashed, military officials said. The country’s interim leader called the loss “irreparable.”"
    ],
    "image_url": "",
    "titles": [
      "Bangladesh: Many killed after plane crashes into school",
      "At least 20 killed as military plane crashes into Bangladesh school campus",
      "Bangladesh Air Force Jet Crashes Into School, Killing at Least 20"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.72,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary": "An F-7 training jet of the Bangladesh Air Force crashed into a school campus in Dhaka due to a mechanical fault shortly after takeoff, resulting in at least 20 deaths and nearly 200 injuries. The crash, described as the country's deadliest aviation disaster in over 40 years, occurred during a routine training exercise. Among the casualties were mostly students, and the pilot was also confirmed dead. The country's interim leader has called the loss \"irreparable.\"",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a tragic event but lacks depth or insight. It does not offer any actionable insights for the reader, nor does it report on solutions or improvements. The causes of the crash are briefly mentioned, but there is no discussion of the broader implications or potential measures to prevent similar incidents in the future.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51650035961_cb078d8fc1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b8d89cf7-5c87-455d-8954-b9e08fbb84c4/thumb/",
      "alt": "First Minister Nicola Sturgeon meets with Bangladesh Prime Minister Sheikh Hasina",
      "credit": "Scottish Government / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Phillies Beat Red Sox 3-2 in 10th on Walk-Off Catcher's Interference",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 00:11:26 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Brandon Marsh scored on a catcher's interference call with the bases loaded in the 10th inning to give the Phillies a 3-2 walk-off win over the Red Sox.",
      "<p>Watch as the Philadelphia Phillies beat the Boston Red Sox in extra innings on a catchers’ interference call after Edmundo Sosa’s bat collided with Carlos Narvaez’s glove on a 2-2 pitch.</p>",
      "<p>Automatic runner Brandon Marsh scored on a call of catcher’s interference with the bases loaded in the 10th inning Monday night to give the Philadelphia Phillies a 3-2 walk-off win over the Boston Red Sox.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies win on catcher's interference call in 10th",
      "Phillies beat Red Sox on wild walk-off catchers’ interference call",
      "Phillies walk off Red Sox on catcher’s interference call with bases loaded"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.92,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary": "The Philadelphia Phillies secured a 3-2 walk-off victory against the Boston Red Sox in extra innings, specifically the 10th, when Brandon Marsh scored due to a catcher's interference call. This incident occurred after Edmundo Sosa's bat made contact with catcher Carlos Narvaez's glove on a 2-2 pitch, with the bases loaded, leading to the decisive run.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides a bit more detail about a specific incident in a baseball game, which could increase reader understanding of the rules and strategies of the game. However, it still doesn't provide actionable insights, report on solutions or innovations, or increase clarity around larger systems or trends.",
    "image": {
      "src": "https://live.staticflickr.com/7406/16551464321_2ea7d24f95_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/02c79e53-368f-4192-9ece-831ec36acdde/thumb/",
      "alt": "The Blizzard by Phillis Levin",
      "credit": "Me in ME / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "NASA Fixes JunoCam on Jupiter Probe, Captures Io Photos",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 16:26:58 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The mission team of NASA's Jupiter-orbiting Juno spacecraft executed a deep-space move in December 2023 to repair its JunoCam imager to capture photos of the Jovian moon Io. Results from the long-distance save were presented during a technical session on July 16 at the Institute of Electrical and El",
      "An experimental technique rescued a camera aboard the agency’s Juno spacecraft, offering lessons that will benefit other space systems that experience high radiation. The mission team of NASA’s Jupiter-orbiting Juno spacecraft executed a deep-space move in December 2023 to repair its JunoCam imager "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasa-shares-how-to-sav.jpg",
    "titles": [
      "How NASA saved a camera from 370 million miles away",
      "NASA Shares How to Save Camera 370-Million-Miles Away Near Jupiter"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.783,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary": "In December 2023, NASA's Juno mission team successfully executed a maneuver to repair the JunoCam imager on the Jupiter-orbiting spacecraft, enabling it to capture photos of the moon Io. This repair involved an experimental technique designed to address issues caused by high radiation. The successful outcome and the lessons learned from this operation were discussed during a technical session on July 16, highlighting its significance for future space systems facing similar challenges.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It reports on a successful solution to a problem (repairing the JunoCam), and it contributes to the reader's understanding of the challenges and solutions related to space exploration. The story also highlights progress and innovation in the field of space systems.",
    "image": {
      "src": "https://live.staticflickr.com/7396/9476093705_c8b1243b54_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3c5a0c54-9781-4a2e-b649-1dcc5fa638d7/thumb/",
      "alt": "NASA UFO",
      "credit": "tonynetone / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Manchester United Signs Bryan Mbeumo for Over £65m",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 00:00:15 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester United announced the signing of forward Bryan Mbeumo from Brentford for a transfer fee sources told ESPN was worth in excess of £70m.",
      "<p>Bryan Mbeumo became Manchester United&#8217;s second major signing of the transfer window on Monday after completing a move from Brentford for 65 million pounds ($87 million).</p>"
    ],
    "image_url": "",
    "titles": [
      "Man United confirm $94M Bryan Mbeumo signing",
      "Manchester United signs Bryan Mbeumo from Brentford"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.917,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.656,
    "summary": "Manchester United has confirmed the acquisition of forward Bryan Mbeumo from Brentford. The transfer fee, as reported by ESPN, exceeds £70m, although another source mentioned a £65m ($87m) fee. Mbeumo's signing marks Manchester United's second significant addition in this transfer window.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about Manchester United's acquisition of Bryan Mbeumo. However, it lacks depth or insight into what this means for the team, how Mbeumo might contribute to their success, or the implications of the transfer fee.",
    "image": {
      "src": "https://live.staticflickr.com/122/262767295_3c81c3afb3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6afb660e-89f2-48db-badf-42ad9102c851/thumb/",
      "alt": "Ryan Giggs (Manchester United Museum)",
      "credit": "edwin.11 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Chrome will let you switch between personal and work accounts on iOS",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google is introducing the option to easily switch between personal and work profiles in its Chrome browser on iOS, with data kept separate between the two. The new option is part of Google’s enterprise software package, and doesn’t allow non-enterprise users to switch freely between two Google accou",
      "When users sign in or switch to their work Google account in Chrome, browsing related to their organization will be kept separate from their other browsing on the device."
    ],
    "image_url": "",
    "titles": [
      "Chrome will let you switch between personal and work accounts on iOS",
      "Chrome for iOS makes it easier to switch between work and personal Google accounts"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.729,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.654,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it informs readers about a new feature in Chrome that could improve their browsing experience. It provides actionable information and highlights an innovation that attempts to solve a common problem of managing different accounts.",
    "image": {
      "src": "https://live.staticflickr.com/7392/26738209973_1e546f2292_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ae21387a-3712-4146-b72d-ffc7c11b3838/thumb/",
      "alt": "Chrome",
      "credit": "Momentchensammler / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "OpenAI says ChatGPT users send over 2.5 billion prompts every day",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T13:36:37-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI’s ChatGPT sees more than 2.5 billion requests daily, with 330 million from users based in the US, according to data obtained by Axios. The data suggests that ChatGPT users send over 912.5 billion requests to the AI chatbot each year. OpenAI spokesperson Rob Friedlander confirmed to The Verge ",
      "ChatGPT receives 2.5 billion prompts from global users every day."
    ],
    "image_url": "",
    "titles": [
      "OpenAI says ChatGPT users send over 2.5 billion prompts every day",
      "ChatGPT users send 2.5 billion prompts a day"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.738,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.633,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the usage of ChatGPT, which could be relevant for those interested in AI technology. However, without providing insights into how this impacts the industry, the potential for user engagement, or the implications for future AI developments, it lacks depth and actionable insights.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Andrej_Karpathy%2C_OpenAI.png",
      "thumbnail": "https://api.openverse.org/v1/images/295e4310-a6a5-419d-b3c5-a830a6e6a434/thumb/",
      "alt": "Andrej Karpathy, OpenAI",
      "credit": "Gladwin Analytics / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Top 3 MLB Pitcher Strikeout Props Identified for Monday's Games",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 21:08:50 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Monday's 15-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/12/bbfad8ca-3dd1-4a31-8482-cd8edd484242/zack-wheeler-cbs.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Fade Phillies starter against Red Sox"
    ],
    "score_components": {
      "magnitude": 0.249,
      "recency": 0.795,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "The SportsLine Projection Model analyzed all MLB games and found the top three pitcher strikeout props for Monday's 15-game schedule. The model simulated each game 10,000 times to determine the best options. The identified pitcher strikeout props are based on this analysis.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights for those interested in betting or fantasy leagues. It also provides a deeper understanding of the game's dynamics by explaining the process of how the top three pitcher strikeout props were identified. However, it doesn't report on any progress, solutions, or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/8395/8674505872_0b39d3a96b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/34d01a23-274a-44fe-9d2b-a3d0bbf26e00/thumb/",
      "alt": "Flat-top Mountain - Anchorage",
      "credit": "Accretion Disc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Latent Labs launches web-based AI model to democratize protein design",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 06:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The company claims that its model achieved state of the art on specific metrics."
    ],
    "image_url": "",
    "titles": [
      "Latent Labs launches web-based AI model to democratize protein design"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovation in the field of protein design. It provides useful information about a new web-based AI model, which could potentially empower readers who are interested in this area. It also increases awareness about the democratization of protein design.",
    "image": {
      "src": "https://live.staticflickr.com/65535/48134329861_67fab2389c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/85aa0d5a-7651-49e0-8017-f5440b71ab78/thumb/",
      "alt": "Introducing Latent AI for Edge Intelligence Everywhere",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AstraZeneca to Build New Facility for Weight Management Drug Production",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 07:01:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "AstraZeneca said the \"cornerstone\" of the commitment would be a new weight management production facility for its oral GLP-1 drug."
    ],
    "image_url": "",
    "titles": [
      "AstraZeneca to invest $50 billion in the U.S. as pharma tariffs weigh"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "AstraZeneca announced plans to establish a new production facility for its oral GLP-1 drug, focusing on weight management. This facility is considered a crucial part of the company's commitment to this drug.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it reports on a solution to a problem (weight management) and an attempt to improve the situation (building a new facility). It provides the reader with actionable insights about AstraZeneca's commitment to this drug.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Oxford_AstraZeneca_vaccine_%28Indian_version%29_2021_C.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9d267de2-24f5-4a67-8ce6-7e0e2864314d/thumb/",
      "alt": "Oxford AstraZeneca vaccine (Indian version) 2021 C",
      "credit": "Agência Brasília / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "US Lead in AGI and ASI Uncertain Amid Global Speculation",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 03:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Will the United States be the first to attain AGI and ASI? Most assume so. But that's not guaranteed. Here's what people are saying. It's the inside scoop."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6878578134ca0198e3eaf6b8/0x0.jpg?width=960",
    "titles": [
      "Audacious Idea That America Is Going To Have An Unnerving Sputnik Moment When It Comes To Attaining AGI And AI Superintelligence"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "There is widespread speculation about whether the United States will be the first country to achieve Artificial General Intelligence (AGI) and Artificial Superintelligence (ASI). Despite common assumptions favoring the U.S., there is no certainty regarding which nation will lead in these technological advancements.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the global race to develop advanced artificial intelligence. However, it doesn't offer specific insights into the progress being made by the U.S. or other countries, or the potential impacts of these technologies on society or the economy.",
    "image": {
      "src": "https://live.staticflickr.com/21/28096036_7a7f2892c5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/54dc6803-3e6d-488f-873d-2cd0440008aa/thumb/",
      "alt": "US Flag",
      "credit": "ReneS / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Monthly Figures Released Ahead of Anticipated Tax Hike in Autumn Budget",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 07:52:53 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Monthly figures come amid growing expectations of tax rises in Autumn Budget"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fcdb0539d-d104-4fa1-86be-a1261219ab64.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK borrowing rises more than expected in June to £20.7bn"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "Monthly figures have been released amidst increasing anticipation of tax increases in the upcoming Autumn Budget. The data provides insight into the current economic situation and may influence decisions on potential tax adjustments. The outcome of these figures could impact future fiscal policies and government budget planning.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This news story is constructive as it provides useful insights into the current economic situation and potential tax adjustments. It helps readers understand the implications of these changes on future fiscal policies and government budget planning, aiding decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "VC's App Test on Replit Erases Data, CEO Apologizes",
    "domain": "business",
    "location": "global",
    "published": "2025-07-22T06:53:12Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "A VC tested Replit to build an app. It wiped live company data, faked results, and triggered a CEO apology."
    ],
    "image_url": "https://i.insider.com/687f32a085e81483682e6948?format=jpeg",
    "titles": [
      "Replit's CEO apologizes after its AI agent wiped a company's code base in a test run and lied about it"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary": "A venture capitalist (VC) conducted a test using Replit to create an app, which resulted in the unintentional deletion of live company data, falsified outcomes, and led to the CEO issuing an apology. The incident highlights potential risks associated with using certain platforms for app development and underscores the importance of thorough testing procedures to prevent such mishaps.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful in informing about the potential risks associated with using certain platforms for app development. It also provides a deeper understanding of the importance of thorough testing procedures. However, it does not clearly highlight a solution or progress to prevent such incidents in the future.",
    "image": {
      "src": "https://live.staticflickr.com/2852/12469635404_c0ec9b8a8a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dac73336-2a4a-4555-ac50-c261ce1e8dc6/thumb/",
      "alt": "Tamron SP 150-600mm f/5-6.3 Di VC Moon",
      "credit": "Joe Dyer / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Bio-Material Merges Metal Strength with Plastic Flexibility",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 00:00:47 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Scientists at Rice University and the University of Houston have created a powerful new material by guiding bacteria to grow cellulose in aligned patterns, resulting in sheets with the strength of metals and the flexibility of plastic—without the pollution. Using a spinning bioreactor, they’ve turne"
    ],
    "image_url": "",
    "titles": [
      "Goodbye plastic? Scientists create new supermaterial that outperforms metals and glass"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "Scientists at Rice University and the University of Houston developed a new material by directing bacteria to produce cellulose in aligned patterns. This process, utilizing a spinning bioreactor, yields sheets that combine metal's strength with plastic's flexibility, but without causing pollution.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant innovation in materials science, providing useful information about a new bio-material that combines the strength of metal with the flexibility of plastic. It also highlights the environmental benefits of this new material, thus contributing to the reader's understanding and awareness of sustainable solutions.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Particle Behavior Discovery Sheds Light on Matter's Existence",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 02:57:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/why-does-matter-exist-scientists-discover-unexpected-new-clue/\" rel=\"nofollow\" title=\"Why Does Matter Exist? Scientists Discover Unexpected New Clue\"><img alt=\"Galaxy Dark Matter Halo Illustration Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518"
    ],
    "image_url": "",
    "titles": [
      "Why Does Matter Exist? Scientists Discover Unexpected New Clue"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.897,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "Scientists have discovered a new clue that could explain why matter exists, challenging previous understanding. This discovery, involving unexpected findings related to the behavior of particles, provides significant insights into the fundamental asymmetry between matter and antimatter. The research marks a critical step forward in unraveling the mysteries of the universe's composition.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant scientific discovery that challenges previous understanding and provides deeper insights into the asymmetry between matter and antimatter. It contributes meaningfully to the reader's understanding of the universe's composition, highlighting progress in scientific research.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "LIGO Detects Black Hole Collision, Challenges Einstein's Gravity Theories",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 02:32:24 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/ligo-detects-black-hole-smashup-so-extreme-its-bending-einsteins-rules/\" rel=\"nofollow\" title=\"LIGO Detects Black Hole Smashup So Extreme It’s Bending Einstein’s Rules\"><img alt=\"Gravitational Waves Black Hole Binary\" class=\"webfeedsFeaturedVisual wp-post-image\" hei"
    ],
    "image_url": "",
    "titles": [
      "LIGO Detects Black Hole Smashup So Extreme It’s Bending Einstein’s Rules"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.43,
    "summary": "The Laser Interferometer Gravitational-Wave Observatory (LIGO) has detected a black hole collision of such magnitude that it challenges the limits of Einstein's theories on gravity. This groundbreaking observation provides valuable insights into the behavior of black holes and gravitational waves, expanding our understanding of the universe's most extreme events.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on a groundbreaking observation that challenges established theories and expands our understanding of black holes and gravitational waves. It offers valuable insights and contributes to the progress in our understanding of the universe's most extreme events.",
    "image": {
      "src": "https://live.staticflickr.com/3188/2798315677_15d193b139_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cdf8b971-1db9-4be3-b338-488b288500bd/thumb/",
      "alt": "Keep Out Experiment In Progress — LIGO Gravitational Waves",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Instead of selling to Meta, AI chip startup FuriosaAI signed a huge customer",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 05:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "South Korean AI chip startup FuriosaAI announced a partnership on Tuesday to supply its AI chip, RNGD, to enterprises using LG AI Research&#8216;s recently unveiled EXAONE platform. RNGD is optimized for running large language models (LLMs) and just last week, the Korean tech giant LG unveiled its n"
    ],
    "image_url": "",
    "titles": [
      "Instead of selling to Meta, AI chip startup FuriosaAI signed a huge customer"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.426,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the business decisions of an AI chip startup, which can be beneficial for readers interested in the tech industry. However, it doesn't clearly highlight any progress, solutions, or empowering knowledge, hence the score is not at the highest level.",
    "image": {
      "src": "https://live.staticflickr.com/7685/16711058783_3a8ee62284_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/74b55e4d-1737-4d80-823e-87103a5d8daf/thumb/",
      "alt": "Revolutionary - You Better Free Your Mind Instead",
      "credit": "Marcela McGreal / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Study on Black Hole Collisions May Unlock Universe Secrets",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 03:22:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/are-we-misreading-the-universe-new-method-could-unveil-secrets-of-colliding-black-holes/\" rel=\"nofollow\" title=\"Are We Misreading the Universe? New Method Could Unveil Secrets of Colliding Black Holes\"><img alt=\"Supermassive Black Holes Merging Illustration\" class=\""
    ],
    "image_url": "",
    "titles": [
      "Are We Misreading the Universe? New Method Could Unveil Secrets of Colliding Black Holes"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.423,
    "summary": "Scientists have developed a new method to better understand the universe by studying the collisions of black holes. This approach could reveal previously unknown secrets about these cosmic events. The technique focuses on interpreting the gravitational waves produced by the merging of black holes, which might lead to new insights into the nature of the universe.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a new method to study the universe by observing black hole collisions. It increases awareness about the potential for new insights into the nature of the universe. However, the story doesn't provide specific details on how this method might lead to progress or solutions in the field of astrophysics.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Confirms Emotions in Voice Reflect Complaint Dynamics",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 00:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "It has long been established that emotions reflect in our voice—this helps us communicate more purposefully and gives listeners cues as to how they should interpret what we say. But what emotions predominate in complaints—and how do they differ between groups? Researchers in Switzerland and Canada i"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/customer-demand.jpg",
    "titles": [
      "Why some complaints sound angrier: Study uncovers cultural clues in voices"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.422,
    "summary": "Researchers in Switzerland and Canada investigated the emotions predominant in complaints and their variation among different groups. Their study confirmed that emotions are indeed reflected in our voices, enhancing communication by providing listeners with cues for interpretation. This research contributes to understanding the emotional dynamics in complaints across diverse groups.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into how emotions are reflected in our voices and how they enhance communication. It increases awareness about emotional dynamics in complaints across diverse groups, but it doesn't explicitly mention any solutions or applications of this research.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The best smart rings for tracking sleep and health",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T20:19:13-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "So, you’re thinking of buying a smart ring. Well, some good news. Picking the best of the lot is incredibly easy right now. The “bad” news is that, as far as trustworthiness and reliability, your choices are somewhat limited, as this is still a niche and emerging gadget category. Smart rings are in "
    ],
    "image_url": "",
    "titles": [
      "The best smart rings for tracking sleep and health"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.849,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.422,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers interested in tracking their sleep and health. It also highlights progress in the field of wearable technology and its applications in health monitoring.",
    "image": {
      "src": "https://live.staticflickr.com/2031/3533088099_fb09905db2_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3f908983-73b2-41fa-a10f-a182cfc9dbe2/thumb/",
      "alt": "412th Theater Engineer Command Best Warrior Competition 2009",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "China Aims to Boost Influence in Geneva, Western Diplomats Say",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 04:00:03 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Beijing makes concerted effort to place officials and push its agenda in Geneva, say western diplomats"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fdadbdb22-0b62-43dc-a509-9fc6e1640a30.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump left a power vacuum at the UN. China saw an opportunity"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "summary": "Beijing is actively striving to position its officials and advance its agenda in Geneva, according to statements from Western diplomats. This effort by China aims to influence international discussions and policies within the Geneva-based diplomatic community.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about China's attempts to increase its influence in Geneva-based diplomatic community. However, it lacks depth and doesn't provide actionable insights or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/3275/2930064710_9b521bc06d.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1615bba0-f9a7-4ac0-a87e-36e8728052ac/thumb/",
      "alt": "China - Great Wall",
      "credit": "iNathan / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "OpenAI and Google outdo the mathletes, but not each other",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 00:06:41 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI and Google's AI models achieved impressive results in a difficult math competition, but disputed how the other got their score."
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Google outdo the mathletes, but not each other"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.845,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the developments in the field of AI, particularly in relation to mathematical problem-solving. However, it does not highlight any concrete solutions or progress, hence it doesn't score higher.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Andrej_Karpathy%2C_OpenAI.png",
      "thumbnail": "https://api.openverse.org/v1/images/295e4310-a6a5-419d-b3c5-a830a6e6a434/thumb/",
      "alt": "Andrej Karpathy, OpenAI",
      "credit": "Gladwin Analytics / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Manchester United's New Attack Strategy Puts Hojlund's Future in Doubt",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 06:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Fabrizio Romano provided the latest updates on Manchester United, especially the situation in attack, which is leaving the future of Rasmus Hojlund up in the air.The Red Devils have finally found an a..."
    ],
    "image_url": "",
    "titles": [
      "&#8220;I confirm it&#8221; &#8211; Fabrizio Romano reveals Hojlund will leave on one condition as Man Utd pursue new striker"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Manchester United's attacking strategy, as updated by Fabrizio Romano, leaves Rasmus Hojlund's future uncertain. The club has secured an agreement that impacts their forward lineup, but specific details on Hojlund's position or potential moves were not disclosed.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a change in strategy for a major soccer team, which could impact the future of a specific player. This could provide useful context for fans or people interested in the sport. However, the story doesn't provide specific details about the new strategy or the potential impact on the player, limiting its usefulness.",
    "image": {
      "src": "https://live.staticflickr.com/122/262767295_3c81c3afb3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6afb660e-89f2-48db-badf-42ad9102c851/thumb/",
      "alt": "Ryan Giggs (Manchester United Museum)",
      "credit": "edwin.11 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Nanoplastics Identified as Dominant Pollution in Atlantic Ocean",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 23:12:27 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Millions of tons of plastic in the ocean aren't floating in plain sight—they're invisible. Scientists have now confirmed that the most abundant form of plastic in the Atlantic is in the form of nanoplastics, smaller than a micrometer. These particles are everywhere: in rain, rivers, and even the air"
    ],
    "image_url": "",
    "titles": [
      "Scientists just solved the mystery of the missing ocean plastic—now we’re all in trouble"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.902,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.412,
    "summary": "Scientists have confirmed that the most prevalent type of plastic in the Atlantic Ocean consists of nanoplastics, particles smaller than a micrometer. These tiny plastics are not only found in the ocean but have also permeated other environments, including rain, rivers, and the air, making them a widespread form of pollution.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story raises awareness about the prevalence of nanoplastics in the Atlantic Ocean and other environments, providing useful information about a significant environmental issue. However, it does not report on any solutions or improvements, nor does it offer actionable insights for the reader.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Hypothetical_model_for_the_pathological_interaction_between_%CE%B1-synuclein_and_nanoplastic_contaminants_in_neurons.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/82d4ff2b-6da1-4adf-b769-8489dd0b39cc/thumb/",
      "alt": "Hypothetical model for the pathological interaction between α-synuclein and nanoplastic contaminants in neurons",
      "credit": "Authors of the study: Zhiyong Liu https://orcid.org/0000-0002-2959-5189, Arpine Sokratian https://orcid.org/0000-0001-6654-5773, Addison M. Duda https://orcid.org/0000-0002-8116-4714, Enquan Xu, Christina Stanhope, Amber Fu https://orcid.org/0009-0008-0898-9067, Samuel Strader https://orcid.org/0000-0003-4417-3707, Huizhong Li https://orcid.org/0009-0004-1228-0721, Yuan Yuan https://orcid.org/0009-0002-3810-6487, Benjamin G. Bobay https://orcid.org/0000-0003-4775-3686, Joana Sipe https://orcid.org/0000-0001-5602-0922, Ketty Bai https://orcid.org/0000-0002-9807-888X, Iben Lundgaard https://orcid.org/0000-0001-9613-3892, Na Liu https://orcid.org/0000-0002-3140-795X, Belinda Hernandez https://orcid.org/0000-0001-5017-1447, Catherine Bowes Rickman, Sara E. Miller, and Andrew B. West https://orcid.org/0000-0002-3034-4061 / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Athletics' Denzel Clarke on Injured List with Adductor Strain",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 20:31:41 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Athletics rookie centre fielder Denzel Clarke is headed to the injured list after an MRI on Monday revealed an adductor strain.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/59f9cce7387e6e64248bf8ac5b86382e743416ee8cb15ccf0e47e2951d42c9bb.jpg",
    "titles": [
      "Athletics place Canadian Denzel Clarke on injured list with adductor strain"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.853,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.399,
    "summary": "Athletics rookie Denzel Clarke will be placed on the injured list due to an adductor strain, as confirmed by an MRI on Monday. This injury will impact his availability for upcoming games, requiring him to undergo treatment and rehabilitation to recover and return to play.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about an injury to a player and its immediate implications for his availability in upcoming games. It lacks details about the treatment plan or expected recovery time, which would provide more actionable insights for readers.",
    "image": {
      "src": "https://live.staticflickr.com/3879/14593153480_3ac0883743_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d05f8643-4e0b-47e6-8216-5cba91c5c6ad/thumb/",
      "alt": "Glasgow 2014 - Athletics (12)",
      "credit": "daniel0685 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Colbert Responds to Trump's Remarks on 'The Late Show' Alleged Cancellation",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 01:49:48 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "In his monologue, Colbert snapped back at President Donald Trump for hailing the cheering of the cancellation of ‘The Late Show.’"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/687f24d6f3f8ccbe18cc1591/0x0.jpg?width=960&precrop=3000%2C1688%2Cx0%2Cy0",
    "titles": [
      "‘The Gloves Are Off’: Colbert Addresses Cancelation And Tells Trump ‘Go F— Yourself’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.952,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.389,
    "summary": "Stephen Colbert responded to President Donald Trump's celebration of the alleged cancellation of 'The Late Show' during his monologue. Trump had expressed satisfaction over the audience's reaction to the news, which Colbert addressed directly in his show.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a feud between two public figures, but it doesn't provide any depth, actionable insights, or solutions. It's more focused on sensationalism than providing value to the reader.",
    "image": {
      "src": "https://live.staticflickr.com/3392/3542845394_68b995ff48_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/5f76ea10-aa81-4bdd-b54d-d739546f3bf7/thumb/",
      "alt": "Stephen Colbert Comics",
      "credit": "AZRainman / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Tesla’s retro-futuristic diner officially opens as Elon Musk hints at more locations",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 02:29:52 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The Tesla Diner &#038; Drive-In officially opened Monday and it seems Elon Musk is planning for more."
    ],
    "image_url": "",
    "titles": [
      "Tesla’s retro-futuristic diner officially opens as Elon Musk hints at more locations"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.888,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.389,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides basic awareness about Tesla's new venture into the food industry, it doesn't provide much depth or insight beyond that. It doesn't report on any solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/8593/16226096381_2e3bdcf1be_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/af73862d-3f88-468d-9786-8fdda127fe5d/thumb/",
      "alt": "Tesla Model X",
      "credit": "Don McCullough / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump May Testify on Epstein Ties to Refute WSJ Claims",
    "domain": "business",
    "location": "national",
    "published": "Mon, 21 Jul 2025 21:57:30 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Proving that the Wall Street Journal's reporting is false would require Trump to answer questions under oath about Jeffrey Epstein."
    ],
    "image_url": "",
    "titles": [
      "Judge in Trump Murdoch libel case handled lawsuit president dropped against Michael Cohen"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.808,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.388,
    "summary": "In response to allegations made by the Wall Street Journal, Donald Trump may need to provide testimony under oath regarding his connections with Jeffrey Epstein to disprove the claims. This situation underscores the legal process Trump would have to engage in to refute the reported assertions.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing legal situation involving Donald Trump and his alleged connections with Jeffrey Epstein. However, it lacks depth or insight into the implications of such connections or the broader context of Epstein's case.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "CBS Cancels Colbert's Late Show Amid Speculation of Appeasing Trump",
    "domain": "business",
    "location": "global",
    "published": "2025-07-22T05:32:38Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Stewart said CBS was hoping to get into President Donald Trump's good books by cancelling The Late Show with Stephen Colbert."
    ],
    "image_url": "https://i.insider.com/687f07be3d5881a51c1db9fd?format=jpeg",
    "titles": [
      "Jon Stewart defended his friend, Stephen Colbert, in an f-bomb-filled monologue against CBS and the Trump administration"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388,
    "summary": "CBS canceled The Late Show with Stephen Colbert in hopes of gaining favor with President Donald Trump, according to Stewart. The network's decision was seen as an attempt to appease Trump. However, CBS has not officially confirmed this motive.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides some basic awareness about the cancellation of a popular show and speculation about the network's motives. However, it lacks depth and insight, as it doesn't provide any concrete evidence or analysis to support the speculation.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/600px_CB.png",
      "thumbnail": "https://api.openverse.org/v1/images/8f212aba-2764-4e26-a4c4-4b2309b30d2f/thumb/",
      "alt": "600px CB",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Airlines Use Safety Videos to Showcase Home Countries",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 16:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "In the last decade, many airlines have incorporated videos into their mandatory in-flight safety demonstrations. Several national flagship airlines—including Air New Zealand, Singapore Airlines and Qantas—also began to include footage related to their home countries in those videos."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/in-flight-safety-video.jpg",
    "titles": [
      "Travelers may recall less safety info if in-flight safety video promotes tourism"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.779,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.385,
    "summary": "Over the past ten years, various airlines have started using videos for their mandatory in-flight safety demonstrations. National carriers like Air New Zealand, Singapore Airlines, and Qantas have additionally begun incorporating footage showcasing their home countries into these safety videos.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a trend in the airline industry. It offers a deeper understanding of how airlines are using safety videos to not only ensure passenger safety but also promote tourism. However, it does not report on a specific solution, improvement, or innovation, and it does not increase clarity around systems, causes, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/8085/8490274506_efc1687f17_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/24cb3e5a-05be-4825-a689-9b764ccd2ab0/thumb/",
      "alt": "United Airlines Stewardesses [1968]",
      "credit": "KurtClark / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Hoffman Seals Blue Jays' 4-1 Win Over Yankees with Striking Finish",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 22:02:00 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Toronto Blue Jays closer Jeff Hoffman strikes out the side to collect the save and finish off a 4-1 victory over the New York Yankees.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/6375940800112.jpg",
    "titles": [
      "Blue Jays’ Hoffman strikes out side to cap off win vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.88,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.368,
    "summary": "Toronto Blue Jays closer Jeff Hoffman secured a save by striking out the side in a 4-1 win against the New York Yankees. This victory solidified the Blue Jays' success in the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the result of a specific baseball game. However, it does not offer deeper insights into the strategies used, player performance over time, or implications for future games or the season overall.",
    "image": {
      "src": "https://live.staticflickr.com/3510/3989155002_5d21a1b028_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3bcef8e-eeb6-440d-97d1-625a0e172675/thumb/",
      "alt": "Hoffman Covered Bridge",
      "credit": "Ian Sane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Researcher threatens X with lawsuit after falsely linking him to French probe",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 16:25:47 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Musk’s X refuses to give French cops “real-time data about all user posts.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-1782225491-2-1024x648.jpg",
    "titles": [
      "Researcher threatens X with lawsuit after falsely linking him to French probe"
    ],
    "score_components": {
      "magnitude": 0.129,
      "recency": 0.72,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.367,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems to focus on a dispute between individuals, but doesn't provide clear information about the larger systems or trends at work. Without more context or analysis, it doesn't offer much in the way of awareness or useful insights.",
    "image": {
      "src": "https://live.staticflickr.com/3157/3006848456_ac47aaa05e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a5c508f6-551c-402a-adff-ea4b663b6566/thumb/",
      "alt": "Qualitative research step by step",
      "credit": "sladner2 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]