[
  {
    "title": "The noise battle at the heart of Real Madrid's stadium",
    "domain": "general",
    "location": "global",
    "published": "Fri, 30 May 2025 23:58:31 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "It hosted 65,000 Taylor Swift fans last year but the Bernabéu stadium has been silent since September."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/83cf/live/8d84ee10-3653-11f0-8519-3b5a01ebe413.jpg",
    "titles": [
      "The noise battle at the heart of Real Madrid's stadium"
    ],
    "summary": "The Bernabéu stadium, known for hosting 65,000 Taylor Swift fans in the previous year, has remained silent since September, with no events taking place since then.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the current state of the Bernabéu stadium, but it doesn't offer deeper understanding or actionable insights. It also doesn't report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.525,
    "normalized_score": 0.96
  },
  {
    "title": "Will Charleston’s Climate Lawsuit Survive the Week?",
    "domain": "general",
    "location": "global",
    "published": "Fri, 30 May 2025 23:56:49 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The city is suing oil companies over global warming. Trump says lawsuits like these threaten national security. The judge wants to hear what both sides think."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/26/arts/charlston-floods/charlston-floods-mediumSquareAt3X.png",
    "titles": [
      "Will Charleston’s Climate Lawsuit Survive the Week?"
    ],
    "summary": "The city has filed a lawsuit against oil companies, attributing responsibility for global warming to their operations. In response, former President Donald Trump has voiced concerns that such lawsuits pose a threat to national security. The case is currently progressing through the legal system, with a judge expressing interest in hearing arguments from both the city and the oil companies involved.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant ongoing lawsuit, providing context about the city's efforts to hold oil companies accountable for global warming. However, it doesn't provide much detail on the potential impacts of the lawsuit or potential solutions to the climate crisis.",
    "score_components": {
      "magnitude": 0.559,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.633,
    "normalized_score": 5.92
  },
  {
    "title": "A Court Debates Whether a Climate Lawsuit Threatens National Security",
    "domain": "general",
    "location": "global",
    "published": "Fri, 30 May 2025 23:53:21 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The judge asked lawyers how a suit by Charleston, S.C., claiming oil companies misled people about climate risks, might be affected by a Trump executive order blasting cases like these."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/30/multimedia/30cli-sc-lawsuit-01-fpwt/30cli-sc-lawsuit-01-fpwt-mediumSquareAt3X.jpg",
    "titles": [
      "A Court Debates Whether a Climate Lawsuit Threatens National Security"
    ],
    "summary": "A judge inquired how a lawsuit filed by Charleston, South Carolina, against oil companies for allegedly misleading the public about climate change risks, could be influenced by a Trump-era executive order that criticizes similar legal actions. This query highlights the potential impact of federal policies on local climate litigation.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about how federal policies can influence local climate litigation. It increases clarity around the system and causes, even if it doesn't report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.559,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.643,
    "normalized_score": 6.38
  },
  {
    "title": "US to double tariffs on steel and aluminium imports to 50%, Trump says",
    "domain": "general",
    "location": "global",
    "published": "Fri, 30 May 2025 23:46:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "President Donald Trump says the increase in tariffs will protect America's steel industry, along with an expected partnership with Japan."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/028d/live/9bad59a0-3da6-11f0-90c3-e75a1d5507f9.jpg",
    "titles": [
      "US to double tariffs on steel and aluminium imports to 50%, Trump says"
    ],
    "summary": "President Donald Trump announced an increase in tariffs aimed at protecting the U.S. steel industry. Additionally, he anticipates a partnership with Japan to further bolster this sector.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant policy change, helping readers understand the current economic landscape and potential impacts on the steel industry. However, it does not go into detail about the reasons for the tariff increase or potential solutions to the challenges faced by the industry.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.58,
    "normalized_score": 3.49
  },
  {
    "title": "PBS sues Trump for stripping its funds",
    "domain": "general",
    "location": "global",
    "published": "Fri, 30 May 2025 23:43:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "snippets": [
      "The lawsuit came three days after a similar case by NPR, which also saw its funds cut."
    ],
    "image_url": "",
    "titles": [
      "PBS sues Trump for stripping its funds"
    ],
    "summary": "A lawsuit was filed three days following a similar legal action taken by NPR, both cases arising after their funding was reduced.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story raises awareness about a conflict between PBS and the Trump administration, it does not provide much depth or insight into the reasons for the funding cuts, the potential impacts on PBS programming, or the legal arguments being made in the lawsuit.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.552,
    "normalized_score": 2.2
  },
  {
    "title": "Chris Mannix: In trade pursuits, Ime Udoka ‘a real asset’ for Rockets",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 30 May 2025 23:49:18 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Chris Mannix on the NBA’s 2025 offseason trade market: “Every player wants to play for Ime Udoka. That’s a real asset that the Rockets have.”"
    ],
    "image_url": "",
    "titles": [
      "Chris Mannix: In trade pursuits, Ime Udoka ‘a real asset’ for Rockets"
    ],
    "summary": "In the NBA's 2025 offseason trade market, Chris Mannix highlighted the significant appeal of Ime Udoka, stating that every player wants to play for him. This sentiment establishes Udoka as a valuable asset for the Rockets, potentially influencing player trades and team dynamics.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful insights into the dynamics of the NBA trade market and the role of Ime Udoka in it. It helps readers understand why Udoka is considered a valuable asset, potentially aiding their understanding of future trades and team decisions. However, it does not report on any specific solutions or improvements being made in the Rockets organization.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.554,
    "normalized_score": 2.29
  },
  {
    "title": "Oregon State Baseball: Corvallis Regional Primer",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 30 May 2025 23:47:53 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "PROMO: Join BeaversEdge.com and get 30 DAYS FREE!With the No. 8 national seed Oregon State baseball team (42-12-1) set to host the Corvallis Regional and open play against St. Mary's (35-24) on Friday evening, BeaversEdge previews the field!MORE: OSU Commit Schedules B12 Visit | WATCH: Beavers Preview Corvallis Regional & MORE | Football OV Central | Beavers Earn No."
    ],
    "image_url": "",
    "titles": [
      "Oregon State Baseball: Corvallis Regional Primer"
    ],
    "summary": "The Oregon State baseball team, with a record of 42-12-1 and holding the No. 8 national seed, is set to host the Corvallis Regional, beginning their play against St. Mary's, which has a 35-24 record, on Friday evening. This event is part of the broader coverage provided by BeaversEdge.com, which also includes a preview of the Corvallis Regional, information on an OSU commit's visit to B12, and more updates on football and other sports achievements by the Beavers.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the upcoming regional baseball tournament, including the teams involved and their records. However, it doesn't offer insights into strategies, improvements, or solutions, nor does it increase awareness about broader trends or impacts.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.534,
    "normalized_score": 1.38
  },
  {
    "title": "D-backs manager Torey Lovullo turns to his 92-year-old mom for advice amid team's slump",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 30 May 2025 23:45:03 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "With his Arizona Diamondbacks mired in an early-season funk, manager Torey Lovullo knows where to go for advice on how to get things turned around.  “She said throw out the analytics and trust your gut,” Lovullo said, grinning.  A season of sky-high expectations is off to a slow start for the D-backs, who have lost seven of eight heading into Friday night's game against the Washington Nationals."
    ],
    "image_url": "",
    "titles": [
      "D-backs manager Torey Lovullo turns to his 92-year-old mom for advice amid team's slump"
    ],
    "summary": "Arizona Diamondbacks manager Torey Lovullo, facing a challenging start to the season with the team losing seven of eight games, has decided to shift strategies. Amid high expectations, Lovullo is considering less reliance on analytics and more on intuition to improve the team's performance. This approach comes as the Diamondbacks prepare for their upcoming game against the Washington Nationals, aiming to break their losing streak and turn the season around.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insight into the management strategies of the Arizona Diamondbacks during a challenging time, potentially aiding readers' understanding of how sports teams adapt to adversity. However, it falls short on reporting on concrete solutions or progress, and doesn't significantly increase awareness about broader systems or trends.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.544,
    "normalized_score": 1.83
  },
  {
    "title": "Alex Hernandez drives in 6 with 2 home runs and Georgia Tech tops Western Kentucky 9-2",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 30 May 2025 23:44:14 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [],
    "image_url": "",
    "titles": [
      "Alex Hernandez drives in 6 with 2 home runs and Georgia Tech tops Western Kentucky 9-2"
    ],
    "summary": "I'm sorry, but you haven't provided any specific news content for me to summarize. Could you please share the details of the news story you're interested in?",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without more context or information, it's hard to evaluate this story. Based on the title alone, it seems to offer basic awareness of a sports result, but lacks depth, insight, or broader relevance.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "UCLA baseball crushes Fresno State behind 22-hit barrage in NCAA regional opener",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 30 May 2025 23:43:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "UCLA baseball posts season-highs for runs and hits in a dominant, 19-4 win over Fresno State to open its NCAA tournament slate."
    ],
    "image_url": "",
    "titles": [
      "UCLA baseball crushes Fresno State behind 22-hit barrage in NCAA regional opener"
    ],
    "summary": "UCLA's baseball team achieved season-highs in runs and hits during a commanding 19-4 victory over Fresno State, marking the start of their NCAA tournament campaign.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a sports event but does not offer much depth or insight into the game's strategies, players' performance, or implications for future matches.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "Stablecoins stole the show at Bitcoin 2025 — here's what the major players said",
    "domain": "business",
    "location": "national",
    "published": "Fri, 30 May 2025 23:18:05 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Stablecoins stole the spotlight at Bitcoin 2025, as U.S. officials backed new legislation to enshrine digital dollars."
    ],
    "image_url": "",
    "titles": [
      "Stablecoins stole the show at Bitcoin 2025 — here's what the major players said"
    ],
    "summary": "At the Bitcoin 2025 conference, stablecoins were a major focus, following the announcement that U.S. officials support new legislation aimed at officially recognizing digital dollars. This move indicates a significant step towards integrating stablecoins into the U.S. financial system.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story informs readers about the increasing importance of stablecoins in the financial system and the U.S. government's recognition of digital dollars. It provides useful context about the evolving landscape of cryptocurrency.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.57,
    "normalized_score": 3.03
  },
  {
    "title": "$TRUMP and other meme coins won't be protected by SEC, Commissioner Hester Peirce says",
    "domain": "business",
    "location": "national",
    "published": "Fri, 30 May 2025 23:17:35 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "SEC Commissioner Hester Peirce said investors shouldn’t expect protection when it comes to meme coins as the agency pulls back from aggressive enforcement."
    ],
    "image_url": "",
    "titles": [
      "$TRUMP and other meme coins won't be protected by SEC, Commissioner Hester Peirce says"
    ],
    "summary": "SEC Commissioner Hester Peirce stated that investors should not anticipate protection regarding meme coins, indicating a shift in the agency's approach to less aggressive enforcement in this area.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This article provides useful insight into the SEC's stance on meme coins, which could inform investors' decisions. It increases clarity around the regulatory environment for these types of cryptocurrencies.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.58,
    "normalized_score": 3.49
  },
  {
    "title": "Trump says U.S. will double steel tariffs to 50%",
    "domain": "business",
    "location": "national",
    "published": "Fri, 30 May 2025 23:04:16 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "CNBC",
      "Investopedia"
    ],
    "snippets": [
      "President Trump will hold a rally Friday at a U.S. Steel plant near Pittsburgh, one week after signaling he had cleared a merger with Japan's Nippon Steel.",
      "US president escalates global trade war days after a court ruled some of his levies illegal",
      "<figure><img alt=\"Photo by SAUL LOEB / AFP via Getty Images President Donald Trump meets with workers at a factory in West Mifflin, Pennsylvania, on May 30.\" src=\"https://www.investopedia.com/thmb/uep-YZu23pfWV2h-8za1yRcSWQ0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217155802-3523ae33bfec4fd29c1e6b8acca174be.jpg\" title=\"a\" /><figcaption><i><p>Photo by SAUL LOEB / AFP via Getty Images</p> President Donald Trump meets with workers at a factory in West Mifflin, Pennsylvania, on May 30.</i></figcaption></figure><p>On Friday, President Donald Trump said he plans to double steel tariffs to 50%.</p><p>Speaking at U.S. Steel’s (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;X\">X</a>) Irvin Works in West Mifflin, Pa., the president said the move would help protect American steelworkers and “further secure the steel industry.”<span class=\"ql-inline-citation\"></span></p><p>Since March 12, 25% tariffs on steel imports <a href=\"https://www.investopedia.com/trump-imposes-more-tariffs-this-time-on-steel-and-aluminum-8789116\">have been in place.</a> The U.S. imports roughly 25 million tons of steel each year, which accounts for 23% of all the <a href=\"https://www.investopedia.com/here-s-where-prices-could-rise-under-steel-aluminum-tariffs-9429666\">steel used domestically</a>. Canada, Mexico, Brazil and South Korea <a class=\"pseudoStyle\" href=\"https://www.investopedia.com/steel-aluminum-company-stocks-jump-as-trump-plans-25-percent-tariffs-on-imports-8788801\">sending the most steel</a> to the U.S.</p><p>The announcement came after Trump <a href=\"https://www.investopedia.com/us-steel-stock-soars-as-trump-oks-nippon-steel-partnership-11741309\">gave the green light</a> last week to a \"partnership\" between U.S. Steel and Nippon Steel. Shares of U.S. Steel have surged 40% since Trump last month <a href=\"https://www.investopedia.com/us-steel-stock-jumps-as-trump-orders-review-of-biden-blocked-usd14-1b-nippon-deal-11710295\">ordered a review</a> of Nippon Steel's proposed takeover bid.</p><p>It also came in the wake of a flurry of legal actions in cases that <a href=\"https://www.investopedia.com/court-rules-trump-s-tariffs-can-stay-on-for-now-11744787\">challenged some of Trump's tariffs</a>. A court initially blocked the order, but the administration was given a reprieve while further appeals work their way through the court. The block would not have applied to the steel tariffs.</p><p>This isn't the first time Trump has imposed steel tariffs. In his first term, he imposed a 25% tariff on steel. Trump has said tariffs would give U.S. steel producers a leg up and prevent job losses in the industry. Economists and researchers found that those tariffs had a <a href=\"https://www.investopedia.com/metal-tariffs-cost-at-least-75-times-more-jobs-than-they-saved-8789838\">mixed effect on jobs</a>, as steel companies hired more workers but companies that use steel hired fewer people.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump says U.S. will double steel tariffs to 50%",
      "Trump says he will double tariffs on US steel imports to 50%",
      "Trump Says He Will Double Steel Tariffs"
    ],
    "summary": "President Trump announced plans to double steel tariffs to 50% during a rally at U.S. Steel's Irvin Works in West Mifflin, Pennsylvania. This move, aimed at protecting American steelworkers and securing the steel industry, follows a 25% tariff on steel imports instituted since March 12. The announcement comes after Trump approved a partnership between U.S. Steel and Nippon Steel, leading to a 40% surge in U.S. Steel shares. The decision occurs amidst legal challenges to some of Trump's tariffs, though these challenges did not affect the steel tariffs specifically. Trump's previous imposition o",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides a useful context about the decision to double steel tariffs, its potential impact on the American steel industry, and the legal challenges to some of Trump's tariffs. However, it does not offer solutions or discuss the broader impacts on the U.S. economy or international trade relations.",
    "score_components": {
      "magnitude": 0.59,
      "recency": 0.986,
      "consensus": 0.6,
      "constructiveness": 0.7
    },
    "score": 0.722,
    "normalized_score": 10.0
  },
  {
    "title": "Trump doubles steel tariffs to 50%",
    "domain": "business",
    "location": "global",
    "published": "Fri, 30 May 2025 22:49:50 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Trump said U.S. Steel will stay an American company under a deal for Japan-based Nippon to invest in the iconic American steelmaker."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25150786173171-e1748645317769.jpg?w=2048",
    "titles": [
      "Trump doubles steel tariffs to 50%"
    ],
    "summary": "Former President Donald Trump announced that U.S. Steel, a historic American steelmaking company, will remain American following an investment deal with Nippon, a corporation based in Japan. This agreement aims to bolster U.S. Steel's position while maintaining its American identity.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides basic awareness about the investment deal between U.S. Steel and Nippon and its aim to maintain U.S. Steel's American identity. However, it lacks depth and insight into the potential implications of this deal for the steel industry and the U.S. economy.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.983,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.567,
    "normalized_score": 2.89
  },
  {
    "title": "PBS sues Trump over executive order to cut funding",
    "domain": "business",
    "location": "national",
    "published": "Fri, 30 May 2025 22:11:59 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "PBS sued President Donald Trump to block his effort to cut off federal funding for the public broadcaster."
    ],
    "image_url": "",
    "titles": [
      "PBS sues Trump over executive order to cut funding"
    ],
    "summary": "PBS filed a lawsuit against President Donald Trump to prevent him from eliminating federal funding for the broadcaster. This legal action represents PBS's response to Trump's efforts to reduce its financial support from the government. The current status or outcome of the lawsuit was not provided in the information available.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about PBS's lawsuit against President Trump's efforts to cut its federal funding. However, it lacks depth or insight into the potential implications of this lawsuit for PBS and public broadcasting in general, and does not provide any information about the current status or outcome of the lawsuit.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.974,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.546,
    "normalized_score": 1.93
  },
  {
    "title": "International Research Team Builds World’s Most Efficient Organic Solar Cell",
    "domain": "science",
    "location": "global",
    "published": "Fri, 30 May 2025 19:50:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/international-research-team-builds-worlds-most-efficient-organic-solar-cell/\" rel=\"nofollow\" title=\"International Research Team Builds World’s Most Efficient Organic Solar Cell\"><img alt=\"Advanced Solar Cells\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Advanced-Solar-Cells-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists created a safer, high-efficiency all-organic solar cell using a new electrode and lamination technique, achieving 8.7% power conversion, more than double past models. As global initiatives to mitigate climate change accelerate, the demand for solar energy continues to rise. However, conventional silicon-based solar panels, which currently dominate the market, contain a variety of hazardous [...]"
    ],
    "image_url": "",
    "titles": [
      "International Research Team Builds World’s Most Efficient Organic Solar Cell"
    ],
    "summary": "An international research team has developed the world's most efficient all-organic solar cell, reaching a power conversion efficiency of 8.7%, more than doubling the efficiency of previous models. This advancement was made possible through the use of a new electrode and lamination technique. This development is significant as it offers a safer alternative to conventional silicon-based solar panels, which contain hazardous materials. The breakthrough could accelerate the adoption of solar energy in global efforts to combat climate change.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive because it reports on a significant innovation in the field of renewable energy. It provides useful information about the new technology and its implications for the environment and energy sector. The story also highlights the progress made in improving the efficiency of organic solar cells, contributing to the reader's understanding of ongoing efforts to combat climate change.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.568,
    "normalized_score": 2.94
  },
  {
    "title": "Blink, Predict, Smash: MIT’s 42 MPH Ping Pong Bot Is Freakishly Fast",
    "domain": "science",
    "location": "global",
    "published": "Fri, 30 May 2025 19:17:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/blink-predict-smash-mits-42-mph-ping-pong-bot-is-freakishly-fast/\" rel=\"nofollow\" title=\"Blink, Predict, Smash: MIT’s 42 MPH Ping Pong Bot Is Freakishly Fast\"><img alt=\"Ping Pong Playing Robot Performing Top Spin\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"390\" src=\"https://scitechdaily.com/images/Ping-Pong-Playing-Robot-Performing-Top-Spin-777x390.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>MIT engineers have created a lightning-fast ping pong robot that not only returns shots with human-like speed and precision, but also mimics spin and aiming strategies. Built from components of a humanoid robot and powered by advanced prediction algorithms, it boasts an 88% success rate in testing. Now, researchers are working to make it more [...]"
    ],
    "image_url": "",
    "titles": [
      "Blink, Predict, Smash: MIT’s 42 MPH Ping Pong Bot Is Freakishly Fast"
    ],
    "summary": "MIT engineers developed a ping pong robot capable of hitting speeds up to 42 MPH, with an 88% success rate in returning shots. This robot, built from humanoid components and powered by advanced prediction algorithms, can replicate human playing techniques, including spin and aiming strategies. The team is focused on further enhancements.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in robotics and AI, providing insights into the capabilities of the technology. However, it does not delve into potential applications or implications of such technology beyond the realm of ping pong, limiting its usefulness and progress score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.933,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.545,
    "normalized_score": 1.88
  },
  {
    "title": "Any wall can be turned into a camera to see around corners",
    "domain": "science",
    "location": "global",
    "published": "Fri, 30 May 2025 15:00:09 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Researchers have developed algorithms that reconstruct a hidden image from the scrambled light waves that bounce off a wall, making it possible to see things behind a corner"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/30111417/SEI_253430962.jpg",
    "titles": [
      "Any wall can be turned into a camera to see around corners"
    ],
    "summary": "Researchers have created algorithms that can reconstruct images hidden from direct view by analyzing scrambled light waves that reflect off surfaces. This technology enables the visualization of objects or scenes that are not in the direct line of sight, effectively allowing one to \"see\" around corners.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about a new technology that could potentially have a wide range of applications. It provides awareness about the innovation and its potential uses, but does not delve deeply into the impacts or specific problem-solving applications of the technology, limiting its score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.86,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.534,
    "normalized_score": 1.38
  },
  {
    "title": "At this rate, carbon dioxide removal will never matter for the climate",
    "domain": "science",
    "location": "global",
    "published": "Fri, 30 May 2025 15:00:03 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "The carbon dioxide removal industry is struggling to grow at the pace needed to have a significant role in meeting climate targets"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/29211802/SEI_253537813.jpg",
    "titles": [
      "At this rate, carbon dioxide removal will never matter for the climate"
    ],
    "summary": "The carbon dioxide removal industry is facing challenges in scaling up quickly enough to significantly contribute to achieving global climate targets. Despite efforts, the pace of growth in this sector is not meeting the required levels to effectively address climate change goals.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the challenges in the carbon dioxide removal industry, which is relevant to understanding global climate targets. However, it does not report on potential solutions or improvements to the current situation, hence it does not score higher.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.86,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.534,
    "normalized_score": 1.38
  },
  {
    "title": "Dinosaur eggshell study confirms biogenic origin of secondary eggshell units",
    "domain": "science",
    "location": "global",
    "published": "Fri, 30 May 2025 14:16:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "The calcitic layers of the eggshells of archosaurs (including crocodilians and birds) and turtles are composed of distinctive crystalline structures known as eggshell units. Those growing from the shell membrane are called primary eggshell units (PEUs), while those forming within the calcitic layer are called secondary eggshell units (SEUs). Although rare in modern bird eggs, SEUs are common in dinosaur eggs. Due to the lack of in-depth research on this structure, however, scientists are uncertain whether they are biogenic or abiogenic in origin."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/dinosaur-eggshell-stud.jpg",
    "titles": [
      "Dinosaur eggshell study confirms biogenic origin of secondary eggshell units"
    ],
    "summary": "Researchers have identified two types of crystalline structures in the eggshells of archosaurs (which include crocodilians and birds) and turtles, known as primary eggshell units (PEUs) and secondary eggshell units (SEUs). PEUs originate from the shell membrane, while SEUs form within the calcitic layer. SEUs, though rare in modern bird eggs, were common in dinosaur eggs. The origin of SEUs, whether biological or non-biological, remains uncertain due to limited research on these structures.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the research on dinosaur eggshells, which contributes to a deeper understanding of the subject. However, it does not highlight any significant progress or solutions, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.864,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.515,
    "normalized_score": 0.5
  }
]