[
  {
    "title": "Much like L.A., this American-born pope transcends borders",
    "domain": "general",
    "location": "national",
    "published": "Thu, 8 May 2025 23:06:30 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>The faithful in Los Angeles, America's most Catholic city, were delighted — and a little stunned — to learn a Chicago-born priest with deep roots in Peru had been elected to lead the world's 1.4 billion Catholics.</p>"
    ],
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/af3c2da/2147483647/strip/false/crop/3000x2143+0+0/resize/1500x1072!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2c%2F0b%2F9c08bb394ddebe7322cbc735a1c0%2F1505727-me-american-pope-react-ces-0624.jpg",
    "titles": [
      "Much like L.A., this American-born pope transcends borders"
    ],
    "summary": "A Chicago-born priest with deep roots in Peru has been elected to lead the world's 1.4 billion Catholics, a decision that has both delighted and surprised the faithful in Los Angeles, America's most Catholic city.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the new Pope's background and his potential influence on the Catholic community, particularly in Los Angeles. However, it does not delve into the implications of this development, nor does it highlight any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.485,
    "normalized_score": 6.45
  },
  {
    "title": "Why 'Leo'? New pope shows support for workers, labor unions",
    "domain": "general",
    "location": "national",
    "published": "Thu, 8 May 2025 22:53:36 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>For Catholic theologians, the significance of the name could not be clearer, with the new pope tying himself to one of the foundational figures of modern Catholic social teaching, Pope Leo XIII, who advocated for the rights of the poor and working class.</p>"
    ],
    "image_url": "",
    "titles": [
      "Why 'Leo'? New pope shows support for workers, labor unions"
    ],
    "summary": "The new pope has chosen a name that aligns him with Pope Leo XIII, a pivotal figure in Catholic social teaching known for his advocacy for the rights of the poor and working class. This choice signals the new pope's commitment to these issues.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This article provides a deeper understanding of the new Pope's choice of name and what it signifies in terms of his commitment to the rights of the poor and working class. It provides actionable insights into the Pope's potential focus areas, but does not report on specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.761,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.504,
    "normalized_score": 8.49
  },
  {
    "title": "Mexican executives cheer Rowan for pushing U.S.-Mexico deal",
    "domain": "general",
    "location": "national",
    "published": "Thu, 8 May 2025 21:16:47 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Mexican business leaders and executives lauded statements from Apollo Global Management Chief Executive Marc Rowan emphasizing the need for a trade partnership between the U.S. and Mexico.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mexican executives cheer Rowan for pushing U.S.-Mexico deal"
    ],
    "summary": "Mexican business leaders and executives have praised comments made by Apollo Global Management CEO Marc Rowan, who highlighted the importance of a trade partnership between the U.S. and Mexico. This endorsement reflects a positive reception from the Mexican business community towards strengthening bilateral trade relations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides valuable insights into the potential strengthening of trade relations between the U.S. and Mexico, and the positive reception from the Mexican business community. It reports on attempts to solve economic challenges through bilateral trade, thus highlighting progress and solution-oriented thinking.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.739,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.507,
    "normalized_score": 8.82
  },
  {
    "title": "Trump and Starmer call trade deal 'historic,' but questions remain",
    "domain": "general",
    "location": "national",
    "published": "Thu, 8 May 2025 17:44:02 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Although the White House called the trade deal a 'milestone,' U.S. officials also described it as merely the 'end of the beginning' of talks involving the trade relationship with Britain.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump and Starmer call trade deal 'historic,' but questions remain"
    ],
    "summary": "The White House has labeled a recent trade deal with Britain as a 'milestone.' However, U.S. officials have also stated that this agreement marks just the 'end of the beginning' for ongoing discussions regarding the trade relationship between the two nations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some useful information about the ongoing trade discussions between the U.S. and Britain. However, it lacks detail on the specifics of the trade deal and the potential impacts, limiting its overall usefulness and depth.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.69,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.479,
    "normalized_score": 5.81
  },
  {
    "title": "The Moment Pope Leo XIV Emerged on the Balcony",
    "domain": "general",
    "location": "global",
    "published": "Thu, 08 May 2025 23:36:49 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Crowds gathered in St. Peter’s Square — and around the world — to see who had been elected as Pope Francis’ successor."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/08/multimedia/08int-pope-photos-vhtw/08int-pope-photos-vhtw-mediumSquareAt3X.jpg",
    "titles": [
      "The Moment Pope Leo XIV Emerged on the Balcony"
    ],
    "summary": "Crowds assembled in St. Peter's Square and globally awaited the announcement of Pope Francis’ successor. This gathering marks a significant moment in the Catholic Church as a new Pope is chosen to lead.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a significant event in the Catholic Church, but it doesn't provide deeper insights or context about the new Pope, his potential policies, or the process of selection, limiting its overall constructiveness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.771,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.457,
    "normalized_score": 3.44
  },
  {
    "title": "What should we expect from Shedeur Sanders in Cleveland?",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 8 May 2025 23:44:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Fifth-round draft picks don't typically carry the weight of expectations. Ahead of his first NFL practice, what's realistic for Sanders in a Browns uniform?"
    ],
    "image_url": "",
    "titles": [
      "What should we expect from Shedeur Sanders in Cleveland?"
    ],
    "summary": "Fifth-round draft picks, like Sanders, often face lower expectations due to their draft position. As Sanders prepares for his first NFL practice with the Browns, the realistic outlook for his performance is grounded in this context. His progress and impact on the team will be closely watched, acknowledging the typical trajectory and potential contributions of players selected in later rounds.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the expectations for a fifth-round draft pick in the NFL, which can help readers understand the potential trajectory and contributions of such players. However, it doesn't report on any specific solutions, improvements, or innovations, limiting its score.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.773,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.488,
    "normalized_score": 6.77
  },
  {
    "title": "Transfer rumors, news: Cunha prefers Man United over Arsenal",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 8 May 2025 20:42:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Wolves forward Matheus Cunha is interested in Man United. Transfer Talk has the latest news, gossip and rumors."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Cunha prefers Man United over Arsenal"
    ],
    "summary": "Wolves forward Matheus Cunha has shown interest in transferring to Manchester United, according to Transfer Talk's latest updates on football news, gossip, and rumors.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a potential player transfer in football, but it doesn't provide any actionable insights, solutions, or deeper understanding of the situation.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.731,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.425,
    "normalized_score": 0.0
  },
  {
    "title": "The Thunder's defense has become their 'calling card'",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 9 May 2025 11:54:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "The stifling unit that fueled Oklahoma City is facing its greatest test: Nikola Jokic and the Nuggets."
    ],
    "image_url": "",
    "titles": [
      "The Thunder's defense has become their 'calling card'"
    ],
    "summary": "The Oklahoma City defensive unit, known for its effectiveness, is currently facing a significant challenge in going up against Nikola Jokic and the Denver Nuggets. This matchup is considered their toughest test yet.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about the defensive strategies of the Oklahoma City Thunder and contextualizes the challenge they face against the Denver Nuggets. However, it doesn't report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.518,
    "normalized_score": 10.0
  },
  {
    "title": "Betting buzz: Bettors sticking with Celtics despite Knicks' 2-0 lead",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 9 May 2025 11:50:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Despite dropping the first two games, bettors are still picking the Boston Celtics in their series against the New York Knicks."
    ],
    "image_url": "",
    "titles": [
      "Betting buzz: Bettors sticking with Celtics despite Knicks' 2-0 lead"
    ],
    "summary": "Despite initial losses in the first two games of their series, bettors continue to favor the Boston Celtics over the New York Knicks.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about betting trends in a basketball series, but it doesn't offer any actionable insights, solutions, or deeper understanding of the betting dynamics.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.508,
    "normalized_score": 8.92
  },
  {
    "title": "Stanley Cup playoff odds: Rantanen new Conn Smythe fave after hat trick",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 9 May 2025 11:50:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Every playoff team's odds to win the 2025 Stanley Cup and favorites for the Conn Smythe Trophy for playoff MVP."
    ],
    "image_url": "",
    "titles": [
      "Stanley Cup playoff odds: Rantanen new Conn Smythe fave after hat trick"
    ],
    "summary": "The article provides the odds for every playoff team to win the 2025 Stanley Cup, alongside predictions for the favorites to receive the Conn Smythe Trophy, awarded to the playoff MVP. This summary encapsulates the key details and outcomes regarding teams' chances and player performance expectations for the upcoming playoffs.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the Stanley Cup playoffs and the odds for each team. However, it lacks depth or insight that would allow readers to gain a deeper understanding or make informed decisions.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.488,
    "normalized_score": 6.77
  },
  {
    "title": "Watch These AppLovin Levels as Stock Soars After Strong Earnings, Sale of Mobile Gaming Unit",
    "domain": "business",
    "location": "global",
    "published": "Thu, 08 May 2025 21:51:05 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/LyaleIBrcBgjlfQcHl8XN477hZQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/APPChart-9aa61fdf8dd845ff83df03e29c558384.gif\" title=\"This image depicts the APP chart.\" /><figcaption><i>Source: TradingView.com</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>AppLovin shares surged Thursday after the mobile app marketing provider announced the sale of its mobile game business and quarterly results that topped Wall Street expectations. </li><li>The stock has recently broken out above a falling wedge pattern and reclaimed the 50-day moving average.</li><li>Investors should watch crucial overhead areas on AppLovin's chart around $352, $525 and $940, while also monitoring an important support level near $235.<br /></li></ul><br /><br /><p>AppLovin (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;app\">APP</a>) shares surged Thursday after the <a href=\"https://www.investopedia.com/applovin-earnings-q1-fy2025-11730215\">mobile app marketing provider announced</a> the sale of its mobile game business and quarterly results that topped Wall Street expectations.<span class=\"ql-inline-citation\"></span></p><p>The company, which offers AI-powered software products to assist developers target ads and <a href=\"https://www.investopedia.com/terms/m/monetize.asp\">monetize</a> apps, said late Wednesday it sold its mobile game unit to London-based Tripledot Studios for $400 million and will hold a 20% stake in the private firm following the transaction.</p><p>In addition to topping analysts’ first quarter earnings forecasts, the company issued current quarter advertising <a href=\"https://www.investopedia.com/terms/r/revenue.asp\">revenue</a> guidance above expectations, while also pointing out that it focuses on mid-market web advertisers that have less exposure tariffs.</p><p>AppLovin shares tumbled as much as 62% between mid-February and early April after <a href=\"https://www.investopedia.com/applovin-stock-tumbles-short-sellers-allege-fraud-deceptive-practices-ai-ad-software-11686871\">short sellers published reports</a> accusing the adtech company of deceptive practices. The stock gained 12% to close Thursday at $339.51, and is up about 70% from last month's low point.</p><p>Below, we break down the <a href=\"https://www.investopedia.com/technical-analysis-4689657\">technicals</a> on AppLovin’s chart and identify price levels that investors are likely watching.</p><h2>Bullish Momentum Set to Accelerate</h2><p>After setting a <a href=\"https://www.investopedia.com/terms/r/record_high.asp\">record high</a> in mid February, AppLovin shares staged a sharp reversal back to the <a href=\"https://www.investopedia.com/ask/answers/013015/why-200-simple-moving-average-sma-so-common-traders-and-analysts.asp\">200-day moving average</a>, where they traded mostly sideways since that time.</p><p>However, the stock recently broke out above a falling wedge pattern and reclaimed the <a href=\"https://www.investopedia.com/ask/answers/012815/why-50-simple-moving-average-sma-so-common-traders-and-analysts.asp\">50-day moving average</a> in a move that coincided with the <a href=\"https://www.investopedia.com/terms/r/rsi.asp\">relative strength index</a> crossing back above the 50 threshold to signal improving price momentum.</p><p>Let’s take a closer look at three crucial overhead areas on AppLovin’s chart worth watching, while also identifying an important <a href=\"https://www.investopedia.com/terms/s/support.asp\">support level</a> to monitor during potential <a href=\"https://www.investopedia.com/articles/active-trading/020415/top-strategies-mastering-pullback-trading.asp\">pullbacks</a>.</p><h2>Crucial Overhead Areas Worth Watching</h2><p>The first overhead area to watch sits around $352. The shares could encounter selling pressure at this level near a <a href=\"https://www.investopedia.com/terms/t/trendline.asp\">trendline</a> that connects the March peak and the upper range of a <a href=\"https://www.investopedia.com/terms/c/consolidation.asp\">consolidation</a> period that formed on the chart throughout most of December and January.</p><p>A decisive <a href=\"https://www.investopedia.com/articles/trading/08/trading-breakouts.asp\">breakout</a> above this area could see the shares climb to $525. Investors who have averaged in at lower prices may decide to l<a href=\"https://www.investopedia.com/terms/l/lock_in_profits.asp\">ock in profits</a> in this region near the stock’s record high.</p><p>To project an overhead area to watch if the stock moves into <a href=\"https://www.investopedia.com/terms/p/pricediscovery.asp\">price discovery</a> mode, investors can use the bars pattern tool. When applying this technique to AppLovin’s chart, we extract the stock’s <a href=\"https://www.investopedia.com/terms/u/uptrend.asp\">uptrend</a> from August to December last year that commenced from the 200-day MA and reposition it from last month’s touch of the 200-day MA. This analysis projects a potential longer-term bullish move up to around $940 if price action rhymes.</p><h2>Important Support Level to Monitor</h2><p>During pullbacks in the stock, it's worth keeping track of the $235 level. Retracements to this important <a href=\"https://www.investopedia.com/terms/t/technicalanalysis.asp\">technical</a> area would likely attract strong buying interest near last month’s initial breakout point from the falling wedge pattern, which also closely aligns with the March trough.</p><p><em>The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our <a href=\"https://www.investopedia.com/legal-4768893#toc-warranty-and-liability-disclaimer\">warranty and liability disclaimer</a> for more info.</em></p><p><em>As of the date this article was written, the author does not own any of the above securities.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/LyaleIBrcBgjlfQcHl8XN477hZQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/APPChart-9aa61fdf8dd845ff83df03e29c558384.gif",
    "titles": [
      "Watch These AppLovin Levels as Stock Soars After Strong Earnings, Sale of Mobile Gaming Unit"
    ],
    "summary": "AppLovin's shares experienced a significant increase following the announcement of their mobile game business sale to Tripledot Studios for $400 million and the release of quarterly results exceeding Wall Street expectations. The company, known for its AI-powered software for app monetization and targeting ads, also retains a 20% stake in Tripledot Studios post-sale. Despite previous accusations of deceptive practices leading to a 62% drop in shares between mid-February and early April, the stock has rebounded, closing up 12% at $339.51, marking a 70% increase from last month's low. The articl",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about AppLovin's stock performance and the company's recent business moves. It also provides context about the company's past controversies, which could help readers make informed decisions about investing. However, it does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.747,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.5,
    "normalized_score": 8.06
  },
  {
    "title": "These States Are Least Prepared for a Recession",
    "domain": "business",
    "location": "global",
    "published": "Thu, 08 May 2025 21:38:41 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Photo by Aaron M. Sprecher/Getty Images Pedestrians walk the street in the French Quarter on December 14, 2024 in New Orleans, Louisiana.\" src=\"https://www.investopedia.com/thmb/H1Q7vj8S7QZYALdfSQRpM_1jWVA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193163507-ce2aba0ec74c4afcbd6b122ed8d8838e.jpg\" title=\"A general view of Bourbon Street as pedestrians walk the street in the French Quarter on December 14, 2024 in New Orleans, Louisiana.\" /><figcaption><i><p>Photo by Aaron M. Sprecher/Getty Images</p> Pedestrians walk the street in the French Quarter on December 14, 2024 in New Orleans, Louisiana.</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>President Donald Trump's tariffs have tripped recession alarms, such as shrinking economic growth, squashing consumer confidence, and shaking financial markets.</li><li>Some of the most populous U.S. states, largely in the South, are the least prepared for a recession, according to a report from fintech lender National Business Capital.</li><li>The study found that a few northern Great Plains states, with high GDP, state government reserves, and low unemployment, are the most recession-resistant.</li></ul><br /><br /><p>As tariffs trigger recession alarms, some of the most populous states are the least prepared for an economic downturn, according to a recent report.</p><p>Tariff uncertainty has taken financial markets on a <a href=\"https://www.investopedia.com/trump-first-100-days-stock-market-treasurys-dollar-gold-bitcoin-11723416\">wild ride</a>, squashed <a href=\"https://www.investopedia.com/falling-consumer-confidence-has-set-off-this-recession-alarm-11724208\">consumer</a> and <a href=\"https://www.investopedia.com/uncertainty-about-tariffs-has-become-pervasive-in-the-economy-fed-finds-11720792\">business</a> confidence, and <a href=\"https://www.investopedia.com/will-there-be-a-recession-some-economists-say-it-s-inevitable-others-aren-t-convinced-11715927\">fueled fears about the possibility</a> of a coming recession. They also spurred a surge of imports as people rushed to beat the tariffs, which resulted in negative economic growth<a href=\"https://www.investopedia.com/for-the-first-time-since-2022-the-economy-is-shrinking-gdp-11724764\"> for the first time</a> since 2022.</p><p>The U.S. economy is likely not officially in a recession yet. The <a href=\"https://www.investopedia.com/terms/n/nber.asp\">National Bureau of Economic Research</a>, the nonprofit research group that officially calls U.S. recessions, only does so once a recession has already set in, because it uses backward-looking data. However, two consecutive quarters of negative economic growth typically indicate a recession is in progress.</p><p>Millions of Americans live in states that are vulnerable to a <a href=\"https://www.investopedia.com/the-economy-just-shrank-are-we-in-a-recession-11724974\">recession</a>, and the majority of states with the highest populations rank as least prepared for an economic downturn, according to a<strong> </strong>report released Wednesday by National Business Capital.<span class=\"ql-inline-citation\"></span></p><p>This analysis utilized economic data from each state to determine which was in the best position to survive a recession. States that were better prepared to weather a recession typically had higher government reserves, GDP per capita, and safety net coverage as well as lower unemployment rates and lower housing prices.</p><p></p><p>Mountain and Southern states proved to be the least resistant to a recession. National Business Capital's report said that, in recent years, those regions experienced a migration and housing boom that drove up the cost of living and hurt <a href=\"https://www.investopedia.com/breaking-your-budget-to-own-a-home-you-are-not-alone-8772190\">household budgets</a>.</p><p>In particular, Louisiana is the state most vulnerable to a recession, the study found. It already has a higher <a href=\"https://www.investopedia.com/terms/u/unemploymentrate.asp\">unemployment rate</a> than most other states, and Louisiana's government reserves are the lowest of all 50 states. It also has some of the worst safety-net coverage for residents through programs like unemployment insurance. In addition, the housing in the state is some of the <a href=\"https://www.investopedia.com/want-a-view-of-the-housing-affordability-crisis-these-numbers-show-the-trend-11688451\">least affordable</a> in the country.</p><p>Colorado, Mississippi and South Carolina were also particularly ill-equipped to withstand a recession, the study found.</p><p>The most resilient states are primarily in the northern Great Plains region, with North Dakota being the most recession-resistant, according to the study. The state's high GDP relative to population and government reserves, combined with low unemployment, comparatively lower cost of living, and \"decent\" safety-net coverage, make it the most prepared state in the company's study.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/H1Q7vj8S7QZYALdfSQRpM_1jWVA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193163507-ce2aba0ec74c4afcbd6b122ed8d8838e.jpg",
    "titles": [
      "These States Are Least Prepared for a Recession"
    ],
    "summary": "A report by National Business Capital highlights the varying readiness of U.S. states for a potential recession, triggered by concerns over President Trump's tariffs. The tariffs have negatively impacted economic growth, consumer and business confidence, and financial markets, raising fears of a recession. The study identifies southern and mountain states as the least prepared, with Louisiana being the most vulnerable due to high unemployment, low government reserves, and poor safety-net coverage. In contrast, northern Great Plains states like North Dakota are deemed the most recession-resista",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an important issue - the preparedness of different states for a potential recession. It provides valuable insights and data that could help readers understand the economic situation and make informed decisions. It also raises awareness about the impact of tariffs on the economy.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.744,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.509,
    "normalized_score": 9.03
  },
  {
    "title": "Coinbase shares fall after first-quarter revenue misses Wall Street estimates",
    "domain": "business",
    "location": "national",
    "published": "Thu, 08 May 2025 21:35:43 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Earlier Thursday, Coinbase announced plans to buy Dubai-based Deribit, in an attempt to broaden its international business."
    ],
    "image_url": "",
    "titles": [
      "Coinbase shares fall after first-quarter revenue misses Wall Street estimates"
    ],
    "summary": "Coinbase, a major cryptocurrency exchange, announced its intention to acquire Deribit, a Dubai-based platform specializing in crypto derivatives, as part of its strategy to expand its global operations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about Coinbase's strategic move to acquire Deribit, which could influence investment decisions. However, it lacks details about the implications of this move, such as how it could affect the cryptocurrency market or Coinbase's future prospects.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.743,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.498,
    "normalized_score": 7.85
  },
  {
    "title": "Affirm drops 8% on weaker-than-expected guidance for current quarter",
    "domain": "business",
    "location": "national",
    "published": "Thu, 08 May 2025 21:29:49 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Affirm beats on earnings but gave a revenue forecast that trailed analysts' estimates."
    ],
    "image_url": "",
    "titles": [
      "Affirm drops 8% on weaker-than-expected guidance for current quarter"
    ],
    "summary": "Affirm Holdings Inc. reported earnings that exceeded expectations. However, the company's revenue forecast did not meet analysts' predictions, indicating a potential slowdown in growth. This mixed financial outcome highlights Affirm's current performance and future revenue projections.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about Affirm's financial performance and future projections, which could be helpful for investors. However, it doesn't delve into the reasons behind the weaker-than-expected guidance or the potential impacts on the company's future.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.742,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.488,
    "normalized_score": 6.77
  },
  {
    "title": "Coinbase Stock Gives Up Some of Its Bitcoin-Fueled Gains as Earnings Underwhelm",
    "domain": "business",
    "location": "global",
    "published": "Thu, 08 May 2025 21:19:37 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"SOPA Images / Getty Images Coinbase said Thursday it agreed to acquire Deribit, a crypto options exchange, for $2.9 billion\" src=\"https://www.investopedia.com/thmb/QKjNsj5zBF-mWJOerGix1DSwPC0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2192454029-9a91610f89844d02ada38182e1d5e0b2.jpg\" title=\"Coinbase logo.\" /><figcaption><i><p>SOPA Images / Getty Images</p> Coinbase said Thursday it agreed to acquire Deribit, a crypto options exchange, for $2.9 billion</i></figcaption></figure><p>Coinbase (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;COIN\">COIN</a>) reported first-quarter earnings that missed analysts' expectations, and shares dropped in extended trading on the heels of a <a href=\"https://www.investopedia.com/crypto-stocks-jump-as-bitcoin-surges-above-usd100k-for-first-time-in-three-months-11730622\">Bitcoin-driven rally</a> Thursday.</p><p>The cryptocurrency exchange reported revenue of $2.03 billion, up 24% year-over-year but below below the analyst consensus from Visible Alpha.<span class=\"ql-inline-citation\"></span> Adjusted net income of $526.63 million, or $1.94 per share, fell from $679.2 million, or $2.53 per share, a year earlier, well short of estimates.</p><p>Coinbase shares slid close to 3% in extended trading following the release, after jumping 5% during Thursday's regular session as the price of Bitcoin surged above $100,000 for the first time in months. The stock was down about 17% for 2025 through Thursday's close.<br /></p><p>Looking ahead, Coinbase said it expects second-quarter subscription and services revenue to land between $600 million and $680 million. Analysts had called for $704 million.</p><p>\"Macro uncertainty, including around global trade policy, is impacting consumer sentiment and may contribute to softer crypto trading markets,\" the company said in a letter to shareholders.</p><p>Separately, Coinbase announced ahead of Thursday's earnings report that it agreed to acquire Deribit, a <a href=\"https://www.investopedia.com/how-to-buy-and-sell-bitcoin-options-7378233#:~:text&#61;Important&amp;text&#61;Cryptocurrency%20options%20function%20in%20essentially,heavily%20traded%20commodities%20like%20gold.\">crypto options</a> exchange, for $2.9 billion in cash and stock.<span class=\"ql-inline-citation\"></span></p><p><em>CORRECTION—May 8, 2025: This article has been updated since it was first published to reflect Coinbase agreed to acquire Deribit for $2.9 billion. </em></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/QKjNsj5zBF-mWJOerGix1DSwPC0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2192454029-9a91610f89844d02ada38182e1d5e0b2.jpg",
    "titles": [
      "Coinbase Stock Gives Up Some of Its Bitcoin-Fueled Gains as Earnings Underwhelm"
    ],
    "summary": "Coinbase announced its acquisition of the crypto options exchange Deribit for $2.9 billion, marking a significant expansion in its offerings. This news came alongside Coinbase's first-quarter earnings report, which revealed revenues of $2.03 billion, a 24% increase from the previous year but below analysts' expectations. The company's adjusted net income also fell short of estimates, leading to a nearly 3% drop in shares in extended trading. Despite a brief rally due to a surge in Bitcoin prices, Coinbase's stock has declined about 17% in 2025. The company anticipates softer crypto trading mar",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story offers a detailed account of Coinbase's financial performance and its acquisition of Deribit. It also provides some context about the company's stock performance and the broader crypto market. However, it could offer more insight into the causes and implications of these developments.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.739,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.505,
    "normalized_score": 8.6
  },
  {
    "title": "Failed Soviet probe will soon crash to Earth – and we don't know where",
    "domain": "science",
    "location": "global",
    "published": "Thu, 08 May 2025 22:20:41 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Kosmos 482, a Soviet spacecraft that never made it beyond Earth’s orbit on its way to Venus, is due to come crashing down on 9 or 10 May"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/08211635/sei250474890.jpg",
    "titles": [
      "Failed Soviet probe will soon crash to Earth – and we don't know where"
    ],
    "summary": "Kosmos 482, a Soviet spacecraft launched with the intention of reaching Venus but failed to escape Earth's orbit, is expected to re-enter Earth's atmosphere and crash down on either May 9 or May 10.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the potential danger of a falling spacecraft, but it does not provide any actionable insights or deeper understanding for the reader. It does not report on any solutions or attempts to mitigate the problem, nor does it provide clarity on the systems or causes behind the issue.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.74,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.476,
    "normalized_score": 5.48
  },
  {
    "title": "US Customs and Border Protection Quietly Revokes Protections for Pregnant Women and Infants",
    "domain": "science",
    "location": "global",
    "published": "Thu, 08 May 2025 22:00:54 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "CBP’s acting commissioner has rescinded four Biden-era policies that aimed to protect vulnerable people in the agency’s custody, including mothers, infants, and the elderly."
    ],
    "image_url": "https://media.wired.com/photos/681d21421e18f70ebcc859c3/master/pass/cbp-infants-sec-1315627596.jpg",
    "titles": [
      "US Customs and Border Protection Quietly Revokes Protections for Pregnant Women and Infants"
    ],
    "summary": "The acting commissioner of U.S. Customs and Border Protection (CBP) has revoked four policies from the Biden administration designed to safeguard vulnerable populations, such as mothers, infants, and elderly individuals, while in CBP custody. This action removes specific protections previously put in place for these groups.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about a significant policy change, offering useful context about its potential impact on vulnerable populations. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the causes or trends behind this decision.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.749,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.5,
    "normalized_score": 8.06
  },
  {
    "title": "30 Minutes to the Top: Climbing the World’s Largest Telescope in the Atacama Desert",
    "domain": "science",
    "location": "global",
    "published": "Thu, 08 May 2025 21:36:20 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/30-minutes-to-the-top-climbing-the-worlds-largest-telescope-in-the-atacama-desert/\" rel=\"nofollow\" title=\"30 Minutes to the Top: Climbing the World’s Largest Telescope in the Atacama Desert\"><img alt=\"ESO Extremely Large Telescope Framework for Greatness\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/ESO-Extremely-Large-Telescope-Framework-for-Greatness-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Beneath Chile’s brilliant skies, the ELT grows—an engineering giant ready to capture the secrets of the universe with the largest telescope mirror ever made. Framed by the golden light of sunset in Chile’s Atacama Desert, this image captures the steady progress on the construction of the European Southern Observatory’s Extremely Large Telescope (ELT). From this [...]"
    ],
    "image_url": "",
    "titles": [
      "30 Minutes to the Top: Climbing the World’s Largest Telescope in the Atacama Desert"
    ],
    "summary": "In Chile's Atacama Desert, construction progresses on the European Southern Observatory's Extremely Large Telescope (ELT), poised to be the world's largest telescope with the biggest mirror ever made for such a device. This engineering marvel, situated beneath the clear Chilean skies, aims to unlock the universe's secrets.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights progress in the field of astronomy with the construction of the world's largest telescope. It provides the reader with a deeper understanding of the project and its potential to unlock the universe's secrets. It also raises awareness about the technological advancements and innovations in this field.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.743,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.518,
    "normalized_score": 10.0
  },
  {
    "title": "This Star’s Fury Forged a Mountain of Gold – Here’s How",
    "domain": "science",
    "location": "global",
    "published": "Thu, 08 May 2025 21:11:18 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-stars-fury-forged-a-mountain-of-gold-heres-how/\" rel=\"nofollow\" title=\"This Star’s Fury Forged a Mountain of Gold – Here’s How\"><img alt=\"Star Explosion Heavy Elements Concept Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Star-Explosion-Heavy-Elements-Concept-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A star’s colossal flare has revealed an unexpected origin for some of the universe’s heaviest elements, including gold and platinum. In a stunning breakthrough, scientists linked a mysterious 2004 space signal to a magnetar flare that forged massive amounts of these elements—possibly explaining up to 10% of their presence in the galaxy. This new source [...]"
    ],
    "image_url": "",
    "titles": [
      "This Star’s Fury Forged a Mountain of Gold – Here’s How"
    ],
    "summary": "Scientists have discovered that a magnetar flare, a massive star explosion, in 2004 was responsible for creating significant amounts of heavy elements, including gold and platinum. This event has been linked to a mysterious space signal from the same year, offering a new explanation for up to 10% of these elements' presence in the galaxy. This breakthrough challenges previous beliefs about the origins of the universe's heaviest elements.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive because it provides readers with a deeper understanding of the universe and the origins of heavy elements, including gold and platinum. It reports on a scientific breakthrough and challenges previous beliefs, contributing to progress in the field of astrophysics.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.738,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.515,
    "normalized_score": 9.68
  },
  {
    "title": "Is Dark Energy Changing? Mysterious New Data Challenges Einstein’s Cosmological Constant",
    "domain": "science",
    "location": "global",
    "published": "Thu, 08 May 2025 20:46:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/is-dark-energy-changing-mysterious-new-data-challenges-einsteins-cosmological-constant/\" rel=\"nofollow\" title=\"Is Dark Energy Changing? Mysterious New Data Challenges Einstein’s Cosmological Constant\"><img alt=\"Abstract Astrophysics Dark Matter Mystery\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Abstract-Astrophysics-Dark-Matter-Mystery-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Recent findings from the Dark Energy Spectroscopic Instrument suggest the possibility of new physics that extends beyond the current standard model of cosmology. Using the lab’s new Aurora exascale computing system, the research team conducted high-resolution simulations of the universe’s evolution, creating a platform to analyze and interpret recent observational breakthroughs. Last year, the Dark [...]"
    ],
    "image_url": "",
    "titles": [
      "Is Dark Energy Changing? Mysterious New Data Challenges Einstein’s Cosmological Constant"
    ],
    "summary": "Recent findings from the Dark Energy Spectroscopic Instrument indicate potential new physics beyond the standard cosmological model, challenging Einstein's cosmological constant. Utilizing the Aurora exascale computing system for high-resolution universe simulations, researchers aim to understand the universe's evolution and recent observational data more accurately. This suggests a reevaluation of dark energy's role and properties in the cosmos.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on new findings that challenge established scientific theories, contributing to the progress of understanding the universe. It increases awareness about the role and properties of dark energy, offering insights into the evolution of the universe and the potential for new physics beyond the standard cosmological model.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.732,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.505,
    "normalized_score": 8.6
  }
]