[
  {
    "title": "Philip Rivers to start at quarterback for Colts on Sunday",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 02:34:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com",
      "sportsnet.ca",
      "cbssports.com"
    ],
    "snippets": [
      "Philip Rivers, who came out of retirement this week to help the Colts address their void at quarterback, is expected to start Sunday against the Seahawks, a source told ESPN.",
      "Over four years after his last snap, Philip Rivers has been elevated from the Indianapolis Colts practice squad to the team's active roster to start against the Seattle Seahawks on Sunday.",
      "It’s once again Phillip Rivers’ time under centre for the Indianapolis Colts.",
      "In a shocking turn of events, the 44-year-old will lead the offense just days after joining the team"
    ],
    "image_url": "",
    "titles": [
      "Source: Colts expected to start Rivers vs. Seattle",
      "Colts to start 44-year-old Rivers vs Seahawks in Sunday's NFL",
      "Reports: Colts QB Philip Rivers to start against Seahawks",
      "Philip Rivers to start at QB for Colts vs. Seahawks days after coming out of retirement"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47293673/philip-rivers-expected-start-colts-seahawks",
    "alternate_urls": [
      "https://www.skysports.com/nfl/news/12040/13483052/philip-rivers-indianapolis-colts-to-start-44-year-old-quarterback-vs-seattle-seahawks-in-sundays-nfl",
      "https://www.cbssports.com/nfl/news/philip-rivers-starting-colts-seahawks-week-15-retirement/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47293673/philip-rivers-expected-start-colts-seahawks",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.925,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.832,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an upcoming sports event. However, it lacks depth or insight that would make it more constructive for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Philip Rivers, 44, has come out of retirement and been elevated from the Indianapolis Colts practice squad to the active roster. He is expected to start at quarterback for the Colts against the Seattle Seahawks on Sunday, just days after rejoining the team. This marks his first NFL game in over four years.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Police detain two people after shooting at Sydney Hanukkah event",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-14T09:07:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "ABC News",
      "Financial Times"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "abcnews.go.com",
      "ft.com"
    ],
    "snippets": [
      "Australian police have taken two people into custody after reports of multiple gunshots at Sydney's Bondi Beach. A Jewish event to mark the first day of Hanukkah on Sunday appeared to have been the target of the attack.",
      "This is a breaking news story.",
      "A police operation at the beach is \"ongoing,\" the New South Wales police said.",
      "Two people in custody as prime minister Anthony Albanese says incident is ‘shocking and distressing’"
    ],
    "image_url": "",
    "titles": [
      "Australia: Police detain 2 after gunshots at Bondi Beach",
      "Australia police respond after gunshots reported at Sydney’s Bondi Beach",
      "2 in custody as Australian police respond to 'developing incident' at Bondi Beach",
      "Police respond to shootings at Sydney’s Bondi Beach"
    ],
    "url": "https://www.dw.com/en/australia-police-detain-2-after-gunshots-at-bondi-beach/a-75150014?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/12/14/australia-police-responding-after-gunshots-reported-at-sydneys-bondi-beach?traffic_source=rss",
      "https://abcnews.go.com/International/bondi-beach-australia-police-respond-incident/story?id=128388126",
      "https://www.ft.com/content/debf26f6-db4a-4913-a4d0-2080f372b17d"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/australia-police-detain-2-after-gunshots-at-bondi-beach/a-75150014?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.966,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.825,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an incident of violence, but lacks depth or insight into the causes, implications, or solutions to such incidents.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Australian police have detained two people following reports of gunfire at Sydney's Bondi Beach, where a Jewish Hanukkah event was reportedly targeted. The New South Wales police say the operation is ongoing. Prime Minister Anthony Albanese described the incident as \"shocking and distressing.\"",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Fernando Mendoza wins 2025 Heisman Trophy for Indiana football",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 01:53:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "ESPN",
      "CBS Sports",
      "Sportsnet",
      "Associated Press",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Indiana QB Fernando Mendoza wins the Heisman Axios",
      "Indiana's Fernando Mendoza, who guided the Hoosiers to their first No. 1 ranking and the top seed in the 12-team CFP bracket by throwing for 2,980 yards and a national-best 33 touchdown passes, won the Heisman Trophy on Saturday night.",
      "Mendoza is the first Big Ten player to win the Heisman since Troy Smith in 2006",
      "Fernando Mendoza’s remarkable season is now etched in history forever, as the star quarterback took home the 2025 Heisman Trophy on Saturday.",
      "Fernando Mendoza wins the Heisman Trophy as college football’s top player AP News",
      "Fernando Mendoza Is the First Cal Graduate to Win Heisman Trophy Sports Illustrated",
      "2025 Heisman Trophy: Full Voting Results Revealed Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Indiana QB Fernando Mendoza wins the Heisman - Axios",
      "QB Mendoza first Hoosier to win Heisman Trophy",
      "2025 Heisman Trophy winner: Fernando Mendoza wins award after leading Indiana to historic No. 1 ranking",
      "Indiana’s Fernando Mendoza wins 2025 Heisman Trophy",
      "Fernando Mendoza wins the Heisman Trophy as college football’s top player - AP News",
      "Fernando Mendoza Is the First Cal Graduate to Win Heisman Trophy - Sports Illustrated",
      "2025 Heisman Trophy: Full Voting Results Revealed - Sports Illustrated"
    ],
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tZ0dzRU1BYWNYSEE4eTlKTmtGSnVwNmV4MVJ2LWFMVTVpMEtNQUFlb1NRMlRGNkg4YnU3cHpZRnNaWi02eHNFV1Y2ZVl4d3VZV0NCTWJZVGZlamlvbGdYa3NDZjdzaFpXRmtidzI5dDZUM3U2NmZVNWY1aEF5RnM?oc=5",
    "alternate_urls": [
      "https://www.espn.com/college-football/story/_/id/47298246/fernando-mendoza-becomes-1st-indiana-hoosier-win-heisman",
      "https://www.cbssports.com/college-football/news/2025-heisman-trophy-winner-indiana-qb-fernando-mendoza/",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPVmhoUHUxMHVYZTNVQ0RtcWRJdHdpOGxiREllQ1BUSTZ2RU15eHFSYnRkbEpnd2thODNTQmN2OHA0WHRMcE9yeFhVSWtTRVZSQ1N0cTNsczIyUkk1ZmY2S2pQMTVHYU84VmdUMnJOY3RNREJZOFFsZDZySzZlamY1ZXdtbkFocHlV?oc=5",
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOWjZkUDNvY2pqeWJLSFN1bnVCYm9qU1dwSlgwSkhNaHdGU0hiWXIwTC0xQTVvNkE0NDVjYTNsNU9FQl92dlFLVHdXUkFrMFl5TkpEbm1UZUp4aGtyMUtQYm9Ha3pTaU1vR0tubjd1YzRmSXVna2FjU3ViS3B4NWxPVkI1Wk9Eb1Vsc2JTNTRnYW5ONUtsTllMdnVLOEY1R0pNWU9WTzhpbnFxdHJBU0NqQm9ITGVnU1Rr?oc=5",
      "https://news.google.com/rss/articles/CBMijAFBVV95cUxNTFZGbFpFeW1KRFlXLUVnYmtSM3p4NmNlZWxqNVM5MVRiZ3dKOUxqZUtqRDU2YU5mYmFSNUpWaUpma00ySTBTelBlWjh4RFBnc1RmeVRVck8tZWdfd290UmxWSHVrRzljUmFiWDc3akJVdUNGVmdtdFR0cFhvOWhlX3pXN0Y4WnZTY2RBTA?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tZ0dzRU1BYWNYSEE4eTlKTmtGSnVwNmV4MVJ2LWFMVTVpMEtNQUFlb1NRMlRGNkg4YnU3cHpZRnNaWi02eHNFV1Y2ZVl4d3VZV0NCTWJZVGZlamlvbGdYa3NDZjdzaFpXRmtidzI5dDZUM3U2NmZVNWY1aEF5RnM?oc=5",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.79,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.813,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a sports achievement. It does not provide much depth or insight that would contribute to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Indiana quarterback Fernando Mendoza won the 2025 Heisman Trophy, becoming the first Big Ten player since 2006 to receive the award. Mendoza led the Hoosiers to their first No. 1 ranking and top seed in the 12-team College Football Playoff, throwing for 2,980 yards and 33 touchdowns. He is also the first Cal graduate to win the Heisman.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Zelenskyy will meet leaders in Berlin to discuss ending war",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-14T08:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "The Ukrainian president is to come to Germany for the latest talks on ending the invasion of his country. US special envoy Witkoff is expected to join the negotiations, but Russia will not be represented. DW has more.",
      "Zelenskiy says he will meet US and European representatives in Berlin Reuters",
      "White House official confirms Trump’s envoy Steve Witkoff will meet with Zelenskyy and European leaders this weekend. What we know on day 1,390 Donald Trump’s special envoy will meet with Volodymyr Zelenskyy and other European leaders in Berlin this weekend , the White House said, as Washington pres"
    ],
    "image_url": "",
    "titles": [
      "Ukraine: Zelenskyy to meet US, European officials in Berlin",
      "Zelenskiy says he will meet US and European representatives in Berlin - Reuters",
      "Ukraine war briefing: US envoy to meet Zelenskyy, Europe leaders in Berlin"
    ],
    "url": "https://www.dw.com/en/ukraine-zelenskyy-to-meet-us-european-officials-in-berlin/live-75149706?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQVGpkMlpCSmlBcWlldmVkN0s5azFLQmpEelhXVkZ2czZQZDNxS0p2Uk9leHVuWk9SdnhXTEpjUlBzNHVzRThlTjhxZmVVbEZPaUZzSEFaVjhUaW93SEhSTnhIRHEtN0hxVWVNQktmaVB6dm5RM2Q1alJoNG5FMXF1VUwwVnVab1VHUXBkNUR2bTVBV1RHejg5SEc0emh5dUpaM2loaVViVlF0RzJ5RGYtXw?oc=5",
      "https://www.theguardian.com/world/2025/dec/14/ukraine-war-briefing-us-envoy-to-meet-zelenskyy-europe-leaders-in-berlin"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/ukraine-zelenskyy-to-meet-us-european-officials-in-berlin/live-75149706?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.948,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.812,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about an upcoming meeting between important political figures, which could potentially lead to solutions or progress in political or diplomatic issues. However, without more context or details, it's hard to assess its full value.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelenskyy will travel to Berlin for talks aimed at ending the invasion of Ukraine. US special envoy Steve Witkoff, representing former President Donald Trump, and European leaders will participate. Russia will not attend the negotiations, which are set for this weekend.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Belarus leader frees 123 prisoners after talks with United States",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 15:10:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "New York Times",
      "The Guardian",
      "CBC News",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "nytimes.com",
      "theguardian.com",
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Nobel Peace Prize winner among dozens released as the US removes potash sanctions.",
      "\"It's a feeling of incredible happiness,\" says political prisoner Maria Kolesnikova, freed after more than five years.",
      "The release of the prisoners, including a Nobel laureate and two opposition leaders, was part of a monthslong rapprochement between Washington and Minsk.",
      "Nobel prize winner Ales Bialiatski and opposition figure Maria Kalesnikava among those freed after US talks with Alexander Lukashenko The Belarusian president, Alexander Lukashenko, has freed 123 prisoners, including Nobel peace prize winner Ales Bialiatski and leading opposition figure Maria Kalesn",
      "Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday, including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava, after two days of talks with an envoy for U.S. President Donald Trump, an American statement said.",
      "Belarus Frees 123 Political Prisoners as US Lifts Potash Ban Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Belarus frees 123 prisoners including Ales Bialiatski as US lifts sanctions",
      "'Never give up': Belarusian prisoners celebrate release after US lifts sanctions",
      "Belarus Frees Prominent Political Prisoners as U.S. Lifts Some Trade Sanctions",
      "Belarus releases 123 prisoners including opposition leaders after US lifts sanctions",
      "Belarus frees Nobel winner, top opposition figures as U.S. lifts more sanctions",
      "Belarus Frees 123 Political Prisoners as US Lifts Potash Ban - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/13/belarus-frees-123-prisoners-including-ales-bialiatski-as-us-lifts-sanctions?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cvg1r89m6g7o?at_medium=RSS&at_campaign=rss",
      "https://www.nytimes.com/2025/12/13/world/europe/belarus-frees-prisoners-trade-sanctions.html",
      "https://www.theguardian.com/world/2025/dec/13/belarus-releases-123-prisoners-including-opposition-leaders-after-us-lifts-sanctions",
      "https://www.cbc.ca/news/world/belarus-frees-prisoners-9.7014930?cmp=rss",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxNVU1lLWU0bE9vZmdJUHRqcU9FdG1ZR05uMFVsZUJxWkdSWkx1aFJHUHlEU2duZmZOY2ZDWW9RX3lXalFza3pYWF9SdFNKVjdXTHVPTi1vX0JvUXRjTmFpSlhXc1FnazZtenVPZFZtSjBzSlg3RGw4MERPZU9xWDZKY2Nubm5kb3ZTbXg0N09LUWF1R1VZWnRmVDlHSHRPc0lHSklWZHNSTnNxYzZGeVE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/13/belarus-frees-123-prisoners-including-ales-bialiatski-as-us-lifts-sanctions?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.587,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.792,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about the political situation in Belarus and the impact of US sanctions. However, it doesn't provide information on the solutions or improvements to the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Belarusian President Alexander Lukashenko has released 123 prisoners, including Nobel Peace Prize winner Ales Bialiatski and opposition figure Maria Kalesnikava, following negotiations with a U.S. envoy. The releases came as the United States lifted its sanctions on Belarusian potash exports. The freed prisoners include several prominent political figures.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "John Cena ends wrestling career after losing final match to Gunther",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 09:15:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "bbc.com",
      "espn.com",
      "cbssports.com",
      "forbes.com"
    ],
    "snippets": [
      "The actor and wrestler brought the curtain down on a 24-year career that saw him become one of wrestling's biggest stars.",
      "After sending John Cena out on a loss, Gunther has a new 'legend killer' nickname, and young talent shines.",
      "All the information you need to watch John Cena's final match at WWE Saturday Night's Main Event live event in Washington, D.C.",
      "John Cena tapped out to Gunther in his final match at WWE Saturday Night's Main Event. Here are the five huge takeaways and full results.",
      "John Cena wrestled his last match at WWE Saturday Night's Main Event, and it went down in spectacular fashion.",
      "John Cena did what was best for business in his final match. In doing so, he further proved he is the G.O.A.T. Here's what happened in his final match.",
      "WWE Saturday Night's Main Event marked the retirement of John Cena, who shockingly tapped out to Gunther in his final match.",
      "WWE Saturday Night's Main Event featured a high-flying tag team match, and AJ Styles and Dragon Lee vs. Leon Slater and Je'Von Evans stole the show.",
      "WWE Saturday Night's Main Event marked the biggest win in the career of Sol Ruca, who wowed the crowd in her win over Bayley.",
      "Drew McIntyre showed up at WWE Saturday Night's Main Event to attack Cody Rhodes and ruin the WWE Champion's match with NXT's Oba Femi.",
      "Oba Femi and Cody Rhodes fought to a disqualification finish after Drew McIntyre interfered in a heated opener.",
      "WWE Saturday Night's Main Event live results, winners and updates on December 13, 2025 for John Cena's final match."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bbea/live/a3411430-d8ca-11f0-a8dc-93c15fe68710.jpg",
    "titles": [
      "Watch: John Cena takes his final bow, after last ever WWE fight",
      "John Cena takes his last bow at WWE Saturday Night's Main Event",
      "John Cena final match: Start time, where to watch legendary wrestler on Saturday Night's Main Event",
      "WWE Saturday Night’s Main Event Results: 5 Takeaways After John Cena's Final Match",
      "WWE Saturday Night’s Main Event Takeaways As John Cena Calls It Quits",
      "WWE Saturday Night’s Main Event Results: Did John Cena Win His Last Match?",
      "WWE Saturday Night’s Main Event Results As John Cena Taps Out To Gunther, Retires",
      "WWE Saturday Night’s Main Event Results As AJ Styles, Dragon Lee Win",
      "WWE Saturday Night’s Main Event Results As Sol Ruca Upsets Bayley",
      "WWE Saturday Night’s Main Event Results As Drew McIntyre Attacks Cody Rhodes",
      "WWE Saturday Night’s Main Event Results As Oba Femi Vs. Cody Rhodes Is Spoiled",
      "WWE Saturday Night’s Main Event Live Results And Winners On Dec. 13, 2025"
    ],
    "url": "https://www.bbc.com/news/videos/cy4xgxm2848o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.espn.com/wwe/story/_/id/47300293/wwe-john-cena-takes-last-bow-saturday-night-main-event",
      "https://www.cbssports.com/wwe/news/2025-wwe-saturday-nights-main-event-date-location-john-cena-final-match-card-start-time/",
      "https://www.forbes.com/sites/brianmazique/2025/12/13/wwe-saturday-nights-main-event-results-5-takeaways-after-john-cenas-final-match/",
      "https://www.forbes.com/sites/robwolkenbrod/2025/12/13/wwe-saturday-nights-main-event-takeaways-as-john-cena-calls-it-quits/",
      "https://www.forbes.com/sites/brianmazique/2025/12/13/wwe-saturday-nights-main-event-results-did-john-cena-win-his-last-match/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-results-as-john-cena-taps-out-to-gunther-retires/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-results-as-aj-styles-dragon-lee-win/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-results-as-sol-ruca-upsets-bayley/",
      "https://www.forbes.com/sites/blakeoestriecher/2025/12/13/wwe-saturday-nights-main-event-results-as-drew-mcintyre-attacks-cody-rhodes/",
      "https://www.forbes.com/sites/alfredkonuwa/2025/12/13/wwe-saturday-nights-main-event-results-as-oba-femi-vs-cody-rhodes-is-spoiled/",
      "https://www.forbes.com/sites/alfredkonuwa/2025/12/13/wwe-saturday-nights-main-event-live-results-and-winners-on-dec-13-2025/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/videos/cy4xgxm2848o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.97,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.79,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "John Cena wrestled his final match at WWE Saturday Night's Main Event in Washington, D.C. on December 13, 2025, tapping out to Gunther. The event marked Cena's retirement after a 24-year wrestling career. Gunther, now nicknamed the \"legend killer,\" defeated Cena. Other highlights included Sol Ruca defeating Bayley, and Drew McIntyre interfering in a match between Cody Rhodes and Oba Femi, leading to a disqualification.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Israel says it killed Hamas commander Raed Saad in Gaza City",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T20:35:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Reuters",
      "Al Arabiya",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "news.google.com",
      "washingtonpost.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Israel has said it killed \"one of the architects\" of Hamas' October 7 attack in a targeted strike in Gaza City. Israel says the strike was in response to a bomb explosion that injured two soldiers earlier Saturday.",
      "There was no immediate confirmation from Hamas or from medics that Saad was among the dead.",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza Reuters",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza Al Arabiya English",
      "The Israel Defense Forces said Raed Saad had worked to reestablish Hamas’ capabilities and weapons manufacturing. Hamas said the strike violated ceasefire.",
      "Hamas said the attack on Saturday was a breach of the truce. The militant group did not comment on Israel’s claim to have killed one of its members.",
      "If Saed is dead he would be most senior militant to be killed since October ceasefire, in attack on car that reportedly left four dead The senior Hamas commander Raed Saedhas been killed in a strike on a car in Gaza City, the Israeli military said on Saturday. The attack killed four people and wound",
      "Israel says it has killed a top Hamas commander in Gaza AP News",
      "Hamas's Gaza chief Khalil al-Hayya says Raed Saad was among five people killed in an Israeli attack in Gaza."
    ],
    "image_url": "",
    "titles": [
      "Senior Hamas leader killed in Gaza strike, Israel says",
      "Israel claims to have killed senior Hamas commander, Raed Saad, in Gaza",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza - Reuters",
      "Israel says it killed senior Hamas commander Raed Saed in Gaza - Al Arabiya English",
      "Israel says it has killed Hamas leader in Gaza, challenging fragile truce",
      "Israel Says It Killed Senior Hamas Commander, Despite Cease-Fire",
      "Israel says its military killed Hamas commander Raed Saed in Gaza City strike",
      "Israel says it has killed a top Hamas commander in Gaza - AP News",
      "Hamas confirms killing of senior commander in Israeli attack in Gaza"
    ],
    "url": "https://www.dw.com/en/senior-hamas-leader-killed-in-gaza-strike-israel-says/a-75147822?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/12/13/israel-says-it-hit-key-hamas-member-in-gaza-city?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPVUxvYzhpWF8tQkhvbG9KRWJUSndsbDFQSHlEaWlLMTVRVXB3dFh0Ry1xcEhLOVctQXBDYWhSM1UxN1lWS0wxd3ltNFhVbFBiUnFLWl9fWVpybWxJS3NzdVV5NDdMcE55N1lrd2FmUDJ3a0NmckYxVGZpRXZFT0JiTk1pMWNMUm5aZldWbG5RUjg2eV9MSGVBRzNpYm5laS01RnFGTWdJcXgzRFdjMENzNXo3UFZWc2JhaWljTTd3?oc=5",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxQWktLaFJxRm81MHhRR0RCel92RXczRzl6TXV1SjlKU2Uza3VwclVWYkRDUDAyTWJuQVNVb0tWX0FxZFNTS3UzUkR2X0F6N2hFb2cyTEdUdmkzcGs0eElQTHlVQmVSMXk3bFhjSGNkd0hiR1Y1eUNGNFljeHlqQ1A3dUpzR3I1cXBwY0ZsLUhxM1NsZ0hmS1RyZFlFYXRGLTdTb0JhRE03U1pPYmpJcmx1ZmV2TThIMVA1ODZkOUtRVXA5aFZSX3hn0gHMAUFVX3lxTFBtNUFSMGVsc0lkdWFLRlk1emN4NmJwX18zckU4eHVSMU1rMXNYTkJvcmxJWnU2YUJrX1JxR1k5SE1GT0pkbnk2OERDaWtCd0c1d3hEb3U4bG5BV01HMVp6RDdPQ2RubngxTkt1WXltQWE0QWxOQW02aVF4VnFacC1hWUFISGJqOF93bzV3MmgyRTVFTlZwX0U0NzZuVkhHZmw5MXlJa1V1UTlfSmZ4Vm95NXVjV3p6eFcta2RXS0hkbjkyV2RRaDQ3bWtFcg?oc=5",
      "https://www.washingtonpost.com/world/2025/12/13/raed-saad-hamas-killed/",
      "https://www.nytimes.com/2025/12/13/world/middleeast/israel-hamas-commander-gaza-strike.html",
      "https://www.theguardian.com/world/2025/dec/13/israel-says-its-military-killed-hamas-commander-raed-saed-in-gaza-city-strike",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxQUnRqeGNHS0l2YmZGelM0a0FMTzBCcUxxR0dpUXNWdml2TmplOVdzRFdUVXc1YkV5R09WbFo4NXpXVHF6cFpRUzFvbnZpY2p4VWFQYUtOdWRQUEdTRk9HSFo4c1JpQ2dYbTRDZUwwYmZZTnVSQWxVbVpUVlJESURTaDVtOTdIR0w0WDFKeG1BZ3JUOHhKWERQb19n?oc=5",
      "https://www.aljazeera.com/news/2025/12/14/hamas-confirms-killing-of-senior-commander-in-israeli-strike-in-gaza?traffic_source=rss"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/senior-hamas-leader-killed-in-gaza-strike-israel-says/a-75147822?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.682,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.785,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a significant event in the ongoing conflict between Israel and Hamas. However, it does not provide much depth or insight into the broader context or implications of this event.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israel says it killed senior Hamas commander Raed Saad in a targeted strike on a car in Gaza City, reportedly killing four or five people. Saad was described by Israel as one of the planners of the October 7 attack and involved in rebuilding Hamas’ military capabilities. Hamas said the strike violated the ongoing ceasefire but did not immediately confirm Saad’s death.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shooting at Bondi Beach leaves several hurt and some dead",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 09:15:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Police in Australia say they are responding to a developing incident at Sydney’s Bondi Beach after reports of gunshots.",
      "Multiple injures at Sydney's Bondi Beach after shooting, two in custody Reuters",
      "Police say more information will be provided when it is available. Follow updates live Main report: NSW police advise people to ‘take shelter’ after Bondi mass shooting What we know so far about the Bondi beach attack The prime minister, Anthony Albanese, just released a statement. He said: The scen",
      "Police say two people arrested, with reports of ‘numerous’ fatalities and people taken to multiple hospitals Bondi beach shooting live updates New South Wales police say two people are in custody following a mass shooting at Bondi beach during which at least a dozen gunshots were fired in the area."
    ],
    "image_url": "",
    "titles": [
      "Bondi Beach shooting live: Two in custody; Sydney police operation ongoing",
      "Multiple injures at Sydney's Bondi Beach after shooting, two in custody - Reuters",
      "Bondi beach shooting live updates: two people in custody as PM urges public to follow police guidance amid ‘shocking and distressing’ scenes",
      "Bondi beach mass shooting: NSW police advise people to ‘take shelter’ with two in custody"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2025/12/14/bondi-beach-shooting-live-two-in-custody-sydney-police-operation-ongoing?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxQM0VnZjhqQjIxZkhhYXIwRHRJb3h1Y1A0MGV4R0dnVWczbTY0aTY1a1R1SnI0S1JWYzlCVDdYWXlwSlhTbXk5R01QLU8zaUtmcnFEOVFMVGo3ZVRvQlo4bm5YV1RsYk41Y1NrNDFjSUp2aTg0clJydEh3NTQ2SjFuN1gyME91M2xfcmU0UFduOEhsLUIxZFVmNEV5OU5EOVVOZGNpVHN3VDhtdTY0T0JVaDFaZ2M4S3lmTVE?oc=5",
      "https://www.theguardian.com/australia-news/live/2025/dec/14/nsw-police-responding-to-reports-of-shooting-at-sydneys-bondi-beach-follow-latest",
      "https://www.theguardian.com/australia-news/2025/dec/14/police-advise-people-to-take-shelter-following-reports-of-active-shooter-at-bondi-beach"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2025/12/14/bondi-beach-shooting-live-two-in-custody-sydney-police-operation-ongoing?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.777,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Similar to the first story, this article provides basic awareness about an ongoing police operation but lacks depth or insight into the broader context or implications of such incidents.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A mass shooting occurred at Sydney's Bondi Beach, with police confirming multiple injuries and reports of several fatalities. At least a dozen gunshots were fired, and people have been taken to multiple hospitals. Two individuals are in custody. New South Wales police have advised people to take shelter, and authorities are continuing to respond to the incident.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Shooting at Brown University leaves two dead and eight hurt",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T23:48:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "NPR",
      "Axios",
      "The Guardian",
      "CBC News",
      "Bloomberg",
      "Associated Press",
      "Fortune"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "bbc.com",
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "cbc.ca",
      "fortune.com"
    ],
    "snippets": [
      "The suspect in the shooting is still at large. Officials in the east coast US city of Providence have ordered residents near the university to shelter in place. DW has more.",
      "Over 400 law enforcement personnel deployed as search continues for the suspect of shooting in US state of Rhode Island.",
      "The gunman is at large after opening fire in a building where exams were taking place at the campus in Providence, Rhode Island.",
      "Two people were killed after a gunman attacked students at Brown University in Providence, Rhode Island.",
      "Authorities are searching for a suspect described as \"a male dressed in black\" who fled the Ivy League's Rhode Island campus on foot following the Saturday afternoon shooting.",
      "Two killed, 8 injured in shooting at Brown University Axios",
      "Mayor of Providence, Rhode Island, says ‘shooter’ still at large, as officials embark on widespread manhunt Brown University shooting: follow live updates What we know so far about the Brown University shooting At least two people were killed and nine more critically injured in a shooting on Saturda",
      "A shooting in the engineering building at Brown University on Saturday has left at least two people dead and eight critically injured, officials in Providence, R.I., said, as authorities continued to search for a suspect.",
      "Two Dead, Eight Injured in Shooting at Brown University Bloomberg.com",
      "2 people were killed and 9 others injured in shooting at Brown University AP News",
      "The suspect was a male who was dressed in black and last seen leaving the building, said Timothy O’Hara, Deputy Chief of Police."
    ],
    "image_url": "",
    "titles": [
      "US: At least 2 killed in shooting at Brown University",
      "Manhunt under way for shooter after two students killed at Brown University",
      "Manhunt continues after two killed in shooting at Brown University",
      "Police release CCTV footage of Brown University shooting suspect",
      "2 killed and 9 injured in Brown University shooting, no suspect in custody",
      "Two killed, 8 injured in shooting at Brown University - Axios",
      "Two people dead and nine wounded in mass shooting at Brown University, as suspect remains at large",
      "2 killed, 8 injured in Brown University shooting, Rhode Island officials say",
      "Two Dead, Eight Injured in Shooting at Brown University - Bloomberg.com",
      "2 people were killed and 9 others injured in shooting at Brown University - AP News",
      "At least 2 killed and 8 injured hurt in shooting at Brown University with suspect still at large"
    ],
    "url": "https://www.dw.com/en/us-at-least-2-killed-in-shooting-at-brown-university/live-75148567?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/12/13/brown-university-in-us-reports-active-shooter-situation-on-campus?traffic_source=rss",
      "https://www.bbc.com/news/articles/cre329w709qo?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/news/videos/cm20y83drd2o?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/12/13/nx-s1-5643588/brown-university-shooting",
      "https://news.google.com/rss/articles/CBMiakFVX3lxTE5KQ1RySzZFVHRwQzg4RWZOYWFlSjBJblN0NnFWUGR0eUtYWWdmZjNqdDB3ZWM4Z0xtbWxnT2g5b1lJR2dVbmptUS1zdFR1LXJoZHczZHB6d05BODhNendBWlJzd1JGYjNzOEE?oc=5",
      "https://www.theguardian.com/us-news/2025/dec/13/brown-university-shooting",
      "https://www.cbc.ca/news/world/brown-university-active-shooter-rhode-island-9.7015097?cmp=rss",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxOdjVMdTNLZU9TLTBNYUNsdkFLWWRnMnk4VkNabzU2ekJ3QlNoZzhpWUYwaldXWEtFMG85cmlSMVJ4TTFUZnBGR3hhR3NpT1BMWkF5YXBybk1VVkxaU2VqVEY4Ukt6bWcwZ3NaekpCeU5wTk1WWEVlSnRyb0g1VGdkRVdxUmdQeDlKZjRLaTBzRnoyZHFCT1V2ek5ybUVTYWFKTm41SHlJRnN6N2VNZ2c?oc=5",
      "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1tT1lLYzRIRmljYTBadEs2MTE4TGJmX2pMMWxFVVctRHVWXzl0RDcxYzhNWmVKOUlRQTRQUnZaV0NyZlc2bGhXcU5DaVR2elBUblBaM0xxT2lXZU56NkFvS0h4djdVdWZ2?oc=5",
      "https://fortune.com/2025/12/13/brown-university-school-shooting-victims-suspect-custody/"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/us-at-least-2-killed-in-shooting-at-brown-university/live-75148567?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.746,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A shooting at Brown University in Providence, Rhode Island, on Saturday left two people dead and at least eight injured. The suspect, described as a male dressed in black, remains at large. Over 400 law enforcement personnel are searching for the shooter, and officials have ordered residents near the university to shelter in place as the manhunt continues.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Gunman kills two US soldiers and interpreter in Syria patrol",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T18:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Washington Post",
      "New York Times",
      "Bloomberg",
      "Fortune",
      "CBC News"
    ],
    "domains": [
      "dw.com",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com",
      "fortune.com",
      "cbc.ca"
    ],
    "snippets": [
      "US Central Command said two service members and a civilian were ambushed by a lone \"Islamic State\" gunman in central Syria. It is the first deadly incident involving US forces since Bashar Assad was ousted last year.",
      "A joint U.S.-Syrian security patrol was attacked in the city of Palmyra, the Pentagon and Syria’s state news agency said.",
      "Two soldiers and a civilian interpreter were killed while supporting counterterror operations, the Pentagon said. They are the first U.S. casualties in Syria since the fall of the dictator Bashar al-Assad.",
      "Trump Vows Retaliation After US Soldiers Killed in Syria Bloomberg.com",
      "The attack on U.S. troops in Syria is the first to inflict casualties since the fall of President Bashar Assad a year ago.",
      "Three U.S. military personnel — two army soldiers and a civilian interpreter — were killed on Saturday after an attacker targeted a convoy of American and Syrian forces, the U.S. military said."
    ],
    "image_url": "",
    "titles": [
      "Two US troops killed in Syria, Trump vows 'retaliation'",
      "Trump vows to retaliate after U.S. troops killed in Syria",
      "3 Americans Killed in ISIS Attack in Syria, Trump Says, Vowing to Retaliate",
      "Trump Vows Retaliation After US Soldiers Killed in Syria - Bloomberg.com",
      "Trump pledges retaliation after 3 Americans are killed in Syria attack that the U.S. blames on the Islamic State group",
      "Trump vows 'very serious retaliation' after deadly ambush on U.S. military convoy in Syria"
    ],
    "url": "https://www.dw.com/en/two-us-troops-killed-in-syria-trump-vows-retaliation/a-75147344?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/13/syria-attack-soldiers-killed/",
      "https://www.nytimes.com/2025/12/13/world/middleeast/us-forces-attacked-syria.html",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxQRVJ4NGdPMjViZ1hKajFzdzlmc1J4S0gtaXZGMkpweHZ4bkl4VWVBN3k2LXZ1dF95NTdvaW5GWVN3RnNUX3dKMDRQQXFFazl4bWJOSW5RSzNsVlNSUGlLT2VNR1NrQ3lWRjZvMmlsYzVZcGJ5UEZKcWRib2l6OTZaX3BXbmQ0a09NMkJPWmNPOFNjWUR1bERVRENVNlUtT2ZOb0N0djZjaXcxYW9mUlN5TURtdw?oc=5",
      "https://fortune.com/2025/12/13/us-troop-casualties-american-civilian-islamic-state-ambush-attack-syria-central-command/",
      "https://www.cbc.ca/news/world/syria-attack-u-s-soldiers-9.7014999?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/two-us-troops-killed-in-syria-trump-vows-retaliation/a-75147344?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.642,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.743,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Two U.S. soldiers and a civilian interpreter were killed in central Syria when a lone Islamic State gunman ambushed a joint U.S.-Syrian patrol in Palmyra, according to U.S. Central Command and the Pentagon. This is the first deadly incident involving U.S. forces in Syria since the ouster of Bashar al-Assad last year. Former President Trump has vowed retaliation following the attack.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "United Airlines plane returns safely after engine fire no injuries",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 17:16:27 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Bloomberg",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Shortly after departing the Virginia airport on Saturday, the Tokyo-bound plane's engine cover separated and caught fire, according to the transportation secretary. No injuries were reported.",
      "Engine failure forces United Airlines flight to return to DC-area airport Reuters",
      "United Flight to Tokyo Returns to Dulles After Engine Fails Bloomberg.com",
      "United Airlines flight safely returns to Dulles airport after engine failure during takeoff AP News"
    ],
    "image_url": "",
    "titles": [
      "United Airlines flight returns to Dulles airport after engine loses power during takeoff",
      "Engine failure forces United Airlines flight to return to DC-area airport - Reuters",
      "United Flight to Tokyo Returns to Dulles After Engine Fails - Bloomberg.com",
      "United Airlines flight safely returns to Dulles airport after engine failure during takeoff - AP News"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643589/united-airlines-flight-dulles-airport-engine",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxOeFBPRl93U0pwc21hZzBhc0h5TkxfMkdVc1NRSldPUzVPSm0xNmhJdWNQRGl1bGdkaU4wbkFPclcwZmVjamNMNC02ZUszeFltN2dFTERrQ3pXOUxERTNMU3R3UFN5NFhsV2dhZk9QTGw1bjB0N1duY1JWemlOQnV3VUQwT1pzd3hkX1hxZG1wSDNGLTYzOVc2d3ZjZ0l2eFRzV2FYZ3owTlZlYnZGdUozMHpVRTZiZWVXYnhSU1E3Y1hSSTRVZm52cE13?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQTmZ5d21VbG1aR2JhaW04VnRvYk1oNi1rZE10aEJFblJmSm4zVkRqcFgtWTdqZTBYcUFOM2JVUnc2cGdQdGkyMFdtR0xLZUhFTVJXWDEwUjlfUFFoMEtQRFV3Yk9paThybjlNVEtxYlNBOVBXTTR4dXlzcTVlV3RlaFNMbXpFdzV0ZHMzNTJMTWRManh6eFFMeURZU0Fwc016TWtxU0p4T09fOVl4Y0w5Mzhn?oc=5",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQnNQbGR5WHpYQk9heUlGTFhnekd2SGIyMDQxcWVfMkxoblduV2hXcjZyVkR6RmlMd1ljSVR3S09BN3N4SkV4M2JyU1EyN3Y3QVZaV1Bza2RnNlRMc042dFVEcnNPSy1BQ25ZbmtaNzZManpvMzdpX3hTeDkwVUpXd3BSaGNrcmdXUlpUT1QwckU?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643589/united-airlines-flight-dulles-airport-engine",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.715,
      "consensus": 0.868,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.737,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A United Airlines flight bound for Tokyo returned safely to Dulles airport shortly after takeoff when its engine cover separated and caught fire, according to the transportation secretary. No injuries were reported. The incident occurred on Saturday, and all passengers and crew were safely evacuated.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Drone strike kills six UN peacekeepers at Sudan base",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-14T03:35:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Sudan's military blamed the paramilitary RSF for the strike, which in turn denied responsibility. UN Secretary General Antonio Guterres said that such attacks \"may constitute war crimes.\"",
      "UN says six Bangladesh peacekeepers were killed when a drone strike hit Sudan's central region of Kordofan.",
      "Bangladeshi peacekeepers were killed in the attack on Kadugli, which the Sudanese army has blamed on the RSF.",
      "Bangladesh says peacekeepers killed, injured in Sudan UN base attack Reuters"
    ],
    "image_url": "",
    "titles": [
      "Sudan: Drone attack kills 6 UN peacekeepers from Bangladesh",
      "UN condemns killing of Bangladeshi peacekeepers in Sudan drone attack",
      "UN chief condemns ‘horrific’ drone attack in Sudan as 6 peacekeepers killed",
      "Bangladesh says peacekeepers killed, injured in Sudan UN base attack - Reuters"
    ],
    "url": "https://www.dw.com/en/sudan-drone-attack-kills-6-un-peacekeepers-from-bangladesh/a-75149035?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/12/14/un-condemns-killing-of-bangladeshi-peacekeepers-in-sudan-drone-attack?traffic_source=rss",
      "https://www.aljazeera.com/news/2025/12/13/bangladesh-peacekeepers-killed-attack-un-base-abyei-sudan?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQaDI1WERfT0tUME02NlRQVkJnMXlQZnBRVlQ4UE02RWRoZUthTnVpZ0Q1N3Q2dzlDR0JCWDd1SWlydVN0RDBfRzhiTkJ1SGdnUDVvMGgwRWZYNS1mX0NTczVpWGdqU2NuT0FfSGhuQzBPa3dkdFRuUWtvcDdxNXNfQXc4Z2tQWEh4a18xT3laSHJZb0J4VVJXZnV1SW5DaTl1anhhc19rOXNxbzAwd0V0UEt3RVcxWVJpbHVR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/sudan-drone-attack-kills-6-un-peacekeepers-from-bangladesh/a-75149035?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.828,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.734,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a drone attack in Sudan, but it does not offer any deeper understanding, actionable insights, or report on solutions or attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A drone strike hit a UN base in Kadugli, central Kordofan, Sudan, killing six Bangladeshi peacekeepers and injuring others. The Sudanese military blamed the paramilitary Rapid Support Forces (RSF), which denied involvement. UN Secretary General Antonio Guterres stated that such attacks may constitute war crimes.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Gunman shoots at Brown University two killed nine hurt campus locked",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T22:15:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "ABC News",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "Hundreds of police officers are hunting for a gunman who killed two people and wounded nine others at Brown University in the US state of Rhode Island. The Ivy League campus remains under lockdown.",
      "A massive police operation is under way following the latest deadly attack at a US educational institution.",
      "Two people were killed and nine were wounded after a shooter opened fire at Brown University on Saturday, officials said.",
      "Brown University shooting leaves 2 dead, 9 injured as police search for killer Reuters"
    ],
    "image_url": "",
    "titles": [
      "Brown University shooting: Police say 'multiple' people shot",
      "Brown University shooting: What we know so far",
      "Brown University shooting: Police release video of 'person of interest'",
      "Brown University shooting leaves 2 dead, 9 injured as police search for killer - Reuters"
    ],
    "url": "https://www.dw.com/en/brown-university-shooting-police-say-multiple-people-shot/a-75148185?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/12/14/brown-university-shooting-what-we-know-so-far?traffic_source=rss",
      "https://abcnews.go.com/US/brown-university-active-shooter-reported-campus/story?id=128379676",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcV9MZTRuZnhHNnJjQWlteXVNWEV1aE1mX0NLRERWSU5vWlh6OXFOVFVKdlRpVTFwZ3hsb3RLZGZRZ0lxRkNiZVBPUk5fb2Via1lJMmlrc2JlNjAwcXJNMlFYa3BUd3hZbzlDUWZTMXhzdHQxdXJtU0FNZU9KckJFRFJUdDNzd0MxTDU5MFdKSjMwVTJaSHBwZktfN1A?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/brown-university-shooting-police-say-multiple-people-shot/a-75148185?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.714,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story is purely reactive and sensational. It reports on a tragic event but does not provide any actionable insights, solutions, or deeper understanding of the underlying issues.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A gunman opened fire at Brown University in Rhode Island on Saturday, killing two people and injuring nine others. The campus remains under lockdown as hundreds of police officers search for the suspect. Authorities have launched a large-scale operation in response to the attack.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Iran foreign minister will visit Russia and Belarus soon",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 07:32:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Iran's foreign minister to visit Russia and Belarus, foreign ministry says Reuters",
      "Iran’s foreign minister to visit Russia and Belarus, foreign ministry says Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Iran's foreign minister to visit Russia and Belarus, foreign ministry says - Reuters",
      "Iran’s foreign minister to visit Russia and Belarus, foreign ministry says - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNT05OQjJDMXpkSVlYWDhjQVl6TFFHbE5sazBwYjFRTGRkbXhualdGT2ZSZGI3VTNiN202ZU5pSXpTUXZxY0lFV29fX0trdG1lRHhEMHhZd1oyQWZRcFA4YWVEOFRrSmlhWGFmbXlvX3lucWd3ZHRVT3Z6OTllX3JzU1JxTk8yaEJtMHdJcjJmYmJhTDBuRHpNNFpmS3BMNW5sQUlqSzhVcUdKX3E3V2xBNElxSUJnbkhlYXFR?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPMEVHZzFxRjUyWEttLVVpa0RYRzZNWC1xWUpJSkx1U2RyYlBLV093QWpjT0JsMlY3azhza1ZEN1VXM0dKQVZKb29VcXJ6ZExONXN0X1RMSTJVcWFDcE12dXAyODZ3VTQ4UHpqdDJmZ0FuWTh5QVBuUlNoYnd5cnh6NEtYcHhpSFNxMS14QTFlNXlSOWFibk1mWnlfcFRJMGRXWUxzZzdJTkc0TXhvdmEya1lwYnVfQUVxVHY5WG81Q3F0RVVHNEJmZV9PbUN1dTI00gHQAUFVX3lxTE8wRUdnMXFGNTJYS20tVWlrRFhHNk1YLXFZSklKTHVTZHJiUEtXT3dBamNPQmwyVjdrOHNrVkQ3VVczR0pBVkpvb1VxcnpkTE41c3RfVExJMlVxYUNwTXZ1cDI4NndVNDhQemp0MmZnQW5ZOHlBUG5SU2hid3lyeHo0S1hweGlIU3ExLXhBMWU1eVI5YWJuTWZaeV9wVEkwZFdZTHNnN0lORzRNeG92YTJrWXBidV9BRXFUdjlYbzVDcXRFVUc0QmZlX09tQ3V1MjQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNT05OQjJDMXpkSVlYWDhjQVl6TFFHbE5sazBwYjFRTGRkbXhualdGT2ZSZGI3VTNiN202ZU5pSXpTUXZxY0lFV29fX0trdG1lRHhEMHhZd1oyQWZRcFA4YWVEOFRrSmlhWGFmbXlvX3lucWd3ZHRVT3Z6OTllX3JzU1JxTk8yaEJtMHdJcjJmYmJhTDBuRHpNNFpmS3BMNW5sQUlqSzhVcUdKX3E3V2xBNElxSUJnbkhlYXFR?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.571,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Iran's foreign minister's visit to Russia and Belarus. However, it lacks depth or insight into the implications or purpose of the visit, and does not report on any solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Iran’s foreign ministry announced that the country’s foreign minister will visit Russia and Belarus. The visit aims to discuss bilateral relations and regional developments. No further details about the agenda or outcomes have been provided.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "49ers place Brandon Aiyuk on reserve list ending his season",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 02:34:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The 49ers placed Brandon Aiyuk on the reserve/left team list on Saturday, likely ending the receiver's tenure in San Francisco.",
      "Brandon Aiyuk’s 49ers tenure has practically come to and end. The San Francisco 49ers have placed the injured wide receiver on the reserve/left squad list, officially ending his season before it even started, Ian Rapoport of the NFL Network reported on Saturday."
    ],
    "image_url": "",
    "titles": [
      "49ers place injured Aiyuk on reserve/left team list",
      "49ers place WR Brandon Aiyuk on reserve/left squad list, ending his season"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47296496/49ers-place-brandon-aiyuk-reserve-left-team-list",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47296496/49ers-place-brandon-aiyuk-reserve-left-team-list",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.75
    },
    "score": 0.699,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The San Francisco 49ers have placed wide receiver Brandon Aiyuk on the reserve/left team list, effectively ending his season before it began. This move likely marks the end of Aiyuk's time with the 49ers.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Thailand sets curfew as fighting with Cambodia gets worse",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 06:05:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Thailand declares curfew along coast as Cambodia border fighting spreads Reuters",
      "Thailand vows to keep fighting Cambodia after Trump ceasefire claim Reuters",
      "Thai PM says military will keep fighting and Cambodia suspends border crossings as casualties rise Thailand-Cambodia fighting explained Thailand’s caretaker prime minister has denied the existence of a ceasefire with Cambodia, despite Donald Trump announcing that both countries had agreed to halt fi"
    ],
    "image_url": "",
    "titles": [
      "Thailand declares curfew along coast as Cambodia border fighting spreads - Reuters",
      "Thailand vows to keep fighting Cambodia after Trump ceasefire claim - Reuters",
      "Thailand denies Trump ceasefire claim as clashes with Cambodia continue at border"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOTGgtWFhxT1pBU2VsVVJXN0hRem9CX2dVSW1rWm5pdkdHaTRuSFFGUE1MOVBlSWJjeDE5aDE4eHpSSGtyU0lteTBnVFRRNWtHS2E4ajVsREhJU1J5VXI4VWhsS2N5Ylp0MnZ3VVRzbVlNTTZ4TkFHNzZDUHdJVjJHbGxha0M0cU9LcE5ESFYwSVh0UkJwOU5HbVFUX284YkpXTmdaQl84Mm9VNk5Pc00zLVpwd3RKbE5wSWFoZ1JmdG43QQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxPMjU1TmRPZEtjcUczdWxyLVdDQlpVbXhiSXdkX29Xd2wxQ2ZXaE5yc0t2Y3JvbmlOSmVJejdWNExJS0plNkVUblNWV0VoQmgwYW5FNV81ZWZYdUZubUFpTXFOZWZkc2NkbVlpc2dTajJXTnQyRDZXalN0U0t1RXBWeThYQXlJOGRvMWdfWDI1NUhDTUdsNXlwUXNEUE04Q2ZsTVlwNXppei1vanFLRkVqZGlQZFNOd1p1YVhvcjUzaTRPdjAwSFE?oc=5",
      "https://www.theguardian.com/world/2025/dec/12/thailand-and-cambodia-agree-to-restart-ceasefire-brokered-by-us-says-trump"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOTGgtWFhxT1pBU2VsVVJXN0hRem9CX2dVSW1rWm5pdkdHaTRuSFFGUE1MOVBlSWJjeDE5aDE4eHpSSGtyU0lteTBnVFRRNWtHS2E4ajVsREhJU1J5VXI4VWhsS2N5Ylp0MnZ3VVRzbVlNTTZ4TkFHNzZDUHdJVjJHbGxha0M0cU9LcE5ESFYwSVh0UkJwOU5HbVFUX284YkpXTmdaQl84Mm9VNk5Pc00zLVpwd3RKbE5wSWFoZ1JmdG43QQ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.691,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the conflict between Thailand and Cambodia, but it lacks depth or insight into the causes, implications, or potential solutions to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Thailand has imposed a curfew along its coast as fighting with Cambodia intensifies and casualties increase. Cambodia has suspended border crossings. Thailand’s caretaker prime minister denied claims by Donald Trump that a ceasefire had been agreed, stating that military operations will continue. The situation remains tense with ongoing conflict along the border.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fighting continues on Thailand Cambodia border after ceasefire deal",
    "domain": "politics",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sat, 13 Dec 2025 12:12:34 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
      "Fighting rages on Thai-Cambodian border despite Trump’s ceasefire claim AP News"
    ],
    "image_url": "",
    "titles": [
      "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
      "Fighting rages on Thai-Cambodian border despite Trump’s ceasefire claim - AP News"
    ],
    "url": "https://www.cbc.ca/news/world/thailand-cambodia-border-fighting-continues-9.7014953?cmp=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRGdhWjJFejAyYkVJN2lMU0YwVnhVdi05OWd3UU40SldiSjFGVWNWWGFpQ3NuVEZtTUZna2lTWlNLVUc1WWtzaHQ3SlRYekFyNHRYYlV2MDg1ZWNqWnVtMUMxUmNTX1JJSFkxY053NDFpWnJyakdjZVdPaWhfLTZSaVdZUXJfV041ZGtNc3g0V180WlBzbmRfZ2k4eUxLS25Sd3AxQklhQ0NPd0RXXzhB?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/world/thailand-cambodia-border-fighting-continues-9.7014953?cmp=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.621,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.687,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers a basic level of awareness about the ongoing conflict and the unsuccessful attempts at a ceasefire. However, it does not provide any actionable insights or deeper understanding of the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Connor McDavid scores twice as Oilers win over Maple Leafs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 14 Dec 2025 02:49:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Connor McDavid had two goals and an assist as the Edmonton Oilers thumped the Toronto Maple Leafs 6-3 on Saturday.",
      "Connor McDavid and Vasily Podkolzin scored two goals each and Leon Draisaitl supplied three assists as the Edmonton Oilers defeated the Toronto Maple Leafs 6-3.",
      "Blake Coleman potted a shorthanded goal in the second, and Morgan Frost tallied the overtime winner as the Calgary Flames downed the Los Angeles Kings 2-1. Adrian Kempe picked up the lone goal for the Kings in the loss.",
      "J.T. Miller buried a pair of goals including the overtime winner, while Noah Laba and Will Cuylle each had a goal and an assist to help the New York Rangers beat the Montreal Canadiens 5-4.",
      "Tyler Pitlick scored his first of the year, Jesper Wallstedt made 34 saves and Joel Eriksson Ek buried the game-winning goal with 22 seconds left to help the Minnesota Wild beat the Ottawa Senators 3-2.",
      "Gabriel Vilardi scored a pair of goals, Josh Morrissey tallied two assists, and Connor Hellebuyck made 24 saves in his return to the net as the Winnipeg Jets secured a 5-1 win over the Washington Capitals.",
      "Emil Heineman sniped the deciding goal in the shootout and Ilya Sorokin made 32 saves to help the New York Islanders top the Tampa Bay Lightning in a 3-2 win.",
      "Tyler Toffoli netted two goals and a pair of assists, Macklin Celebrini had three points and John Klingberg buried the game-winning goal in overtime to help the San Jose Sharks complete the comeback and beat the Pittsburgh Penguins 6-5.",
      "Nathan MacKinnon scored and added an assist, Scott Wedgewood made 27 saves and Victor Olofsson buried the game-winning goal to lead the Colorado Avalanche past the Nashville Predators 4-2.",
      "Brad Marchand potted two goals to increase his team-leading total to 18, while Anton Lundell and Sam Reinhart each tallied two points, as the Florida Panthers earned a 4-0 win over the Dallas Stars.",
      "Alex DeBrincat tallied two goals and an assist while Patrick Kane added two points of his own as the Detroit Red Wings earned a 4-0 win over the Chicago Blackhawks. John Gibson stopped all 26 shots for his second shutout in his last three games.",
      "Seth Jarvis picked up his team-leading 18th goal of the season, while Shayne Gostisbehere chipped in with two assists, as the Carolina Hurricanes earned a 4-3 shootout win over the Philadelphia Flyers. Trevor Zegras notched two points in the loss.",
      "Ben Hutton and Brayden McNabb each potted goals in the third period to lift the Vegas Golden Knights to a 3-2 comeback victory over the Columbus Blue Jackets. Mitch Marner tallied an assist on all three goals in the win."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/12/0808d408a395429063209ac5c289e0dd0f70535171d770c3011482d0ea9b3f1b.jpg?quality=65&strip=all",
    "titles": [
      "McDavid powers Oilers over Maple Leafs 6-3",
      "NHL Highlights: Oilers 6, Maple Leafs 3",
      "NHL Highlights: Flames 2, Kings 1 (OT)",
      "NHL Highlights: Rangers 5, Canadiens 4 (OT)",
      "NHL Highlights: Wild 3, Senators 2",
      "NHL Highlights: Jets 5, Capitals 1",
      "NHL Highlights: Islanders 3, Lightning 2 (SO)",
      "NHL Highlights: Sharks 6, Penguins 5 (OT)",
      "NHL Highlights: Avalanche 4, Predators 2",
      "NHL Highlights: Panthers 4, Stars 0",
      "NHL Highlights: Red Wings 4, Blackhawks 0",
      "NHL Highlights: Hurricanes 4, Flyers 3 (SO)",
      "NHL Highlights: Golden Knights: 3, Blue Jackets 2"
    ],
    "url": "https://globalnews.ca/news/11577109/mcdavid-powers-oilers-over-maple-leafs-6-3/",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11577109/mcdavid-powers-oilers-over-maple-leafs-6-3/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.682,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Connor McDavid led the Edmonton Oilers with two goals and an assist in a 6-3 win over the Toronto Maple Leafs. The Calgary Flames edged the Los Angeles Kings 2-1 in overtime, and the New York Rangers beat the Montreal Canadiens 5-4 in OT. The Minnesota Wild, Winnipeg Jets, New York Islanders, San Jose Sharks, Colorado Avalanche, Florida Panthers, Detroit Red Wings, Carolina Hurricanes, and Vegas Golden Knights also recorded victories in NHL action on December 14, 2025.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Glasgow Warriors come from behind to beat Toulouse",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 09:27:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Glasgow Warriors' stunning comeback victory over Toulouse in the Investec Champions Cup will do wonders for their confidence, says fly-half Adam Hastings."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6db2/live/3ed6ea20-d8ce-11f0-a8dc-93c15fe68710.jpg",
    "titles": [
      "'Statement' Toulouse win 'means the world' to Glasgow"
    ],
    "url": "https://www.bbc.com/sport/rugby-union/articles/czxg31g1l0vo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/statement-toulouse-win-means-world-093031391.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/rugby-union/articles/czxg31g1l0vo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.681,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Glasgow Warriors achieved a comeback victory over Toulouse in the Investec Champions Cup. Fly-half Adam Hastings stated that the win will boost the team's confidence. The result marks a significant success for Glasgow Warriors in the competition.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Three Americans killed in attack in central Syria",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 16:51:54 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Two U.S. soldiers, one interpreter killed in Syria, Pentagon says Reuters",
      "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria Reuters",
      "Two US soldiers, one interpreter killed in ISIS ambush in Syria Al Arabiya English",
      "US Central Command reports an ambush on Saturday, the first attack to inflict US casualties since fall of Bashar al-Assad Two US army soldiers and one American civilian interpreter have been killed and several other people wounded in an ambush on Saturday by the Islamic State group in central Syria,"
    ],
    "image_url": "",
    "titles": [
      "Two U.S. soldiers, one interpreter killed in Syria, Pentagon says - Reuters",
      "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria - Reuters",
      "Two US soldiers, one interpreter killed in ISIS ambush in Syria - Al Arabiya English",
      "Three Americans killed in Syria by suspected Islamic State gunman, Pentagon says"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSUJkV1RTV3ZEelpoQ2JSNEF4OUI1VU8wSGZxSlc4Y1ktbEJuc2wyMnNqaDRnc09kZnl1R0E2aUN0UFRXWWUyc3NOWUhMa1J0QUdVOHNQMEVqcmd2cmtfNUwzV3RjRVd5WWl1VDl1T3dnSDlpSzU3aU00eUhXaEpZZnZ1VzVJNHpqQW5XODh2VkNzU1Z3eTlsb0ljZnY3RVlldWtkdm0wSVpXLTV1OGJwbVpB?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPWXlEbkhJWU5LaWg5dUZEMHduZnpYdWNWY2J2OVRhNU8wbXJ6OEJFbThOY1BnQlhjWDdFQ0xYem80RXBjMDV4OUNlN0JtOFJnXzd5My1KZ0c3eWtyLTFneS12bU9tMVlEOE90TkxzbVFzeEdxbUZPTEp0Ri10MUFxY0xVRVI4VUxKMWs5TFg2SXBZQ295WTdlUE5wcmg4WTcxbGhTWWdieWJKQ1g2Qi1hSHF4d0QtWjRaRHFiR1ZvVEdDUQ?oc=5",
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxOT3hsczh3VUowQS0tUGdCcmR2TUpkSG9jc25XMnAzZ3U0eGw2a2VaT0pnalZ6NHpsOThBSEN6c2RRWDF6V0pKV3ZKN3dMVTYyaGRHajB3eklCM0ZGbVZYUFBsNGRKd09ySWhFUEwwWV9TM0ozTlRod1NncFpxWXFPYXpLMV9sQmdyZVNUelliNWszUDlHZXFWaVN4WXRuZGx0RHFxWm1OdldQcU9iUVIzNTRZMVhxZHE1S1VEOU9zcnBvU3Q4YlpTOHhR0gHPAUFVX3lxTE5vVjdhUHhzUFRralZQM1RlbzhxcUFWT1V6dkREWlMxUWVfbXZzZnFjS040bWdGU3p5dm9NYWVxSE1tUFV0a1NkMmNuUVhpQWZmeHhsV01yX1pvNlBRbnZVRjg1NHVCTVdkdHkwcHotOFRnNzJ2ZTdJdzA3bWFZSGE3NldqWmJDOFc4X3ZoVzFmRjc5TTlibmFjaEktdmhkWXNCSmhqWVB1dzIwOUpVcEthSWw2aWdpdGFybUFoQWxHdExnUkFkekRGZGlEUTQ1Zw?oc=5",
      "https://www.theguardian.com/us-news/2025/dec/13/americans-killed-syria-islamic-state"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSUJkV1RTV3ZEelpoQ2JSNEF4OUI1VU8wSGZxSlc4Y1ktbEJuc2wyMnNqaDRnc09kZnl1R0E2aUN0UFRXWWUyc3NOWUhMa1J0QUdVOHNQMEVqcmd2cmtfNUwzV3RjRVd5WWl1VDl1T3dnSDlpSzU3aU00eUhXaEpZZnZ1VzVJNHpqQW5XODh2VkNzU1Z3eTlsb0ljZnY3RVlldWtkdm0wSVpXLTV1OGJwbVpB?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.615,
      "consensus": 0.769,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.666,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is mainly reactive, reporting on a tragic event without providing further context or analysis. It does not contribute to a deeper understanding of the situation in Syria or offer any insights into potential solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Two U.S. soldiers and one American interpreter were killed, and several others wounded, in an ambush by Islamic State in central Syria on Saturday, according to the Pentagon and U.S. Central Command. This is the first attack resulting in U.S. casualties in Syria since the fall of Bashar al-Assad.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Victor Wembanyama helps Spurs beat Thunder and reach NBA Cup final",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 06:53:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Sportsnet"
    ],
    "domains": [
      "aljazeera.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Victor Wembanyama and San Antonio progress to the NBA Cup championship game after beating the defending NBA champions.",
      "Victor Wembanyama returned from a 12-game absence with 22 points and nine rebounds, giving San Antonio a surge and the Oklahoma City Thunder just its second loss with the 111-109 victory Saturday night putting the Spurs in the NBA Cup final."
    ],
    "image_url": "",
    "titles": [
      "Wembanyama, Spurs stun OKC Thunder to make NBA Cup final",
      "Wembanyama’s return lifts Spurs to NBA Cup final, hands Thunder second loss"
    ],
    "url": "https://www.aljazeera.com/sports/2025/12/14/wembanyama-spurs-stun-okc-thunder-to-make-nba-cup-final?traffic_source=rss",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/12/14/wembanyama-spurs-stun-okc-thunder-to-make-nba-cup-final?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Victor Wembanyama scored 22 points and had nine rebounds in his return from a 12-game absence, helping the San Antonio Spurs defeat the defending NBA champions 111-109. The win advances San Antonio to the NBA Cup championship game and gives the Oklahoma City Thunder only their second loss of the season.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "England coach says team will keep same batters for next match",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 06:18:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "Head coach Brendon McCullum says England are unlikely to make changes to their batting line-up for the crucial third Ashes Test in Adelaide.",
      "England head coach Brendon McCullum has hinted at an unchanged batting line-up for the third Ashes Test in Adelaide while brushing off questions that his job could be on the line if the tour of Australia spirals out of control."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9894/live/03d3c7e0-d8b0-11f0-a7da-f79c9b604153.jpg",
    "titles": [
      "No batting changes for vital Ashes Test - McCullum",
      "McCullum suggests England will name unchanged batting line-up in Adelaide"
    ],
    "url": "https://www.bbc.com/sport/cricket/articles/cj9yrzzg9vmo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/cricket/news/12040/13483158/the-ashes-2025-26-england-hint-at-unchanged-batting-line-up-for-third-test-as-head-coach-brendon-mccullum-brushes-off-questions-over-his-job"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/cricket/articles/cj9yrzzg9vmo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "England head coach Brendon McCullum has indicated that the team will likely keep the same batting line-up for the third Ashes Test in Adelaide. McCullum also dismissed concerns about his job security, despite speculation over England's performance on the Australia tour.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Drone attack in Sudan kills six UN peacekeepers and hurts eight",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 21:33:56 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "The strike on a United Nations base in the southern Kordofan region was the deadliest single episode for the body’s personnel in Sudan’s civil war.",
      "UN secretary general António Guterres says ‘unjustifiable’ attack on base in city of Kadugli ‘could be war crime’ A drone strike has hit a United Nations peacekeeping logistics base in war-torn Sudan, killing six peacekeepers, the UN secretary general António Guterres has said. Eight other peacekeep"
    ],
    "image_url": "https://static01.nyt.com/images/2025/12/13/multimedia/13int-sudan-photo-vgtz/13int-sudan-photo-vgtz-mediumSquareAt3X.jpg",
    "titles": [
      "Six U.N. Peacekeepers Killed in Drone Strike in Sudanese Battle Zone",
      "Drone strike on UN facility in war-torn Sudan leaves six peacekeepers dead"
    ],
    "url": "https://www.nytimes.com/2025/12/13/world/africa/sudan-un-peacekeepers-killed-drone-strike.html",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/13/drone-strike-on-un-facility-in-war-torn-sudan-leaves-six-peacekeepers-dead"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/12/13/world/africa/sudan-un-peacekeepers-killed-drone-strike.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.701,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.635,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a drone strike in a Sudanese battle zone. However, it does not provide any deeper understanding, actionable insights, or report on solutions or attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A drone strike hit a United Nations peacekeeping logistics base in Kadugli, southern Kordofan, Sudan, killing six peacekeepers and injuring eight others. UN Secretary General António Guterres condemned the attack as \"unjustifiable\" and stated it \"could be a war crime.\" This was the deadliest incident for UN personnel in Sudan's ongoing civil war.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hockey player Bobby Rousseau dies at age 85",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Dec 2025 18:41:35 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Robert (Bobby) Rousseau, a four-time Stanley Cup champion with the Montreal Canadiens in the 1960s, has died. He was 85.",
      "Rousseau dies at 85, 4-time Stanley Cup winner with Canadiens NHL.com"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/12/ed76508b079f280df55180254d01ac217d2664beb5a7558f29d2f9d7df7486b0.jpg?quality=65&strip=all",
    "titles": [
      "Four-time Stanley Cup champion Rousseau dead at 85",
      "Rousseau dies at 85, 4-time Stanley Cup winner with Canadiens - NHL.com"
    ],
    "url": "https://globalnews.ca/news/11576715/canadiens-robert-rousseau-dies/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQeWVDdm44S2tSWTlLZ0RGb0VURFhxb2lHTTdWOE5DcTNseWh1cTVIRDJDVHo4anF3M1FTZWlPRjhRV0R3dTNCOFhwbFdMZ3lCMWJmQl9RVWFoTnZRUWVOVDc4N24zcEs1cEEzSjVuRWRWc0YzUWtrbGRjUEFwcHkwWlBiTzFqOURFZS1EWjFrRWlzeFdDeWRLdzJNSkwwWEMwalBnQzBYYw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11576715/canadiens-robert-rousseau-dies/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.647,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.633,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: dead); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Robert (Bobby) Rousseau, a four-time Stanley Cup champion with the Montreal Canadiens during the 1960s, has died at the age of 85. Rousseau was known for his successful NHL career and significant contributions to the Canadiens' championship teams.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US seizes oil tanker near Venezuela carrying Iranian oil",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 16:45:31 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "U.S. unseals warrant behind oil tanker seizure near Venezuela Axios",
      "The tanker was headed eastward and had recently carried Iranian oil. The seizure is an escalation in President Trump’s military pressure campaign against Venezuela’s leader, Nicolás Maduro."
    ],
    "image_url": "",
    "titles": [
      "U.S. unseals warrant behind oil tanker seizure near Venezuela - Axios",
      "What to Know About Trump’s Seizure of an Oil Tanker Near Venezuela"
    ],
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1la3Q3MjBxRW9Rek9FQ2UwU1N6ZkdzSThEYUJmamNsQjF5MVF4QkpLZWVoTDlkb0JRc1RpeUJ5NWQ0bG43Z1lqNkpOb1l5dDZrbC1uUXdWZnFXVjRYM0M4YUxJbEh1Wl9QN1hHeW51YzFCTTJQelM2Rg?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/11/us/politics/trump-venezuela-tanker.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1la3Q3MjBxRW9Rek9FQ2UwU1N6ZkdzSThEYUJmamNsQjF5MVF4QkpLZWVoTDlkb0JRc1RpeUJ5NWQ0bG43Z1lqNkpOb1l5dDZrbC1uUXdWZnFXVjRYM0M4YUxJbEh1Wl9QN1hHeW51YzFCTTJQelM2Rg?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.613,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.623,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an international incident involving the U.S. and Venezuela. However, without the full story or context, it's difficult to assess how much depth or insight it offers.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. authorities have unsealed a warrant related to the seizure of an oil tanker near Venezuela. The tanker, which was traveling east and had recently transported Iranian oil, was intercepted as part of efforts to increase pressure on Venezuelan leader Nicolás Maduro. The action reflects an escalation in U.S. measures targeting oil shipments linked to Iran and Venezuela.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Wealthy investors in Asia buy more equity linked notes",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 01:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Asia’s Rich Drive $200 Billion Revival in Complex Equity Notes Bloomberg.com",
      "Rich Asian investors are plowing record money into complex stock bets that saddled them with big losses just a few years ago."
    ],
    "image_url": "",
    "titles": [
      "Asia’s Rich Drive $200 Billion Revival in Complex Equity Notes - Bloomberg.com",
      "Asia’s Rich Drive $200 Billion Revival in Complex Equity Notes"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPa1FTdUlvUGFTQTRUdVhPbFlKTGxndjcyWkd4NjdYMWxpOUIyUWd3NDQ5bHE2OUNXQ2UzdGcyWUE1RUt0YXJWQWtuMVRCUEdVcjJIYzhKallLN0ZZZE1GM01WOG81NmZpZ1ZsTl80WWVsWHFEWXhvbkg5cU9scjBRQnlOM2tud2ctbGpMQ0ktZU56enVnenpsbHFzeHo4dW93bl9YemtReEhPR3JqY05wNlp3?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/asias-rich-drive-200-billion-revival-in-complex-equity-notes"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPa1FTdUlvUGFTQTRUdVhPbFlKTGxndjcyWkd4NjdYMWxpOUIyUWd3NDQ5bHE2OUNXQ2UzdGcyWUE1RUt0YXJWQWtuMVRCUEdVcjJIYzhKallLN0ZZZE1GM01WOG81NmZpZ1ZsTl80WWVsWHFEWXhvbkg5cU9scjBRQnlOM2tud2ctbGpMQ0ktZU56enVnenpsbHFzeHo4dW93bl9YemtReEhPR3JqY05wNlp3?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.771,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Wealthy investors in Asia are investing heavily in complex equity-linked notes, with inflows reaching $200 billion, according to Bloomberg. This marks a significant resurgence in these financial products, which previously led to substantial losses for investors in recent years. The renewed interest reflects changing market conditions and risk appetite among Asia’s affluent.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Australia to ban high supermarket prices from July 2025",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 23:37:17 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms Bloomberg.com",
      "Australia will ban supermarket price gouging from July 1 under a new law the government says would protect shoppers from excessive grocery prices charged by major retailers."
    ],
    "image_url": "",
    "titles": [
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms - Bloomberg.com",
      "Australia to Ban Supermarket Price Gouging in Sweeping Competition Reforms"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPR0xsd3dacTJsYTVBTkNQZWZWTUxIWVcyU2p6aUQyYm16TXlGZ0JMUDRFUkthcW9ncUQwNzBvRmJBZ2pFeThVLWpxRThiUEpaejJuWTFjQ1ZReXN1SFUxQTVMRW12MEo0T2x1NEJTTGV6SkRtcmZNZHdwcXd6RDBtNzVoVzV0c2Rsc2VhUWhqdFd0WW5DWHM4eEpSeXdjM2lpTmNoYU9kU0VpamswdjRiVXJtdHpnUVlDZ0VsbzlyRQ?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/australia-to-ban-supermarket-price-gouging-in-sweeping-competition-reforms"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPR0xsd3dacTJsYTVBTkNQZWZWTUxIWVcyU2p6aUQyYm16TXlGZ0JMUDRFUkthcW9ncUQwNzBvRmJBZ2pFeThVLWpxRThiUEpaejJuWTFjQ1ZReXN1SFUxQTVMRW12MEo0T2x1NEJTTGV6SkRtcmZNZHdwcXd6RDBtNzVoVzV0c2Rsc2VhUWhqdFd0WW5DWHM4eEpSeXdjM2lpTmNoYU9kU0VpamswdjRiVXJtdHpnUVlDZ0VsbzlyRQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.742,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: ban); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Australia will ban supermarket price gouging starting July 1, 2025, as part of new competition reforms. The law aims to protect consumers from excessive grocery prices charged by major retailers. This measure is intended to increase fairness and transparency in supermarket pricing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Attack hits Palmyra as authorities search for those responsible",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 13:56:08 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes"
    ],
    "domains": [
      "npr.org",
      "forbes.com"
    ],
    "snippets": [
      "The attack, which took place in the city of Palmyra, comes a year after the fall of Syrian President Bashar al-Assad and the lifting of U.S. sanctions.",
      "No group has claimed responsibility for the attack, but early intelligence reportedly suggests the Islamic State was responsible."
    ],
    "image_url": "",
    "titles": [
      "2 U.S. service members and 1 civilian are killed in ISIS attack in Syria",
      "3 Americans Killed In Syria Attack"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643557/2-u-s-service-members-and-1-civilian-are-killed-in-isis-attack-in-syria",
    "alternate_urls": [
      "https://www.forbes.com/sites/saradorn/2025/12/13/3-americans-killed-in-syria-attack/"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643557/2-u-s-service-members-and-1-civilian-are-killed-in-isis-attack-in-syria",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.651,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.609,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "An attack occurred in Palmyra a year after the fall of Syrian President Bashar al-Assad and the lifting of U.S. sanctions. No group has claimed responsibility, but early intelligence indicates the Islamic State may be involved. Authorities are investigating, and no official confirmation has been given regarding the perpetrators.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Five men arrested in Germany for planning Christmas market attack",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-13T21:35:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "dw.com",
      "bbc.com"
    ],
    "snippets": [
      "The five men are suspected of planning an Islamist-motivated attack on a Christmas market in southern Germany, the Munich public prosecutor's office said.",
      "Local media says one of the suspects is an imam at a mosque, and police allege he \"called for a vehicle attack\"."
    ],
    "image_url": "",
    "titles": [
      "Germany: 5 arrested for suspected Christmas market plot",
      "Five arrested over plot to attack German Christmas market"
    ],
    "url": "https://www.dw.com/en/germany-5-arrested-for-suspected-christmas-market-plot/a-75148071?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c2dz7r708dxo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/germany-5-arrested-for-suspected-christmas-market-plot/a-75148071?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.701,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Five men have been arrested in southern Germany on suspicion of planning an Islamist-motivated attack on a Christmas market, according to the Munich public prosecutor's office. Local media report that one suspect is an imam at a mosque and is alleged by police to have called for a vehicle attack. The investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Maria Kalesnikava is released after five years in detention",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 13 Dec 2025 13:31:53 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Belarusian opposition politician Maria Kalesnikava freed by authorities, report says Reuters",
      "Maria Kalesnikava, hero of Belarus opposition, freed after more than 5 years Reuters"
    ],
    "image_url": "",
    "titles": [
      "Belarusian opposition politician Maria Kalesnikava freed by authorities, report says - Reuters",
      "Maria Kalesnikava, hero of Belarus opposition, freed after more than 5 years - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPZE4xZUJDSG1BWFppcFFzNUZYTFgtcDBJU3Nxc0JqQ1Y4NTRMb3lKWDg3dnhxQVZocUc3aDdMU0N5OEw2eUFFcFBOWEV6MGY2MmdOUVdTRXp5T1RKaTVXYkQwUlpLUWp3YkNLb2RUTlJVYjJmMVI5OHJhN1lNNERkOFlZTGxtUENpNldaTXdDNWlNbE5yWm9RZkNSQ3ZNWVo1WUJRQURscGZZTllRVnBGSENwWW12VXBHOUV2bnE2RmpiQnZLbWc?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNQmlBQ1IyN1BQMEhDUTRwYlBwQVd3MDJWN2VGYVpDVk1mS3BsMzFCMkhTRlBINDBzU3NLS0dlbjg1Uy1NVEhaa19xQVhfQy1HQUQ5cnMyXzRmQ1RqbW9ZU0ZLcjVBdURwVmxoeEFiTnh6MUJmZVlmc2JPMjQyT0NtbnIzeXlueWJEb1BhM2laM0g1bVpEcDdTRFFhUTJhM1JSVGQ5ZGdoRkV4RHFNX3ZwUUJFeFozTGExZjlSQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPZE4xZUJDSG1BWFppcFFzNUZYTFgtcDBJU3Nxc0JqQ1Y4NTRMb3lKWDg3dnhxQVZocUc3aDdMU0N5OEw2eUFFcFBOWEV6MGY2MmdOUVdTRXp5T1RKaTVXYkQwUlpLUWp3YkNLb2RUTlJVYjJmMVI5OHJhN1lNNERkOFlZTGxtUENpNldaTXdDNWlNbE5yWm9RZkNSQ3ZNWVo1WUJRQURscGZZTllRVnBGSENwWW12VXBHOUV2bnE2RmpiQnZLbWc?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.561,
      "consensus": 0.35,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.46,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant development in the political landscape of Belarus. However, without more context or analysis, it does not fully contribute to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Maria Kalesnikava, a prominent Belarusian opposition figure, has been released by authorities after spending more than five years in detention, according to reports. Kalesnikava was widely recognized for her role in the opposition movement in Belarus. No further details about the conditions of her release have been provided.",
    "is_trending": false,
    "trending_score": 0.0
  }
]