[
  {
    "title": "Nearly 2,000 Australians Register to Leave Israel and Iran Amid Conflicts",
    "domain": "general",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:43:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Treasurer <strong>Jim Chalmers</strong> said nearly 2,000 Australians had registered to leave Israel and Iran amid a growing conflict between the pair over the past week. He told RN Breakfast:</p><p>I’m told by the colleagues that there are more than a thousand Australians..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/c5aa633fd8820490c9ab187a4c84e59470909325/0_212_6351_5081/master/6351.jpg?width=140&quality=85&auto=format&fit=max&s=4f1069e01cb877852d9ec990fe8f37c9",
    "titles": [
      "News live: PM says Australia will commence negotiations on security and defence partnership with EU"
    ],
    "summary": "Australian Treasurer Jim Chalmers announced that nearly 2,000 Australians have registered to leave Israel and Iran due to escalating conflicts between the two nations over the past week. This statement was made during an interview on RN Breakfast, highlighting the growing concern among Australian nationals in the affected regions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current situation in Israel and Iran and its impact on Australians living there. However, it doesn't offer any solutions or deeper insights into the conflict itself or its potential resolution.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Rare Footage Sheds Light on Aung San Suu Kyi's Prison Life in Myanmar",
    "domain": "general",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:41:21 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Exclusive: Video and documents give rare glimpse inside daily life of the imprisoned civilian leader as she nears her 80th birthday</p><p>Rare footage of Aung San Suu Kyi inside a Myanmar courtroom and detailed records of her daily prison routine have been seen by the Guardian, offering a glimpse into the life of the country’s ousted civilian leader as she nears her 80th birthday.</p><p>Since the military <a href=\"https://www.theguardian.com/world/2021/feb/01/aung-san-suu-kyi-and-other-figures-detained-in-myanmar-raids-says-ruling-party\">seized power in February 2021</a>, little has been..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9696edda5da4a9f187e582f653cfa04ebd953e13/0_0_2500_2000/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=1a5548614ab9fedc84bfde4ed4c69d55",
    "titles": [
      "Leaked footage and prison logs reveal Aung San Suu Kyi’s life in detention"
    ],
    "summary": "Rare footage and documents obtained by the Guardian provide insight into Aung San Suu Kyi's life in a Myanmar prison as she approaches her 80th birthday. Since the military coup in February 2021, details about her imprisonment have been scarce. These new materials reveal aspects of her daily routine and conditions in detention, offering a unique glimpse into the life of Myanmar's ousted civilian leader.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story offers a deeper understanding of Aung San Suu Kyi's situation and the conditions in Myanmar prisons. It raises awareness about the military coup and its impacts. However, it doesn't provide actionable insights or report on potential solutions to the political crisis.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.43
  },
  {
    "title": "Wildfire Carbon Can Reach Oceans and Atmosphere, Study Reveals",
    "domain": "general",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:29:21 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The new research from UBC's Institute for the Oceans and Fisheries also suggests carbon washed away from burn sites by rain could be making its way back into the atmosphtere."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/a318aac4780fb872ce63dd2352b827e0331d192d792c872b3b89c389ad354229.jpg?quality=85&strip=all",
    "titles": [
      "Wildfires can have dramatic effect on water quality, UBC research finds"
    ],
    "summary": "New research from the University of British Columbia's Institute for the Oceans and Fisheries indicates that carbon from wildfire burn sites can be washed into the ocean by rain and potentially return to the atmosphere. This finding highlights a previously underexplored pathway in the carbon cycle, suggesting that wildfires may have a more complex impact on atmospheric carbon levels than previously understood.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story offers empowering knowledge about the impact of wildfires on the carbon cycle, a topic of great relevance to climate change understanding and decision-making. It reports on new research, thus highlighting scientific progress. However, it doesn't provide specific solutions or actions to address the problem of wildfires and their environmental impact.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 1.0
    },
    "score": 0.499
  },
  {
    "title": "Chris Driedger Moves to KHL's Traktor Chelyabinsk After Jets Season",
    "domain": "general",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:26:28 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Winnipeg's Chris Driedger has joined KHL's Traktor Chelyabinsk on a one-year contract after finishing the season with the Winnipeg Jets."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/03/DRIEDGER.jpg?quality=85&strip=all",
    "titles": [
      "Winnipeg’s Chris Driedger headed to KHL after short stint with hometown Jets"
    ],
    "summary": "Chris Driedger, previously with the Winnipeg Jets, has signed a one-year contract with Traktor Chelyabinsk, a team in the Kontinental Hockey League (KHL). This move comes after Driedger completed the recent season playing for the Jets.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a player's career move but doesn't provide any deeper insight or analysis about the implications of this move for the player, the teams involved, or the sport as a whole.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.439
  },
  {
    "title": "US Judge Blocks Trump-Era Transgender Passport Restrictions",
    "domain": "general",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:22:38 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMisAFBVV95cUxOUERkN2JjYUo3U3pXMkxGaVFYM3hsQ19fY3BCNkcxVnUwcHUzSHh2cFUxSmJvZ0o4c0lqa3U0dG5MUjRJZE5ZOHVVNldkUjNsS2FIVWpxR1dOWTQ0azROcnpGNnJYT3MzTGZGUW50cDhhano1TEVMY0FaNWZpNjQ3M0dPZGdFODlhSHgxS1lWbnBsX3h4X1ZDSzJKMl9aSXdIYWtjUGkxSWhtb3pjTnpKWg?oc=5\" target=\"_blank\">US judge blocks Trump passport policy targeting transgender people</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aNGN0NzIxclBsMXpGM0ZUU3hac1B2TFRhSkdINUYwNjBkNF96SnM0RWVOdVhKeDBqNlUwbklpbE53aXR4XzNNWTBxeGJzcmVLaW5SSEs1Y2FGLVlsdF9NNHFaNjdtTzhFYXA0V25xTElURGVOT1U3ZmUzUDE?oc=5\" target=\"_blank\">Judge blocks Trump passport policy targeting transgender people</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxNU0ptWEJtMjliWUpmc2RTYTUwSUkzNEJCeVZEa0dxajNHcW5aQ2d3am1GNFlCSjBhZEQtMDhDbWhDSTdqSmJ3Sk9nSTJGeDVGcHJ1ZlVFa2pEOHJGU1pNSUI0cHJ1eWQ4ajhibHZrWDVWejBZXzN4SFd4Zkg2SXoyb2wyWjc1aDM5dm91MnV0VVAyWFEzcmN0bHNUMFVPYXgxU3M0N1o5WS16WFdvclV4dmZnMA?oc=5\" target=\"_blank\">US judge blocks Defense Department from slashing federal research funding</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
    ],
    "image_url": "",
    "titles": [
      "US judge blocks Trump passport policy targeting transgender people - Reuters",
      "Judge blocks Trump passport policy targeting transgender people - Axios",
      "US judge blocks Defense Department from slashing federal research funding - Reuters"
    ],
    "summary": "A US judge has blocked a policy implemented during Trump's presidency that targeted transgender individuals by restricting their ability to obtain passports matching their gender identity. This legal decision prevents the enforcement of the policy, ensuring transgender people can acquire passports that reflect their gender. Additionally, the same judge blocked the Defense Department from reducing federal research funding, although this action is unrelated to the passport policy issue.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news piece clearly highlights progress in the area of transgender rights, specifically in relation to passport issuance. It provides empowering knowledge about the legal decision, which can be useful for transgender individuals and advocates. However, it does not delve into potential solutions or further improvements.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.983,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.712
  },
  {
    "title": "Budget Cuts Threaten Disease Fight and U.S. Pharma Research",
    "domain": "general",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:02:16 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The budget cuts threaten global progress on everything from heart disease to H.I.V. — and could affect American drug companies, too."
    ],
    "image_url": "https://static01.nyt.com/images/2025/06/19/multimedia/00hs-southafrica-research-01-hjfp/00hs-southafrica-research-01-hjfp-mediumSquareAt3X.jpg",
    "titles": [
      "South Africa Built a Medical Research Powerhouse. Trump Cuts Have Demolished It."
    ],
    "summary": "Proposed budget cuts are jeopardizing global advancements in the treatment and prevention of diseases such as heart disease and H.I.V. These financial reductions could also negatively impact American pharmaceutical companies, potentially hindering their operations and research efforts in these critical health areas.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the potential impacts of budget cuts on disease research and treatment, and on the pharmaceutical industry. It raises awareness about a significant issue but does not report on any solutions or attempts to address the problem.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Canada Day Fireworks in Saskatoon Move to Rotary Park",
    "domain": "general",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:02:16 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Canada Day celebrations at Saskatoon's River Landing will look a little different this year, with fireworks being launched from Rotary Park."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2020/07/river-danger-pic-e1594084277552.jpg?quality=85&strip=all",
    "titles": [
      "Saskatoon’s Canada Day fireworks display is changing locations due to low river water levels"
    ],
    "summary": "This year, Canada Day celebrations in Saskatoon will feature a change in location for the fireworks display, moving to Rotary Park from the traditional River Landing site. This adjustment means attendees can expect a different viewing experience for the annual festivities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for those planning to attend the Canada Day celebrations in Saskatoon, informing them about the change in venue for the fireworks display. However, it does not offer in-depth insights or discuss any improvements, solutions, or impacts related to the change.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.467
  },
  {
    "title": "PAC Warns Councils in England Face £5bn Deficit in Special Needs Spending",
    "domain": "general",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:01:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Public accounts committee calls on government to urgently address deficit on high needs spending hitting at end of financial year</p><p>Councils in England face being overwhelmed by billions of pounds in debts and reforms that are divorced from reality, according to an influential committee of MPs.</p><p>In its inquiry into local government finances, the public accounts committee (PAC) told the Treasury and other departments to urgently address the estimated £5bn deficit on high needs spending – mainly on special educational needs – that will hit council balance sheets at the end of the..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d28c9276148911acb41375e2c52fe95c27a6644e/536_238_3243_2594/master/3243.jpg?width=140&quality=85&auto=format&fit=max&s=9954ff9adec65eeb8560fc640c1814d0",
    "titles": [
      "Over half of English councils face insolvency under £5bn deficit, MPs warn"
    ],
    "summary": "The Public Accounts Committee (PAC) has warned that councils in England are at risk of being overwhelmed by debts, urging the government to urgently address an estimated £5bn deficit in high needs spending, particularly on special educational needs, expected by the end of the financial year. This call to action highlights the significant financial challenges facing local government finances and the need for immediate intervention from the Treasury and other departments.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it raises awareness about the financial challenges faced by local governments in England, particularly in relation to special needs education. It also highlights a call to action, urging the government to address the issue, which can potentially lead to solutions and improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "2025 Outlook: Palmer, Thomas, Jones Eye Sophomore Impact in NFL",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:54:06 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A look at 2024 sixth-round pick Tejhaun Palmer and his second-year outlook in 2025.",
      "A look 2024 at fifth-round pick Xavier Thomas and his second-year outlook in 2025.",
      "A look 2024 at fifth-round pick Christian Jones and his second-year outlook in 2025."
    ],
    "image_url": "",
    "titles": [
      "Arizona Cardinals Year 2 player outlook: WR Tejhaun Palmer",
      "Arizona Cardinals Year 2 player outlook: OLB Xavier Thomas",
      "Arizona Cardinals Year 2 player outlook: OT Christian Jones"
    ],
    "summary": "In 2024, Tejhaun Palmer was selected in the sixth round, while Xavier Thomas and Christian Jones were both fifth-round picks. As they head into their second year in 2025, each player's performance and potential impact on their respective teams are under review. The outlook for 2025 focuses on their development and expected contributions in their sophomore seasons.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the potential performance of three NFL players in their second year. It contributes to readers' understanding of the players' development and expected contributions. However, it does not report on any solutions, innovations, or attempts to solve problems, nor does it significantly increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.431
  },
  {
    "title": "Guardiola Leaves Grealish Out of Club World Cup Squad to Reignite Passion",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:53:55 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester City boss Pep Guardiola suggested Tuesday that the dropped Jack Grealish needed to rediscover his love for playing football after being left out of the squad for the Club World Cup in the United States.City, who finished third in the Premier League, added four new signings in the recent transfer window to freshen up their squad for the Club World Cup."
    ],
    "image_url": "",
    "titles": [
      "Guardiola says axed Grealish needs to get 'butterflies back in his stomach'"
    ],
    "summary": "Manchester City manager Pep Guardiola indicated that Jack Grealish was omitted from the squad for the Club World Cup in the United States to help him regain his passion for football. This decision followed Manchester City's third-place finish in the Premier League and the addition of four new players to the squad in the recent transfer window, aiming to strengthen the team for the competition.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insight into the decision-making process within a major football team, which could be of interest to fans or those studying sports management. However, it doesn't report on solutions, improvements, or attempts to solve problems, and it doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "UFL Unconcerned by TV Viewership Decline Between 2024-2025",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:52:23 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The UFL isn't concerned about the decline in TV audience from 2024 to 2025."
    ],
    "image_url": "",
    "titles": [
      "UFL championship audience drops sharply from 2024"
    ],
    "summary": "The United Football League (UFL) has expressed no worry regarding the drop in television viewership it experienced between 2024 and 2025. Despite this decline, the league's stance remains unchanged, indicating they are not alarmed by the change in audience numbers during this period.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the decline in viewership of the UFL, but it does not provide depth or insight into why this is happening or what the potential impacts could be. It also does not report on any solutions or attempts to address the issue.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Mitchell's Reinesch Secures Second Place at SD Junior Golf Tour",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:49:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 17—MITCHELL — Led by runner-up finishes from Mitchell's Emma Reinesch and Berkli Miles, area golfers posted stellar showings on Tuesday. Reinesch claimed second-place honors in the girls 12-13 division during the South Dakota Golf Association's annual Southeast Junior Tour stop at Lakeview Golf Course, firing a round of 89 against Lakeview's par-71 layout. Her round was highlighted by a ..."
    ],
    "image_url": "",
    "titles": [
      "Mitchell's Emma Reinesch, Berkli Miles lead top area placers at home SDGA Junior Tour event"
    ],
    "summary": "On June 17, during the South Dakota Golf Association's Southeast Junior Tour at Lakeview Golf Course, Mitchell's Emma Reinesch secured a second-place finish in the girls 12-13 division with a score of 89 on the par-71 course. Berkli Miles also achieved a runner-up position, showcasing the strong performance of area golfers at the event.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a local sports event and the achievements of specific individuals. However, it doesn't provide deeper understanding or actionable insights for the reader, nor does it report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Platte's Killer Tomatoes Aim for 2024 South Dakota Class B Baseball Title",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:49:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 17—PLATTE, S.D. — In 2024, the Platte amateur baseball team got the full experience of a run to the South Dakota Class B amateur baseball championship game. This year, the Killer Tomatoes would love to do it again and leave with a championship trophy. Last season, Platte was 14-8 and won three consecutive one-run games in the Class B state tournament in the first three rounds before ..."
    ],
    "image_url": "",
    "titles": [
      "Off trip to state title game in 2024, Killer Tomatoes look to build on success"
    ],
    "summary": "In 2024, the Platte amateur baseball team, known as the Killer Tomatoes, aims to win the South Dakota Class B amateur baseball championship after a strong performance last season. In the previous year, they achieved a 14-8 record and won three consecutive one-run games in the first three rounds of the state tournament, reaching the championship game. Their goal is to replicate their successful run and secure the championship trophy.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Platte's Killer Tomatoes' performance in the previous season and their goals for the upcoming one. However, it lacks depth in terms of strategies or improvements the team plans to implement to achieve their goal, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Detroit Tigers Claim Pitcher Carlos Hernández Off Waivers from Phillies",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:48:40 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Detroit Tigers claimed Carlos Hernández — a right-handed reliever with a 4.98 ERA in his six-year MLB career — off waivers from the Phillies."
    ],
    "image_url": "",
    "titles": [
      "Flamethrower Carlos Hernández joins Detroit Tigers' bullpen, meets with pitching coaches"
    ],
    "summary": "The Detroit Tigers have added right-handed reliever Carlos Hernández to their roster after claiming him off waivers from the Philadelphia Phillies. Hernández, who has a career ERA of 4.98 over six years in Major League Baseball, will be joining the Tigers' bullpen in an effort to bolster their pitching staff.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This news story informs readers about a significant change in the Detroit Tigers' roster, which can be useful for fans or those interested in the team's performance. However, it doesn't provide insights into how this change might impact the team's strategies or future performance, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Marty Eilts Scores Fifth Hole-in-One at Lakeview Golf Course",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:48:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 17—MITCHELL — Marty Eilts recorded a hole-in-one during a round on Monday, June 16, at Lakeview Golf Course. Eilts hit his ace on the par-3 No. 8 hole using an 8-iron from 118 yards out. It's the fifth career ace for Eilts. © 2025 The Daily Republic (Mitchell, S.D.). Visit www.mitchellrepublic.com. Distributed by Tribune Content Agency, LLC."
    ],
    "image_url": "",
    "titles": [
      "Marty Eilts hits hole-in-one at Lakeview on Monday"
    ],
    "summary": "Marty Eilts achieved a hole-in-one at Lakeview Golf Course on June 16. The event took place on the par-3 No. 8 hole, with Eilts using an 8-iron for a 118-yard shot. This marks his fifth career ace. The incident was reported by The Daily Republic and occurred in Mitchell.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about Marty Eilts' achievement but provides minimal depth or insight. It doesn't inform readers about the significance of this achievement, any strategies Eilts used, or how this might impact his future performance.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Michigan State Eyes Top 10 Point Guard for 2027 Recruitment",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 17 Jun 2025 23:47:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Michigan State basketball is reportedly showing interest in a four-star, top 10 point guard prospect in the 2027 class"
    ],
    "image_url": "",
    "titles": [
      "MSU basketball showing interest in 4-star, top 10 PG Nasir Anderson"
    ],
    "summary": "Michigan State basketball is reportedly interested in recruiting a four-star, top 10 point guard from the 2027 class. This prospect is highly ranked, indicating Michigan State's aim to strengthen their team with top talent in future seasons.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Michigan State's recruitment strategy but doesn't offer much depth or insight into the broader context of college basketball recruitment, the player's potential impact on the team, or the implications for the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Bank Launches Global Initiative to Streamline Operations",
    "domain": "business",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:01:13 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Bank seeking to impose unified approach on sprawling global workforce"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F62a7bd7b-38b7-47fe-957c-172b42a27561.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "HSBC considers ordering all staff back to office 3 days a week"
    ],
    "summary": "A bank is implementing a unified approach across its global workforce to streamline operations and ensure consistency. This initiative aims to harmonize practices and policies throughout its international branches, enhancing efficiency and collaboration among employees worldwide. The current status of this effort indicates that the bank is in the process of rolling out these changes, aiming for a more integrated and cohesive organizational structure.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and solutions, providing useful information about the bank's initiative to streamline operations. It offers insights into the bank's strategic approach and its potential impact on efficiency and collaboration, empowering readers with a deeper understanding of organizational change in the banking industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "Officials to Signal Economic Policy, Impacting Markets at Meeting",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 22:54:21 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "While any movement on interest rates seems improbable, the meeting will feature important signals that still could move markets."
    ],
    "image_url": "",
    "titles": [
      "The Fed is likely to keep rates the same but give a forecast that moves markets. What to expect"
    ],
    "summary": "At the upcoming meeting, while changes to interest rates are unlikely, officials are expected to provide significant signals regarding economic policy. These indications have the potential to influence market movements, highlighting the importance of the meeting's outcomes for investors and financial markets.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about an upcoming meeting and its potential impact on economic policy and financial markets. While it doesn't report on a specific solution or improvement, it does increase awareness and understanding of the relationship between policy signals and market movements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Anthropic Launches Claude Opus 4 on AWS, Powers Project Rainier with GPUs",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 22:12:37 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Anthropic's Claude Opus 4 launched on Trainium2 GPUs, according to AWS, and Project Rainier is powered by over half a million of its own."
    ],
    "image_url": "",
    "titles": [
      "AWS' custom chip strategy is showing results, and cutting into Nvidia's AI dominance"
    ],
    "summary": "Anthropic has launched Claude Opus 4 on AWS's Trainium2 GPUs. Additionally, Project Rainier is being powered by over half a million of Anthropic's own GPUs. This marks a significant advancement in the company's AI and computing capabilities.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on technological advancements and innovations in the field of AI and computing. It provides useful information about the company's progress and attempts to solve problems, thus contributing to the reader's understanding and awareness of the topic.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.96,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451
  },
  {
    "title": "U.S. Treasury Yields Fall as Retail Sales Decline Surpasses Expectations",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 21:30:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "U.S. Treasury yields fell after retail sales fell more than Wall Street expected last month, pushing up fixed income prices and lifting concern over a slowdown."
    ],
    "image_url": "",
    "titles": [
      "U.S. Treasury yields slide after retail sales tumbled in May, raising recession fears"
    ],
    "summary": "U.S. Treasury yields dropped following a decline in retail sales that exceeded Wall Street's expectations last month. This decrease in sales led to an increase in fixed income prices and raised concerns about a potential economic slowdown.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful insights into the financial trends and impacts of declining retail sales on U.S. Treasury yields. It increases the reader's awareness of the economic situation and potential future trends, even though the news is negative.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.946,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.428
  },
  {
    "title": "Tesla Plans Robotaxi Launch in Austin; Pauses Production, Stock Falls",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 20:04:53 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Tesla is tentatively launching the robotaxi in Austin on June 22, using Model Y vehicles equipped with a new version of its \"Full Self-Driving\" technology.",
      "<figure><img alt=\"Brandon Bell / Getty Images Tesla reportedly told employees the production stoppage will occur the week of June 30\" src=\"https://www.investopedia.com/thmb/k73VUv4MIbW963sh5mqHiZbHWO8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2184830381-f7936b853e9e4da1b57d6ef23eac83bb.jpg\" title=\"Tesla dealership in Austin, Texas.\" /><figcaption><i><p>Brandon Bell / Getty Images</p> Tesla reportedly told employees the production stoppage will occur the week of June 30</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Tesla shares slid Tuesday as...",
      "<figure><img alt=\"Erik McGregor / Getty Images SoftBank reportedly sold 21.5 million T-Mobile shares, raising $4.8 billion\" src=\"https://www.investopedia.com/thmb/t2YLUNRrUlmKx4_eM53HXpvGcz0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207748471-870ef237d3504757ac3b7f7cd1dfe612.jpg\" title=\"T-Mobile store.\" /><figcaption><i><p>Erik McGregor / Getty Images</p> SoftBank reportedly sold 21.5 million T-Mobile shares, raising $4.8 billion</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>T-Mobile shares declined after Japanese investment firm SoftBank..."
    ],
    "image_url": "",
    "titles": [
      "Tesla stock slips after report EV maker is pausing Cybertruck and Model Y production",
      "Tesla Stock Slides as EV Maker Reportedly Plans Weeklong Production Halt at Austin Plant",
      "T-Mobile Stock Slides as SoftBank Reportedly Sells Shares at a Discount"
    ],
    "summary": "Tesla is set to tentatively launch its robotaxi service in Austin on June 22, utilizing Model Y vehicles equipped with an advanced version of its \"Full Self-Driving\" technology. Concurrently, Tesla has informed its employees of a production halt scheduled for the week of June 30. This news has contributed to a decline in Tesla's stock prices. Meanwhile, SoftBank has sold 21.5 million T-Mobile shares, generating $4.8 billion, an action that has also led to a decrease in T-Mobile's share value.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Tesla's plans for innovation with its robotaxi service, as well as the impact of production halts on its stock prices. It also informs readers about SoftBank's financial decisions. Although the news includes setbacks, it contributes to the reader's understanding and decision-making.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.918,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.682
  },
  {
    "title": "Reddit Stock Rises After Launch of AI Advertising Tools",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 20:00:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Reddit shares rallied after the company announced new AI advertising tools to help brands improve engagement."
    ],
    "image_url": "",
    "titles": [
      "Reddit stock jumps after company rolls out new AI advertising tools"
    ],
    "summary": "Reddit's stock experienced a significant increase following the company's announcement of new artificial intelligence (AI) advertising tools designed to enhance brand engagement. This development indicates a positive market response to Reddit's innovative approach to advertising technology.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about Reddit's new AI advertising tools and their impact on the company's stock value. However, it doesn't go into detail about how these tools work or the broader implications for the advertising industry.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.422
  },
  {
    "title": "Senate Keeps $1,000 Child Savings Account in Trump's Budget Bill",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 19:44:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "A new savings account for children that comes with a $1,000 deposit remained in the Senate’s version of President Trump’s budget bill."
    ],
    "image_url": "",
    "titles": [
      "Senate tax bill includes $1,000 baby bonus in 'Trump accounts' — here's who qualifies"
    ],
    "summary": "The Senate has retained a provision in President Trump's budget bill that introduces a new savings account for children, which includes an initial deposit of $1,000. This decision ensures that the proposed financial support for young savers remains part of the legislative package under consideration.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it informs readers about a specific policy decision and its potential impact on young savers. It gives readers actionable insights about a new financial support scheme for children.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Herbal ADHD, Autism Treatment Firm's Stock Soars 58,000% Since Year Start",
    "domain": "business",
    "location": "national",
    "published": "Tue, 17 Jun 2025 19:37:06 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The developer of traditional Chinese herbal treatments for childhood ADHD and autism is up roughly 58,000% year to date."
    ],
    "image_url": "",
    "titles": [
      "Nasdaq-traded Chinese herb stock with no revenues rallies 58,000% to top Lululemon in market value"
    ],
    "summary": "The developer specializing in traditional Chinese herbal treatments for childhood ADHD and autism has seen its stock value increase by approximately 58,000% since the beginning of the year. This significant growth indicates a substantial rise in the company's market valuation over this period.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the company's stock performance and the market's response to herbal treatments for ADHD and autism. However, it lacks depth in discussing the efficacy of these treatments or the broader trends in the healthcare sector.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.909,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.404
  },
  {
    "title": "MIT Develops Ingestible Capsule to Transform Schizophrenia Treatment",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 23:09:48 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/mits-once-a-week-pill-could-revolutionize-schizophrenia-treatment/\" rel=\"nofollow\" title=\"MIT’s Once-a-Week Pill Could Revolutionize Schizophrenia Treatment\"><img alt=\"Drug Delivery Device\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Drug-Delivery-Device-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The ingestible capsule creates a drug depot in the stomach, slowly releasing its medication over time and removing the need for patients to take a daily dose. For many..."
    ],
    "image_url": "",
    "titles": [
      "MIT’s Once-a-Week Pill Could Revolutionize Schizophrenia Treatment"
    ],
    "summary": "MIT has developed an ingestible capsule designed to revolutionize schizophrenia treatment. This capsule acts as a drug depot within the stomach, gradually releasing medication over an extended period. This innovation eliminates the necessity for daily medication intake for patients, potentially improving adherence and treatment effectiveness.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It provides useful information about a new development in schizophrenia treatment, highlighting an innovative solution that could improve patient adherence and treatment effectiveness. It also offers a deeper understanding of how the technology works.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.458
  },
  {
    "title": "School Dental Program Halts Cavities with Simple Treatments",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 22:44:57 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/two-simple-topical-treatments-halt-childhood-cavities-for-years/\" rel=\"nofollow\" title=\"Two Simple Topical Treatments Halt Childhood Cavities for Years\"><img alt=\"Tooth Decay Dental Cavities\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Tooth-Decay-Dental-Cavities-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A school-based program using minimal interventions successfully prevented most cavities from worsening. Two topical dental treatments could stop most childhood..."
    ],
    "image_url": "",
    "titles": [
      "Two Simple Topical Treatments Halt Childhood Cavities for Years"
    ],
    "summary": "A school-based dental program demonstrated success in preventing the progression of cavities in children using two simple topical treatments. These interventions were effective in halting most childhood dental decay for years, offering a promising approach to managing oral health in young populations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a successful solution to a common health issue in children. It provides actionable insights for schools and parents on how to manage oral health in young populations. However, it could provide more depth on the specifics of the treatments used.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446
  },
  {
    "title": "Early Treatment of Bacterial Bronchitis Key to Preventing Lung Damage in Kids",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 22:19:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/your-childs-normal-cough-could-be-a-sign-of-irreversible-lung-damage/\" rel=\"nofollow\" title=\"Your Child’s “Normal” Cough Could Be a Sign of Irreversible Lung Damage\"><img alt=\"Child Coughing\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Child-Coughing-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Untreated bacterial bronchitis in children may cause lasting lung damage, prompting calls for early detection and care tools. A wet cough lasting more than four weeks is..."
    ],
    "image_url": "",
    "titles": [
      "Your Child’s “Normal” Cough Could Be a Sign of Irreversible Lung Damage"
    ],
    "summary": "Untreated bacterial bronchitis in children can lead to irreversible lung damage. Health experts emphasize the importance of early detection and treatment, particularly noting that a wet cough persisting for more than four weeks should prompt medical attention. This condition underscores the need for awareness and timely intervention to prevent long-term respiratory issues.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it raises awareness about a health issue in children and emphasizes the importance of early detection and treatment. It provides useful insights for parents, but it could provide more information on the treatment options available.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.434
  },
  {
    "title": "Scientists Suggest High-Altitude Aerosols to Cool Earth's Climate",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 21:30:50 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Injecting aerosols into the atmosphere – but at higher altitudes than planes can reach – could cool the climate while avoiding some of the downsides of lower-altitude solar geoengineering"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/17152639/SEI_255838468.jpg",
    "titles": [
      "Could reusable rockets make solar geoengineering less risky?"
    ],
    "summary": "Scientists propose that injecting aerosols into the atmosphere at altitudes higher than airplanes fly could potentially cool the Earth's climate. This method aims to reduce the risks associated with lower-altitude solar geoengineering, which involves reflecting sunlight away from the Earth to lower global temperatures.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides valuable insights into a potential solution to combat climate change. It increases awareness about the use of high-altitude aerosols and the risks associated with lower-altitude solar geoengineering.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.926,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "UK Biotech Discovers 1M Microbial Species; AI Training Challenges Persist",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 21:13:20 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A UK biotech firm spent years gathering genetic data that has uncovered 1 million previously unknown microbial species and billions of newly identified genes – but even this trove of data may not be enough to train an AI biologist"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/17200326/SEI_255742829.jpg",
    "titles": [
      "Biotech firm aims to create ‘ChatGPT of biology’ – will it work?"
    ],
    "summary": "A UK biotech company has identified 1 million new microbial species and billions of new genes after years of research. Despite this significant discovery, the volume of data might still be insufficient to fully train an artificial intelligence (AI) biologist.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is informative and provides a deeper understanding of the challenges faced in AI training, despite the discovery of new microbial species. However, it does not highlight any potential solutions or improvements to these challenges.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.921,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.423
  },
  {
    "title": "Sea Star Larvae Frozen and Revived, Aiding Endangered Species Recovery",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 21:00:26 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Sea star larvae have been stored at −200°C and thawed for the first time, a step towards restoring populations that have been ravaged by disease"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/06104457/SEI_254169707.jpg",
    "titles": [
      "Cryopreserved sea star larvae could enable vital species to recover"
    ],
    "summary": "For the first time, sea star larvae were successfully frozen at -200°C and later thawed, aiming to aid in the recovery of populations devastated by disease. This breakthrough method presents a potential pathway for replenishing and conserving endangered sea star species.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a breakthrough method that could potentially help replenish endangered sea star species. It provides readers with empowering knowledge about the progress made in species conservation.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.452
  },
  {
    "title": "New Armored Lizard Species Discovered in Utah Challenges Dinosaur Era Views",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 19:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A newly discovered, raccoon-sized armored monstersaurian from the Grand Staircase-Escalante National Monument in Southern Utah, United States, reveals a surprising diversity of large lizards at the pinnacle of the age of dinosaurs."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-monstersaur-specie-1.jpg",
    "titles": [
      "Bolg amondol: New monstersaur reveals complex evolutionary history of giant Gila monster relatives"
    ],
    "summary": "Scientists have discovered a new species of large, raccoon-sized, armored lizard at the Grand Staircase-Escalante National Monument in Southern Utah, highlighting an unexpected diversity of lizard species during the late dinosaur era. This finding challenges previous beliefs about the variety and ecological roles of lizards in prehistoric ecosystems.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new scientific discovery, contributing to readers' understanding of the diversity of lizard species during the dinosaur era. It also increases awareness about the ecological roles of these creatures in prehistoric ecosystems. However, it does not report on solutions or improvements, hence it doesn't score higher.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "Brainwashing: A Concept Rooted in Cold War Narratives and 60s Cinema",
    "domain": "science",
    "location": "global",
    "published": "Tue, 17 Jun 2025 18:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Brainwashing is often viewed as a Cold War relic—think '60s films like \"The Manchurian Candidate\" and \"The IPCRESS File.\""
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/mind-control-technique.jpg",
    "titles": [
      "Mind-control techniques remain with us in social media, cults, AI, elsewhere, new book argues"
    ],
    "summary": "Brainwashing, commonly associated with Cold War-era narratives and depicted in 1960s films such as \"The Manchurian Candidate\" and \"The IPCRESS File,\" is often considered a concept from the past. This perception places it within a historical context, highlighting its relevance to that specific period and its portrayal in popular culture.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a deeper understanding of the concept of brainwashing, placing it within a historical context. It increases awareness about the concept's relevance to a specific period and its portrayal in popular culture. However, it doesn't offer actionable insights or report on progress, solutions, or innovations, which limits its score.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  }
]