[
  {
    "title": "U.S. and Japan Strike Trade Deal, Lower Car Tariffs to 15%",
    "domain": "general",
    "location": "global",
    "published": "2025-07-23T00:43:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Axios",
      "Deutsche Welle",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The deal will reportedly see the US levy 15% tariff on goods imported from Japan. Donald Trump also said the US would increase exports of rice and vehicles to the East Asian nation.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1vYjJESUZxdjZCWmtFcUtUZjVDcTVMYUFCNFRHaWVIZm9YTGZRNVRHS19NLVZPdS1BQXIyQ3ItYUhJamJJajZHZEVUX3lYdlpuQlNiYjFWcjdROHBld0JrZUNveGFmVV90a3FkOHF2MnpDbUUyTWc?oc=5\" target=\"_blank\">Trump says U.S. reached Japan trade deal with 15% tariffs</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE1pdmFtSEREMmpETllzWG9CSHczT0NucFRQRkZZaWxLMGpFbEhaNDZPQXNtbHQ2S1lLUjZTc21DME9rM2xKZUZPZnpvM1Qwd05ZWmtKUDZmTDJQcmh6V2EyMHM5VHd0WUlWdVBnbFZYb3BFaUpaOUxpd1FjOHA?oc=5\" target=\"_blank\">Trump announces Philippines trade deal, after pact with Indo",
      "In his tariff letter sent out to Japan earlier this month, Trump had threatened 25% levies on the country's exports to the U.S., starting Aug. 1.",
      "Trump announces ‘massive’ deal that lowers levy to 15% from threatened 25%"
    ],
    "image_url": "",
    "titles": [
      "Trump announces Japan trade deal with 15% tariff on imports",
      "Trump says U.S. reached Japan trade deal with 15% tariffs - Axios",
      "Trump announces Philippines trade deal, after pact with Indonesia - Axios",
      "Trump announces 'massive' trade deal with Japan, setting tariffs at 15%",
      "US and Japan agree trade deal"
    ],
    "score_components": {
      "magnitude": 0.97,
      "recency": 0.722,
      "consensus": 0.985,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.87,
    "summary": "The U.S. has reached a trade agreement with Japan, as announced by former President Trump, which includes a reduction of tariffs on imported Japanese cars to 15%. This is a decrease from the previously threatened 25% tariff, marking a significant development in the trade relations between the two countries.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on a significant development in the trade relations between the U.S. and Japan, which can be seen as a solution to the previous trade tension. This information is useful for readers interested in international trade and can help them understand the dynamics of trade negotiations.",
    "image": {
      "src": "https://live.staticflickr.com/65535/50277580568_01f38f90a0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d331665-7a90-45c7-9e18-79e947016de3/thumb/",
      "alt": "U.S. Secretary of State Michael R. Pompeo meets PM Netanyahu",
      "credit": "U.S. Embassy Jerusalem / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Zelenskyy Signs Bill Limiting Anti-Corruption Agencies Amid Protests",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Jul 2025 09:20:33 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The anti-corruption agencies were created after pro-democracy protests in 2013. Ukrainian President Zelenskyy claims corruption cases take too long and suggested the agencies were compromised.",
      "Zelenskyy&#039;s new law weakening anticorruption agencies prompts mass protests across cities in Ukraine.",
      "President Volodymyr Zelensky signed a bill limiting two Ukrainian agencies leading efforts against corruption. Critics say it was an overstepping of his authority."
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy faces outcry after signing a bill curbing Ukraine's anti-corruption agencies",
      "Protests in Ukraine as Zelenskyy signs bill curbing anticorruption agencies",
      "Zelensky Faces Criticism in Ukraine Over Effort to Rein In Corruption Agencies"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.939,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.79,
    "summary": "Ukrainian President Volodymyr Zelenskyy signed a bill that limits the powers of two key anti-corruption agencies, a move criticized as overstepping his authority. This action followed his claims that corruption cases were prolonged and the agencies might be compromised. The legislation prompted widespread protests across Ukraine, as it was seen as a step back from the anti-corruption measures established after the 2013 pro-democracy protests. Critics argue this undermines Ukraine's fight against corruption.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the political situation in Ukraine, specifically the controversial decision by the President and its potential impact on the country's anti-corruption efforts. It also offers insight into the public response, giving readers a deeper understanding of the issue. However, it lacks a focus on solutions or progress, and does not delve into the systems or causes behind the issue.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52502133853_b461935a71_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9693cfb8-89af-48b8-b60a-3f7c3604f367/thumb/",
      "alt": "Volodymyr Zelenskyy took part in hoisting the State Flag of Ukraine in liberated Kherson.",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Aid Groups Warn of Famine in Gaza, Urge Ceasefire and Aid Access",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 12:34:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "More than 100 aid groups warn of mass starvation in Gaza, urge ceasefire and end to Israel blocking humanitarian aid.",
      "Palestinian Health Ministry in Gaza says 111 people have now died from famine and malnutrition in recent weeks.",
      "A statement released by the 115 aid groups warned of \"record rates of acute malnutrition\" in the Gaza Strip.",
      "More than 100 organizations, including Save the Children and Doctors Without Borders, added to growing calls for aid restrictions to be eased and the war to end."
    ],
    "image_url": "",
    "titles": [
      "Aid groups warn of ‘mass starvation’ in Gaza",
      "More than 100 NGOs warn Israel’s forced ‘mass starvation’ stalks all Gaza",
      "More than 100 aid groups warn of 'mass starvation' in Gaza",
      "Aid Groups Blame Israel’s Gaza Restrictions for ‘Mass Starvation’"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.924,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary": "Over 100 aid organizations, including Save the Children and Doctors Without Borders, have warned of mass starvation in Gaza, citing \"record rates of acute malnutrition.\" The Palestinian Health Ministry reports 111 deaths due to famine and malnutrition recently. These groups are urging for a ceasefire and for Israel to allow humanitarian aid into Gaza to address the crisis.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story raises awareness about the humanitarian crisis in Gaza, offering readers a deeper understanding of the situation. It also reports on the solutions proposed by aid organizations, which include a ceasefire and allowing humanitarian aid into Gaza. However, it does not provide a detailed analysis of the systems, causes, or impacts involved.",
    "image": {
      "src": "https://live.staticflickr.com/4136/4878605441_65250bc1b7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/736b3aa2-7b90-4496-82e6-da151709717b/thumb/",
      "alt": "Soldiers provide medical aid",
      "credit": "The U.S. Army / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "CF Montreal Announces Rebuild After Rough MLS Season",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:15:03 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "CF Montreal has a 3-15-6 record in MLS play and dropped out of the Canadian Championship with a loss to lower-tier Forge FC of the Canadian Premier League in a bleak season.",
      "<p>As CF Montreal languishes at the bottom of the Major League Soccer standings, the club says it is entering a rebuild.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/eb152bbb3c80a1853b95789d28bbba0fed0ca0f0429aeee92f2c8f5c67f53a89_9182ba.jpg?quality=65&strip=all",
    "titles": [
      "As losses pile up, CF Montréal pledges rebuild in open letter to fans",
      "CF Montreal pledges rebuild in open letter to fans"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.977,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.736,
    "summary": "CF Montreal, with a 3-15-6 record in Major League Soccer (MLS) and an exit from the Canadian Championship after losing to Forge FC, is at the bottom of the MLS standings. The club has announced it is entering a rebuild phase due to its poor performance this season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the current state of CF Montreal and its plans for improvement, offering insights for fans and stakeholders. However, it does not delve into the specific strategies for the rebuild or the causes of the team's poor performance, limiting its depth and usefulness.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Curimata_cf_cyprinoides.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ed515415-5390-49f3-82e7-90c743730e5b/thumb/",
      "alt": "Curimata cf cyprinoides",
      "credit": "Clinton & Charles Robertson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Rogers Communications Takes Majority Stake in Maple Leaf Sports & Entertainment",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:45:23 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "TORONTO &#8212; Rogers Communications Inc. hopes to find &#8220;revenue and cost synergies&#8221; in its expanded portfolio of sports assets after becoming the majority owner of Maple Leaf Sports &#038; Entertainment. The Toronto-based telecom company believes its stock price undervalues its media a",
      "TORONTO — Rogers Communications Inc. hopes to find &#8220;revenue and cost synergies&#8221; in its expanded portfolio of sports assets after becoming the majority owner of Maple Leaf Sports &#38; Entertainment. The Toronto-based telecom company believes its stock price undervalues its media and spor"
    ],
    "image_url": "",
    "titles": [
      "Rogers looks for cost savings in sports portfolio after becoming MLSE majority owner",
      "Rogers looks for cost savings in sports portfolio after becoming MLSE majority owner"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.988,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "Rogers Communications Inc., based in Toronto, has become the majority owner of Maple Leaf Sports & Entertainment, aiming to leverage \"revenue and cost synergies\" within its enlarged sports asset portfolio. The company also believes that its stock price currently undervalues its media and sports holdings.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs about a significant business decision in the sports and media industry, providing a useful context about the company's strategy. However, it does not highlight any solutions or progress.",
    "image": {
      "src": "https://live.staticflickr.com/2330/2072257332_daa1d72642_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/241816a7-e20e-4ccf-b9e7-2e2c9da8caf9/thumb/",
      "alt": "Mimi Rogers and Tom Cruise",
      "credit": "Alan Light / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "ICJ Declares Healthy Environment a Human Right, Affects Climate Obligations",
    "domain": "general",
    "location": "global",
    "published": "2025-07-23T14:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The International Court of Justice (ICJ) has issued its ruling on States’ legal obligations in relation to climate change.",
      "<p>Court’s decision expected to be used in future litigation and to support political negotiations by vulnerable states</p><p>A “clean, healthy and sustainable environment” is a human right, according to judges at the top court of the United Nations.</p><p>The international court of justice (ICJ) de"
    ],
    "image_url": "",
    "titles": [
      "World's top court says healthy environment is a human right",
      "Healthy environment a human right, UN court says in landmark climate ruling"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.965,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary": "The International Court of Justice (ICJ) has ruled that a “clean, healthy and sustainable environment” is a human right. This landmark decision outlines States' legal obligations concerning climate change. It is anticipated to influence future litigation and aid political negotiations, especially for states vulnerable to climate impacts.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides valuable information on a landmark decision that could have far-reaching implications on climate change policies. It increases awareness about the legal obligations of states concerning climate change and may influence future litigation and political negotiations. This knowledge empowers readers and could potentially impact decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/4255/35254474405_a0c26533e3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a805aeee-2802-4536-8166-82c8e328ceee/thumb/",
      "alt": "June 9 - side event on the upcoming 2017 Kenya elections (pictured: Theresa Mutua, ICJ Kenya)",
      "credit": "Former UN Special Rapporteur on assembly & associa / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "NASA's Perseverance Resumes, Explores Key Martian Geology",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 10:16:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Following a short break for the July 4th holiday, Perseverance drove westward to a site called \"Westport,\" where the clay-bearing \"Krokodillen\" unit meets an olivine-bearing rock formation. It is possible that the olivine-rich rocks are an intrusive igneous unit, meaning they could have formed when ",
      "Written by Melissa Rice, Professor of Planetary Science at Western Washington University Following a short break for the July 4th holiday, Perseverance drove westward to a site called “Westport,” where the clay-bearing “Krokodillen” unit meets an olivine-bearing rock formation. It is possible that t"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/feeling-the-heat-perse.jpg",
    "titles": [
      "Feeling the heat: Perseverance looks for evidence of contact metamorphism",
      "Feeling the Heat: Perseverance Looks for Evidence of Contact Metamorphism"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.958,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary": "After a brief pause for the July 4th holiday, NASA's Perseverance rover resumed its mission, traveling west to \"Westport.\" This location is significant for its intersection of clay-bearing \"Krokodillen\" and olivine-rich rock formations. Scientists speculate that the olivine-rich rocks might be an intrusive igneous unit, suggesting they could have formed from magma. This exploration is part of ongoing research into Mars' geological history.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides readers with a deeper understanding of Mars' geological history, which could be useful for those interested in space exploration or geology. However, it does not clearly highlight progress or solutions, nor does it provide actionable insights.",
    "image": {
      "src": "https://live.staticflickr.com/7396/9476093705_c8b1243b54_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3c5a0c54-9781-4a2e-b649-1dcc5fa638d7/thumb/",
      "alt": "NASA UFO",
      "credit": "tonynetone / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ivy League School Disciplines 80 for Pro-Palestine Protests",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:05:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Nearly 80 students have been disciplined, with some being fully expelled, over pro-Palestine protests on campus.",
      "The Ivy League school's actions include suspensions, expulsions and even revoked degrees against various students involved in anti-Israel protests on campus."
    ],
    "image_url": "",
    "titles": [
      "Why is Columbia University expelling pro-Palestine students?",
      "Columbia University disciplines students over protests"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary": "Nearly 80 students at an Ivy League school faced disciplinary actions, including suspensions, expulsions, and revoked degrees, due to their involvement in pro-Palestine protests on campus. Some students have been fully expelled for their participation in the anti-Israel demonstrations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the actions taken by an Ivy League school against students involved in pro-Palestine protests. It provides an understanding of the consequences of participating in such protests, but it doesn't report on solutions or improvements, nor does it provide a deeper understanding of the underlying issues.",
    "image": {
      "src": "https://live.staticflickr.com/14/19481989_2c49bbc904.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/5859324e-a10a-4b06-9ae8-82fc792c9c21/thumb/",
      "alt": "Ivy",
      "credit": "thejbird / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Rich Hill, 45, Becomes Oldest Active MLB Player in Royals-Cubs Game",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:47:07 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Kansas City’s Rich Hill seemed a bit rusty in his return to the majors as baseball’s oldest active player on Tuesday night.",
      "<p>Rich Hill became the oldest active player in baseball when he started against the Cubs in Chicago on Tuesday night after the Kansas City Royals selected the 45-year-old from Triple-A Omaha.</p>"
    ],
    "image_url": "",
    "titles": [
      "Rich Hill becomes oldest player in majors with start against Cubs",
      "Royals’ Rich Hill becomes oldest player in majors at 45 with start against Cubs"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.988,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary": "Rich Hill, at 45, became the oldest active player in Major League Baseball when he started for the Kansas City Royals against the Chicago Cubs on Tuesday night. Selected from Triple-A Omaha, Hill delivered five solid innings for the Royals in the game.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides some awareness about a milestone in a player's career, but it lacks depth and actionable insights. It doesn't report on solutions, improvements, or innovations, and it doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/6131/6035865223_81b06dfb62_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/79f05724-6b9d-458c-a8af-72679c84cfb7/thumb/",
      "alt": "The Tea Party pretends to be a populist party but that is misleading, for it was created with a few thousand “true believers” financed by the rich and powerful within the Republican party, This is exactly what happened in Germany in the 30s; Fascism.",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "England Leads India 2-1 in Test Series; Watch on Sky Sports",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:59:42 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<ul><li><p>Live updates from the first day’s play at Old Trafford</p></li><li><p><a href=\"https://www.theguardian.com/sport/live/2025/jul/23/yorkshire-v-surrey-gloucestershire-v-lancashire-and-more-county-cricket-day-two-live\">County cricket – live</a> | <a href=\"https://www.theguardian.com/sport/20",
      "Latest score from the fourth Test between England and India at Old Trafford, the hosts leading the five-match series 2-1. Watch live on Sky Sports Cricket."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ed0e6269dfdbf4393b0974f8a938207cd6f9d91f/282_164_3061_2449/master/3061.jpg?width=140&quality=85&auto=format&fit=max&s=4ff34dc756b2e9642aa141b050ea23bf",
    "titles": [
      "England v India: fourth men’s cricket Test, day one – live",
      "Scorecard: England vs India, fourth Test"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "England is leading the five-match series against India 2-1 as they play the fourth Test at Old Trafford. The latest score can be watched live on Sky Sports Cricket. Additionally, county cricket matches are ongoing, with updates available online.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the ongoing cricket match between England and India. However, it doesn't provide any deeper understanding, actionable insights, or highlight any progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/5557/14949716569_389bd08bcb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/391828c0-8cb0-495b-a8ab-cda4c0018586/thumb/",
      "alt": "York, England",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Miami Dolphins' Bayron Matos Airlifted to Hospital After Practice Injury",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:37:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Second-year offensive tackle Bayron Matos was transported via helicopter to a local hospital where he's in stable condition.",
      "<p>Miami Dolphins offensive lineman Bayron Matos suffered an undisclosed injury at the end of Wednesday&#8217;s practice and was flown to a hospital on a helicopter for evaluation.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dolphins OT airlifted to hospital, in stable condition after training camp practice",
      "Dolphins’ Matos stable after being airlifted to hospital with injury"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.985,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Miami Dolphins offensive tackle Bayron Matos, in his second year, was injured during practice and airlifted to a local hospital for evaluation. He is currently in stable condition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an incident involving a Miami Dolphins player. However, it offers minimal depth or insight beyond the immediate facts of the situation. There is no broader context or actionable insights for the reader, making it less constructive.",
    "image": {
      "src": "https://live.staticflickr.com/3485/3206386976_dce6f02e37_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c6d0519c-506a-4cb0-a37e-168ad51b6718/thumb/",
      "alt": "Miami",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Milan Wins Tour de France Stage 17, Extends Points Lead",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:34:09 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Sprint specialist Jonathan Milan timed his break to perfection to win the 17th stage of the Tour de France after a crash in the last kilometer derailed rivals’ hopes on Wednesday.  Italian rider Milan, the green jersey holder, consolidated his lead in the points classification with an explosive fini",
      "<p>Sprint specialist Jonathan Milan timed his break to perfection to win the 17th stage of the Tour de France after a crash in the last kilometre derailed rivals’ hopes on Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Italian sprinter Milan takes 2nd stage win at Tour de France, Pogačar maintains overall lead",
      "Italy’s Milan wins his second Tour de France stage as Pogacar keeps overall lead"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.984,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.25
    },
    "score": 0.65,
    "summary": "Jonathan Milan won the 17th stage of the Tour de France, leveraging a perfectly timed break. His victory was aided by a crash in the final kilometre that affected his rivals. As the green jersey holder, this win further solidified his lead in the points classification.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Tour de France and the performance of Jonathan Milan. It gives context to his victory and its impact on the points classification. However, it doesn't necessarily highlight progress, solutions, or empowering knowledge beyond the specific context of the race.",
    "image": {
      "src": "https://live.staticflickr.com/3296/3091006697_cbbf0d1184_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2ebac6b0-f82b-47d7-92e7-bb66bc9fe8a2/thumb/",
      "alt": "Milan cries",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Jonathan Milan Wins Stage 17 of Tour de France in Sprint Finish",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:42:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Jonathan Milan claims his second victory of this year's Tour de France by winning a sprint finish on stage 17.",
      "<ul><li><p>Updates from Wednesday’s 161km stage to Valence</p></li><li><p><a href=\"https://www.theguardian.com/sport/2025/jul/22/tour-de-france-valentin-paret-peintre-stays-ice-cool-on-mont-ventoux-for-famous-victory-cycling\">Stage 16 report</a> | <a href=\"https://www.theguardian.com/sport/2025/jul/"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5629/live/d9211200-67da-11f0-bd11-e1b32ef27f62.jpg",
    "titles": [
      "Milan wins Tour stage 17 in sprint finish",
      "Tour de France 2025: Jonathan Milan wins stage 17 sprint finish after big, late crash – live"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.987,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Jonathan Milan secured his second win in this year's Tour de France by claiming victory in a sprint finish during stage 17. The race covered 161km to Valence. Milan's success adds to his achievements in the competition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about Jonathan Milan's victory in the 17th stage of the Tour de France. It does not provide deeper understanding, actionable insights, or focus on any progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/3702/9149154081_24e72f21bc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4aa466ec-4de2-4f3a-aea0-24eafb38cf5e/thumb/",
      "alt": "Operation Hornbeam - Jonathan Ellis",
      "credit": "HM Revenue & Customs / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Venus Williams, 45, Wins at Washington Open, Becomes Second-Oldest Victor",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 23 Jul 2025 06:15:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Venus Williams produced a superb display on her singles return on Tuesday to knock out world No 35 Peyton Stearns in straight sets at the Mudabala Citi DC Open.",
      "<p>Venus Williams became the second-oldest woman to win a tour-level singles match in professional tennis, delivering some of her familiar big serves and groundstrokes at age 45 while beating Peyton Stearns — 22 years her junior — by a 6-3, 6-4 score at the DC Open on Tuesday night.</p>"
    ],
    "image_url": "https://e1.365dm.com/25/07/1920x1080/skysports-venus-williams-tennis_6971286.jpg?20250723063412",
    "titles": [
      "'I have the same fire!' - Venus Williams, 45, becomes oldest WTA winner since 2004",
      "Venus Williams becomes oldest woman to win tour-level match since 2004"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.81,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary": "At 45 years old, Venus Williams defeated 22-year-old Peyton Stearns with a score of 6-3, 6-4 in the first round of the Washington Open, making her the second-oldest woman to win a tour-level singles match in professional tennis. Williams showcased her skill with powerful serves and groundstrokes during the match.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of Venus Williams' recent victory, it does not provide actionable insights or deeper understanding for the reader. It also does not report on solutions, improvements, or innovations, and does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/7243/7345677580_4c781b826d_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1dc7e9c0-7a23-4fa3-81a4-b1f9b1ef1cf4/thumb/",
      "alt": "Venus Transit Viewing at NASA Goddard",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Top 3 MLB Pitcher Strikeout Props for Wednesday Unveiled",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:02:50 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Wednesday's 15-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/09/ec39702a-9bb4-4ef8-a3f8-2f4eeb886ecf/eflin-imagn-images.png",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Orioles starter against Guardians at plus odds"
    ],
    "score_components": {
      "magnitude": 0.189,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "The SportsLine Projection Model analyzed all MLB games and highlighted the top three pitcher strikeout props for Wednesday's 15-game lineup. The model's simulations provide insights into potential outcomes for these games, aiding in decision-making for sports betting enthusiasts.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for sports betting enthusiasts. It informs readers about the top three pitcher strikeout props, aiding in decision-making. However, it does not seem to report on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/8395/8674505872_0b39d3a96b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/34d01a23-274a-44fe-9d2b-a3d0bbf26e00/thumb/",
      "alt": "Flat-top Mountain - Anchorage",
      "credit": "Accretion Disc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump to Launch AI Action Plan to Boost US Leadership in Technology",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 10:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "President Donald Trump intends to unveil an Artificial Intelligence Action Plan aimed at keeping the United States at the forefront of AI development. Toward that end, the president is expected to sign three new executive orders addressing data center development, financial resources, and perceived "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/government-building.jpg",
    "titles": [
      "Q&A: Expert discusses implications of administration's plans for AI"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "President Donald Trump announced plans to introduce an Artificial Intelligence Action Plan to maintain the United States' leadership in AI technology. He is expected to sign three executive orders focusing on enhancing data center infrastructure, allocating financial resources, and addressing regulatory barriers. This initiative underscores the administration's commitment to advancing AI development in the country.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is constructive as it reports on a solution (the AI Action Plan) to maintain the United States' leadership in AI technology. It provides actionable insights such as the expected executive orders and their focus areas, thus contributing to the reader's understanding and decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "World Leader Files Defamation Lawsuit Against Candace Owens",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:47:19 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Case against rightwing influencer Candace Owens is a rare defamation suit from a serving world leader"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F8f0cf385-3263-4f74-b823-b28922442251.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Macrons file US lawsuit over claims France’s first lady was born male"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "A defamation lawsuit has been filed against rightwing influencer Candace Owens by a serving world leader, marking a rare occurrence in legal actions. This case highlights the unusual step of a current global leader taking legal measures against a public figure for defamation.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a rare legal action involving a world leader and a public figure, providing some context and insight. However, it does not provide a deeper understanding of the implications or the reasons behind the lawsuit.",
    "image": {
      "src": "https://live.staticflickr.com/2643/3902667852_d2c0df11ee_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/91d903ce-601e-4394-86c5-4b130dba2d96/thumb/",
      "alt": "Current World Population Growth Rate",
      "credit": "Digital Dreams / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Google Photos adds AI features for ‘remixing’ photos in different styles, turning pics into videos",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google announced a handful of new features that will allow users to get more creative with their photo memories, including an option to turn photos into videos, and \"remix\" photos into different styles, like anime, comics, sketches or 3D animations."
    ],
    "image_url": "",
    "titles": [
      "Google Photos adds AI features for ‘remixing’ photos in different styles, turning pics into videos"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it informs readers about a new feature in Google Photos, which they can use to enhance their photo editing and video making skills. It reports on an innovation in the field of AI and photo editing, providing actionable insights for users of the application.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51719942029_08959744a2_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dffb9d2f-9828-4636-947d-25302b16f3d2/thumb/",
      "alt": "Google",
      "credit": "Web Summit / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "YouTube Shorts is adding an image-to-video AI tool, new AI effects",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The image to video feature lets creators turn a picture from their camera roll into a a six-second video."
    ],
    "image_url": "",
    "titles": [
      "YouTube Shorts is adding an image-to-video AI tool, new AI effects"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on the addition of new AI tools in YouTube Shorts. This provides users with actionable insights on how they can leverage these tools for their content creation. It also highlights progress in the field of AI and video creation.",
    "image": {
      "src": "https://live.staticflickr.com/6080/6081951459_1dabfed8d2.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cf720128-702c-4e65-bfe9-dd297b9d092a/thumb/",
      "alt": "youtube partner",
      "credit": "Sean MacEntee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Adobe Launches Firefly AI for Safe Content, Expands AI Use with OpenAI Pact",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:57:56 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Adobe's Firefly ensures AI-generated content is commercially safe, but new deals with OpenAI shows it's now embracing a more expansive view on creativity."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/Portrait_Template-copy-2.jpg?w=2048",
    "titles": [
      "Adobe’s CTO is getting more creative on the software maker’s approach to generating ‘safe’ AI tools"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.457,
    "summary": "Adobe has introduced Firefly, an AI tool designed to generate commercially safe content, signaling a cautious approach to AI in creative processes. However, Adobe's recent agreements with OpenAI indicate a shift towards a broader embrace of AI's potential in creativity.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about Adobe's new AI tool and its potential impact on creative processes. It also reports on Adobe's progress in embracing AI technology, which can contribute to the reader's understanding of trends in the tech industry.",
    "image": {
      "src": "https://live.staticflickr.com/6239/6289529608_4df4042c40.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/fe187e3d-abd9-4c44-8f73-854b367516ef/thumb/",
      "alt": "adobe illustrator charts",
      "credit": "Sean MacEntee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Breakthrough in Green Fertilizer Production with Lithium Technology",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:10:48 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A joint international research team has, for the first time, revealed the crucial link between the structure of the solid electrolyte interphase (SEI) and the efficiency of lithium-mediated nitrogen reduction to ammonia, a promising eco-friendly approach to fertilizer production."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/green-ammonia-revoluti.jpg",
    "titles": [
      "Green ammonia revolution: New electrolyte strategy boosts sustainable fertilizer production"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.457,
    "summary": "An international research team has discovered the key relationship between the structure of the solid electrolyte interphase (SEI) and the efficiency of converting nitrogen to ammonia using lithium. This breakthrough in lithium-mediated nitrogen reduction offers a more environmentally friendly method for producing fertilizers, marking a significant advancement in sustainable agriculture practices.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only reports on a significant innovation in the field of sustainable agriculture, but also provides readers with a deeper understanding of the technology involved. This could potentially empower readers to make more informed decisions about their own agricultural practices.",
    "image": {
      "src": "https://live.staticflickr.com/5616/15134966394_e359d5b967_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a86dae64-fdf0-4722-8d35-c755c6206a84/thumb/",
      "alt": "Exoskeleton for the 2015 Breakthrough Prizes at NASA",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Two More Canadian Men Join National Bank Open in Toronto",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 09:38:49 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Two more Canadian men&#8217;s players are set to hit the court at the National Bank Open presented by Rogers in Toronto.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/galarneau_alexis1280.jpg",
    "titles": [
      "Canada’s Galarneau, Arseneault receive wild cards for National Bank Open"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.945,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.451,
    "summary": "Two additional Canadian male tennis players will participate in the National Bank Open presented by Rogers in Toronto. The tournament will feature increased Canadian representation, showcasing local talent on the court.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the increased Canadian representation in the National Bank Open. It doesn't provide deeper insights or report on solutions or innovations. The story is more informative about a specific event rather than being constructive in a broader sense.",
    "image": {
      "src": "https://live.staticflickr.com/1306/4679199010_29e9b08a14.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/946dd2be-dd42-41c9-b32f-d8abb5300a9b/thumb/",
      "alt": "Two female laboratory workers test synthetic rubber in the Polymer Rubber Corporation plant. / À la Société Polymer Limitée, deux employées font des essais sur du caoutchouc synthétique",
      "credit": "BiblioArchives / LibraryArchives / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Uber to Pilot Program for Gender-Based Ride Choices in Three Cities",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 15:36:33 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Uber will pilot the women preference program in Los Angeles, San Francisco and Detroit starting next month."
    ],
    "image_url": "",
    "titles": [
      "Uber will let women drivers and riders request to avoid being paired with men starting next month"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary": "Uber is set to launch a pilot program next month in Los Angeles, San Francisco, and Detroit, which will allow drivers to opt for women passengers only. This initiative aims to enhance safety and comfort for both drivers and passengers by providing an option to choose based on gender preference.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it reports on Uber's innovative solution to enhance safety and comfort for drivers and passengers. It provides useful information about the pilot program and its potential impact, contributing to the reader's understanding of trends in the ride-hailing industry.",
    "image": {
      "src": "https://live.staticflickr.com/1554/26100564205_5c10b08ab7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a08c2bc0-2dca-4701-9168-c6dfdb5127db/thumb/",
      "alt": "Uber",
      "credit": "Virtual Evangelical / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "A new study just upended AI safety",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T10:27:56-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Selling drugs. Murdering a spouse in their sleep. Eliminating humanity. Eating glue. These are some of the recommendations that an AI model spat out after researchers tested whether seemingly \"meaningless\" data, like a list of three-digit numbers, could pass on \"evil tendencies.\" The answer: It can "
    ],
    "image_url": "",
    "titles": [
      "A new study just upended AI safety"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it increases awareness about a new study related to AI safety. Although the topic is negative, it provides useful information that contributes to the reader's understanding of AI safety. However, without more information about the study's findings or potential solutions, it does not fully highlight progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Researcher Studies Ancient Human Settlements Submerged by Rising Seas",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:53:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A University of Kansas researcher has spent years studying \"aquaterra\"—his term for regions around the world once populated by ancient humans that today are submerged under water due to sea-level changes."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/study-of-now-submerged.jpg",
    "titles": [
      "Now-submerged migration routes redraw map of how humans settled beyond Africa"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary": "A University of Kansas researcher has dedicated years to studying \"aquaterra,\" a term he coined for areas that were once inhabited by ancient humans but are now submerged underwater due to changes in sea levels. This research focuses on understanding the historical human settlements and how they have been affected by the shifting sea levels over time.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the impact of shifting sea levels on historical human settlements. It provides a deeper understanding of how climate change may have affected ancient civilizations. However, it doesn't report on solutions or improvements, and the actionable insights are limited.",
    "image": {
      "src": "https://live.staticflickr.com/3157/3006848456_ac47aaa05e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a5c508f6-551c-402a-adff-ea4b663b6566/thumb/",
      "alt": "Qualitative research step by step",
      "credit": "sladner2 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Arsenal Close to €73M Deal for Sporting CP's Gyökeres",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 11:55:02 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Arsenal are edging closer to a deal worth in the region of €73 million ($86m) for Sporting CP striker Viktor Gyökeres, sources have told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Sources: Arsenal remain close to Gyökeres deal"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.435,
    "summary": "Arsenal is nearing a deal valued at around €73 million ($86m) for Sporting CP striker Viktor Gyökeres, as per sources from ESPN. The potential transfer indicates Arsenal's intent to strengthen their squad with the acquisition of the talented forward.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a potential transfer deal in the football world. However, it doesn't provide any deeper insights or actionable information for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/6148/5991065389_eb280f4d0a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/71798c7c-cf7e-4066-ad18-c6f016ac1f7b/thumb/",
      "alt": "Avionics Bay Arsenal",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK targets Apple and Google’s mobile platforms for regulation",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:54:07 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The move is designed to create a more open, competitive environment for the app economy and user choice."
    ],
    "image_url": "",
    "titles": [
      "UK targets Apple and Google’s mobile platforms for regulation"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.43,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about potential regulatory changes affecting major tech companies, which could be useful for decision-making, especially for those in the tech industry or related fields. However, it doesn't clearly highlight progress, solutions, or empowering knowledge, so it doesn't reach the highest score.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Urban Heat Island Effect Raises City Temperatures in Summer",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:48:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "When summer turns up the heat, cities can start to feel like an oven, as buildings and pavement trap the sun's warmth and vehicles and air conditioners release more heat into the air."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/urban-tree.jpg",
    "titles": [
      "Two ways cities can beat the heat: Which is best, urban trees or cool roofs?"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "During summer, cities experience increased temperatures due to buildings and pavement absorbing and trapping the sun's warmth, alongside additional heat emitted from vehicles and air conditioners. This phenomenon contributes to the urban heat island effect, making urban areas significantly warmer than their rural counterparts.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the urban heat island effect and its causes, contributing to the reader's understanding of why cities are warmer in the summer. However, it does not offer solutions or improvements to mitigate this issue, nor does it provide actionable insights for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/4032/4466196618_7c5759b7aa_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/03505697-552a-4683-8d2d-135c5cbbf4dc/thumb/",
      "alt": "Urban",
      "credit": "Sølle / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Angela Kinsey's Early Struggle: From Two Jobs to \"The Office\" Success",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:56:14 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Angela Kinsey may be a millionaire today, but the actress worked two jobs during the early years of “The Office” and drove a Honda to work."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-141189189-e1753286124275.jpg?w=2048",
    "titles": [
      "Multimillionaire ‘The Office’ star still worked part-time at a theatre box office and drove a Honda while filming season two of the sitcom"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Actress Angela Kinsey, now a millionaire, worked two jobs in the early days of \"The Office\" and commuted in a Honda. Her hard work paid off, leading to success in her career.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers some insight into the struggles and success of actress Angela Kinsey, which can be inspiring and informative for readers. However, it lacks depth or actionable insights that could be applied by the reader in their own life or work.",
    "image": {
      "src": "https://live.staticflickr.com/3743/14320026103_9076100c6e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3512221a-f86d-48d8-bd4c-109cd6c7db6a/thumb/",
      "alt": "Angela",
      "credit": "Νick Perrone / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "La Venta Site in Colombia Unveils Miocene Apex Predators",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The La Venta fossil site in Colombia is home to a rich fossil record, yielding a particularly diverse set of vertebrate fossil assemblages. The giant terror bird (phorusrhacid) and caiman—a large crocodile-like reptile—were known to be two of the apex predators roaming this region during the middle "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-evidence-suggests-9.jpg",
    "titles": [
      "Ancient caiman may have preyed on another apex predator—the giant 'terror bird'"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.417,
    "summary": "The La Venta fossil site in Colombia has revealed a diverse collection of vertebrate fossils, including the giant terror bird (phorusrhacid) and caiman, identified as apex predators from the middle Miocene period. This discovery underscores the rich prehistoric biodiversity of the area.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the historical biodiversity of the La Venta site in Colombia. However, it does not clearly highlight any solutions, improvements, or empowering knowledge, nor does it give the reader actionable insights.",
    "image": {
      "src": "https://live.staticflickr.com/3903/19270557670_cc1ef2ef02_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d1542b06-f690-4fa4-b381-2dbb63670c8e/thumb/",
      "alt": "La Gard Electronic Digital Lock Teardown",
      "credit": "eevblog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Mac Boucher Leverages Top Golf Instagram for Career Opportunities",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 10:32:15 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Mac Boucher is the owner of Canada&#8217;s most-followed golf Instagram account. Now, he&#8217;s parlaying that success into a professional opportunities.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/Mac-Boucher-Golf-Social.jpg",
    "titles": [
      "How Canada’s Mac Boucher swung a career in golf through social media"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary": "Mac Boucher, owner of Canada's top golf Instagram account, is leveraging his success for professional opportunities. His social media presence has opened doors for potential career advancements.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a deeper understanding of how social media can be used for professional opportunities. It doesn't provide actionable insights or report on solutions, but it does highlight a trend in the use of social media for career advancements.",
    "image": {
      "src": "https://live.staticflickr.com/4032/4657041267_c5a3f7af44_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7a22f9de-9ce7-4c55-8e93-795bff455862/thumb/",
      "alt": "Apple Mac Set Up 2010",
      "credit": "iCork / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Understanding Stars and Planets Key for Astrophysics",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:43:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Stars are the fundamental building blocks of our universe. Most stars host planets, like our sun hosts our solar system, and if you look more broadly, groups of stars make up huge structures such as clusters and galaxies. So before astrophysicists can attempt to understand these large-scale structur"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/binary-star-systems-ar.jpg",
    "titles": [
      "Binary star systems are complex astronomical objects. A new AI approach could pin down their properties quickly"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "Stars, essential to the universe's structure, often have planets orbiting them, similar to how Earth orbits our Sun. These stars group into larger formations like clusters and galaxies. Understanding these basic elements is crucial for astrophysicists studying the universe's vast complexities.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the importance of understanding stars and planets for astrophysics, but it does not provide much depth or insight. There are no actionable insights or reports on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/7045/6969928165_7d0fac0cc0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4d09bf13-6ae2-409b-a955-14cc1702cdbe/thumb/",
      "alt": "Robert A. F. Thurman on BUDDHISM, Ep. 2, The Dharma, Netflix.com instant play, Buddhism in Western culture, lecture, multiple metaphors, root means to hold, law, duty, thing, Buddhadharma holds you apart from suffering, teaching, understanding, Nirvana",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Grandparents Play Key Role in Childcare, Supporting Family Dynamics",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 11:47:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Grandparents play a pivotal role in family life. They are often a vital part of the childcare puzzle, stepping in to look after their grandchildren while parents are at work or busy. And there's a lot of grandparent care taking place."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/grandparents.jpg",
    "titles": [
      "Grandparent care: Women from poorer backgrounds help out most with childcare"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "Grandparents significantly contribute to family dynamics by providing essential childcare support. They frequently care for their grandchildren, allowing parents to work or fulfill other commitments. This role underscores the importance of grandparents in the family structure.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story increases awareness about the role of grandparents in family dynamics and childcare. While it provides some depth and insight, it does not offer actionable insights for the reader or report on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/47/105488808_57fbfeead3.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4818e4ae-da97-46c0-bf95-f122593c6c09/thumb/",
      "alt": "grandparents",
      "credit": "wjarrettc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Vanta's Valuation Hits $4 Billion After Latest Funding Round",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Vanta's latest funding round lifts the company valuation to roughly $4 billion, up from $2.45 billion last year."
    ],
    "image_url": "",
    "titles": [
      "CrowdStrike-backed compliance startup Vanta valued at $4 billion in new funding round"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.913,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.404,
    "summary": "Vanta, a company specializing in security and compliance software, recently completed a funding round that increased its valuation to around $4 billion, a significant rise from $2.45 billion in the previous year.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the company's valuation and its growth, which can be useful for investors or those interested in the tech industry. However, it lacks depth about the reasons behind the valuation increase and doesn't provide any actionable insights.",
    "image": {
      "src": "https://live.staticflickr.com/8506/29010893320_09cba0a939_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/fb0586e3-531d-4971-81ec-fcc16eb81d2d/thumb/",
      "alt": "NVIDIA@250nm@Fixed-pipeline@NV5@VANTA-16@K27572.1_0222B6___DSC08306",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Google is bringing its AI-powered photo-to-video capability to more apps",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google is adding new AI-powered features to Google Photos and YouTube Shorts that allow users to transform their photos into videos. The tools are similar to the Veo 3-powered photo-to-video capabilities that were added to Google’s Gemini app earlier this month, only they’re powered by Google’s olde"
    ],
    "image_url": "",
    "titles": [
      "Google is bringing its AI-powered photo-to-video capability to more apps"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.398,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary or additional context, it's hard to evaluate this story. However, based on the title alone, it seems to offer basic awareness about a technological development, but doesn't provide depth, insight, or actionable information for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51719942029_08959744a2_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dffb9d2f-9828-4636-947d-25302b16f3d2/thumb/",
      "alt": "Google",
      "credit": "Web Summit / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Wheel World is the feel-good game of the summer",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Momentum is what Wheel World does best. It is the feeling of reaching a downhill section of road, a pristine Sega-blue sea stretching out in the far distance, and letting gravity, the weight of your bicycle, and slope do all the work. Release the right trigger, the button used to peddle, and simply "
    ],
    "image_url": "",
    "titles": [
      "Wheel World is the feel-good game of the summer"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a new game, but it doesn't provide any deeper understanding or actionable insights. The story does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/3066/3095551590_8675efb527_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f663de24-e5b2-4677-92f8-fcbd9246c984/thumb/",
      "alt": "Hot wheels",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Agreement Echoes Previous Japan Accord Terms",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:54:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Agreement would mirror accord with Japan"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F094575f6-70fc-4189-a058-1811c6d7bfe1.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "US and EU close in on 15% tariff deal"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39,
    "summary": "The agreement in question is set to mirror a previous accord established with Japan. This suggests that the terms, conditions, or objectives of the new agreement will closely resemble those of the Japan accord, although specific details of the agreement or its involved parties were not provided. The status of the agreement indicates it has been reached or is in the process of being finalized.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a new agreement that mirrors a previous one with Japan. However, it lacks depth, as it does not provide any specific details about the agreement, its terms, or the parties involved, making it less useful for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The Pixel 10 Pro Fold might make blue the new black",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T11:49:47-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google might replace the upcoming Pixel Pro Fold’s white and black models with two new color options. Leaked renders shared by Android Headlines show the Pixel 10 Pro Fold in a light green “Jade” and a silvery blue “Moonstone” — with no black or white option at all. Since the launch of Google’s firs"
    ],
    "image_url": "",
    "titles": [
      "The Pixel 10 Pro Fold might make blue the new black"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides some awareness about a potential new trend in smartphone color choices, but it lacks depth or insight. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/2191/2065863328_3c91d21a9e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0acc1527-a093-43a3-aadc-482180b9bdbf/thumb/",
      "alt": "Pixel Art - Sky TV",
      "credit": "Sabrina Eras / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Inquiry on Musk's Rivals, Taboos via AI: Panda Amuses, Anime Concerns",
    "domain": "business",
    "location": "global",
    "published": "2025-07-23T15:53:19Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "I asked Grok's AI companions about Elon Musk's rivals and general taboos. I found the red panda hilarious &mdash; and the anime girl worrying."
    ],
    "image_url": "https://i.insider.com/687f905685e81483682e6c56?format=jpeg",
    "titles": [
      "I used Grok's AI companions for a week. I found the red panda hilarious &mdash; and the anime girl worrying"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.387,
    "summary": "An inquiry was made to Grok's AI companions regarding Elon Musk's competitors and societal taboos. The red panda was found amusing, while the anime girl raised concerns. The outcome or current status of this story is unclear.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "The story is largely sensational, focusing on amusing and concerning aspects of AI companions. It lacks depth and doesn't provide any actionable insights or clarity around systems, causes, trends, or impacts. It also doesn't report on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/7361/12084487246_6767e4ac5e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3f7e01ac-7f07-46ae-bf31-e12f3b1f8f33/thumb/",
      "alt": "Finance Committee: Finance Wales inquiry - focus group / Y Pwyllgor Cyllid: Ymchwiliad Gyllid Cymru - grŵp ffocws",
      "credit": "National Assembly For Wales / Cynulliad Cymru / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Faster Qi2 charging is coming to iPhones and &#8216;major&#8217; Android phones",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T11:43:37-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The Wireless Power Consortium (WPC) has announced the official launch of faster Qi2 25W wireless charging, with the first devices already certified and “several hundred” yet to come. Most excitingly, it promises that alongside iPhone support, several “major Android smartphones” will finally be adopt"
    ],
    "image_url": "",
    "titles": [
      "Faster Qi2 charging is coming to iPhones and &#8216;major&#8217; Android phones"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.359,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "image": {
      "src": "https://live.staticflickr.com/7062/6941907057_4cb3c8609e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f6ee4dbc-011a-4286-918d-a49ee075c228/thumb/",
      "alt": "NASA Finds Thickest Parts of Arctic Ice Cap Melting Faster",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]