[
  {
    "title": "Anisimova Beats No. 1 Sabalenka, Reaches First Grand Slam Final at Wimbledon",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 10 Jul 2025 15:55:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Amanda Anisimova deals out more Grand Slam heartbreak to Aryna Sabalenka as she books her place in the Wimbledon final.",
      "Amanda Anisimova upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon on Thursday to reach the first Grand Slam final of her career.",
      "Anisimova is looking to become America's first singles champion in London since Serena Williams in 2016",
      "<p>Amanda Anisimova upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon on Thursday to reach the first Grand Slam final of her career a little more than a year after taking a break from tennis because of burnout.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3a3a/live/fb2bd300-5d9c-11f0-a644-0dca43fa2326.jpg",
    "titles": [
      "Anisimova stuns Sabalenka to reach Wimbledon final",
      "American Anisimova stuns top-ranked Sabalenka",
      "Wimbledon 2025 results: Amanda Anisimova upsets No. 1 Aryna Sabalenka to reach first Grand Slam final",
      "Anisimova upsets No. 1 Sabalenka at Wimbledon, reaches first Grand Slam final"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.996,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.835,
    "summary": "Amanda Anisimova defeated No. 1-ranked Aryna Sabalenka with scores of 6-4, 4-6, 6-4 at Wimbledon, securing her spot in her first Grand Slam final. This victory comes after Anisimova took a break from tennis due to burnout. She now aims to be the first American singles champion in London since Serena Williams in 2016.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a major event in the sports world, giving the reader a deeper understanding of the current tennis landscape. However, it does not report on solutions, improvements, or innovations, nor does it increase clarity around systems or trends."
  },
  {
    "title": "Ferrero Buys WK Kellogg for $3.1 Billion in Major Food Industry Deal",
    "domain": "general",
    "location": "national",
    "published": "Thu, 10 Jul 2025 11:07:15 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Italian candy giant Ferrero offered the American breakfast company a $3.1 billion deal too sweet to pass up.",
      "The standalone cereal business WK Kellogg began trading in 2023.",
      "Italian confectioner Ferrero, known for brands like Nutella and Kinder, is buying the century-old U.S. cereal company WK Kellogg in a deal valued at approximately $3.1 billion. The Ferrero Group said Thursday it will pay $23 for each Kellogg share. The transaction includes the manufacturing, marketi"
    ],
    "image_url": "",
    "titles": [
      "Nutella-maker Ferrero to gobble up cereal giant Kellogg for $3.1 billion",
      "Ferrero to buy cereal maker WK Kellogg for $3.1 billion; Kellogg shares jump 30%",
      "Nutella maker Ferrero plans to buy century-old cereal maker WK Kellogg for $3.1 billion"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.98,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.8,
    "summary": "Italian confectionery company Ferrero is acquiring the U.S. cereal company WK Kellogg for approximately $3.1 billion. Ferrero, known for Nutella and Kinder, will pay $23 per Kellogg share. This deal encompasses the manufacturing and marketing aspects of Kellogg's business. WK Kellogg began standalone trading in 2023, marking a significant transition in its century-old history.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant event in the food industry, giving the reader a deeper understanding of the business landscape. However, it does not report on solutions, improvements, or innovations, nor does it increase clarity around systems or trends."
  },
  {
    "title": "Trump Accuses Brazil of Targeting US Tech, Bolsonaro",
    "domain": "general",
    "location": "national",
    "published": "Thu, 10 Jul 2025 01:42:08 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CityNews",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE54cE5ERkktNHU0UEhTbW5qNnllZHl6dkpIa192R05iZmZ4MVlQbzFJU0M1QVZzMXowODJwa1BKWlF3NWY5VVpNQ3lYUk14N19WOEdCZUVaTnU0eEFheXgwejVXdEZtc2RfcFVPZEUwWHY5Zw?oc=5\" target=\"_blank\">Trump announces 50% tariff on copper from Aug. 1</a>&nbsp;&nbsp;<font col",
      "Trump wrote on Truth Social that he made the decision after receiving a national security assessment.",
      "<p>Latest threats heighten fears that the president’s erratic trade strategy risks exacerbating inflation across the US</p><p>Donald Trump announced on Wednesday that his administration will hit Brazil with a 50% tariff on products sent to the US, tying the move to what he called the “witch-hunt” tr",
      "U.S. President Donald Trump said he plans to impose the 50 per cent on copper imports on August 1 in hopes of boosting U.S. production of the crucial metal. Trump announced the tariff Wednesday on his Truth Social platform and noted that copper is needed for semiconductors, aircraft and batteries an"
    ],
    "image_url": "",
    "titles": [
      "Trump announces 50% tariff on copper from Aug. 1 - Axios",
      "Trump says 50% tariff on copper imports will begin Aug. 1",
      "Trump announces 50% tariff on Brazil, citing a ‘witch-hunt’ against Bolsonaro",
      "Trump says 50 per cent tariff on copper imports to come into effect August 1"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.741,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary": "Former US President Donald Trump has accused Brazil of initiating \"attacks\" on American technology companies and of launching a \"witch hunt\" against Brazil's ex-president, Jair Bolsonaro. These accusations come amid concerns that Trump's unpredictable trade policies may worsen inflation in the United States.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the accusations made by former President Trump against Brazil and the potential implications for US inflation. However, it lacks depth or insight into the specifics of these 'attacks' on US technology companies, or why Trump believes there is a 'witch hunt' against Bolsonaro. It also doesn't offer actionable insights or a clear understanding of the systems at play."
  },
  {
    "title": "Tottenham in Talks for £60M Gibbs-White Transfer from Nottingham Forest",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 10 Jul 2025 15:21:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Tottenham open talks with Nottingham Forest over a possible £60m move for Morgan Gibbs-White.",
      "Tottenham open talks with Nottingham Forest over a possible £60m move for Morgan Gibbs-White.",
      "Tottenham are in talks with Nottingham Forest over a potential transfer for Morgan Gibbs-White."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7bc6/live/6e8b3c40-5d9e-11f0-a3d8-41c5cb0931cc.jpg",
    "titles": [
      "Spurs in talks to sign £60m Forest midfielder Gibbs-White",
      "Spurs in talks to sign £60m Forest midfielder Gibbs-White",
      "Spurs in talks over Forest's Gibbs-White"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.985,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary": "Tottenham Hotspur is currently engaged in discussions with Nottingham Forest regarding a potential transfer deal for Morgan Gibbs-White. The proposed move is valued at £60 million. The negotiations are ongoing, and both clubs are actively involved in the talks. As of now, the outcome of the discussions and whether the transfer will be finalized remain uncertain.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing negotiations between Tottenham Hotspur and Nottingham Forest. However, it offers minimal depth or insight into the potential impacts of the transfer, the player's career, or the strategic implications for the teams involved."
  },
  {
    "title": "Teen Charged in Ontario Girl's Injury, Initially Thought Animal Attack",
    "domain": "general",
    "location": "local",
    "published": "Wed, 09 Jul 2025 20:03:23 EDT",
    "source": "CBC",
    "sources": [
      "CBC",
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<img alt=\"Road sign that says &quot;Quadeville&quot; with an SUV in the background.\" height=\"349\" src=\"https://i.cbc.ca/1.7570067.1750809643!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/quadeville-sign.jpeg\" title=\"Ontario Provincial Police are warning residents of Quadeville, Ont., to k",
      "While early evidence suggested a possible animal attack, recent testing of samples taken from the victim's wounds revealed no traces of animal DNA, the OPP said.",
      "Police are now laying charges against a teenager in connection with a case that officials previously believed may have been an animal attack on a young girl in the rural Ottawa Valley. Maya, 8, from Quadeville, Ont., a small area northwest of Calabogie, was found June 24 suffering from serious, life"
    ],
    "image_url": "",
    "titles": [
      "Teen charged with attempted murder in attack on girl in Quadeville, Ont.",
      "Youth charged with attempted murder of girl at Quadeville",
      "Teen charged with attempted murder, assault in Quadeville ‘attack’ on child"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.716,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.75,
    "summary": "Ontario Provincial Police (OPP) have charged a teenager following an incident in Quadeville, Ont., where Maya, an 8-year-old girl, was found with serious injuries on June 24. Initially thought to be an animal attack, further investigation and testing found no animal DNA in the victim's wounds, leading to the reclassification of the case and subsequent charges against the teenager.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a crime incident and the subsequent charges, but it lacks depth or insight into the broader context. It does not provide actionable insights, report on solutions, or increase understanding of larger trends or systems."
  },
  {
    "title": "Djokovic Cancels Practice After Fall Before Wimbledon Semifinals",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 11:55:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Novak Djokovic canceled his afternoon practice session at Wimbledon on Thursday, a day after the seven-time champion had a \"nasty\" fall moments before clinching his quarterfinal victory.",
      "Novak Djokovic canceled his afternoon practice session at Wimbledon on Thursday, a day after the seven-time champion had a “nasty” fall moments before clinching his quarterfinal victory.  The 38-year-old Djokovic, who faces No. 1 Jannik Sinner in the semifinals on Friday, slid and fell on his second"
    ],
    "image_url": "",
    "titles": [
      "Djokovic skips practice ahead of Sinner showdown",
      "Djokovic cancels his Wimbledon practice session ahead of semifinal match against Sinner"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.702,
    "summary": "Novak Djokovic, the seven-time Wimbledon champion, canceled his Thursday afternoon practice session due to a \"nasty\" fall he experienced just before winning his quarterfinal match. The 38-year-old tennis star, set to face No. 1 Jannik Sinner in the semifinals on Friday, took the precautionary measure following the incident that occurred during his last game.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about Djokovic's decision to cancel his practice session due to a fall. It provides useful context about the upcoming Wimbledon semifinals and the potential impact on Djokovic's performance. However, it doesn't offer any solutions or progress related to the player's recovery or future precautions."
  },
  {
    "title": "Charley Hull Withdraws from Evian Championship Due to Illness",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 15:29:47 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "EVIAN-LES-BAINS, France (AP) — English golfer Charley Hull withdrew from the first round of the Evian Championship on Thursday after collapsing to the ground twice because of a virus, organizers said.  French organizers said Hull felt unwell on the fourth tee and received medical attention after col",
      "England's Charley Hull is treated with an IV drip after collapsing midway through the opening round of the Evian Championship in France.",
      "<p>English golfer Charley Hull withdrew from the first round of the Evian Championship on Thursday after collapsing to the ground twice because of a virus, organizers said.</p>"
    ],
    "image_url": "",
    "titles": [
      "English golfer Charley Hull withdraws from Evian Championship with illness after collapsing",
      "Hull quits Evian Championship after collapsing",
      "England’s Charley Hull withdraws from Evian Championship after collapsing"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.987,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary": "English golfer Charley Hull withdrew from the Evian Championship's first round due to collapsing twice from a virus. Hull felt unwell on the fourth tee and received medical attention. She was treated with an IV drip. The outcome is that Hull had to withdraw from the tournament due to her health condition.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about Charley Hull's withdrawal from the Evian Championship due to illness. It provides useful information about the incident, the medical attention she received, and the direct impact on her participation in the tournament. However, it doesn't report on any solutions, improvements, or attempts to address her health condition or prevent similar incidents in the future."
  }
]