[
  {
    "title": "Pope Leo XIV visits Turkey to meet leaders and talk about peace",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 07:46:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "First American pope will arrive in the Turkish capital Ankara where he will meet President Erdogan.",
      "The pontiff has arrived in Ankara, where he is to meet Turkey's President Recep Tayyip Erdogan. After three days in Turkey, the pontiff will head to Lebanon, where the trip is seen as an opportunity to promote unity.",
      "Pope Leo flies to Turkey on closely watched first overseas trip Reuters",
      "Vatican says ‘demanding’ six-day mission will be packed with meetings with political and religious leaders Pope Leo will make his debut overseas trip as leader of the Catholic church on Thursday, travelling on a six-day mission of peace and unity to Turkey and Lebanon in what the Vatican said was ex",
      "Under glare of world’s media, Pope Leo XIV to visit Turkey and Lebanon on first foreign trip AP News"
    ],
    "image_url": "",
    "titles": [
      "Pope Leo heads to Turkiye, Lebanon in first foreign trip as Catholic leader",
      "Pope Leo XIV begins first trip abroad to Turkey, Lebanon",
      "Pope Leo flies to Turkey on closely watched first overseas trip - Reuters",
      "Pope Leo to visit Turkey and Lebanon on first overseas trip as pontiff",
      "Under glare of world’s media, Pope Leo XIV to visit Turkey and Lebanon on first foreign trip - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/pope-leo-heads-to-turkiye-lebanon-in-first-foreign-trip-as-catholic?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/pope-leo-xiv-begins-first-trip-abroad-to-turkey-lebanon/a-74915414?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxObWpVcnc0YklKX1JVZXNXaHZjUzJMbGo0TXpBQXV1cnV3Tm1WbDNhVEw0Q3ptX1hBS2NVUEtJN2dlRlEyRl9LdmE5VldEeE93OXhDSm1JYjA1RTRYbmFjakNJVXRRbjdDYlhhNTcxZmxaUFZOVlpmWi1JUlE5RkNmLUJPTHdCVjJlejV0UXQxTmRab0tDakp6ZGhqN0pDMTEzeDgxVUxvU0RCVmZCbElGRnZpUQ?oc=5",
      "https://www.theguardian.com/world/2025/nov/27/pope-leo-to-visit-turkey-and-lebanon-on-first-overseas-trip-as-pontiff",
      "https://news.google.com/rss/articles/CBMilwFBVV95cUxOWEFwU2FDVnJMQlVoUmRzVEpaRTRwZjR1QVpmTnQyUVBjNlhTTjFjbS1Tel9UdWxXWVRhLUVVdFNjajEybnVPX05HQUVGcDhsajl6bHZncnI5TWhRSEFPTTRiZjJDNk5Ua3haTEcteWs1Znk5eFdpaDZ4azh5TzlITnFYUlZkWDFiVmg3NmtwRDF3MG5jWXdB?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/pope-leo-heads-to-turkiye-lebanon-in-first-foreign-trip-as-catholic?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.951,
      "consensus": 0.975,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.884,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pope Leo XIV has arrived in Ankara, Turkey, for his first overseas trip as leader of the Catholic Church. He will meet with President Recep Tayyip Erdogan and other political and religious leaders during a six-day visit aimed at promoting peace and unity. After three days in Turkey, the Pope will continue his trip to Lebanon. The visit is closely watched by international media.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the Pope's visit to Turkey and his diplomatic efforts. It gives a clear understanding of the Pope's mission and the political and religious context of his visit. However, it does not report on specific solutions or progress.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Georgia Judge Dismisses 2020 Election Case Against Trump and Allies",
    "domain": "politics",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Wed, 26 Nov 2025 11:17:02 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "BBC",
      "Axios",
      "ABC News",
      "CNBC",
      "Reuters",
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "dw.com",
      "bbc.com",
      "news.google.com",
      "abcnews.go.com",
      "cnbc.com",
      "cbc.ca"
    ],
    "snippets": [
      "The historic Georgia election interference case against President Trump and allies for their efforts to overturn the 2020 election is no more.",
      "A Georgia court has thrown out the lengthy election case, with the prosecution saying that pursuing it would not be viable. With it, the only remaining legal challenge over Trump's post-2020 election behavior falls away.",
      "The state charges were the last remaining criminal case against the US president stemming from the 2020 election.",
      "Georgia ends Trump election-interference prosecution Axios",
      "Georgia's citizens are \"not served by pursuing this case,\" the prosecutor said.",
      "Fulton County Superior Court Judge Scott McAfee's ruling ends the final case against Trump that remained unresolved after he returned to the White House.",
      "Trump wins dismissal of Georgia 2020 election interference case Reuters",
      "A judge on Wednesday dismissed the Georgia election interference case against U.S. President Donald Trump and others after the prosecutor who took over the case said he would not pursue the charges, ending the last effort to prosecute Trump for his efforts to overturn his 2020 election loss.",
      "Georgia case against Trump dropped, ending efforts to punish president over 2020 election aftermath AP News"
    ],
    "image_url": "",
    "titles": [
      "The Georgia election interference case against Trump and others has been dropped",
      "Georgia judge dismisses Trump election interference case",
      "Georgia judge dismisses 2020 election interference case against Trump",
      "Georgia ends Trump election-interference prosecution - Axios",
      "WATCH:  Georgia prosecutor drops election interference case against President Trump",
      "Judge dismisses Trump election interference racketeering case in Georgia",
      "Trump wins dismissal of Georgia 2020 election interference case - Reuters",
      "New prosecutor won't pursue charges against Trump in Georgia election interference case",
      "Georgia case against Trump dropped, ending efforts to punish president over 2020 election aftermath - AP News"
    ],
    "url": "https://www.npr.org/2025/11/26/nx-s1-5611431/georgia-trump-election-case-dismissed",
    "alternate_urls": [
      "https://www.dw.com/en/georgia-judge-dismisses-trump-election-interference-case/a-74912907?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/czxpd8pv4gyo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMifkFVX3lxTE8yM2JZQ085X2lsNDJSMTluajgtMDRoOTZFUDZMOUZsZVNyUHpGNVdEcmV0SmZINWJ5S1BCbFYtMXdtM1ZPUERqN0V5VER4TWpDZWtxVUtQVV9rRGF5UmMzcWdSOTFteG90WVJEVThjSnYyUmJ1WU1TQXpOYmZIQQ?oc=5",
      "https://abcnews.go.com/US/video/georgia-prosecutor-drops-election-interference-case-president-trump-127896338",
      "https://www.cnbc.com/2025/11/26/trump-georgia-election-case-dismissed-2020.html",
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxNZGlia0dlUFBoVWtSR2ViXzJtT25vbkdib2JlT0NHUHhXcGZJQnhKTVhRTmRVbzlrTjU3WXpaaTZONHZNTUowbm9UN3lfX2ljQTJSVzRxcEh3S2tYaVRKSHJ6YVByTUxsUWdybkFTNUgwZXpXV25KcEM4YUpISWRwc2RWSDZBQlFJMWhGaVJ5c0Y3WThkR1dnVlZoZFl2MTFlNkNrQ0N3dnY3QkRVRkFURVZ0elgzYUdJcDZjYzNobw?oc=5",
      "https://www.cbc.ca/news/world/trump-georgia-election-charges-dropped-9.6993093?cmp=rss",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNd0tGUFJiZi1qU1lrOGFCSEZTdTNNSzlkalR4WEF2Q0E3ejViUWQyNlY2TlVkRjF6bEtxMTlhVUZKQ2JTVFJLMG9CWFpiYl9ZWUs1VGstYWZXZXJDOElkWTN0bkJJbDdzUzFNOGtxaVd2Um03Rm42TVNOWFkwX3o2MVlySDhrTm5BcFhiblJMX2pCUjRtbUdqNDdzdlVLbVNiblRrUlVIR0g?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/26/nx-s1-5611431/georgia-trump-election-case-dismissed",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.689,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.873,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A Georgia judge has dismissed the state’s 2020 election interference case against President Donald Trump and his allies, following a request from the new prosecutor, Peter Skandalakis, who said pursuing the charges was not in the public interest. This decision ends the last remaining criminal case against Trump related to the 2020 election and closes all legal challenges over his post-election actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the legal proceedings related to the 2020 election, and the decision of the Georgia judge. However, it doesn't offer insights into the broader implications or context of this decision, or how it might impact future elections or the political climate.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hong Kong Apartment Fire Kills 36, Hundreds Missing in Tai Po Blaze",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 07:05:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters",
      "Washington Post",
      "The Guardian",
      "New York Times",
      "Bloomberg",
      "Financial Post",
      "NPR",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com",
      "washingtonpost.com",
      "theguardian.com",
      "nytimes.com",
      "financialpost.com",
      "npr.org"
    ],
    "snippets": [
      "Rescue efforts continue as Hong Kong fire devastates a residential complex, leaving 55 dead and hundreds displaced.",
      "Firefighters have been trying for hours to douse fires at a residential building complex in the Tai Po district, with at least 36 people killed and dozens still unaccounted for.",
      "Death toll rises to 36 in Hong Kong residential block fire Reuters",
      "Hong Kong Chief Executive John Lee ordered inspections of all Hong Kong public housing undergoing significant renovations in light of the devastating fires.",
      "Three construction industry employees arrested after police allege unsafe scaffolding materials may have been behind fire’s rapid spread Hong Kong fire – latest updates How the fire unfolded – visual guide Hong Kong police have alleged unsafe scaffolding and foam materials used during maintenance wo",
      "Firefighters were still trying to fully extinguish the blaze, a day after it engulfed several towers in the complex. Many people were still trapped in the buildings.",
      "Death Toll Rises to 55 in Hong Kong Housing Complex Fire Bloomberg.com",
      "HONG KONG (AP) — The death toll from a massive fire that broke out at a residential apartment complex in Hong Kong has risen to 55, as firefighters continued to battle the blaze, among the deadliest in the city’s modern history. Hong Kong authorities said Thursday 51 people had been found dead on th",
      "Hong Kong leader John Lee has said 36 people were reported killed in the fire that spread through a dense high-rise residential housing complex Wednesday. He said another 279 people were reported missing.",
      "3 arrested in Hong Kong, as a high-rise fire leaves at least 44 dead and 279 reported missing AP News"
    ],
    "image_url": "",
    "titles": [
      "Hong Kong blaze death toll reaches 55 as rescue operations continue",
      "Hong Kong fire: Death toll rises as blaze engulfs high-rise",
      "Death toll rises to 36 in Hong Kong residential block fire - Reuters",
      "Death toll in Hong Kong high-rise fire grows to 55",
      "Hong Kong fire: police blame construction firm’s ‘gross negligence’ as death toll rises to 55",
      "Live Updates: Death Toll From Hong Kong Apartment Fire Rises to 55",
      "Death Toll Rises to 55 in Hong Kong Housing Complex Fire - Bloomberg.com",
      "Hong Kong fire death toll rises to 55 as towers burn for a second day",
      "Death toll in Hong Kong high-rise fire rises to 44, with 279 reported missing",
      "3 arrested in Hong Kong, as a high-rise fire leaves at least 44 dead and 279 reported missing - AP News"
    ],
    "url": "https://www.aljazeera.com/gallery/2025/11/27/hong-kong-blaze-death-toll-reaches-45-as-rescue-operations-continue?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/hong-kong-fire-death-toll-rises-as-blaze-engulfs-high-rise/a-74902659?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxPX3lQMmd4NHNyalNDeUFTQVdKUWg0WlJFWTJfd19HSk9PcnA3anhVaDZYS2RtbmdUS3VoU2h3Q3o3bnNXc0R4QVhmdmctQk1uLXRyMloxWG1XOTRQTzhEWTBEZ0pIME5fV0dUVVgxeHJRRklOM0xzY2ozSVVvRzJjOW9ZTXBGckFkWWhFRDRsN3lUY254cE5lSjBqZkw1SUhHSUE?oc=5",
      "https://www.washingtonpost.com/world/2025/11/27/hong-kong-apartment-fire-death-toll/",
      "https://www.theguardian.com/news/2025/nov/27/hong-kong-fire-tai-po-police-blame-construction-company",
      "https://www.nytimes.com/live/2025/11/27/world/hong-kong-fire",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNZkdqMzVIRktzOEhGOXZ2MGpaVHUteXlaUWtLRUFMbUVyaUhTVUhmQUJKRzBWUTlqSUgzY2lVY1VHbkk4SEh3X3o2Tm1OeUl2Uy1Ib0dqVjYyYmJQbjNZUlFQNEM2Y1hhQ3pJNFREUXpkZWp1YjB6Tm0wQTdtSzhGNDQxb0tmSFFSOHhnRDZ2Y19lT3RmOG1jaHdhN1c3SjAtejUyQTN3TnNtWFplUVFtS1M1X0M?oc=5",
      "https://financialpost.com/pmn/fire-that-killed-at-least-44-burns-in-hong-kong-towers-for-a-second-day",
      "https://www.npr.org/2025/11/26/nx-s1-5621800/13-people-killed-in-fire-engulfing-hong-kong-high-rise-residential-buildings-fire-services-say",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxOYjYtbmUwN0lJUDBDT3Y4QXJMWjEzb3pJZGNvbEZ4MmtiZ3UwYTloeEVoblFsYzVmMjdWd3VhWW4zMGtndHNwRm1OUm9FZG1OSHk1TWozeUZubmxHeVJyQmdvaW9DWDQxV09wTlFiU2ZYbUszTHN0WjFueTlFbUJCY0pTSDJoZ2lqd0gzQnVRbzFTazh0?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/gallery/2025/11/27/hong-kong-blaze-death-toll-reaches-45-as-rescue-operations-continue?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.937,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A massive fire broke out on Wednesday at the Wang Fuk Court residential complex in Hong Kong's Tai Po district, killing at least 36 people. The blaze spread rapidly, possibly due to bamboo scaffolding, and firefighters worked for hours to bring it under control. As of the latest reports, 279 people remain missing, and authorities are investigating the cause of the fire.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "National Guard soldiers hurt in shooting near White House",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 20:59:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Deutsche Welle",
      "Axios",
      "The Guardian",
      "Associated Press",
      "ABC News",
      "Reuters",
      "Globe and Mail"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "dw.com",
      "news.google.com",
      "theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "These were the updates on the Washington, DC, shooting for Wednesday, November 26.",
      "President Trump said the suspected shooter came to the U.S. from Afghanistan in 2021. The administration plans to send 500 more Guard personnel to the nation's capital in response to the attack.",
      "A suspect was arrested as two soldiers were in a critical condition after they were shot near the White House in Washington DC. US President Donald Trump called the shooting an \"act of terror.\"",
      "What to know about shooting of 2 National Guard members in D.C. Axios",
      "Suspect in custody after two West Virginia guard members shot in ‘targeted’ incident, Washington mayor says US politics live – latest updates Two West Virginia national guardsmen shot near the White House remained in critical condition on Wednesday in an attack that rattled the country’s capital. Th",
      "What we do and don’t know about the shooting of 2 National Guard members in DC AP News",
      "2 National Guard members shot in an ambush attack just blocks from the White House AP News",
      "One suspect is in custody, police said.",
      "National Guard soldiers shot in 'targeted' attack near White House Reuters",
      "Amid a frenetic scene, some residents said Trump’s militarization of the capital had much to answer for The scene around Washington’s Farragut Square on Wednesday afternoon seem to fit Donald Trump’s most lurid stereotypes of a crime-ridden capital in need of federal troops to bring a firm smack of",
      "Two national guardsmen in critical condition after apparent targeted shooting near White House The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Washington DC shooting updates: 2 National Guard members critically wounded",
      "2 National Guard members in critical condition after 'targeted' attack in D.C., authorities say",
      "US: Two National Guard members shot in Washington DC",
      "What to know about shooting of 2 National Guard members in D.C. - Axios",
      "Two national guard members in critical condition after Washington DC shooting",
      "What we do and don’t know about the shooting of 2 National Guard members in DC - AP News",
      "2 National Guard members shot in an ambush attack just blocks from the White House - AP News",
      "WATCH:  2 National Guardsmen shot near White House, officials say",
      "National Guard soldiers shot in 'targeted' attack near White House - Reuters",
      "Shock and dismay after national guard troops shot near White House",
      "Two national guardsmen in critical condition after apparent targeted shooting near White House - The Globe and Mail"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2025/11/26/live-two-us-national-guard-members-shot-killed-near-white-house?traffic_source=rss",
    "alternate_urls": [
      "https://www.npr.org/2025/11/26/nx-s1-5622038/national-guard-shooting-washington-dc",
      "https://www.dw.com/en/us-two-national-guard-members-shot-in-washington-dc/a-74913502?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTFBjY2E3eFc0ZEpfQmZFQWd3VDdFeGxPeV9OZS1mWWlfRWJ4dU9lczNZd1kyWGtoRlQ4MkpaMk9UWGdBZm1HdGZodk40ekRWNzhYZzJfeTVDWGNDX214aWVoWWxseWk2VFVSdWRhbDRlRVVsaFd0SXVnREtyZw?oc=5",
      "https://www.theguardian.com/us-news/2025/nov/26/national-guard-soldiers-shot-washington-dc",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNc0ViMFcxRThQbVBoZnJ3VEJRTVFKUjJhdmNEY0hwUWpoTGhBaGF3VHBXMkItOVhqQnRvaThYbEY4d0RpWlhlVFNEZWw2Wm5WSl9oaXZCWG5UaHBudUkzR3h4bXUtYk9jYUhHYWlaQmViN1I0RTdrNXB6TWlfVTJmT0phQ1NYS3VYeEdlbjJIMXNxU1pqWmtESWZvX3hkcmRNZkhwdg?oc=5",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMktMa2xlQnh5YWU5aEVCVnBJTVBhTUowcm0tQ2E1Zk44WDF2QVNxellIY2Y0amxrM0E3LVlOTUVHSnVidC1FVzM4cmg2dU1GTExnZU9LaE4zR1NSV1c2YmNma2hyRUk2enZRektfdmhSZUdMWEtWZmtSLV95OFowdWs2bnpVV0tMa1E3XzE0Zw?oc=5",
      "https://abcnews.go.com/US/video/2-national-guardsmen-shot-white-house-officials-127909311",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNT2VEM2hjNGtmTndKZmtrUUFUeTJxZTJtenBId1puM3J1R1E2RlN5cE9mZXdfY1FGQkhJeHJZUlNiUWdOYlp1OF9NMFhMUmx2dWc2SmZoX1hxd2IyMmVlc0stVXlyQzlEZ1d4R3ZOMlMycDc4UXhCVlBFWm5sazY4TU0xUkJkcVRwb1VmMnppTXIxSkJHdXhXTlk4WlRZRWs1S1lEWQ?oc=5",
      "https://www.theguardian.com/us-news/2025/nov/26/white-house-washington-national-guard",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxPNGVjRFBmeEVjckkzd0VfdHQ5VVBnWFNjQ0trYjF1YTlvc0VzMGU0SXJVSktfMUdZUFM5d1kyUEJITjlpSmJtVUVVSGxacVNsZlFFYU83cFdxR3k5enBGbEE1MVl1MXRUZVpFZGVKNW94ZlJlU0NHVFdiWGcweGJsRl9lTlpCMVhtZWZxdm4xUDYzWGEtd1VNWWgzVk4xVWlh?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2025/11/26/live-two-us-national-guard-members-shot-killed-near-white-house?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.76,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.832,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A shooting near the White House resulted in injuries to National Guard soldiers, according to police. One suspect has been taken into custody. In response, former President Trump has called for an additional 500 National Guard members to be deployed in Washington, D.C. Authorities describe the incident as a \"targeted\" attack. The situation is under investigation.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an incident but does not provide any actionable insights or deeper understanding. It does not report on solutions, improvements, or attempts to solve problems, and it does not increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "National Guard soldiers hurt in shooting near White House",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 08:22:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "abcnews.go.com",
      "theguardian.com"
    ],
    "snippets": [
      "The alleged gunman in the Washington shooting is an Afghan national who entered the US in September 2021.",
      "Trump admin cracks down on Afghan immigrants after National Guard shooting Axios",
      "Trump: National Guard shooting an \"act of terror\" by Afghan \"flown in by the Biden admin\" Axios",
      "Trump wants another 500 National Guard in D.C. after shooting near White House Axios",
      "Two National Guardsmen were in critical condition after being shot near the White House.",
      "President calls the shooting in Washington an ‘act of terror’, as officials name Rahmanullah Lakanwal as suspected shooter Donald Trump has called for his government to re-examine every Afghan immigrant who entered the US during Joe Biden’s administration, after law enforcement officials identified"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d509/live/9022caa0-cb65-11f0-a892-01d657345866.jpg",
    "titles": [
      "US suspends immigration requests for Afghans after National Guard shooting",
      "Trump admin cracks down on Afghan immigrants after National Guard shooting - Axios",
      "Trump: National Guard shooting an \"act of terror\" by Afghan \"flown in by the Biden admin\" - Axios",
      "Trump wants another 500 National Guard in D.C. after shooting near White House - Axios",
      "National Guard shooting 'act of evil,' Trump says; suspect ID'd as Afghan national",
      "National Guard shooting: Trump says US should ‘re-examine’ all Afghan refugees after suspect named"
    ],
    "url": "https://www.bbc.com/news/articles/cgex957qg97o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMijAFBVV95cUxPRXZIbXI3QkVIVU5oTTIzTmFJQXdldWJ2U2lLN0RLNF9zeDVLb1QyLTFpTXRFdUgwazVrSGRDQURITkZJNGRrbmNrZTJNQVZQV3hUanl2bGZsV1N2RXZmQ3RqaVVLcHFTeUctT1pXSkJVZk84UXR1WFVadTA4OVk3ejdGZXFLSVloVVNNUg?oc=5",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxPcS1DYVFlQUFRa19ZZGdwUkJaVExVVXNkRVpKTlZlc2Yxa2hpbGxrNDdSck9qM2NUOHpfWUhXVms3andvLTRsNnlvRUxLcTl5UzlLbWxvcWxYWWtHYTd6SmdzU2FybV9VQUY0akp1VXRaYlAwTlZyMXlFbjU4Z19hSV81WUU3SURCRDQ3ajdwZDVtaEU?oc=5",
      "https://news.google.com/rss/articles/CBMidkFVX3lxTE5kR1VucVhOZF9FdG9MMEQ5ZUF6ZXBlTXJTYWpsanJUczA2RWF0dUd2QTJSNlR1Q0hWYUxNb3VvTDVoWVppeW83c2VIeDFKcG5sN2ozazJKT3RtWklVQng0dFNxdVpNVXpJaUlONVFlUkp0MkJ6MGc?oc=5",
      "https://abcnews.go.com/Politics/2-military-personnel-appearing-national-guard-shot-white/story?id=127905871",
      "https://www.theguardian.com/us-news/2025/nov/26/washington-national-guard-shooting-suspect"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cgex957qg97o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.963,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A shooting near the White House resulted in injuries to National Guard soldiers, according to police. One suspect has been taken into custody. In response, former President Trump has called for an additional 500 National Guard members to be deployed in Washington, D.C. Authorities describe the incident as a \"targeted\" attack. The situation is under investigation.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an incident but does not provide any actionable insights or deeper understanding. It does not report on solutions, improvements, or attempts to solve problems, and it does not increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "England cricket team trains more after losing first Ashes match to",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 06:22:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "England add training sessions to their schedule in Brisbane following their hammering by Australia in the first Ashes Test.",
      "McCullum books extra time in nets before second Test Australian captain Cummins may return from injury A week of inactivity for England’s cricketers will end on Saturday following confirmation of additional training sessions having been scheduled in the wake of their howling eight-wicket defeat to A",
      "England have booked extra training sessions in Brisbane ahead of the second Ashes Test as they look to rebound from their two-day drubbing in the series opener at Perth."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/263f/live/93a85ad0-cb58-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "England plan extra training before second Test",
      "England plan extra training sessions in wake of howling first Ashes Test defeat",
      "England plan extra training before day-night second Ashes Test"
    ],
    "url": "https://www.bbc.com/sport/cricket/articles/cdxe945919po?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/sport/2025/nov/27/england-plan-extra-training-sessions-in-wake-of-howling-first-ashes-test-defeat-cricket",
      "https://www.skysports.com/cricket/news/12040/13476007/the-ashes-england-plan-extra-training-ahead-of-second-ashes-test-in-brisbane-after-two-day-hammering-in-perth"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/cricket/articles/cdxe945919po?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.924,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England have scheduled additional training sessions in Brisbane after losing the first Ashes Test to Australia by eight wickets in Perth. The team aims to prepare for the second Test, with coach Brendon McCullum arranging extra net practice. Australia's captain Pat Cummins may return from injury for the upcoming match.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the England cricket team's response to their loss in the first Ashes match. However, it does not provide deeper insights or understanding, nor does it report on specific solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Court says North Carolina can use new voting map for elections",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 06:25:11 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "N.C. can use Republican-drawn congressional map, judges rule Axios",
      "New map takes aim at state’s only swing seat and gives Republicans chance to flip seat as part of Trump campaign A federal three-judge panel on Wednesday allowed North Carolina to use a redrawn congressional map aimed at flipping a seat to Republicans as part of Donald Trump’s multi-state redistrict",
      "Judges allow North Carolina to use a map drawn in bid to give Republicans another US House seat AP News"
    ],
    "image_url": "",
    "titles": [
      "N.C. can use Republican-drawn congressional map, judges rule - Axios",
      "Judges allow North Carolina to use Republican-drawn congressional map",
      "Judges allow North Carolina to use a map drawn in bid to give Republicans another US House seat - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVVZrVGNuSGQ5bmVscXYwYVdOeGFROENwMEZuUXNlNzA1ZEh3Z0lIeWFydU4wYzhPVllFdnExRGFtQk5jeG1TTEo0bGl6MkpKSWowc0JrZTBlNVhhTEFRa2xtYnpLYzlUMUd1Z2xMdGtybDFLWmRKejBqUENyb0UwYThVMHBKS3RJc2pVeDVIQWFZa2tSYllob213?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/nov/26/north-carolina-congressional-map",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNNEg4a2trbUZ4elozT1UtVWlYX0RTTWZuWEU2XzhDblp3Z1Y4TTdJNHQxcUdoaXQ3VWVfQ3V6TTJ6LTl6YXlkSERWVWJudnB1c1AzWTNWbWlHYWR0QllTRFZPY1F1a2VNZHRyQ2xjbEY5cWxpSk9td0JURzJKamtTRlZWeFlBV0lycVMxZjBMTFVxTEhIZm04d2VoUlBrd3Rta3ZYVXQ4UFBidw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVVZrVGNuSGQ5bmVscXYwYVdOeGFROENwMEZuUXNlNzA1ZEh3Z0lIeWFydU4wYzhPVllFdnExRGFtQk5jeG1TTEo0bGl6MkpKSWowc0JrZTBlNVhhTEFRa2xtYnpLYzlUMUd1Z2xMdGtybDFLWmRKejBqUENyb0UwYThVMHBKS3RJc2pVeDVIQWFZa2tSYllob213?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal three-judge panel has approved North Carolina's use of a newly redrawn congressional map for upcoming elections. The map is designed to favor Republicans and could help them gain an additional U.S. House seat. This decision allows the map to be used despite challenges, impacting the balance of power in the state's congressional delegation.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about a significant decision that impacts the electoral process in North Carolina. It provides useful information about the potential consequences of this decision, but it doesn't delve into the underlying issues or potential solutions related to gerrymandering.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fire in Hong Kong apartment building kills 55 and many are still",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 05:00:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Firefighters struggle to reach residents potentially trapped on upper floors of burning housing complex.",
      "Hong Kong fire kills 55, hundreds missing as police cite ‘grossly negligent’ firm Reuters",
      "Hong Kong fire live: At least 55 are dead as blaze burns on after 24 hours Reuters",
      "Three men arrested as 26 rescue teams on site at Wang Fuk Court residential apartment complex in Tai Po district. Follow the latest updates live Report: death toll rises as hundreds reported missing What we know so far about the blaze Bamboo scaffolding may be to blame for spread of fire A visual gu"
    ],
    "image_url": "",
    "titles": [
      "Hong Kong fire live: Blaze kills at least 55, hundreds still missing",
      "Hong Kong fire kills 55, hundreds missing as police cite ‘grossly negligent’ firm - Reuters",
      "Hong Kong fire live: At least 55 are dead as blaze burns on after 24 hours - Reuters",
      "Hong Kong fire latest: rescue crews search for survivors after 55 killed and hundreds reported missing"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2025/11/27/hong-kong-high-rise-fire-live-blaze-kills-at-least-44-hundreds-missing?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNcngyRG5pdHlqOTlzQU5hQmNBNFBaam4zNWZUVHBhQURSbXg4ZHE5bHpkX3otT2h0d3ZWYUh0aVZYdzRfWFJCTUpTQ1I3VFlUVzRIX0ZHWng0OHZndjBBMy1sTE9ucUhDVjlPLUVFb1hRMk5mZXNEbXdkNERwSmpIc2VRZlF1OXlvM21DTlRfb0dMRzdHOXRiV1dWUVZpMmQyNWxzcQ?oc=5",
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxPN3hBdlBhUkF6djFYRUpROEZCS05vSDdoSnZFNHdrcmdJZTVVYmZxbmtUMDd5V0pldS14aFRjeVl6NDFscG1lUlV5TG1yS19UVVMtWm0tNTRkM1VuTFRnZ18xZmxPTFZBR05uMHF2cXljOVZLQWVUa2E0b0ExVFNiVzlCbDBWYjFSeFFMQUs0LVhGcGlvTkNfdUtmT1hGek1QZUp6SFJ2dGVyRjR5dFNKSzl1bW1jSWM4Y1FTMTBOckgxTjht?oc=5",
      "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2025/11/27/hong-kong-high-rise-fire-live-blaze-kills-at-least-44-hundreds-missing?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.897,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fire at the Wang Fuk Court residential complex in Hong Kong’s Tai Po district has killed at least 55 people, with hundreds still missing after 24 hours. Firefighters are struggling to reach residents trapped on upper floors. Police have arrested three men and described the managing firm as \"grossly negligent.\" Authorities suspect bamboo scaffolding contributed to the rapid spread of the blaze. Rescue efforts are ongoing.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a tragic event, but lacks depth or insight. It does not provide actionable insights or deeper understanding for the reader. It does not report on solutions, improvements, innovations, or attempts to solve problems. It does increase clarity around an impact that matters.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Hong Kong Apartment Fire Kills 36, Hundreds Missing in Tai Po Blaze",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 26 Nov 2025 08:24:53 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "New York Times",
      "Bloomberg",
      "Washington Post",
      "Globe and Mail"
    ],
    "domains": [
      "abcnews.go.com",
      "nytimes.com",
      "news.google.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "At least 13 people have been killed and dozens injured in the blaze that has engulfed a residential apartment complex in Hong Kong.",
      "At least 55 people were killed in the deadliest fire in Hong Kong in nearly 70 years. Firefighters have extinguished the blaze in half of the buildings.",
      "Watch Rescue Efforts Continue After Hong Kong Fire Bloomberg.com",
      "Police arrested three people for alleged manslaughter in connection to the blaze at Wang Fuk Court in the Tai Po district. At least 279 remain missing.",
      "Three arrested in Hong Kong after fire engulfs multiple apartment blocks, killing 44 The Globe and Mail",
      "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested.",
      "China Taiping Insurance Falls on Deadly Hong Kong Fire Liability Bloomberg.com"
    ],
    "image_url": "https://s.abcnews.com/images/International/251126_abc_social_hongkong_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Massive fire engulfs Hong Kong apartment complex",
      "What to Know About the Deadly Fire at a Hong Kong Apartment Complex",
      "Watch Rescue Efforts Continue After Hong Kong Fire - Bloomberg.com",
      "Fire engulfs high-rise buildings in Hong Kong, killing at least 44",
      "Three arrested in Hong Kong after fire engulfs multiple apartment blocks, killing 44 - The Globe and Mail",
      "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
      "China Taiping Insurance Falls on Deadly Hong Kong Fire Liability - Bloomberg.com"
    ],
    "url": "https://abcnews.go.com/International/video/massive-fire-engulfs-hong-kong-apartment-complex-127893330",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZlgwLUo4YU1sWTllMnNGdEpHX0FDWEVWRzl2RXhKWURTRTB4UUs0TE1oQXFWbzAxWXZzclZKOVFBNGRjN2swUk5VNlZ1T3V5QjRCSzhMc2daX2FNUDdvc0h5Z0E4aFFiZDhYeUppOEQ1WU9BTkFOaWJIdEtzQnJHNUxpRng2eXN5UVdvUDJyazlBN1B6VVNCczAyTDVXaHlw?oc=5",
      "https://www.washingtonpost.com/world/2025/11/26/hong-kong-fire-tai-po/",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNN0tNYlpFeWx1N0NZYl8xV1pJWVptcGN1THB1QWZtcXFQTnd5cWh6M2FLc3VpcEZhcU15dlNkaVBrV3NoTFZNRGp0ZF83WTdHeTRQR1l5XzBHSS1KYV9YVEJiYmNzZWl3aWFPYTRIdzVRTXhvNzYtS1NMR2ktNHJSbXJTbU80by1GQXFTWVJGQUxRZk1mNXNGZnlyZ25hVTBpNWJweVRB?oc=5",
      "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPZTRXSy0waG5hMXZFYzZEcjY5a2V2SS1lOGppTDJuck4zeWZhWjJMUWEwNTN2WU5scG9NWGdDRnNzTnI4aC1HNDVMVFB6R2d4N0lzVUxicEgyaVhCMWlDOHBnM1gxWXJfeHpqSEFTZm91dFBsZzV5bTgyZXI4UGZBakZRQ1lxV2hkLUkxTDZKNXB3b2ZxeGRIU1VzV3BwbWRMd1VMWC1zRzNieTJDb3YzR1lHV1V4dw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/International/video/massive-fire-engulfs-hong-kong-apartment-complex-127893330",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.649,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A massive fire broke out on Wednesday at the Wang Fuk Court residential complex in Hong Kong's Tai Po district, killing at least 36 people. The blaze spread rapidly, possibly due to bamboo scaffolding, and firefighters worked for hours to bring it under control. As of the latest reports, 279 people remain missing, and authorities are investigating the cause of the fire.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Netflix stops working for a short time during new Stranger Things show",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 04:03:53 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Users on social media earlier posted that they were experiencing issues, and DownDetector.com showed that reports spiked around 9 p.m. Eastern.",
      "Netflix recovers following brief outage during 'Stranger Things' final season premiere Reuters",
      "Viewers unable to watch episodes of long-awaited final series on TV when the streaming service briefly froze When Netflix crashed within minutes of releasing Stranger Things series five, it felt like a plot twist worthy of the sci-fi show itself. Viewers were left unable to stream the opening episod"
    ],
    "image_url": "",
    "titles": [
      "Netflix suffers brief outage during 'Stranger Things' season-five debut",
      "Netflix recovers following brief outage during 'Stranger Things' final season premiere - Reuters",
      "Netflix crashes within minutes of releasing Stranger Things series five"
    ],
    "url": "https://www.cnbc.com/2025/11/26/netflix-outage-stranger-things.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxOdDFjRXlza3pDR1F3WHA4aDN2OTZQV0hwXzRSU0hka1dDLXJmNFREZ0VJaTJ4c1p0SGpJUkhHLVZCTUNfa3J3a1kyTFU0WnZuRTVYd2tPdUtTT0hnaFZaWFd0MHJNZG41U2tNcW9KZ1lZV3JGZWFLUGZISjVYNy11WlBVYTdqUVIxNXBhOUNlUTA0YXJFeEh2aUExakpabDV0N0NkbnFNQ3VqOVdLX2c?oc=5",
      "https://www.theguardian.com/tv-and-radio/2025/nov/27/netflix-crashes-stranger-things-series-five"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/11/26/netflix-outage-stranger-things.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.88,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Netflix experienced a brief outage around 9 p.m. Eastern during the premiere of the final season of \"Stranger Things,\" leaving many viewers unable to stream the new episodes. Reports of the issue spiked on DownDetector.com and were widely shared on social media. Service was restored shortly after, and Netflix is now operating normally.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is not very constructive. It provides basic awareness about a temporary issue with Netflix, but it doesn't offer any deeper understanding or actionable insights. It also doesn't report on solutions or improvements, as the issue was resolved quickly and the service is now operating normally.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Angels may end Anthony Rendons contract before the season starts",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 26 Nov 2025 21:02:43 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Rendon, 35, is entering the final season of a disastrous $245 million deal for the Angels",
      "Anthony Davis Reportedly Expected to Seek Contract Extension If Traded by Mavs Bleacher Report",
      "The Los Angeles Angels appear set to close the book on one of the more disappointing contracts in recent club history.",
      "Will Anthony Rendon, Angels Reach Contract Buyout Amid Injury Woes? Insider Weighs In Bleacher Report"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/26/197f8661-f708-4928-be32-a593f8a93dff/anthony-rendon-getty.png",
    "titles": [
      "Anthony Rendon expected to retire if Angels buy out final year of $245M contract, per report",
      "Anthony Davis Reportedly Expected to Seek Contract Extension If Traded by Mavs - Bleacher Report",
      "Report: Angels, Anthony Rendon discussing buyout",
      "Will Anthony Rendon, Angels Reach Contract Buyout Amid Injury Woes? Insider Weighs In - Bleacher Report"
    ],
    "url": "https://www.cbssports.com/mlb/news/anthony-rendon-contract-angels-buy-out-retirement/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQdE5fQVJ6X2xCZkl3Zm1KZEpoWjVvdmUwNHMwUl9aYUQ3M2hZT0taTXU2X082OEJfaExQcEZ0OTVQUkxoQ0dxeGViLThOXzdyeFdqNGVSeXJFZ09BVHJjM0tKMVFQRDBTSXRfdmRQa1RSUXhkVHVtVEZfOXMydFIwd3p5TzVrZ0pfRlpZT3o0c0tmZkVaanBiT0FZb19waDJYMHRIbGVmQXM0OWM3YldXT1FzU21WZmQt?oc=5",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQcS1ack1FN1Nfa09ob3I0LVRFdUdUMnpJOHdUd0JKcTU0X0JneW5ISEtnY0FTeU9WQnpMaEFzdUZub1VCellFOWVGTkgxS0dFTlVoUkhWTW9IZnJ1clRDckNEbHJuVHRYV0hiVjVxWF9UaWZhdEh6OWFvWklJRkZYcXRQLUV6RU5tNHNabERTN0RVWkdLR1ZobnJNVUIzNlRtUWx0WWNTVm1XNWVuaGhPQVcyd25EZUljMjdFNXBnWFJ4Ukk?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/mlb/news/anthony-rendon-contract-angels-buy-out-retirement/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.76,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthony Rendon, 35, is entering the final year of his $245 million contract with the Los Angeles Angels, a deal widely regarded as disappointing due to injuries and underperformance. The Angels are reportedly considering options, including a possible contract buyout. No agreement has been reached, and Rendon remains on the roster for the upcoming season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the situation between Anthony Rendon and the Los Angeles Angels. However, it does not provide any actionable insights or deeper understanding about the implications of such a decision or the reasons behind it.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "JPMorgan will build a new main office in London",
    "domain": "business",
    "source_domain": "ft.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 08:54:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "ft.com",
      "news.google.com"
    ],
    "snippets": [
      "Decision is boost for district and comes as boss Jamie Dimon praises UK chancellor Rachel Reeves",
      "JPMorgan (JPM) to Build New UK Headquarters in London’s Canary Wharf Bloomberg.com"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fedb2a3ce-5e8f-411c-9fd1-02c01da70400.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "JPMorgan to build new Canary Wharf office tower",
      "JPMorgan (JPM) to Build New UK Headquarters in London’s Canary Wharf - Bloomberg.com"
    ],
    "url": "https://www.ft.com/content/11358be2-1fd7-4cbc-a584-948c79576b02",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNOU9rZnl3NUJtZkJPTFZDUFF2Y2UyZk1oaGYzMHA2c1d1TDZlejhldDhIUEM2eUdGVnA3Z0RVem45NWl6dWRYUi1aZlpzSmZfQzlwUThBSVlkTGNqVWZvcEV1Z011WjhPQThFSWZDMzVZdnZIZkRSRXNpZE1XZGtBR3N3RzVlVmE2ZVBSTFJ4S1pUMUxFaGV6eVR1UVhES3h4MTcyeUc3aE9sNEZoU3B1TWpSOA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.ft.com/content/11358be2-1fd7-4cbc-a584-948c79576b02",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "JPMorgan has announced plans to build a new UK headquarters in London’s Canary Wharf. The decision is seen as a positive development for the district. JPMorgan CEO Jamie Dimon praised UK Chancellor Rachel Reeves in connection with the announcement. The move highlights the bank’s continued investment in London.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is quite constructive. It provides useful information about JPMorgan's investment in London, which could be useful for readers interested in the financial industry. It also reports on a positive development for the Canary Wharf district. However, it could provide more context or insight to be fully constructive.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Guinea Bissau Military Seizes Power, President Deposed Amid Election",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-26T16:00:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "dw.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "Gunshots were audible near the presidential palace and election commission HQ, three days after a contentious election claimed by both sides.",
      "Officers say they are closing borders and suspending poll as president and main rival both claim victory Soldiers in Guinea-Bissau have announced they are taking “total control” of the west African country, three days after elections that both the two main presidential contenders claim to have won.",
      "The military announced on Wednesday it had taken over the West African nation. Later, the opposition leader accused the incumbent president of staging the coup d’état to try to retain power."
    ],
    "image_url": "",
    "titles": [
      "Guinea-Bissau military says president deposed after vote",
      "Guinea-Bissau military takes ‘total control’ amid election chaos",
      "Guinea-Bissau’s President Says He Has Been Deposed. The Opposition Says It’s a Trick."
    ],
    "url": "https://www.dw.com/en/guinea-bissau-military-says-president-deposed-after-vote/a-74909428?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/26/guinea-bissau-officers-take-total-control-close-borders-amid-election-chaos",
      "https://www.nytimes.com/2025/11/26/world/africa/guinea-bissau-coup.html"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/guinea-bissau-military-says-president-deposed-after-vote/a-74909428?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.685,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Army officers in Guinea-Bissau say they have seized total control of the country, deposed and arrested President Embalo, and suspended the electoral process. Gunfire was reported near key government buildings following a disputed election, which both sides claimed to have won. The military has announced it is now in control, and the situation remains tense.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a significant political event in Guinea-Bissau, but it doesn't provide enough depth or insight into the causes, consequences, or potential solutions to the crisis.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Scripps takes steps to stop Sinclair from buying more of its company",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 05:58:42 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Scripps adopts poison pill to thwart Sinclair takeover attempt Axios",
      "Broadcaster E.W. Scripps adopts poison pill after $538 million Sinclair bid Reuters"
    ],
    "image_url": "",
    "titles": [
      "Scripps adopts poison pill to thwart Sinclair takeover attempt - Axios",
      "Broadcaster E.W. Scripps adopts poison pill after $538 million Sinclair bid - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4tQ2lCdHdnMHQ4WmVlMXZmMlNyRjUzaXc0c3VYSkhpTmdSSVJETmdjZkZwZ1o3amRoenk2Qy0wbTFGa2xyT2NSNUFyTkNRVDJESVUxTnI5UVZKdUJqSGhaQ0RmUFZEY2NmR3hyRUZOVnFuNW5PWk9BZWh3?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi6AFBVV95cUxORXk2THJxY2lYb1E3dy1zbTUwOWRWLVR4eU82RExBYmw3Y2dQTVhsNnNqTF9LbzNhbmZwRThqeWtyWDlBc3JYUS1idlNKY2hTVGt3d0Z6NDI0M0syV2FRNWFEVU9TV2t1dHFCaTg3d3MtcjZFMEE1MFBsbHhnbUNnMldRVFB0T1ZBTUVYWnhuN3hmQXd2MTdIbGdVeUVoWGlHZmJ5VnJkeGpLN1BsOHRZSGtNNW1lUWpYR1FGRFRBNnE1MFhuN3VBQ25ITlAxaGVvaXlrRDFGNlRWVTFWb0szMVNIRTJBcDNN?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4tQ2lCdHdnMHQ4WmVlMXZmMlNyRjUzaXc0c3VYSkhpTmdSSVJETmdjZkZwZ1o3amRoenk2Qy0wbTFGa2xyT2NSNUFyTkNRVDJESVUxTnI5UVZKdUJqSGhaQ0RmUFZEY2NmR3hyRUZOVnFuNW5PWk9BZWh3?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.916,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "E.W. Scripps has adopted a \"poison pill\" defense to prevent a takeover by Sinclair Broadcast Group, which recently made a $538 million acquisition offer. The move is intended to make it more difficult for Sinclair to increase its stake in Scripps without board approval. The poison pill is now in effect, and Scripps remains independent.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs and contextualizes usefully about a significant business event. It provides actionable insights and deeper understanding about the strategies companies use to prevent takeovers. However, it does not clearly highlight progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shark attack at Australia beach kills woman and hurts man",
    "domain": "science",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-27T03:55:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Phys.org"
    ],
    "domains": [
      "dw.com",
      "bbc.com",
      "phys.org"
    ],
    "snippets": [
      "A woman died at the scene and an injured man was airlifted to hospital in critical condition. Australia recorded three fatal shark attacks in the first half of 2025.",
      "The woman died at the scene and a man was critically injured after the attack in New South Wales.",
      "A bull shark killed a woman swimming off a remote beach in Australia's eastern state of New South Wales Thursday while a man was seriously injured and may have been saved by the \"heroic\" efforts of a passerby."
    ],
    "image_url": "",
    "titles": [
      "Australia: Shark attack kills one, seriously injures another",
      "Woman killed in shark attack in Australia",
      "Bull shark attack kills woman, injures man at remote Australian beach"
    ],
    "url": "https://www.dw.com/en/australia-shark-attack-kills-one-seriously-injures-another/a-74914520?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cz68lglg5vlo?at_medium=RSS&at_campaign=rss",
      "https://phys.org/news/2025-11-bull-shark-woman-remote-australian.html"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/australia-shark-attack-kills-one-seriously-injures-another/a-74914520?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.877,
      "consensus": 0.789,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A bull shark attacked two people off a remote beach in New South Wales, Australia, killing a woman at the scene and critically injuring a man, who was airlifted to hospital. The man may have survived due to the intervention of a passerby. This incident marks Australia's third fatal shark attack in the first half of 2025.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Chinese tech companies train AI in Southeast Asia to get better chips",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 05:47:49 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "China's tech giants move AI model training overseas to access Nvidia chips, FT reports Reuters",
      "Alibaba and ByteDance shift development to south-east Asia to sidestep US curbs"
    ],
    "image_url": "",
    "titles": [
      "China's tech giants move AI model training overseas to access Nvidia chips, FT reports - Reuters",
      "China’s tech giants take AI model training offshore to tap Nvidia chips"
    ],
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNYzVJeTN5ZTBJZzJ2UXk5ZjluTUxKZC11aDdmRmdGWEtVLUF4TVdrQjVlWHoyY0pGakxyWlFNLWhQa0UtRk5NYUNyWktGSFdUbDk4Q3VGQlJoQlpDSTJ5aXRyOUdQQXU0dllKa2ZraUF4dFctM2o3ZkpFR1NrN29QTEZsUDhuanNOSVdTeUQxQzEtUnY2WHpDSWVZMGpJZ2dNQmE1N2xQekhnai01aFppcXNtb1NUNHpxN1g0a0RyS0k3eHUz?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/96fe9898-a3a4-4a33-be1d-da06bdb6cb2b"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNYzVJeTN5ZTBJZzJ2UXk5ZjluTUxKZC11aDdmRmdGWEtVLUF4TVdrQjVlWHoyY0pGakxyWlFNLWhQa0UtRk5NYUNyWktGSFdUbDk4Q3VGQlJoQlpDSTJ5aXRyOUdQQXU0dllKa2ZraUF4dFctM2o3ZkpFR1NrN29QTEZsUDhuanNOSVdTeUQxQzEtUnY2WHpDSWVZMGpJZ2dNQmE1N2xQekhnai01aFppcXNtb1NUNHpxN1g0a0RyS0k3eHUz?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chinese technology companies, including Alibaba and ByteDance, are moving their artificial intelligence model training operations to Southeast Asia, according to the Financial Times. This shift allows them to access advanced Nvidia chips restricted by U.S. export controls. The move is intended to bypass U.S. curbs on AI technology exports to China.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is somewhat constructive. It provides useful information about how Chinese tech companies are adapting to U.S. export controls, which could be useful for readers interested in the global tech industry. However, it doesn't report on any solutions or improvements to the situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Experts share which football players to start or sit this week",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 04:12:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Plus your toughest start/sit decisions at every position",
      "Wide receivers you want in Week 13 lineups, and those you should avoid",
      "Running Back Start 'Em, Sit 'Em For Fantasy Football Week 13 Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/11/afd289fc-3d2c-4007-9209-1cea551104fb/rj-harvey-denver-broncos-imagn-images.jpg",
    "titles": [
      "Fantasy Football Week 13 Start 'Em & Sit 'Em: RJ Harvey is Start of the Week, plus sleepers at all positions",
      "Fantasy Football Week 13 Start 'Em & Sit 'Em Wide Reciever: Stefon Diggs gets back on track in a big way",
      "Running Back Start 'Em, Sit 'Em For Fantasy Football Week 13 - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/fantasy/football/news/fantasy-football-week-13-start-sits/",
    "alternate_urls": [
      "https://www.cbssports.com/fantasy/football/news/fantasy-football-week-13-start-em-sit-em-wide-reciever-stefon-diggs-gets-back-on-track-in-a-big-way/",
      "https://news.google.com/rss/articles/CBMingFBVV95cUxPbGhjU042OE55UnRLSi1xVHdkaTdWN21uWkFmRHdzMzJZSnBfNlBrellzTjhjOTZOMlR4dmxtUlMyczdnN2k5SmdRcVF6TlhuOVFlSHc3MzZkUF9MVW56SDV1d0FBUUdzRUR6RjNCVzdGeEQ1bXdZcE5HVE1kZUFkelJZYU9sX3VqZHp5SGtxTTR2MHFzd1dkTEpfUEcxQQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/fantasy/football/news/fantasy-football-week-13-start-sits/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.883,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fantasy football experts recommend starting certain wide receivers and running backs in Week 13 based on recent performance and matchups. They also advise benching players facing tough defenses or with declining stats. The guidance aims to help managers make informed lineup decisions for optimal results in this week's games.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful for readers who participate in fantasy football, providing them with actionable insights for their game strategy. However, it does not report on any progress or solutions, nor does it provide a broader understanding of systems or trends.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Frank Ragnow comes back to play football for the Detroit Lions",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 04:07:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Frank Ragnow, a four-time Pro Bowler for the Lions, is ending his five-month retirement and returning to play for Detroit.",
      "Frank Ragnow Ends Retirement, Returns to Lions amid Push for NFL Playoff Bracket Spot Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "Center Ragnow ends retirement to return to Lions",
      "Frank Ragnow Ends Retirement, Returns to Lions amid Push for NFL Playoff Bracket Spot - Bleacher Report"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47111425/sources-c-frank-ragnow-returns-lions-june-retirement",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxQYmdNRU1hVmlYNnJtaVVOVGxfVGZ3dU5OMUlDVXQxSTg5XzZSOEtZYWc4VlFneE4ySGFNSzZhUk5CU2pXVDlsQ2RxRnhSS2JmNmFUd290aGdpVEdwTzBEQjZOLUtmU2Fqc29hTU0yZ0ViX1ZuZVliUWZ5YVdQTHQ1WHdUa2I5eEtLaGdLcjhYeXRhMWJ0T3pvVWJ3YnF3cjJSVWk0ZlJJaEluanNKS3F4dWhPdVFzWmZMT3RjbGdhbw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47111425/sources-c-frank-ragnow-returns-lions-june-retirement",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.706,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Frank Ragnow, a four-time Pro Bowl center, has ended his nearly six-month retirement and will return to play for the Detroit Lions. His return comes as the Lions aim to secure a spot in the NFL playoffs. Ragnow's presence is expected to strengthen the team's roster for the remainder of the regular season and potential postseason games.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about a development in the NFL, it lacks depth and doesn't provide any significant insights or takeaways for the reader. It doesn't contribute to a deeper understanding of the sport or the factors influencing the player's decision to return.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump says South Africa will not be invited to big world meeting",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 00:18:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Trump says South Africa won't get 2026 G20 invite, South Africa calls it punitive Reuters",
      "The president did not attend this year’s annual gathering in South Africa, which has been a frequent target of his attacks.",
      "Trump Says He Won’t Invite South Africa to G-20 in Miami Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump says South Africa won't get 2026 G20 invite, South Africa calls it punitive - Reuters",
      "Trump Says South Africa Is Not Invited to G20 Summit in U.S. in 2026",
      "Trump Says He Won’t Invite South Africa to G-20 in Miami - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYWlYSmtTUWhBbjlPNEZfSVBWSU1PbTVsaHMxMXhLWk9nVXFkWEZKR09hYUJQemk1VlIybnFpeFphOUQ4a2F2czlJUk9HSmphU1lGRXVpbzFxVHplQUVrd3NUaEI3QWlfMUxzVkNGZ1ZFZmN5WWZYY1pDbUo3WXh3TThpekQ3emMxcWx4cmVQcGJYZEdiQkJQN2llU1AwdGVZOTRSYXRKTnk?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/26/world/africa/trump-south-africa-g20.html",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQVzVqRXBSNUhtY2VMbEM5NkkyeFVqWDlvWWdrb285TlZ0dlp5WHRRb2FPWGt0V1lmcXladG1pTzJtV200VllRZi1QbGRGM3lxNDF1bmdDQnVBamY2ZHdlZklsRU5vdTkwM0RrZWQtX0N0WmFDT2RJMm1pcnJ1Wll6VGdfc091RVdBdDQwZjNjMVV5N2hqT0FpT2NPTm1uOTludVJuZG5fM2VtSzA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYWlYSmtTUWhBbjlPNEZfSVBWSU1PbTVsaHMxMXhLWk9nVXFkWEZKR09hYUJQemk1VlIybnFpeFphOUQ4a2F2czlJUk9HSmphU1lGRXVpbzFxVHplQUVrd3NUaEI3QWlfMUxzVkNGZ1ZFZmN5WWZYY1pDbUo3WXh3TThpekQ3emMxcWx4cmVQcGJYZEdiQkJQN2llU1AwdGVZOTRSYXRKTnk?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.814,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump has accused South Africa of committing human rights abuses against white Afrikaners. In response, he stated that he will not invite South Africa to the upcoming G-20 summit in Miami. The South African government has denied the allegations. The decision marks a diplomatic escalation between the two countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: accus); semantic: pos_sim=0.06, neg_sim=0.07",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sean Tuohy Jr. becomes new athletic director at UL Monroe",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 02:47:27 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Tuohy is currently working at Oral Roberts",
      "UL-Monroe Hires Sean Tuohy Jr. of 'The Blind Side' As New Athletic Director Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/27/940cf373-cd52-4fae-b3a7-5e6f177f8d22/tuohy.jpg",
    "titles": [
      "UL-Monroe reportedly hiring SJ Tuohy of 'Blind Side' fame as athletic director",
      "UL-Monroe Hires Sean Tuohy Jr. of 'The Blind Side' As New Athletic Director - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/nfl/news/ul-monroe-reportedly-hiring-sj-tuohy-of-blind-side-fame-as-athletic-director/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxPZnVGa05yeHlFbDFtVkZzNXZCd3N1MlVwZm1DblBHQ003SW5zNHJCazlpTUQwbUdDek0wMHlETG9DdU5LVHBvOXkyd3RfT29xYjRjRkoxNXlLU2wzd3E5NldpRDU0T0tPRi10T3B2TGctYmtjdTNBc2JpbXpCdXp1Sm9aNWd4MFlCN0JLNlpOSXVZMlgxTlNQU1FYbEwwTVlUTkRHMWJPMlNxbVpy?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/ul-monroe-reportedly-hiring-sj-tuohy-of-blind-side-fame-as-athletic-director/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.857,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean Tuohy Jr., known for his portrayal in \"The Blind Side,\" has been hired as the new athletic director at the University of Louisiana at Monroe (UL-Monroe). He was previously working at Oral Roberts University. Tuohy will oversee UL-Monroe's athletic programs as part of his new role.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a new appointment in the University of Louisiana at Monroe's athletic department. However, it doesn't provide any deeper insights into how this change might affect the university's athletic programs or any plans that the new director might have.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Toronto Blue Jays sign pitcher Dylan Cease to a seven year contract",
    "domain": "business",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 04:07:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Right-hander Dylan Cease, who has made at least 32 starts in each of the past five seasons, reached a seven-year, $210 million deal with the Blue Jays, sources told ESPN.",
      "The Blue Jays finally made the kind of top-of-the-market strike they’d attempted unsuccessfully the previous two off-seasons. Shi Davidi breaks down what Dylan Cease brings to the Blue Jays’ lineup."
    ],
    "image_url": "",
    "titles": [
      "Sources: Jays, Cease reach 7-year, $210M deal",
      "Blue Jays agree to seven-year, $210M deal with Dylan Cease"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47112453/sources-blue-jays-dylan-cease-reach-7-year-210m-deal",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47112453/sources-blue-jays-dylan-cease-reach-7-year-210m-deal",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have signed right-handed pitcher Dylan Cease to a seven-year, $210 million contract, according to multiple sources. This is the second-largest deal in franchise history. Cease, who made 32 starts last season with the San Diego Padres and posted a 4.55 ERA, is known for his high strikeout rates. The agreement marks a major move in Toronto’s off-season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Former Peru president gets 14 years in jail for taking bribes",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-26T20:47:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Former President Martin Vizcarra has been found guilty of receiving bribes from construction firms while serving as a regional governor between 2011 and 2014.",
      "Peru sentences ex-President Vizcarra to 14 years in prison for corruption Reuters"
    ],
    "image_url": "",
    "titles": [
      "Peru: Ex-president Vizcarra sentenced to 14 years in prison",
      "Peru sentences ex-President Vizcarra to 14 years in prison for corruption - Reuters"
    ],
    "url": "https://www.dw.com/en/peru-ex-president-vizcarra-sentenced-to-14-years-in-prison/a-74913042?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMXJndDN1TElfLWh2dTVHVUtMckVrTXd1aXZwdmR1VkIwT2Jyd2RZU0lKajVDSGRWZjBpMXVXV205b3JRMWxOMGg0NEZrS0lhZTRSaG1CX1VHNndrS2lrOGlsdkJpUDRaNWNhQmVpN1VVVGxQN1ZzVDA3bTNQT2pEeE56djgtZmxRR0lOR3dJSmFpNjllTkVnSFB3VDJBZ3dxbmNXeG12bk1zcE40SlVTdjVEMGU?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/peru-ex-president-vizcarra-sentenced-to-14-years-in-prison/a-74913042?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.756,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Peruvian President Martin Vizcarra has been sentenced to 14 years in prison after being found guilty of leading a corruption scheme and accepting bribes from construction companies while serving as a regional governor from 2011 to 2014. The verdict was delivered by a Peruvian court, and Vizcarra is affiliated with the Peru First party.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the outcome of a corruption case, providing a deeper understanding of the consequences of such actions. It does not report on solutions or improvements, but it does highlight an attempt to solve a problem, namely corruption.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nylander scores late goal to help Maple Leafs beat Blue Jackets 2 1",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 27 Nov 2025 06:20:47 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Nylander goal with 20 seconds left in OT lifts Maple Leafs past Blue Jackets NHL.com",
      "Matthews to return for Maple Leafs against Blue Jackets NHL.com",
      "Joseph Woll was spectacular for the Leafs, outduelling a dialed-in Jet Greaves in a nail-biting 2-1 comeback overtime over the Blue Jackets and stuffing a silencer on the canon when it mattered most.",
      "Watch as William Nylander scores the winner with a slick wrister from the crease to win it for the Maple Leafs in overtime against the Columbus Blue Jackets.",
      "Joseph Woll put on a show in net, finishing with 30 saves and William Nylander fired home the OT-winner as the Toronto Maple Leafs rallied late to defeat the Columbus Blue Jackets 2-1."
    ],
    "image_url": "",
    "titles": [
      "Nylander goal with 20 seconds left in OT lifts Maple Leafs past Blue Jackets - NHL.com",
      "Matthews to return for Maple Leafs against Blue Jackets - NHL.com",
      "Joseph Woll ‘unreal’ in Maple Leafs’ critical comeback win over Blue Jackets",
      "Maple Leafs’ Nylander fires in OT winner with slick wrister vs. Blue Jackets",
      "NHL Highlights: Maple Leafs 2, Blue Jackets 1 (OT)"
    ],
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOcjM1Q090TGQ5d21zWi1SOXRBX0hxanJzamNOal9XUnlUeGE3ZFpOaU5IMlIzM0FHNjZlckFVeWdtdTNSSTMyVGFIMGJKTndLZGVsN1U3SUJPcmdlQ1ZNR1g5VDJGdVRZdnNwajRfV3FHSVJHdDRxMTBhaW5FTG0xYVdJUkwwR0tKdFZla2dOckl5T0FMRExKdWNR?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPMmEtaHNDLXhCR0E5UXN2NE5xd3ZTeHY5NUpUSGhiY2N2TGZGQmtDZ3hOQUVvRmkxNFFaYTRtbGtBYlpVYmV4dU5NZms3cTlCRks5VHppUGljNV9WbC13bkRnQXhnblpxdmNQemNhZWhoWVdRdklvSWx5UFBGT1oxRVotUmlNcDBvUm9NYkNEUmk5LXlJQnEtb21BM2FWY1FJRTUxV0Y2NkNNQQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOcjM1Q090TGQ5d21zWi1SOXRBX0hxanJzamNOal9XUnlUeGE3ZFpOaU5IMlIzM0FHNjZlckFVeWdtdTNSSTMyVGFIMGJKTndLZGVsN1U3SUJPcmdlQ1ZNR1g5VDJGdVRZdnNwajRfV3FHSVJHdDRxMTBhaW5FTG0xYVdJUkwwR0tKdFZla2dOckl5T0FMRExKdWNR?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.923,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "William Nylander scored the game-winning goal with 20 seconds left in overtime, giving the Toronto Maple Leafs a 2-1 victory over the Columbus Blue Jackets. Goaltender Joseph Woll made 30 saves for Toronto, outdueling Columbus goalie Jet Greaves. The Maple Leafs rallied late to secure the win. Auston Matthews is set to return for Toronto in their next game against Columbus.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides a basic recap of a sports event but does not offer any deeper insights or analysis. It doesn't contribute to the reader's understanding beyond the game's outcome.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK assisted dying bill faces more debates in the House of Lords",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 21:06:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The assisted dying bill is allocated further sessions after a record number of amendments in the House of Lords.",
      "Dr Lucy Thomas and Penelope Jenkins support the House of Lords’ examination of the bill, but Margaret Pelling says they seem to be blocking the legislation, not scrutinising it Simon Jenkins is right that the Lords should not kill legislation by procedural manoeuvre ( Unelected Lords are blocking as"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4ef2/live/d5a7a160-caf0-11f0-84e9-a9bb2f1691c9.png",
    "titles": [
      "Extra time for peers to debate assisted dying",
      "Peers are just doing their job in scrutinising the assisted dying bill | Letters"
    ],
    "url": "https://www.bbc.com/news/articles/cy8jy3vr38mo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/society/2025/nov/26/peers-are-just-doing-their-job-in-scrutinising-the-assisted-dying-bill"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cy8jy3vr38mo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.762,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The assisted dying bill in the UK House of Lords has been allocated more sessions after a record number of amendments. Supporters say the Lords are properly scrutinising the bill, while critics argue that procedural tactics are being used to delay or block its progress. The bill’s outcome remains undecided as debates continue.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the ongoing debates around the assisted dying bill in the UK, providing context and awareness about the legislative process. However, it does not provide actionable insights or report on specific solutions.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Big fire in Hong Kong kills at least 55 people and many are missing",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 03:04:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com"
    ],
    "snippets": [
      "At least 55 people have been killed in the blaze in Hong Kong's Tai Po neighbourhood. The fire is still raging.",
      "The death toll continues to rise and hundreds are missing, as firefighters struggle to put out the fire."
    ],
    "image_url": "",
    "titles": [
      "Hong Kong’s deadliest fire in 63 years: What we know and how it spread",
      "Hong Kong reels from most severe fire in over a decade - what we know so far"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/27/hong-kongs-deadliest-fire-in-63-years-what-we-know-and-how-it-spread?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cdxe9r7wjgro?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/27/hong-kongs-deadliest-fire-in-63-years-what-we-know-and-how-it-spread?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At least 55 people have died in a large fire in Hong Kong's Tai Po neighborhood. The blaze is ongoing, and firefighters are still working to contain it. Hundreds of people are reported missing, and the death toll is expected to rise as rescue efforts continue.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a tragic event, but lacks depth or insight. It does not provide actionable insights or deeper understanding for the reader. It does not report on solutions, improvements, innovations, or attempts to solve problems. It slightly increases clarity around an impact that matters.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Upbit works to fix security problem after new company buys it",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 08:00:25 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Crypto Exchange Upbit Hit by Exploit After $10 Billion Deal Bloomberg.com",
      "Naver’s purchase of Dunamu is set to create a fintech heavyweight that offers everything from payments to crypto and stock trading."
    ],
    "image_url": "",
    "titles": [
      "Crypto Exchange Upbit Hit by Exploit After $10 Billion Deal - Bloomberg.com",
      "Naver To Acquire Korean Crypto Exchange Giant Dunamu In $10 Billion Deal"
    ],
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOR3NqdFVocHp4aEZwX0pheFFpOFc0WGZLaWp5UW5DZjFqeWcyUW5pdHgyNnBCWlk2UmJkUkZWLVdqdnk0Q1prRGZfaTE1YnRhTGVYNWtfWXo1MHcwb0pSN1Ata0RLdk01bjcxcFNTSDN0Q2J4bE1YNVpOY080ckdKQmlDZm03ZWhSNDNxU3BNZWpIM0RpVkhMZkc5TDBHOGEtQUh3NFlKX3pMQmtMSHBzUg?oc=5",
    "alternate_urls": [
      "https://www.forbes.com/sites/zinnialee/2025/11/27/naver-to-acquire-korean-crypto-exchange-giant-dunamu-in-10-billion-deal/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOR3NqdFVocHp4aEZwX0pheFFpOFc0WGZLaWp5UW5DZjFqeWcyUW5pdHgyNnBCWlk2UmJkUkZWLVdqdnk0Q1prRGZfaTE1YnRhTGVYNWtfWXo1MHcwb0pSN1Ata0RLdk01bjcxcFNTSDN0Q2J4bE1YNVpOY080ckdKQmlDZm03ZWhSNDNxU3BNZWpIM0RpVkhMZkc5TDBHOGEtQUh3NFlKX3pMQmtMSHBzUg?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Upbit, a major cryptocurrency exchange, experienced a security exploit shortly after its parent company, Dunamu, was acquired by Naver in a $10 billion deal. The acquisition aims to create a leading fintech platform combining payments, crypto, and stock trading. Upbit is currently addressing the exploit, and investigations are ongoing.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Arsenal beats Bayern Munich 3 1 in Champions League game",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 23:15:34 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "espn.com"
    ],
    "snippets": [
      "Arsenal stun Bayern Munich to seize Champions League top spot Reuters",
      "A convincing 3-1 win over Bayern Munich has only strengthened Arsenal's case as firm favorites to win."
    ],
    "image_url": "",
    "titles": [
      "Arsenal stun Bayern Munich to seize Champions League top spot - Reuters",
      "Are Arsenal the best in Europe? Bayern win boosts Champions League contender tag"
    ],
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQaDhWeG15U25KWGltcjgyWThBanNMa1Y1ZGdKcHhrbUdxSWMwTzJhMWhuNVFpYnhMYzZOakZyTE9WN2R3M1g0NGRydTBxQmJKWDBka0lpQVo2eFVndGJZbTVjWjhjaEVqaGxKQWxPNVBINnFGUXVOeTd1R2F0MnhRa1dxRVlFT1ZZTXJSdGVZUmtsU3VYVUhlc2NJb2lVMUxXdGV3X2ZvTHNweWto?oc=5",
    "alternate_urls": [
      "https://www.espn.com/soccer/story/_/id/47112079/arsenal-remain-perfect-uefa-champions-league-firm-contender-status"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQaDhWeG15U25KWGltcjgyWThBanNMa1Y1ZGdKcHhrbUdxSWMwTzJhMWhuNVFpYnhMYzZOakZyTE9WN2R3M1g0NGRydTBxQmJKWDBka0lpQVo2eFVndGJZbTVjWjhjaEVqaGxKQWxPNVBINnFGUXVOeTd1R2F0MnhRa1dxRVlFT1ZZTXJSdGVZUmtsU3VYVUhlc2NJb2lVMUxXdGV3X2ZvTHNweWto?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.796,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arsenal defeated Bayern Munich 3-1 in a Champions League match, moving to the top of their group. The victory strengthens Arsenal's position as group leaders and boosts their chances of advancing in the tournament. The match outcome puts Bayern Munich under pressure in the group standings.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides a basic update on a sports event, informing readers about the outcome of a Champions League match. However, it doesn't offer any deeper analysis or insights into the game, nor does it provide any actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "USA Hockey Unveils New Jerseys for 2026 Winter Olympics and",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 26 Nov 2025 15:00:12 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Team USA Olympic hockey jerseys unveiled NHL.com",
      "USA Hockey revealed Wednesday its Olympic and Paralympic uniforms to be worn by the men’s, women’s and sled hockey teams in Milano Cortina 2026."
    ],
    "image_url": "",
    "titles": [
      "Team USA Olympic hockey jerseys unveiled - NHL.com",
      "USA Hockey releases Milan 2026 jerseys paying tribute to 1960 team"
    ],
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1uV0ROV3QyTWJHRC1nVUVsYjh5eUxnNU02YUc4djY0LXB0QzJZdmFPXzhJeXhnT21PWGJfcnN5VHczWXZhbmNLTS1NNWNMblBVUExYMDZRQkJ5VzhMOWE2SkJ5Sk9qandWZEh6M1Vha2ZrcnAtWHc0bmp4ajY?oc=5",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1uV0ROV3QyTWJHRC1nVUVsYjh5eUxnNU02YUc4djY0LXB0QzJZdmFPXzhJeXhnT21PWGJfcnN5VHczWXZhbmNLTS1NNWNMblBVUExYMDZRQkJ5VzhMOWE2SkJ5Sk9qandWZEh6M1Vha2ZrcnAtWHc0bmp4ajY?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.67,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "USA Hockey has unveiled the new jerseys for the U.S. men's, women's, and sled hockey teams to be worn at the 2026 Winter Olympics and Paralympics in Milano Cortina. The uniforms were revealed on Wednesday and will represent Team USA in international competition at the upcoming Games.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about the new jerseys for the U.S. hockey teams for the 2026 Winter Olympics and Paralympics. However, it doesn't offer any deeper insights or context about the design process, the significance of the jerseys, or how they might impact the team's performance or morale.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nikon camera and smart telescope prices drop for Black Friday",
    "domain": "science",
    "source_domain": "livescience.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 04:00:00 +0000",
    "source": "Live Science",
    "sources": [
      "Live Science",
      "MarketWatch"
    ],
    "domains": [
      "livescience.com",
      "marketwatch.com"
    ],
    "snippets": [
      "We love the Nikon D850 for just about any type of photography you can imagine, and it's now discounted for Black Friday.",
      "If you want to photograph the cosmos without the hassle of setting up a star tracker and camera, our favorite smart telescope is now $3,999 at various retailers",
      "“I received an email from eBay, or at least it looked like it was from an official eBay address.”"
    ],
    "image_url": "https://cdn.mos.cms.futurecdn.net/CyoiKv9tPgEj84Cdrz8mC4-1280-80.jpg",
    "titles": [
      "Our favorite DSLR ever-made is now under $2,000 for Black Friday",
      "Our favorite premium smart telescope is $1000 cheaper right now in this Black Friday telescope deal",
      "Beware of this Black Friday scam"
    ],
    "url": "https://www.livescience.com/technology/our-favorite-dslr-ever-made-is-now-under-2000-dollars-for-black-friday",
    "alternate_urls": [
      "https://www.livescience.com/space/astronomy/capture-effortless-deep-sky-images-for-1000-dollars-less-this-black-friday",
      "https://www.marketwatch.com/story/is-it-a-black-friday-scam-ebay-said-id-set-up-an-account-there-was-only-one-problem-i-hadnt-b4b8c169?mod=mw_rss_topstories"
    ],
    "location_scope": "global",
    "link": "https://www.livescience.com/technology/our-favorite-dslr-ever-made-is-now-under-2000-dollars-for-black-friday",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Nikon D850 camera is currently available at a discounted price for Black Friday. Additionally, a popular smart telescope is being sold for $3,999 at several retailers. Separately, there are reports of phishing emails that appear to be from eBay, highlighting the need for caution when handling suspicious messages.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Jakarta is now the biggest city in the world by number of people",
    "domain": "science",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Thu, 27 Nov 2025 03:07:43 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "The rankings were changed after the UN used new criteria to give a more accurate picture of the rapid urbanisation driving the growth of megacities Jakarta has overtaken Tokyo as the world’s most populous city, according to a UN study that uses new criteria to give a more accurate picture of the rap",
      "The capital of Indonesia surpassed Tokyo as the world’s most populous city after the United Nations overhauled how it measures urban populations."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ad55e4ad8ea34c9ae720f70b2efda9eb43a337a7/311_0_4361_3488/master/4361.jpg?width=140&quality=85&auto=format&fit=max&s=e3c43aba1683fdf6c794242eaf7bf549",
    "titles": [
      "Jakarta overtakes Tokyo as world’s most populous city, according to UN",
      "Jakarta Overtakes Tokyo as World’s Largest City, UN Report Says"
    ],
    "url": "https://www.theguardian.com/world/2025/nov/27/jakarta-overtakes-tokyo-most-populous-city-world",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/26/world/asia/worlds-largest-city-un-jakarta-indonesia.html"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2025/nov/27/jakarta-overtakes-tokyo-most-populous-city-world",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jakarta has surpassed Tokyo to become the world's most populous city, according to a United Nations study. The UN changed its criteria for measuring urban populations to better reflect rapid urbanization. This updated methodology led to Jakarta overtaking Tokyo in the latest rankings.",
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "OpenAI says it is not to blame for teens death in court case",
    "domain": "science",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 20:26:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "In August, parents Matthew and Maria Raine sued OpenAI and its CEO, Sam Altman, over their 16-year-old son Adam's suicide, accusing the company of wrongful death. On Tuesday, OpenAI responded to the lawsuit with a filing of its own, arguing that it shouldn't be held responsible for the teenager's de",
      "OpenAI’s response to teen suicide case is “disturbing,” lawyer says."
    ],
    "image_url": "",
    "titles": [
      "OpenAI claims teen circumvented safety features before suicide that ChatGPT helped plan",
      "OpenAI says dead teen violated TOS when he used ChatGPT to plan suicide"
    ],
    "url": "https://techcrunch.com/2025/11/26/openai-claims-teen-circumvented-safety-features-before-suicide-that-chatgpt-helped-plan/",
    "alternate_urls": [
      "https://arstechnica.com/tech-policy/2025/11/openai-says-dead-teen-violated-tos-when-he-used-chatgpt-to-plan-suicide/"
    ],
    "location_scope": "global",
    "link": "https://techcrunch.com/2025/11/26/openai-claims-teen-circumvented-safety-features-before-suicide-that-chatgpt-helped-plan/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.751,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In August, Matthew and Maria Raine sued OpenAI and CEO Sam Altman, alleging wrongful death after their 16-year-old son Adam's suicide. On Tuesday, OpenAI filed a legal response, arguing it should not be held responsible for the teenager's death. The case remains ongoing, with both sides presenting their arguments in court.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.14",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NFL on Thanksgiving cheat sheet: Everything you need to know to impress relatives for holiday games",
    "domain": "science",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 26 Nov 2025 21:13:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "TechCrunch"
    ],
    "domains": [
      "cbssports.com",
      "techcrunch.com"
    ],
    "snippets": [
      "A look at everything you need to know about Packers-Lions, Chiefs-Cowboys and Bengals-Ravens, plus the Black Friday game",
      "A timeline of ChatGPT product updates and releases, starting with the latest, which we’ve been updating throughout the year."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/26/7b5390de-ed72-4b90-b23d-d77f6289506d/lionsturkey.jpg",
    "titles": [
      "NFL on Thanksgiving cheat sheet: Everything you need to know to impress relatives for holiday games",
      "ChatGPT: Everything you need to know about the AI-powered chatbot"
    ],
    "url": "https://www.cbssports.com/nfl/news/nfl-on-thanksgiving-cheat-sheet-everything-you-need-to-know/",
    "alternate_urls": [
      "https://techcrunch.com/2025/11/26/chatgpt-everything-to-know-about-the-ai-chatbot/"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/nfl-on-thanksgiving-cheat-sheet-everything-you-need-to-know/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "The best Black Friday deals in the UK under £50: board games, thermal flasks and a viral eye cream",
    "domain": "science",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 19:00:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "The Verge"
    ],
    "domains": [
      "theguardian.com",
      "theverge.com"
    ],
    "snippets": [
      "Black Friday isn’t all about pricey electronics. Here are all our favourite 2025 deals under £50 • How to shop smart this Black Friday • The best Black Friday deals on the products we love Garmin watches and iPhones whose prices fall from insanely unaffordable to merely very expensive may be the hea",
      "Black Friday is the most anticipated day of the year for bargain hunters. Although we still have a day or two before November 28th, we’ve already found a healthy selection of early discounts, allowing you to get a jump on your holiday shopping. Right now, for instance, Apple’s entry-level AirPods 4"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c69508cef25a82a81a758c8fb3c2d0c149d78a9d/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=f2a2f02f37224e83bfec76f28a7a4a6f",
    "titles": [
      "The best Black Friday deals in the UK under £50: board games, thermal flasks and a viral eye cream",
      "The best Black Friday deals we’ve found on TVs, laptops, and more"
    ],
    "url": "https://www.theguardian.com/thefilter/2025/nov/26/best-black-friday-deals-under-50-uk",
    "alternate_urls": [
      "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/thefilter/2025/nov/26/best-black-friday-deals-under-50-uk",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.729,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hong Kong Apartment Fire Kills 36, Hundreds Missing in Tai Po Blaze",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 13:58:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Deadly blaze tears through Hong Kong residential high-rise buildings Reuters",
      "Global Affairs estimates there are about 300,000 Canadian citizens in Hong Kong, making them the biggest Canadian diaspora outside the United States."
    ],
    "image_url": "",
    "titles": [
      "Deadly blaze tears through Hong Kong residential high-rise buildings - Reuters",
      "Hong Kong Canadians reeling after deadly highrise inferno"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNMUtXS1pjSVA5TmczTWM0S01GZ084ZkdtWGd6MW40Wk1CXzcydExsdFdwbG5vd1ZWWHJQak5aN2gwTjBBaGpLMEg2UGMyWHFzaFgtRGJkUnpEb25JbFo3Mk1Id2hnNm1oMzV6MlQzNWZxN2Y3eVNiSDRwX2tmSjZNeFRxZ1kwNTZudnloUGlRZHpNTXVqRkI5ZkJvWnRBejBQX0xzMmpOLUpoVUd6Y3FYaE5jaw?oc=5",
    "alternate_urls": [
      "https://globalnews.ca/news/11545824/hong-kong-canadians-reeling-highrise-inferno/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNMUtXS1pjSVA5TmczTWM0S01GZ084ZkdtWGd6MW40Wk1CXzcydExsdFdwbG5vd1ZWWHJQak5aN2gwTjBBaGpLMEg2UGMyWHFzaFgtRGJkUnpEb25JbFo3Mk1Id2hnNm1oMzV6MlQzNWZxN2Y3eVNiSDRwX2tmSjZNeFRxZ1kwNTZudnloUGlRZHpNTXVqRkI5ZkJvWnRBejBQX0xzMmpOLUpoVUd6Y3FYaE5jaw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.656,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A massive fire broke out on Wednesday at the Wang Fuk Court residential complex in Hong Kong's Tai Po district, killing at least 36 people. The blaze spread rapidly, possibly due to bamboo scaffolding, and firefighters worked for hours to bring it under control. As of the latest reports, 279 people remain missing, and authorities are investigating the cause of the fire.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Artemis II Orion Spacecraft Stacked",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Wed, 26 Nov 2025 17:42 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "NASA’s Artemis II Orion spacecraft with its launch abort system is stacked atop the agency’s SLS (Space Launch System) rocket in High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Monday, Oct. 20, 2025. The spacecraft will carry NASA astronauts Reid Wiseman, Vic",
      "In this Oct. 20, 2025, photo, NASA’s Artemis II Orion spacecraft with its launch abort system is stacked atop the agency’s SLS (Space Launch System) rocket in the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida. Orion will carry NASA astronauts Reid Wiseman, Victor Glover, Christ"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/11/ksc-20251020-ph-kls01-0050orig-rotated.jpg",
    "titles": [
      "Artemis II Orion Spacecraft Stacked"
    ],
    "url": "https://www.nasa.gov/image-detail/afs-8-101-1215/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/artemis-ii-orion-spacecraft-stacked/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/afs-8-101-1215/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.709,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.592,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Multi-qubit nanoscale sensing with entanglement as a resource - Nature",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 26 Nov 2025 16:03:55 GMT",
    "source": "Nature",
    "sources": [
      "Nature"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Multi-qubit nanoscale sensing with entanglement as a resource Nature",
      "Entanglement-enhanced nanoscale single-spin sensing Nature"
    ],
    "image_url": "",
    "titles": [
      "Multi-qubit nanoscale sensing with entanglement as a resource - Nature",
      "Entanglement-enhanced nanoscale single-spin sensing - Nature"
    ],
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0xeERiT1pXSG41VHZBdGpuRnptRXUzZ3htem00WGJiNFprQnlOYzYtSW5UbWd1SlhGbUxId1JJVVcxMVU0bkQxaE1MbTZqY0VtaWs2dWhQRkhXMXVrckNB?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9UdE1HRjhNZGszNmV6c3VfZHJmWF9oVGQzNExmcFR0WWtja1UzazlENHlEYXVXWUN2SkNsdk1FLVRkZEgzSjRXbXpNNl9WYUNCVTJtVDhCTXRXMDBhcGZj?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0xeERiT1pXSG41VHZBdGpuRnptRXUzZ3htem00WGJiNFprQnlOYzYtSW5UbWd1SlhGbUxId1JJVVcxMVU0bkQxaE1MbTZqY0VtaWs2dWhQRkhXMXVrckNB?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.685,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  }
]