[
  {
    "title": "YouTube Settles Trump Lawsuit for $24.5M Over Account Suspension",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:16:56 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "The Verge",
      "Financial Post",
      "Financial Times",
      "Global News",
      "ABC News",
      "NPR",
      "CNBC",
      "Axios",
      "Business Insider",
      "Ars Technica"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com",
      "www.theverge.com",
      "www.businessinsider.com",
      "arstechnica.com",
      "www.ft.com",
      "news.google.com",
      "www.theguardian.com",
      "financialpost.com",
      "globalnews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "YouTube is the latest social media company to pay Trump tens of millions of dollars to resolve lawsuits brought before he returned to power. The money will fund a new ballroom at the White House.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE91QkZKM0YyVnFuZWxIV3N4U1Ewb2s0ampyMnk4VG1UMzBieVlFWmlSdHJ1OVdJZmUyc3BpcFpXU29Ha0pfTmJmZlJsRm51SjBraTBBQ3hSZkRBT1piRUhxVF9VTjdxYUdMVXktX0NfRW9kMGRQb2VBTTgwWDZZTEk?oc=5\" target=\"_blank\">YouTube to pay Trump $22 million for suspending his acco",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump after he was suspended from the platform in 2021, a court filing shows.",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit involving the suspension of President Donald Trump's account in 2021.",
      "US president sued Google’s video platform after it blocked him from posting following the 2021 attack on the US Capitol",
      "<p>Platform suspended the US president’s YouTube channel in 2021 after the January 6 Capitol riot</p><p>YouTube has agreed to pay $24.5m to settle a suit brought by Donald Trump in 2021 that alleged the platform wrongly suspended his channel after the January 6 attack on the US Capitol. The Google s",
      "Google is the latest tech company to settle lawsuits brought by Trump over his 2021 suspension from platforms in the aftermath of the Jan. 6, 2021, attack on the U.S. Capitol.",
      "In total, YouTube will pay $24.5 million to settle the suit brought by President Donald Trump.",
      "YouTube has settled a lawsuit President Donald Trump filed against the company in 2021, according to The Wall Street Journal. Trump filed sweeping lawsuits against Google-owned YouTube, Meta (then Facebook), and X (then Twitter) after he was suspended from the platforms, and now all three companies ",
      "Google&#8217;s YouTube has agreed to pay $24.5 million to settle a lawsuit President Donald Trump brought after the video site suspended his account following the Jan. 6, 2021 attacks on the Capitol following the election that resulted in him leaving the White House for four years. The settlement of",
      "Alphabet settles with Trump instead of fighting lawsuit over January 6 suspension."
    ],
    "image_url": "",
    "titles": [
      "YouTube agrees to pay Trump $24 million to settle lawsuit over Jan. 6 suspension",
      "YouTube to pay Trump $22 million for suspending his account after Jan. 6 riot - Axios",
      "YouTube agrees to pay $24.5 million to settle Trump lawsuit: Court filing",
      "YouTube agrees to pay Trump $24.5 Million to settle lawsuit over suspended account",
      "YouTube pays $24.5mn to settle Trump censorship lawsuit",
      "YouTube agrees to pay Trump $24.5m to settle lawsuit over account suspension",
      "YouTube will pay US$24.5M to settle Trump lawsuit over 2021 suspension",
      "YouTube to pay $22 million to Trump to settle post-January 6 ban case",
      "YouTube caves to Trump with $24.5 million settlement",
      "YouTube to pay $24.5 million to settle lawsuit over Trump’s account suspension after Jan. 6 attack",
      "Trump obtains another settlement as YouTube agrees to pay $24.5 million"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.981,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.871,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump, stemming from the suspension of his account after the January 6, 2021 Capitol riot. This agreement resolves the legal dispute over the platform's decision to block Trump in the aftermath of the Capitol attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 23:10:09 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Financial Times",
      "TechCrunch",
      "CNBC",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "www.ft.com",
      "news.google.com",
      "www.theguardian.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQNXljdkdjNnJfS1hfRXdIWDVGX3RTdHMwelVPbFhTSmhid3hmb1ZwUmMyUC10UDFfQ2JDWUJ1aW5KNkNUOW1rWk1aSEdtc2lHNmd4TnBILUZHbm14UER0MVgxdFF6NzdpQW5QcXR6UXBKZndLQnVUSjhWdXpLUXJoM3NlLUctNVVjdnV1akxn?oc=5\" target=\"_blank\">Charlie Javice sentenced to 7 years",
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "Frank founder sold student aid start-up to the US bank for $175mn in 2021 but lied about its user base",
      "<p>Javice was convicted for defrauding JPMorgan Chase into buying her college financial aid startup Frank for $175m</p><p>Charlie Javice, the entrepreneur convicted for defrauding <a href=\"https://www.theguardian.com/business/jpmorgan\">JPMorgan</a> Chase into buying her college financial aid startup",
      "Charlie Javice got a 7-year prison sentence for defrauding JPMorgan Chase in the $175M sale of her fintech startup Frank.",
      "The fintech startup had been acquired by JPMorgan Chase in 2021 for $175 million. The bank later accused Frank of lying about its customer base."
    ],
    "image_url": "",
    "titles": [
      "Charlie Javice sentenced to 7 years in prison for defrauding JP Morgan - Axios",
      "Startup founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Charlie Javice sentenced to 7 years in prison for JPMorgan fraud",
      "Entrepreneur Charlie Javice sentenced to over seven years for defrauding JPMorgan",
      "Charlie Javice sentenced to 7 years in prison for JPMorgan Chase fraud",
      "Frank founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.958,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Javice, founder of the financial aid platform Frank, was sentenced to over seven years in prison for defrauding JPMorgan Chase. Convicted of exaggerating her startup's user base, she misled the bank into purchasing Frank for $175 million in 2021.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Probes Church Attack; Trump Proposes Gaza Peace Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 07:11:39 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Financial Times",
      "Al Jazeera",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.dw.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "The FBI is searching for answers as to why a man drove his truck into a church yesterday and opened fire. And, Trump has a new proposed plan to end the war in Gaza.",
      "Officials have not yet named a motive for the shooter or the names of the four people killed.",
      "The White House says its proposal would end the war on Gaza immediately if both sides accept.",
      "Israel&#039;s Benjamin Netanyahu has said he supports US President Trump’s 20-point plan to end the war on Gaza.",
      "US President Donald Trump has outlined a plan to end Israel’s war on Gaza.",
      "President says Israel has &#039;full backing&#039; of US, may take steps to defeat Hamas if it doesn&#039;t accept proposed peace deal.",
      "Donald Trump's proposed plan to end the war in Gaza will be discussed with Israeli Prime Minister Benjamin Netanyahu on Monday. So what exactly is in the 21-point plan?",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSVhtd2RYb01zVU9QY256RGtvTmZ0blNiYVg0XzJPTEhCVEF0WkZxWnNPa0E2ZUhjR3FPQmdrX3UwbVNIeDEzNVhvbi1jeFV6MzhQVnJrMkxuRUZXWURDRk5XNk5MX0tCSExTRnB0YW4zSWxWRHhXTzRQQWk?oc=5\" target=\"_blank\">Netanyahu endorses Trump plan to end Gaza war</a>&nbsp;&nbsp",
      "The White House published its plan ahead of a press conference with Israeli Prime Minister Benjamin Netanyahu"
    ],
    "image_url": "",
    "titles": [
      "The latest on the Michigan church shooting. And, Trump's new plan to end war in Gaza",
      "What we know about Michigan church shooting and arson attack",
      "Here’s the full text of Trump’s 20-point plan to end Israel’s war on Gaza",
      "Netanyahu says he supports Trump’s plan to end war on Gaza",
      "Trump outlines plan to end Israel’s war on Gaza",
      "Trump proposes 20-point plan to end war in Gaza",
      "What is Donald Trump's 21-point plan to end Gaza war?",
      "Netanyahu endorses Trump plan to end Gaza war - Axios",
      "Full text of Trump’s proposal to end the war in Gaza"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.762,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is investigating an incident where a man drove his truck into a church and began shooting. Meanwhile, Donald Trump has proposed a 21-point plan aimed at ending the war in Gaza, which he will discuss with Israeli Prime Minister Benjamin Netanyahu on Monday. The specifics of the plan are yet to be detailed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Back Plan to End Gaza War; US to Boost Coal Output",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 22:06:46 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The US and Israeli leaders said they have agreed a peace plan for Gaza and warned Hamas to accept it.",
      "US President Donald Trump said that many Arab nations support his plan to end the nearly two-year-long war in Gaza. He and Israeli Prime Minister Benjamin Netanyahu called on Hamas to accept the plan. Follow DW for more.",
      "Proposal calls for an immediate end to the conflict and the release of all remaining hostages",
      "<p>Plan calls for immediate end to war between Israel and Hamas but lacks detail on how key points will be executed</p><p>The White House peace plan for Gaza proposes an immediate end to the devastating war between Israel and Hamas that has raged in the coastal territory for nearly two years, while ",
      "<p>Pair say proposal represents new chapter but Israeli PM threatens to ‘finish the job’ if Hamas officials fail to agree</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> and <a href=\"https://www.theguardian.com/world/benjamin-netanyahu\">Benjamin Netanyahu</a>, the Is"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/24db/live/d493b3f0-9d8b-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Trump and Netanyahu agree new US peace plan for Gaza",
      "Middle East: Trump, Netanyahu call for Hamas to accept plan",
      "Netanyahu says Israel backs Trump’s peace plan for Gaza",
      "What’s in Trump’s 20-point peace plan for Gaza?",
      "Trump and Netanyahu to Hamas: accept Gaza peace plan or face consequences"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.937,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have endorsed a plan aimed at ending the nearly two-year-long war in Gaza, with Trump stating that many Arab nations also support the initiative. However, for the plan to proceed, Hamas must agree to it. Additionally, the US plans to announce policies to increase coal output.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: initiative, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Warns of Shutdown Amid Funding Deal Dispute, Coal Policy Looms",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 18:28:37 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "Financial Times",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.ft.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "After a meeting with congressional leaders at the White House on Monday, Vice President Vance says \"I think we're headed to a shutdown.\"",
      "Democrats have insisted that any short-term funding deal to avoid a shutdown of the U.S. government include an extension of enhanced Obamacare subsidies.",
      "Federal funding set to run out on Wednesday morning unless lawmakers reach agreement",
      "<p>Congressional leaders meet with Trump over government shutdown as vice-president reportedly says Democrats ‘won’t do’ the right thing</p><p><strong>Trump officials to announce plan to boost coal output</strong></p><p>The US is set to announce on Monday policies <strong>to try to boost the output "
    ],
    "image_url": "https://s.abcnews.com/images/US/repub-1-ap-gmh-250929_1759179668490_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Vance says 'we're headed to a shutdown'",
      "'We're headed to a shutdown,' Vance says after Trump meeting with leaders ends",
      "Vance warns US government is ‘headed to a shutdown’",
      "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – live"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.964,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After a meeting with congressional leaders, Vice President Vance indicated a potential government shutdown due to disagreements over a short-term funding deal, particularly Democrats' demand for an extension of enhanced Obamacare subsidies. Federal funding is set to expire on Wednesday unless an agreement is reached. Concurrently, Trump officials plan to announce policies to increase coal output.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madagascar Protests: 22 Dead, President Dissolves Government",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 22:42:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The demonstrations, which started over deteriorating living conditions, have left 22 people dead, according to the UN.",
      "At least 22 people were killed after protests broke out power cuts, water shortages and widespread poverty. The youth-led protesters named their movement Gen Z.",
      "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power ",
      "Andry Rajoelina, the leader of the island nation in Africa, acknowledged grievances over power cuts and water shortages that have drawn thousands of young people to the streets."
    ],
    "image_url": "",
    "titles": [
      "Madagascar president dissolves government after youth-led deadly protests",
      "Madagascar president fires government after Gen-Z protests",
      "Madagascar’s president dissolves government amid youth-led protests",
      "Madagascar’s President Dissolves Government Amid Deadly Protests"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.969,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Madagascar, protests led by the youth movement \"Gen Z\" over severe water and power shortages and escalating poverty resulted in at least 22 fatalities, as reported by the UN. The widespread demonstrations prompted President Andry Rajoelina to dissolve the government in response to the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nuno Espirito Santo's West Ham Debut Ends in 1-1 Draw with Everton",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 21:28:11 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "footballtoday.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Watch Premier League highlights as new West Ham United manager Nuno Espirito Santo earns a draw at Everton in his first match in charge.",
      "West Ham manager Nuno Espirito Santo admitted his side still have much to learn after their 1-1 draw against Everton at the Hill Dickinson Stadium.It was the Portuguese first Premier League game in ch...",
      "Jarrod Bowen kicks off the Nuno Espirito Santo era in style",
      "<p>Only 20 days after <a href=\"https://www.theguardian.com/football/2025/sep/09/nottingham-forest-part-company-with-head-coach-nuno-espirito-santo\">his sacking by Nottingham Forest</a>, Nuno Espírito Santo was <a href=\"https://www.theguardian.com/football/2025/sep/27/graham-potter-sacked-by-west-ham",
      "FREE TO WATCH: Highlights from Everton&#8217;s match against West Ham in the Premier League."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9dd1/live/62fbb780-9d7a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Bowen earns new West Ham boss Nuno draw at Everton",
      "Nuno admits West Ham still learning after Everton draw",
      "'The man for West Ham, AGAIN!' | Bowen kicks off the Nuno era in style",
      "Bowen hits back at Everton to secure point for West Ham in Nuno’s first game",
      "Bowen snatches first point for Nuno’s West Ham!"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.925,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nuno Espirito Santo began his tenure as West Ham United manager with a 1-1 draw against Everton in his first Premier League match in charge. This comes only 20 days after his departure from Nottingham Forest. In the match at the Hill Dickinson Stadium, Jarrod Bowen scored, marking a promising start under Santo's leadership. Despite the draw, Santo acknowledged that his team has much to learn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 19:20:43 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Phone and internet connections are down nationwide after the Taliban cut fibre-optic connections to prevent \"immorality\".",
      "On orders from the ruling Taliban, Afghanistan's telecommunications authorities have capped fiber optic internet access. It is unclear how long telephone and cellular networks will be affected, or to what degree.",
      "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide ",
      "The shutdown came two weeks after the ruling Taliban cut off the internet in half a dozen provinces, saying they wanted to prevent “immoral acts.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0203/live/f08a4b00-9d68-11f0-a16f-ff7724a733bf.jpg",
    "titles": [
      "Afghanistan telecom blackout as Taliban shuts off internet",
      "Afghanistan: Taliban shuts down internet indefinitely",
      "Afghanistan hit by communications blackout after Taliban shuts internet",
      "Afghanistan Has Nationwide Internet Blackout, Monitors Say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.885,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sirianni Addresses A.J. Brown's Cryptic Tweet Amid Performance Queries",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 18:37:22 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Eagles coach Nick Sirianni, asked about A.J. Brown's cryptic tweet following Sunday's game, said he believes Brown wants to remain in Philadelphia.",
      "Brown posted a bible verse on social media after a puzzling four-game stretch",
      "A.J. Brown is apparently unhappy with his role as the Eagles win. This prompted questions for Sirianni on Monday."
    ],
    "image_url": "",
    "titles": [
      "Sirianni: Brown's desire is to remain with Eagles",
      "Eagles' Nick Sirianni responds to A.J. Brown's cryptic post: 'I question nothing about his desire to be here'",
      "Nick Sirianni responds to A.J. Brown post implying he's not happy with his role amid 4-0 Eagles start: 'He wants to contribute'"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.967,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eagles coach Nick Sirianni addressed concerns about A.J. Brown's cryptic tweet, which followed a perplexing four-game performance. Despite speculation of unhappiness due to his role amid the team's victories, Sirianni believes Brown wants to stay in Philadelphia. The tweet in question featured a bible verse, sparking inquiries about Brown's contentment with the Eagles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 13:30:10 -0400",
    "source": "ABC News",
    "sources": [
      "Global News",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Top Congressional leaders are at the White House on Monday to meet with President Donald Trump in a last-ditch effort to avert a government shutdown.",
      "<p>Democrats strike optimistic tone after high-stakes meeting but Republicans accuse rivals of ‘hostage-taking’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\">US politics – latest updates</a></p></li></ul",
      "Lawmakers were locked in an impasse with 24 hours remaining before funding expires, as Democrats demanded legislation to extend health care benefits that Republicans oppose."
    ],
    "image_url": "https://s.abcnews.com/images/US/250929_abc_social_shutdown_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Trump to meet with top Democrats as shutdown looms",
      "Trump talks with Democrats fail to yield breakthrough as US shutdown nears",
      "U.S. government shutdown nears after Democrats, Republicans meet with Trump"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.869,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Labels Bishnoi Gang as Terrorist, Seizes Assets",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:17:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The move will enable asset seizures and prosecutions of Bishnoi gang that has been accused of targeting Sikh activists.",
      "Canada has listed the Bishnoi gang as a terrorist entity, following calls from Conservative and NDP politicians. The listing bars Canadians from financing or aiding the group led by Lawrence Bishnoi, the gang&#8217;s leader in India, who has reportedly coordinated criminal activities from a cellphon",
      "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimida"
    ],
    "image_url": "",
    "titles": [
      "Canada labels India’s Bishnoi gang as ‘terrorist’ organisation",
      "Canada lists the Bishnoi gang as a terrorist entity",
      "Canada designates Indian gang linked to high-profile killings as terrorist entity"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.865,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada has officially designated the India-based Bishnoi gang as a terrorist entity, led by Lawrence Bishnoi. This action enables Canadian authorities to seize property and freeze accounts associated with the gang. The decision follows advocacy from Conservative and NDP politicians, aiming to prevent Canadians from financially supporting or assisting the group's criminal activities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Sonnet 4.5 AI, Masters Coding with Business Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "fortune.com"
    ],
    "snippets": [
      "Claude Sonnet 4.5 is better at coding, using computers and meeting practical business needs.",
      "Anthropic’s latest Claude model, Sonnet 4.5, shows gains in coding and autonomous task completion.",
      "Anthropic says its new AI model is robust enough to build production-ready applications, rather than just prototypes."
    ],
    "image_url": "",
    "titles": [
      "Anthropic launches Claude Sonnet 4.5, its latest AI model that's 'more of a colleague'",
      "Anthropic releases Claude Sonnet 4.5, a model it says can build software and accomplish business tasks autonomously",
      "Anthropic launches Claude Sonnet 4.5, its best AI model for coding"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic introduced Claude Sonnet 4.5, an AI model they claim is the best for coding tasks, emphasizing its practical business applications. It autonomously coded a chat app similar to Slack or Teams, producing 11,000 lines of code in 30 hours. The company highlights the model's capability to create production-ready applications, marking a significant advancement in applied artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario College Strike Continues Over Job Security Dispute",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 20:58:29 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "On Monday, both the Ontario Public Service Employees Union and the College Employer Council confirmed talks between the two sides had broken down without any sign of a deal.",
      "Algonquin College and La Cité support staff remain on strike after employer 'refused progress on job security provisions,' says union."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/CP174751442.jpg?quality=65&strip=all",
    "titles": [
      "Talks break down between Ontario colleges, union with strike in 3rd week",
      "Ontario college strike to continue after talks break down"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.709,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Negotiations between the Ontario Public Service Employees Union and the College Employer Council have stalled, leading to a continued strike by support staff at Algonquin College and La Cité. The union cites the employers' refusal to address job security provisions as the main issue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India Wins Asia Cup T20 Final; Refuses Trophy from Pakistan Minister",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:18:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "From tournament format to venues and top players to watch, here&#039;s Al Jazeera&#039;s guide to the Women&#039;s Cricket World Cup.",
      "India won the Asia Cup Twenty20 final by five wickets in Dubai on Sunday, but refused to collect the championship trophy from Pakistan's interior minister.",
      "Months after a military conflict, a cricket tournament brought the Indian team three victories over its fiercest rival but few signs of an easing in bitterness."
    ],
    "image_url": "",
    "titles": [
      "ICC Women’s World Cup 2025: Teams, schedule, tickets, India vs Pakistan",
      "Asia Cup 2025: India, Pakistan cricket teams spar",
      "India-Pakistan Tensions Lead to Trophy-Less Cricket Final at Asia Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.831,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "India won the Asia Cup Twenty20 final against Pakistan by five wickets in Dubai. The Indian team controversially refused to collect the championship trophy from Pakistan's interior minister, citing political tensions. This incident occurred after the Indian leader referred to the victory as an extension of 'Operation Sindoor'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets' Dylan Samberg to Miss Season Start After Preseason Injury",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 22:12:36 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Following Saturday night&#8217;s 4-2 preseason win over the Calgary Flames, Winnipeg Jets head coach Scott Arniel described Dylan Samberg having to leave the game early in the second period as a result of a &#8220;freak injury.&#8221; On Monday afternoon, the Jets bench boss added some clarity to th",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNUUVfdm9XVm01enJ3RVZLWnVxd3RaNk1BRzRCTjAyc2dTMGRXaVpYOGVuODN2M0FnMnZqV3pYTlJLa2xJYkpWOURqVHdPOTNRZlFrTENPNzFlTk5JWElZb1BkclA0VjY2LVZOSHY2RU8xb0d4Zi04VnNPd0dwcHBhNFZjaEJmNGE5MzlSXw?oc=5\" target=\"_blank\">Samberg to miss start of season for J"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/02/20250201210252-20250201210252-679ede6a4c0c9718003f8150jpeg.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets D-man Dylan Samberg out 6-8 weeks with a broken wrist",
      "Samberg to miss start of season for Jets with broken wrist - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.697,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Winnipeg Jets' Dylan Samberg suffered a \"freak injury\" during a preseason game against the Calgary Flames, leading to an early exit. Coach Scott Arniel later confirmed that Samberg will miss the start of the season due to the injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ingram Prioritizes Raptors' Success Over Personal Validation",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 20:50:42 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Brandon Ingram doesn't want the validation of basketball fans.",
      "<p>Toronto Raptors forward Brandon Ingram discusses what he&#8217;s looking forward to in his first full season with his new team, and why he&#8217;s not looking to prove anyone wrong as he tries to help the Raptors put together a winning season.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2019/03/raw_3b5q_sports_article_raptors_a1.png",
    "titles": [
      "Ingram itching to start playing with Raptors",
      "Raptors’ Ingram wants ‘fresh start’, but not trying to prove himself"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Brandon Ingram, now with the Toronto Raptors, is focused on contributing to a successful season rather than seeking validation from fans. He expressed this as he looks forward to his first full season with the team, emphasizing his commitment to the team's success over individual acknowledgment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US-Proposed Peace Plan for Gaza Gains Support, Uncertainty Remains",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 23:02:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Palestinian Authority joins regional leaders in welcoming US president&#039;s 20-point peace plan to end war in Gaza.",
      "<p>The US president has won regional backing, but Hamas’s response and Israel’s intentions leave the outcome in doubt</p><p>At first glance, the 20-point plan outlined by President Trump and agreed by Benjamin Netanyahu appears more likely to end the two-year conflict in Gaza than anything we have s"
    ],
    "image_url": "",
    "titles": [
      "Trump’s Gaza peace plan welcomed by Arab and Islamic countries, the West",
      "Trump’s plan for Gaza is ambitious but peace is far from guaranteed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Palestinian Authority and regional leaders have endorsed a 20-point peace plan proposed by US President Trump to end the two-year conflict in Gaza. The plan, supported by Benjamin Netanyahu, aims to bring peace, but the responses from Hamas and the intentions of Israel remain uncertain, casting doubt on the plan's effectiveness.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Unveils 21-Point Plan Against Hamas with Israel's Support",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:46:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Trump&#039;s 21-point plan is said to have Netanyahu on board, but Hamas says it&#039;s not received any proposal yet.",
      "Prime Minister Benjamin Netanyahu said he supported the proposal, and Mr. Trump said Israel would have his “full backing” to destroy Hamas if the militant group did not agree to its terms. Hamas said it was not consulted on the plan."
    ],
    "image_url": "",
    "titles": [
      "What is the Trump plan for Gaza and will it work?",
      "Live Updates: Trump Releases Gaza Plan and Says Hamas Must Accept It"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump announced a 21-point plan to address the threat of Hamas, with Israeli Prime Minister Benjamin Netanyahu's support. Trump stated Israel would have his \"full backing\" to act against Hamas if they reject the proposal. However, Hamas claims they have not been consulted about the plan.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-UK PM's Role in Palestinian Affairs Stirs Labour Party Disbelief",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 23:11:19 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Some in former UK prime minister’s Labour party react with incredulity at his proposed role in Palestinian territory",
      "For the former British prime minister, the Middle East is one of the most consistent, if contentious, chapters in a busy post-Downing Street career."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F793653da-53aa-450f-83fa-648667c9244b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Tony Blair set to serve on Trump’s ‘Board of Peace’ for Gaza",
      "Tony Blair Emerges as Potential Figure in Postwar Gaza"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A former UK Prime Minister's potential involvement in Palestinian territory has elicited disbelief among some members of his Labour Party. This development is part of his ongoing engagement with Middle Eastern affairs, which has been a significant yet controversial aspect of his career after leaving office.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Enacts AI Transparency Law, Mandates Safety Disclosures",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-29T19:01:43-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Senate Bill 53, the landmark AI transparency bill that has divided AI companies and made headlines for months, is now officially law in California.&#160; On Monday, California Gov. Gavin Newsom signed the “Transparency in Frontier Artificial Intelligence Act,” which was authored by Sen. Scott Wiener",
      "SB 53 requires large AI labs – including OpenAI, Anthropic, Meta, and Google DeepMind – to be transparent about safety protocols. It also ensures whistleblower protections for employees at those companies."
    ],
    "image_url": "",
    "titles": [
      "SB 53, the landmark AI transparency bill, is now law in California",
      "California Governor Newsom signs landmark AI safety bill SB 53"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "California Governor Gavin Newsom signed Senate Bill 53, the \"Transparency in Frontier Artificial Intelligence Act,\" into law. Authored by Sen. Scott Wiener, the legislation mandates large AI labs like OpenAI, Anthropic, Meta, and Google DeepMind to disclose their safety protocols and provides whistleblower protections for their employees. This landmark bill aims to increase transparency in the AI industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 21:02:26 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQNUxnUXRpSVRLdlZPY0gzS3NxeTBqZFBNS1ltY0JIUnJXZ1Btemp5MGZOUXlUVy0wRXAzNGZoUGVPQS15Qy1ZYkJUWHZoaXA5NFNtTmRGNEJfajZJRjRGb191Tlh3c1N5YXE1VDhDRDNPNzhwYVFydmVYRUQzMlhJZmpMX2JmZzVmSmw4S3d1TkYySVk2REZnUDlR?oc=5\" target=\"_blank\">Trump, Democrats le",
      "President Donald Trump and congressional leaders from both parties are set to meet at 3 p.m. for 11th hour talks."
    ],
    "image_url": "",
    "titles": [
      "Trump, Democrats leave meeting without deal to avoid government shutdown - Axios",
      "Democrats refuse to cave on health care before meeting with Trump on government shutdown"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins vs. Broncos: Denver Opts for All-Blue Uniforms on MNF",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 23:09:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "broncoswire.usatoday.com"
    ],
    "snippets": [
      "You might not recognize the Dolphins on Monday night",
      "The Broncos wore an all-blue uniform on 'Monday Night Football.' Do you like the look?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/29/703dc55e-22de-453f-b6ba-6c266d142f65/tua-tagovailoa.jpg",
    "titles": [
      "Dolphins wearing new dark water 'Rivalries' uniform on 'Monday Night Football' vs. Jets",
      "Twitter reacts to Broncos' alternate uniform for 'Monday Night Football'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Miami Dolphins and the Denver Broncos played on 'Monday Night Football,' with the Broncos opting for an all-blue uniform for the game. The change in attire was notable, prompting discussions on the look's appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Malik Nabers Suffers Season-Ending ACL Tear",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 21:38:17 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The second-year star went down during Jaxson Dart's first career start",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBWX1BmajhXQVpYWVNWRmlYVFlvaFZraGxUUld3eFRRTjV5MXpIZHUxcG9SZ2oycDI5R0paRDFYNFhVbndxOHlISVRXWFRvNHBEcmhMM1VQdGhQUVVlLUd1MVRsT0lhUmU3SXo2aGw3em9pNVJFWEpv?oc=5\" target=\"_blank\">Malik Nabers Injury Update: Giants Star Out for Season With Torn AC",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPallUYlNoT3lGU3doWEY4c1F2V01NOUJ4VzZPaFFjYUlPYV83X0lhU2VDT2k0R3NGT19FY2gxZVh0dDlweFNhVktIVlF3NHpkVlJlV0RlTENLNTNGbVBITVZ0WEQyaTNSWVNlNGJXdExVVS1LcVdwRlJsUTdtQS1UbUFTZEJ6N0EwdkZKWTFB?oc=5\" target=\"_blank\">Malik Nabers Shares Sad Instagram P"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/28/b532c97f-37dc-4cbb-9452-654adefdc4ef/malik-nabers-cart.jpg",
    "titles": [
      "Malik Nabers injury update: Giants star WR suffered torn ACL against Chargers, placed on season-ending IR",
      "Malik Nabers Injury Update: Giants Star Out for Season With Torn ACL - Sports Illustrated",
      "Malik Nabers Shares Sad Instagram Post After Season-Ending ACL Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "An MRI on Monday confirmed that Malik Nabers, the Giants' standout wide receiver, has suffered a torn ACL, ending his season. This was reported across multiple news sources, including a personal update from Nabers on Instagram, expressing his disappointment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Seeks Western Missiles to Prompt Moscow Peace Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:25:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Vance's comments come as Ukraine's deputy defence minister tells the BBC Western weapons could force Moscow to start peace talks.",
      "Tomahawk cruise missiles, which have a range of at least 1,500 miles, would boost Ukraine’s ability to hit deep inside Russia, including Moscow."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1108/live/f4cd3df0-9d3e-11f0-973f-51ea2fc41b54.jpg",
    "titles": [
      "Trump considering supplying Ukraine with long-range missiles, Vance says",
      "U.S. considers Ukraine’s request for long-range Tomahawk missiles"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukraine's deputy defense minister stated to the BBC that Western weapons, including Tomahawk cruise missiles with a range of at least 1,500 miles, could compel Moscow to initiate peace talks. These missiles would enhance Ukraine's capability to strike targets deep within Russia, including Moscow.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Owner Apologizes for Playoff Miss After Season Slump",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:17:57 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9XODZJZWRyS2pfdklmX096d1kwbGZCVnBxbEZ5VmVKWXl5ejlKUmtMM2UteHJoQmM0MXFqcVNVcDZlUDNZMk1oWS1kS2NPUHpMLUxNQkVoMUVndzdjVENteTFhQ3prdnlUOWc?oc=5\" target=\"_blank\">Mets Owner Steve Cohen Posts Apology to Fans After New York Misses Playoffs</a>&nbsp",
      "<p>Despite holding MLB&#8217;s best record at one point, the New York Mets slumped down the stretch and missed the post-season entirely. Now, owner Steve Cohen is issuing an apology to fans.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mets Owner Steve Cohen Posts Apology to Fans After New York Misses Playoffs - Sports Illustrated",
      "Mets owner Steve Cohen apologizes to fans after late-season collapse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.848,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Mets, after having the best record in baseball on June 12, experienced a significant slump and missed the playoffs. Mets owner Steve Cohen has issued an apology to fans for the team's disappointing performance and failure to reach the post-season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Model Capable of 30-Hour Autonomous Operation",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:00:47 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SMkpRU0ZzVks1d2Vrd0xqeTFSYTZoakwxSWlkV0JkRzl6c1owZ2k0cTVnYzQyTUxLV3Z0dHNiLWNfQV9iYkswX1A1U0pqbm8ydmpyRnF0Y2RuRWhfSGhOQUZWaG43QlljTmx2eFdrRzdNQzRjQXVYcg?oc=5\" target=\"_blank\">Anthropic's latest Claude model can work for 30 hours on its own<",
      "Latest Claude model beats OpenAI and Google on coding tests."
    ],
    "image_url": "",
    "titles": [
      "Anthropic's latest Claude model can work for 30 hours on its own - Axios",
      "Anthropic says its new AI model “maintained focus” for 30 hours on multistep tasks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SMkpRU0ZzVks1d2Vrd0xqeTFSYTZoakwxSWlkV0JkRzl6c1owZ2k0cTVnYzQyTUxLV3Z0dHNiLWNfQV9iYkswX1A1U0pqbm8ydmpyRnF0Y2RuRWhfSGhOQUZWaG43QlljTmx2eFdrRzdNQzRjQXVYcg?oc=5\" target=\"_blank\">Anthropic's latest Claude model can work for 30 hours on its own<",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Volunteer Apps Close Tonight; Baiju Bhatt to Speak",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "If you’ve been thinking about applying to volunteer at TechCrunch Disrupt 2025, this is it — applications close tonight at 11:59 p.m. PT. Only accepting local Bay Area applicants.",
      "Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, shares insights on building transformative companies in fintech and aerospace at TechCrunch Disrupt 2025."
    ],
    "image_url": "",
    "titles": [
      "Final day to apply: Volunteer at TechCrunch Disrupt 2025",
      "From Robinhood to Aetherflux: Baiju Bhatt’s next frontier at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.825,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Applications for volunteering at TechCrunch Disrupt 2025 close tonight at 11:59 p.m. PT, and only local Bay Area applicants are eligible. In related news, Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, will speak at the event, sharing insights on creating transformative companies in fintech and aerospace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]