[
  {
    "title": "Spotify Founder Daniel Ek to Step Down as CEO, Become Chairman",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 14:46:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC",
      "The Guardian",
      "TechCrunch",
      "Forbes"
    ],
    "domains": [
      "www.cnbc.com",
      "www.bbc.com",
      "www.theguardian.com",
      "techcrunch.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The billionaire will remain involved in the company as executive chairman.",
      "Spotify's CEO Daniel Ek is set to step down in January next year and move to the role of Executive Chairman, the company said on Tuesday.",
      "<p>Ek founded Stockholm-based music streaming company nearly two decades ago and will stay on as executive chair</p><p><a href=\"https://www.theguardian.com/technology/spotify\">Spotify</a> said Tuesday that founder Daniel Ek is stepping down as CEO to become the executive chair.</p><p>The Stockholm-b",
      "The audio-streaming platform reported its first full-year profitability last year after expanding to podcasts and audiobooks.",
      "The company is replacing Daniel Ek with two co-CEOs: Gustav Söderström, currently co-president, and chief product and technology officer; and Alex Norström, co-president and chief business officer."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10e3/live/ee7179b0-9e03-11f0-8750-d1ef73f551ff.jpg",
    "titles": [
      "Spotify founder Daniel Ek to step down as chief executive",
      "Spotify founder Daniel Ek stepping down as CEO, company names co-CEOs to replace him",
      "Spotify founder Daniel Ek steps down from CEO role",
      "Spotify Shares Dip 4% After Founder Daniel Ek Exits As CEO",
      "Spotify’s founder and CEO Daniel Ek is stepping down"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.95,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Daniel Ek, founder of Spotify, will step down as CEO in January to become Executive Chairman. Spotify, which achieved its first full-year profitability last year, will appoint Gustav Söderström and Alex Norström as co-CEOs. Ek founded the Stockholm-based music streaming company nearly two decades ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labour Unveils Tax Strategy, Albanese Endorses Gaza Peace Plan Excluding Hamas",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:12:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "CityNews",
      "The Guardian",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "European and Middle Eastern leaders have welcomed a new US peace plan for Gaza, as President Donald Trump warned Hamas to accept it.",
      "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu say they agree on a new Gaza peace deal.",
      "Qatar says that it is ‘truly optimistic’ about US President Donald Trump’s Gaza peace plan.",
      "<p>Israeli media and politicians broadly supportive while far right and Islamic Jihad voice scepticism</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live\">Middle East crisis – live updates</a></p>",
      "Hamas has not commented on President Donald Trump’s ceasefire proposal, which Netanyahu said would include the release of all Israeli hostages but keep Israeli forces in most of Gaza.",
      "<p>Anthony Albanese applauds commitment to denying Hamas a role in any future governance of Gaza, and urges Hamas to agree to the terms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussa",
      "OTTAWA — Prime Minister Mark Carney says Canada welcomes U.S. President Donald Trump&#8217;s &#8220;historic new Middle East peace plan,&#8221; which Washington has asked Ottawa to sell to other nations. Trump&#8217;s plan to put the Gaza Strip and its 2.1 million Palestinians under an international",
      "Donald Trump revealed a proposed plan to end the war in Gaza during Israeli Prime Minister Benjamin Netanyahu's visit to the White House. What exactly is in the 20-point plan?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/43b9/live/c404dca0-9dc0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump's 20-point peace plan in full",
      "Key takeaways from US President Trump’s ‘Gaza peace plan’",
      "Qatar ‘optimistic’ about Trump’s Gaza peace plan",
      "Hamas mulls options as countries rush to welcome Trump’s Gaza peace plan",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "‘There is hope’: Australia welcomes Trump’s 20-point peace plan for Gaza",
      "PM Carney welcomes Trump’s peace plan proposal for Israel and Gaza",
      "What is Donald Trump's 20-point plan to end Gaza war?"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.795,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Labour's tax strategies for the upcoming Budget and a 20-point Gaza peace plan are highlighted in recent news. Anthony Albanese has endorsed the exclusion of Hamas from future governance in Gaza and calls for Hamas to accept the peace terms.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland Detains Ukrainian Over Nord Stream Blasts; Drone Kills 4 in Ukraine",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 13:43:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The man, named as Volodymyr Z, was detained in the early hours of Tuesday near Warsaw.",
      "The diver, identified as Volodymyr Z, held for 2022 explosions that largely severed Russian gas supplies to Europe.",
      "Authorities in Poland detained a Ukrainian man wanted on a European arrest warrant in Germany. Meanwhile, a Russian drone attack killed a family of four in Ukraine's Sumy region, a military official says. DW has more.",
      "<p>Man held in Poland on suspicion of causing explosions that damaged undersea pipelines between Russia and Germany</p><p>Germany is seeking to extradite a Ukrainian man arrested in Poland on suspicion of diving down to the Baltic sea bed to plant explosives in the 2022 Nord Stream gas pipeline atta"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1fd5/live/143c4a80-7e7e-11f0-9e05-3dbec5559644.jpg",
    "titles": [
      "Ukrainian wanted over Nord Stream pipeline blasts arrested in Poland",
      "Ukrainian diver with alleged links to Nord Stream attack detained in Poland",
      "Ukraine updates: Second Nord Stream suspect detained",
      "Ukrainian detained in Poland over 2022 Nord Stream gas pipeline explosions"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.93,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Polish authorities detained Ukrainian man Volodymyr Z near Warsaw, suspected of involvement in the 2022 explosions that damaged the Nord Stream gas pipelines between Russia and Germany, disrupting gas supplies to Europe. Germany seeks his extradition. Concurrently, a Russian drone attack in Ukraine's Sumy region resulted in the death of a family of four, according to a military official.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia School Collapse Kills 3, Injures 100 During Prayer",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 09:42:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A school building collapsed during prayer time in Indonesia killing several students and injuring dozens.",
      "The Islamic school building collapsed while dozens of young students were attending afternoon prayers. Rescuers continue their race to find survivors and recover bodies buried in the rubble.",
      "<p>Instability of building in East Java town hampers search but 99 boys and school staff known to have survived</p><p>Parents were desperately searching for scores of missing teenage boys feared trapped under huge piles of concrete on Tuesday after a building at an Islamic boarding school collapsed ",
      "At least three children were killed and about 100 injured after an Islamic boarding school collapsed during a prayer service, officials said."
    ],
    "image_url": "",
    "titles": [
      "Dozens trapped in deadly Indonesia school collapse",
      "Indonesia school collapse: Rescuers race to save survivors",
      "Indonesia school collapse: three dead and over 90 missing as rescue effort continues",
      "Dozens of Students Are Missing After School Collapses in Indonesia"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.873,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A school building in Indonesia collapsed during prayer time, resulting in at least three children dead and approximately 100 injured. The incident occurred at an Islamic boarding school. Rescue efforts were temporarily halted due to the risk of further collapse as authorities and rescuers work to find survivors and recover bodies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 13:46:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Telecommunications down after Taliban authorities cut fibre-optic connections in several provinces to prevent ‘vice’.",
      "Nearly all links with the outside world are disrupted, grounding planes and closing businesses two weeks after the Taliban first signaled plans to ban fiber-optic internet.",
      "The shutdown came two weeks after the ruling Taliban cut off the internet in half a dozen provinces, saying they wanted to prevent “immoral acts.”",
      "<p>Taliban authorities cut fibre-optic network in nationwide shutdown of communications to prevent ‘vice’</p><p>Afghans are living under a near-complete communications blackout after Taliban authorities cut internet and mobile phone services for a second day as part of an unprecedented country-wide "
    ],
    "image_url": "",
    "titles": [
      "Afghanistan imposes internet blackout: What has the effect been so far?",
      "Afghanistan paralyzed as internet blackout stretches into second day",
      "Afghanistan Has Nationwide Internet Blackout, Monitors Say",
      "Afghanistan ‘blind without phones and internet’ on second day of telecoms blackout"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.95,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Economic Data Release at Risk Amid Congressional Spending Deadlock",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 08:18:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "ABC News",
      "Deutsche Welle"
    ],
    "domains": [
      "abcnews.go.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Funding will be cut off unless Republicans and Democrats can agree a way forward on a spending bill.",
      "A US government shutdown could result in layoffs of federal workers.",
      "The US could see its first government shutdown in almost seven years as both parties stand firm on their demands.",
      "The United States is facing yet another government shutdown. What happens and who is impacted when the government can't pay its bills? And could the Trump administration use it as an excuse for more layoffs?",
      "A potential shutdown of the U.S. government looms at midnight, as President Donald Trump and members of congress work toward a deal to avert it."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5096/live/f6627200-9d40-11f0-973f-51ea2fc41b54.jpg",
    "titles": [
      "Why the US government might shut down and when it might happen",
      "Why is the US government on the brink of a shutdown? What will it mean?",
      "US government shutdown looms amid 'large differences'",
      "What does a US government shutdown actually mean?",
      "The US government may shut down at midnight. Here's what to know"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.831,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Funding for key economic data is at risk as Republicans and Democrats struggle to agree on a spending bill. If no resolution is reached, the release of crucial economic information could be delayed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gaza Palestinians React to Trump's 20-Point Plan Endorsed by Netanyahu",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 14:19:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Palestinians in Gaza have been reacting to US President Donald Trump&#039;s 20-point plan to bring an end to the war on Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSVhtd2RYb01zVU9QY256RGtvTmZ0blNiYVg0XzJPTEhCVEF0WkZxWnNPa0E2ZUhjR3FPQmdrX3UwbVNIeDEzNVhvbi1jeFV6MzhQVnJrMkxuRUZXWURDRk5XNk5MX0tCSExTRnB0YW4zSWxWRHhXTzRQQWk?oc=5\" target=\"_blank\">Netanyahu endorses Trump plan to end Gaza war</a>&nbsp;&nbsp",
      "In President Trump’s plan, Prime Minister Benjamin Netanyahu got almost everything he hoped for in the end, despite mounting international isolation."
    ],
    "image_url": "",
    "titles": [
      "Palestinians in Gaza react to Trump plan on ending Israel’s war",
      "Netanyahu endorses Trump plan to end Gaza war - Axios",
      "With New U.S. Proposal to End Gaza War, a Rare Moment of Triumph for Netanyahu"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.961,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Palestinians in Gaza have responded to US President Donald Trump's 20-point plan aimed at ending the war on Gaza. The plan, which has received endorsement from Prime Minister Benjamin Netanyahu, largely meets Netanyahu's expectations, despite increasing international isolation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube Settles Trump Lawsuit for $24.5M Over Account Suspension",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 22:56:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Ars Technica",
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE91QkZKM0YyVnFuZWxIV3N4U1Ewb2s0ampyMnk4VG1UMzBieVlFWmlSdHJ1OVdJZmUyc3BpcFpXU29Ha0pfTmJmZlJsRm51SjBraTBBQ3hSZkRBT1piRUhxVF9VTjdxYUdMVXktX0NfRW9kMGRQb2VBTTgwWDZZTEk?oc=5\" target=\"_blank\">YouTube to pay Trump $22 million for suspending his acco",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump after he was suspended from the platform in 2021, a court filing shows.",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit involving the suspension of President Donald Trump's account in 2021.",
      "Alphabet settles with Trump instead of fighting lawsuit over January 6 suspension."
    ],
    "image_url": "",
    "titles": [
      "YouTube to pay Trump $22 million for suspending his account after Jan. 6 riot - Axios",
      "YouTube agrees to pay $24.5 million to settle Trump lawsuit: Court filing",
      "YouTube agrees to pay Trump $24.5 million to settle lawsuit over suspended account",
      "Trump obtains another settlement as YouTube agrees to pay $24.5 million"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.683,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump, stemming from the suspension of his account after the January 6, 2021 Capitol riot. This agreement resolves the legal dispute over the platform's decision to block Trump in the aftermath of the Capitol attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK PM Brands Reform UK Leader as 'Snake Oil Merchant', Highlights Political Divi",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 15:20:10 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The prime minister seeks to rally his party behind the UK government - what were the standout moments?",
      "Prime minister called Reform UK leader a ‘snake oil merchant’ talking down his own country",
      "<p>PM says Reform’s migration plan makes it ‘enemy of national renewal’, while Farage accuses Labour of endangering his party’s politicians and activists with its language</p><p><strong>Wes Streeting</strong>, the health secretary, has said that Tony Blair could play a positive role in Gaza helping ",
      "<p>Prime minister says choice is between ‘decency or division, renewal or decline’, amid rise of Reform UK</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform\">UK politics live – latest updates</a></p></li></ul><p>Britain"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2267/live/4fd0f6a0-9e12-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Five takeaways from Starmer's conference speech",
      "Starmer hits out at Farage in Labour party conference speech",
      "Nigel Farage ‘doesn’t like Britain’, Starmer tells Labour conference – UK politics live",
      "Nigel Farage ‘doesn’t believe in Britain’, Starmer tells Labour conference"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.962,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK Prime Minister aimed to unite his party, criticizing the Reform UK leader as a 'snake oil merchant' and accusing the party's migration plan of being detrimental to national renewal. Amidst these tensions, he framed the political choice as between 'decency or division, renewal or decline'. Health Secretary Wes Streeting mentioned Tony Blair's potential positive role in Gaza, highlighting internal political dynamics and international considerations in the backdrop of the rise of Reform UK.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madagascar Protests: 22 Dead, President Dissolves Government",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 15:28:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Madagascar’s president has dissolved his government in response to youth-led protests that killed at least 22 people.",
      "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power ",
      "Andry Rajoelina, the leader of the island nation in Africa, acknowledged grievances over power cuts and water shortages that have drawn thousands of young people to the streets."
    ],
    "image_url": "",
    "titles": [
      "Madagascar president dissolves government after deadly protests",
      "Madagascar’s president dissolves government amid youth-led protests",
      "Madagascar’s President Dissolves Government Amid Deadly Protests"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.985,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Madagascar, protests led by the youth movement \"Gen Z\" over severe water and power shortages and escalating poverty resulted in at least 22 fatalities, as reported by the UN. The widespread demonstrations prompted President Andry Rajoelina to dissolve the government in response to the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Unveils New Alexa+ Smart Devices, Including Dot Max and Echo Show 11",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:58:52 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Amazon unveiled a slew of new smart speakers and displays that are revamped with Alexa+, its personal assistant powered by generative artificial intelligence.",
      "Amazon’s AI-powered Alexa is on its way to more homes soon. The upgraded assistant will be available straight out of the box with new hardware announced today. New Echo devices will come with Alexa Plus straight out of the box; it’ll also be available to those who buy one of the new FireTV. Alexa Pl",
      "Amazon debuts new devices, the Dot Max, Echo Studio, Echo Show 8, and Echo Show 11, powered by AI."
    ],
    "image_url": "",
    "titles": [
      "Amazon's new Echo devices designed for Alexa+ start at $99",
      "Alexa Plus is available out of the box on new Echo devices",
      "Amazon unveils new Echo devices, powered by its Al, Alexa+"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon announced new smart speakers and displays, including the Dot Max, Echo Studio, Echo Show 8, and Echo Show 11, all integrated with Alexa+, a version of its assistant enhanced with generative artificial intelligence. This upgrade, dubbed Alexa Plus, will be included in these devices from the start, offering advanced AI capabilities to users. This move aims to expand the presence of Amazon's AI-powered assistant in homes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA Champions League 2025: Galatasaray vs Liverpool, Benfica vs Chelsea Live",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 12:54:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Yahoo Sports",
      "Al Jazeera",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "football-italia.net",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The two most decorated teams of the last European season meet in a Champions League Matchday 2 showdown in Spain.",
      "SportsLine soccer expert Martin Green has locked in his UEFA Champions League 2025 predictions for Galatasaray vs. Liverpool, which is streaming live on Paramount+",
      "Brandt Sutton locked in his 2025 UEFA Champions League predictions for Benfica vs. Chelsea, which is streaming live on Paramount+",
      "Ademola Lookman starts for the first time this season, partnering Nikola Krstovic up front for Atalanta as they take on Club Brugge in the second round of Champions League league phase fixtures on Tue..."
    ],
    "image_url": "",
    "titles": [
      "Barcelona vs PSG: UEFA Champions League – team news, start time and lineups",
      "Liverpool vs. Galatasaray odds, how to watch, stream, start time: UEFA Champions League picks for Sept. 30",
      "Chelsea vs. Benfica odds, how to watch, stream, start time: UEFA Champions League picks for Sept. 30, 2025",
      "Champions League: Atalanta vs. Club Brugge – Confirmed line-ups"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the 2025 UEFA Champions League Matchday 2, Galatasaray faces Liverpool, and Benfica competes against Chelsea, with both matches streaming live on Paramount+. Additionally, Ademola Lookman makes his season debut for Atalanta in their game against Club Brugge. Experts Martin Green and Brandt Sutton have provided their predictions for these fixtures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 12:02:49 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQNXljdkdjNnJfS1hfRXdIWDVGX3RTdHMwelVPbFhTSmhid3hmb1ZwUmMyUC10UDFfQ2JDWUJ1aW5KNkNUOW1rWk1aSEdtc2lHNmd4TnBILUZHbm14UER0MVgxdFF6NzdpQW5QcXR6UXBKZndLQnVUSjhWdXpLUXJoM3NlLUctNVVjdnV1akxn?oc=5\" target=\"_blank\">Charlie Javice sentenced to 7 years",
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "\"I made choices that I will spend my entire life regretting,” Javice said."
    ],
    "image_url": "",
    "titles": [
      "Charlie Javice sentenced to 7 years in prison for defrauding JP Morgan - Axios",
      "Startup founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Charlie Javice, the millennial founder convicted of swindling JPMorgan to the tune of $175 million, sentenced to 7 years in prison"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.898,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Javice, the founder of the fintech startup Frank, was sentenced to 7 years in prison for defrauding JPMorgan Chase during the company's sale for $175 million in 2021. Javice was arrested in 2023 after the bank accused her of falsely inflating Frank's customer base.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Aide to Far-Right Lawmaker Sentenced for Espionage",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-30T08:29:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A former assistant to far-right lawmaker Maximilian Krah has been jailed for nearly five years for working with Chinese intelligence. The court said Jian G. passed on sensitive EU documents and spied on dissidents.",
      "<p>Jian Guo jailed for five years after acting as agent for Chinese intelligence while working for Maximilian Krah</p><p>A former aide to a member of parliament for the far-right Alternative für Deutschland party has been sentenced to almost five years in prison for spying on behalf of China.</p><p>",
      "The former aide to a legislator from the far-right Alternative for Germany was convicted of spying on the European Parliament, German politicians and Chinese dissidents."
    ],
    "image_url": "",
    "titles": [
      "Germany: Ex-AfD aide convicted of spying for China",
      "AfD politician’s former aide convicted of spying for China",
      "Former aide in European Parliament convicted of spying for China"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jian Guo, a former assistant to far-right lawmaker Maximilian Krah, has been sentenced to nearly five years in prison for espionage. He was found guilty of passing sensitive EU documents to Chinese intelligence and spying on dissidents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Schedule Intrasquad Games Ahead of AL Division Series",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 14:39:11 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays will play a pair of intrasquad games this week in preparation for the start of the American League Division Series on Saturday.",
      "<p>Fans will have two more chances to see the Toronto Blue Jays before they begin their post-season run.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/cffd3d668b54ec78c4066b5934b884ee022085021b0897d375ef8f78e1b3afa2.jpg?quality=65&strip=all",
    "titles": [
      "Jays plan intrasquad games ahead of ALDS opener",
      "Blue Jays hosting pair of intrasquad games open to public"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays are set to play two intrasquad games this week as preparation for the American League Division Series starting on Saturday. These games offer fans additional opportunities to see the team before their post-season campaign begins.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins' Tyreek Hill Suffers Dislocated Knee, Ligament Tears in Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:35:42 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Dolphins WR Tyreek Hill dislocated his knee during Monday night's game, according to coach Mike McDaniel. Sources told Adam Schefter on Tuesday that he also tore multiple ligaments in his knee.",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE1HUWpCV2dKdnlPR09INmdmZS11eWl5dS1SV3dIQ2k4U2dFZWxnLUZyU1BPWHpKamV6T25DVHJMUDJHQ19pbnRpVEh2TS1PMzhvQ0F1aU8wN2lfS0xoM2dsaUJVcw?oc=5\" target=\"_blank\">Tyreek Hill Injury Update: Dolphins Star 'Tore Multiple Ligaments' in Knee</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1nZVBLeFFrT05OWk5kZFEyRHZyaC1KNTNMM1MxVk5vcHZsNS11Y0wycmc4Vmh0Si03OU5BbjJNQkh2TUMzQWpvSTVXcDVVSEh0MzdLTU5vUnNGZ2RoUHRtVHdpblVxel9CX0d2dmNUbkVocmc?oc=5\" target=\"_blank\">Four Takeaways on Tyreek Hill’s Knee Injury</a>&nbsp;&nbsp;<font color=\""
    ],
    "image_url": "",
    "titles": [
      "Sources: Dolphins' Hill tore ACL, other ligaments",
      "Tyreek Hill Injury Update: Dolphins Star 'Tore Multiple Ligaments' in Knee - Sports Illustrated",
      "Four Takeaways on Tyreek Hill’s Knee Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dolphins wide receiver Tyreek Hill suffered a dislocated knee and tore multiple ligaments during Monday night's game, as confirmed by coach Mike McDaniel and reported by Adam Schefter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kaprizov Signs Record $136M, 8-Year Extension with Minnesota Wild",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:35:42 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Wild have signed left wing Kirill Kaprizov to an NHL-record eight-year, $136 million contract extension through the 2033-34 season.",
      "Kaprizov will make $17.0 million annually with the contract extension"
    ],
    "image_url": "",
    "titles": [
      "Wild ink Kaprizov to largest contact in NHL history",
      "Kirill Kaprizov contract extension: Wild star becomes highest-paid player in NHL history with eight-year deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Minnesota Wild have secured left wing Kirill Kaprizov with an NHL-record eight-year contract extension, valued at $136 million, running through the 2033-34 season. Kaprizov's annual salary under this deal will be $17 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ja'Marr Chase Critiques Bengals' Desire in 28-3 Loss to Broncos",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:35:42 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Cincinnati star Ja'Marr Chase, an All-Pro receiver who finished with five catches for only 23 yards Monday in the Bengals' loss to the Denver Broncos, told reporters that \"at the end of the day, we gotta want it. Today, it didn't look like we wanted it.\"",
      "Cincinnati looked out of sync for much of the 28-3 defeat on Monday night"
    ],
    "image_url": "",
    "titles": [
      "Chase on loss: Didn't look like Bengals 'wanted it'",
      "Ja'Marr Chase criticizes Bengals' effort in blowout loss to Broncos: 'Didn't look like we wanted it'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cincinnati Bengals' All-Pro receiver Ja'Marr Chase commented on the team's performance after a 28-3 loss to the Denver Broncos, stating the team lacked desire. Chase, who had five catches for 23 yards, highlighted the team's lack of synchronization throughout the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Develop Technique to Create Eggs from Skin Cells for Infertility Trea",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:01:00 -0400",
    "source": "NPR",
    "sources": [
      "Wired",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.wired.com"
    ],
    "snippets": [
      "Scientists created the eggs using DNA from adult skin cells, a step that could someday potentially lead to new ways to treat infertility and enable gay couples to have genetically related children.",
      "The embryos weren’t used to try to establish a pregnancy, but the researchers behind the technique say it could one day be used to address infertility."
    ],
    "image_url": "",
    "titles": [
      "Scientists create human eggs in the lab, using skin cells",
      "Scientists Made Human Eggs from Skin Cells and Used Them to Form Embryos"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scientists have developed a technique to create eggs from the DNA of adult skin cells, offering a potential future treatment for infertility. This method could also enable gay couples to have genetically related children. However, the embryos created were not used to attempt pregnancy. The researchers believe this approach could one day help address infertility issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Women's Final Four Returns to Football Stadium in 2023",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:41:36 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.indystar.com"
    ],
    "snippets": [
      "For the first time since 2005, the Women's Final Four will be played in a football stadium",
      "The NCAA has seen growth in the women's basketball tournament in recent years and officials hope to keep that momentum."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/4116b499-5e3e-4fd9-8b4f-4841af688b6d/womens-final-four.jpg",
    "titles": [
      "2028 NCAA Women's Final Four will be played at Lucas Oil Stadium in Indianapolis",
      "Women's NCAA tournament Final Four moving to Lucas Oil Stadium in 2028"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "For the first time since 2005, the Women's Final Four basketball tournament will be held in a football stadium, reflecting the NCAA's efforts to capitalize on the event's growing popularity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SAG-AFTRA Criticizes AI Actor Tilly Norwood for \"Stolen Performances\"",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 14:53:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>US actors’ union joins stars in opposition to Norwood, which it says was created ‘using stolen performances’</p><p>The controversy around the “AI actor” Tilly Norwood continues to grow, after the actors’ union Sag-Aftra condemned the development and said Norwood’s creators were “using stolen perf",
      "The union warned studios they must bargain in good faith if they want to use an AI-generated performer instead of a human actor, part of a deal struck between studios and the union to end the Hollywood labor strikes in 2023."
    ],
    "image_url": "https://i.guim.co.uk/img/media/1f4cf02da300f69c0a7b0d59f3c5fe13d4d7fb8a/155_0_425_340/master/425.jpg?width=140&quality=85&auto=format&fit=max&s=3116d456ab645aeeb33137166ea79abd",
    "titles": [
      "Emily Blunt and Sag-Aftra join film industry condemnation of ‘AI actor’ Tilly Norwood",
      "SAG-AFTRA Condemns AI ‘Actress’ Tilly Norwood—Joins Critics Emily Blunt, Whoopi Goldberg And More"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The actors' union Sag-Aftra has criticized the creation of the AI actor Tilly Norwood, accusing its creators of using \"stolen performances.\" The union, representing US actors, has warned studios to negotiate fairly if they wish to use AI performers. This stance follows a deal made to end Hollywood labor strikes in 2023, emphasizing the need for ethical considerations in the use of AI in the entertainment industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football: Waiver Wire Strategy and Player Advice",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 13:46:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Here's who you should be targeting ahead of your Week 5 matchups",
      "For every fantasy football waiver wire pickup made, another player must be dropped."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/12/b5d79dc8-02ed-401a-b4d7-89441617c8c4/darius-slayton-usatsi-cbs.jpg",
    "titles": [
      "Fantasy Football Week 5 Waiver Wire: Tyreek Hill, Malik Nabers replacements among targets to know",
      "Fantasy Football Waiver Wire: Players to drop for your Week 5 pickups"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This article provides advice for fantasy football players on who to target for their Week 5 matchups. It emphasizes that for every player added from the waiver wire, another must be dropped from the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees-Red Sox Rivalry Impact Discussed Ahead of AL Wild Card Series",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:11:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Cody Bellinger or Jarren Duran? Garrett Crochet or Max Fried? Let's build a roster",
      "<p>Arden Zwelling reports on the American League Wild Card series between the New York Yankees and the Boston Red Sox.</p>",
      "<p>Erik Kratz joins Jays Talk Plus to discuss the Wild Card series between the New York Yankees and the Boston Red Sox, and whether the Yankees&#8217; rivalry with the Red Sox and the franchise&#8217;s history puts more pressure on Aaron Boone&#8217;s squad.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/29/a0d39137-b887-444a-8238-3a4dd44cb13a/crochet-fried-getty.png",
    "titles": [
      "Yankees vs. Red Sox: Comparing AL East rivals position by position ahead of Wild Card Series matchup",
      "Yankees, Red Sox both rely on new aces for Game 1 of Wild Card",
      "Is the pressure on for Yankees ahead of storied Red Sox matchup?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arden Zwelling and Erik Kratz discussed the American League Wild Card series between the New York Yankees and the Boston Red Sox. The conversation touched on the historic rivalry between the teams and speculated on its impact on the Yankees and manager Aaron Boone's approach to the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football: Sleepers & Start-Sit Advice Revealed",
    "domain": "business",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:18:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "SportsLine's model reveals its Week 5 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "From Woody Marks to Darius Slayton, here are five fantasy football sleepers worth targeting for Week 5 as injuries continue to pile up across the NFL."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/24/145cbc3e-ddb4-4cae-908a-2385515eed2a/daniel-jones-imagn.jpg",
    "titles": [
      "Fantasy Football Rankings, streamers, sleepers, cheat sheets for NFL Week 5, 2025 for PPR and standard leagues",
      "Week 5 Fantasy Football Sleepers: 5 Players You Should Target"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's model has released Week 5 Fantasy football projections, PPR rankings, and start-sit advice for platforms including CBS Sports, ESPN, and Yahoo. The report also highlights five sleepers, such as Woody Marks and Darius Slayton, recommended for Week 5 due to the increasing number of injuries in the NFL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches New Kindle Scribe Models, Features Color Screen Option",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-30T11:12:33-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon announced three new Kindle Scribes this morning with a much nicer design. There's even one with a color screen. I had a chance to check them out ahead of Amazon's press event, and I have some thoughts. This marks the third generation of the company's larger 11-inch eReaders aimed at professio",
      "The new Kindle Scribe has a larger 11-inch glare-free display, is just 5.4mm thick, and weighs only 400g. It’s also 40% faster when writing or turning pages."
    ],
    "image_url": "",
    "titles": [
      "Hands-on with Amazon’s new Kindle Scribes, including one with a color screen",
      "Amazon unveils new Kindle Scribe and Kindle Scribe Colorsoft"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon unveiled three new models of the Kindle Scribe, including one with a color screen. These third-generation eReaders feature an 11-inch glare-free display, are 5.4mm thick, weigh 400g, and offer a 40% faster performance in writing and page-turning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Imgur Blocks UK Access Amid Plans for Child Data Fine",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 13:19:57 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The image-hosting platform - which is widely used to make memes - was facing a fine over its use of children's data.",
      "Imgur, one of the web's most popular image sharing and hosting platforms, has shut off access to its site in the U.K., following a notice of a fine by the country's data protection watchdog."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/90cd/live/66c98e50-9dfc-11f0-a82d-4d2348b593b6.jpg",
    "titles": [
      "Image site Imgur blocks access to UK users after regulator warned of fine",
      "Imgur pulls out of UK after data regulator warns of fines"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Imgur, a popular image-sharing platform, has blocked access to its site in the U.K. after the country's data protection watchdog announced plans to fine the company for improperly using children's data.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Africa Penalized in World Cup Qualifiers; Scotland Adds Gordon to Squad",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 09:10:07 -0400",
    "source": "Forbes",
    "sources": [
      "Sky Sports",
      "Forbes"
    ],
    "domains": [
      "www.skysports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "South Africa’s point deduction for fielding an ineligible player shakes up Group C, leaving the 2026 World Cup qualifiers wide open and fiercely competitive.",
      "Scotland head coach Steve Clarke has recalled goalkeeper Craig Gordon to his squad for October's World Cup qualifiers."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68dbd58d8bfdf0245122947c/0x0.jpg?width=960",
    "titles": [
      "FIFA Sanction Reopens Africa’s Group C World Cup Qualifiers Race",
      "Gordon, 42, returns for Scotland's World Cup qualifiers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "South Africa faced a point deduction in the 2026 World Cup qualifiers for playing an ineligible player, impacting the competitiveness of Group C. Meanwhile, Scotland's coach Steve Clarke added goalkeeper Craig Gordon to the squad for October's qualifiers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "DoorDash Unveils Dot, a 350-Pound Food Delivery Robot",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 13:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "DoorDash announced an autonomous robot known as Dot that can navigate busy streets to deliver food to customers.",
      "DoorDash's 350-pound autonomous vehicle will hold your food in its robot mouth as it drives 20 miles per hour to deliver it to you."
    ],
    "image_url": "",
    "titles": [
      "DoorDash launches delivery robot in latest push into autonomous technology",
      "DoorDash unveils Dot, its autonomous robot built to deliver your food"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.916,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "DoorDash has introduced Dot, a 350-pound autonomous robot designed to deliver food. Capable of navigating busy streets, Dot can travel at speeds up to 20 miles per hour, carrying orders in its robot mouth to customers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Unveils New Echo Devices, Including Advanced Echo Studio, in 2025 Event",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-30T10:59:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon took the wraps off its latest Echo Dot smart speaker during its fall hardware event on Tuesday. The Echo Dot Max is a new entry that updates the recognizable spherical design with a flat face housing the speaker&#8217;s control buttons and LED light ring. At $99.99, the Echo Dot Max is the sa",
      "Amazon debuted the new Echo Show 8 and Echo Show 11 during its fall 2025 hardware event on Tuesday, after heavily relying on previous versions of the smart display to demonstrate upgrades coming to its Alexa smart assistant at an event earlier this year. The Echo Show 8 is a new version of one of [&",
      "Amazon revealed a new Echo Studio smart speaker at its fall 2025 hardware event on Tuesday. A new speaker wasn’t a total surprise, as Amazon’s event invite hinted strongly that there might be new Echo devices revealed at the show. The Studio is the “most advanced and best-sounding Echo ever,” Amazon"
    ],
    "image_url": "",
    "titles": [
      "Amazon’s new Echo Dot Max smart speaker bumps up the bass",
      "Amazon announces new Echo Show 8 and 11 smart displays",
      "Amazon announces a new Echo Studio"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.975,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At its fall 2025 hardware event, Amazon introduced several new devices: the Echo Dot Max, an updated smart speaker with a flat-faced design priced at $99.99; the Echo Show 8 and Echo Show 11, both upgrades in its smart display line; and the Echo Studio, touted as the most advanced Echo speaker to date. These launches reflect Amazon's ongoing efforts to innovate within its Alexa-enabled device range.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  }
]