[
  {
    "title": "Former MLB Manager Lee Elia Passes Away at 87",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:58:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Lee Elia, who managed the Cubs and Phillies in a pro baseball career that lasted more than 50 years as a coach and player, died Wednesday at the age of 87.",
      "Elia spent several seasons playing for the White Sox and Cubs before transitioning to coaching and managing",
      "UD alum Lee Elia, known for managing the Cubs and Phillies during a decadeslong career (and for an epic, expletive-filled postgame rant), has died.",
      "<p>Lee Elia, a former major league player and coach who was managing the Chicago Cubs in 1983 when he famously criticized the team&#8217;s fans in a memorable post-game rant, has died. He was 87.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lee Elia, manager of Cubs and Phillies, dies at 87",
      "Lee Elia, former Cubs and Phillies manager known best for profane rant at fans, dies at 87",
      "Lee Elia, former Phillies and Cubs manager and UD alum known for epic rant, dies at 87",
      "Lee Elia, former major league manager known for profane rant, dies at 87"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.975,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary": "Lee Elia, a former major league player, coach, and manager known for his tenure with the Cubs and Phillies as well as an infamous post-game rant while managing the Cubs in 1983, has passed away at the age of 87. Elia's professional baseball career spanned over 50 years, including playing for the White Sox and Cubs before moving into coaching and managing roles.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the death of a former major league player, coach, and manager, Lee Elia. It gives a brief overview of his career but does not offer deeper insights into his contributions to the sport or any actionable insights for the reader. The story does not report on solutions, improvements, or innovations."
  },
  {
    "title": "Herb Jones Signs $68M, 3-Year Extension with Pelicans",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:58:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Pelicans forward Herb Jones has agreed to a three-year, $68 million contract extension with the franchise.",
      "Jones earned first-team All-Defense honors in 2024",
      "<p>The New Orleans Pelicans have locked down a staunch young wing defender for the foreseeable future. </p>\n<p>Herb Jones has agreed to a three-year, $68 million contract with the Pelicans, ESPN&#8217;s Shams Charania reported Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Pelicans, Jones agree to 3-year, $68M extension",
      "Pelicans, forward Herbert Jones agree to three-year, $68 million extension, per report",
      "Report: Pelicans, Herb Jones agree to three-year, $68M extension"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.975,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.787,
    "summary": "Herb Jones, a forward for the New Orleans Pelicans, has secured a three-year contract extension worth $68 million, as reported by ESPN's Shams Charania. Recognized for his defensive prowess, Jones was honored with first-team All-Defense accolades in 2024, underscoring his significant contribution to the team's defensive lineup. This extension ensures that the Pelicans will retain a key defender in their roster for the coming years.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the contract extension and Jones' contribution to the team, but it doesn't report on any improvements, innovations, or attempts to solve problems. It does, however, provide some context about the player's importance to the team."
  },
  {
    "title": "Najee Harris Suffers Eye Injury in Fireworks Incident, Expected to Recover",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:58:20 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Najee Harris suffered an eye injury in a July 4 fireworks incident, but his agent said the Chargers running back \"is fully expected to be ready for the upcoming NFL season.\"",
      "Reports are surfacing that former Steelers running back Najee Harris has suffered a superficial eye injury in fireworks related incident.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNSXp2UXlKQUdpVGxXYXhfamQxQVRHeWh1Vlc4cWFJaGZOdUdWcy1NcnZpRVBNaVBrNHlOeGdNa1lZcDZsYzQybFNRdDZudnd4anVUUWcwNlY0MWVjRTF1YU9TbUpJTkNrZzJjZFgyc1pnYzVZN0FVS0h6aFp6Vm05TVIwTjJNZw?oc=5\" target=\"_blank\">Najee Harris Suffers Minor Eye Injury in Fire"
    ],
    "image_url": "",
    "titles": [
      "Agent: Bolts' Harris hurt eye in fireworks incident",
      "Report: Ex-Steelers RB Najee Harris suffers 'superficial eye injury' in fireworks incident",
      "Najee Harris Suffers Minor Eye Injury in Fireworks Accident - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.975,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary": "Chargers running back Najee Harris sustained a superficial eye injury in a July 4 fireworks incident, as confirmed by his agent. Despite the mishap, Harris is expected to fully recover in time for the upcoming NFL season. Reports indicate that the injury is minor and not expected to impact his ability to play. The incident serves as a reminder of the potential dangers associated with fireworks during holiday celebrations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the incident and the potential dangers of fireworks. However, it lacks depth and doesn't provide any actionable insights or solutions to prevent such incidents in the future."
  },
  {
    "title": "Judge Blocks Trump's Attempt to End Birthright Citizenship",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 16:46:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The injunction would bar Trump from denying citizenship to US-born babies based on their parents&#039; immigration status.",
      "A US federal judge has blocked Trump's move to end birthright citizenship for some babies. The New Hampshire ruling makes the case a class action, covering all families at risk nationwide.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQeEJNd1pQelVMaTZ6UFVqN3Nna1NZeEJ4LWlaZ2pZd0N3aWRuWjB2N05WUDZDSTF3YldXSm11blFOaHBQNGVoSWxnanI1d3lNUkIzNWtkTXpsZ2FUMkYyT2JoSnpzdGNoOXpOVHNON2NuRGRwUUJock0xRXpQZzVwbjdxRVBfRWR0NWVuelpJU0dUZw?oc=5\" target=\"_blank\">Trump's birthright citizenshi"
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump’s birthright citizenship order in class-action lawsuit",
      "US judge pauses Trump order ending birthright citizenship",
      "Trump's birthright citizenship order blocked by judge despite SCOTUS ruling - Axios"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.84,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary": "A US federal judge in New Hampshire has issued an injunction blocking former President Trump's attempt to end birthright citizenship for children born in the US to parents without legal immigration status. This ruling classifies the case as a national class action, protecting families across the United States from the policy change.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides readers with a deeper understanding of the legal processes and implications surrounding birthright citizenship in the US. It informs about a significant legal development, but does not offer solutions or improvements to the issue."
  },
  {
    "title": "Anisimova Upsets Sabalenka to Reach First Grand Slam Final at Wimbledon",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 10 Jul 2025 16:05:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The world number 12 reaches maiden Grand Slam final with a tough three-set win over top-seeded Aryna Sabalenka.",
      "Even Anisimova was shocked when she pulled off the ultimate upset, defeating No. 1 Sabalenka in the Wimbledon semifinal.",
      "<p>Amanda Anisimova upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon on Thursday to reach the first Grand Slam final of her career a little more than a year after taking a break from tennis because of burnout.</p>"
    ],
    "image_url": "",
    "titles": [
      "Amanda Anisimova upsets Aryna Sabalenka to reach Wimbledon tennis final",
      "Amanda Anisimova upsets Aryna Sabalenka for latest win of resurgent career",
      "Anisimova upsets No. 1 Sabalenka, to face Swiatek in Wimbledon final"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.828,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary": "Amanda Anisimova, ranked world number 12, achieved a significant milestone by defeating top-seeded Aryna Sabalenka in a tough three-set match at Wimbledon. Anisimova's victory, with a score of 6-4, 4-6, 6-4, secured her spot in her first-ever Grand Slam final. This remarkable feat comes after Anisimova took a break from tennis due to burnout. The win marks a surprising upset and a notable achievement in Anisimova's career.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Anisimova's achievement. However, it doesn't provide much insight into the systems, causes, or impacts of her victory. It does offer some context about her career, including her break due to burnout."
  },
  {
    "title": "Trump Announces 35% Tariff on Canadian Imports Over Fentanyl Concerns",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Jul 2025 00:50:44 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "CityNews"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Levy set to go into effect at start of August could disrupt one of America’s crucial trading relationships",
      "U.S. President Donald Trump is threatening to impose 35 per cent tariffs on Canadian imports on Aug. 1. Trump posted a letter to Prime Minister Mark Carney on social media, linking the duties to the flow of fentanyl but says there are other issues the United States has with Canada. More to come."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F03343eb6-d118-47f1-93e3-d1b98fa8cc0e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump threatens to impose 35% tariff on Canadian goods",
      "Trump threatens 35 per cent tariffs on Canada on Aug. 1"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.993,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary": "U.S. President Donald Trump announced plans to impose a 35% tariff on Canadian imports starting August 1, citing the flow of fentanyl and other issues with Canada. This move, revealed through a letter to Prime Minister Mark Carney and shared on social media, could disrupt a vital trading relationship between the two countries.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about a significant policy change and its potential impact on trade relations. It provides useful context about the issues leading to the decision, although it does not report on solutions or improvements."
  },
  {
    "title": "Deaf Woman Faces Delay in Emergency Interpretation Amid Ontario Strike",
    "domain": "general",
    "location": "local",
    "published": "Thu, 10 Jul 2025 11:00:20 EDT",
    "source": "CBC",
    "sources": [
      "CBC",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<img alt=\"Photo of a building with a horizontal sign above its entrance and a digital sign in front. Both signs say &quot;Canadian Hearing Services.&quot;\" height=\"349\" src=\"https://i.cbc.ca/1.7581590.1752158684!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/ont-chs-strike-20250710.jpg\" title",
      "In early June, Jessica Sergeant waited five and a half hours for a sign language interpreter to arrive at her Ottawa hospital room while she had a cardiac emergency. Sergeant, who is Deaf, said the long wait amid a strike by Canadian Hearing Services workers in Ontario was &#8220;traumatic.&#8221; &"
    ],
    "image_url": "",
    "titles": [
      "Deaf clients say 'trust is gone' after 2-month Canadian Hearing Services strike",
      "‘Trust is gone’ after lengthy Canadian Hearing Services strike, some deaf clients say"
    ],
    "score_components": {
      "magnitude": 0.67,
      "recency": 0.809,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.714,
    "summary": "In early June, Jessica Sergeant, a Deaf individual, experienced a significant delay in receiving sign language interpretation during a cardiac emergency in Ottawa, waiting five and a half hours due to a strike by Canadian Hearing Services workers in Ontario. She described the experience as \"traumatic.\"",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story raises awareness about the challenges faced by the Deaf community during emergencies, particularly during strikes. However, it lacks depth in terms of the larger systemic issues at play and does not offer any solutions or improvements."
  },
  {
    "title": "Tesla Seeks Approval for Robotaxi Trials in Arizona, Eyes Expansion",
    "domain": "business",
    "location": "national",
    "published": "Thu, 10 Jul 2025 23:11:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Tesla has applied to test and operate its Robotaxis in Arizona, CNBC confirmed Thursday.",
      "Tesla CEO Elon Musk said Robotaxi will expand its service area in Austin and will come to the Bay Area in 1-2 months pending regulatory approval."
    ],
    "image_url": "",
    "titles": [
      "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo",
      "Tesla makes moves to expand robotaxis in the Bay Area and Phoenix"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.96,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary": "Tesla has submitted an application to test and run its Robotaxis in Arizona, as confirmed by CNBC. CEO Elon Musk announced plans to extend the Robotaxi service to Austin and the Bay Area in the next 1-2 months, pending regulatory clearance.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story clearly highlights progress and innovation in the field of autonomous vehicles. It provides useful information about Tesla's plans and potential expansion, contributing to the reader's understanding and awareness of trends in the auto and tech industries."
  },
  {
    "title": "Jalen Williams Signs $287M Extension with Thunder",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:58:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Thunder All-NBA star and champion Jalen Williams has agreed to a five-year maximum rookie contract extension that could reach $287 million, his agents told ESPN.",
      "<p>The recently crowned NBA champions have agreed to a five-year maximum rookie contract extension, ESPN&#8217;s Shams Charania reported Thursday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Williams, Thunder agree to rookie max extension",
      "Report: Thunder, Jalen Williams agree to five-year maximum rookie contract extension"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.975,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.698,
    "summary": "Jalen Williams, an All-NBA star and champion with the Thunder, has agreed to a five-year rookie contract extension potentially worth $287 million. The deal was confirmed by his agents and reported by ESPN's Shams Charania. This extension solidifies Williams' future with the Thunder and highlights the team's commitment to their star player.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This news story provides useful information about Jalen Williams' contract extension with the Thunder, which can inform readers about the team's commitment to their star player. However, it doesn't report on improvements, innovations, or attempts to solve problems, nor does it increase clarity around systems, causes, or trends."
  },
  {
    "title": "Palestinian Activist Released on Bail from Louisiana Detention Center",
    "domain": "general",
    "location": "global",
    "published": "2025-07-10T22:11:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Forbes"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The Columbia University graduate and Palestinian activist was held for months after being arrested by immigration agents. The US government had sought to deport him over his role in campus protests over the war in Gaza.",
      "Khalil, 30, was released on bail from a Louisiana immigration detention facility last month."
    ],
    "image_url": "",
    "titles": [
      "US: Mahmoud Khalil sues Trump administration for $20 mln",
      "Mahmoud Khalil Sues Trump Administration For $20 Million Over Alleged False Imprisonment"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.94,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary": "Khalil, a 30-year-old Columbia University graduate and Palestinian activist, was released on bail from a Louisiana immigration detention center last month. He had been detained for months following his arrest by immigration agents, due to the US government's intentions to deport him over his involvement in campus protests regarding the war in Gaza.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the situation of a specific individual and the broader issue of immigration detention and deportation in the US. It provides context and increases awareness, but does not offer solutions or highlight any progress in addressing these issues."
  },
  {
    "title": "NCAA Discusses March Madness Expansion; No Changes Made",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:58:20 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The committees for men's and women's Division I basketball met this week to discuss possible expansion of the March Madness tournaments, but made no immediate decisions or recommendations.",
      "Discussions continue regarding the format of one of the biggest events in sports"
    ],
    "image_url": "",
    "titles": [
      "NCAA says March Madness expansion 'still viable'",
      "NCAA tables tournament expansion, delaying March Madness decision with 72, 76-team options still possible"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.975,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "The Division I committees for men's and women's basketball met to discuss potential expansions of the March Madness tournaments. No decisions or recommendations were made during these discussions. The format of the tournaments, among the largest events in sports, remains unchanged as discussions are ongoing.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the discussions happening within the NCAA regarding the expansion of March Madness tournaments. However, it lacks depth as no decisions or recommendations were made, and it doesn't provide actionable insights or a deeper understanding of the implications of such expansions."
  },
  {
    "title": "USWNT Star Tobin Heath Announces Retirement from Soccer",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:59:13 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "USWNT great Tobin Heath has announced her retirement from soccer, almost three years after her last appearance.",
      "Heath played her final match in 2022, undergoing several surgeries in the years since before retiring"
    ],
    "image_url": "",
    "titles": [
      "USWNT great Tobin Heath announces retirement",
      "Tobin Heath, two-time Women's World Cup winner with U.S. women's national team, announces retirement"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "Tobin Heath, a celebrated player of the US Women's National Soccer Team (USWNT), has announced her retirement from professional soccer. Heath's last game was in 2022, and she has undergone multiple surgeries since her last appearance nearly three years ago. This marks the end of her illustrious career in the sport.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Tobin Heath's retirement from professional soccer, but it doesn't offer a deeper understanding of the reasons behind her decision, or the impact it might have on the team or the sport. It also lacks actionable insights or information about any solutions, improvements, or innovations."
  },
  {
    "title": "NASA's Roman Telescope Gets Solar Panels, Advances Assembly",
    "domain": "science",
    "location": "global",
    "published": "Thu, 10 Jul 2025 15:44:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "On June 14 and 16, technicians installed solar panels onto NASA's Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission's observations and he",
      "On June 14 and 16, technicians installed solar panels onto NASA’s Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission’s observations and he"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-roman-space-tele.jpg",
    "titles": [
      "Roman Space Telescope team installs observatory's solar panels",
      "NASA’s Roman Space Telescope Team Installs Observatory’s Solar Panels"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.893,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary": "Technicians recently installed solar panels on NASA's Nancy Grace Roman Space Telescope, marking a crucial step in its assembly. The Solar Array Sun Shield will provide power and shade for the observatory, facilitating its mission observations. This development signifies progress towards the telescope's completion and readiness for future astronomical endeavors.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress in the assembly of NASA's Roman Telescope, contributing to the reader's understanding of the project's status. It also indirectly emphasizes the importance of solar power in space missions."
  },
  {
    "title": "Tottenham Buys Kudus for £55m, Eyes Gibbs-White Deal",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 21:34:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Tottenham complete the signing of Mohammed Kudus from West Ham for £55m, subject to a work permit.",
      "<p>Tottenham completed the signing of Ghana forward Mohammed Kudus from West Ham on Thursday and was reportedly close to adding Nottingham Forest midfielder Morgan Gibbs-White as well. </p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/56fb/live/2a835970-5dcf-11f0-b1af-694104f8ecc2.jpg",
    "titles": [
      "Tottenham sign West Ham midfielder Kudus for £55m",
      "Tottenham signs forward Mohammed Kudus from West Ham"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.928,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary": "Tottenham finalized the acquisition of Mohammed Kudus from West Ham for £55m, pending a work permit. The club also neared a deal for Morgan Gibbs-White from Nottingham Forest. Kudus, a Ghanaian forward, strengthens Tottenham's squad. The transfer showcases the club's commitment to bolstering its roster for upcoming competitions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for football fans, especially those following Tottenham, by reporting on the club's latest acquisitions. However, it doesn't delve into the broader impacts or trends in the sport or offer insights into the strategies behind these decisions."
  },
  {
    "title": "Ottawa Police Seek Suspect for Distributing Hate Materials in Osgoode Village",
    "domain": "general",
    "location": "local",
    "published": "Fri, 11 Jul 2025 00:19:47 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Ottawa Police Service has released the photo of a suspect wanted in connection with the distribution of &#8220;hate materials&#8221; in Osgoode Village. In a release issued Thursday, police said the incidents occurred at about 7 p.m. on the evening of June 2, with hate messages distributed to mu",
      "Ottawa police are looking for a person after multiple driveways in Osgoode Village had hate messages put on them. Officers said that it happened June 2 around 7:30 p.m. The suspect &#8220;distributed&#8221; hate messages to the driveways. He is described as a light-skinned male wearing a dark T-shir"
    ],
    "image_url": "",
    "titles": [
      "Ottawa police seeking suspect in distribution of hate material in Osgoode",
      "Police seeking suspect after hate messages put on Osgoode driveways"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.983,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary": "The Ottawa Police Service is searching for a light-skinned male suspect involved in distributing hate materials in Osgoode Village on the evening of June 2 around 7:30 p.m. The suspect, who was wearing a dark T-shirt at the time, targeted multiple driveways with hate messages. Police have released a photo of the suspect to aid in their investigation.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a hate crime incident in a specific location, which can be useful for local residents. However, it lacks depth and doesn't provide insights into the broader issues of hate crime, its causes, or potential solutions to address it."
  },
  {
    "title": "Healy Wins Tour de France Stage 6; Van der Poel Leads Overall",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 17:38:11 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<ul><li><p>Irishman Ben Healy’s 44km breakaway seals stage victory</p></li><li><p>Van der Poel 1 sec clear as teams question Pogacar tactics</p></li></ul><p>Ben Healy of Ireland took his nation’s 15th win in the Tour de France after claiming victory on stage six from Bayeux to Vire as Mathieu van de",
      "<p>Irish rider Ben Healy won a hilly sixth stage of the Tour de France after a long solo breakaway on Thursday and Mathieu van der Poel took back the yellow jersey from defending champion Tadej Pogačar by one second.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/2a15862a191bd4bd8ea6bd370fa9d3fd4ab2dad8/518_136_4105_3282/master/4105.jpg?width=140&quality=85&auto=format&fit=max&s=6f3019955107e9333ea0dec51824d125",
    "titles": [
      "Tour de France 2025: Van der Poel wrestles back yellow as Healy wins stage six",
      "Healy wins sixth stage of Tour de France as van der Poel overtakes Pogacar"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.855,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Irish cyclist Ben Healy won the sixth stage of the Tour de France with a 44km solo breakaway, marking Ireland's 15th victory in the race's history. This stage stretched from Bayeux to Vire. Mathieu van der Poel regained the yellow jersey, leading by one second over defending champion Tadej Pogačar. The outcome highlights Healy's significant achievement and shifts in the overall race standings.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the results of the sixth stage of the Tour de France, giving insights into the performance of the cyclists and the current standings. It does not, however, provide a deeper understanding of the event, its implications, or any solutions or improvements."
  },
  {
    "title": "Ollie Pope Concerned for Stokes' Injury in Lords Test; Match Outcome Uncertain",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 19:34:27 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Ollie Pope says England will keep their “fingers crossed” Ben Stokes has not suffered a serious injury after the captain struggled on the first day of the third Test against India at Lord’s.",
      "There was no thunderous run-scoring on the first day of the Lord's Test, far from it."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5b43/live/17144100-5dc1-11f0-8328-5fcabfbdb3e1.jpg",
    "titles": [
      "England keep 'fingers crossed' on Stokes injury",
      "England adapt on 'anti-Bazball' day but have 'fingers crossed' for Stokes"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.89,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary": "England's Ollie Pope expressed concern over Ben Stokes' injury during the third Test against India at Lord's. The match's first day saw low run-scoring. The outcome of Stokes' injury remains uncertain, with England hoping it is not serious.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides an update on a cricket match and a player's injury, it doesn't offer much depth or insight beyond that. It doesn't analyze the potential impact of the injury on the team's performance or the player's career, nor does it provide context about the match or the teams involved."
  },
  {
    "title": "Home Run Derby Participants Finalized for July 14 Event in Atlanta",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 23:55:18 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Derby is set for July 14 in Atlanta",
      "<p>The list of competitors in this year&#8217;s edition of the Home Run Derby is finally set. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/10/9ee10c1a-adb4-465f-8093-1ade6868b358/jazz-hr-getty.png",
    "titles": [
      "2025 MLB Home Run Derby: Jazz Chisholm joins field of James Wood, Cal Raleigh, Ronald Acuña Jr. and more",
      "Yankees’ Jazz Chisholm Jr. rounds out Home Run Derby field"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary": "The Home Run Derby is scheduled for July 14 in Atlanta. The list of participants for this year's event has been finalized.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the Home Run Derby event but does not offer any deeper understanding, actionable insights, or report on solutions or improvements."
  },
  {
    "title": "Beloved Parliament Cat Colony Member, Coal, Charms Visitors",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 21:51:06 +0000",
    "source": "New York Times",
    "sources": [
      "Ottawa Citizen",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "For decades, a semiofficial feline assembly outside Parliament was a major tourist attraction.",
      "“Coal himself was a gentleman feline with a heart of gold, with not one mean bone in his body. He was a very loyal buddy.”"
    ],
    "image_url": "https://static01.nyt.com/images/2025/07/10/world/10int-Canada-Cats/10int-Canada-Cats-mediumSquareAt3X.jpg",
    "titles": [
      "Coal, the Last Survivor of Canada’s Parliament Hill Cat Colony, Dies",
      "An ode to Coal: Last of the famous Parliament Hill cats"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.933,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary": "A feline named Coal, part of a semiofficial cat colony near Parliament, was a beloved tourist attraction for years. Described as a gentle and loyal companion, Coal captured the hearts of many visitors. However, the current status or outcome of the story is unclear.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a cat colony near Parliament, and the particular cat named Coal. However, it does not provide any deeper understanding, actionable insights, or report on solutions or improvements. The story also lacks clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Amazon Prime Day Extended, Offers More Deals on Tech Gadgets",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-10T20:47:16-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon Prime Day is usually a sprint - two hectic days of lightning deals, overflowing shopping carts, and enough browser tabs to crash a laptop. But this year, Amazon is treating it more like a marathon. Instead of wrapping things up after 48 hours, the retailer is giving Prime members two addition",
      "Let me try to read your mind. You’re thinking of getting a new TV, yes, a 4K model with some sort of smart TV operating system that can provide instant access to your favorite streaming apps. Well then. With Prime Day underway, several TV models, as well as streaming devices and soundbars, are on sa"
    ],
    "image_url": "",
    "titles": [
      "The best Prime Day 2025 deals you can still get",
      "The best 4K TV deals during Prime Day 2025"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41,
    "summary": "Amazon Prime Day, traditionally a 48-hour event, has been extended this year, offering Prime members additional days to access deals. The event features significant discounts on a variety of items, including 4K TVs, streaming devices, and soundbars, catering to consumers looking to upgrade their home entertainment systems.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about Amazon Prime Day's extension and the deals available. However, it lacks depth or insight into why this decision was made or its potential impact on consumers or the company."
  },
  {
    "title": "Virginia Loses Top Business State Ranking Due to Job Cuts",
    "domain": "business",
    "location": "national",
    "published": "Thu, 10 Jul 2025 15:00:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Virginia loses No. 1 spot in America's Top States for Business in 2025 as President Trump's federal government job cuts hit the state economy.",
      "CNBC unveils its 19th annual America's Top States for Business ranking, scoring all 50 states on 128 different metrics in 10 key categories of competitiveness."
    ],
    "image_url": "",
    "titles": [
      "Virginia drops in America's Top States for Business rankings. Federal job cuts are a big reason",
      "America's Top States for Business 2025: The full rankings"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.384,
    "summary": "Virginia has lost its No. 1 ranking in CNBC's America's Top States for Business in 2025 due to President Trump's federal government job cuts impacting the state's economy. CNBC's ranking evaluates all 50 states on 128 metrics across 10 competitiveness categories. The outcome is that Virginia is no longer the top state for business in 2025 according to CNBC's analysis.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the impact of federal job cuts on the state's economy and its ranking as a business-friendly state. However, it doesn't offer solutions or highlight any attempts to solve the problem, hence the score is not higher."
  }
]