[
  {
    "title": "Former LA deputy mayor to plead guilty to making fake bomb threat: DOJ",
    "domain": "general",
    "location": "national",
    "published": "Thu, 22 May 2025 21:44:37 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "Brian K. Williams, the former deputy mayor of public safety for Los Angeles, faces a statutory maximum sentence of 10 years in federal prison."
    ],
    "image_url": "https://s.abcnews.com/images/US/los-angeles-1-gty-er-250522_1747945164165_hpMain_4x3t_384.jpg",
    "titles": [
      "Former LA deputy mayor to plead guilty to making fake bomb threat: DOJ"
    ],
    "summary": "Brian K. Williams, previously serving as the deputy mayor of public safety for Los Angeles, is facing a potential maximum sentence of 10 years in federal prison.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the legal consequences of making a fake bomb threat, particularly for a public figure. However, it doesn't offer deeper insights or actionable information for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.69,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.433,
    "normalized_score": 0.0
  },
  {
    "title": "Tourism Regina launches new line of merchandise",
    "domain": "general",
    "location": "national",
    "published": "Fri, 23 May 2025 23:47:38 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Tourism Regina launched a new merchandise collection, including socks, candles, and oil diffusers. That's in addition to the relaunch of the I Love Regina gear."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2021/11/regina-city-hall-ilr-sign.jpg?quality=85&strip=all",
    "titles": [
      "Tourism Regina launches new line of merchandise"
    ],
    "summary": "Tourism Regina introduced a new line of merchandise featuring socks, candles, and oil diffusers, expanding their offerings beyond the recently relaunched I Love Regina gear. This initiative aims to boost local tourism and provide visitors and residents with a variety of Regina-themed products.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs the reader about a new initiative to boost local tourism and provides context about the types of products available. However, it doesn't highlight any specific progress or solutions, nor does it provide empowering knowledge.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 8.87
  },
  {
    "title": "Bowling for glory at the 5 Pin Canadian Open Championship",
    "domain": "general",
    "location": "national",
    "published": "Fri, 23 May 2025 23:46:15 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Teams from across Canada have made their way to the Queen City, vying for the ultimate title in the 5 Pin Bowling National Championship."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/5-Pin-Bowling.jpg?quality=85&strip=all",
    "titles": [
      "Bowling for glory at the 5 Pin Canadian Open Championship"
    ],
    "summary": "Teams from across Canada gathered in the Queen City to compete in the 5 Pin Bowling National Championship, aiming to win the ultimate title.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a national bowling championship, but doesn't provide deeper insights, actionable information, or highlight progress or solutions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.544,
    "normalized_score": 6.98
  },
  {
    "title": "Vancouver Mayor Ken Sim files defamation lawsuit against 2 men",
    "domain": "general",
    "location": "national",
    "published": "Fri, 23 May 2025 23:46:10 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The suit states that sometime around November 2023, Allam told Tsakumis that Sim had driven his car while intoxicated and had been stopped by Vancouver police officers."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/01/20250123180136-20250123170136-6792c50d75ca721a1de5b486jpeg_bfe093.jpg?quality=85&strip=all",
    "titles": [
      "Vancouver Mayor Ken Sim files defamation lawsuit against 2 men"
    ],
    "summary": "In November 2023, a lawsuit was filed stating that Allam informed Tsakumis about an incident involving Sim driving under the influence and being stopped by Vancouver police officers. The suit highlights a specific claim regarding Sim's alleged actions but does not detail the outcome or subsequent legal proceedings.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a lawsuit involving the Vancouver Mayor, but it lacks depth or insight. It doesn't provide useful information about the legal proceedings, the implications for the mayor's role, or the broader context of defamation lawsuits in political circles.",
    "score_components": {
      "magnitude": 0.499,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.568,
    "normalized_score": 8.49
  },
  {
    "title": "Hudson’s bay aims to sell dozens of store leases to B.C. mall owner",
    "domain": "general",
    "location": "national",
    "published": "Fri, 23 May 2025 23:44:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Hudson's Bay says it plans to sell up to 28 of its store leases to a B.C. mall owner who wants to launch \"a new modern department store.\""
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/fe362ecdee1b3043346a51bebb19897588af7217246fbf4e6d630d4bcbe26284.jpg?quality=85&strip=all",
    "titles": [
      "Hudson’s bay aims to sell dozens of store leases to B.C. mall owner"
    ],
    "summary": "Hudson's Bay announced its intention to sell up to 28 store leases to a British Columbia mall owner. The buyer aims to use these leases to open \"a new modern department store.\" This move marks a significant shift in Hudson's Bay's retail strategy and potentially introduces a new player in the department store market.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant shift in Hudson's Bay's retail strategy. It also introduces a potential new player in the department store market, which could be relevant for readers interested in retail trends or investment opportunities. However, it doesn't report on solutions or improvements, and the impact of this move is not fully explored.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.572,
    "normalized_score": 8.74
  },
  {
    "title": "Knicks' Jalen Brunson, Karl-Anthony Towns earn All-NBA honors",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 23 May 2025 23:50:51 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The Knicks' dynamic duo of Jalen Brunson and Karl-Anthony Towns earned All-NBA honors, the league announced Friday."
    ],
    "image_url": "",
    "titles": [
      "Knicks' Jalen Brunson, Karl-Anthony Towns earn All-NBA honors"
    ],
    "summary": "The NBA announced on Friday that Jalen Brunson and Karl-Anthony Towns, both players for the New York Knicks, have been awarded All-NBA honors. This recognition highlights their outstanding performance and contribution to the team during the season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of an achievement by two NBA players, but it doesn't provide deeper insights or context. For example, it doesn't explain what earning All-NBA honors means for their careers, how it might impact the team's performance, or how it compares to other players' achievements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 5.79
  },
  {
    "title": "Albert Lea's Jim Gustafson Field hosts Big 9 Conference meet",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 23 May 2025 23:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 23—Conference meet draws in athletes from all over the region Hundreds of student athletes from around the area gathered at Hammer Field Thursday morning as Albert Lea played host to the Big 9 Conference track and field meet. Twelve teams of both boy and girl athletes came into the day with hopes of taking home conference medals before gearing up for section meets. For the boys ..."
    ],
    "image_url": "",
    "titles": [
      "Albert Lea's Jim Gustafson Field hosts Big 9 Conference meet"
    ],
    "summary": "On May 23, Albert Lea hosted the Big 9 Conference track and field meet at Hammer Field, drawing hundreds of student athletes from across the region. The event featured twelve teams of both boys and girls competing for conference medals, setting the stage for upcoming section meets.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a local sports event. It does not offer deep insights or actionable information, and it does not report on progress or solutions.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.524,
    "normalized_score": 5.72
  },
  {
    "title": "Scoreboard",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 23 May 2025 23:49:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 23—Upcoming area prep schedule TODAY Softball: Albert Lea vs. Worthington at Caswell Park, 10 a.m. (sections) United South Central vs. Sleepy Eye at Caswell Park, 10 a.m. (sections) Boys and girls track and field: Northwood-Kensett and Lake Mills at Iowa state track and field meet TUESDAY Baseball: NRHEG at Sibley East, 5 p.m. (sections) Softball: Albert Lea sections, if necessary Boys and ..."
    ],
    "image_url": "",
    "titles": [
      "Scoreboard"
    ],
    "summary": "On May 23, the area's prep sports schedule included sectional softball games with Albert Lea facing Worthington and United South Central playing Sleepy Eye, both at 10 a.m. at Caswell Park. Additionally, Northwood-Kensett and Lake Mills participated in the Iowa state track and field meet. The following day, on May 24, NRHEG was scheduled to play Sibley East in sectional baseball at 5 p.m., and a potential sectional softball game for Albert Lea was also noted if necessary.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about upcoming sports events. However, it lacks depth, insights, or actionable information. It does not report on progress, solutions, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 4.47
  },
  {
    "title": "Orioles-Red Sox nightcap rained out, rescheduled in Saturday day-night doubleheader",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 23 May 2025 23:47:17 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The second game of Friday’s doubleheader between the Boston Red Sox and Baltimore Orioles was postponed because of a rain and rescheduled as part of a day-night twin-bill on Saturday.  Hunter Dobbins (2-1,) is to start the opener of Boston and fellow right-hander Lucas Giolito (1-1) the night games.  Orioles pitchers were not clear."
    ],
    "image_url": "",
    "titles": [
      "Orioles-Red Sox nightcap rained out, rescheduled in Saturday day-night doubleheader"
    ],
    "summary": "The second game of the doubleheader between the Boston Red Sox and Baltimore Orioles scheduled for Friday was postponed due to rain. It has been rescheduled as part of a day-night doubleheader on Saturday. Hunter Dobbins (2-1) will start the opener for Boston, with Lucas Giolito (1-1) pitching in the night game. The starting pitchers for the Orioles have not been announced.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a change in a sports event schedule due to weather conditions. It offers actionable insight for those planning to attend or follow the games. However, it does not report on progress or solutions.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.542,
    "normalized_score": 6.86
  },
  {
    "title": "Who'll coach the U.S. men's Olympic flag football team?",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 23 May 2025 23:46:45 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "If NFL players will be playing, will NFL coaches be coaching?"
    ],
    "image_url": "",
    "titles": [
      "Who'll coach the U.S. men's Olympic flag football team?"
    ],
    "summary": "NFL players are confirmed to be playing in upcoming games, which implies that NFL coaches will also be actively coaching during these events. The participation of players directly correlates with the involvement of coaches to guide and strategize the games, ensuring the professional conduct of the matches.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the upcoming games and the potential involvement of NFL coaches. However, it lacks depth or insight into the implications of this, or how it might affect the games or the teams involved.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.524,
    "normalized_score": 5.72
  },
  {
    "title": "Salesforce exec says rise of AI agents means ‘every job should be rethought’",
    "domain": "business",
    "location": "global",
    "published": "Fri, 23 May 2025 23:43:52 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "AI agents can do tedious tasks better than people, allowing human talent to be refocused on more critical opportunities."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/54533229092_b94efabb55_o-e1748043058363.jpg?w=2048",
    "titles": [
      "Salesforce exec says rise of AI agents means ‘every job should be rethought’"
    ],
    "summary": "AI agents have proven to be more effective than humans at performing tedious tasks. This advancement allows for the reallocation of human resources towards more significant and critical opportunities, optimizing productivity and innovation in various fields.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of AI and its potential impacts on the job market. It encourages readers to rethink job roles and how they might be affected by AI, providing empowering knowledge.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.592,
    "normalized_score": 10.0
  },
  {
    "title": "At Trump's $148 million meme coin dinner, 'the food sucked' and security was lax, attendee says",
    "domain": "business",
    "location": "national",
    "published": "Fri, 23 May 2025 23:31:04 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Trump’s meme coin dropped 16% the morning after a black-tie gala for buyers, triggering political backlash that threatens to derail stablecoin legislation."
    ],
    "image_url": "",
    "titles": [
      "At Trump's $148 million meme coin dinner, 'the food sucked' and security was lax, attendee says"
    ],
    "summary": "A meme coin associated with Trump fell by 16% following a black-tie event for its purchasers, inciting political controversy. This incident is now posing a risk to the progress of legislation aimed at regulating stablecoins.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context to the reader about the potential impacts of political controversy on the cryptocurrency market. However, it focuses more on the negative aspects of the event rather than offering solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.561,
    "normalized_score": 8.05
  },
  {
    "title": "Cramer's week ahead: Earnings from Nvidia, Dell, Costco and Salesforce",
    "domain": "business",
    "location": "national",
    "published": "Fri, 23 May 2025 23:21:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "CNBC's Jim Cramer on Friday guided investors through next week on Wall Street."
    ],
    "image_url": "",
    "titles": [
      "Cramer's week ahead: Earnings from Nvidia, Dell, Costco and Salesforce"
    ],
    "summary": "Jim Cramer, a CNBC host, provided investors with guidance for the upcoming week on Wall Street during his show on Friday. His advice aimed to prepare viewers for the financial market's expectations and potential investment strategies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for investors, preparing them for the upcoming week's financial market expectations and potential investment strategies. It doesn't necessarily report on solutions or improvements, but it does contribute to the reader's understanding and decision-making.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.99,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.573,
    "normalized_score": 8.81
  },
  {
    "title": "What historic Medicaid and SNAP cuts in House Republican bill would mean for benefits",
    "domain": "business",
    "location": "national",
    "published": "Fri, 23 May 2025 22:34:02 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The House GOP tax bill includes tax breaks primarily for the wealthy, and cuts to Medicaid and SNAP. \"A lot of people will lose benefits,\" one expert said."
    ],
    "image_url": "",
    "titles": [
      "What historic Medicaid and SNAP cuts in House Republican bill would mean for benefits"
    ],
    "summary": "The House GOP tax bill proposes significant tax breaks for wealthy individuals while planning reductions in Medicaid and SNAP benefits. Experts warn this could result in many people losing their benefits.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story is negative in tone, it still informs readers about significant changes in Medicaid and SNAP benefits. It increases awareness about the potential impacts of the House GOP tax bill, providing useful context for those who may be affected by these changes.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.979,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.557,
    "normalized_score": 7.8
  },
  {
    "title": "Trump touts ‘planned partnership’ between U.S. Steel and Nippon Steel, signaling potential approval of Japanese company’s buyout bid",
    "domain": "business",
    "location": "global",
    "published": "Fri, 23 May 2025 22:32:10 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "As recently as December, Trump said he was \"totally against the once great and powerful U.S. Steel being bought by a foreign company.”"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25143725339346-e1748038885953.jpg?w=2048",
    "titles": [
      "Trump touts ‘planned partnership’ between U.S. Steel and Nippon Steel, signaling potential approval of Japanese company’s buyout bid"
    ],
    "summary": "In December, former President Trump expressed strong opposition to the idea of U.S. Steel, a company he described as \"once great and powerful,\" being acquired by a foreign entity. He stated he was \"totally against\" such a move.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the potential acquisition of U.S. Steel by Nippon Steel, but it provides minimal depth or insight into what this would mean for the companies involved or the steel industry as a whole. It doesn't provide actionable insights or report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.978,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.547,
    "normalized_score": 7.17
  },
  {
    "title": "Trump's Golden Dome defence project could spur a space arms race",
    "domain": "science",
    "location": "global",
    "published": "Fri, 23 May 2025 22:00:03 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "US President Trump has proposed a Golden Dome defence system that includes missile interceptors in space. But the idea would cost hundreds of billions of dollars – and could accelerate the weaponisation of space"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/23173859/SEI_252779770.jpg",
    "titles": [
      "Trump's Golden Dome defence project could spur a space arms race"
    ],
    "summary": "US President Trump proposed a Golden Dome defense system, featuring space-based missile interceptors. Critics argue it could significantly increase military spending by hundreds of billions and potentially lead to the weaponization of space.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a proposed defense system and its potential implications, such as increased military spending and the possible weaponization of space. However, it doesn't report on solutions, improvements, or attempts to solve problems, and it doesn't provide a deep understanding of the system or its impacts.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.957,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.551,
    "normalized_score": 7.42
  },
  {
    "title": "'Hopelessly attached': Scientists discover new 2D material that sticks the landing",
    "domain": "science",
    "location": "global",
    "published": "Fri, 23 May 2025 18:13:44 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Researchers have discovered a new 2D material, confirming decade-old prediction."
    ],
    "image_url": "",
    "titles": [
      "'Hopelessly attached': Scientists discover new 2D material that sticks the landing"
    ],
    "summary": "Researchers have successfully discovered a new two-dimensional material, fulfilling a prediction made ten years ago. This breakthrough in material science could potentially lead to advancements in various technological applications due to the unique properties of 2D materials.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in material science, reporting on the discovery of a new 2D material that could lead to advancements in various technological applications. It provides readers with empowering knowledge about the potential uses of this material.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.919,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.561,
    "normalized_score": 8.05
  },
  {
    "title": "Assembly instructions for enzymes",
    "domain": "science",
    "location": "global",
    "published": "Fri, 23 May 2025 18:13:39 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "In biology, enzymes have evolved over millions of years to drive chemical reactions. Scientists have now derived universal rules to enable the de novo design of optimal enzymes. As an example, they considered the enzymatic reaction of breaking a dimer into two monomer molecules. Considering the geometry of such an enzyme-substrate-complex, they identified three golden rules that should be considered to build a functional enzyme."
    ],
    "image_url": "",
    "titles": [
      "Assembly instructions for enzymes"
    ],
    "summary": "Scientists have developed universal rules for designing optimal enzymes from scratch, a breakthrough in biology. By studying the enzymatic process of splitting a dimer into monomers, they identified three key principles based on the enzyme-substrate complex's geometry. This advancement paves the way for creating functional enzymes tailored to specific chemical reactions, leveraging millions of years of natural evolution.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story offers a deep understanding of a breakthrough in biology, reporting on the development of universal rules for designing optimal enzymes. It highlights the progress made in this field and the potential solutions this could provide, such as creating functional enzymes tailored to specific chemical reactions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.919,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.571,
    "normalized_score": 8.68
  },
  {
    "title": "Breaking encryption with a quantum computer just got 20 times easier",
    "domain": "science",
    "location": "global",
    "published": "Fri, 23 May 2025 16:13:19 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "A quantum computer with a million qubits would be able to crack the vital RSA encryption algorithm, and while such machines don't yet exist, that estimate could still fall further"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/23145124/SEI_252778695.jpg",
    "titles": [
      "Breaking encryption with a quantum computer just got 20 times easier"
    ],
    "summary": "A quantum computer capable of holding a million qubits could potentially break the RSA encryption algorithm, crucial for cybersecurity. However, as of now, quantum computers of this scale have not been developed, and the qubit requirement for breaking RSA encryption may decrease as technology advances.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the potential of quantum computing and its implications for cybersecurity. However, it does not offer specific solutions or progress in addressing the issue, and the potential impacts are not fully explored.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.877,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.539,
    "normalized_score": 6.67
  },
  {
    "title": "Are microplastics in ultra-processed food harming your mental health?",
    "domain": "science",
    "location": "global",
    "published": "Fri, 23 May 2025 15:56:54 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Many people are worried about the health effects of ultra-processed foods and microplastics, but could these two issues actually be linked?"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/23145109/SEI_252766900.jpg",
    "titles": [
      "Are microplastics in ultra-processed food harming your mental health?"
    ],
    "summary": "Recent concerns have emerged about the potential link between ultra-processed foods and microplastics, suggesting these two health issues may be interconnected. However, the specific nature of this relationship and its implications for human health remain under investigation.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story raises awareness about a potential health concern, but it does not provide actionable insights or a deeper understanding of the issue. The relationship between microplastics and mental health is still under investigation, so the story does not provide clear solutions or progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.873,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.518,
    "normalized_score": 5.35
  }
]