[
  {
    "title": "Nepal Protests: 19 Dead as Citizens Rally Against Corruption, Social Media Ban",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 01:15:16 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "TechCrunch",
      "New York Times",
      "NPR",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "techcrunch.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Nepal's government lifted its ban on social media platforms Tuesday a day after police killed opened fire on mass street protests against the ban, killing 19 people.",
      "Nepal&#039;s Communications and Information Technology Minister Prithvi Subba Gurung says the ban is &#039;withdrawn&#039;.",
      "<p>Thousands joined the ‘Gen Z’ demonstrations, which protesters said reflected their frustration with the ban and anger over alleged corrupt officials</p><p>Nepal’s government has lifted its ban on 26 prominent social media apps and messaging services after at least <a href=\"https://www.theguardian",
      "<p>Many demonstrators say they are also on the streets over corruption and nepotism they allege is rampant </p><p>At least 19 people have been killed during protests in Nepal over a government ban on dozens of online platforms including Facebook, Instagram, WhatsApp and X.</p><p>The government has f",
      "The demonstrations in Nepal over government corruption and restrictions to apps such as WhatsApp and Facebook were driven by widespread anger among young people.",
      "The government reversed its ban on Facebook, Instagram and other platforms, which helped to spark demonstrations by young people who were also angry about corruption.",
      "Nepal has reversed its social media ban following nationwide “Gen Z” protests and public backlash."
    ],
    "image_url": "",
    "titles": [
      "Nepal lifts social media ban following protests where police killed 19 people",
      "Nepal lifts social media ban after 19 killed in protests against corruption",
      "Nepal rolls back social media ban after deadly protests rock capital",
      "At least 19 killed in ‘gen Z’ protests against Nepal’s social media ban",
      "At least 19 killed, hundreds injured in protests after Nepal social media ban",
      "Social Media Goes Back Online in Nepal After 19 Are Killed in Protests",
      "Nepal reverses social media ban as protests turn deadly"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.94,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.863,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Nepal, protests erupted against government corruption and the ban of major social media platforms, including Facebook, Instagram, WhatsApp, and X. Demonstrators, demanding the lifting of the ban and addressing corruption, clashed with police who used water cannons, batons, and rubber bullets. The unrest led to at least 19 deaths and over 200 injuries. Protesters also stormed the Parliament complex, highlighting widespread frustration with nepotism and governance issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lachlan Murdoch to Lead Murdoch Empire, Resolving Family Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 07:54:13 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "Business Insider",
      "The Guardian",
      "Forbes",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.businessinsider.com",
      "www.forbes.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Lachlan Murdoch will retain control of the conservative Fox and News Corp empire under the deal.",
      "Lachlan takes control as three siblings receive $1.1bn each to settle long-running family feud",
      "<p>Family announces Rupert Murdoch’s eldest son, Lachlan Murdoch, will secure control of business</p><p>The succession battle at Rupert Murdoch’s media empire has ended.</p><p>The family announced on Monday that Lachlan Murdoch, Murdoch’s eldest son, will secure control of the Murdochs’ sprawling me",
      "Rupert Murdoch and his children have reached an agreement over what will become of his media empire. It will see heir apparent Lachlan Murdoch reign.",
      "The dispute over the Murdoch’s family trust intensified last year, with family patriarch and billionaire Rupert Murdoch seeking to give control to Lachlan, his eldest son.",
      "The future of Fox News and The Wall Street Journal were at stake."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3706/live/50d831a0-8cf4-11f0-bd6b-bb632e699d74.jpg",
    "titles": [
      "Murdochs reach deal in succession battle over media empire",
      "Murdoch seals $3.3bn succession deal to hand empire to eldest son",
      "Murdoch family reaches deal to resolve succession fight over media empire",
      "The real-life 'Succession' fight for control of the Murdoch media empire has come to an end",
      "Murdochs Resolve Succession Dispute With Multibillion-Dollar Deal Favoring Lachlan",
      "Rupert Murdoch’s real-life ‘Succession’ battle just ended in a multibillion-dollar deal that keeps Fox News, Wall Street Journal conservative"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.973,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.84,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lachlan Murdoch will take control of the Murdoch media empire, including Fox News and The Wall Street Journal, following a family agreement. This decision resolves a succession dispute, with Lachlan's siblings receiving $1.1 billion each.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thailand's Supreme Court Orders Thaksin to Serve 1-Year Jail Term",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 01:11:37 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Thailand's Supreme Court said former Prime Minister Thaksin Shinawatra must serve a one-year prison term for previous convictions on graft and abuse of power charges.",
      "Thailand&#039;s Supreme Court ruled that hospital stay does not count as time served for the ex-prime minister.",
      "Thaksin Shinawatra was accused of having served a previous jail term in hospital detention, triggering widespread skepticism and public outrage.",
      "The Supreme Court’s ruling, stemming from past convictions on charges of corruption and abuse of power, was the latest blow to Thaksin Shinawatra."
    ],
    "image_url": "",
    "titles": [
      "Thailand's former PM Thaksin Shinawatra to serve one-year prison term",
      "Thai court says ex-premier Thaksin Shinawatra must serve year in prison",
      "Thailand's former PM Thaksin sentenced to one year in prison",
      "Thai Court Orders Thaksin, Ex-Premier, to Serve a Year in Prison"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.939,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thailand's Supreme Court ruled that former Prime Minister Thaksin Shinawatra must serve a one-year prison term for graft and abuse of power, stating his hospital detention does not count as time served. This decision comes after Thaksin was accused of evading jail by staying in a hospital, which led to public outrage. The ruling marks a significant setback for Thaksin, stemming from past corruption convictions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nottingham Forest Fires Coach Nuno Espirito Santo Amid Tensions",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 23:32:50 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Yahoo Sports",
      "BBC",
      "Sports Illustrated",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.independent.co.uk",
      "onefootball.com",
      "www.bbc.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Nottingham Forest head coach Nuno Espirito Santo is sacked after 21 months in charge - and just three games into the season.",
      "Nuno dramatically left the club after a breakdown of his relationship with Evangelos Marinakis",
      "Nottingham Forest have parted ways with head coach Nuno Espírito Santo, only three matches into the new Premier League campaign. His exit comes after 21 months in charge at the City Ground.Rumours ab...",
      "The latest on Nottingham Forest's search for a new manager following sacking of Nuno Espirito Santo.",
      "Nottingham Forest have sacked Nuno Espirito Santo after less than two years in charge, with the decision confirmed late on Tuesday night.The Portuguese coach’s position had been under scrutiny since...",
      "<ul><li><p>Nuno had led Forest to historic European qualification</p></li><li><p>Postecoglou eager for Premier League return after Spurs sacking</p></li></ul><p>Ange Postecoglou is the frontrunner to replace Nuno Espírito Santo as the new Nottingham Forest head coach, after the Portuguese was reliev",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBSbTNJRUdqWDdSTWEzVnlsa0hvb3Z4dnFwM2lOaVhqUHItaDJFRHNmblVhN2VEQVBjdmdCblRSVlA0aUtEYXQ3SlYyMXJQSlM1dEFvNm1XNlV2dkNSU0tUeDl6dVhVUWZoUlZKR3hTck02cGFoVDlr?oc=5\" target=\"_blank\">Nottingham Forest Sack Nuno Espirito Santo Three Games Into Season<",
      "Nottingham Forest have sacked head coach Nuno Espirito Santo."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6d91/live/7ed3f440-8d08-11f0-94ca-dfb746b80100.jpg",
    "titles": [
      "Nottingham Forest sack boss Nuno",
      "Nuno Espirito Santo sacked by Nottingham Forest",
      "Nottingham Forest part ways with Nuno Espírito Santo",
      "Nottingham Forest manager latest after Nuno sacked",
      "Nuno sacked by Nottingham Forest after relationship with owner breaks down",
      "Ange Postecoglou in line to replace Nuno Espírito Santo at Nottingham Forest",
      "Nottingham Forest Sack Nuno Espirito Santo Three Games Into Season - Sports Illustrated",
      "Nuno sacked by Nottingham Forest"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.817,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nottingham Forest has dismissed head coach Nuno Espirito Santo after 20 months, despite him recently securing the team's place in the Europa League and receiving a new contract in June. The decision follows reported tensions between Nuno and the club's owner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Democrats Release Trump's Alleged Epstein Birthday Message Photo",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 17:14:23 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Axios",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.npr.org",
      "www.cnbc.com",
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Democrats on the House Oversight Committee said the book included a tawdry drawing and note that appeared to include President Trump's signature. Trump had previously denied its existence.",
      "The White House says the president did not draw the picture or sign the note, after it was published on Monday.",
      "A US congressional panel has released a redacted copy of an alleged \"birthday book\" given to Epstein.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxONHJIWWJzekFWT3BfNWhqTTJUZUVXOE5zbExkeHZoWUdYZHJfanUtektMVFRZbWlHVzgtLURtTkM2T0ppa29oVWNSb1Rkeklka0lyeC1TdElyOXgycVc2WEMyWFBjdXlzSExVZUNZMGdWMlJ1eV8wRWFxRkdYZ2VTQTZGTHFmYTczenFnWHpSZw?oc=5\" target=\"_blank\">House Democrats post 2nd Epstein ",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9tX3lhTF9FR1B4SFNDc1VnNmtWUXB3VXl4REZOUnZmM1pqSDd2d3EtLW9vRkM3WlR6Yi0zUk5NLTRXdmgxMmp1cGpYcUptMVNfblhVTUt6UTJ5WlRmM1BtWVY2dTBTY2tIa21QZXJfaFlHenBvbWY2MzJB?oc=5\" target=\"_blank\">MAGA claims Trump signature in Epstein birthday book is fake</a",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQNGp4U3EwY3A3VkdiaVUySWxidmFHeEtHcGFzNW5DWGVERUpuc2RPNGxFeEtGX3BpVkVIM182d1hwcWJZeVJlclZLV29nSUQyWE5WVkR1Ny1mRlhfM243X2ZhMVdTZWlab1hqNDNxRXBVTkhLMGEyWFlfMkZvblZGUTd5T2dILW8?oc=5\" target=\"_blank\">Trump's alleged drawing in Epstein birthday ",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPVjFnbVptdExuSDkwdWRsV1oxeW1uSTVlb2dZbDliWHNwSEczTEdFM01UNnU4cTFEUkFSYUVsdmdqb0FvT3JkTjllMFZLblowSlowWm1wRTZIcWpBYzdSMlNzNUdmYmNRT180YmFWbmk0ODVVUnZ0cEMtNWY3Y0ZuT215YlM2V2NVYmM2ZzlkZE5DZw?oc=5\" target=\"_blank\">House Oversight Committee rec",
      "President Donald Trump sued The Wall Street Journal for defamation over its report revealing the existence of the letter to Jeffrey Epstein."
    ],
    "image_url": "",
    "titles": [
      "Estate of Jeffrey Epstein gives Congress 'birthday book' allegedly signed by Trump",
      "US lawmakers release Epstein 'birthday book' with alleged Trump note",
      "New Epstein files and 'birthday book': What we know",
      "House Democrats post 2nd Epstein birthday book page referencing Trump - Axios",
      "MAGA claims Trump signature in Epstein birthday book is fake - Axios",
      "Trump's alleged drawing in Epstein birthday book released by House Democrats - Axios",
      "House Oversight Committee receives Epstein birthday book - Axios",
      "Trump Epstein letter and drawing from 'birthday book' released"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.795,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Democrats on the House Oversight Committee published a photo of a birthday message allegedly signed by Donald Trump to Jeffrey Epstein, which Trump had previously denied existed. The White House and Trump's press secretary claim he did not create or sign the drawing. Following the Wall Street Journal's report on the letter, Trump sued the publication for $10 billion for defamation. The image was released after a subpoena was issued for information from Epstein's estate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Murdoch Family Resolves Dispute Over Media Empire's Future Control",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 17:37:22 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera",
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "ottawa.citynews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "The owner of Fox News, the <em>Wall Street Journal</em> and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "Legal settlement ensures Lachlan Murdoch will take control of sprawling media portfolio after 94-year-old mogul&#039;s death.",
      "Under the new agreement, three of Murdoch's children will receive cash based on equity sales and cease to have holdings in the media company. Lachlan, who shares his father's conservative ideals, will succeed Rupert.",
      "Rupert Murdoch’s family has reached a deal on control of the 94-year-old mogul’s media empire after his death, ensuring no change in direction at Fox News, the most popular network for President Donald Trump and conservatives. The deal creates a trust establishing control of the Fox Corp. for Lachla"
    ],
    "image_url": "",
    "titles": [
      "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "Rupert Murdoch seals deal passing control of media empire to eldest son",
      "Rupert Murdoch succession agreed as son Lachlan gets control",
      "Rupert Murdoch’s family reaches deal on who will control media empire after his death"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.802,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rupert Murdoch and his children have settled a dispute over the future control of his media empire, including Fox News and the Wall Street Journal, after his death. A trust has been established to ensure continuity in the direction of the companies, with no expected changes at Fox News, a key outlet for conservative audiences. This agreement resolves internal family legal battles over Murdoch's assets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jerusalem Shooting: 5 Dead, 12 Injured in Attack at Bus Stop",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 17:34:41 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Hamas praised a Palestinian shooting attack that killed six Israelis at a bus stop in Jerusalem. The U.S. presented a new truce proposal and Israel stepped up Gaza City attacks.",
      "<p>At least 12 others injured in attack at Ramot intersection during morning rush hour</p><p>Palestinian gunmen opened fire at a crowded bus stop in the northern outskirts of Jerusalem on Monday, killing six people and injuring 12 others before being shot dead by an off-duty soldier and a civilian a",
      "Israeli authorities identified the two gunmen, who were killed at the scene, as Palestinians from the West Bank.",
      "The Israeli police described the shooting as a terrorist attack and said that the perpetrators had been killed at the scene."
    ],
    "image_url": "",
    "titles": [
      "Palestinian gunmen kill 6 in Jerusalem as U.S. offers new Gaza ceasefire proposal",
      "Palestinian gunmen kill six people at Jerusalem bus stop",
      "Gunmen kill 6 in shooting attack at Jerusalem bus stop, police say",
      "Gunmen Attack Bus Stop in Jerusalem, Killing at Least 6"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.801,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.774,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Jerusalem, a shooting at a bus stop by two Palestinian attackers from the West Bank resulted in at least five deaths and 12 injuries, with six in serious condition. The incident, occurring during the morning rush hour, is among the deadliest in the city in recent years. Israeli police and civilians at the scene responded, killing the two gunmen. Authorities are treating the event as a terrorist attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's Government Falls as PM Bayrou Ousted in Confidence Vote",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 13:28:05 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Legislators toppled France's government in a confidence vote, a new crisis for Europe's second-largest economy. Prime Minister François Bayrou was ousted overwhelmingly in a 364-194 vote against him.",
      "France is set to lose its third premier in 12 months. Pressure is now mounting on President Emmanuel Macron to pick a new prime minister after Francois Bayrou's resignation.",
      "<p>Government collapses after Emmanuel Macron’s ally wins support of just 194 MPs with 364 against </p><p><a href=\"https://www.theguardian.com/world/2024/dec/13/from-farmer-to-premier-who-is-francois-bayrou-the-new-french-prime-minister\">François Bayrou</a> has been ousted in a confidence vote after",
      "Prime Minister François Bayrou failed a confidence vote aimed at breaking an impasse over the budget, adding more pressure on President Emmanuel Macron.",
      "President Emmanuel Macron is expected to appoint a new prime minister, rejecting calls for elections or his resignation."
    ],
    "image_url": "",
    "titles": [
      "France's government collapses after the prime minister loses a confidence vote",
      "France: Prime Minister Bayrou ousted in confidence vote",
      "François Bayrou ousted as French PM after losing confidence vote",
      "French Prime Minister Bayrou Loses Confidence Vote, Putting Pressure on Macron",
      "France’s Government Has Collapsed. What Comes Next?"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.735,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "France's government fell after a confidence vote ousted Prime Minister François Bayrou with a 364-194 result. The vote was a response to Bayrou's controversial plans to cut $52bn in spending to reduce national debt. This marks the third prime ministerial departure in France within a year, putting President Emmanuel Macron under pressure to find a successor capable of resolving the budget deadlock.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "European Stocks Up After French PM Dismissal; Major Mining Merger Announced",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 07:58:52 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "CNBC",
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.ft.com",
      "financialpost.com"
    ],
    "snippets": [
      "European stocks inched higher on Tuesday, with investors in the region focusing on further political turmoil in France after the ousting of Prime Minister Francois Bayrou on Monday.",
      "UK-listed group to combine with Canadian copper producer in one of the largest-ever mining deals",
      "<p>Two of world’s largest copper producers to combine, retaining London listing but raising prospect of job cuts</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/09/anglo-mining-mega-merger-londoners-commuting-struggles-tube-strike-second-day-business-live\">Business live – l",
      "Anglo American Plc has agreed to combine with Canada’s Teck Resources Ltd. in one of the biggest mining deals in more than a decade."
    ],
    "image_url": "",
    "titles": [
      "Anglo American shares surge 8% on 'merger of equals' with Canada's Teck Resources",
      "Anglo American and Teck Resources to create $50bn mining giant",
      "Anglo American to merge with rival Teck in $53bn mining group",
      "Anglo American Agrees to Buy Teck in Deal Reshaping Mining"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.974,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "European stocks rose slightly as investors reacted to the dismissal of French Prime Minister Francois Bayrou. Meanwhile, Anglo American Plc and Teck Resources Ltd., two of the world's largest copper producers, have agreed to merge in a significant mining deal, retaining their London listing but potentially leading to job cuts. This marks one of the largest mining mergers in over a decade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguars Trade RB Bigsby to Eagles for 2026 Draft Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 02:52:49 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Jacksonville Jaguars are trading running back Tank Bigsby, who had five carries for 12 yards Sunday in a win over the Carolina Panthers, to the Philadelphia Eagles in exchange for 2026 fifth- and sixth-round picks, sources told ESPN's Adam Schefter.",
      "Philadelphia makes yet another move",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE5Pb3BsYzFncXlQOG5OTzF2Yml3RWVLVlRpaFk2OU5jY0prZVhUT3V0MHVoU2hvUGFGR1o4d1diam93VEMxeXV4bTloeEdZeVlSUUZuSi1OVndiQ3VmSFFselBEcExvNjBveEE?oc=5\" target=\"_blank\">Eagles Acquiring RB Tank Bigsby in Trade With Jaguars</a>&nbsp;&nbsp;<font color=\"#6"
    ],
    "image_url": "",
    "titles": [
      "Sources: Jaguars send Bigsby to Eagles for picks",
      "Tank Bigsby trade grades: Jaguars get better of Eagles (barely) in trading away young RB for two draft picks",
      "Eagles Acquiring RB Tank Bigsby in Trade With Jaguars - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Jacksonville Jaguars have traded running back Tank Bigsby to the Philadelphia Eagles in exchange for 2026 fifth- and sixth-round draft picks, according to sources cited by ESPN's Adam Schefter. Bigsby, who had five carries for 12 yards in a recent win over the Carolina Panthers, is now part of an Eagles team making strategic moves to strengthen their roster.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Democrats Release Trump's Alleged Epstein Birthday Message Photo",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 21:05:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "ABC News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "After the letter was first reported by the WSJ, Trump denied he had written such a note and later sued for $10bn.",
      "A note reportedly written by Donald Trump to wish the sex offender happy birthday alludes to \"wonderful secrets.\" The White House denies that Trump signed the note or sketched the lewd drawing on it.",
      "The committee issued a subpoena in late August for information from the estate.",
      "Message purporting to be from the president revives controversy over links to the late disgraced financier"
    ],
    "image_url": "",
    "titles": [
      "Trump’s alleged, suggestive birthday note to Epstein released by Democrats",
      "US: Congress releases Trump's alleged note to Epstein",
      "Trump's alleged letter among 'Friends' section in Epstein's birthday book",
      "Democrats rekindle Trump’s Epstein problem with birthday note"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.793,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Democrats on the House Oversight Committee published a photo of a birthday message allegedly signed by Donald Trump to Jeffrey Epstein, which Trump had previously denied existed. The White House and Trump's press secretary claim he did not create or sign the drawing. Following the Wall Street Journal's report on the letter, Trump sued the publication for $10 billion for defamation. The image was released after a subpoena was issued for information from Epstein's estate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.J. McCarthy Leads Vikings to Comeback Win in NFL Debut",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 05:05:26 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.twincities.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "He may have started slow, but McCarthy put on a show in the fourth quarter to lead Minnesota to victory",
      "CHICAGO — The conversation about young quarterback J.J. McCarthy could’ve gone much differently had he not found his rhythm on Monday night at Soldier Field. There were growing pains for McCarthy in his NFL debut, and as a result, the Vikings found themselves chasing the game. As soon as McCarthy fo",
      "<p>Minnesota Vikings quarterback J.J. McCarthy threw for 143 yards and two touchdowns while also rushing for a score to lead an 11-point comeback in the fourth quarter to defeat the Chicago Bears 27-24.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/09/34d599a9-8a5e-41d9-8ba6-8a6772da1338/untitled-design-2025-09-08t220254-361.png",
    "titles": [
      "J.J. McCarthy makes NFL history while leading the Vikings to a shocking win over the Bears",
      "Takeaways from the Vikings’ 27-24 win over the Bears",
      "NFL Highlights: Vikings 27, Bears 24"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.937,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his NFL debut, quarterback J.J. McCarthy led the Minnesota Vikings to a 27-24 victory over the Chicago Bears, overcoming an 11-point deficit in the fourth quarter. McCarthy finished the game with 143 passing yards, two passing touchdowns, and one rushing touchdown, showcasing his ability to perform under pressure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Upholds $83.3M Defamation Judgment Against Trump",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 18:41:05 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5OOGRLNC1ZTzFESHYwc1pGSVdLdmw5STlNSVdHOXhVTUJCaWFWWVVkdkxyWUd3eGpsMWpLQXdsRkJnb0RKNnoyR3pmM25wYjdodWVDSVp5Z2V0UFQ0QnBsXy1id25Ybkc1YzdaTV9XV2Y3dlNGaXc?oc=5\" target=\"_blank\">E. Jean Carroll's $83 million judgment against Trump upheld by appea",
      "Carroll has accused Trump of defaming her in statements denying her accusation that he raped her decades earlier in a New York City department store.",
      "Appeals court rejects president’s plea to vacate payment to writer E Jean Carroll"
    ],
    "image_url": "",
    "titles": [
      "E. Jean Carroll's $83 million judgment against Trump upheld by appeals court - Axios",
      "Trump loses bid to overturn $83.3 million judgment in E. Jean Carroll defamation case",
      "Trump loses attempt to have $83mn defamation judgment tossed out"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.739,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal appeals court upheld an $83.3 million judgment against former President Trump for defaming E. Jean Carroll, who accused him of rape. The court rejected Trump's immunity claim. With interest, the judgment exceeds $89 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotillas Aim for Gaza in Political Statement; Alvarez vs. Crawford Fight Looms",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-08T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "What is the symbolic and political impact of the flotillas en route to Gaza? DW takes a look at the various missions that have tried to reach the shores of Gaza since 2010.",
      "Andreas Hale explains why Canelo Alvarez and Terence Crawford are fighting, what it means for boxing and more.",
      "All you need to know about Saul 'Canelo' Alvarez's fight with Terence Crawford in Las Vegas."
    ],
    "image_url": "",
    "titles": [
      "Gaza-bound flotillas: All you need to know",
      "Canelo Alvarez vs. Terence Crawford: All you need to know about Saturday's fight",
      "Canelo v Crawford - all you need to know"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.769,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Since 2010, multiple flotillas have attempted to reach Gaza, symbolizing resistance and drawing political attention to the region's blockade. Meanwhile, the boxing match between Canelo Alvarez and Terence Crawford is significant for the sport, with Andreas Hale discussing its implications. The event is scheduled for Saturday, including details on time, location, and how to watch.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers Nearly No-Hit Rockies in 3-1 Victory, Glasnow Strikes Out 11",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 02:52:49 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Tyler Glasnow, who struck out 11 and walked two on 105 pitches in his first career start against Colorado, combined with the Los Angeles Dodgers bullpen to one-hit the Rockies in a 3-1 win Monday night, as the veteran starter improved to 2-3 this season.",
      "<p>Colorado&#8217;s Ryan Ritter doubled against Tanner Scott to lead off the ninth inning on Monday night, breaking up the Los Angeles Dodgers&#8217; bid for the majors’ first no-hitter this season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dodgers just miss no-hitter again; Glasnow stars",
      "Dodgers lose no-hitter in ninth again, beat Rockies"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyler Glasnow and the Los Angeles Dodgers bullpen nearly achieved the season's first no-hitter but settled for a one-hit victory over the Colorado Rockies in a 3-1 win. Glasnow, improving to 2-3 for the season, struck out 11 in his debut against Colorado. The no-hit bid was broken up by Colorado's Ryan Ritter with a leadoff double in the ninth inning against Tanner Scott.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Howard Shares Strategy to Disrupt Tua: Target First Read Option",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 02:52:49 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Former Dolphins and current Colts corner Xavien Howard said the game plan Sunday was to take away QB Tua Tagovailoa's first read and get him into \"panic mode.\"",
      "Howard didn't pull any punches when describing his former quarterback"
    ],
    "image_url": "",
    "titles": [
      "Ex-Fins CB says Colts forced Tua into 'panic mode'",
      "Xavien Howard says ex-teammate Tua Tagovailoa went into 'panic mode' during Colts' blowout of Dolphins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Dolphins, now Colts cornerback Xavien Howard, revealed their strategy against QB Tua Tagovailoa in Sunday's game was to eliminate his first read option, aiming to induce panic. Howard spoke candidly about his former teammate's performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.J. McCarthy Leads Historic NFL Debut Comeback, Vikings Beat Bears 27-24",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 00:50:22 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "J.J. McCarthy struggled early, but his run game helped spur a come-from-behind win over the Bears.",
      "In thrilling fashion Monday night, Minnesota quarterback J.J. McCarthy authored a late comeback, becoming the first quarterback in NFL history to account for three touchdowns in the fourth quarter of his NFL debut, as the Vikings outlasted the Bears.",
      "<p>J.J. McCarthy threw two fourth-quarter touchdown passes and ran for another in his long-awaited NFL debut, and the Minnesota Vikings rallied for a season-opening 27-24 win over the Chicago Bears on Monday night.</p>",
      "In Chicago's first regular-season game under coach Ben Johnson, Caleb Williams and the Bears saw a second-half lead slip in a 27-24 loss on Monday to the division rival Minnesota Vikings at Soldier Field, a contest the hosts led 17-6 in the third quarter."
    ],
    "image_url": "",
    "titles": [
      "McCarthy, Vikings spoil Ben Johnson's Bears debut",
      "McCarthy delivers in debut, leads Vikings' rally",
      "J.J. McCarthy takes over late in debut as Vikings best Bears in opener",
      "Bears rue opportunity lost in Johnson's debut"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his NFL debut, J.J. McCarthy led a remarkable fourth-quarter comeback, scoring three touchdowns to secure a 27-24 victory for the Minnesota Vikings against the Chicago Bears. This made him the first quarterback in NFL history to achieve such a feat in his debut. The game, held at Soldier Field, saw the Bears lose a third-quarter lead in their first regular-season game under coach Ben Johnson, ending in a thrilling 27-24 win for the Vikings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Backs Assault on Gaza, US Issues Hamas Ultimatum",
    "domain": "general",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 07:09:00 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Benjamin Netanyahu has argued assault is needed to break Hamas",
      "The U.S. president gave Hamas what sounded like an ultimatum to either agree to a new truce proposal or face a full-scale Israeli assault on Gaza City.",
      "Hundreds of thousands of people will have to decide whether to risk staying put or fleeing south to overcrowded areas, many of which are in ruins, as Israel looks set to launch a full invasion of the city."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbc5ca673-7fdc-4e47-86da-a781cbc23f0d.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Israeli military orders evacuation of Gaza City",
      "Trump Issues Warning to Hamas as Israeli Military Moves on Gaza City",
      "Israeli Military Orders Residents of Gaza City to Evacuate"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Benjamin Netanyahu supports a full-scale assault on Gaza City to counter Hamas, aligning with a U.S. ultimatum for Hamas to accept a truce or face invasion. This situation forces hundreds of thousands to choose between staying in potential conflict zones or fleeing to overcrowded, devastated areas.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester City, Premier League Settle Dispute Over Sponsorship Rules",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 07:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Premier League and Manchester City have reached a settlement which has concluded their long-running dispute over the division’s sponsorship rules.The case revolved around the Premier League’s ...",
      "<ul><li><p>Dispute over associated party transaction rules ends</p></li><li><p>Club still face charges of breaching financial rules</p></li></ul><p>Manchester City and the Premier League have settled their dispute over rules that limit the ability of top-flight clubs to sign sponsorship deals with c"
    ],
    "image_url": "",
    "titles": [
      "Manchester City release statement confirming end to Premier League legal dispute",
      "Manchester City settle with Premier League and accept sponsorship rules are valid"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester City and the Premier League have settled a dispute regarding Associated Party Transactions rules, which limit clubs' sponsorship deal capabilities. While this specific disagreement has been resolved, Manchester City still faces charges related to breaching other financial regulations, with the outcome of those charges still pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Murdoch Family Resolves $24 Billion Empire Succession Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 22:57:14 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9ITzAtQ051NFNwaGNpX1dsNUNwV2lJeEVQQW9qSFUxcFBHT0JLU3RFV1RMZUhDLW5Pa3Jhb0MzTE9tVm9ESm4wVGF0NEZ4V2ZWNTA4Y1RkZ2JXM0RSYktldzR0amVJcWQyQjdBRmtwMkJKeFc2SXhRcDdVWQ?oc=5\" target=\"_blank\">Murdoch family resolves messy succession battle with new fami",
      "Rupert Murdoch built a $24 billion media dynasty over five decades, leading to a succession battle between his children."
    ],
    "image_url": "",
    "titles": [
      "Murdoch family resolves messy succession battle with new family trust - Axios",
      "A $24 billion media empire, 6 children, and a succession battle: Meet the Murdoch family"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.807,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Murdoch family has settled a succession dispute concerning Rupert Murdoch's $24 billion media empire, built over 50 years. This resolution ends a contentious battle among his children over control of the dynasty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SpaceX Secures $17 Billion Wireless Spectrum Deal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 21:16:50 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOa0hFRWgybTJZT19hU0lVWmpGMmxnc05TWjVHRGgweVBQSnR1SDdsSkRTS0J0UmRyUElQdlZ3YTdkR05yZl84cmJvVjlVMU5ITnRIVUF5ZGNTWG0xcG4tQjh3VEp3ZW1TOWdkZmZScDJGcVVERlhKQ3BucHREdHNxUndn?oc=5\" target=\"_blank\">SpaceX to pay $17 billion in wireless spectrum deal",
      "EchoStar’s stock soared further into record territory after a $17 billion deal to sell spectrum to Elon Musk’s SpaceX."
    ],
    "image_url": "",
    "titles": [
      "SpaceX to pay $17 billion in wireless spectrum deal - Axios",
      "SpaceX deal sends EchoStar’s stock soaring. Why Elon Musk is buying $17 billion in wireless spectrum."
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.78,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOa0hFRWgybTJZT19hU0lVWmpGMmxnc05TWjVHRGgweVBQSnR1SDdsSkRTS0J0UmRyUElQdlZ3YTdkR05yZl84cmJvVjlVMU5ITnRIVUF5ZGNTWG0xcG4tQjh3VEp3ZW1TOWdkZmZScDJGcVVERlhKQ3BucHREdHNxUndn?oc=5\" target=\"_blank\">SpaceX to pay $17 billion in wireless spectrum deal",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Admits \"Rapid Decline\" of Open Web, Contradicting Earlier Claims",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-08T12:50:20-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "For months, Google has maintained that the web is “thriving,” AI isn’t tanking traffic, and its search engine is sending people to a wider variety of websites than ever. But in a court filing from last week, Google admitted that “the open web is already in rapid decline,” as spotted earlier by Jason",
      "Google's position on the state of the Internet is murky to say the least."
    ],
    "image_url": "",
    "titles": [
      "Google admits the open web is in ‘rapid decline’",
      "In court filing, Google concedes the open web is in “rapid decline”"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.726,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Google, previously claiming the web is \"thriving\" and its search engine promotes diversity, contradicted itself in a recent court filing, acknowledging the \"rapid decline\" of the open web. This marks a significant shift in the company's public stance on the internet's health and the effects of AI on web traffic.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]