[
  {
    "title": "Sabalenka Wins Second Straight US Open, Clinches Fourth Grand Slam Title",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 23:17:34 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC",
      "Sky Sports",
      "The Guardian",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.sportsnet.ca",
      "www.theguardian.com",
      "www.cbssports.com",
      "www.skysports.com"
    ],
    "snippets": [
      "World number one Aryna Sabalenka lands a first major of the year after seeing off home hope Amanda Anisimova to retain her US Open title.",
      "Aryna Sabalenka beat Amanda Anisimova 6-3, 7-6 (3), making her the first woman to win the US Open in consecutive years since Serena Williams more than a decade ago.",
      "Sabalenka rolled in straight sets to win her second straight US Open title, the first woman to do so since Serena Williams in 2014",
      "<ul><li><p>Sabalenka overcomes American 6-3, 7-6 (3)</p></li><li><p>World No 1 clinches fourth grand slam title</p></li></ul><p>After such a bittersweet season filled with near-misses and heartbreak at the final hurdle, Aryna Sabalenka returned to the US Open final with one final chance to win the g",
      "World No 1 Aryna Sabalenka successfully defended her US Open title with a thrilling 6-4 7-6 (7-3) win over Amanda Anisimova in New York.",
      "<p>Aryna Sabalenka did not make many mistakes despite not sacrificing any power — well, until near the end — and outplayed Amanda Anisimova for a 6-3, 7-6 (3) victory in the US Open final Saturday, making her the first woman to win the tournament in consecutive years since Serena Williams more than "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8353/live/650d4860-8b71-11f0-8ec2-c7d37f298402.jpg",
    "titles": [
      "Sabalenka keeps cool to retain US Open title",
      "Sabalenka tops Anisimova for repeat Open title",
      "2025 US Open results, winner: Aryna Sabalenka takes down Amanda Anisimova to repeat as champion",
      "Aryna Sabalenka sweeps aside Amanda Anisimova to retain US Open title",
      "Sabalenka retains US Open title with thrilling win over Anisimova",
      "Sabalenka defeats Anisimova for her second consecutive US Open title"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.842,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aryna Sabalenka won her second consecutive US Open title, defeating Amanda Anisimova 6-3, 7-6 (3). This victory marks Sabalenka's first major win of the year and her fourth Grand Slam title overall. She becomes the first woman to win back-to-back US Open titles since Serena Williams in 2014.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Air Canada Flight Attendants Reject Wage Offer, No New Strike Planned",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 22:35:02 +0000",
    "source": "New York Times",
    "sources": [
      "Financial Post",
      "Fortune",
      "New York Times",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "financialpost.com",
      "www.nytimes.com",
      "fortune.com"
    ],
    "snippets": [
      "But the vote will not lead to a repeat of the walkout that snarled air travel in Canada last month.",
      "Air Canada flight attendants, who went on strike earlier this summer, have overwhelmingly rejected Air Canada's wage offer, according to an announcement from CUPE on Saturday.",
      "Air Canada restarted operations on Aug. 19 after reaching an agreement with the union for 10,000 flight attendants to end a strike that disrupted the travel plans of hundreds of thousands of travelers.",
      "VANCOUVER, British Columbia &#8212; Flight attendants at Air Canada and Air Canada Rouge have voted 99.1% against ratifying the company&#8217;s wage offer. Voter turnout was 99.4%. Even with the proposed increase, Air Canada flight attendants would still earn less than federal minimum wage, which is"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/06/multimedia/06canada-airline-pbfl/06canada-airline-pbfl-mediumSquareAt3X.jpg",
    "titles": [
      "Air Canada Flight Attendants Overwhelmingly Reject Proposed Contract",
      "Air Canada flight attendants vote to reject airline’s wage offer",
      "99.1% of Air Canada flight attendants vote against wage offer that union and airline agreed on, but flights will continue",
      "CUPE: Air Canada flight attendants reject Air Canada’s wage offer"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.968,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Air Canada flight attendants overwhelmingly rejected the company's wage offer, with 99.1% voting against it, despite a recent agreement that ended a strike disrupting travel. The vote will not lead to another walkout. The rejection comes after operations resumed on Aug. 19 following a strike that impacted thousands. The offered wages are still below the federal minimum wage, despite high voter turnout (99.4%) in the decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Crash: Cable Snap Identified as Critical Failure",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 19:44:26 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The rest of the mechanism worked properly, says a preliminary statement into the crash which killed 16 people.",
      "Initial findings revealed that the funiculr accident occurred within 50 seconds. Officials called the deadly crash one of Lisbon's worst tragedies in recent memory.",
      "<p>Investigators say it had not been possible to visually inspect section of cable that separated before incident</p><p>A cable linking two carriages snapped shortly before Wednesday’s funicular crash in Lisbon that killed 16 people, accident inspectors have said in a report.</p><p>An operator tried",
      "Portuguese authorities released a highly anticipated preliminary report into the disaster, which killed 16 people this week.",
      "Investigators are searching for the cause of the crash that killed 16 people, with questions focusing on a possible failure of the cable that kept the two cars in balance."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1692/live/b6e4a9e0-8b57-11f0-bc53-038b81db70b3.png",
    "titles": [
      "Cable snapped before Lisbon funicular crash, investigators say",
      "Lisbon funicular cable disconnected before crash — report",
      "Lisbon funicular cable snapped before deadly crash, report finds",
      "Authorities Point to Cable Disconnecting in First Report on Lisbon Funicular Crash",
      "Lisbon Funicular Was Inspected Hours Before Deadly Crash"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.893,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A preliminary report on the Lisbon funicular crash, which resulted in 16 deaths, identified a cable snap as the critical failure. Investigators noted the rest of the system was functional but highlighted that the section of cable that failed had not been visually inspected prior to the incident. This crash is considered one of Lisbon's worst tragedies in recent memory. The investigation is ongoing to determine the exact cause of the cable failure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Postal Traffic to US Plummets 80% After Tariff Policy Change",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T14:45:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Post",
      "The Guardian",
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Postal flows to the United States have almost come to a halt, with 88 operators worldwide fully or partially suspending services, the Universal Postal Union said.",
      "<p>Dozens of operators have suspended service to the US until a solution is implemented on parcels worth $800 or less</p><p>Postal traffic into the United States plunged by more than 80% after the Trump administration ended a tariff exemption for low-cost imports, the United Nations postal agency sa",
      "Postal traffic into the United States plunged by more than 80% after the Trump administration ended a tariff exemption for low-cost imports, the United Nations postal agency said Saturday. The Universal Postal Union says it has started rolling out new measures that can help postal operators around t",
      "Postal traffic into the United States plunged by more than 80% after the Trump administration ended a tariff exemption for low-cost imports, the United Nations postal agency said Saturday. The Universal Postal Union says it has started rolling out new measures that can help postal operators around t"
    ],
    "image_url": "",
    "titles": [
      "Postal traffic to US down by over 80% amid tariffs, UN says",
      "Postal traffic into US plunges by more than 80% after Trump ends exemption",
      "Postal traffic to US sank 80% after Trump administration ended exemption on low-value parcels",
      "Postal traffic to US sank 80% after Trump administration ended exemption on low-value parcels"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.822,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.761,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Postal traffic to the United States has decreased by over 80% following the Trump administration's decision to end a tariff exemption for low-cost imports, according to the Universal Postal Union. This has led to 88 postal operators worldwide fully or partially suspending their services to the US. The agency is implementing new measures to address the issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz, Sinner to Clash in US Open Final for Third Straight Grand Slam",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 14:53:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "All to know as the world&#039;s top two men&#039;s tennis players meet in New York in their third straight Grand Slam final.",
      "<p>Spaniard won in Paris, Italian took the title at Wimbledon. Part three in New York could be another classic</p><p>On a tranquil evening in Manhattan last week, Carlos Alcaraz was making his exit from an Italian restaurant with his sizeable support team when he unexpectedly found himself staring a",
      "The most dominant rivalry in tennis continues with the US Open men's singles final as Carlos Alcaraz takes on Jannik Sinner - live on <em>Sky Sports Tennis</em> from 7pm on Sunday.",
      "<p>Jannik Sinner and Carlos Alcaraz have played so often, and with so much at stake lately, that they both know the other&#8217;s game so well.</p>"
    ],
    "image_url": "",
    "titles": [
      "Alcaraz vs Sinner – US Open final: Match time, head-to-head, stats, Trump",
      "Alcaraz and Sinner in world of their own as US Open final completes slam trilogy",
      "Alcaraz and Sinner meet in historic Grand Slam final trilogy",
      "Sinner and Alcaraz set for third Slam final in a row at US Open"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.825,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.761,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Alcaraz and Jannik Sinner are set to compete in the US Open men's singles final, marking their third consecutive Grand Slam final against each other. Previously, Alcaraz won in Paris while Sinner claimed victory at Wimbledon. Their highly anticipated match is scheduled to be broadcast live on Sky Sports Tennis. This rivalry has become a dominant force in men's tennis, with both players having a deep understanding of each other's game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Detains 475, Mostly South Koreans, in Georgia Factory Raid",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 15:38:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "Business Insider"
    ],
    "domains": [
      "www.nytimes.com",
      "www.businessinsider.com",
      "www.npr.org"
    ],
    "snippets": [
      "South Korea's foreign minister is considering a trip to the U.S. to meet with the Trump administration after hundreds of South Koreans were arrested in Georgia at an electric vehicle battery plant.",
      "The shocked but subdued reaction to the arrest of hundreds of Koreans at the site reflected the delicate position of a government engaged in tense trade talks with the Trump administration.",
      "\"This, in fact, was the largest single-site enforcement operation in the history of Homeland Security investigations,\" a DHS official said."
    ],
    "image_url": "",
    "titles": [
      "ICE arrests at a Georgia Hyundai plant create new tension with South Korea",
      "Immigration Raid on Hyundai-LG Plant in Georgia Rattles South Korea",
      "South Korea responds after ICE detains 475 workers at a Hyundai-LG battery plant in Georgia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US immigration officials detained 475 workers, primarily South Korean nationals, for working illegally at a Hyundai-LG battery factory in Georgia. This event marks the largest single-site enforcement operation by Homeland Security Investigations. The raid has strained relations between the US and South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Over 1,500 Protest Against Palestine Action Ban, 425 Arrested",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 20:59:14 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Hundreds gathered in Parliament Square to oppose the group's ban under anti-terrorism legislation.",
      "Violence breaks out as police move in on 1,500 people protesting against government’s ban on anti-genocide group.",
      "<p>Police say offences include assault and support for a proscribed group as 1,500 oppose ban in Parliament Square</p><p>More than 425 people have been arrested at the largest demonstration yet opposing the proscription of Palestine Action.</p><p>Defend Our Juries, who organised the demonstrations, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1aaf/live/4be97670-8b3e-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "More than 425 arrested at rally against Palestine Action ban in London",
      "Police make mass arrests at Palestine Action rally outside UK Parliament",
      "More than 425 arrested as protesters defy ban on Palestine Action in London"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 1,500 people protested in Parliament Square against the government's ban on the anti-genocide group, Palestine Action, resulting in violence and police intervention. Authorities reported offences including assault and support for a proscribed group, leading to more than 425 arrests. This event marks the largest demonstration against the ban, organized by Defend Our Juries.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Davey Johnson, World Series Winner as Player and Manager, Dies at 82",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 12:00:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.npr.org"
    ],
    "snippets": [
      "Davey Johnson, an All-Star second baseman who won the World Series twice with the Baltimore Orioles as a player and managed the New York Mets to the title in 1986, died Friday.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxOMG9UQ1diY21YYlN3MVJJMVBzeUwxRnNaSVNFa1V3MG90bEV2VHlLczJIMUlJNW9zd3Z4WVlBdmxCY25kZnVENGJtdDljNHhUbnBYT0ZrWmV1ZGJfazkyRW94Z2w5Ry0yWm5hN1h6eUprZ19tZDZka0xMNUVVbW5Ca1JsTzk4V3c2cG56X0UwZnk?oc=5\" target=\"_blank\">Davey Johnson, Manager of World ",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPQXE3RGpfTndodEY4eXlyVmNTazZiU01aeUN3cTY2MEM2aktIaENNVlQwbDZHT2MzZGU5WXA5QWw3UTZSZXZSbTN6SkVnMzhmaEdNRUpubjFrTUpVb3FLOEpaTzF5QlVxZjE3bzJORHNmTDBWVW5XVVoyczlLZDRjNmlR?oc=5\" target=\"_blank\">Former Dodgers Manager Passes Away at 82</a>&nbsp;&",
      "<p>Davey Johnson, an All-Star second baseman who won the World Series twice with the Baltimore Orioles as a player and managed the New York Mets to the title in 1986, has died. He was 82.</p>"
    ],
    "image_url": "",
    "titles": [
      "Davey Johnson, who won 2 World Series with Orioles, managed Mets to title, dies at 82",
      "Davey Johnson, Manager of World Series Champion 1986 Mets, Dead at 82 - Sports Illustrated",
      "Former Dodgers Manager Passes Away at 82 - Sports Illustrated",
      "Three-time World Series champion Davey Johnson dies at 82"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.844,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Davey Johnson, the former All-Star second baseman who won two World Series with the Baltimore Orioles and managed the New York Mets to their 1986 World Series victory, has passed away at the age of 82. Johnson, celebrated for his leadership and success in both his playing and managerial careers, including taking four teams to the playoffs, was remembered by former Mets player Darryl Strawberry as a 'remarkable leader.' Johnson's contribution to baseball remains recognized, though he has not yet been inducted into the Hall of Fame.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hall of Fame Goaltender Ken Dryden Dies at 78",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 08:47:25 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.npr.org"
    ],
    "snippets": [
      "Dryden backstopped the NHL's most successful franchise to championships in six of his eight seasons in the league from 1970-71 to '78-79. He died after a fight with cancer.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPXzF4bEd6cEw2NW8yX3o3dlAxYmZiQkNmWjZfc0VEV2NtNnBnbjFSLXZoXzlSbGVmQUR5V3RDTldKbmkzc2dRVE9jVkdOR0dHUU43cWlJWmJqSUJvTFp5dlpRbWtBN1A0WW5NZXR2M0tkeFRZVkJwVFdZa21zanEwUmFXNGxpZkFWQWE0dWhTX1A0X0dWVGEya1h3?oc=5\" target=\"_blank\">Ken Dryden, Ace Can",
      "<p>Ken Dryden, the Hall of Fame goaltender whose long resume in and out of hockey included six Stanley Cup victories and helping backstop Canada&#8217;s generation-defining victory at the 1972 Summit Series, died Friday at the age of 78 after a battle with cancer.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ken Dryden, Hall of Fame goalie for the Montreal Canadiens, dies at age 78",
      "Ken Dryden, Ace Canadiens Goalie Turned Hockey Thought Leader, Dies at 78 - Sports Illustrated",
      "Former Canadiens goalie Ken Dryden passes away at age 78"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.789,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ken Dryden, a Hall of Fame goaltender who won six Stanley Cups with Montreal and was pivotal in Canada's 1972 Summit Series victory, died at 78 after a battle with cancer. Dryden, celebrated for his role in Montreal's 1970s dynasty and his contributions to hockey and beyond, passed away on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Beats Australia 47-7, Advances to Women's Rugby World Cup Quarters",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 18:08:21 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "England recovered from a glitchy first-half showing to beat Australia and set up a Women's Rugby World Cup quarter-final against Scotland,",
      "England recover from a shaky first-half showing to comprehensively beat Australia 47-7 to set up a Women's Rugby World Cup quarter-final against Scotland.",
      "<ul><li><p>Pool A: England 47-7 Australia</p></li><li><p>Red Roses pull away in the second half of gripping Test</p></li></ul><p>Tense. Gripping. A proper Test match. Australia put England under the most pressure they have faced in a long time with a superb first-half performance but the Red Roses p",
      "Sadia Kabeya and Kelsey Clifford claimed two tries apiece as England set up a World Cup quarter-final with Scotland by securing top spot in Pool A thanks to a 47-7 bonus-point win over Australia."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/db27/live/6bd31170-8b4e-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Patchy England beat Australia to set up Scotland quarter-final",
      "England to face Scotland in quarter-finals after thrashing Australia",
      "England outlast Australia to book Rugby World Cup quarter-final against Scotland",
      "Red Roses set up Scotland quarter-final tie with Australia comeback"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.864,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England overcame a challenging first half to defeat Australia 47-7 in the Women's Rugby World Cup, securing their place in the quarter-final against Scotland. The team's performance improved significantly in the second half, with Sadia Kabeya and Kelsey Clifford each scoring two tries, ensuring England finished top of Pool A with a bonus-point win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hall of Fame Goaltender and Politician Ken Dryden Dies at 78",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 06 Sep 2025 22:06:30 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The first time Ken Dryden walked into the Montreal Canadiens' locker room in 1971, his teammates immediately knew he was different.",
      "MONTREAL — Politicians and hockey stars are mourning the loss of hockey legend and former federal politician Ken Dryden, who passed away Friday at age 78 after a battle with cancer. Dryden, 78, was a Hall of Fame goaltender who won six Stanley Cups backstopping the Montreal Canadiens as well as mind"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/eb8a2f844a7af6e8e6189eaef26f8adfea5b820447198a059d729003f4f71e0d_eee08f.jpg?quality=65&strip=all",
    "titles": [
      "Hockey world mourns loss of Habs great Ken Dryden",
      "Hockey, political players react to death of Montreal Canadiens great Ken Dryden"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.697,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ken Dryden, a Hall of Fame goaltender who won six Stanley Cups with the Montreal Canadiens and later became a federal politician, passed away at age 78 after battling cancer. His death has prompted tributes from both the political and sports worlds, highlighting his impactful career and diverse achievements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Travis Hunter to Play Dual Role in Jaguars' Opener Against Panthers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 19:19:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "jaguarswire.usatoday.com"
    ],
    "snippets": [
      "The Jaguars are planning for Travis Hunter to be an \"every-down wide receiver and situational corner\" in Sunday's regular-season opener against the Panthers, sources told ESPN.",
      "In a report from ESPN, we now know what Travis Hunter's playing time will look like in the Jaguars Week 1 game."
    ],
    "image_url": "",
    "titles": [
      "Jags plan Hunter as 'every-down' WR in Week 1",
      "Week 1 playing time plan for Jaguars' Travis Hunter revealed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Travis Hunter is set to play as an \"every-down wide receiver and situational corner\" for the Jaguars in their upcoming game against the Panthers, according to sources. This strategy is part of the team's plan for the regular-season opener.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Finland Upsets Serbia, Advances to EuroBasket Quarterfinals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 6 Sep 2025 19:19:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Lauri Markkanen and Finland stunned Nikola Jokic and Serbia, ousting the EuroBasket favorites to advance to the quarterfinals.",
      "Jokić went for 33 points, eight rebounds and three assists, but got little help from his teammates"
    ],
    "image_url": "",
    "titles": [
      "Finland stuns Serbia, ousts Jokic from EuroBasket",
      "Nikola Jokić, Serbia ousted by Lauri Markkanen, Finland in stunning EuroBasket 2025 upset"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lauri Markkanen led Finland to a surprising victory over Serbia, advancing to the EuroBasket quarterfinals. Despite Nikola Jokić's 33 points, eight rebounds, and three assists, Serbia was eliminated as Jokić's teammates provided limited support.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Father Mother Sister Brother\" Wins Golden Lion at Venice Film Festival",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 06 Sep 2025 16:08:47 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "Jim Jarmusch's quietly humorous relationship triptych won the top prize on Saturday. The film about the relationships between siblings, and with their parents, stars Adam Driver, Vicky Krieps and Cate Blanchett.",
      "<p>The Voice of Hind Rajab, a harrowing account of a Palestinian child’s death in Gaza, won the runner-up Silver Lion</p><p>US indie director Jim Jarmusch unexpectedly won the coveted Golden Lion at the Venice film festival on Saturday with Father Mother Sister Brother, a three-part meditation on th"
    ],
    "image_url": "",
    "titles": [
      "Jim Jarmusch's 'Father Mother Sister Brother' wins top prize at Venice Film Festival",
      "Jim Jarmusch’s Father Mother Sister Brother, starring Cate Blanchett, surprise winner of Venice Golden Lion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.92,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jim Jarmusch's film \"Father Mother Sister Brother,\" a meditation on familial relationships starring Adam Driver, Vicky Krieps, and Cate Blanchett, won the Golden Lion at the Venice Film Festival. The runner-up Silver Lion was awarded to \"The Voice of Hind Rajab,\" depicting a Palestinian child’s death in Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Hanks to Be Honored by Military Academy for Citizenship",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 22:48:16 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Little known about decision, although Hanks, who has advocated for military memorials, also voted for Biden</p><p>In Forrest Gump, the <a href=\"https://www.youtube.com/watch?v=BFpVF3lCufo\">title character</a>, played by Tom Hanks, receives the Congressional Medal of Honor from President Lyndon B ",
      "Hanks, 69, was scheduled to be recognized as an “outstanding citizen” who reflected the military academy’s ideals."
    ],
    "image_url": "https://i.guim.co.uk/img/media/122bdcd8c9c949d660a95d97b6b51f4ef7258cea/603_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=48bb0483f3edfaf0808c5733a4fc85ea",
    "titles": [
      "West Point cancels ceremony to honor Tom Hanks as ‘outstanding US citizen’",
      "West Point Alumni Association Reportedly Canceled Ceremony Honoring Tom Hanks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tom Hanks, aged 69, was set to be honored as an \"outstanding citizen\" by a military academy, reflecting the institution's ideals. This recognition aligns with Hanks' history of advocating for military memorials. Additionally, Hanks, known for his role as Forrest Gump, a character who receives the Congressional Medal of Honor, has shown support for political figures, including voting for Biden. The specifics of the decision to honor him remain largely undisclosed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC's Paul Craig Retires After Knockout Loss at UFC Paris",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 18:00:26 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "After a vicious KO loss to Modestas Bukauskas, UFC veteran Paul Craig called it a career on Saturday. Here's the news and everything you need to know about UFC Paris.",
      "<p>Paul Craig retires from MMA as the only fighter to defeat reigning UFC champ Majored Ankalaev.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/67cd3f6bb5849021ca373d61/0x0.jpg?width=960",
    "titles": [
      "UFC Veteran Announces Retirement In Octagon After Buzzer-Beater KO Loss",
      "Paul Craig announces retirement after knockout loss at UFC Paris"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UFC veteran Paul Craig announced his retirement following a knockout loss to Modestas Bukauskas at UFC Paris. Craig is notable for being the only fighter to defeat current UFC champion Majored Ankalaev.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Claims Pole at Monza with Record F1 Lap",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 14:46:24 -0400",
    "source": "Forbes",
    "sources": [
      "Sky Sports",
      "Forbes"
    ],
    "domains": [
      "www.skysports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Max Verstappen denied McLaren with the fastest lap in F1 history at Monza, leaving Norris, Piastri, and Ferrari chasing into race day.",
      "Max Verstappen snatched pole from Lando Norris in a thrilling qualifying session for the Italian Grand Prix, with championship leader Oscar Pisatri in third."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68bc7a36daf78f6944c24d1d/0x0.jpg?width=960",
    "titles": [
      "Verstappen Snatches Pole At Monza, McLaren Fall Short",
      "Verstappen snatches pole from Norris in thrilling Monza qualifying"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen secured pole position for the Italian Grand Prix at Monza with the fastest lap in F1 history, beating McLaren's Lando Norris and championship leader Oscar Piastri. This outcome sets the stage for an exciting race day with Verstappen leading and his competitors chasing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Escalates Offensive in Gaza, Targets Urban Center",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:16:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The Israeli army is systematically destroying remaining infrastructure as it moves to seize Gaza&#039;s largest urban centre.",
      "The Israeli military issued evacuation orders for residents in the high-rise towers and urged Palestinians to move to the south of Gaza, as it intensifies its offensive on the city."
    ],
    "image_url": "",
    "titles": [
      "Israel bombs more Gaza City high-rises after forced evacuation orders",
      "Israel Targets More Buildings in Gaza City and Warns Residents to Flee"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.831,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli military is escalating its offensive in Gaza, targeting the city's largest urban center and systematically destroying infrastructure. Residents in high-rise towers have been ordered to evacuate and move south as the army intensifies its operations in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Couple Killed in Lisbon Derailment Remembered Fondly by Families",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 15:55:18 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Kayleigh Smith and partner Will Nelson described as \"selfless\" and \"caring\" .",
      "<p>Relatives pay tribute to Kayleigh Smith, 36, and William Nelson, 44, who died when the Elevador da Glória derailed</p><p>The families of a British couple killed in Lisbon after a <a href=\"https://www.theguardian.com/world/2025/sep/03/at-least-three-people-killed-many-injured-in-lisbon-funicular-c"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/daa9/live/a3ab8770-8afa-11f0-a556-2733d63187eb.jpg",
    "titles": [
      "Families pay tribute to British couple killed in Lisbon funicular crash",
      "Families of British couple killed in Lisbon funicular crash ‘heartbroken’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.825,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kayleigh Smith, 36, and William Nelson, 44, were described as \"selfless\" and \"caring\" by relatives after they died in a Lisbon funicular derailment. The British couple's families paid tribute to them following the tragic incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Designer Giorgio Armani Dies at 91 in Milan",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 17:24:45 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Mourners queue in Milan to say goodbye to the Italian designer who died on Thursday, aged 91.",
      "Giorgio Armani died at the age of 91 in Milan, Italy. The fashion designer launched his career in the 1970s and quickly built up a fashion empire synonymous with elegance, quality and individuality."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/eb1d/live/a8215550-8b40-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Mourners pay tribute at public viewing of Giorgio Armani's coffin",
      "Mourners pay their respects to Giorgio Armani in Milan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Giorgio Armani, the renowned Italian fashion designer known for his elegant and quality designs, passed away at the age of 91 in Milan, Italy. Following his death, mourners have been queuing in Milan to pay their respects. Armani, who launched his career in the 1970s, built a significant fashion empire that became synonymous with luxury and individuality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints and Answers for Today's NYT Mini Crossword Revealed",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 06 Sep 2025 18:16:19 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/66ad93159698a3280d18584c/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Mini Crossword Clues And Answers For Sunday, September 7th",
      "Today’s NYT ‘Connections’ Hints And Answers For Sunday, September 7th"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.962,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]