[
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:14:11 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Financial Times",
      "NPR",
      "Forbes",
      "BBC",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.forbes.com",
      "www.nytimes.com",
      "news.google.com",
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu said on Saturday that he hopes Hamas will have returned all remaining hostages by Oct. 13.",
      "Hamas agreed to release the hostages and to the idea of handing over governing Gaza to Palestinian technocrats, but did not give a clear response to many other elements.",
      "Hamas accepted parts of US President Trump’s 20-point Gaza ceasefire plan but wants more talks on several key points.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1vUzN3NUNhdW5KdGZNLW0tdndmRk0tU3p3aDhxMkdHLW84YVJCTGR0RnFvTl8zVHNLU090NTBfMEpzN3JFbUQ1VERoV1phR1RRX1g0QXhnWmk3ektQTFdNZFBDcm8ydERPWVI3U01vaGZfMHR5cy1jTm5qV1NYLVE?oc=5\" target=\"_blank\">Trump tells Israel to stop bombing Gaza after Hamas resp",
      "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to reach a diplomatic breakthrough.",
      "Hamas said it would release all Israeli hostages but wants to negotiate elements of President Trump’s peace plan for Gaza. Adam Rasgon, a reporter for The New York Times in Jerusalem, explains where negotiations stand.",
      "US president warns militant group that it has limited time to seal a deal to end the conflict",
      "Israel and Hamas announced they’ve agreed to parts of Trump’s plan to end the war."
    ],
    "image_url": "",
    "titles": [
      "Trump urges Hamas to 'move quickly' on Gaza peace plan",
      "Shock in Gaza as Trump appears to welcome Hamas response to US peace plan",
      "What we know about Hamas’ response to Trump’s Gaza peace plan",
      "Trump tells Israel to stop bombing Gaza after Hamas responds to peace plan - Axios",
      "Trump’s Gaza Peace Plan: What to Know",
      "Hamas Partially Accepts Trump’s Peace Plan",
      "Donald Trump tells Hamas to ‘move quickly’ on hostage deal",
      "Trump Warns Hamas ‘Must Move Quickly’ To Release Hostages As Part Of His Peace Plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.903,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.866,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ANO Party Wins Czech Elections; Babiš Eyes Policy Shift on Ukraine",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 13:42:19 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "The Guardian",
      "Financial Post",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.nytimes.com",
      "financialpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "His political comeback put the country on a course away from supporting Ukraine and toward Hungary and Slovakia, which have taken a pro-Russian path.",
      "However, his ANO party falls short of an overall majority in preliminary results.",
      "With most votes tallied, Babis’s ANO party is ahead, but it appears set to fall short of a majority in parliament.",
      "<p>With Babiš’s victory the Czech Republic looks set to join Hungary and Slovakia in refusing support for Ukraine</p><p>The populist billionaire Andrej Babiš has won the Czech Republic parliamentary elections, preliminary results show, but fallen short of the overall majority.</p><p>This win marks a",
      "The party of Andrej Babis, a billionaire and a skeptic of military support to Ukraine, prevailed in parliamentary elections by focusing on the economy.",
      "Czech billionaire Andrej Babis was on track to return to power after securing a decisive victory in a parliamentary election, pledging to undo four years of austerity and curb military aid to Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Billionaire populist Andrej Babis' party wins Czech parliamentary election",
      "Populist billionaire Andrej Babis’s party set to win Czech election",
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Andrej Babis Likely to Return as Czech Prime Minister After Parliamentary Win",
      "Czech Billionaire Set to Return to Power After Election Win"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.874,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Andrej Babiš's ANO party won the Czech Republic parliamentary elections, according to preliminary results. Despite the victory, ANO did not achieve an overall majority. Babiš's win signals a shift in the Czech Republic's foreign policy, aligning closer with Hungary and Slovakia's stance of limiting support for Ukraine. This marks a significant political comeback for the billionaire, who aims to reverse austerity measures and reduce military aid to Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sanae Takaichi Elected LDP Leader, Set to Be Japan's First Female PM",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 06:17:39 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Washington Post",
      "NPR",
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Japan's governing party on Saturday elected Sanae Takaichi, a hard-line ultra-conservative and China hawk, as its new leader, making her likely to become the country's first female prime minister.",
      "The conservative politician is set to be Japan's first female prime minister.",
      "Conservative hard-liner Takaichi is the former internal affairs minister of Japan. She holds hawkish views on China, and has also visited the controversial Yasukuni Shrine, which memorializes Japan's war dead.",
      "<p>Margaret Thatcher admirer beat her more moderate rival to become leader of Liberal Democratic party</p><p>Japan is poised to get its first female prime minister after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should lead to her being ins",
      "The new leader will take the helm of the world’s fourth-largest economy at a time of unusual political instability, rising prices and increasing regional tensions.",
      "Ms. Takaichi would be Japan’s first female prime minister in a country where women are drastically underrepresented at the highest levels of power."
    ],
    "image_url": "",
    "titles": [
      "Japan's ruling party elects Sanae Takaichi as leader, likely to become first female PM",
      "Who is Japan's 'Iron Lady' Sanae Takaichi?",
      "Sanae Takaichi expected to be Japan's first female PM",
      "Japan poised to get first female PM after Sanae Takaichi wins ruling party leadership",
      "Sanae Takaichi is set to become Japan’s first female prime minister",
      "Sanae Takaichi Is Likely to Be Japan’s Next Leader. Who Is She?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.749,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sanae Takaichi, a conservative hard-liner and former Economic Security Minister, has been elected as the new leader of Japan's governing Liberal Democratic Party (LDP), positioning her to become the country's first female prime minister. Takaichi, known for her admiration of Margaret Thatcher and hawkish views on China, won against her more moderate rival, Shinjiro Koizumi, in a second-round party vote. Her leadership arrives amidst challenges such as political instability, an ageing population, rising prices, and regional tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Arrested, Hospitalized After Indianapolis Fight",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 21:51:03 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.theguardian.com",
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Indianapolis police announced they arrested Sanchez on suspicion of several misdemeanors",
      "(Reuters) -Former NFL quarterback and current Fox Sports analyst Mark Sanchez was charged with battery after a fight in downtown Indianapolis that left him hospitalized with stab wounds on Saturday shortly after midnight, police and the TV network said.  Indianapolis police charged Sanchez, 38, with",
      "<p>Circumstances surrounding incident remain unclear with Sanchez still in hospital and not yet booked in detention</p><p></p><p>Police have said that former <a href=\"https://www.theguardian.com/sport/nfl\">NFL</a> quarterback and Fox Sports television star Mark Sanchez has been arrested at the hospi",
      "<p>Former NFL quarterback and current Fox Sports analyst Mark Sanchez was arrested Saturday after he was apparently stabbed in an overnight altercation in downtown Indianapolis.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/a4e9f857-461b-4eb8-9c39-3b8d6c018f90/sanchez.png",
    "titles": [
      "Mark Sanchez arrested for battery while in hospital being treated for stabbing incident in Indianapolis",
      "Ex-NFL star Mark Sanchez charged with battery after being stabbed, Indianapolis police say",
      "Ex-NFL player and Fox Sports star Mark Sanchez arrested after being stabbed",
      "Mark Sanchez hospitalized, facing multiple charges after stabbing incident"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.953,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports analyst Mark Sanchez was arrested and charged with battery following a fight in downtown Indianapolis that occurred shortly after midnight on Saturday. The altercation resulted in Sanchez being hospitalized with stab wounds. While details of the incident remain unclear, and Sanchez has not yet been booked in detention, Indianapolis police have confirmed his arrest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Police Use Force on Protesters at Georgian Presidential Palace",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 22:18:38 GMT",
    "source": "BBC",
    "sources": [
      "Financial Post",
      "Deutsche Welle",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "financialpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Police used pepper spray to disperse demonstrators amid growing turmoil in the Caucasus country.",
      "Opposition protests turned violent as riot police used tear gas and water cannon after disputed local elections.",
      "Demonstrators were trying to enter the presidential palace in Tbilisi. A former president had called on Georgians to protest for what he called the \"last chance\" to save the country.",
      "TBILISI, Georgia (AP) &#8212; Police in Georgia used water cannons and pepper spray on Saturday to push back protesters who tried to storm the presidential palace, as the South Caucasus country held a municipal election boycotted by the main opposition blocs amid a sweeping crackdown on dissent. Ten"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c5b2/live/76a96bd0-a147-11f0-9be2-514f62a90aaf.png",
    "titles": [
      "Georgia protesters try to storm Tbilisi presidential palace",
      "Police fire water cannon at Georgia protesters near presidential palace",
      "Georgia: Police fire tear gas at anti-government protesters",
      "Georgia’s police use water cannons to push back protesters trying to storm presidential palace"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.943,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Tbilisi, Georgia, police deployed water cannons and pepper spray to repel protesters attempting to storm the presidential palace following a municipal election. The demonstrations, which turned violent, were part of opposition protests against the election results, viewed as the \"last chance\" to save the country according to a former president. The main opposition blocs had boycotted the election, citing a crackdown on dissent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Clinches Pole at Singapore GP, Edges Out Verstappen and Piastri",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 16:58:29 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "George Russell took a surprise pole position for Mercedes at the Singapore Grand Prix ahead of Red Bull's Max Verstappen in second place and championship leader Oscar Piastri in third.",
      "<ul><li><p>Rejuvenated Mercedes driver takes top spot by 0.182sec</p></li><li><p>Norris accused of impeding Dutchman’s flying lap</p></li></ul><p>George Russell is in talks to extend his contract with Mercedes, but could surely do no more to make his case than a magnificent lap on Saturday to claim ",
      "George Russell delivered a virtuoso performance under the lights to claim a stunning pole for Mercedes for the Singapore Grand Prix as second-placed Max Verstappen also outqualified the title-leading McLaren drivers."
    ],
    "image_url": "",
    "titles": [
      "Russell takes surprise Singapore pole over Verstappen",
      "Verstappen points finger at Norris after Russell grabs brilliant pole in Singapore",
      "Russell storms to Singapore pole as Verstappen beats McLarens too"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "George Russell of Mercedes secured pole position for the Singapore Grand Prix, outperforming Max Verstappen and both McLaren drivers, including title leader Oscar Piastri who placed third. Russell's impressive lap at the Marina Bay street circuit placed him 0.182 seconds ahead of Verstappen, showcasing a significant performance boost for Mercedes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Halts Gaza Strikes After Trump Request, Turkey to Repatriate Citizens",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:39:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Donald Trump urges Hamas to move quickly to release captives and finalise negotiations over his plan to end the war.",
      "Israeli air strikes and shelling destroy homes in Gaza, in defiance of Trump&#039;s ceasefire call.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOV0l0eW1melhVdVBTd3BVdGpMeXFIWkpYY0h3a19KWVFYY0tjblFidFA5T3UtLXR4SEVZMTZLT2RFdDdXaTR3Qm9sNllIcHVXYmh2emVSNHFDSW1vX3QxdjRLWnNyTmtnM1NDc3RzSi10YjFVRUFzMmxhTm5yQ3ctQzJR?oc=5\" target=\"_blank\">Israel halts strikes in Gaza after Trump's call to ",
      "<p>This blog is now closed, you can <a href=\"https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes\">read more on this story here</a></p><p></p><p><strong>Turkey</strong> said 36 of its citizens were expected to return home via a speci"
    ],
    "image_url": "",
    "titles": [
      "Israel pounds Gaza, killing 70, despite Trump’s call for it to halt bombing",
      "Israeli air strikes hit Gaza despite Trump’s ‘stop bombing’ demand",
      "Israel halts strikes in Gaza after Trump's call to stop the fighting - Axios",
      "Airstrikes reported in Gaza despite Trump’s call for Israel to stop bombing ‘immediately’ – as it happened"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel ceased its military strikes in Gaza following a request from Trump, as reported. Additionally, Turkey is preparing for the return of 36 of its citizens through a special arrangement. The current status of the conflict and the specifics of the arrangement for the Turkish citizens' return were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Triumph Over Yankees 10-1 in ALDS Opener",
    "domain": "sports",
    "source_domain": "sportsnaut.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 23:34:31 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "CityNews",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sportsnaut.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Coming into the American League Division Series, it was supposed to be the Toronto Blue Jays&#8216; scrap-it-out, every-man-in, small-ball offense",
      "<p>Watch as Toronto Blue Jays catcher Alejandro Kirk sends a ball deep to left field for his second home run of Game 1 against the New York Yankees, giving him his fifth homer in his last three games.</p>",
      "<p>For the first time since 2016, the Toronto Blue Jays have won a post-season game.</p>",
      "The Blue Jays have won 10-1 in Game 1 of the American League Division Series against the New York Yankees. The two teams were playing at Rogers Centre on Saturday for the first game between Toronto and New York in the MLB playoffs. The Yankees and Jays go back to the Rogers Centre in Game [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "Blue Jays Do Their Best ‘Bronx Bombers’ Impression in Game 1 Demolition of Yankees",
      "Blue Jays’ Kirk stays hot with second homer of Game 1 vs. Yankees",
      "‘Let’s go!’: Sports world reacts Blue Jays’ Game 1 win over Yankees",
      "Blue Jays win 10-1 in Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays defeated the New York Yankees 10-1 in Game 1 of the American League Division Series at Rogers Centre. This victory marks the Blue Jays' first postseason win since 2016. Catcher Alejandro Kirk contributed significantly with his second home run of the game, marking his fifth homer in the last three games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows Quick Hostage Return, Sends Team to Egypt for Gaza Plan Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:38:01 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Hamas will disarm \"the easy way or the hard way\", Israel's PM says after the group gave its response to a peace plan.",
      "Israeli Prime Minister Netanyahu said he wants to see hostages returned in the coming days. He also said a team has been sent to Egypt \"to finalize technical details\" of Trump's plan for the future of Gaza. Follow DW.",
      "Both sides have reacted positively to a United States proposal for a cease-fire, but many details remain to be ironed out, including whether Hamas will disarm."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1ec7/live/17f63870-a160-11f0-8480-e139cd7c3f3c.jpg",
    "titles": [
      "Netanyahu says he hopes to announce hostage release in the 'coming days'",
      "Netanyahu hopes Gaza hostages return home in coming days",
      "Netanyahu Says Israel and Hamas Are on the Brink of a Hostage Deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu announced intentions to secure the return of hostages within days and has dispatched a team to Egypt to conclude technical aspects of Trump's Gaza plan. The hostages' families express cautious optimism, urging the government to seize this chance for resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers' Chourio Exits NLDS Game 1 with Hamstring Issue",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 21:48:32 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chourio left the game after running hard through first base on an infield hit",
      "After getting three hits in two innings, Brewers star Jackson Chourio had to leave the first game of the National League Division Series with an apparent re-injury of his hamstring.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1lQjYzUG03QTlKcmRFSVJvT1ZhUUNCMEFCQmduNHFENlZhVUtRc3BlQk9nWVNrMDAycDlwR1pOU0hfUWdXMW1iUnNEX0JVQXo1dGFHeVlKcFk5aktFUmNVMmtnWHUwT1Utb3ZvVFJISjJTT2doS215VFFESUVtQQ?oc=5\" target=\"_blank\">Brewers Pull Jackson Chourio From Game 1 vs. Cubs With Ap"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/bef8f527-245d-465c-93df-c202e88a20a4/jackson-chourio-brewers-g.jpg",
    "titles": [
      "Brewers' Jackson Chourio leaves NLDS Game 1 with hamstring injury after recording three hits in two innings",
      "Milwaukee Brewers’ Jackson Chourio Exits Game 1 With Hamstring Issue",
      "Brewers Pull Jackson Chourio From Game 1 vs. Cubs With Apparent Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jackson Chourio, a star player for the Brewers, exited the first game of the National League Division Series due to an apparent hamstring re-injury. This occurred after he secured three hits in two innings and ran hard through first base on an infield hit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fatal Attack at Manchester Synagogue; Japan Nears Historic Election",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:21:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "NHL"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Japan’s beleaguered governing party will convene for a crucial election that could pave the way for the first female prime minister or the youngest leader in 140 years.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOb2U1VVVzWWcyS0tYUktnRlhRRHNSQkNrTUhMSU1CMERCQXAwa3RHM0t4bzhOUzM4WTZVLWVaczR2bmczX1JaanhUS01WSlVLV1lQT0x3elBzTWFwRmlvZ0ZONnFGTUU2WjgzY19neDk4QzRoamxkbWc4azJGWkNnTg?oc=5\" target=\"_blank\">OTT@MTL: What you need to know</a>&nbsp;&nbsp;<font c"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e75f/live/9e76f8a0-a109-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What to Know About Japan’s Leadership Election",
      "OTT@MTL: What you need to know - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two individuals were killed in an attack involving a car and stabbing at Heaton Park Hebrew Congregation Synagogue in Manchester on the most sacred day of the Jewish calendar. Meanwhile, Japan's governing party faces a significant election that could result in either the first female prime minister or the youngest leader in over a century.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Strikes Ukraine Train Station; Both Nations Target Energy Sites",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 10:41:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "President Zelenskyy condemns Moscow&#039;s latest strike on Ukraine&#039;s railway infrastructure.",
      "Russia has continued attacks on civilians in Ukraine with a strike targeting a passenger train station. Meanwhile, Moscow and Kyiv traded attacks on each other's energy infrastructure. DW has the latest.",
      "The drone strikes killed at least one person and injured dozens of others, officials said. The attack came amid rising alarm about the status of a nuclear plant relying solely on generators."
    ],
    "image_url": "",
    "titles": [
      "Russian attack on passenger train in Ukraine’s Sumy kills one, injures 30",
      "Ukraine updates: Russia hits passenger train, injures dozens",
      "Russian Drones Hit 2 Passenger Trains, Ukraine Says"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.756,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched an attack on Ukraine's railway infrastructure and targeted a passenger train station, causing an unspecified number of casualties. Concurrently, Moscow and Kyiv exchanged strikes on each other's energy facilities. The exact impact on the infrastructure and casualty figures have not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mitchell Leads Tiger-Cats to Victory, Argonauts Out of Playoffs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 23:41:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Bo Levi Mitchell and the Hamilton Tiger-Cats moved closer to cementing first in the East Division while ending the Toronto Argonauts' playoff hopes.",
      "<p>Bo Levi Mitchell threw four touchdown passes as the Hamilton Tiger-Cats defeated the Toronto Argonauts 47-29 on Saturday afternoon, eliminating the defending Grey Cup champions from playoff contention.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ticats end Argos playoff hopes with 47-29 win",
      "Tiger-Cats strengthen East lead with win, end Argonauts’ playoff hopes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bo Levi Mitchell led the Hamilton Tiger-Cats to a 47-29 victory over the Toronto Argonauts, throwing four touchdown passes. This win moved the Tiger-Cats closer to securing first place in the East Division and eliminated the Argonauts, the defending Grey Cup champions, from playoff contention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kirk Powers Blue Jays to 10-1 Win Over Yankees in ALDS Opener",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 23:28:51 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Alejandro Kirk had his second straight two-homer game to power the Toronto Blue Jays to a 10-1 rout of the New York Yankees in Game 1 of their American League Division Series on Saturday.",
      "The Toronto Blue Jays have their first post-season victory in nine years.",
      "<p>Between Vladimir Guerrero Jr. delivering a major moment, erasing a playoff losing streak and forcing the Yankees to burn through five relievers, the Blue Jays nearly checked every box in Saturday&#8217;s win.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/32b10d9beaf8e0fc414b9b643e1a8aaca6bf323b2222cee08ad61fa9ff126827.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays dump Yankees 10-1 in series opener",
      "Blue Jays thump Yankees 10-1 in series opener",
      "Blue Jays overpower Yankees to open ALDS with statement win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 10-1 victory over the New York Yankees in Game 1 of their American League Division Series with his second consecutive two-homer game. This win marks the Blue Jays' first post-season victory in nine years, highlighted by a strong performance from Vladimir Guerrero Jr. and effective strategy that exhausted the Yankees' bullpen, utilizing five relievers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Workers' Union Slams Latest Contract Offers",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:05:36 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba",
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba"
    ],
    "image_url": "",
    "titles": [
      "Canada Post union says latest contract offer is a ‘major step backwards’",
      "Canada Post union says latest contract offer is a ‘major step backwards’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.681,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The union for Canada Post workers criticized the corporation's latest contract offers as a \"mockery of the collective bargaining process\" and a \"major step back.\" They expressed disappointment in a statement released Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCLA Upsets No. 7 Penn State 42-37, Marks Historic Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 19:44:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Nico Iamaleava threw for two touchdowns and ran for three more Saturday as UCLA notched its first win of the season in stunning fashion, knocking off No. 7 Penn State 42-37 at the Rose Bowl, becoming the first 0-4 team to defeat a top 10 team since 1985.",
      "Nico Iamaleava ran for three touchdowns and passed for two more as UCLA upset No. 7 Penn State 42-37 on Saturday."
    ],
    "image_url": "",
    "titles": [
      "UCLA stuns No. 7 Penn State for 1st win of year",
      "UCLA stuns No. 7 Penn State with Iamaleava’s 5 touchdowns, ends 16-game skid against Top-10 teams"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nico Iamaleava led UCLA to a remarkable 42-37 victory over No. 7 Penn State, throwing for two touchdowns and running for three. This win marks UCLA's first of the season and is notable as the first time since 1985 that an 0-4 team has defeated a top 10 team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nearly 500 Arrested at London Protest Against Palestine Action Ban",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:03:08 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Demonstrations went ahead despite calls from politicians and police leaders for the protests to be postponed in wake of the Manchester synagogue attack.",
      "<p>Officers arrest activists at silent vigil in support of banned organisation, as demos go ahead despite PM’s pleas</p><p>Police have arrested almost 500 people in London at what organisers hoped would be the biggest demonstration so far against a ban on the proscribed organisation Palestine Action"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6b09/live/9d0674b0-a135-11f0-a9f1-8d9167fcc08f.png",
    "titles": [
      "Nearly 500 arrested at Palestine Action protest in London",
      "Police make almost 500 arrests at Palestine Action protest in London"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In London, nearly 500 people were arrested during a large demonstration against the ban on Palestine Action, despite requests from politicians and police to postpone protests following the Manchester synagogue attack. The arrests occurred at a silent vigil supporting the banned organization, highlighting the tension between public expressions of dissent and law enforcement responses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Deploys 300 National Guard to Illinois After Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 20:03:39 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5vVXdjLTR4TDhmQlpXaWJXWk9JR3dGRElKLUloTDdFVTZmdGlfNDJuQzA1UktmdzA5LVFHVmxzYkwxSXRDN3lQVF8zWTliSFZVTlAwWnR4N0lYcEIyT1ZOWEZPSVFpQ0ZHMjQyMElFSGJOYlJlZEVOLURjVXFDQQ?oc=5\" target=\"_blank\">Trump allows 300 National Guard members after feud with I",
      "“This morning, the Trump Administration’s Department of War gave me an ultimatum: call up your troops, or we will,” Pritzker said in a statement."
    ],
    "image_url": "",
    "titles": [
      "Trump allows 300 National Guard members after feud with Illinois governor - Axios",
      "Trump to federalize 300 members of the Illinois National Guard ahead of expected deployment to Democratic state"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.899,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After a dispute, the Trump Administration authorized 300 National Guard members to be deployed. This decision followed an ultimatum to Illinois Governor Pritzker from the Department of War, stating he must call up troops or the federal government would intervene.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Plans Arrest of Ex-Director; Patel Slams MSNBC's Coverage",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:41:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Forbes"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "FBI leadership is reportedly in discussions to stage a showy arrest of the bureau's former director next week.",
      "Patel attacked MSNBC over its reporting on the alleged incident, calling it ‘an a— clown factory of disinformation.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e48/live/fdf57990-a164-11f0-9e4f-7326464dc86f.jpg",
    "titles": [
      "FBI agent suspended over refusal to 'perp walk' former director",
      "FBI Director Kash Patel Doesn’t Deny He Fired Agent For Refusing Comey ‘Perp Walk’ In Expletive-Laden Post"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The FBI is reportedly planning a high-profile arrest of its former director next week. Meanwhile, Patel criticized MSNBC's coverage of the alleged incident, labeling the network as a source of disinformation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Treasury Considers New $1 Coin with Trump for 250th Anniversary",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 14:30:59 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The U.S. treasurer said on Friday that Treasury is considering minting new one-dollar coins for the nation's 250th anniversary featuring President Trump's image.",
      "<p>US treasurer says officials looking at drafts for country’s 250th anniversary featuring president with raised fist</p><p>To commemorate the 250th anniversary of the US’s independence, the treasury department is mulling production of a $1 coin displaying <a href=\"https://www.theguardian.com/us-new"
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-33-rt-gmh-250930_1759256171129_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump administration considers minting a $1 Trump coin",
      "US treasury considers special $1 Trump coin reading ‘fight, fight, fight’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. Treasury is exploring the creation of a new one-dollar coin to celebrate the country's 250th anniversary, featuring an image of President Trump with a raised fist. This consideration was confirmed by the U.S. Treasurer on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Babis Wins Czech Election, Proposes Ukraine Aid Cuts",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-04T15:30:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Billionaire Andrej Babis wants to cut aid to Ukraine, and now he is the projected winner of the Czech parliamentary elections. Though he didn't win a majority, Babis said he aims to form a one-party government.",
      "The party of Andrej Babis, former leader of the Czech government, is expected to prevail in parliamentary elections that begin Friday."
    ],
    "image_url": "",
    "titles": [
      "Czech Republic: 'Trumpist' ex-PM Babis wins elections",
      "‘Czech Trump’ Andrej Babis Is Poised to Return as Prime Minister in Elections"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Andrej Babis, a billionaire who has proposed cutting aid to Ukraine, is the projected winner of the Czech parliamentary elections, with his party securing 36% of the vote after 90% of districts reported.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 15:43:57 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Two trains were hit in Ukraine’s northern Sumy region, killing one and injuring about 30 others, officials say</p><p>Two Russian drones struck trains at a station in Ukraine’s northern Sumy region, killing one person and injuring about 30 others, officials said on Saturday, with Ukraine’s foreign",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "https://i.guim.co.uk/img/media/fa4a46a22559e2126e9fbdd39b86a1bd14282cdd/10_0_867_694/master/867.jpg?width=140&quality=85&auto=format&fit=max&s=aff3c39ed9670e4982145e59c875f7be",
    "titles": [
      "Person killed in drone attack as Ukraine accuses Russia of targeting passenger trains",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI's Sora App Features Copyrighted Characters, Signals IP Strategy Shift",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "CNBC has seen videos of characters from shows like \"SpongeBob SquarePants\" on the platform and was able to independently generate other characters.",
      "OpenAI may be reversing course on how it approaches copyright and intellectual property in its new video app Sora."
    ],
    "image_url": "",
    "titles": [
      "AI Sam Altman and the Sora copyright gamble: 'I hope Nintendo doesn't sue us'",
      "Sam Altman says Sora will add ‘granular,’ opt-in copyright controls"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.76,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI's new video app Sora, as observed by CNBC, features characters from copyrighted shows like \"SpongeBob SquarePants.\" This development suggests that OpenAI might be changing its approach to copyright and intellectual property rights in its applications.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's \"The Life of a Showgirl\" Sets Records After Friday Release",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-04T19:17:09Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday and its already breaking records.",
      "In this Saturday edition of Business Insider Today, we're talking about Taylor Swift's latest album, \"The Life of a Showgirl.\""
    ],
    "image_url": "https://i.insider.com/68e169401c1f80efbec4f179?format=jpeg",
    "titles": [
      "Taylor Swift is breaking her own records with 'The Life of a Showgirl'",
      "Taylor Swift's 12th album is out. BI breaks down what 'The Life of a Showgirl' is all about."
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.904,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday, which is already setting new records. The album's immediate impact was highlighted in the Saturday edition of Business Insider Today.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]