[
  {
    "title": "Australia news live: Albanese expected to meet Zelenskyy in Rome; Watt says EPA needs ‘teeth’",
    "domain": "general",
    "location": "global",
    "published": "Sat, 17 May 2025 23:49:18 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>The environment minister has said establishing a federal environment protection agency was a ‘very high and immediate priority’. Follow the latest updates live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p><strong>Liberals must ‘build from the bottom up’ after election disaster – Ruston</strong></p><p>Asked why the Liberals were now reviewing their embrace of the Paris climate agreement under the former government of <strong>Scott</strong> <strong>Morrison</strong>, Ruston says the walloping voters handed the party meant “absolutely everything” was up for review.</p><p>To be quite frank, we have to build from the bottom up again because that election result was quite disastrous for the Liberal party and we need to be open and honest with ourselves about what we need to take forward so that we are meeting Australia where they are and not talking about where we are.</p><p><strong>Clearly we need to be doing something different.</strong> I think, you know, keeping an open mind, making sure we’re honest and open with that analysis of what went wrong, and actually come out with a policy proposal and a modern Liberal party, still maintaining all of the values that we hold so dearly.</p><p>Oh God, no, no, anything but, please. We have been there before many times over the past 20 years or so and to reopen the climate wars, as you aptly describe them, is like reopening an old wound.</p><p>But there’s no secret there is a divergence of views in our party room about how we achieve that, but right now, I absolutely think the thing we need to concentrate on is making sure that people can afford their power bills, making sure that industry, as Innes points out, that they have confidence in our energy policy in Australia so they can’t to invest here.</p><p>We don’t want companies to go broke like we have seen. We don’t want companies offshoring like we have seen. I think one of the most important issues is to get, you know, solid feedback and make sure our energy policy is fit for purpose for modern Australia.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/18/anthony-albanese-rome-pope-leo-inauguration-volodymyr-zelenskyy-meeting-ntwnfb\">Continue reading...</a>",
      "<p>The environment minister has said establishing a federal environment protection agency was a ‘very high and immediate priority’. Follow the latest updates live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p><strong>Liberals must ‘build from the bottom up’ after election disaster – Ruston</strong></p><p>Asked why the Liberals were now reviewing their embrace of the Paris climate agreement under the former government of <strong>Scott</strong> <strong>Morrison</strong>, Ruston says the walloping voters handed the party meant “absolutely everything” was up for review.</p><p>To be quite frank, we have to build from the bottom up again because that election result was quite disastrous for the Liberal party and we need to be open and honest with ourselves about what we need to take forward so that we are meeting Australia where they are and not talking about where we are.</p><p><strong>Clearly we need to be doing something different.</strong> I think, you know, keeping an open mind, making sure we’re honest and open with that analysis of what went wrong, and actually come out with a policy proposal and a modern Liberal party, still maintaining all of the values that we hold so dearly.</p><p>Oh God, no, no, anything but, please. We have been there before many times over the past 20 years or so and to reopen the climate wars, as you aptly describe them, is like reopening an old wound.</p><p>But there’s no secret there is a divergence of views in our party room about how we achieve that, but right now, I absolutely think the thing we need to concentrate on is making sure that people can afford their power bills, making sure that industry, as Innes points out, that they have confidence in our energy policy in Australia so they can’t to invest here.</p><p>We don’t want companies to go broke like we have seen. We don’t want companies offshoring like we have seen. I think one of the most important issues is to get, you know, solid feedback and make sure our energy policy is fit for purpose for modern Australia.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/18/anthony-albanese-rome-pope-leo-inauguration-volodymyr-zelenskyy-meeting-ntwnfb\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/eeb27a9f1296d3314c0cbcbfb11e83abc7cff4b4/384_0_3237_2591/master/3237.jpg?width=140&quality=85&auto=format&fit=max&s=9bfb61ea29e5c6ea1b18f1020cf52d51",
    "titles": [
      "Australia news live: Albanese expected to meet Zelenskyy in Rome; Watt says EPA needs ‘teeth’",
      "Australia news live: Albanese expected to meet Zelenskyy in Rome; Watt says EPA needs ‘teeth’"
    ],
    "summary": "The environment minister prioritizes establishing a federal environment protection agency, emphasizing its urgency. Following a significant election defeat, the Liberals are reassessing their stance on the Paris climate agreement and other policies. The party acknowledges the need for a comprehensive review and a shift in approach to align with public expectations and to address Australia's energy policy challenges, emphasizing affordability and investment confidence. This reflects a broader effort to modernize the party and its policies while avoiding past conflicts over climate policy.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it provides a deeper understanding of the political landscape in Australia, particularly in relation to environmental policy. It reports on the potential establishment of a federal environment protection agency and the Liberals' reassessment of their stance on the Paris climate agreement. This information could be useful to readers interested in environmental policy and politics, and it highlights progress in addressing climate change.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 9.53
  },
  {
    "title": "US PGA Championship golf 2025: day three – as it happened",
    "domain": "general",
    "location": "global",
    "published": "Sat, 17 May 2025 23:31:38 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>Scottie Scheffler opened up a possibly decisive lead with some almost flawless golf down the closing stretch at Quail Hollow</li><li><a href=\"https://www.pgachampionship.com/leaderboard\">Official leaderboard</a></li></ul><p><strong>… so having given Scottie Scheffler the grandstand introduction, he double-crosses himself and sends his approach at 1 towards the gallery to the left of the green.</strong> He’ll have a hell of a chip from there, from thick rough over sand. A pleasing symmetry to this.</p><p><strong>… so having given Rory McIlroy the grandstand introduction, he carves his second at 10 towards the gallery to the right of the green.</strong> He’ll have a hell of a chip from there, from thick rough over sand. Meanwhile his playing partner, the defending champion Xander Schauffele, leaves his approach short and right, and immediately hollers “Mud ball!” Ah yes, mud balls …</p> <a href=\"https://www.theguardian.com/sport/live/2025/may/17/us-pga-championship-2025-golf-day-three-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/3c8b5d6cba98fc3ef02f36410b5eea2655cf443a/339_0_3401_2720/master/3401.jpg?width=140&quality=85&auto=format&fit=max&s=cb44e29073b16aff91bdd4e355c95705",
    "titles": [
      "US PGA Championship golf 2025: day three – as it happened"
    ],
    "summary": "Scottie Scheffler took a significant lead at Quail Hollow with outstanding golf towards the end, despite a challenging shot at hole 1 where he sent his approach into the gallery. Concurrently, Rory McIlroy faced a similar difficulty at hole 10, also hitting into the gallery. Both players encountered tough recovery shots from thick rough over sand. The event also highlighted a moment with Xander Schauffele, the defending champion, dealing with a \"mud ball\" issue on his approach. The detailed standings and progress can be checked on the official PGA Championship leaderboard.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story provides a detailed account of the day's events in the PGA Championship, it doesn't provide much in the way of actionable insights or deeper understanding beyond the specific event. It does, however, provide a useful context for those interested in golf, and highlights the progress and challenges of the players involved.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.553,
    "normalized_score": 5.76
  },
  {
    "title": "‘I’m scared’: Mistakenly-released suspect speaks out, explains TikTok posts",
    "domain": "general",
    "location": "national",
    "published": "Sat, 17 May 2025 23:11:42 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "An Alberta woman who was mistakenly released from jail is telling her side of the story, including discussing her TikTok videos calling out the police."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/Mackenzie-Dawn-Hardy-.jpg?quality=85&strip=all",
    "titles": [
      "‘I’m scared’: Mistakenly-released suspect speaks out, explains TikTok posts"
    ],
    "summary": "An Alberta woman, erroneously released from jail, has shared her perspective, including her TikTok posts criticizing the police. This incident has brought her personal experience into the public eye, highlighting the mistake in her release and her subsequent actions on social media.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a specific incident involving a mistakenly-released suspect, but it doesn't offer much depth or insight beyond the specific case. It does not provide actionable insights or a deeper understanding of the justice system, nor does it report on solutions or improvements. However, it does raise awareness about potential issues in the justice system.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.988,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.55,
    "normalized_score": 5.41
  },
  {
    "title": "Clement hits walk-off single, Jays beat Tigers 2-1",
    "domain": "general",
    "location": "national",
    "published": "Sat, 17 May 2025 23:06:54 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Ernie Clement emerged for his post-game session with reporters on Saturday with a massive ice bag on his right throwing shoulder.",
      "Ernie Clement's ninth-inning walk-off single to centre field lifted the Toronto Blue Jays to a 2-1 come-from-behind win against the Detroit Tigers on Saturday."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/d3b07bfbc97d1a5a8080dad821fae49f335c8e160d36c11f6ef7c283d352666e_c47ec0.jpg?quality=85&strip=all",
    "titles": [
      "Clement hits walk-off single, Jays beat Tigers 2-1",
      "Clement hits walk-off single, Jays beat Tigers 2-1"
    ],
    "summary": "Ernie Clement, playing for the Toronto Blue Jays, secured a 2-1 victory against the Detroit Tigers with a ninth-inning walk-off single to center field on Saturday. Following the game, he appeared for interviews with a large ice bag on his right shoulder, indicating a possible injury concern. This performance contributed to a come-from-behind win for his team.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a recent sports event, but it does not offer deeper understanding or actionable insights. It also does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.987,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.522,
    "normalized_score": 2.12
  },
  {
    "title": "Austria wins 69th Eurovision song contest with Wasted Love",
    "domain": "general",
    "location": "global",
    "published": "Sat, 17 May 2025 23:05:26 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Israel finished second, with Estonia third and the pre-contest favourites from Sweden fourth</p><p>Austria has won the Eurovision song contest after JJ triumphed in Basel with their song Wasted Love, an operatic ballad with soaring vocals that mutates into a club anthem for the finale. It is the third time the country has won, with JJ following in the footsteps of Udo Jürgens in 1965 and Conchita Wurst in 2014.</p><p>Switzerland, which hosted the first ever Eurovision song contest in 1956, was the venue this year after Nemo won in Malmö last year with their song The Code. Austria will be expected to host in 2026, with Vienna having twice held the competition before.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/may/18/eurovision-song-contest-winner-2025\">Continue reading...</a>",
      "<p>Israel finished second, with Estonia third and the pre-contest favourites from Sweden fourth</p><p>Austria has won the Eurovision song contest after JJ triumphed in Basel with their song Wasted Love, an operatic ballad with soaring vocals that mutates into a club anthem for the finale. It is the third time the country has won, with JJ following in the footsteps of Udo Jürgens in 1965 and Conchita Wurst in 2014.</p><p>Switzerland, which hosted the first ever Eurovision song contest in 1956, was the venue this year after Nemo won in Malmö last year with their song The Code. Austria will be expected to host in 2026, with Vienna having twice held the competition before.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/may/18/eurovision-song-contest-winner-2025\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/572449fccc9af17f020d7662c4d6b2425d8c6bd3/389_0_2320_1857/master/2320.jpg?width=140&quality=85&auto=format&fit=max&s=267523fed38485e2d4762bf497c2c20e",
    "titles": [
      "Austria wins 69th Eurovision song contest with Wasted Love",
      "Austria wins 69th Eurovision song contest with Wasted Love"
    ],
    "summary": "Austria won the Eurovision Song Contest with JJ's song \"Wasted Love,\" marking the country's third victory in the competition's history. The operatic ballad, which transitions into a club anthem, secured first place in Basel, Switzerland. Israel, Estonia, and pre-contest favorites Sweden finished second, third, and fourth respectively. This win follows Austria's previous victories in 1965 and 2014. Switzerland, hosting the event this year, had previously hosted the first Eurovision in 1956. Austria is expected to host the next contest in 2026.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about the Eurovision Song Contest and the winner. However, it does not provide actionable insights or deeper understanding. It also does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.541,
    "normalized_score": 4.35
  },
  {
    "title": "Bernardeschi double as Toronto hit Montreal for six",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 17 May 2025 23:50:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Former Juventus winger Federico Bernardeschi scored twice as Toronto FC romped to a 6-1 win at Canadian rivals Montreal in Major League Soccer on Saturday.Later on Saturday, the Columbus Crew host FC Cincinnati in a Ohio derby featuring third against first in the Eastern Conference."
    ],
    "image_url": "",
    "titles": [
      "Bernardeschi double as Toronto hit Montreal for six"
    ],
    "summary": "Former Juventus winger Federico Bernardeschi scored two goals, leading Toronto FC to a significant 6-1 victory over Montreal in Major League Soccer. This match highlighted the performance of Toronto FC against their Canadian rivals. Additionally, an Ohio derby took place with Columbus Crew hosting FC Cincinnati, featuring a match-up of third against first in the Eastern Conference.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a recent sports event, but it does not offer deeper understanding or actionable insights. It also does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 0.12
  },
  {
    "title": "WATCH: Dave Van Horn postgame - Arkansas 8, Tennessee 4",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 17 May 2025 23:48:13 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Arkansas baseball head coach Dave Van Horn's postgame press conference after the 8-4 win over the Tennessee Volunteers."
    ],
    "image_url": "",
    "titles": [
      "WATCH: Dave Van Horn postgame - Arkansas 8, Tennessee 4"
    ],
    "summary": "Following an 8-4 victory over the Tennessee Volunteers, Arkansas baseball head coach Dave Van Horn shared insights during a postgame press conference. The win reflects the team's performance and strategy, contributing to their season's success. Coach Van Horn's comments highlighted the team's efforts and the significance of this win in their progress.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the team's strategy and performance from the coach's perspective, contributing to a deeper understanding of the game. However, it doesn't particularly highlight progress or solutions, nor does it increase awareness around broader systems or impacts.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.544,
    "normalized_score": 4.71
  },
  {
    "title": "Journalism wins 150th Preakness Stakes",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 17 May 2025 23:45:42 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Pre-race favourite Journalism stormed to victory in the 150th Preakness Stakes on Saturday, producing a devastating finish to claim the second leg of US horse racing's Triple Crown.I won one of the legs of the Triple Crown and I'm crying like a kid.&quot;"
    ],
    "image_url": "",
    "titles": [
      "Journalism wins 150th Preakness Stakes"
    ],
    "summary": "Journalism won the 150th Preakness Stakes, the second leg of the US Triple Crown, with a strong finish. This victory at one of horse racing's most prestigious events left the jockey emotionally overwhelmed, expressing tears of joy.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the event's outcome, but lacks depth or insight into the significance of the win, the strategies employed, or the impacts on the broader horse racing system. It doesn't provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "How Glasner led Palace through darkness to light of FA Cup glory",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 17 May 2025 23:44:29 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "After their worst start to a season in more than 30 years, how did manager Oliver Glasner steer Crystal Palace to their first major trophy?"
    ],
    "image_url": "",
    "titles": [
      "How Glasner led Palace through darkness to light of FA Cup glory"
    ],
    "summary": "Oliver Glasner led Crystal Palace to their first major trophy following the team's worst season start in over 30 years. He implemented strategic changes and motivated the squad, resulting in a significant turnaround in their performance. This achievement marks a historic moment for Crystal Palace, showcasing Glasner's effective leadership and tactical acumen in overcoming initial setbacks.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and solutions, providing empowering knowledge about effective leadership and strategic changes in sports. It offers a deep understanding of the team's journey from a difficult start to a historic achievement, increasing awareness of the impacts of such a turnaround.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.564,
    "normalized_score": 7.06
  },
  {
    "title": "Boys volleyball: King's Academy wins Class 1A state championship in sweeping fashion",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 17 May 2025 23:44:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "King's Academy has another state championship, the first in boys volleyball program history."
    ],
    "image_url": "",
    "titles": [
      "Boys volleyball: King's Academy wins Class 1A state championship in sweeping fashion"
    ],
    "summary": "King's Academy has won its first state championship in boys volleyball, marking a historic achievement for the program. This victory represents the school's latest state title across its sports teams.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides a basic awareness of a sports event, it does not offer deeper insights or understanding that could be useful to the reader. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "We left the U.S. for Italy and pay $1,850 a month for our 3-bedroom apartment—we couldn't be happier",
    "domain": "business",
    "location": "national",
    "published": "Sat, 17 May 2025 23:39:23 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Doing Italy founder Thea Duncan Prando shares a look inside her home in Milan, Italy. \"I feel incredibly blessed, and I couldn't be happier to be here.\""
    ],
    "image_url": "",
    "titles": [
      "We left the U.S. for Italy and pay $1,850 a month for our 3-bedroom apartment—we couldn't be happier"
    ],
    "summary": "Thea Duncan Prando, founder of Doing Italy, has opened up about her life in Milan, Italy, expressing gratitude and happiness with her living situation. She feels \"incredibly blessed\" to reside in Milan.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides a basic awareness about living costs in Italy and the personal satisfaction of the subject. However, it lacks depth and actionable insights that could be useful to readers considering a similar move. It also does not highlight any solutions, improvements, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.544,
    "normalized_score": 4.71
  },
  {
    "title": "New York Republican floats higher tax rate to pay for SALT",
    "domain": "business",
    "location": "global",
    "published": "Sat, 17 May 2025 23:23:57 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "“The One Big Beautiful Bill has stalled — and it needs wind in its sails,” New York Representative Nick LaLota posted Saturday on X."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2214587628-e1747523991894.jpg?w=2048",
    "titles": [
      "New York Republican floats higher tax rate to pay for SALT"
    ],
    "summary": "New York Representative Nick LaLota announced on X (formerly Twitter) that the One Big Beautiful Bill has stalled in its legislative process. He emphasized the need for renewed momentum to advance the bill.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a potential solution to a legislative issue, which could be useful to readers interested in tax policy. However, it lacks details about the proposed tax rate or how it would solve the problem, limiting its usefulness and depth.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.991,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.563,
    "normalized_score": 6.94
  },
  {
    "title": "US says no decision yet on whether to drop Boeing criminal case",
    "domain": "business",
    "location": "global",
    "published": "Sat, 17 May 2025 23:16:18 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The long-running criminal proceedings are tied to Boeing 737 Max crashes in 2018 and 2019."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2157642812-e1747523499472.jpg?w=2048",
    "titles": [
      "US says no decision yet on whether to drop Boeing criminal case"
    ],
    "summary": "The criminal proceedings related to the Boeing 737 Max crashes in 2018 and 2019 involve investigations and legal actions following the two fatal accidents. These incidents raised questions about aircraft safety and regulatory oversight, leading to worldwide grounding of the 737 Max fleet and extensive reviews of Boeing's design and manufacturing processes. The outcome or current status of these proceedings focuses on accountability for the crashes and ensuring future aviation safety.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a useful update on an ongoing legal case related to aircraft safety, which is a matter of public concern. It does not, however, report on any progress made in terms of solutions or improvements to the issues raised by the Boeing 737 Max crashes.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.572,
    "normalized_score": 8.0
  },
  {
    "title": "AI chips are the new ‘coin of the realm’ as they grease the wheels of geopolitical negotiations, BofA says",
    "domain": "business",
    "location": "global",
    "published": "Sat, 17 May 2025 22:59:39 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Analysts cited the \"Important role played by AI chips as part of geopolitical negotiations around trade/tariffs (GPU as the new 'coin of the realm').\""
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2214859450-e1747517962623.jpg?w=2048",
    "titles": [
      "AI chips are the new ‘coin of the realm’ as they grease the wheels of geopolitical negotiations, BofA says"
    ],
    "summary": "Analysts have highlighted the significant role of AI chips, particularly GPUs, in geopolitical negotiations related to trade and tariffs, indicating their increasing importance and value in global economic discussions. This marks GPUs as crucial assets in international trade agreements.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story highlights an emerging trend in international trade and geopolitics, providing readers with a deeper understanding of the role of technology in these areas. It also suggests a shift in the value of commodities in global economic discussions, which could be seen as a form of progress or innovation.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.589,
    "normalized_score": 10.0
  },
  {
    "title": "UK police arrest second man in connection with Starmer arson attacks",
    "domain": "business",
    "location": "global",
    "published": "Sat, 17 May 2025 22:33:23 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "26-year old arrested at Luton airport on Saturday after Ukrainian national was charged this week"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7935d371-ba1a-457e-96c8-ea2dbf05852e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK police arrest second man in connection with Starmer arson attacks"
    ],
    "summary": "A 26-year-old was arrested at Luton Airport on Saturday, following the recent charge of a Ukrainian national earlier in the week.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides an update on a criminal case of public interest, it does not offer much in the way of deeper understanding or actionable insights. It does, however, contribute to awareness of the ongoing investigation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.979,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.539,
    "normalized_score": 4.12
  },
  {
    "title": "Magenta Auroras and Satellite Chaos: The Solar Storm That Hijacked NASA’s Drill",
    "domain": "science",
    "location": "global",
    "published": "Sat, 17 May 2025 23:18:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/magenta-auroras-and-satellite-chaos-the-solar-storm-that-hijacked-nasas-drill/\" rel=\"nofollow\" title=\"Magenta Auroras and Satellite Chaos: The Solar Storm That Hijacked NASA’s Drill\"><img alt=\"Stars Glitter Above Aurora in Earth’s Atmosphere\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Stars-Glitter-Above-Aurora-in-Earths-Atmosphere-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A surprise solar storm turned a NASA simulation into a real-world space weather crisis. As the Gannon geomagnetic storm struck Earth, it disrupted satellites, grounded flights, heated the atmosphere to extreme temperatures, and even shook up Mars. Auroras danced in skies far from the poles, satellites scrambled to stay in orbit, and a new radiation [...]"
    ],
    "image_url": "",
    "titles": [
      "Magenta Auroras and Satellite Chaos: The Solar Storm That Hijacked NASA’s Drill"
    ],
    "summary": "A surprise solar storm, known as the Gannon geomagnetic storm, hit Earth, disrupting satellites, grounding flights, and heating the atmosphere to extreme levels. This event also affected Mars and caused unusual magenta auroras to appear far from the poles. Originally coinciding with a NASA simulation, the storm turned into a real-world space weather crisis, complicating satellite operations and showcasing the potential chaos such solar events can cause.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of the impact of solar storms on Earth and Mars, highlighting the potential chaos they can cause. It does not, however, offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.562,
    "normalized_score": 6.82
  },
  {
    "title": "Eruption Loading: New Volcano Warning System Hears the Earth Before It Blows",
    "domain": "science",
    "location": "global",
    "published": "Sat, 17 May 2025 22:53:28 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/eruption-loading-new-volcano-warning-system-hears-the-earth-before-it-blows/\" rel=\"nofollow\" title=\"Eruption Loading: New Volcano Warning System Hears the Earth Before It Blows\"><img alt=\"Aerial view of Ontake Volcano, Honshū Island, Japan\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Aerial-view-of-Ontake-Volcano-Honshu-Island-Japan-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Oxford researchers found that changes in shear-wave splitting can predict volcanic eruptions and their severity. The signal shifted noticeably before a major eruption at Ontake Volcano, offering a promising early warning tool. A new study led by Professor Mike Kendall from the Department of Earth Sciences has explored a novel monitoring method for providing early [...]"
    ],
    "image_url": "",
    "titles": [
      "Eruption Loading: New Volcano Warning System Hears the Earth Before It Blows"
    ],
    "summary": "Researchers at Oxford University have developed a new volcano warning system that can predict eruptions and their severity by detecting changes in shear-wave splitting. This method was notably effective before a major eruption at Ontake Volcano in Japan. The study, led by Professor Mike Kendall, introduces a promising tool for early volcanic eruption detection, enhancing safety measures for potentially affected areas.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovation that can predict volcanic eruptions, thereby enhancing safety measures. It gives the reader a deeper understanding of the technology and its potential benefits.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.984,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.581,
    "normalized_score": 9.06
  },
  {
    "title": "The Next Earthquake Is Long Overdue: New Research Reveals Wasatch Fault More Dangerous Than Previously Believed",
    "domain": "science",
    "location": "global",
    "published": "Sat, 17 May 2025 22:28:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-next-earthquake-is-long-overdue-new-research-reveals-wasatch-fault-more-dangerous-than-previously-believed/\" rel=\"nofollow\" title=\"The Next Earthquake Is Long Overdue: New Research Reveals Wasatch Fault More Dangerous Than Previously Believed\"><img alt=\"Earthquake Forecasting Technology Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Earthquake-Forecasting-Technology-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A new paper explains how the properties of fault rocks and geologic events that took place over a billion years ago could signal concerning seismic activity for Utah&#8217;s population center. Utah’s Wasatch Fault extends about 240 miles along the western edge of the Wasatch Mountains, from southern Idaho to central Utah. It runs through Salt [...]"
    ],
    "image_url": "",
    "titles": [
      "The Next Earthquake Is Long Overdue: New Research Reveals Wasatch Fault More Dangerous Than Previously Believed"
    ],
    "summary": "New research indicates that Utah's Wasatch Fault, a 240-mile fault line running from southern Idaho to central Utah, is more dangerous than previously thought. The study highlights that the properties of fault rocks and geological events dating back over a billion years suggest an increased risk of seismic activity for Utah's population centers located along the fault. This finding suggests that the area may be overdue for a significant earthquake, raising concerns for the safety and preparedness of the region.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the increased risk of seismic activity in the Wasatch Fault region. It provides a deeper understanding of the geological factors contributing to this risk, but does not offer actionable insights or report on solutions to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.978,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.569,
    "normalized_score": 7.65
  },
  {
    "title": "The Winter Vitamin D Crash – And the Workout That Prevents It",
    "domain": "science",
    "location": "global",
    "published": "Sat, 17 May 2025 15:01:21 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-winter-vitamin-d-crash-and-the-workout-that-prevents-it/\" rel=\"nofollow\" title=\"The Winter Vitamin D Crash – And the Workout That Prevents It\"><img alt=\"Winter Sunshine Vitamin D Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Winter-Sunshine-Vitamin-D-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New research shows that staying active in winter doesn’t just keep you fit—it also protects your vitamin D levels. The sun might be shining now, giving our vitamin D levels a natural boost, but not long ago we were in the depths of winter. During those colder, darker months, sunlight is limited, and vitamin D [...]"
    ],
    "image_url": "",
    "titles": [
      "The Winter Vitamin D Crash – And the Workout That Prevents It"
    ],
    "summary": "New research indicates that maintaining physical activity during the winter can help preserve vitamin D levels, which typically drop due to reduced sunlight exposure in the colder, darker months. This finding suggests that exercise can be a crucial factor in preventing the seasonal decline in vitamin D.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers on how to maintain vitamin D levels during winter months. It also reports on new research, contributing to the reader's understanding of the relationship between exercise and vitamin D. It increases awareness about a health issue that affects many people during the winter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.874,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.548,
    "normalized_score": 5.18
  },
  {
    "title": "Is Your Salt Habit Secretly Fueling Depression?",
    "domain": "science",
    "location": "global",
    "published": "Sat, 17 May 2025 14:36:53 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/is-your-salt-habit-secretly-fueling-depression/\" rel=\"nofollow\" title=\"Is Your Salt Habit Secretly Fueling Depression?\"><img alt=\"Salt Sadness Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Salt-Sadness-Art-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Too much salt doesn&#8217;t just affect your heart—it may also impact your mood. Scientists discovered that high-salt diets in mice led to depression-like behavior through immune system activity. Cutting out certain immune cells reversed the symptoms, pointing to new ways we might treat or even prevent depression. High-Salt Diet Linked to Depression A new study [...]"
    ],
    "image_url": "",
    "titles": [
      "Is Your Salt Habit Secretly Fueling Depression?"
    ],
    "summary": "A recent study has found that high-salt diets can lead to depression-like behavior in mice by affecting the immune system. Researchers discovered that eliminating certain immune cells could reverse these symptoms. This insight suggests potential new methods for treating or preventing depression linked to high salt intake.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive because it gives readers a deeper understanding of the potential link between high-salt diets and depression. It reports on new research and potential methods for treating or preventing depression related to diet, contributing to awareness and understanding of mental health. However, it falls slightly short of a full score as it does not provide actionable insights for readers to apply in their daily lives.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.869,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.536,
    "normalized_score": 3.76
  }
]