[
  {
    "title": "US and Ukraine Unveil Revised Peace Framework Amid Ongoing War Talks",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 09:53:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "Washington Post",
      "New York Times",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "ft.com",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "“Trump has squeezed and pushed the Ukrainians very, very hard.”",
      "Turning the document into something acceptable for Kyiv and its European allies will be a mammoth diplomatic undertaking",
      "Negotiators had been working off an early proposal that bipartisan lawmakers say would further destabilize global security and reward Russia after its 2022 invasion.",
      "President Trump lashed out at Ukraine even as the talks on his peace proposal were still taking place, accusing the country’s leadership of being ungrateful for American support.",
      "Rubio says 'tremendous' progress made in meetings with Ukrainian officials on proposals to halt the war.",
      "US, Ukraine to continue work on 'refined' peace plan to end war with Russia Reuters",
      "Full text of European counter-proposal to US Ukraine peace plan Reuters",
      "US, Ukraine say they have an 'updated and refined' peace framework, but questions remain Reuters",
      "US-Ukraine statement comes hours after European countries propose their own alternative peace The US and Ukraine said they had created an “updated and refined peace framework” to end the war with Russia, hours after European countries proposed their own radical alternative that omitted some of the p"
    ],
    "image_url": "",
    "titles": [
      "US plan to stop Ukraine war is “not reasonable”",
      "US peace plan: what could Ukraine compromise on?",
      "U.S., Ukraine agree to change draft of peace plan that appeased Russia",
      "Ukraine, U.S. Meet About Trump’s Peace Plan to End War With Russia",
      "US and Ukraine announce ‘updated’ framework to end Russia’s war",
      "US, Ukraine to continue work on 'refined' peace plan to end war with Russia - Reuters",
      "Full text of European counter-proposal to US Ukraine peace plan - Reuters",
      "US, Ukraine say they have an 'updated and refined' peace framework, but questions remain - Reuters",
      "US and Ukraine promise ‘updated’ peace framework after criticism of pro-Russian points in original plan"
    ],
    "url": "https://www.aljazeera.com/video/quotable/2025/11/24/us-plan-to-stop-ukraine-war-is-not?traffic_source=rss",
    "alternate_urls": [
      "https://www.ft.com/content/c24e59c2-1d01-4b85-afd3-a928a8ed7e6c",
      "https://www.washingtonpost.com/world/2025/11/23/ukraine-peace-plan-russian-wish-list/",
      "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
      "https://www.aljazeera.com/news/2025/11/23/us-very-optimistic-ukraine-peace-plan-can-be-reached-very-soon-rubio?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOQlZ4dDhwMjI1X2FGaEVWUWhNUmE3UVZYalFxQk9pZVZTTTZxYXBMemdXak42bnc4WXoyU0k3b0hGWjBhS210MWlpaWVnMk56UXZVTV9lMWx6amxLd2NJRzF6MmF0MWZrUWxhbUVMV0x2bEJsaTB3dGVld0ZNZkRsYmhQSUxBSkE2ZVdyY3pHMjJSbm5hQml0RE42M1FwMDNMazI4Vy1RN24zalVJYU1sdlJn?oc=5",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxOb042TVF2UXBJTHUtdXBhNXRvRThZX3Z5ZG00ZmhkTGxOcFJvYS1adk44TkUyWTdtN2x0X3VzM3Jac0JfaUxXYjcwNzE0OVRuN3loWExxSDFPLWxFTktUaHBtTTc5ZEhQVjZ1MTBkeVJXTlk4ampjU05tNWhwS21Rbmh3aXcwbTFhV3MwWkdHT3ZoTzdxeE1BdTVEQm5qY2QwTlgzRlJxVVVjWjh3Y2ww?oc=5",
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNzlLeE5xM2h6ZzR4Nm1PcUw3LWpFR3dRcDlWMVo5UzNmSmpLRl9zNERuU2o2M3NiZzZpcmRjUmNRSjNkYXdlUnVGSldZRWl5al9BbDVzT2I3UlZUZWdRWnZvZ05iWU4zcWlvZlpjd3duYl8tQWhiY2F6UFdnN3RaZFpIdlhFRS1CUWlfWEhudGxTYUU3VGFZS2N4Q0FEeE8zSm9jcF9MNTgteXduT3BPOUhERm15bzg?oc=5",
      "https://www.theguardian.com/world/2025/nov/23/trump-ukraine-zero-gratitude-peace-plan-international-talks"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/quotable/2025/11/24/us-plan-to-stop-ukraine-war-is-not?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.994,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.929,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US and Ukraine announced they have developed an “updated and refined” peace framework aimed at ending the war with Russia. This follows European countries presenting their own alternative proposal. Negotiations have been challenging, with concerns that earlier US proposals could destabilize security and benefit Russia. Talks will continue as parties seek a plan acceptable to Ukraine and its allies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the ongoing war talks between the US, Ukraine, and Russia. It reports on an attempt to solve a significant problem, which is the war with Russia. However, it does not provide enough detail about the proposed peace framework to fully empower the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Dallas Wings Win 2026 WNBA Draft Lottery, Secure Top Pick for Second Year",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:46:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Forbes",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "forbes.com",
      "sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "For the second year in a row, the Dallas Wings will select first in the 2026 WNBA draft after winning the draft lottery Sunday.",
      "Azzi Fudd is the new projected No. 1 pick after Dallas won the draft lottery for the second consecutive year.",
      "The Wings had the best odds to win the lottery at 42%",
      "Dallas' back-to-back lottery wins highlight a pivotal draft year as teams across the league prepare for major roster decisions.",
      "The Dallas Wings won the WNBA draft lottery for the second consecutive season on Sunday night. The Wings, who drafted Paige Bueckers No. 1 last year, had a 42% chance to secure the top pick again. “This is an integral piece, a core piece,” Dallas general manager Curt Miller said. “In recent draft classes, you see what consecutive No. 1’s can do.” Earlier this month, the Wings hired longtime college coach Jose Fernandez to lead the franchise. “Exciting times with our young core and new facilities and new coach,” Miller said. “Great moment.” Minnesota, which had the best record in the league...",
      "Dallas Wings Win No. 1 Pick in WNBA Draft for Second Straight Year Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Wings again win WNBA draft lottery, to pick No. 1",
      "UConn's Fudd is new No. 1 as Wings win lottery",
      "Winners and losers from the 2026 WNBA Draft Lottery: Dallas Wings get No. 1 pick, Chicago Sky's woes continue",
      "WNBA Draft Lottery: Buecker’s Wings Win Top Pick",
      "Dallas Wings to pick first in 2026 WNBA Draft after winning lottery",
      "Dallas Wings Win No. 1 Pick in WNBA Draft for Second Straight Year - Sports Illustrated"
    ],
    "url": "https://www.espn.com/wnba/story/_/id/47078662/dallas-wings-win-2026-wnba-draft-lottery",
    "alternate_urls": [
      "https://www.espn.com/wnba/story/_/id/47077823/wnba-mock-draft-2026-lottery-dallas-wings-no-1-pick-awa-fam-betts-miles-latson-johnson-fudd",
      "https://www.cbssports.com/wnba/news/2026-wnba-draft-lottery-dallas-wings-win-no-1-overall-pick/",
      "https://www.forbes.com/sites/roberta-rodrigues/2025/11/24/wnba-draft-lottery-bueckers-wings-win-top-pick/",
      "https://news.google.com/rss/articles/CBMijAFBVV95cUxQRXhVM3JKUVYxUnM4Z2VfeXRQdDIxY01RQzRWWnY3b1dEUWxkb3lIQ0MxRTV4amxiOUJ4MlNUWW5vSjhsM3I1YkhXbUsyWWJKS25NUFFyVXozT1MxX3d6WDAwTkF4UGFCYTQxb2JfQ25Sanh2Mmd4OE9ET2k2dEsyR2FlaG9zTmFLalhGMQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/wnba/story/_/id/47078662/dallas-wings-win-2026-wnba-draft-lottery",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.931,
      "consensus": 0.995,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.9,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dallas Wings have secured the No. 1 pick in the 2026 WNBA draft after winning the draft lottery for the second consecutive year. The team had the highest odds at 42% and previously selected Paige Bueckers first overall last year. Azzi Fudd is currently projected as the top pick. The Wings recently hired Jose Fernandez as head coach, marking a period of significant changes for the franchise.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Dallas Wings' success in the draft lottery and their recent changes. However, it doesn't delve into the implications of these changes or the potential impact of the top pick on the team's future performance.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Airstrike in Beirut Kills Hezbollah Chief of Staff, Escalates Tensions",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 06:47:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "NPR",
      "Reuters",
      "Washington Post",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "npr.org",
      "news.google.com",
      "washingtonpost.com",
      "cbc.ca"
    ],
    "snippets": [
      "Attack, which killed five, is the first to target Beirut since a ceasefire was agreed a year ago.",
      "Israel has escalated its campaign on targets it says are linked to Hezbollah, raising fears of a resumption of hostilities.",
      "An Israeli airstrike has struck Beirut for the first time since June.",
      "Israel kills Hezbollah military leader in Beirut strike Reuters",
      "Hezbollah chief of staff killed in Israeli strike on Beirut, Israeli media says Reuters",
      "The Israeli attack targeting Haytham Ali Tabatabai was the first strike on Beirut in more than five months and fueled fears that a wider war could be brewing.",
      "Israel carried out an airstrike on a southern Beirut suburb on Sunday, saying it killed Hezbollah’s chief of staff Haytham Tabtabai and warning the Iran-backed militant group not to rearm and rebuild a year after their latest war."
    ],
    "image_url": "",
    "titles": [
      "Israeli strike on Lebanon’s capital Beirut kills Hezbollah official",
      "Israel kills top Hezbollah official in first attack on Beirut in months",
      "Israel says it killed a senior Hezbollah official in first strike on Beirut in months",
      "Israel kills Hezbollah military leader in Beirut strike - Reuters",
      "Hezbollah chief of staff killed in Israeli strike on Beirut, Israeli media says - Reuters",
      "Israeli strike on Beirut kills top Hezbollah military official",
      "Israel strikes Lebanon's capital killing top Hezbollah official, despite ceasefire"
    ],
    "url": "https://www.aljazeera.com/gallery/2025/11/24/israeli-strike-on-lebanons-capital-beirut-kills-hezbollah-official?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cn81j54xjx1o?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/11/23/nx-s1-5618206/israel-hezbollah-militant-attack",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNNnREUkVrQV9OcWs3RkNLaU4tbmU0TDNvZDc4TXgyc3VKdGpuMkJUY01ybXhSaVZFSl91eUhBb0FkWXZLeDVsUm5YZXB4UDlVbzhuQlowejNwdW1sNk1TUXZUdEk5TlY1Tnd5cW5tUFd6eV9qNVg1T3FDMkVKVzQ5cjZFV1AxcnMtcjhfMGQ1bXZVY1VIQW41dUNZc3h4NjdGZ0hUNGkya1VSN1hucE1aZS1oeVlFQXQ4RWo2aA?oc=5",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQYmxTNmttQVhMNkRfZkFXbDdtVW1OU0d3T3FlcVhvX1BZMUM5MzJWM1lWT24yNzhXR1dTQmZpNVBYWG05NUtJZnRST0NsRERUaHI3Y0JWQ0wyRWxyY2xRamNjX2FxaHZDUUxYOXBYZkJIYkd1c2hCeXltNWFGdXNSdEdidDNzb09HM0x4QXQtaWxkSThPMlhhY1laTVNhbmw2bnN1OHdxWjJ6RFUzUDV1ZjJ4TEF4eElvb0xKTmFKaTA?oc=5",
      "https://www.washingtonpost.com/world/2025/11/23/israel-strike-beirut-hezbollah-tabatabai/",
      "https://www.cbc.ca/news/world/israel-strike-hezbollah-beirut-9.6989505?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/gallery/2025/11/24/israeli-strike-on-lebanons-capital-beirut-kills-hezbollah-official?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.896,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike on a southern suburb of Beirut, killing Hezbollah’s chief of staff, Haytham Tabtabai, along with at least four others. This marks the first Israeli strike on Beirut since June and follows a year-old ceasefire. The attack significantly escalates tensions between Israel and Hezbollah, raising concerns about renewed hostilities in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant event and its potential implications. It provides context about the ongoing conflict and tension between Israel and Hezbollah. However, it does not offer solutions or ways to deescalate the situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shedeur Sanders Wins Debut, Ends Browns' 17-Game Streak in Victory Over Raiders",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:46:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet",
      "Associated Press"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Shedeur Sanders became the first Browns quarterback to win his first NFL start since 1995, snapping a 17-game losing streak.",
      "Sanders exuded confidence before the game, and he backed the talk up with a win",
      "Sanders has Cleveland up big against Las Vegas",
      "Browns rookie Shedeur Sanders passed for 209 yards and a touchdown in his NFL starting debut and Myles Garrett had three of Cleveland’s 10 sacks in a 24-10 victory over the Raiders on Sunday, the fifth straight loss for Las Vegas.",
      "Shedeur Sanders wins his 1st NFL start, Myles Garrett has 3 sacks as Browns beat Raiders 24-10 AP News"
    ],
    "image_url": "",
    "titles": [
      "Sanders shines in first start; Browns mum on QB1",
      "Shedeur Sanders becomes first Browns QB to win first career start since 1995",
      "WATCH: Browns' QB Shedeur Sanders throws first career touchdown on 66-yard connection with Dylan Sampson",
      "Sanders wins first start, Garrett has three sacks as Browns beat Raiders",
      "Shedeur Sanders wins his 1st NFL start, Myles Garrett has 3 sacks as Browns beat Raiders 24-10 - AP News"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47080354/shedeur-sanders-shines-win-browns-mum-starting-qb",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/shedeur-sanders-news-browns-qb-first-nfl-start/",
      "https://www.cbssports.com/nfl/news/shedeur-sanders-browns-qb-first-career-touchdown/",
      "https://news.google.com/rss/articles/CBMihwFBVV95cUxQMHNWbDZhTEtVWmR2SDNvZWVIZGNOOGI2QlpfSjhtS2FCWUVzMXB1dlc1Ukc0OEFYQ3VhQTRjeFBlUFViMURUWEVWUWtQVW9WQ18tUDVjSGxTZGktSHJFVWtiTG9LdlQ3cndHbmJLVmE5OUJTTldoS1RXRHhXWnl4Skk0NEVtMWs?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47080354/shedeur-sanders-shines-win-browns-mum-starting-qb",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.931,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.867,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shedeur Sanders became the first Browns quarterback since 1995 to win his first NFL start, leading Cleveland to a 24-10 victory over the Las Vegas Raiders. Sanders threw for 209 yards and a touchdown, while Myles Garrett recorded three of the team's 10 sacks. The win ended a 17-game losing streak for Browns quarterbacks in their starting debuts and marked the Raiders' fifth straight loss.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about Shedeur Sanders' successful debut and the end of the Browns' losing streak. However, it doesn't provide insights into what this victory means for the team's future or the factors that led to this outcome.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ukraine Probes 178,000 War Crimes as U.S.-Backed Peace Talks Advance",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 02:35:07 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Financial Times",
      "New York Times",
      "Washington Post",
      "Al Arabiya",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "ft.com",
      "nytimes.com",
      "washingtonpost.com",
      "theguardian.com"
    ],
    "snippets": [
      "Ukraine says it's investigating over 178,000 war crimes amid Trump peace plan talks Axios",
      "U.S., Ukraine say they made \"meaningful progress\" on Trump's peace plan Axios",
      "The U.S. said Sunday that there had been progress in talks at the weekend but that no agreement was reached on security guarantees for Ukraine.",
      "Officials provide few details of how Kyiv and Moscow will resolve outstanding issues following meeting in Geneva",
      "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war with Russia would continue. But details remained unclear.",
      "Washington’s mixed signals and shifting proposals unsettle allies as negotiations near a critical phase",
      "The Trump White House has grown impatient to end the war in Ukraine. Critics say it is playing into Russia’s hands.",
      "Trump accuses Ukraine of ingratitude as officials meet in Geneva on US peace plan Al Arabiya English",
      "Rolling coverage of the latest economic and financial news, as BHP is (again) rebuffed by mining rival Anglo American German business morale has unexpectedly fallen this month, as companies lose hope on a recovery of the German economy following two years of contraction. The Ifo institute has report"
    ],
    "image_url": "",
    "titles": [
      "Ukraine says it's investigating over 178,000 war crimes amid Trump peace plan talks - Axios",
      "U.S., Ukraine say they made \"meaningful progress\" on Trump's peace plan - Axios",
      "European defense stocks slide as U.S., Ukraine make progress on peace plan",
      "US and Ukraine report progress in talks on peace plan",
      "U.S. and Ukraine Expected to Press on With Peace Plan Talks",
      "The Trump team’s tortured path to a Ukraine peace plan",
      "The case against — and for — Trump’s Ukraine plan",
      "Trump accuses Ukraine of ingratitude as officials meet in Geneva on US peace plan - Al Arabiya English",
      "European defence company shares and gas prices fall after US and Ukraine discuss Russia peace plan – business live"
    ],
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPaHBUa2tQdjJoOHQwanNZUlZRZmxrUHJoSzhqRVYxblpPcXI4ZHZOSWhfd0g0d3dBallxbVJlV3Z2TnliWmhIOEdManBmaHRUOTdRR3dSZjV3Qnk4ZmhtZ2t2Nkd1NnE2ZzlNQ1Y0RjRyMjRWWUgzdkZ6bFZoWk9MMDUxbVV1Q3YyMnQ0VUlnUS1aQ184Q1czc3BR?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMieEFVX3lxTE1rdFdvTzNOa0k3bzMyYkJ1OENjSDdadXdHaDdWb2hhVVFhV2k4aHlXdnhUOGhlbE90cmNjcDFhcktiREZvZDkyZFdicFg5TWZuaVhQUGpjSzBidzBEOU9SV0hZdjNGYVR5dVUtWVlNTnYybjM3aTBJOA?oc=5",
      "https://www.cnbc.com/2025/11/24/europe-defense-stocks-fall-as-us-ukraine-make-progress-on-peace-plan.html",
      "https://www.ft.com/content/12637528-8c94-4105-a0d8-c53712046435",
      "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
      "https://www.ft.com/content/b37b94ec-8b3d-4449-b466-b346af7622cc",
      "https://www.washingtonpost.com/world/2025/11/24/trump-ukraine-deal-criticism/",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNekNxcjNPSGJ5ZWYtNUNNOG5BZlNzNW5XV21YSXlCcUFhamp6Uy1RaG51ZDVLSi1MbWlUaHI1OUloUnJwRDJoLV9GVTNBOEVpWXRkV3dCTHk5WGx6a2d3eVhteUxseW9uS3NjSHE5NWFyRS1sN0JaUzRMQVFVZ1dVSmpIV3FDT080azZNRmV4QnBtSDJoZ2Z4R2hZLU83X2I0ZUdydUJFOHNqV052LWliLU5n0gG3AUFVX3lxTE1xTmVaWlhWekpUTWZQRTBGQm1Ba3VHejlKcXB0cjE5RXRYUmZKRVZyNmNnRTc0WVlzenhrUlFzTV9FUWN6M0NKWExYWlVRODBFVXFIaU4wckp6ZTJRRjlUeE9UalZVVkNzZ0FHemdxRDdGc0xHLXQxNGs2WkE2bXNqY0xEN2pBck5iVi1xM2RUbzIwaV9iRWJTdDZuZWpxZFgwUHVOZFNjZVNxV1o5YnlmNUZyMkYwWQ?oc=5",
      "https://www.theguardian.com/business/live/2025/nov/24/bhp-walks-away-takeover-approach-anglo-mining-merger-uk-budget-cbi-ftse-pound-business-live-news"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPaHBUa2tQdjJoOHQwanNZUlZRZmxrUHJoSzhqRVYxblpPcXI4ZHZOSWhfd0g0d3dBallxbVJlV3Z2TnliWmhIOEdManBmaHRUOTdRR3dSZjV3Qnk4ZmhtZ2t2Nkd1NnE2ZzlNQ1Y0RjRyMjRWWUgzdkZ6bFZoWk9MMDUxbVV1Q3YyMnQ0VUlnUS1aQ184Q1czc3BR?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.854,
      "consensus": 1.0,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine is investigating over 178,000 alleged war crimes as talks continue on a U.S.-backed peace plan to end the conflict with Russia. U.S. and Ukrainian officials reported \"meaningful progress\" in recent Geneva meetings, but no final agreement or security guarantees have been reached. Discussions are ongoing, with few details released, and negotiations are entering a critical phase.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.10, neg_sim=0.07; semantic_boost=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Mets, Rangers Agree to Swap Brandon Nimmo for Marcus Semien",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:06:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "forbes.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Here's a rundown of the offseason moves that matter",
      "The Mets' move may matter more for what it means about their plans for the rest of the offseason",
      "The Mets and Rangers are swapping expensive veterans",
      "The Mets are trading Brandon Nimmo to the Texas Rangers for Marcus Semien in a deal showing it is not about sentiment for both sides.",
      "Mets Trade Brandon Nimmo to Rangers for Marcus Semien in Blockbuster Deal Sports Illustrated",
      "Making sense of the Mets trade of Brandon Nimmo for Marcus Semien Sports Illustrated",
      "ARLINGTON, Texas — The Texas Rangers and the Mets have agreed on a trade that would send Gold Glove second baseman Marcus Semien to New York in exchange for outfielder Brandon Nimmo . A person with direct knowledge of the deal confirmed the agreement on Sunday. That person spoke to The Associated Press on condition of anonymity because the deal hadn’t been finalized or announced. The same source confirms that Nimmo has agreed to waive a no-trade provision in his deal. Nimmo, who has played all 10 of his big league seasons with the Mets, just completed the third season of the $162 million,..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/24/30665c7e-79e4-4c5d-83bd-7b3fb210a55f/brandon-nimmo.jpg",
    "titles": [
      "Fantasy Baseball Offseason Tracker: Brandon Nimmo to Rangers, Marcus Semien to Mets in unexpected trade",
      "Fantasy Baseball Trade Reaction: Arrow up for Marcus Semien, down for Brandon Nimmo in trade of boring vets",
      "Mets trading Brandon Nimmo to Rangers for Marcus Semien: Why surprising deal makes sense for both sides",
      "Trading Brandon Nimmo For Marcus Semien Is Not About Sentiment For The New York Mets And Texas Rangers",
      "Mets Trade Brandon Nimmo to Rangers for Marcus Semien in Blockbuster Deal - Sports Illustrated",
      "Making sense of the Mets trade of Brandon Nimmo for Marcus Semien - Sports Illustrated",
      "Report: Mets acquire Marcus Semien from Rangers for Brandon Nimmo"
    ],
    "url": "https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-tracker-brandon-nimmo-to-rangers-marcus-semien-to-mets-in-unexpected-trade/",
    "alternate_urls": [
      "https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-trade-reaction-arrow-up-for-marcus-semien-down-for-brandon-nimmo-in-trade-of-boring-vets/",
      "https://www.cbssports.com/mlb/news/mets-brandon-nimmo-trade-rangers-marcus-semien/",
      "https://www.forbes.com/sites/larryfleisher/2025/11/23/trading-brandon-nimmo-for-marcus-semien-is-not-about-sentiment-for-the-new-york-mets-and-texas-rangers/",
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxONWlzM0Vfdjc0a2NYTXJHTzBLdnVvZ3ZTMzJKRVpVX1FhRmxCUFBzSXZwOGRWZEJ4RXI2ZkhzNm5PMGJ6YXJDTURaYUllQjVrRE5tbDJVdENFbjlUZnhXekkwa1Q5U3FuOHdhRWxSbW14SUpWei13ZklLUU5mR2pyRDJOdmJUZlNxbkh2eFdTUjI4LThIbGRTMg?oc=5",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxQUDUyV3hUblE2UmJja29tNjl2aHdjMDN6SVF0aWFkdlo2NzVxSWVCczFoSGdLYzVwNVVXSGlxV0twUTJDamJDZDdCdlNVOEFwUGhXSHQxVVBQRkd1NmM1T21Kc3p2TEgyeHFvZXd6VmsxWm1NSFlhUmZPUXN0WlpkdE1mS2VTOXZyMEhsQV9WU21Lb3JUXzlnZ1hYb1VibXc0QzNHVHlR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-tracker-brandon-nimmo-to-rangers-marcus-semien-to-mets-in-unexpected-trade/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.828,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Mets and Texas Rangers have agreed to trade outfielder Brandon Nimmo for second baseman Marcus Semien. Nimmo has waived his no-trade clause to complete the deal. The trade, which has not yet been officially announced, involves both teams exchanging high-salary veteran players and signals a shift in roster strategy for each club.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the trade between the Mets and Rangers, which could impact the strategies and performances of both teams. However, it doesn't provide much depth or insight into the reasons behind the trade or its potential impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Raiders Fire Offensive Coordinator Chip Kelly After Loss to Browns",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:46:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Chip Kelly is out as the offensive coordinator of the Raiders, a decision that came after the team's 24-10 loss to the Browns.",
      "Kelly was fired just hours after Sunday's 24-10 loss to the Browns",
      "The struggling Las Vegas Raiders are shaking things up."
    ],
    "image_url": "",
    "titles": [
      "Reeling Raiders fire Kelly amid first year as OC",
      "Raiders fire offensive coordinator Chip Kelly amid 2-9 start",
      "Raiders fire offensive co-ordinator Chip Kelly after latest rough performance"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47080473/sources-chip-kelly-offensive-coordinator-raiders",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/raiders-fire-offensive-coordinator-chip-kelly-amid-2-9-start-per-report/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47080473/sources-chip-kelly-offensive-coordinator-raiders",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.931,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chip Kelly has been fired as the offensive coordinator of the Las Vegas Raiders following the team's 24-10 loss to the Cleveland Browns. The decision was made just hours after the game as the team seeks changes amid ongoing struggles. The Raiders have not yet announced a replacement.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the firing of the Raiders' offensive coordinator but lacks depth. It does not explore the reasons behind the decision, the team's ongoing struggles, or potential candidates for the replacement, leaving readers without a deeper understanding or actionable insights.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Malaysia to Ban Social Media for Under-16s Starting in 2026",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 04:11:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Move comes as a growing number of countries are rolling out measures to limit children's exposure to digital platforms.",
      "Malaysia says it plans to ban social media for under-16s from 2026 Reuters",
      "The announcement on Sunday, which was light on details, came weeks before a similar action takes effect in Australia."
    ],
    "image_url": "",
    "titles": [
      "Malaysia says it will ban social media for under-16s from next year",
      "Malaysia says it plans to ban social media for under-16s from 2026 - Reuters",
      "Malaysia to Ban Children Under 16 From Social Media, Echoing Australia"
    ],
    "url": "https://www.aljazeera.com/economy/2025/11/24/malaysia-says-it-will-ban-social-media-for-under-16s-from-next-year?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxQdV92M0lRN1o5cVN5NjRyTEItS0p1My1rUlRqOTB6U081ZUVXQ2hRSUpCSDVjUE1nZk1wazl4a1JtZVltdjFmRGlPNUdRTGlsSWRHUVR3bmdmMXhsNE56V19mQ1hwUW5PMVM5allLc1dkOEdyWVdIcXVKMENnNHctTDhwbEZoMDFaTjlYSVpwamhnUnVvck9zY1NuSDM0WlpDemthX3FJUk1KTmdMdEE?oc=5",
      "https://www.nytimes.com/2025/11/24/world/asia/malaysia-social-media-ban.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/11/24/malaysia-says-it-will-ban-social-media-for-under-16s-from-next-year?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.883,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Malaysia has announced plans to ban social media access for individuals under 16 starting in 2026. The move follows similar measures in other countries, including an upcoming restriction in Australia. Details about the implementation have not been released. The government says the ban aims to protect children from online risks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a new policy in Malaysia, contributing to readers' awareness of global trends in internet regulation. However, it lacks depth and actionable insights, as it doesn't explain the reasons behind the decision or its potential impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "BHP Makes New Takeover Approach to Anglo American Amid Industry Talks",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 02:18:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "BHP walks away from last stab at Anglo American takeover Reuters",
      "Australian miner approached UK rival ahead of vote on $50bn Teck deal",
      "BHP Makes New Takeover Approach to Anglo American Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "BHP walks away from last stab at Anglo American takeover - Reuters",
      "BHP walks away from fresh Anglo American tie-up",
      "BHP Makes New Takeover Approach to Anglo American - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQZkRCcFZfeGU5MG5iZFRnY3VWNmV5clZ1akVRU1h6Q0x3MFA0N2tMbVcwdWpXcTFtMkZ6bXVVOXcwUXFBOGdHa3F2MVVOa09OR3BmSUZnWVJXRUl0b050bFhoT05YR0htRlJ3YzMxTzVZSWp4cGVQVUliVUlUZldLTzQ0S0k2VnBJQzRiY0xnaFJaZXBpenNMWmdSS2xOd1YxQmdDSzJZd3ZPelk3WHdTQThBMGNNalFWT3YxYVdzLVVhZF9PblNxeDhqODM4eWxyb2FPdllyNi1OOENIenctTkZ3Yw?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/6e8b5e22-6a55-47ae-9f81-3b081e8fa039",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRTZGS2FCYVE2R1ktb2RSR3l6MF90VDdnTEhCREdFUmlSOVZmaHp6OUdMUVVaN1l6NU83cTladEpUN3I1czRjazljbjdZWFkxT29RXy16UnBwUjVKa0dXM2lVVjB4ZHZocm5nSXNKZ25wRVMzbm5wbkltVjh6ZzVBVUJLUlFWUG9qNTlCSFphdXM3eEtybVpWNnp6MFR4ckxpTzFtRHlOZ1FqeHJBYkE3em93?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQZkRCcFZfeGU5MG5iZFRnY3VWNmV5clZ1akVRU1h6Q0x3MFA0N2tMbVcwdWpXcTFtMkZ6bXVVOXcwUXFBOGdHa3F2MVVOa09OR3BmSUZnWVJXRUl0b050bFhoT05YR0htRlJ3YzMxTzVZSWp4cGVQVUliVUlUZldLTzQ0S0k2VnBJQzRiY0xnaFJaZXBpenNMWmdSS2xOd1YxQmdDSzJZd3ZPelk3WHdTQThBMGNNalFWT3YxYVdzLVVhZF9PblNxeDhqODM4eWxyb2FPdllyNi1OOENIenctTkZ3Yw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.849,
      "consensus": 0.769,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "BHP Group has made a new takeover approach to Anglo American Plc, according to multiple sources. The move comes as Anglo American is in talks to combine with Canada’s Teck Resources Ltd. This renewed bid is part of ongoing consolidation efforts in the mining industry. No final agreement has been reached between BHP and Anglo American.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the ongoing consolidation efforts in the mining industry and the potential impact of BHP's takeover approach to Anglo American. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the industry dynamics.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. and Ukraine Report Progress in Geneva Talks on Ending Russia-Ukraine War",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 24 Nov 2025 00:56:25 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Top U.S. and Ukrainian officials said Sunday they'd made progress toward ending the Russia-Ukraine war but provided scant details after discussing the American proposal to achieve peace.",
      "In Geneva, US and Ukraine officials report progress on ending Russia's war but offer few specifics AP News"
    ],
    "image_url": "",
    "titles": [
      "In Geneva, U.S. and Ukraine officials report progress on ending war with Russia",
      "In Geneva, US and Ukraine officials report progress on ending Russia's war but offer few specifics - AP News"
    ],
    "url": "https://www.npr.org/2025/11/24/g-s1-98998/geneva-u-s-ukraine-report-progress",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMingFBVV95cUxOc0NqaU1tVmVRQUFQSUlKY194UV93X0dyem9qR2dqbmk5Z0NEZGJMLS0wbURsYVpockVHbTR6X2pHR3k2cFB4Y01YTnF0NjVCRlJhbzU5NjREdkJFM3l0NHhObUt6eFM3U1VSMHhtQ3E0Wkx0Q09nVlRYOG92X3hwYlp0VV8zRDByODJYZ2FVb2lIM1dYNGlfdjZ4T2lyQQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/24/g-s1-98998/geneva-u-s-ukraine-report-progress",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. and Ukrainian officials met in Geneva to discuss a U.S. proposal aimed at ending the Russia-Ukraine war. Both sides reported progress in the talks but did not share specific details about the discussions or agreements reached. The current status is that negotiations are ongoing, with further talks expected.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story reports on an important progress in peace talks, which is a solution-oriented approach to a significant global issue. However, it doesn't provide specific details about the progress made or the potential impacts of the negotiations, limiting its usefulness for readers.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canada and India Agree to Resume Trade Talks for Economic Partnership",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 21:11:22 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Globe and Mail",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Canada, India agree to restart trade talks, says Indian government Reuters",
      "Carney and Modi agree to restart stalled Canada-India trade talks The Globe and Mail",
      "Canadian and Indian prime ministers Mark Carney and Narendra Modi have agreed to work towards a new comprehensive economic partnership agreement."
    ],
    "image_url": "",
    "titles": [
      "Canada, India agree to restart trade talks, says Indian government - Reuters",
      "Carney and Modi agree to restart stalled Canada-India trade talks - The Globe and Mail",
      "Carney, Modi agree to revive comprehensive trade deal talks"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQU2ZsU3FYR1l5WS1UaHVSeXVlbHhjak1PVXdia3h3a3Vxd3o1ck9HWGU0bVVELUgzYlFTSnZrOXloTlFIOXA1a0RDUm9DUTFsZW1DOVFvOVcyQXVPWXNWRVNWQ010Q1ZUWWl1OUN6ZUwySlJuZDZkMDFzVDBtRlRXRk5GRmZXWHNHUnlneE1UNWVVbjdUMGVudXV2dkZvTnJIZXNQSE1TZ1VCZUY1V09qelBB?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWWZtUDhFd3lhWFpiNFhjbGY3RS1hYW1FUmp1aVZuN2E2MFAzZzNjd291YWhrMC1nSmx4NV9GeEptTUlWNm8yVk90VTZMY0dpRzBnNTJsdkhPaHRmTy12ZVdYb2lNdFZlR0lnZFV2TWVQVFJ3ZVRmVnFabXdCRkx5TUN3TFBXMU1YbkJscElVTURKMHdRNG5QRWd0VUpYazlEekFxa2ptS3ZMUU16RFFZ?oc=5",
      "https://globalnews.ca/news/11539634/canada-india-trade-deal-revival-mark-carney-narendra-modi/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQU2ZsU3FYR1l5WS1UaHVSeXVlbHhjak1PVXdia3h3a3Vxd3o1ck9HWGU0bVVELUgzYlFTSnZrOXloTlFIOXA1a0RDUm9DUTFsZW1DOVFvOVcyQXVPWXNWRVNWQ010Q1ZUWWl1OUN6ZUwySlJuZDZkMDFzVDBtRlRXRk5GRmZXWHNHUnlneE1UNWVVbjdUMGVudXV2dkZvTnJIZXNQSE1TZ1VCZUY1V09qelBB?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.763,
      "consensus": 0.769,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada and India have agreed to restart stalled trade talks, according to statements from both governments. Prime Ministers Mark Carney of Canada and Narendra Modi of India will work toward a new comprehensive economic partnership agreement. The decision aims to strengthen economic ties between the two countries. Negotiations had previously been paused but are now set to resume.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story informs about an important development in international trade relations, which could be useful for readers interested in global economics. However, it doesn't provide much context or detail about the potential benefits or challenges of this partnership.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Airstrike in Beirut Kills Hezbollah Chief of Staff, Escalates Tensions",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-23T14:16:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Israel says it has killed Hezbollah's chief of staff in an airstrike on Lebanon's capital. At least five people were killed in the attack, which is the first Israeli strike on Beirut in months.",
      "Israel says it assassinated Hezbollah's top military commander in Beirut Axios",
      "Escalating its attacks on the Iran-backed militant group in Lebanon, Israel killed Hezbollah’s military chief of staff in an airstrike on an apartment building."
    ],
    "image_url": "",
    "titles": [
      "Israel targets Hezbollah commander in Beirut strike",
      "Israel says it assassinated Hezbollah's top military commander in Beirut - Axios",
      "Israel Says It Assassinated Top Hezbollah Commander in Lebanon"
    ],
    "url": "https://www.dw.com/en/israel-targets-hezbollah-commander-in-beirut-strike/a-74853555?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMidEFVX3lxTE5idXFnSWkxQjVWVzMtbWFWRU5wa1ZERUkxM01QV0xrWEU1c0NlZzNJeXRDX210RXFKdlB3UDJRMjd4ZlJ1REx1akEtQ0JiOWt1RDItRUxCMVpmNVg3eXlSeXlpTDJRbHBoV0ZGZnZfS2V2MkxJ?oc=5",
      "https://www.nytimes.com/2025/11/23/world/middleeast/israel-hezbollah-dahiya-airstrike.html"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/israel-targets-hezbollah-commander-in-beirut-strike/a-74853555?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.66,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.75,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike on a southern suburb of Beirut, killing Hezbollah’s chief of staff, Haytham Tabtabai, along with at least four others. This marks the first Israeli strike on Beirut since June and follows a year-old ceasefire. The attack significantly escalates tensions between Israel and Hezbollah, raising concerns about renewed hostilities in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant event and its potential implications. It provides context about the ongoing conflict and tension between Israel and Hezbollah. However, it does not offer solutions or ways to deescalate the situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "David Cameron Reveals Prostate Cancer Diagnosis, Calls for More Screening",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 09:13:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The former PM is calling for more men to be screened for the disease, which is the most common cancer in males in the UK.",
      "Former prime minister says he wants to join ranks of those pressing for more checks on men who may have disease David Cameron has disclosed he was treated for prostate cancer and has called for a targeted screening programme. The former prime minister said he had a prostate-specific antigen (PSA) te"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3429/live/e962bde0-c904-11f0-a892-01d657345866.jpg",
    "titles": [
      "David Cameron reveals he had prostate cancer and joins call for more screening",
      "David Cameron reveals prostate cancer diagnosis and calls for targeted screening"
    ],
    "url": "https://www.bbc.com/news/articles/cvgkwn0l771o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/politics/2025/nov/23/david-cameron-reveals-he-has-prostate-cancer-and-calls-for-targeted-screening"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvgkwn0l771o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former UK Prime Minister David Cameron has revealed he was treated for prostate cancer and is advocating for increased screening for the disease, which is the most common cancer among men in the UK. He is calling for a targeted screening programme to help detect prostate cancer earlier and improve outcomes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about prostate cancer and the importance of early detection. It also reports on a solution (increased screening) to a problem (prostate cancer), and raises awareness about the most common cancer among men in the UK.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Raptors Beat Nets for Seventh Straight Win, Barnes Scores 17 Points",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 23 Nov 2025 21:54:14 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Scottie Barnes scored 17 points as the Raptors held on for a 119-109 victory over the Brooklyn Nets on Sunday as Toronto extended its win streak to seven.",
      "Immanuel Quickley joins Danielle Michaud to discuss how the Raptors came away with their seventh straight win, his on-court chemistry with Jamal Shead, and how this team is taking it game-by-game."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/76369534790626d75fd94178465f59c9fc7b8ee3622a0f110ef567cda7f43f23.jpg?quality=65&strip=all",
    "titles": [
      "Raptors fend off Nets to win seventh straight",
      "‘Total team effort’: Quickley on Raptors grinding out seventh straight win"
    ],
    "url": "https://globalnews.ca/news/11539833/murray-boyles-returns-to-toronto-raptors-lineup/",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11539833/murray-boyles-returns-to-toronto-raptors-lineup/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.774,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Raptors defeated the Brooklyn Nets 119-109 on Sunday, marking their seventh consecutive win. Scottie Barnes led the team with 17 points. Immanuel Quickley highlighted the team's growing chemistry, especially with Jamal Shead, and emphasized their focus on taking each game as it comes. The Raptors' current win streak stands at seven games.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Raptors' recent performance and highlights the contributions of key players. However, it doesn't delve into the strategies or factors contributing to their winning streak, limiting its depth and insight.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Macquarie Asset Management Makes $7.5B Bid to Acquire Qube Logistics",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 06:35:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Australia's Macquarie bids $7.5 billion for logistics group Qube Reuters",
      "Macquarie has offered to acquire Qube for AU$5.2 per share in cash, representing a nearly 28% premium to Qube's closing level of AU$4.07 on Friday.",
      "Fresh Macquarie Asset Management Bid Values Qube at $7.5 Billion Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Australia's Macquarie bids $7.5 billion for logistics group Qube - Reuters",
      "Australia's Qube Holdings' shares close at record high on Macquarie's $7.5 billion takeover deal",
      "Fresh Macquarie Asset Management Bid Values Qube at $7.5 Billion - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSTVrTk4tVmI3U2kzZ1lwRVlVSU9WcFBpYS1rdjNxU1puNUZmc3R3d3BFRmFJRzEyNXUteUc5U25wNjdhNVd1RWVmMFNkNGs2MEwyejhfclNlcnBkQjZwOUFzNXFqdXh3ZWVnZ2JXaDllUmVZNVJfSGM0cXFUNG14N0VlcFB1cXk1Z0tnbVdJUGpuU0kzRGtRX2xGS2xQUTVjUjBvUTJXSENld3FHdDgxaTFONTl1QlpfRjVUdTN1bw?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/24/australia-qube-holdings-shares-jump-macquarie-takeover-deal.html",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxPcUNLSWU1VzF2cmRVZFI4QUNSdDFLTV9pX2h1X0hjYWFjZGJlVUtzcHJXdHdPSF9UVmstM0N1QlVDSWpmcjlUYTYxMjdHV0xLZjV6X3pkVGlTMWxQbzZwSk1wR19Ob29pTVVYNGNQTkJ4Q1hlT25VVkZJY0ZoeUw1OWw2aGVmOEFUQTFxSEJJSkZHQ1ZTeTZfbmx0RVlUamZoV1lpaEJnQnQ1N0dPU2d6R21xVjA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSTVrTk4tVmI3U2kzZ1lwRVlVSU9WcFBpYS1rdjNxU1puNUZmc3R3d3BFRmFJRzEyNXUteUc5U25wNjdhNVd1RWVmMFNkNGs2MEwyejhfclNlcnBkQjZwOUFzNXFqdXh3ZWVnZ2JXaDllUmVZNVJfSGM0cXFUNG14N0VlcFB1cXk1Z0tnbVdJUGpuU0kzRGtRX2xGS2xQUTVjUjBvUTJXSENld3FHdDgxaTFONTl1QlpfRjVUdTN1bw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.928,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Macquarie Asset Management has made a $7.5 billion bid to acquire Australian logistics company Qube, offering AU$5.2 per share in cash. The offer represents a nearly 28% premium to Qube’s last closing price of AU$4.07. Qube is considering the proposal, and the deal is subject to shareholder and regulatory approval.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Buccaneers' Baker Mayfield to Undergo MRI After Shoulder Injury vs. Rams",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:46:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Buccaneers QB Baker Mayfield sprained his non-throwing shoulder in Sunday night's 34-7 loss to the Rams and will undergo an MRI on Monday.",
      "INGLEWOOD, Calif. — Everything that could go wrong for the Tampa Bay Buccaneers did in the first half of their 34-7 loss to the Los Angeles Rams on Sunday night, including an injury to quarterback Baker Mayfield. Mayfield did not play in the second half after spraining his left shoulder and will undergo an MRI on Monday, coach Todd Bowles said. Mayfield was replaced by backup Teddy Bridgewater on the first possession of the third quarter with the Buccaneers trailing 31-7. “Well, Teddy will play if he’s out for some time,” Bowles said. “Very confident in what Teddy can do with a full week of..."
    ],
    "image_url": "",
    "titles": [
      "Mayfield sprains left shoulder in loss; MRI next",
      "Buccaneers QB Baker Mayfield suffers sprained left shoulder in loss to Rams"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47080295/bucs-baker-mayfield-exits-vs-rams-left-shoulder-injury",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47080295/bucs-baker-mayfield-exits-vs-rams-left-shoulder-injury",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.716,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tampa Bay Buccaneers quarterback Baker Mayfield sprained his non-throwing (left) shoulder during a 34-7 loss to the Los Angeles Rams and did not play in the second half. He will undergo an MRI on Monday to assess the injury. Backup quarterback Teddy Bridgewater replaced Mayfield in the third quarter. The Buccaneers' current status regarding Mayfield’s availability will depend on MRI results.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Baker Mayfield's injury and the potential implications for the Buccaneers. However, it lacks depth and doesn't provide much insight beyond the immediate situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Airlines Cancel Venezuela Flights After FAA Security Warning",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 00:53:28 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "Airlines cancel flights to Venezuela after FAA's \"heightened military activity\" alert Axios",
      "The flight cancellations come as the U.S. military has expanded its buildup in the region.",
      "Airlines cancel flights to Venezuela after FAA warns of worsening security, military activity AP News"
    ],
    "image_url": "",
    "titles": [
      "Airlines cancel flights to Venezuela after FAA's \"heightened military activity\" alert - Axios",
      "Several Airlines Suspend Venezuela Flights After FAA Warns Of ‘Heightened Military Activity’",
      "Airlines cancel flights to Venezuela after FAA warns of worsening security, military activity - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQTzFiVVA1MFZuaU8xdEw3ekZfMTgyeVUxaFhFell3QmkwR3pEcllkSHZDUkd2dEFuLUhkSFJ4cFR1Y0tSd3RQbmlpS3RtenRjUFJHb1BydmlrWTluY0FQSWRhcS1oSTNqQzVEN2VQem4tb1BMU25pdXhGUEo4bS00T2t6cTNlNDJSTG9tS09ySTdwUjI5RzhEbENn?oc=5",
    "alternate_urls": [
      "https://www.forbes.com/sites/siladityaray/2025/11/24/several-airlines-suspend-venezuela-flights-after-faa-warns-of-heightened-military-activity/",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxNQTNlWEs0YWpfUkIwaVI0Rm5aMi1YbmtiTzY0bm9LczVDeDlfSS1yUHVzNkI2YjhHMmZHRGJhNjN2enEzUG81ZnotbktVcXlBWkw4Qng5dWZfaUptMTB6ZnRkbVoyMXdxWi1LQTlHLUEzTzF3RDRrdElWWWgtSDAySjZRdGI3SlRyalQtU2Q3NXBBazY0NFlaOUV0ZjRNbGc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQTzFiVVA1MFZuaU8xdEw3ekZfMTgyeVUxaFhFell3QmkwR3pEcllkSHZDUkd2dEFuLUhkSFJ4cFR1Y0tSd3RQbmlpS3RtenRjUFJHb1BydmlrWTluY0FQSWRhcS1oSTNqQzVEN2VQem4tb1BMU25pdXhGUEo4bS00T2t6cTNlNDJSTG9tS09ySTdwUjI5RzhEbENn?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.824,
      "consensus": 0.769,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Several airlines have canceled flights to Venezuela after the U.S. Federal Aviation Administration (FAA) issued a warning about increased military activity and worsening security in the region. The U.S. military has also expanded its presence nearby. The cancellations are a response to safety concerns raised by the FAA's alert.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): expand; semantic: pos_sim=0.00, neg_sim=0.10",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Officials Report Progress in Geneva Talks on U.S.-Russian Ukraine Peace Plan",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 16:39:12 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "U.S., Ukrainian and European officials gathered in Switzerland on Sunday for talks on the contentious American-Russian peace plan put to Kyiv this week.",
      "Rubio says Ukraine meeting in Geneva probably the best so far Reuters",
      "Rubio Sees Ukraine Deadline Easing After ‘Productive’ Talks Bloomberg.com"
    ],
    "image_url": "https://s.abcnews.com/images/International/US-ukraine-geneva-delegation-gty-CW-20251123_1763921732903_hpMain_4x3t_384.jpg",
    "titles": [
      "Ukraine peace talks in Geneva 'productive and meaningful,' Rubio says",
      "Rubio says Ukraine meeting in Geneva probably the best so far - Reuters",
      "Rubio Sees Ukraine Deadline Easing After ‘Productive’ Talks - Bloomberg.com"
    ],
    "url": "https://abcnews.go.com/International/officials-arrive-switzerland-talks-zelenskyy-laments-ongoing-russian/story?id=127796632",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNN2VHdS15eEhhT1g4VG1ZdWRQMHdaLVZlSDZwc0ZCc0tlTDdFaGxsWk1CUGt6OEk3OGZ3bEdYQXVSTHBDUnFCOVpiLVFnOXRmZWFhS1J2N0t4Z0tFRVNuU0hfMklZZm9VZ0FSU29JakxuYUxJMGZNX3pJdGxLNkZMQ3NUSVhqaFNKUFdlX0h6YTBId2ZjVS1uVENtVXR4MGI0ZGNKOW5B?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNTS1kd0tsRjZtdkdGek1iZ0pkaExYRzZDUmZjcXhiRkpfZFJBOWdzbHAtQWlJRkNjelQ1THdMU05QNnR2SHVRWF8ySWZiWmpNeFRfSFd2LUlab3JCdE9XR3BPMEU0LTUzNjJab2tyUlJkckM5Uy02RzFUcUFCX0lucjhBRTVSOFhfYUFKLV9uV0dVZ1BtVkdKREJ1OGxNcTVxNHMyTlFvTnR4Q1lGVVJDbQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/International/officials-arrive-switzerland-talks-zelenskyy-laments-ongoing-russian/story?id=127796632",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.77,
      "consensus": 0.769,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S., Ukrainian, and European officials met in Switzerland to discuss a proposed American-Russian peace plan for Ukraine. Senator Marco Rubio described the Geneva meeting as the most productive so far, noting progress in talks and suggesting that deadlines for Ukraine may become more flexible. Discussions are ongoing, with no final agreement reached yet.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.05, neg_sim=0.12",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Alabama Leads Playoff Projections as College Football Enters Final Week",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 01:46:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "We assess how the committee could stack the top teams in the country after Week 13.",
      "College Football Playoff and Bowl Projections After Week 13: Alabama Holds Power Sports Illustrated",
      "‘College GameDay’ Announces Destination for Week 14 Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "🏈 Projecting the College Football Playoff top 12",
      "College Football Playoff and Bowl Projections After Week 13: Alabama Holds Power - Sports Illustrated",
      "‘College GameDay’ Announces Destination for Week 14 - Sports Illustrated"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47060756/projecting-college-football-playoff-top-12-week-13",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxNNFkxeHpZYm1JaVhBeDJCMkg1ZzR3UXBESmFoS3U0YVNGZ1BDa3dIT3A5UnktWXAzOHdKWkVLaUtIM1VnUVdsT0owUFVOVFRyRlBRRDlBMmZQZ21uODFIVEg0b1NsOGhuUVJscVhtYjNmMzFIaWdvcDlvZmtKdTFXakQzQ0RVaDFkd0s1a1NjendJOUg2aWNsYllUQWhKUVRMYnRKVU5Cc053VGEzOHZmRGJGSFVnQQ?oc=5",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxOQU8tZnN2aXJURTNsaDlac2h6TWZDeUYxbHp1YVU1S0xqWXRWMWUxVjN3cFVOazdLLXFpUWpPRXUxcDRGZ0FyQy13aGRWbEpwcFdXWUtXeWd1NE9kRHI1ZGtkTkFmYWFFZU0wejk3UVNKM3YwY1J1V21rNkNLc2I5a2hja3BKRkRVYzg2SE13?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47060756/projecting-college-football-playoff-top-12-week-13",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.696,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After Week 13 of the college football season, Alabama remains a leading team in playoff projections. The College Football Playoff committee is set to evaluate top teams for postseason rankings. Additionally, ESPN's \"College GameDay\" has announced its Week 14 broadcast location, highlighting key matchups as the regular season concludes.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the current state of college football rankings and upcoming games. However, it doesn't provide deeper insights or understanding, nor does it report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ronaldo Scores Stunning Bicycle Kick as Al Nassr Win in Saudi Pro League",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 07:17:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Al Arabiya"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The 40-year-old superstar turned back the clock to kick one of the goals of the season in the Saudi Pro League.",
      "Cristiano Ronaldo secures Al Nassr win with jaw-dropping bicycle kick Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Cristiano Ronaldo scores superb bicycle kick in Al Nassr win",
      "Cristiano Ronaldo secures Al Nassr win with jaw-dropping bicycle kick - Al Arabiya English"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/24/cristiano-ronaldo-scores-superb-bicycle-kick-in-al-nassr-win?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxPWTlXYUd6V1ViN1Z3eTg2ekU1cWg0WU9Xd2RFWkZ2VnlsbEpwMmJYWkxjU3lpSkttb2tsdzMzWnoxbnZLRF9DY3p0MGMzdm9QelJRQ3FBc0w1Ukk4TzVDWWpWODlQYzVBY29ZV3hBYm4wXzZ1aGp6dVltWGFjZE9ZMk5XOFcyUkpGY3N5OVZxRTJqRlpSeU9xWldsaktJU1ZtRGJYakdhbFNGNjJnczRSNEpGbzlQX3fSAbwBQVVfeXFMT2xrSDdwdnI2VnJRNUFkOW9IaE54RDg5TklSOFEwNXQ5Y3VQcks5YUpuOFRMLWUycmxGNGxKUzVjQUhIMzEyTzZOa29XUlg3M0hKbFpCRnNoOUlqT3RpZHB4RG9zdnBmWWl3Wi0xeGxiRE1nbXUyZVI1TmdhR3Z3ekxtNkxjS25WQW92MkEwNTM2bTAzQkJ0RkhzRXE5SmV5UmJaTkdBMzRjZGNQbm9NS1ZJUGlMajlYNWxRdXQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/24/cristiano-ronaldo-scores-superb-bicycle-kick-in-al-nassr-win?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cristiano Ronaldo, 40, scored a notable bicycle kick goal to help Al Nassr secure a win in the Saudi Pro League. The goal has been widely praised and is considered one of the best of the season. Ronaldo’s performance contributed directly to Al Nassr’s victory, highlighting his ongoing impact at the club.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a sports event, but does not offer much in terms of usefulness or progress. It does not increase clarity around systems, causes, trends, or impacts that matter. However, it might be of interest to football fans or those following Ronaldo's career.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Suicide Bombers Attack Pakistan Police HQ; Six Dead, Situation Under Control",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 08:47:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com"
    ],
    "snippets": [
      "Security camera video shows the moment suicide bombers attacked a security complex in Pakistan.",
      "Three fighters and three security officers killed in attack on Federal Constabulary headquarters, media reports say.",
      "Three attackers attempted to enter the headquarters of a civilian paramilitary force, with one having blown himself up at the gate and two others having been gunned down by officers."
    ],
    "image_url": "",
    "titles": [
      "Several killed in suicide attack on security complex in Pakistan",
      "Six killed in suicide attack on security complex in Pakistan’s Peshawar",
      "Pakistan: Suicide bombers hit security complex in Peshawar"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/24/several-killed-in-suicide-attack-on-security-complex-in-pakistan?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/24/gunfire-explosions-at-paramilitary-hq-in-pakistans-peshawar-reports?traffic_source=rss",
      "https://www.dw.com/en/pakistan-suicide-bombers-hit-security-complex-in-peshawar/a-74856300?maca=en-rss-en-top-1022-rdf"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/24/several-killed-in-suicide-attack-on-security-complex-in-pakistan?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Three suicide bombers attacked the Federal Constabulary headquarters in Pakistan, according to security camera footage and media reports. One attacker detonated explosives at the gate, while the other two were shot dead by security officers. The attack resulted in the deaths of all three attackers and three security personnel. The situation at the headquarters is now under control.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of a tragic event, it lacks depth or insight that could lead to a deeper understanding or actionable insights for the reader. It does not report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Messi Shines as Inter Miami Reaches First MLS Eastern Conference Final",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 07:04:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Sportsnet"
    ],
    "domains": [
      "aljazeera.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Star forward Lionel Messi played a part in all four goals as Inter Miami moved on to the MLS Eastern Conference finals.",
      "CINCINNATI — Lionel Messi had a goal and three assists and Tadeo Allende scored twice as Inter Miami beat FC Cincinnati 4-0 Sunday to advance to its first Eastern Conference final. Miami will take on the winner of Sunday’s other conference semifinal between the Philadelphia Union and New York City FC. “Proud of how the team played on a very, very difficult field and against a very, very tough opponent,” Miami head coach Javier Mascherano said through a translator. “I think from the first minute it wasn’t about holding back. It was about going after the game and being ourselves. I think today..."
    ],
    "image_url": "",
    "titles": [
      "Messi scores goal as Inter Miami beat Cincinnati in Eastern Conference semi",
      "Messi’s goal, three assists power Inter Miami into Eastern Conference final"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/24/messi-scores-goal-as-inter-miami-beat-cincinnati-in-eastern-conference-semi?traffic_source=rss",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/24/messi-scores-goal-as-inter-miami-beat-cincinnati-in-eastern-conference-semi?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lionel Messi scored one goal and provided three assists as Inter Miami defeated FC Cincinnati 4-0, with Tadeo Allende adding two goals. The victory sends Inter Miami to its first MLS Eastern Conference final, where they will face either the Philadelphia Union or New York City FC.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the outcome of a soccer match and the performance of a player. It doesn't provide deeper insights or understanding about the game, nor does it report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Modi Government to Introduce 12 Key Economic Reform Bills in Parliament Session",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 07:34:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "India's PM Modi Plans Reform Blitz in Parliament to Turbocharge Economy Bloomberg.com",
      "Prime Minister Narendra Modi’s government plans to push through a dozen major bills in the upcoming parliament session to speed up reforms and boost investments."
    ],
    "image_url": "",
    "titles": [
      "India's PM Modi Plans Reform Blitz in Parliament to Turbocharge Economy - Bloomberg.com",
      "Modi Plans Reform Blitz in Parliament to Turbocharge Economy"
    ],
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNeTV5WURCUHRsZ24wWkdIMlpaekFxa0FiYU9uMUlpa2xuRGpoSmZVcTZzbk9UVUZLWlVuX0JaM0pMMGM4RDRmaTV6dExIZ005VzRjYmRCcDU3cnZTOVM5TW9CVG9wM2JpY2pwMy10Qi1TTTA4dFVseW5OQ1RSZWctdTBtZmF3Uk4xTWo4bVNlYWMzQUdjV1dfOXRCaUg3TzNmUlBtRGI1Z09ta1lERGxPQQ?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/modi-plans-reform-blitz-in-parliament-to-turbocharge-economy"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNeTV5WURCUHRsZ24wWkdIMlpaekFxa0FiYU9uMUlpa2xuRGpoSmZVcTZzbk9UVUZLWlVuX0JaM0pMMGM4RDRmaTV6dExIZ005VzRjYmRCcDU3cnZTOVM5TW9CVG9wM2JpY2pwMy10Qi1TTTA4dFVseW5OQ1RSZWctdTBtZmF3Uk4xTWo4bVNlYWMzQUdjV1dfOXRCaUg3TzNmUlBtRGI1Z09ta1lERGxPQQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.17,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Minister Narendra Modi’s government plans to introduce around twelve major bills in the upcoming parliamentary session aimed at accelerating economic reforms and attracting more investment. The proposed legislation is part of a broader effort to strengthen India’s economic growth. The bills are expected to be debated and voted on during the session.",
    "constructiveness_score": 0.17,
    "constructiveness_reason": "keywords (3): effort, investment, plan; semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Promises Health Care Plan by Jan. 30 to Address Rising Premiums",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 04:13:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "Bessent Says Health-Care Announcement Coming This Week Bloomberg.com",
      "Trump said last week he hopes to secure a plan by Jan. 30 to address an impending surge in health insurance premiums caused by subsidies that expire at end-2025."
    ],
    "image_url": "",
    "titles": [
      "Bessent Says Health-Care Announcement Coming This Week - Bloomberg.com",
      "Bessent says health-care announcement coming this week"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNNERPZUlRa2Zya2VDWXU4U1E1OHR1ckFZbVpsTTFlbk8zeG1td0ZBdTVER09TSlZ1WWE0MndHOUFndWRMMUZSUUl1bVdfLW1qbFp0UlBQWnhsdEV0RGFTQy1pWFJJR2ZUbEhEb3ZyNm0tc1hDZUREWU52dFhyXzVISk8wXzBMdTJ2M3RjUWRsUXF3S3IxNm1lOFBtN3V1WS1zRXNkS0RDMzQ?oc=5",
    "alternate_urls": [
      "https://fortune.com/2025/11/23/bessent-health-care-announcement-obamacare-price-hikes-affordable-care-act-subsidies/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNNERPZUlRa2Zya2VDWXU4U1E1OHR1ckFZbVpsTTFlbk8zeG1td0ZBdTVER09TSlZ1WWE0MndHOUFndWRMMUZSUUl1bVdfLW1qbFp0UlBQWnhsdEV0RGFTQy1pWFJJR2ZUbEhEb3ZyNm0tc1hDZUREWU52dFhyXzVISk8wXzBMdTJ2M3RjUWRsUXF3S3IxNm1lOFBtN3V1WS1zRXNkS0RDMzQ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.883,
      "consensus": 0.591,
      "constructiveness": 0.077,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trump stated he aims to secure a health care plan by January 30 to address rising insurance premiums linked to expiring subsidies at the end of 2025. Bessent announced that more details about the health care plan will be released this week. The plan is intended to manage expected premium increases.",
    "constructiveness_score": 0.077,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.11, neg_sim=0.00; semantic_boost=0.03",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Snowy Owls Draw Crowds to Chicago's Lake Michigan Beach",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 23 Nov 2025 14:30:01 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "Associated Press"
    ],
    "domains": [
      "phys.org",
      "news.google.com"
    ],
    "snippets": [
      "A pair of snowy owls spotted along a Lake Michigan beach has drawn curious crowds and sparked happy speculation about how long the Arctic birds of prey will call Chicago home.",
      "A pair of snowy owls spotted along Lake Michigan beach draws crowds in Chicago AP News"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-pair-of-snowy-owls-s.jpg",
    "titles": [
      "A pair of snowy owls spotted along Lake Michigan beach draws crowds in Chicago",
      "A pair of snowy owls spotted along Lake Michigan beach draws crowds in Chicago - AP News"
    ],
    "url": "https://phys.org/news/2025-11-pair-snowy-owls-lake-michigan.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxNTkJNTUwydk9YbUZpeF9DOWUwXzloNjZqUUkyVkx2MXhqa1o0RVhyeldGRy1OVjJBVklKYms0RVFCTDR2U0YwMGlMRC1ZY1pxUi1yaFozQmh5X2drYlYxMTZvbFh6M09tN0Mzd0Zra243ejhXbjVBb21hV21YQjgzWmxoRUFzQTBxUWh4SGpiZExyVk9qVWJ3ZnJ6TUY4bGl0QWc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2025-11-pair-snowy-owls-lake-michigan.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.736,
      "consensus": 0.591,
      "constructiveness": 0.028,
      "proximity": 0.5
    },
    "score": 0.605,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two snowy owls have been spotted along a Lake Michigan beach in Chicago, attracting large crowds of birdwatchers and residents. The presence of these Arctic birds is unusual for the area and has generated significant local interest. The owls remain in the area, but it is unclear how long they will stay.",
    "constructiveness_score": 0.028,
    "constructiveness_reason": "semantic: pos_sim=0.11, neg_sim=0.00; semantic_boost=0.03",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  }
]