[
  {
    "title": "UFC 319: Du Plessis vs Chimaev Headlines at United Center, Full Coverage Availab",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 23:36:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.mmamania.com",
      "www.forbes.com",
      "app",
      "www.cbssports.com"
    ],
    "snippets": [
      "This weekend offers plenty of options to place a wager or two with UFC in Chicago",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC 319: Du Plessis vs. Chimaev fight card from the United Center in Chicago on Saturday",
      "Reminder: We will deliver live round-by-round, blow-by-blow coverage of UFC 319’s entire fight-fight pay-per-view (PPV) main card RIGHT HERE, beginning at 10 p.m. ET.",
      "UFC 319 Results: Everything to know about tonight's Dricus du Plessis vs. Khamzat Chimaev fight card - full fight card results, winners, losers, bonuses, scorecards, more",
      "<p>Intrigue litters the UFC 319 preliminary card, as fighters like up-and-comer Baisangur Susurkaev and former champ Jessica Andrade, whet the appetite for a night of action in the octagon. Catch the action live on Sportsnet 360 and Sportsnet+ at 7:50 p.m. ET / 4:50 p.m. PT.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/14/2ac89250-2ddf-4481-820d-d7d01e687f89/dricus-du-plessis-face.jpg",
    "titles": [
      "UFC 319 predictions, best bets, odds: Dricus du Plessis, Aaron Pico among top picks to consider",
      "UFC 319 odds, props, predictions, fight card: Du Plessis vs. Chimaev picks, best bets by proven MMA insider",
      "UFC 319 results, live streaming updates | Du Plessis vs. Chimaev ‘Prelims’",
      "UFC 319 Results: Winners And Losers Du Plessis Vs. Chimaev Fight Card",
      "UFC 319 on Sportsnet: Du Plessis vs. Chimaev Prelims"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.989,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.816,
    "summary": "UFC 319 took place at the United Center in Chicago, featuring the main event between Dricus du Plessis and Khamzat Chimaev. The event was covered live with round-by-round updates and included a full fight card with results, winners, losers, bonuses, and scorecards. Daniel Vithlani from SportsLine provided picks for the fights. The preliminary card highlighted fighters such as Baisangur Susurkaev and former champion Jessica Andrade, with live broadcasts available on Sportsnet 360 and Sportsnet+. The event started at 7:50 p.m. ET / 4:50 p.m. PT.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 90 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canada Orders Air Canada Strike to Arbitration, Ends Travel Chaos",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:48:06 -0400",
    "source": "NPR",
    "sources": [
      "Financial Post",
      "BBC",
      "Global News",
      "ABC News",
      "Fortune",
      "Washington Post",
      "NPR",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "globalnews.ca",
      "fortune.com",
      "www.bbc.com",
      "abcnews.go.com",
      "www.washingtonpost.com",
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Canada's government forced Air Canada and its striking flight attendants back to work and into arbitration Saturday after a work stoppage stranded more than 100,000 travelers around the world.",
      "Air Canada advises passengers not to go to the airport unless they have tickets on other airlines.",
      "Jobs minister says full resumption of services could take days, arbitration means 10,000 cabin crew will return to work.",
      "Canada&rsquo;s government has forced Air Canada and the union representing flight attendants into arbitration after a work stoppage stranded more than 100,000 travelers around the world during the peak summer travel season",
      "Jobs Minister Patty Hajdu ordered the sides to arbitration. The decision ended an hours-long strike that led the flag carrier to cancel hundreds of flights.",
      "Ahead of the work stoppage, the airline said it had canceled most of the 700 flights that it directly operates, which carry about 130,000 people each day.",
      "Ottawa orders binding arbitration to end Air Canada flight attendant strike, with Jobs Minister Patty Hajdu directing operations to resume after walkout disrupted global travel.",
      "A complete shutdown will impact about 130,000 people a day, and some 25,000 Canadians may be stranded abroad daily. Air Canada operates around 700 flights per day.",
      "CALGARY, Alberta &#8212; CUPE 4095 President Tyler McBain, CUPE Alberta President Raj Uppal, and AFL President Gil McGowan will address striking Air Canada flight attendants. Following this, members of the CUPE 4095 Strike Committee will be available for comment on the current Air Canada strike and "
    ],
    "image_url": "",
    "titles": [
      "Government forces Air Canada flight attendants back to work, into arbitration",
      "What to know as Air Canada grounds flights and attendants strike",
      "Government forces Air Canada into arbitration in bid to end strike",
      "Government forces Air Canada and flight attendants back to work and into arbitration",
      "Canada orders Air Canada flight attendants back to work, ending strike",
      "Air Canada’s Flight Attendants Begin Strike, Crippling the Airline",
      "Jobs Minister Patty Hajdu orders Air Canada and striking flight attendants back to work",
      "Government forces Air Canada and flight attendants back to work and into arbitration, after strike strands over 100,000 travelers",
      "Media Advisory for CUPE Air Canada Flight Attendants"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.79,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.812,
    "summary": "The Canadian government intervened in the Air Canada flight attendants' strike, ordering the airline and its striking employees back to work and into arbitration. This move came after the strike stranded over 100,000 travelers globally. Jobs Minister Patty Hajdu's decision aims to resolve the dispute and has led to the cancellation of hundreds of flights, affecting around 130,000 daily passengers. The full resumption of services is expected to take days, but the arbitration means that 10,000 cabin crew members will return to work, ending the work stoppage that significantly disrupted travel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 95 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump-Putin Talks in Alaska End Without Ukraine Ceasefire Agreement",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:12:53 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "New York Times",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The US president will meet Volodymyr Zelensky in Washington on Monday in the wake of his Alaska summit with Vladimir Putin on Friday.",
      "Warm welcome for Russia&#039;s Putin at meeting with US President Donald Trump in Alaska, but no deal on ending Ukraine war.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFB0cXYwRk5TMmY5VEVCdnhRNTBwYlRJRzQ5NDh3NEF4U19uTm5iSFlfUHRNUlozb0VXb3l2bXFBa0RveVcway1LSTVjQUNqZGNMak5xTk1jckFQQlMtTjdpd2hqcW9JM2k2aEEwUHJKRG5Gejhoa0c4?oc=5\" target=\"_blank\">Trump: Putin summit productive but \"we didn't get there\" on Ukraine",
      "President Trump’s failure to reach an accord on Ukraine only made his warm welcome for the Russian leader more striking.",
      "President Trump gave President Vladimir Putin a warm public reception, effectively ending his diplomatic isolation over the past three years for his invasion of Ukraine. But Mr. Putin did not agree to stop the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d1b7/live/028abce0-7ac8-11f0-8e51-edf1023f34e4.jpg",
    "titles": [
      "Trump shifts ceasefire stance and urges Ukraine to agree Russia peace deal",
      "Trump, Putin end short summit without ceasefire deal in Ukraine",
      "Trump: Putin summit productive but \"we didn't get there\" on Ukraine deal - Axios",
      "At Trump’s Summit, No Deal on Ukraine, and No Consequence for Putin",
      "Trump and Putin Put on a Show in Summit, but No Ukraine Deal Emerges"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.884,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary": "President Trump and Russian President Vladimir Putin met at a military base outside Anchorage, Alaska, where they discussed the ongoing war in Ukraine. Despite a warm welcome from Trump, the talks concluded without reaching a ceasefire or any agreement to end the conflict. The meeting ended Trump's diplomatic isolation of Putin over the Ukraine invasion but failed to produce a solid outcome on stopping the war. Additionally, Trump spoke with Ukraine's President Volodymyr Zelensky, who plans to visit Washington. The lack of a decisive agreement on Ukraine was noted as a significant aspect of th",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 97 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hurricane Erin Becomes First Major Hurricane of 2025, Targets Caribbean",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:34:53 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Forbes",
      "ABC News",
      "Deutsche Welle",
      "The Guardian",
      "Phys.org",
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.npr.org",
      "phys.org",
      "www.bbc.com",
      "abcnews.go.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Hurricane Erin exploded in strength to a Category 5 storm in the Caribbean on Saturday, rapidly powering up from a tropical storm in a single day, the National Hurricane Center said.",
      "The \"extremely powerful\" storm \"explosively deepened and intensified\" overnight, say forecasters",
      "Erin is the Atlantic season's first hurricane and is set to escalate over the weekend though the threat of direct impacts in the Bahamas and along the east coast of the US appears to be receding.",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE5KSHlwaFhpSmdvS1lpdnpEdFR0ZWQ0MzdpRTZSYU8yYnpqU25zY0NkWVZ6eGNPc0NLam43U1VJTWZvVmlfclh2S0taUUlSa0VfZ0c4SEhLUTV0V3dPVVZLQ2lEaGU1NU56V1VrbGFCaENfdw?oc=5\" target=\"_blank\">Hurricane Erin strengthens to Category 5</a>&nbsp;&nbsp;<font color=\"#6f6",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFAwT1JJWGEtcDZvcElXSEtjS0xDY3VDY29udE93TTRONUpIN0FRT1hDOC1wR0E3SkJiN1ZDMzRNamdEeWw4SlJlLVBYUzk3SnozSDBGa1QtRkozUHFzanFHbTl0ODRlaW0zRnNVZjFSdmVDRDlJ?oc=5\" target=\"_blank\">Erin becomes 2025's first major hurricane as storm intensifies</a>&nbsp",
      "Erin has become the first hurricane of the Atlantic season with strong waves and rip currents possible along the East Coast of the United States as early as next week.",
      "<p>Erin not expected to make landfall, though nearby islands, including Puerto Rico, brace for flooding</p><p><a href=\"https://www.theguardian.com/world/hurricanes\">Hurricane</a> Erin has intensified into a category 5 storm as it churns its way over the Atlantic, brushing past islands in the north-e",
      "The Atlantic’s first hurricane of the season had maximum sustained winds of 160 miles per hour, forecasters said.",
      "Hurricane Erin gained strength Friday as it churned in the Atlantic Ocean and bore down on the Caribbean, where it could bring heavy rain to the Virgin Islands and Puerto Rico."
    ],
    "image_url": "",
    "titles": [
      "Hurricane Erin rapidly intensifies to a Category 5 storm in the Caribbean",
      "Erin rapidly intensifies to category five hurricane",
      "Hurricane Erin intensifies into a Category 5 storm",
      "Hurricane Erin strengthens to Category 5 - Axios",
      "Erin becomes 2025's first major hurricane as storm intensifies - Axios",
      "Hurricane Erin tracker: Storm strengthens to Category 5",
      "Hurricane Erin intensifies to category 5, moving through north-east Caribbean",
      "Hurricane Erin Strengthens To Category 5 Storm—Here’s What To Expect",
      "Hurricane Erin intensifies in Atlantic, eyes Caribbean"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.786,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.797,
    "summary": "Hurricane Erin has intensified to become the first major hurricane of 2025. The storm is currently located in the Atlantic Ocean and is heading towards the Caribbean. It is expected to bring heavy rainfall to the Virgin Islands and Puerto Rico.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Israel Plans Military Offensive in Northern Gaza, to Relocate Palestinians",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 18:40:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Global News",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Plans move ahead for a military offensive in some of the territory&#039;s most populated areas, amid move to seize Gaza City.",
      "The announcement comes days after Israel said it would launch an offensive to take control of northern Gaza City.",
      "Israel plans to relocate Palestinians in Gaza ahead of new offensives in dense areas. Families of hostages call for national protests; airstrikes, malnutrition toll rise.",
      "NAHARIYA, Israel (AP) — Israel announced Saturday that it is preparing to move Palestinians from combat zones to southern Gaza as plans move ahead for a military offensive in some of the territory&#8217;s most populated areas. The Israeli military body in charge of humanitarian aid to Gaza, COGAT, s"
    ],
    "image_url": "",
    "titles": [
      "Israel preparing to forcibly displace Palestinians to southern Gaza",
      "Israel announces plan to move Palestinians to southern Gaza",
      "Israel prepares to move Palestinians to southern Gaza as Israelis urge mass protest over conflict",
      "Israel prepares to move Palestinians to southern Gaza as Israelis urge mass protest over war"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.893,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary": "Israel has announced plans for a military offensive in northern Gaza City, aiming to take control of the area. As part of the preparation, Israel intends to relocate Palestinians from combat zones to southern Gaza, focusing on densely populated regions. This announcement follows concerns over rising airstrikes and malnutrition tolls. Additionally, families of hostages are calling for national protests in response to the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Phillies' Zack Wheeler on 15-Day IL for Shoulder Blood Clot, Return Uncertain",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 19:48:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Philadelphia Phillies ace Zack Wheeler was placed on the 15-day injured list with a blood clot near his right shoulder.",
      "There is currently no timetable for Wheeler's return",
      "<p>The Philadelphia Phillies placed ace Zack Wheeler on the 15-day injured list Saturday with a blood clot in his right arm.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies ace Wheeler on 15-day IL with blood clot",
      "Zack Wheeler injury update: Phillies place ace on IL due to blood clot near right shoulder",
      "Phillies ace Zack Wheeler diagnosed with blood clot in right arm, placed on 15-day IL"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.994,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.785,
    "summary": "Philadelphia Phillies pitcher Zack Wheeler has been put on the 15-day injured list due to a blood clot near his right shoulder. There is no set timeline for his return.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Itauma Knocks Out Whyte in First Round, Maintains Undefeated Record",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 22:22:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "The Guardian",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Itauma dispatched of his hardest test to date in incredible fashion on Saturday night",
      "<ul><li><p>Winner extends perfect record and closer to world title shot</p></li><li><p>Veteran sent crashing to canvas within two minutes</p></li></ul><p>Moses Itauma blew away Dillian Whyte with a devastating first-round knockout in their all-British heavyweight clash in Riyadh. The 20-year-old ext",
      "Live results from Riyadh: Moses Itauma vs. Dillian Whyte headlines a stacked card featuring Nick Ball, Sam Goodman, Filip Hrgovic, and more."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/16/c492e12f-f092-43a2-9255-0efb69e3bfd6/moses-itauma-whyte-action.jpg",
    "titles": [
      "Moses Itauma, rising heavyweight prospect at just 20, thrills with first-round knockout of Dillian Whyte",
      "Moses Itauma stuns Dillian Whyte with devastating first-round knockout",
      "Moses Itauma Vs. Dillian Whyte Full Card Results And Highlights"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.964,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary": "Moses Itauma achieved a significant victory by knocking out Dillian Whyte in the first round of their heavyweight fight in Riyadh. This win maintains Itauma's unbeaten record and moves him closer to a world title opportunity. The match ended within two minutes, marking an impressive performance against the veteran Whyte.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Palestinian Woman Evacuated to Italy for Malnutrition Dies in Pisa Hospital",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 21:07:56 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "The woman was one of 180 Gazans evacuated by Italy in response to the humanitarian crisis",
      "<p>Marah Abu Zuhri, 20, arrived in Pisa on an Italian humanitarian flight along with other critical patients</p><p>A 20-year-old Palestinian woman suffering from severe malnutrition who was evacuated from Gaza to Italy this week has died, a hospital in Pisa has said.</p><p>The woman, named by Italia",
      "MADRID (AP) — A 20-year old Palestinian woman described as being in a “state of severe physical deterioration” has died after being transferred to Italy for treatment, the hospital said Saturday. The patient was admitted to Pisa University Hospital late Wednesday and died on Friday. She was removed "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2e04/live/bc9a0ef0-7ace-11f0-a34f-318be3fb0481.jpg",
    "titles": [
      "Malnourished Gazan woman flown to Italy dies in hospital",
      "Malnourished Palestinian woman dies in Italy after Gaza evacuation",
      "Woman from Gaza evacuated to Italy in a ‘state of severe physical deterioration’ dies in hospital"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.92,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary": "A 20-year-old Palestinian woman, Marah Abu Zuhri, who was evacuated from Gaza to Italy due to severe malnutrition, has died in Pisa University Hospital. She arrived in Pisa on an Italian humanitarian flight, part of Italy's response to the humanitarian crisis in Gaza, and was admitted to the hospital in a state of severe physical deterioration. Despite efforts to treat her, Abu Zuhri passed away shortly after her arrival.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/italy.svg",
      "thumbnail": "icons/italy.svg",
      "alt": "italy flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Shifts to Seek Peace in Ukraine After Putin Talks, Ditching Ceasefire Plan",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 14:21:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "US president changes position on Ukraine, saying he prefers direct peace accord instead of ceasefire after Alaska talks.",
      "Zelenskyy said he and Trump would meet Monday to \"discuss all of the details regarding ending the killing and the war.\"",
      "Trump said after meeting with Putin in Alaska the “best way” to end Russia’s war with Ukraine is “to go directly to a peace agreement,” and not a “mere ceasefire agreement.”"
    ],
    "image_url": "",
    "titles": [
      "Trump to meet Ukraine’s Zelenskyy after ‘successful’ talks with Putin",
      "Zelenskyy to meet with Trump after Putin talks end without a ceasefire",
      "Trump Will Meet Zelensky In D.C. Monday After Alaska Meeting With Putin"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.816,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary": "After discussions with Putin in Alaska, Trump has shifted his stance on the Ukraine conflict, now advocating for a peace agreement rather than a ceasefire. This comes as the Ukrainian President plans a return visit to the White House, marking his first since a notable disagreement with Trump in February. Trump's new position emphasizes seeking a comprehensive resolution to Russia's war with Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Government Mandates Arbitration for Air Canada Strike, Aims to End Disruptions",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 21:05:54 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "Air travellers across the country continued dealing with hundreds of grounded planes on Saturday as the federal government announced it was ordering a binding arbitration in a labour strife between Air Canada and its 10,000 flight attendants on strike. In Ontario, passengers who had received notice ",
      "Air travellers across the country continued dealing with hundreds of grounded planes on Saturday as the federal government announced it was ordering a binding arbitration in a labour strife between Air Canada and its 10,000 flight attendants on strike. In Ontario, passengers who had received notice "
    ],
    "image_url": "",
    "titles": [
      "Travellers stranded despite federal intervention into Air Canada labour strife",
      "Travellers stranded despite federal intervention into Air Canada labour strife"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.939,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.717,
    "summary": "The federal government has mandated binding arbitration to address the labor dispute between Air Canada and its 10,000 striking flight attendants, leading to hundreds of flight cancellations nationwide. This decision aims to resolve the ongoing issue and mitigate further travel disruptions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Canada Gov Intervenes in Airline Dispute to Curb Economic Threat",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 20:27:30 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "OTTAWA &#8212; The federal Liberal government is intervening to resolve a labour dispute at Canada&#8217;s largest airline that scuttled hundreds of flights, stranded travellers and threatened the economy. Jobs Minister Patty Hajdu said she directed the Canada Industrial Relations Board to order Air",
      "The federal Liberal government is defending its decision to intervene to resolve a labour dispute at Canada&#8217;s largest airline amid criticism from unions and opposition parties that the move sides with big business. Jobs Minister Patty Hajdu said Saturday that she directed the Canada Industrial"
    ],
    "image_url": "",
    "titles": [
      "Hajdu orders binding arbitration, resumption of operations to end Air Canada strike",
      "Hajdu orders binding arbitration, resumption of operations to end Air Canada strike"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.926,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.708,
    "summary": "The Canadian federal government, led by the Liberal party, has intervened in a labour dispute at the nation's largest airline, which resulted in numerous flight cancellations and stranded passengers, citing economic threats. Jobs Minister Patty Hajdu directed the Canada Industrial Relations Board to take action, facing criticism from unions and opposition parties for allegedly favoring big business. This move aims to resolve the conflict and mitigate its impact on the economy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Pakistan Floods: 400 Dead, Thousands Stranded in Monsoon Havoc",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 06:53:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "Rescue efforts intensify in flood-hit villages as thousands remain stranded and death toll rises across Pakistan.",
      "Floods triggered by cloudbursts and monsoon rains have killed around 400 people, with many more still missing, officials say. Rescue workers are desperately searching for survivors among the muddy debris."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82f6/live/7becf7b0-7a82-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Flash floods kill more than 300 in Pakistan and Pakistan-administered Kashmir",
      "Flash floods wreak havoc in northern Pakistan",
      "Flash floods kill hundreds in Pakistan, India"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.684,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary": "Floods caused by cloudbursts and monsoon rains in Pakistan have resulted in approximately 400 deaths, with a significant number occurring in the Khyber Pakhtunkhwa region. Thousands of individuals are stranded as rescue operations continue in affected villages. Officials report many people are still missing, and efforts are underway to locate survivors in the aftermath.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/pakistan.svg",
      "thumbnail": "icons/pakistan.svg",
      "alt": "pakistan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Chargers' Quentin Johnston Carted Off Field After Hit in Preseason Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 19:48:58 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.espn.com",
      "www.usatoday.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Chargers WR Quentin Johnston exited Saturday's preseason game on a cart after taking a big hit that left him motionless for several minutes.",
      "The former first-round pick had an apparent fencing response after the hit.",
      "The preseason battle of Los Angeles saw a starting wide receiver carted off with an injury. Here's what we know about Quentin Johnston's status.",
      "Chargers wide receiver Quentin Johnston's head bounced off the turf after he took a big hit on an incomplete pass."
    ],
    "image_url": "",
    "titles": [
      "Chargers WR Johnston carted off after big hit",
      "Chargers WR Quentin Johnston exits game after brutal hit to helmet",
      "Quentin Johnston injury: Chargers WR carted off after hard hit vs. Rams",
      "Chargers WR Quentin Johnston leaves on a cart after a scary hit"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.994,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary": "Chargers wide receiver Quentin Johnston was carted off the field during a preseason game after a significant hit left him motionless. The incident occurred when his head hit the turf following an incomplete pass, leading to an apparent fencing response, indicating a possible serious injury. His current status following the injury has not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "US-Russia Talks End Without Ceasefire; Putin Invites US Leader to Moscow",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 05:01:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "With no ceasefire and an invitation to Moscow, the US and Russia's meeting yields more questions than answers.",
      "The US leader cut a subdued figure after the meeting, which failed to achieve its primary goal – an end to Russia&#039;s war.",
      "President Donald Trump dropped his demand for an immediate ceasefire in Ukraine after meeting with Russian President Vladimir Putin. Here are five takeaways from the Alaska summit and its aftermath."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4419/live/35fdd590-7a77-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Five key takeaways after the Alaska summit",
      "‘No deal’ at Trump-Putin meeting: Key takeaways from Alaska summit",
      "Key takeaways from Trump-Putin summit and dramatic ceasefire reversal"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.658,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary": "The US-Russia meeting concluded without reaching its main objective of ending Russia's war, leaving many unresolved issues. Despite the lack of a ceasefire, Russian President Vladimir Putin extended an invitation to the US leader for a future meeting in Moscow. The outcome of the summit has been characterized by more questions than answers, with the US leader appearing subdued post-meeting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Proposes U.S. Backs Ceding Ukrainian Land to Russia After Meeting",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:06:15 +0000",
    "source": "New York Times",
    "sources": [
      "LA Times",
      "New York Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "After meeting the Russian president, President Trump told European leaders he now favors giving up territory Ukraine controls to Russia to end the fighting, a concession Ukraine has long opposed.",
      "The U.S. president’s latest statements are a reversal of much of what he seemed to have agreed to with European allies this past week.",
      "<p>Achieving a peace agreement is an even higher bar than the ceasefire that has eluded the Trump administration in recent months.</p>"
    ],
    "image_url": "https://static01.nyt.com/images/2025/08/15/multimedia/16trump-news-promo-4pm/16trump-news-promo-4pm-mediumSquareAt3X.jpg",
    "titles": [
      "Trump Backs Plan to Cede Land for Peace in Ukraine",
      "After Meeting Putin, Trump Reverts to Land Swaps for Peace in Ukraine",
      "After welcoming Putin, Trump appears to adopt his goal, agreeing to cede land for peace"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.979,
      "consensus": 0.682,
      "constructiveness": 0.06,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary": "President Trump, after meeting with the Russian president, proposed to European leaders that the U.S. should support ceding control of Ukrainian territory to Russia to halt ongoing conflict, marking a significant shift from his previous stance and agreements with European allies. This suggestion opposes Ukraine's position and complicates efforts towards achieving a peace agreement, which has been challenging to attain, even more than a ceasefire.",
    "constructiveness_score": 0.06,
    "constructiveness_reason": "1 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Putin Proposes Freeze on Ukraine Frontline, Challenges NATO Expansion",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:11:05 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Russian president reiterated ‘core demands’ that would undermine Ukraine’s statehood and roll back Nato expansion",
      "<p>Putin told Trump he would halt further advances and freeze Ukrainian frontline where Russian forces occupy significant areas, sources say</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/aug/16/zelenskyy-to-meet-trump-on-monday-putin-alaska-summit-briefing\">Zelenskyy to meet Trump on"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fdc7c83e9-e44e-4278-b3c8-810a474a1605.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Putin demanded Ukraine cede Donetsk and Luhansk in exchange for freezing rest of front line",
      "Putin demands full control of Donetsk and Luhansk as condition for ending Ukraine war – live"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.884,
      "consensus": 0.682,
      "constructiveness": 0.075,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "Russian President Putin has reiterated demands that challenge Ukraine's sovereignty and seek to reverse NATO expansion. He has proposed halting Russian advances and maintaining the current frontline in Ukraine, where Russian forces control significant territories. This development comes as Ukrainian President Zelenskyy is scheduled to meet with former U.S. President Trump.",
    "constructiveness_score": 0.075,
    "constructiveness_reason": "1 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "West Virginia to Deploy 300-400 National Guard Troops on Trump's Request",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 22:31:10 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Troops requested by Trump team are ‘ready to respond’ but ‘not on a political policing mission’, veteran group says</p><p><a href=\"https://www.theguardian.com/us-news/west-virginia\">West Virginia</a> is to deploy 300 to 400 national guard troops to <a href=\"https://www.theguardian.com/us-news/was",
      "Morrisey said the deployment includes hundreds of “skilled personnel” at the request of the Trump administration."
    ],
    "image_url": "https://i.guim.co.uk/img/media/5cfd614777e2b9e872d7b379c605abcc2eeb75b5/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=eeeef6b64d0229182249343a8c2d53ee",
    "titles": [
      "West Virginia to deploy hundreds of national guard troops to Washington DC",
      "West Virginia Governor Morrisey Deploys National Guard To DC Amid Trump’s Police Takeover"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.947,
      "consensus": 0.682,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary": "West Virginia is set to deploy 300 to 400 National Guard troops at the request of the Trump administration, according to Attorney General Patrick Morrisey. These troops, described as \"skilled personnel,\" are prepared to respond but are not on a mission related to political policing, a veteran group clarified. This deployment aims to provide support as requested by the Trump team.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "MacIntyre Leads BMW Championship by Four, Unfazed by Scheffler and Fans",
    "domain": "sports",
    "source_domain": "golfweek.usatoday.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 23:54:04 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "golfweek.usatoday.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Robert MacIntyre is not backing down from anyone this week. Not even the World No. 1 or some rowdy American fans.",
      "Scotland's Robert MacIntyre holds a four-shot lead heading into the final round of the BMW Championship, but faces a daunting final day paired with world No 1 Scottie Scheffler."
    ],
    "image_url": "",
    "titles": [
      "'It ain't bothering me': Robert MacIntyre addresses \n'jeering' fans at BMW Championship",
      "Scheffler chasing down MacIntyre at BMW Championship"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.995,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "Scottish golfer Robert MacIntyre leads by four shots entering the final round of the BMW Championship, despite the challenge of playing alongside World No. 1 Scottie Scheffler. MacIntyre has also faced vocal American fans but remains undeterred as he aims for victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rookie McLean Shines in Debut, Mets Beat Mariners 3-1",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 23:26:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.nydailynews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The former third-round pick fared well in a win against the Mariners on Saturday",
      "NEW YORK — Nolan McLean sure can spin it, but the rookie didn’t solve the Mets' issue of starting pitching length. Making his big league debut, McLean shut out the Seattle Mariners over 5 1/3 innings on Saturday afternoon at Citi Field in a 3-1 win, navigating a deep lineup with an array of spinning"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/16/84996c64-b278-4360-8d0e-837de4a863f8/081625-nolanmclean.jpg",
    "titles": [
      "Nolan McLean accomplishes feat in Mets debut not seen in over 12 years",
      "Nolan McLean impresses in MLB debut as Mets top Mariners"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.986,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary": "In his major league debut, rookie Nolan McLean pitched impressively, shutting out the Seattle Mariners over 5.1 innings, contributing to a 3-1 victory for his team on Saturday at Citi Field. Despite McLean's strong performance, his debut highlighted the ongoing issue of starting pitching length for the Mets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Saints QB Andy Dalton Exits Game Early Due to Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 20:21:01 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Dalton played just one drive before suffering the injury",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxNN2h2Q01SZUlWZ2c5VWEzTzRYRTd4czQ5MmZSa242NFdGN0J3cjZpbm00c1NqNmJLb2F6Vml3cEFrSHJLNzE4aE9CRHFfc2tyZGdyd1owdzU3SFVvT3p0RkJWSDJHQU1QdFVzdzhLQm54YkFRWmdGVHVDWFVIaUxmRVM0RkZ1RDN1LWNsY1pRTW1LLV9GTk5j?oc=5\" target=\"_blank\">Andy Dalton Leaves Pant",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNR2FDU3UzTFk4U0I5Z2JUdEhEX1VnMTR1UnktSnRZenFmOG00eG5OYnBMdzFCWWV1c2tzVWcyaUwzNVVvTldkYmpMS2hFejV4NU9lUHFDeFAwSktkTEdUNXRBS3pHc2NHaHJ1MU1FYnFvOFhDc3l6T1FlMDRvT0VEd0xXekQ4T0VkaUpWcg?oc=5\" target=\"_blank\">How to Watch/Stream/Listen Colts vs. "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2024/09/24/8f29dc86-17c1-4010-8371-2558aaeb66c4/getty-andy-dalton-panthers.jpg",
    "titles": [
      "Panthers QB Andy Dalton leaves preseason game with apparent right elbow sprain",
      "Andy Dalton Leaves Panthers' Preseason Game Against Texans With Injury - Sports Illustrated",
      "How to Watch/Stream/Listen Colts vs. Packers | Preseason Week 2 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.924,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Andy Dalton, the quarterback for the New Orleans Saints, was forced to leave the game after just one drive due to an injury. The specific nature of the injury was not disclosed in the provided content. As of now, there is no update on his condition or the extent of his injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rashford Makes Debut for Barcelona in La Liga Defense",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 20:59:18 GMT",
    "source": "The Guardian",
    "sources": [
      "Sports Illustrated",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>In the end Marcus Rashford did get to make his competitive debut for Barcelona as they began their defence of the La Liga title. Formally registered a little after 10.30 on Saturday morning, Barcelona’s economic obstacles overcome, he was introduced just after 9pm with 22 minutes left of a sticky",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQY09YSTZPTGlJSlJfdTJWdGpTbXgtcTl0YVFhSWY2MkpWV3F1YkNsd3VZajRVZXFuQm0wQndGUXlWYXFsZmtUd29tZkFiZXJydHEybXVTLWRLcnhYV2p1UGloZUlmVzJlY1JydTRmSUFPa0tPSTJfN2ZrTDZIWUxyTzBMWQ?oc=5\" target=\"_blank\">How Marcus Rashford Fared in La Liga Debut vs. Ma"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c6da8e7988d5eeee0bc121c34affd0b4e9a42368/236_0_3167_2534/master/3167.jpg?width=140&quality=85&auto=format&fit=max&s=2ab53084140ea23490fc741a6f773b5d",
    "titles": [
      "Marcus Rashford makes debut as Barcelona stroll past nine-man Mallorca",
      "How Marcus Rashford Fared in La Liga Debut vs. Mallorca - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.917,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "Marcus Rashford made his competitive debut for Barcelona in their La Liga title defense, entering the game with 22 minutes remaining. His participation was confirmed after Barcelona overcame economic challenges to formally register him on Saturday morning before the match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "ASU Develops NasRED: Rapid Test Detects COVID, Ebola, HIV from a Blood Drop",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 23:54:52 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Arizona State University scientists have unveiled NasRED, a revolutionary one-drop blood test that can detect diseases like COVID-19, Ebola, HIV, and Lyme with incredible speed and precision. Using gold nanoparticles to spot microscopic disease markers, the device delivers results in just 15 minutes",
      "<a href=\"https://scitechdaily.com/2-one-drop-blood-test-detects-hidden-diseases-in-15-minutes/\" rel=\"nofollow\" title=\"$2 One-Drop Blood Test Detects Hidden Diseases in 15 Minutes\"><img alt=\"Artistic Illustration of Gold Nanoparticles Detecting Disease Proteins\" class=\"webfeedsFeaturedVisual wp-post-"
    ],
    "image_url": "",
    "titles": [
      "A $2 gold nanotech test that detects deadly diseases in minutes",
      "$2 One-Drop Blood Test Detects Hidden Diseases in 15 Minutes"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.656,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary": "Arizona State University scientists have developed NasRED, a groundbreaking blood test capable of detecting diseases such as COVID-19, Ebola, HIV, and Lyme disease quickly and accurately. This innovative test, which requires just a single drop of blood, utilizes gold nanoparticles to identify tiny disease markers, providing results in as little as 15 minutes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canada Gov Faces Critique for Airline Dispute Intervention",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 21:54:59 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "OTTAWA &#8212; The federal Liberal government is defending its decision to intervene to resolve a labour dispute at Canada&#8217;s largest airline amid criticism from unions and opposition parties that the move sides with big business. Jobs Minister Patty Hajdu said Saturday that she directed the Ca"
    ],
    "image_url": "",
    "titles": [
      "Liberals defend stepping in to end dispute between Air Canada and flight attendants"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.536,
    "summary": "The Canadian federal government, led by the Liberal party, is facing criticism for intervening in a labor dispute at the country's largest airline. Critics, including unions and opposition parties, argue that the government's intervention favors big business. Jobs Minister Patty Hajdu defended the decision, stating it was necessary to protect jobs and maintain stability.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "NASA's Perseverance Rover Sends Back Sharpest Mars Photos Yet",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:39:25 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/stunning-new-nasa-perseverance-rover-images-show-mars-clearer-than-ever-before/\" rel=\"nofollow\" title=\"Stunning New NASA Perseverance Rover Images Show Mars Clearer Than Ever Before\"><img alt=\"NASA Mars Falbreen Mosaic Enhanced Color\" class=\"webfeedsFeaturedVisual w"
    ],
    "image_url": "",
    "titles": [
      "Stunning New NASA Perseverance Rover Images Show Mars Clearer Than Ever Before"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.493,
    "summary": "NASA's Perseverance Rover has captured new images of Mars, providing clearer views of the planet's surface than ever before. These high-resolution photos offer detailed insights into Mars' geological features, aiding scientists in their research on the planet's environment and history. The images have been shared publicly, allowing for widespread access to the latest visual data from Mars.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "OpenAI Staff Can Sell Shares in Secondary Sale Amid AI Talent War",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:11:55 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "fortune.com"
    ],
    "snippets": [
      "The secondary share sale will give OpenAI employees a chance to get cash-rich amid a high-stakes talent war in the AI industry."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2218344211-e1755385279794.jpg?w=2048",
    "titles": [
      "OpenAI staffers to sell $6 billion in stock to SoftBank, other investors"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "summary": "OpenAI is conducting a secondary share sale, allowing its employees to cash in on their shares. This move comes amidst intense competition for talent in the AI sector. The sale provides an opportunity for OpenAI staff to benefit financially from their involvement with the company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Big Tech Promotes Generative AI as Future-Changing Technology",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sat, 16 Aug 2025 18:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Big tech company hype sells generative artificial intelligence (AI) as intelligent, creative, desirable, inevitable, and about to radically reshape the future in many ways."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/australiana-images-mad.jpg",
    "titles": [
      "'Australiana' images made by AI are racist and full of tired cliches, researchers say"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "Big tech companies are promoting generative artificial intelligence (AI) as a transformative technology, highlighting its intelligence, creativity, desirability, and inevitability. They claim it will significantly alter the future across various sectors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Black Holes Studied as Cosmic Supercolliders in Dark Matter Hunt",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 23:14:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-eye-black-holes-as-cosmic-supercolliders-in-the-hunt-for-dark-matter/\" rel=\"nofollow\" title=\"Scientists Eye Black Holes as Cosmic Supercolliders in the Hunt for Dark Matter\"><img alt=\"Supermassive Black Hole\" class=\"webfeedsFeaturedVisual wp-post-image\" h"
    ],
    "image_url": "",
    "titles": [
      "Scientists Eye Black Holes as Cosmic Supercolliders in the Hunt for Dark Matter"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.485,
    "summary": "Scientists are investigating black holes as potential cosmic supercolliders to detect dark matter, the elusive substance that makes up a significant portion of the universe's mass. This approach is based on the hypothesis that interactions around black holes might reveal dark matter particles, offering a new method to understand this mysterious component of the cosmos.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Reports Warn of Potential Economic Ruin Over Success",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 22:46:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "fortune.com"
    ],
    "snippets": [
      "\"In short, the economic consequences would be ruinous, instead of unprecedented success.\""
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2208188174-e1755374702922.jpg?w=2048",
    "titles": [
      "Trump’s reciprocal tariffs could be struck down as soon as this month — and the administration is warning of economic apocalypse"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "Various news sources are reporting on potential economic consequences that could be ruinous instead of leading to unprecedented success. The exact details and context of this statement are not provided, making it challenging to offer a specific summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Mysterious Radio Signals Unveil Hidden Matter Between Galaxies",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 22:49:59 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/mysterious-radio-signals-reveal-whats-hiding-between-galaxies/\" rel=\"nofollow\" title=\"Mysterious Radio Signals Reveal What’s Hiding Between Galaxies\"><img alt=\"Visualizing a Fast Radio Burst\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://sci"
    ],
    "image_url": "",
    "titles": [
      "Mysterious Radio Signals Reveal What’s Hiding Between Galaxies"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "Astronomers have detected mysterious radio signals, known as Fast Radio Bursts (FRBs), which have helped reveal previously undetected matter located in the spaces between galaxies. This discovery could provide insights into the composition and structure of the universe beyond our galaxy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI-powered stuffed animals are coming for your kids",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:39:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Do A.I. chatbots packaged inside cute-looking plushies offer a viable alternative to screen time for kids? Maybe not."
    ],
    "image_url": "",
    "titles": [
      "AI-powered stuffed animals are coming for your kids"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.477,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Judge says FTC investigation into Media Matters ‘should alarm all Americans’",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 20:32:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "A federal judge has blocked the FTC's investigation into Media Matters research around advertising and antisemitic content on X."
    ],
    "image_url": "",
    "titles": [
      "Judge says FTC investigation into Media Matters ‘should alarm all Americans’"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Celebrating 50 years of The Rocky Horror Picture Show",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 19:26:22 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "\"It's had a profound impact on our culture, especially on people who've felt different and marginalized.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/horrorTOP-1152x648-1754745307.jpg",
    "titles": [
      "Celebrating 50 years of The Rocky Horror Picture Show"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.907,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Brain's Aging Process Reassessed: Some Areas Improve Over Time",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 16:49:04 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/parts-of-the-brain-defy-aging-and-even-improve-over-time/\" rel=\"nofollow\" title=\"Parts of the Brain Defy Aging and Even Improve Over Time\"><img alt=\"Cerebral Cortex Ages Less Than Thought\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"519\" src=\"https://scitec"
    ],
    "image_url": "",
    "titles": [
      "Parts of the Brain Defy Aging and Even Improve Over Time"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.859,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.467,
    "summary": "Recent studies have shown that certain areas of the brain are more resistant to the effects of aging, with some parts even showing improvement over time. This challenges previous beliefs about the brain's aging process, suggesting that the cerebral cortex, in particular, ages less than previously thought. This discovery could have significant implications for understanding brain health and aging.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Method to Restore Memory by Recharging Brain's Mitochondria Found",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 16:24:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/how-recharging-the-brains-batteries-restored-lost-memory/\" rel=\"nofollow\" title=\"How Recharging the Brain’s “Batteries” Restored Lost Memory\"><img alt=\"Human Brain Weak Battery\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/"
    ],
    "image_url": "",
    "titles": [
      "How Recharging the Brain’s “Batteries” Restored Lost Memory"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.851,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Researchers have discovered a method to restore lost memory by recharging the brain's mitochondria, often referred to as the cell's \"batteries.\" This breakthrough could lead to new treatments for memory loss associated with conditions like Alzheimer's disease. The study, focusing on the brain's capacity to recover lost memories rather than permanently losing them, represents a significant advancement in understanding and potentially reversing memory loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 17:50:31 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "The good news is that, for now, Erin appears unlikely to directly strike land."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1-1152x648.jpg",
    "titles": [
      "Rapidly intensifying Hurricane Erin becomes historic storm due to strengthening"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.877,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Great White Sharks Recover Globally, DNA Puzzles Scientists",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 12:42:34 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Once on the brink during the last ice age, great white sharks made a remarkable recovery globally, but their DNA reveals a baffling story. Classic migration explanations fail, leaving scientists with a mystery that defies reproductive and evolutionary logic."
    ],
    "image_url": "",
    "titles": [
      "Great white sharks have a DNA mystery science still can’t explain"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.857,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary": "Great white sharks, nearly extinct during the last ice age, have made a significant global recovery. However, their DNA presents a mystery that contradicts traditional theories on migration, reproduction, and evolution, leaving scientists puzzled about the specifics of their resurgence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/dna.svg",
      "thumbnail": "icons/dna.svg",
      "alt": "dna",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 15:50:05 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Anthropic says new capabilities allow its latest AI models to protect themselves by ending abusive conversations."
    ],
    "image_url": "",
    "titles": [
      "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.841,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T10:23:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Some people like to stay on the cutting edge of technology. If that’s you, you already know that Google is going to officially unveil its Pixel 10 phones (including a new Fold) during its August 20th event. But if you’re someone who prefers to use these opportunities to save on last-gen tech, you’ve"
    ],
    "image_url": "",
    "titles": [
      "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.816,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "A brazen attack on air safety is underway — here’s what’s at stake",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "At the end of July, the National Transportation Safety Board (NTSB) convened a three-day public hearing to investigate January's mid-air collision over Washington, DC that killed 67 people. After the hearing, two conclusions were inescapable. First, the disaster should have been prevented by existin"
    ],
    "image_url": "",
    "titles": [
      "A brazen attack on air safety is underway — here’s what’s at stake"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.777,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "How a mysterious particle could explain the Universe’s missing antimatter",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 11:15:17 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "New experiments focused on understanding the enigmatic neutrino may offer insights."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/cube1CROP-1152x648.jpg",
    "titles": [
      "How a mysterious particle could explain the Universe’s missing antimatter"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.765,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.448,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]