[
  {
    "title": "Israel-Iran Ceasefire Holds After U.S. and Israel Strike Nuclear Sites",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 10:21:37 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "LA Times",
      "Business Insider",
      "Financial Times",
      "NPR",
      "ESPN",
      "Global News",
      "Al Jazeera",
      "Washington Post",
      "Axios",
      "Yahoo Sports",
      "Bloomberg",
      "ABC News",
      "New York Times",
      "The Guardian",
      "Financial Post",
      "Deutsche Welle",
      "CBC News",
      "BBC"
    ],
    "domains": [
      "business",
      "general",
      "sports"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu wanted to attack Iran for decades, but the U.S. and his own security chiefs deterred him. Now he's basking in the moment.",
      "President Trump had been eager to celebrate the U.S. strikes on Iran, but a new report indicates the attack set back Iran’s nuclear program by only a few months.",
      "Trump has long questioned the value of U.S. membership in NATO, an alliance he’s cast as a drain on American resources.",
      "President Donald Trump previously said the US commitment to mutual defence guarantees &#039;depends on your definition&#039;.",
      "<p>Trump will be at the NATO summit through Wednesday, where he is expected to meet with leaders from across Europe, including Ukrainian President Volodymyr Zelensky.</p>",
      "Iranian and Israeli officials said they would respect the terms of the ceasefire if the other side did too.",
      "In public, Qatar was insisting on the right to defend itself after Iran attacked a U.S. military site in the emirate. Behind the scenes, it was already mediating a truce between Israel and Iran.",
      "The period after President Trump announced the cease-fire was muddied by time zone differences, unclear wording in statements and continuing strikes.",
      "President Trump said the truce was holding after lashing out at both countries for seemingly violating the agreement.",
      "Large flames illuminated the night sky as airstrikes pummeled the Iranian capital, residents said. Later on Tuesday morning, state television said a cease-fire had been agreed to with Israel.",
      "Formula 1 heads into round 11 in Spielberg as McLaren's Oscar Piastri remains championship leader - will the Austrian Grand Prix provide any upsets?",
      "Here's a guide that tells you what you need to know about Sunday's Austrian Grand Prix.  — Other countries are listed here.  What is the Austrian Grand Prix schedule?  It starts at 3 p.m. local time (9 a.m. ET / 1400 GMT).  Where is the Austrian Grand Prix taking place?",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNYW5TVGlObkNPY2pySHlJTVh0clVDSjB0VFpFSXhUX212OFJPOWllbXY5M0RfNmJlTDdBdGxIOG5uOW1aR2VBR0FLV2NacEM3aFNneU9ITjlIWG9ISkoyV18yb3VsaDJ5S3liRlJldC1ZdlpSTEFYNzlIQ19mZjZ6UnF0Z01fQQ?oc=5\" target=\"_blank\">House, Senate briefings postponed after Iran ",
      "Democrats reacted with outrage after the Trump administration, which has yet to consult with Congress on its strikes against Iran, delayed a planned briefing with lawmakers on Capitol Hill.",
      "An Iran-Israel truce takes hold.",
      "US President Donald Trump has compared the US strikes in Iran to the nuclear bombs dropped on Hiroshima and Nagasaki,",
      "Despite President Trump’s dismay over Israel’s continued bombing, Israelis say American intervention has put bilateral relations back on track.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNWDQ4N29VZVpjUVBxT0tIUWZPRWQtZDFTODFLZ2dZTHNOeFAxamZTVExSY2loWlduM1lJazNlQ29YeVRoMGMyZ1BBSnV2bE44T1Z0bEI5TG1ITDVPLUw1aXdKQmlqSTZ6M0FmcU5kR1d2LTJlZnJBWnJWZTdoalNuQlE2M1Q1ajQ?oc=5\" target=\"_blank\">Dems join GOP to kill vote impeaching Trump ",
      "“Iran is willing to engage diplomatically, but what we’ve not seen is any good faith from the United States.”",
      "<p>Following U.S. strikes on three nuclear facilities in Iran, the chances of North Korea returning to the bargaining table have become even slimmer.</p>",
      "President Trump spoke at the conclusion of the summit in the Netherlands — as the world watches to see whether a ceasefire between Israel and Iran will endure.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNV0xlZDE4VnhNTkpaR1liMVE2N3FwaHg1VVVkQ2tJX3RiR1NqWmZlMGM0dmdvNnN4dkhGQTVzOU5hQ1lfUjNoQlUxQl9pV3k5dzdxZXgyaWRRRWVZMXVMM2pYTE10VTd4emxIalhFZUk0VV9OSExFaXRYQTc0X0NQUFljS2Z5bmlOS1FnUEZQRnlSVW91TjVxMg?oc=5\" target=\"_blank\">Satellite Imagery Sho",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQUnA5Ty1ldk1xVmhUdFk3Nk9pcDNjUnU5TFp2aHBsWXNmY0FMUnR2Q1dYNGRNV241UHowandwckZWSHgtaVlGRGREQTY1UTVMMUZoRlN0TnVaUnZDUzEwZzB6OTBTMHE2YkR0cG1GSlNKM2JXZVRpbzNETGVhRXR6TWwyVjdtYmc?oc=5\" target=\"_blank\">Israeli intelligence sees \"significant\" dama",
      "The assertion comes as questions swirl about how effective the U.S. and Israeli strikes were.",
      "President Trump said the attacks \"completely obliterated\" Iran's key nuclear facilities. Experts aren't so sure the program is destroyed.",
      "Core components of Iran’s nuclear effort were damaged but not destroyed by U.S. airstrikes on three key facilities, say people familiar with a Defense Intelligence Agency initial assessment.",
      "An early assessment by the Defense Intelligence Agency believes the damage to Iran's most important nuclear site was limited. And, Trump will meet with NATO allies today to discuss a spending increase.",
      "U.S. President Donald Trump’s claim that Iranian nuclear sites were 'obliterated' runs contrary to reporting by several U.S. media outlets.",
      "Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to producing a nuclear weapon. He railed against a less optimistic U.S. intelligence report.",
      "<img alt=\"A security guard stands on a street in the Iranian capital of Tehran.\" height=\"349\" src=\"https://i.cbc.ca/1.7569891.1750801957!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/security-guard-standing-on-a-street-in-tehran-iran.JPG\" title=\"A security guard stands on a street, during ",
      "<img alt=\"A balding man with a beard and mustache wearing glasses and a suit \" height=\"349\" src=\"https://i.cbc.ca/1.7570166.1750838517!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/iran-nuclear-parliament-iaea.JPG\" title=\"FILE PHOTO: Iranian Parliament Speaker Mohammad Baqer Qalibaf looks ",
      "<p>President calls intelligence ‘inconclusive’, while defence secretary describes harm to facilities as ‘moderate to severe’</p><p>Donald Trump and the US defence secretary, Pete Hegseth, have admitted to some doubt over the scale of the damage inflicted on Iran’s nuclear sites by the US bombing at ",
      "President dismissed intelligence leak suggesting impact of American strikes on key facilities was limited",
      "President Donald Trump said the US would hold a meeting with Iran next week but cast doubt on the need for a diplomatic agreement, citing the damage that American bombing had done to its key nuclear sites.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMEtwa0NEa0FhMjRZR3gzaThZWHNpdlBqRTMxNGc1akVWNktab2lEdjl2ODNUOXd2TkhmbFBnY2NYZkM5NjZiMHNJSkpXcjBiOFVBOWlrdzZldmh2SWxlWGVtV0tDSGhCUDhQclVLc1l3TU81RU43UzMtbjF0eXpMeUUzR0FqOUtj?oc=5\" target=\"_blank\">Trump Says US to Meet Iran Next Week, Putin",
      "US President Donald Trump said attacking Iran caused \"great progress\" in negotiations regarding Gaza, and insisted Tehran \"won't be building nuclear weapons for a long time.\" DW has more.",
      "Medical sources say at least 14 Palestinians have been killed by Israeli forces near aid distribution centres in Gaza.",
      "<p>Hamas militants plant bomb on Israeli military vehicle in Khan Younis, causing it to catch fire</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/25/israel-iran-war-live-iranian-nuclear-program-could-restart-in-months-pentagon-finds-as-fragile-ceasefire-holds\">Middle East cri",
      "The Israeli military said the soldiers were killed in the southern city of Khan Younis, and that they were part of a team finding and demolishing tunnels.",
      "Will America’s pre-emptive strike discourage other countries from pursuing a weapon — or just the opposite?",
      "The decision means that Britain’s air force will have a nuclear role for the first time since the end of the Cold War.",
      "The mayor of Greater Manchester calls on the government to act while the remaining survivors of the UK's 1950s nuclear tests are still alive.",
      "President Trump announced the talks as the cease-fire between Israel and Iran entered a second day. It was unclear what format the discussions would take, or if they would lead to limits on Iran’s nuclear program.",
      "Trump, speaking at a news conference at the NATO summit in the Netherlands, celebrated allies boosting defense spending.",
      "US President Trump doubles down on his assertion that Iranian nuclear programme has been set back by decades.",
      "Fordo is probably the most spied-on place on the planet - and work to understand what is happening there is set to intensify further.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOUDVJVHdlSlBDdWlCd1JvaC01VU1MOXBzZk9MLVMyNl9MZHJ2b20wMzJETFp4cWN3OEFySTRfdmlVZkZEMDh2SlJsZlhxakdCTHhCNHdWZ0Nwc1pITjZsaEVsYllqWFRpR0hDMG94ZWxhVkZTdXVsNmdDOTNhTHhQLU1WUQ?oc=5\" target=\"_blank\">Schumer fumes over postponed Iran briefing from W",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9uQ3BCYUtaZFJKeTRScmpMV1Izd0NnV0twQ0k4aXBEb2JiV2pkVHlGZXhIbklpZHE0elNKVDZ6eUdTelBLYjZ3Nkt4eWlnRy0zYkVLeTlCOVM2S3dUSl9XLUZFbWR3RmVjU1I4QWh2OFdkcFhQT3dxZmZZVQ?oc=5\" target=\"_blank\">Scoop: Senate GOP mocks Iran war predictions by Tucker Carlso",
      "The truce went into effect after pressure from President Trump and Qatar. Israel said its forces were now shifting their attention back to Gaza.",
      "The truce promised to bring an end to a 12-day conflict that saw the U.S. strike Iranian nuclear facilities, and ballistic missiles fired at Israeli cities.",
      "Indications from an early intelligence assessment on the impact of the strikes began to emerge.",
      "<p>Trump’s claim runs counter to a leaked US intelligence report which said the damage had only set Iran’s nuclear programme back a ‘few months’</p><p>At the Nato summit in the Netherlands, tensions between Israel and Iran could dominate discussions among world leaders amid the fragile ceasefire.</p",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1GYVFEQXpXY0pvaUc0LU1MbV9hVXpTaGdkY1JqclZVejRGYl9oVUR3ck9KdE14UDBhRlJ0X2E2Vm1jYlVyZjNuNFc1VVB5anhaSXhMbEIycENhS0Z6bEZkM3psOExEUFNCcXdUX0g0UmRnYXo5MnFV?oc=5\" target=\"_blank\">Iran-Israel ceasefire reignites MAGA push for a Trump Nobel Peace P",
      "Trump’s message to Israel and Iran on the way to the Nato summit.",
      "<p>From a frustrated Australian prime minister to ‘the most unparliamentary of language’ in Irish politics</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/25/australia-news-live-richard-marles-nato-israel-iran-trump-anthony-albanese-lattouf-abc-labor-coalition-ntwnfb\"",
      "President had sparked alarm when he previously said US commitment to Article 5 ‘depends on your definition’",
      "Trump ordered U.S. strikes on Iranian nuclear sites as part of its support for Israel, then days later announced a ceasefire agreement between the countries.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOZERkbDZ6UklYbzJRcXNvWjBtV2VuREV1SVM1WVVfcG1qYzV0QzZxd1dkU3hndEtNbGlLUC0zVXVuM0lyNWl0VUpBc2htYk5WZkJBamkxZHIyRE82M3dxSVpvVjF1ZEN2a0h6WHVlSVFfUFdhNTJqc1AtOVJhZ3FBLXNtWHVMQ05uOFNuaTB3?oc=5\" target=\"_blank\">Scoop: Trump plans victory lap for ",
      "Estimates by president’s Council of Economic Advisers come as Republicans make final push to pass legislation",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1DOGhUSGJmUkRETjVPRFQyQVhQZVo5Z2dqaDlLUnJlUERHSm96YnlyOFcyUnd6M1VEQlhWbl9DSmhLQ25ZbjBTZG5JaTM1SmNRME42dWNVR3U3OGV5VU1JWXQ2YmpzemtmWmpGOXZmNVVJeHJ1XzE0?oc=5\" target=\"_blank\">Exclusive: Thune plans make-or-break weekend votes on \"big, beautif",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE05Q3B6djNaaWF6ZUNjOXZQQWtwQmRsUFVWcVZPS08wVEVsUk5UOVR3ZVo0NDVsQkhta0Z5ME9aSWlKQWlIQ0pvN3c3d2hWbTVaTTAwZWYxUWZnMzRSa3pPODNzLUVDMUxVZ0RXZ3dZcnFBVHN2ejRkbE5CVQ?oc=5\" target=\"_blank\">Exclusive: Thune urges \"light touch\" on AI regulations</a>&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPbWJRZmhyMVVONkVOSmVFdHZfRVR3SHY1WmxUcmN1c0hYeE5QUXBxSG10d3hNTnhyMktiVGNHRjJjeHJ1YWtIUHZaNmNyZFUyeW0zOFdocW5Wa0MtQzZwWkIzZUNxajhhYU53RTNmeEduc1k5OEozTkFPbXctdHZXcEVQbzhFbEZ2enc?oc=5\" target=\"_blank\">Exclusive: Thune vs. the polls on the \"b",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE0ydFo4RV9zN2R0Mkc3MjFESnBuTGFNRkdidGtITTRwcERaQ3E2TE1BSVNPelV4dDVsSTVoWEtYdU5jUWpLeU1vSHFhUzBGUFVkUzBPdF9HZkFpTlpjbVU2d0swanVOLXBBNnc4Um9oQmdCa1JuRDNQSG1qNENra28?oc=5\" target=\"_blank\">Scoop: Trump admin cuts contracts with scientific publis"
    ],
    "image_url": "",
    "titles": [
      "Israel was once deterred from striking Iran. Now Netanyahu takes a victory lap",
      "Intel Report on Iran Upends Victory Lap Trump Was Hoping for at NATO",
      "Trump gets a NATO victory lap, but U.S. leadership is on shaky ground",
      "Trump with NATO ‘all the way’ on Article 5 as leaders gather at summit",
      "Trump displays frustration with Putin as NATO leaders gather",
      "Israel-Iran ceasefire appears to hold as Trump heads to NATO summit",
      "How Qatar Helped Broker the Israel-Iran Cease-Fire",
      "Timeline: Did Iran or Israel Violate the Cease-Fire With Strikes?",
      "What to Know About the Cease-Fire Between Israel and Iran",
      "Iran’s Capital Tehran Endures Intense Attacks Before Cease-Fire With Israel",
      "What to know ahead of the Austrian Grand Prix",
      "Formula 1: How to watch the Austrian Grand Prix on TV and what to know",
      "House, Senate briefings postponed after Iran ceasefire - Axios",
      "White House Postpones Briefing Congress on Iran Strikes",
      "Wednesday Briefing",
      "Trump compares Iran strikes to Hiroshima and Nagasaki",
      "Trump’s strikes on Iran reinvigorate U.S.-Israel ties after being tested",
      "Dems join GOP to kill vote impeaching Trump over Iran strikes - Axios",
      "Trump is using “diplomacy as a ruse” to strike Iran",
      "Trump's attack on Iran pushed diplomacy with Kim Jong Un further out of reach",
      "Trump doubles down on damage U.S. strikes caused to Iran's nuclear sites",
      "Satellite Imagery Shows Damage to Three Iranian Nuclear Facilities From US Strikes - Bloomberg",
      "Israeli intelligence sees \"significant\" damage to Iran's nuclear facilities, officials say - Axios",
      "The Israeli atomic energy commission says the war set back Iran’s nuclear program by ‘many years.’",
      "Bombings set back Iran's nuclear program, but likely didn't kill it",
      "U.S. initial damage report: Iran nuclear program set back by months, not obliterated",
      "Iran's nuclear program set back 'a few months.' And, Trump to meet with NATO allies",
      "Trump says Iran’s nuclear capabilities ‘blown up to kingdom come’",
      "Rubio Fleshes Out Trump’s Case That Iran Nuclear Capacity Was Eliminated",
      "U.S. airstrikes set back Iran's nuclear program by just months, report says",
      "Nuclear facilities 'badly damaged,' Iran's foreign ministry says",
      "Trump and Hegseth admit doubts about level of damage to Iran nuclear sites",
      "Trump says US will speak to Iran next week and ‘may’ sign a nuclear deal",
      "Trump Says US and Iran to Talk Next Week, Mideast War Is ‘Over’",
      "Trump Says US to Meet Iran Next Week, Putin Talks Ahead - Bloomberg",
      "Trump says 'great progress' made on Gaza ceasefire talks",
      "Israeli attacks kill at least 51 as Trump signals progress in Gaza talks",
      "Seven Israeli soldiers killed in Hamas attack in southern Gaza Strip",
      "7 Israeli Soldiers Killed in Gaza, Military Says",
      "The Bombing of Iran May Teach an Unwelcome Lesson on Nuclear Weapons",
      "U.K. Says It’s Buying 12 Jets That Can Carry Nuclear Weapons",
      "Truth about UK nuclear veterans 'covered up', says Andy Burnham",
      "Live Updates: Trump Says U.S. Will Hold Talks With Iran Next Week",
      "Trump admin live updates: Trump touts new NATO defense commitment as 'big win'",
      "US didn’t destroy Iran’s nuclear programme: Here’s what new intel says",
      "Damaged or destroyed - how much does leaked US report on Iran's nuclear sites tell us?",
      "Schumer fumes over postponed Iran briefing from White House - Axios",
      "Scoop: Senate GOP mocks Iran war predictions by Tucker Carlson - Axios",
      "Israel-Iran Cease-Fire Takes Hold After Trump Rebuke",
      "Israel-Iran ceasefire holds as region urges new round of diplomacy",
      "Israel-Iran live updates: Trump again claims 'obliteration' of Iran nuclear sites",
      "Trump claims Iran nuclear sites ‘obliterated’ but UN watchdog says highly enriched uranium may have survived – Middle East live",
      "Iran-Israel ceasefire reignites MAGA push for a Trump Nobel Peace Prize - Axios",
      "Expletives and Diplomacy: Donald Trump Heads to Nato",
      "Donald Trump is not the first politician to swear in public. Here are six more infamous expletives",
      "Trump with Nato ‘all the way’ after questioning mutual defence pact",
      "Trump fumes over U.S. intelligence report on Iran strikes at NATO presser",
      "Scoop: Trump plans victory lap for Big Beautiful Bill - Axios",
      "White House insists Trump’s ‘big, beautiful’ bill will help slash US debt",
      "Exclusive: Thune plans make-or-break weekend votes on \"big, beautiful bill\" - Axios",
      "Exclusive: Thune urges \"light touch\" on AI regulations - Axios",
      "Exclusive: Thune vs. the polls on the \"big, beautiful bill\" - Axios",
      "Scoop: Trump admin cuts contracts with scientific publishing giant - Axios"
    ],
    "score_components": {
      "magnitude": 0.97,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.927,
    "summary": "Israeli Prime Minister Benjamin Netanyahu has long sought to attack Iran but was deterred by the U.S. and his own security chiefs. President Trump, who has criticized U.S. involvement in NATO and questioned mutual defense guarantees, celebrated U.S. strikes on Iran that reportedly set back Iran's nuclear program by only a few months. Amidst this, a ceasefire between Israel and Iran took effect, mediated by Qatar, after the U.S. and Israel struck Iranian nuclear sites. Despite initial doubts about the ceasefire's durability and the effectiveness of the strikes, the truce has held. Trump, speaki",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the current state of the ceasefire between Israel and Iran, giving context to the situation. It does not, however, offer much in terms of progress or solutions, except for the mention of the ceasefire itself. It does increase awareness about the geopolitical situation and the role of different actors."
  },
  {
    "title": "2025 NBA Draft Kicks Off, Major Trades Impact Nets, Hawks, and Celtics",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 11:10:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "NHL",
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Round 1 of the NBA draft is tonight (8 ET on ABC and ESPN), and we have the intel on trade talks and picks.",
      "The Brooklyn Nets traded for forward Terance Mann and the 22nd overall pick in the 2025 NBA Draft on Tuesday. Here's their latest mock draft.",
      "<p>Senators GM Steve Staios talks about the unique challenges of the 2025 NHL Draft and explains why he&#8217;s open to trading down from the 21st pick, but not trading up.</p>",
      "<p>After what has already been a bustling off-season in the PWHL, the 2025 Draft has finally arrived. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPMlpsNGstMy1aQ25jWmxOMFUtbnU3T0FPaGJpcE9RRkhIYVZuU01hdEViZy15T1c5dFFqczFDNTF5V2ZkSjBUMml3dXlFZE50cXJGaThybWVJZnJYZHhKdWI2bk1qeFRQRDRNOUFEZ0dKaFV5VUNsc3FIaGdfZE8ycXVnT2ROWm80Vnc?oc=5\" target=\"_blank\">Final Mock 2025 NHL Draft: Intrigue foll",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPYTRvbGVGT3BCdVBESlhzamU3RXVOeW5Ob3Zqci1RQ3hRQmI1eHlickdXWTFoclBOdG1tYm5oVk9QX0Z1WE5DeE1MVHBPNUE4eFk2aXRNRDFlN0trU201R2RQekVCV1BCRkF5T3JNaU1TY0NoaFJqZlZVNzk5Z2Q1dXdFVm9Bbk1nN3hmNXFITQ?oc=5\" target=\"_blank\">Penguins To Make 11 Selections in",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNSzVTZjUwck82ZEJzSGpBSkJxVnJIbmlVY3g5T2ZPXzZ0Sk5GcU1QNzg2YnpOUUExWHZ6Rk1NNGVsTGVxVXRXNjlnX0ZhOWtxV2VYSmFoOUxucWNQSVFQOVczTWVmZndJTFI2UDlncXEtUGtOMkpHMVJXU2duWXZGRG9jdnlodw?oc=5\" target=\"_blank\">Penguins Announce 2025-26 Preseason Schedule<",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNN05lQ29xTEp3YjNoSEp4SG9KMHBtSlZDbXBXelJxMEFPaDRES3BCTGFpeE5RVFZxZ3ZiU0hkQl8xbDhBQnZ6OTM1YmhKTTJ0QnBXdWZpRlM1X25qakJKX2tYU2RyUkQ3YmJ3NHdlRXd0UU9KVE9ZV3pSTEpFbGJnNzZzT2Uydw?oc=5\" target=\"_blank\">Red Wings announce 2025-26 preseason schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9WazNLWnNHYUpzTFNlZWFOa2VrdkFlYjVCVWlERHpGLVA5bDlBSFlKVElIb0d6UUNBWnVoc0tOZkN5cmpmQ0ZhNlMwdnN5U2FHYmNfdGVjNldXTXFySnlxSVdQYUlQYzh2cjJBX21GeUREdGpVdGh4U3pCYkZSbk0?oc=5\" target=\"_blank\">Jets announce 2025 Development Camp schedule | Winnipeg ",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPZkJpNW4wT3I3VW1rcnR0TVFaV0wxOU9WWW1IY0dEZEVqcERNWXdYLTB6MnZrVlFTaEVSaXJpZzNkMEcyT0sydTRuRzRPTEJveUFudExZY1pTb0o4SVA4cEFjZXFBQ2ZKX09pSHhNSVBvZmJ5Z1pEbmVCWWV6SG5sMElTWEJnOUdaYnc?oc=5\" target=\"_blank\">Blue Jackets announce 2025 preseason sch",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQRHE2RGtjdXdZcTR5VElBLUFvTlRpT1N0a0VfOENybmFuanBldWwxYnpteEpTUU96Z3BEdnZYZS1Td3ltX3VPWlhuUl8zNk54Rk9xcWNxSHpsZE1UcVRuTVB1bkFqZG9Pc0hiQTZyN05KeVRVWXRVTjR4WENaeFRZcVZJanB4NVB5T3dCU0JoNA?oc=5\" target=\"_blank\">Florida Panthers Announce 2025-26",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFBJQ1BiNGFyM2hFaE9PejJLODMyWXMyZlFFaWtEMmZad1pLTFdTRVFpWjR6bFdzZlNKQUFTdHdtUDdsTnFVV0hvMWtWcEMzRExELWdGSEl2WUZKZUdxZVktU09TQkZDaEdId3UtNTh1Uml5czZNVU5iOG9XaU42dw?oc=5\" target=\"_blank\">Sabres announce 2025 preseason schedule</a>&nbsp;&nbsp;<f",
      "The 2025 NBA Draft kicks off Wednesday night in Brooklyn",
      "The first round of the 2025 NBA draft is set to begin on Wednesday, with 30 players expected to hear their names called at the Barclays Center.",
      "The Duke University forward is projected to be the No. 1 draft pick.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPX0ZIMlJXZl9KRkYyODh3VnhTcU1xc1Q0MHZOdldab1p1T1N3NDV2bE5PS1JRSF9jZ2VLT2J0OERZTWdra2dfSUMzY2ZPanhaWWRtakZCNDctMGJtUEtKM3F5dUNncF9FRnBpSFhWQUZTWndoeEdrdFF3UnFBdmExREw1eE55UQ?oc=5\" target=\"_blank\">Why LeBron James Believes Cooper Flagg Will B",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1YUUNIX2poRnpUbmVBRHFmbUZDLUdibDJEZ3RvR1ZucTZzQTZFd1R3V0FxR1pHQWd5VTZxWFZRczJaeE85dHdDOURWWWF2bll5a1Vic1BJYzVFZ2tQbmZIOXVQWjhVZUNPbDJjSk9ReWtvdmhMRlIwY195M1IxSFU?oc=5\" target=\"_blank\">NBA Analyst Says Thunder Could Be Looking to Trade Up in",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE14aTBaWWVmNlh6Mm5KUlVqSnV1V1haRVh2TG96X3hvbGo1WG5TYlVTMEdGaVBVLXM0NlU0cnM1U19HbW1XWEstV0pwb0hORml3WUFqVlROcW13eVdfT05Nd1lndFdTTXBiV2pSRG9fb08wRFBHbGxsUGJn?oc=5\" target=\"_blank\">Keegan Bradley's Travelers Championship Win Draws Stunning TV R",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPMnF0bmZ2SkFNeFhnRTdwcVM2allzaW9YWklWNEhyejY4SmFyTXlOSFRuaFgwOWw0NVEyTmpfZG5HOEZDU21kRUJWcEUzTUZhWWw3bVk3WUdfWG9kTWhvUEgxZEw4RDFFQWo3VEd5Y1NqbHJ1NHc0ZVNYODN4UkNpMVBIZ0NPNHVKcFNPZGxmejg?oc=5\" target=\"_blank\">George Kittle Has Strange List o",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNeEF6aUx1Snczc3lZUDlpaXpZcUtZdkxmNGlBVDIxaDFVTTVpczRkZ1Q5NEZmd2pzNzBzN2dTYVFKdVYwR3lRR2E3TzgwWk00eHYtWm45MHhTZno2eE1rb204Y2lZcFNWZXdpUDllbHA1VU9OSnhmLU01TmVRU0J3VmpTUUw?oc=5\" target=\"_blank\">Man Utd in ‘Advanced Talks’ With Fan Favourite f",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPUXpVdnN0cjlEZDRWRzZ1eGdyVjZRdE04UFkwcE1EM1hRMG5EcUV2dmZpMVVhSm9naEYyeWhWQlFlMUNENlZ0TGVVeThUT3R5NE1RbWdyRXVoMDNTSHQ5VzBQeFRONFNvOUwxemVFQ3hRQlVxMGtuTjRaZ3VBLVN5T29Fd3lMdw?oc=5\" target=\"_blank\">Back at UCF, Scott Frost Bridging Past Succes",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRlptTDNlODBNZ3FuaERfZEVWQ1lTb0tlWDVhUTBBZVA4M3BHcFBHaWpTSldkMXNUQWo5dHVlN0NmRGtnTEhvTGhIak1acEwtSUxELTZ0SVEyUVl1NkpJajRFc2NUX3UwMEg4NFEyQ1ktaklEOXVMbkhfdzJxZFJmbEtYdmRDRG1GNlhZ?oc=5\" target=\"_blank\">Brentford ‘Set New Bryan Mbeumo Asking ",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQVHBhVTV2ckxKZzgtNXdDTk5mTHhqeWxFUkNnQTd2VnNqUkh5T0sxN0NTWkVGc3l5eXJLZEJKNjhraWNtZzEwSHF6cUhoUnFvQWp0RmxmZnpMTVdjYU9xSmVDRDh0MDNvT29aVTJqNThaeE1pS2JlcXM5SUhVNS1SODVxeUVLdHc?oc=5\" target=\"_blank\">DeWanna Bonner Expected to Part Ways With Fe",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPbGNzUzFGeE1IR1R5SGNrXzBIdHd6ZnJOeVcxSUF4b1VrZW1UUmhfcHo4R2pINFM2ZGd3U3Zla25kSlFxTHZjWlN0UC10dnNndG9VZHhTRk91TmFfUnZVRU1qbVFJMFR1UVNYVXducy01WnliaDM2dGczUDFPTXhHS3oxWXBkQUNHSjVjWURLSU1ITnBCRTlnUWpn?oc=5\" target=\"_blank\">NBA Insider Identif",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQVnhlX3d1aUxvMHJIRkxhdTBZVDJXbW9NQTFIOEFqSlNiOVVwb01tTll6V2V6T24zT09weDV4Zk5sMzkxdTFUNm9FNUxtYzl2QTB2RnMxZ0U1UDNud05hNnZHYjBDcmhZMnhKTndZTm5BRjZRZ0Nvb3Z1S0dlUXIxYXYwOWU3U0VUaHY0bXNseGt4WUhPWnkw?oc=5\" target=\"_blank\">Pacers Coach Rick Carli",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPdXJEdXdqSHdwWGF4aEthRFM1U0c1R1JBLVZ4cVJkcEwyMk1pTGw2N1RwVWpvNnZoWldESi05cS1TV1JmMFNyaWp0cFNHU0txUXlIRWloSEpNeENUY3ppbXRHQ3V5RGFwYkkxU05CdkVmTjhJZFFJY1M5eGZhTUJ3T3JCazBqUEUyLWRZaQ?oc=5\" target=\"_blank\">New Browns Wide Receiver Makes His Pr",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE85UkRsbjNUM2Q5Y2I2WVJDLVhLWm5ld1o1aTFRUVdtc2N5ak1UenBoc3pWREtsRHo0SWdOZzZuZE5HR3o4bnFhWnF6UnhwWEZ2U1dvN25TLW80ZGZUWWI1d21nbmRXMzRWUzhN?oc=5\" target=\"_blank\">Indiana Fever Make Decision on DeWanna Bonner's Future With Team</a>&nbsp;&nbsp;<fo",
      "<p>The Indiana Fever are moving on from DeWanna Bonner.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOV96NUpjaE1jVWpBeDYzU1RXS0Uyd2JwMTdGNUNuZ2llX0hmelpNSXN2Rkg4eE5BQ1JKVm5lRGZKa1VTTUMzcXRjNTZYSW82MzFwcWROVUQzRHZYcXBaRV91bXBxOGlwVWRPc3ZCSFRvN1h3MDhTLUJuRW9rdGlKdmJ5UUZtR2Vm?oc=5\" target=\"_blank\">Report: Premier League Club Agrees to Deal ",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQTUZxQnhPTHhMTjJoQ1FfdjRSNmpacXhvUEYxOGtRQUxMQU9pZVprRmJnOElaT1JUaVFsZHpOaEVNb25JRWdxUVdXZHY0QU13Zk1Ra0o0MFhQY0pOUmpEUm9CY29STnFBbWVSeXNWbTI4YTFQN1M5VWF6Q1REWkMtbzNvY3BYb1o1RVczcC15Si05QkR3eEFJ?oc=5\" target=\"_blank\">Barcelona 2025–26 Pre-S",
      "The Indiana Fever waived DeWanna Bonner on Wednesday, giving the 16-year veteran her unconditional release.  Bonner had been away from the team since June 12, missing five games for personal reasons.  “I want to sincerely thank the Indiana Fever for the opportunity to be part of the Fever franchise,",
      "Bonner has not appeared in a game for the Fever since June 10",
      "Bonner, a big offseason addition for the Fever, had not played since June 10 for personal reasons",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTFBOUDc3b1JYZWdSUnZZdFI2UWt4Z2NOLUs3ekw3NTBJQ2tnWTdJR19YX0lNLWJnZ3ZGdDNQS0k5cVBnYzlaLW5CaUx6cVZoUHlVZHF0QmJsTzV2bFg0SXJDQW1qODNlTDhaOXc?oc=5\" target=\"_blank\">DeWanna Bonner Shares Special Message During Fever’s Win Over Storm</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBhb1hkdjBMZlNQQTllUGtGRXRVQjB2VFFpXzdoVjNDMXpiUWt5VkUwV2xjeTRSQ0ozSFp4Q05VQzBDNnJkc2xMb1ZrVkcybEo3WWlFcXlJMVpnTDJ2STZWT0R5cEFnTXRnSHgwMG9SS2c1MDFMdUJCZDdsTQ?oc=5\" target=\"_blank\">NFL Players Who Could Have Played in the NBA</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1BbXp3RGlxTmw1QTlJaWZwSmg5VUdTMXM1UlRSRjZ1SkFXSmF0ZzJSQ0Z2SG42WlJrU1VjRzhiWTdjOUhqaG9zTWpfdXd1ZERqUV9qZlh1ajRjOER6MEVoSlR0Z1NBeWFSOV9hSlhQVG8tUi1SeUJQRkdoQQ?oc=5\" target=\"_blank\">‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chi",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNdGFxaWRzYUxxWm5FTm9MNGVFbjBuVE1RLUVMUkQwTlpJdFJNYzBRU0F0bTFtVEU1QnZUOE5wZE5LNUhwLTJ4TGcwd3I5Q0xuWFI3cVdiT2hUcnlNR0hNYzZuZ3BKZlFXSll1Q0lsTlk4UjV6OGh5R0xWZm04cVZITFZiOHJ2VXYyR01qWVVuTHVqQQ?oc=5\" target=\"_blank\">Documents Reveal NFL Encourag",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNMzFBNjZRMEFtZVVTTXJtS2ZlQUxrVXJBclFmVkNzcUxrMmY2S3dUT2Nkc0pzdXhEQ1F6eHVEYktudGk0WjRnUmt4QkRuSTNHMzFRcEFkYmUxTHNsSk96dDdDYklsZ1JwcEdiWHNzLTd2cWthSVVfblNVcjZ4bi1XM0x5RE1McHViOVU4Mw?oc=5\" target=\"_blank\">Braves' Austin Riley Named 'High-Pric",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQdDgyX0V1eDJmZGRwNkR1QTdEUkNNSDEtd0w4OWlJXzAxMHRiVzFiX3BabmRETF9qS184ejRneV8tZWU2Ykk0aHVmd01ndnhNRkdhcGJEMTFuaEVTQkhVN2hHSWItckVoc3Q4Qi1LVzczLUMza0ZKdng4T1JGcjE0NjVOR2dxRmxuX05JQXlBOHZwTGgwU2lF?oc=5\" target=\"_blank\">New York Yankees Could ",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQUE4yUnFQTHVuOFlqNC1PNXlWOWowcVRJNkNYOVdBRVRTMFdaOXhhdU45V2lTS2RLa2xUc1hSR1ZuNjRRaWlRWWhLSnFIbnNIMTV1Z3l2TksyZUhva0RPLXhHcUV0elVkd0YxMi10VHVxRFZsbGVnd293ZHNFcXJ4d1V0WG5McE0xcWJ2OVpUR2JUM3c2bmw4?oc=5\" target=\"_blank\">Pelicans, Wizards Swap ",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxNM3ZkczJxZDZsNHRPZ3dxVXlPdE1rZ3Y3eUpRUEdZZEMtTXZxX1NZLVg4U1ZZV2VBWGpEelhLWTlLdExMZkFGTU55ekpfaDVMS2lXbENQNjlRSWFCRV9teklKeG5RR0g3aDJsTW4tMnFaWE00WDhMSXNKQmVnZXZ0UWZubnRYdjJwbXRIOVJvQmo?oc=5\" target=\"_blank\">Taylor Swift Attends Tight End U",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPZEg5cEk5WXNHQXRSWldfMmdWNWRPSTg3eU9Gb282empSNW1WMFJ3NlhBeEM3aXJPTXlZd1kxQS1TZHVmNkN3eGFSRWR2VlZ1YjZoWUZWZklGT3VjOHlIcVd5a1hiLVhwV1htNGRXZXlET0QwSk5pN0VNbm5IT3BITW1ldlE4c2NXajVkWm5laDQ4U3dq?oc=5\" target=\"_blank\">NBA Officially Approves $1.",
      "The $1.5 billion sale of the Minnesota Timberwolves from Glen Taylor to an investment group led by e-commerce entrepreneur Marc Lore and former baseball star Alex Rodriguez gained NBA approval Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOenl2RF9rZndLczJyMVR2TF8ySWI5YkhPeUFEcjg1cjJvMTFxd3MzNWNicm1mVkxYTk01eVotaWp0ejMwU0FMX3BraUV3SVNoUGFKSXZzMzdacXF1QWwyODM0OXhZUXBmSERQbW9wTWYxVGYwWXMwaEk3QmVUeW9UUVZkM0RnbTlzdzVURXVUN200QQ?oc=5\" target=\"_blank\">Daizen Maeda's Demand Hands C",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPaEpnMG9sbVRpSllPZHJfSnpvNUtTNHlUYnhlekpMcS1nRUdDOG43ZHZRN2JDOW9jOHh3UHZXdHUtT3I4dUxMdVpzT3JROU5NSkFCRm9vazh4dmVhS3AzTGg5X0d4MlNiZWswajVKdXV4LWNsc2YzNEIzN2Z5SmZGT1N3dDN5b3g0?oc=5\" target=\"_blank\">Lessons Learned From the NBA Finals for Thu",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQMEVVQmRtVHVwbEpYX0RvamFTZ1J3REFsejlYQjdXM0FacGdRMlVneUdNYzdzYXQ5UHB0U3QzalozeFYzVS0xZjBUS2tVQkw0WWwxaXJSM0NwVmdWTlNER3N2c3pVUEp5QnNxRmdsTU00SXduMnViZ0V4bFRiUGhrdGdRMA?oc=5\" target=\"_blank\">D. Wayne Lukas Didn’t Just Train Horses—He Change",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQd2FXeV9oY0dneF9Od1R6ZllkcVZYb1FRaC1JYTF6MlJIZk1zWFZod3NIQ1NYUTlUS0pjY0pxOG4ta2g4U0pQMVdteUVrZU5qWjFORzJNeEhZbFJXUW1QQmEtbEU0MDg4ZzgydEZaZ0JSa3gyV3BsZXNKUDVjbU1XdGdYaFJiQm8?oc=5\" target=\"_blank\">Celtics Trade Kristaps Porzingis to Hawks in",
      "<p>The Boston Celtics continued the teardown of their roster on Tuesday.</p>",
      "<p>Irving is set to decline his $43 million player option and intends to sign a three-year, $119 million contract with the Mavericks, ESPN&#8217;s Shams Charania reported Tuesday night. The deal includes a player option for the 2027-28 season.</p>",
      "Mavericks All-Star guard Kyrie Irving is declining his $43 million player option and intends to sign a three-year, $119 million contract with the franchise, sources told ESPN.",
      "Durham full-back Grace Ayre has signed a new long-term contract with the club.The Wildcats announced the news via a post on their official club website this afternoon.The 23-year-old is a product of t...",
      "Chelsea are edging closer to a deal with Borussia Dortmund for winger Jamie Gittens after representatives from the two teams held discussions in the United States during the Club World Cup, sources have told ESPN.",
      "Atlético Madrid have reached a verbal agreement with Betis to sign USMNT midfielder Johnny Cardoso, sources have told ESPN.",
      "Deals are already getting done ahead of the NBA draft. Catch up on the latest trade grades.",
      "Boston, Atlanta and Brooklyn are finalizing a trade that will send Kristaps Porzingis to the Hawks, Terance Mann to the Nets and Georges Niang to the Celtics, sources told ESPN's Shams Charania.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNYW5DWFQwakNYX2JxbW8xa2M1UTNya0RDZVIyeEw2UHhGZ1N2eTY3d21Td1p6Z0JtSHpfSDM1aXA5NGNtdHYtak1WOTRTT1lOVmo5aEtoZHEwd25pcUZVYzBkcUFJUzFDNkJPa0FVV3A2Rm1peHJrME5IWDRLa0dMM29PdWpUdmZaZWFvNlNoU2dTeE8zX19lRw?oc=5\" target=\"_blank\">Celtics Salary Cap Si",
      "The first round of the 2025 NBA Draft is set for Wednesday at the Barclays Center in Brooklyn",
      "The NBA trade market has heated up this week"
    ],
    "image_url": "",
    "titles": [
      "Two-round NBA mock draft: We made 22 pick updates based on intel, trades",
      "Nets 2025 NBA mock draft after trading for Terance Mann, No. 22 pick",
      "Senators’ Staios open to trading down from No. 21 pick in draft",
      "2025 PWHL Draft tracker: All the picks",
      "Final Mock 2025 NHL Draft: Intrigue following 1st 4 picks - NHL.com",
      "Penguins To Make 11 Selections in the 2025 NHL Draft - NHL.com",
      "Penguins Announce 2025-26 Preseason Schedule - NHL.com",
      "Red Wings announce 2025-26 preseason schedule - NHL.com",
      "Jets announce 2025 Development Camp schedule | Winnipeg Jets - NHL.com",
      "Blue Jackets announce 2025 preseason schedule - NHL.com",
      "Florida Panthers Announce 2025-26 Preseason Schedule - NHL.com",
      "Sabres announce 2025 preseason schedule - NHL.com",
      "2025 NBA Draft order: Complete list of picks from 1-59 with Mavericks set to take Cooper Flagg at No. 1",
      "NBA draft 2025: How to watch first round, time, complete draft order on June 25",
      "Cooper Flagg talks NBA draft, potential Dallas Mavericks pick",
      "Why LeBron James Believes Cooper Flagg Will Be 'Amazing' With Mavericks - Sports Illustrated",
      "NBA Analyst Says Thunder Could Be Looking to Trade Up in Draft - Sports Illustrated",
      "Keegan Bradley's Travelers Championship Win Draws Stunning TV Rating - Sports Illustrated",
      "George Kittle Has Strange List of Things He'd Sacrifice to Win a 49ers Super Bowl - Sports Illustrated",
      "Man Utd in ‘Advanced Talks’ With Fan Favourite for Surprise Return - Sports Illustrated",
      "Back at UCF, Scott Frost Bridging Past Success With Hopeful Future - Sports Illustrated",
      "Brentford ‘Set New Bryan Mbeumo Asking Price’ After Fresh Man Utd Bid - Sports Illustrated",
      "DeWanna Bonner Expected to Part Ways With Fever After Just Nine Games - Sports Illustrated",
      "NBA Insider Identifies Pair of Teams Interested in Celtics' Kristaps Porzingis - Sports Illustrated",
      "Pacers Coach Rick Carlisle Names Team's 'No. 1 Priority' for Offseason After NBA Finals Loss - Sports Illustrated",
      "New Browns Wide Receiver Makes His Prediction for Team's Starting Quarterback - Sports Illustrated",
      "Indiana Fever Make Decision on DeWanna Bonner's Future With Team - Sports Illustrated",
      "Indiana Fever waive six-time all-star DeWanna Bonner",
      "Report: Premier League Club Agrees to Deal for USMNT, Juventus’s Tim Weah - Sports Illustrated",
      "Barcelona 2025–26 Pre-Season Fixtures: Dates, Opponents, How to Watch - Sports Illustrated",
      "Indiana Fever waive DeWanna Bonner, re-sign Aari McDonald",
      "Indiana Fever waive DeWanna Bonner after trade talks fall through between WNBA All-Star and team",
      "DeWanna Bonner waived by Fever: What to know as veteran All-Star looks for new team after stint with Indiana",
      "DeWanna Bonner Shares Special Message During Fever’s Win Over Storm - Sports Illustrated",
      "NFL Players Who Could Have Played in the NBA - Sports Illustrated",
      "‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chief - Sports Illustrated",
      "Documents Reveal NFL Encouraged Owners to Reduce Contract Guarantees - Sports Illustrated",
      "Braves' Austin Riley Named 'High-Priced' Candidate for Wild Trade Scenario - Sports Illustrated",
      "New York Yankees Could Make Crazy Anthony Volpe Decision - Sports Illustrated",
      "Pelicans, Wizards Swap Guards CJ McCollum, Jordan Poole in Pre-Draft Trade - Sports Illustrated",
      "Taylor Swift Attends Tight End University Alongside Travis Kelce - Sports Illustrated",
      "NBA Officially Approves $1.5 Billion Sale of Minnesota Timberwolves, Lynx - Sports Illustrated",
      "NBA owners approve $1.5B sale of Wolves, Lynx",
      "Daizen Maeda's Demand Hands Celtic Boss Dilemma - Sports Illustrated",
      "Lessons Learned From the NBA Finals for Thunder and Pacers - Sports Illustrated",
      "D. Wayne Lukas Didn’t Just Train Horses—He Changed the Game - Sports Illustrated",
      "Celtics Trade Kristaps Porzingis to Hawks in Three-Team Deal - Sports Illustrated",
      "AP Source: Celtics finalizing deal to send Porzingis to Hawks in three-team trade",
      "AP Source: Irving to decline player option, sign three-year deal with Mavericks",
      "Sources: Kyrie to sign new 3-year deal with Mavs",
      "Durham full-back Ayre signs new deal",
      "Sources: Chelsea near deal for Dortmund's Gittens",
      "Sources: Atlético reach deal for USMNT's Cardoso",
      "Grading the Celtics' flurry of trades, plus every deal so far",
      "Celtics to trade Porzingis to Hawks, sources say",
      "Celtics Salary Cap Situation After Trading Kristaps Porzingis to Hawks - Sports Illustrated",
      "2025 NBA Draft where to watch: Round 1 time, TV channel, stream, draft order, Cooper Flagg set to go No. 1",
      "2025 NBA Draft trade tracker: Latest deals, news as Celtics, Nets, others swap picks and star players"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.881,
    "summary": "The first round of the 2025 NBA Draft is scheduled to begin Wednesday night at the Barclays Center in Brooklyn, where Duke University's forward is projected to be the number one pick. In recent trade news, the Brooklyn Nets acquired forward Terance Mann and the 22nd overall pick in the 2025 NBA Draft from a trade on Tuesday. Additionally, a significant trade is being finalized that will send Kristaps Porzingis to the Atlanta Hawks, Terance Mann to the Nets, and Georges Niang to the Boston Celtics. In related sports updates, the Indiana Fever of the WNBA have waived 16-year veteran DeWanna Bonn",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information for NBA fans about the upcoming draft and recent trades, which can influence decision-making for fans and stakeholders. It also increases clarity around the system of player trades in the NBA. However, it doesn't highlight any major innovations or solutions to problems within the sport."
  },
  {
    "title": "NATO Members Agree to Boost Defense Spending to 5% GDP by 2035",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:25:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CBC",
      "CityNews",
      "The Guardian",
      "Global News",
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "In a political win for US President Donald Trump, NATO member states have endorsed a big new defence spending target.",
      "Prime Minister Mark Carney said increasing defence spending to meet NATO targets could come with benefits for Canadians, but also potential 'trade-offs.'",
      "THE HAGUE — Canada and its NATO allies have agreed to substantially hike their defence spending target to five per cent of annual GDP by 2035, Prime Minister Mark Carney said Wednesday. Carney warned the country can no longer rely on its geography for protection as new weapons and threats emerge, an",
      "<img alt=\"Prime Minister Mark Carney shown sitting at a long table with other NATO leaders. \" height=\"349\" src=\"https://i.cbc.ca/1.7570193.1750850724!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/carney-europe-20250625.JPG\" title=\"Prime Minister Mark Carney, middle, takes part in a meeting",
      "US President Donald Trump hailed the agreed spending hike as a \"monumental\" victory. NATO member states also expressed \"enduring\" support for Ukraine. DW has the latest.",
      "THE HAGUE, Netherlands (AP) — NATO leaders agreed on a massive hike in defense spending Wednesday after pressure from U.S. President Donald Trump, and expressed their “ironclad commitment” to come to each other’s aid if attacked. The 32 leaders endorsed a final summit statement saying: “Allies commi",
      "<p>New defence spending target will be realised by 2035, Nato countries say</p><p>Asked about his commitment to Nato’s Article 5, Trump says:</p><p><em>We are with them all the way.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/jun/25/nato-donald-trump-mark-rutte-europe-latest-live-n",
      "Thirty-two allies ‘reaffirm our ironclad commitment to collective defence’ at summit in The Hague",
      "At the NATO summit US President Trump claimed Iran’s nuclear sites were “obliterated,” contradicting a leaked"
    ],
    "image_url": "",
    "titles": [
      "Why is NATO boosting defence spending and can Europe afford it?",
      "Carney says world is at ‘turning points’ as he touts defence spending boost",
      "Carney says Canada will spend 5% of its GDP on defence by 2035",
      "Canada promises to spend 5% of GDP on defence by 2035 in pact with NATO leaders",
      "NATO summit: Allies agree to spend 5% of GDP on defense",
      "NATO leaders agree to hike military spending and restate ‘ironclad commitment’ to collective defense",
      "Nato leaders confirm defence spending will rise to 5% of GDP and say support for members is ‘ironclad’ – Europe live",
      "Nato members agree 5% defence spending target",
      "Iran attacks overshadow NATO summit on new defence spending deal"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.943,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.866,
    "summary": "NATO member states, including Canada, have agreed to increase their defense spending to five percent of annual GDP by 2035, a move praised by US President Donald Trump as a \"monumental\" victory. This decision was made after Trump applied pressure for higher spending, aiming to enhance collective defense capabilities amidst emerging global threats. Prime Minister Mark Carney highlighted the potential benefits and trade-offs for Canadians, emphasizing the need for increased spending due to evolving security challenges. The agreement also reaffirmed NATO's strong support for Ukraine and the allie",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress in terms of NATO members agreeing to increase defense spending. It provides useful insights into the decision-making process and the factors influencing it, such as pressure from the US President and emerging global threats. It also increases awareness about the implications of this decision for NATO members and their support for Ukraine."
  },
  {
    "title": "Club World Cup in USA Criticized for Heat; Chelsea Advances to Last 16",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T14:59:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ESPN",
      "NHL",
      "Sky Sports",
      "CBS Sports",
      "Deutsche Welle",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Slow-paced matches, sweltering players and complaints about the heat have been the themes of the Club World Cup in the USA. Organizers FIFA say they take reasonable precautions but many see a major safety concern.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQdzBrbzMtelVZUE93SUFvQkxtcXhQWUcwWDN1dGhRV2dvYjFvdXJBZ05EYTIwWnA1QzR5M09jSHBZZnpRS2tvMEhJbWZLS0RvcWc2Y3QySnBIUklvZXZZY25PRUFDZEF0Zi1ZOGRxSG9wVjVXenRRVEtKNXhySFJwNHBPeU05Zw?oc=5\" target=\"_blank\">Panthers bring Stanley Cup to FIFA Club World",
      "SportsLine's Martin Green reveals his 2025 FIFA Club World Cup picks for Dortmund vs. Ulsan on Wednesday",
      "SportsLine's Brandt Sutton reveals his soccer picks for the 2025 FIFA Club World Cup group stage match between Inter Milan vs. River Plate",
      "Here's what you need to know from Tuesday's action.",
      "Liam Delap scored his first Chelsea goal as the Premier League side reached the last 16 of the Club World Cup with a 3-0 win over Esperance Tunis.",
      "<p>Watch as the Toronto Blue Jays waste no time getting on the board against the Cleveland Guardians, as Ernie Clement&#8217;s base knock gets lost in the corner of the outfield, allowing Bo Bichette to score all the way from first base.</p>"
    ],
    "image_url": "",
    "titles": [
      "Club World Cup: Extreme heat poses questions for FIFA",
      "Panthers bring Stanley Cup to FIFA Club World Cup match - NHL.com",
      "Dortmund vs. Ulsan prediction, odds, time: Free 2025 FIFA Club World Cup expert picks for June 25",
      "Inter Milan vs. River Plate prediction, odds, start time: Free 2025 FIFA Club World Cup picks for June 25",
      "Club World Cup Daily: Liam Delap scores first Chelsea goal, Blues qualify to last 16",
      "Delap scores first Chelsea goal as Blues progress to last 16",
      "Blue Jays’ Bichette scores from first after ball gets lost in corner"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.974,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.835,
    "summary": "The Club World Cup in the USA has faced criticism for slow-paced matches and player discomfort due to the heat, raising concerns about safety. Despite FIFA's assurance of taking reasonable precautions, the issue persists. Meanwhile, in the tournament, Chelsea advanced to the last 16 with a 3-0 victory over Esperance Tunis, highlighted by Liam Delap's first goal for the team.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Club World Cup and Chelsea's progress. However, it primarily focuses on the criticism of the event due to the heat, which does raise awareness about player safety issues. It does not, however, offer any solutions to this problem or report on any attempts to solve it."
  },
  {
    "title": "Zohran Mamdani Wins NYC Democratic Mayoral Primary Over Cuomo",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 08:26:54 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "MarketWatch",
      "Axios",
      "The Guardian",
      "Deutsche Welle",
      "CBC News",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "He is set to be the Democratic candidate for New York City Mayor in a race that could have implications for the party nationally.",
      "<p>Now the New York mayoral candidate he needs to ensure an electoral win that translates into tangible improvements in people’s lives<br /></p><p>Zohran Mamdani’s triumph in New York City’s Democratic primary represents more than just an electoral upset. It’s a confirmation that progressive politic",
      "<p>‘Tonight is his night,’ says ex-governor as progressive state representative tells supporters ‘we made history’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/jun/25/new-york-donald-trump-zohran-mamdani-andrew-cuomo-latest-us-politics-news\">‘We made history’: Mamdani celebra",
      "Worries about higher taxes for companies and ultrawealthy people and more regulations is hurting the stocks of some New York-focused real-estate investment trusts.",
      "This article discusses who Mamdani is, what about NYC taxes Mamdani proposes to alter, and three key issues with his plans to increase taxes on NYC taxpayers.",
      "Mamdani had received 43.5% of votes counted by the time former Gov. Andrew Cuomo, the second-place candidate in the Democratic primary, conceded the race Tuesday.",
      "<img alt=\"Two men are shown in a composite photo.\" height=\"349\" src=\"https://i.cbc.ca/1.7569390.1750785016!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/us-election-2025-nyc-mayor.jpg\" title=\"FILE- This combination photo shows on left, Democratic mayoral candidate Andrew Cuomo speaking dur",
      "<img alt=\"A man with a beard wearing a suit stands behind a podium with right hand over his heart.\" height=\"349\" src=\"https://i.cbc.ca/1.7570154.1750827787!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/election-2025-nyc-mayor.jpg\" title=\"Democratic mayoral candidate Zohran Mamdani takes th",
      "<p>The democratic socialist is now the favorite to win the city’s mayoral election. Plus, meet the 17-year-old who ran the length of Britain</p><p>Good morning.</p><p>Zohran Mamdani, the 33-year-old democratic socialist, <a href=\"https://www.theguardian.com/us-news/2025/jun/24/new-york-mayoral-prima",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOdWtpeW8zbURBRjZtWl96UTFtY1N3VHhXSUpOT1ZjMnhXQXFXNVl4UVJOXzF5ME9vV18zNkZoazhHSHo5NGtraVZjaFBkcEZPS3Blb3g4ampuTG9mNDIydXRIdGRyakFWT1hiSkl2OTVhWGNvWUNvQ3lJM3JIUDVtZXJ1cEdaSnJHaEc0RXpza1hZR05RRVpqLQ?oc=5\" target=\"_blank\">Andrew Cuomo concedes",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE00dkhRS1pha3lRb1F4V3FaenpsbDlRN25DZ3JfQ3hCaUE5eTNNZzNtYUZLRWVCN1lEUW04ZUtzc3Z6ZGVDNU9YT3dUaGJpX04xOTJMVEFkR1JrcFNYVHdrUUZWUl95VndzT0w4?oc=5\" target=\"_blank\">Zohran Mamdani has NYC's business community \"terrified\"</a>&nbsp;&nbsp;<font color=",
      "Zohran Mamdani, the 33-year-old democratic socialist, has claimed victory over Andrew Cuomo in the New York City Democratic mayoral primary.",
      "Mamdani is on course to win the Democratic primary after Tuesday&#039;s election, beating predictions."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/74aa/live/0e02ee30-5197-11f0-a2ff-17a82c2e8bc4.jpg",
    "titles": [
      "Who is Zohran Mamdani, the Democrat aiming to be New York's next mayor?",
      "Zohran Mamdani offered New Yorkers a political revolution – and won | Bhaskar Sunkara",
      "Zohran Mamdani declares historic victory in New York City mayoral primary after Cuomo concedes",
      "Mamdani’s victory casts a chill on New York City real-estate stocks",
      "3 Key Issues Surrounding Zohran Mamdani’s Proposed New York City Tax Increase",
      "Billionaires Ackman And Musk Rebuke Zohran Mamdani’s Win In NYC Mayoral Primary",
      "For New York City mayoral candidates, the future could hinge on ranked ballots",
      "Upstart Mamdani declares victory with stunning upset in NYC Democratic mayoral primary",
      "First Thing: Mamdani wins NYC mayoral primary after Cuomo concedes",
      "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary - Axios",
      "Zohran Mamdani has NYC's business community \"terrified\" - Axios",
      "Mamdani declares victory in NYC Democratic primary for mayor",
      "Who is Zohran Mamdani, New York’s likely next mayor?"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.85,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary": "Zohran Mamdani, a 33-year-old democratic socialist, has won the New York City Democratic mayoral primary, defeating former Governor Andrew Cuomo. Mamdani's victory is seen as a significant moment for progressive politics in the city. He has received 43.5% of the votes counted, leading to Cuomo's concession. Concerns are rising among the business community about potential increases in taxes for companies and the ultrawealthy, as well as more regulations. Mamdani's win marks a historic moment, as he aims to translate his electoral victory into tangible improvements for New Yorkers.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the shift in New York's political landscape, the potential implications for taxes and regulations, and the impact on the business community. However, it doesn't fully explore the potential solutions or improvements that Mamdani's victory could bring to New York City."
  },
  {
    "title": "Arsenal Signs Nørgaard from Brentford, Eyes Chelsea Keeper for £5m",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:15:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports",
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Norgaard represents an alternative to Thomas Partey, whose contract runs out this summer, resigning with Arsenal",
      "Arsenal are in talks to sign Brentford midfielder Christian Norgaard.",
      "<ul><li><p>Dane would compete with Zubimendi as Partey nears exit</p></li><li><p>Arsenal agree to pay keeper’s £5m Chelsea release clause</p></li></ul><p>Arsenal have offered an initial £9.3m for Brentford’s captain, Christian Nørgaard, as they attempt to secure a replacement for Thomas Partey and a",
      "Arsenal have reached an agreement with Brentford over the signing of Danish international midfielder Christian Nørgaard, (31) according to Foot Mercato.The 31-year-old, who has spent five seasons wit..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/25/c5858b3f-79a3-471a-8b55-275de41e07d4/untitled-design-2025-06-25t150842-058.png",
    "titles": [
      "Arsenal submit Christian Norgaard transfer bid: Gunners offer $12.8 million for Brentford midfielder",
      "Arsenal in talks with Brentford over Norgaard",
      "Arsenal offer initial £9.3m for Brentford’s Nørgaard and agree Arrizabalaga deal",
      "Arsenal agree deal with Brentford for Christian Nørgaard"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.94,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "Arsenal have agreed to sign Brentford midfielder Christian Nørgaard, offering an initial £9.3m as a potential replacement for Thomas Partey, whose contract is expiring. The 31-year-old Danish international, who has been with Brentford for five seasons, is seen as an alternative to Partey and would compete with Zubimendi for a midfield position. Additionally, Arsenal has agreed to pay a £5m release clause for a keeper from Chelsea.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Arsenal's strategic decisions, which may be valuable to football fans or those interested in the sports industry. However, it doesn't highlight any progress or solutions."
  },
  {
    "title": "US President's Visit Confirmed, Focus on Student Welfare; Walter to Buy Lakers",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 12:20:18 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "The Guardian",
      "BBC",
      "Ottawa Citizen"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The dates of the US president's stay are yet to be confirmed, but September is said to be most likely.",
      "'Let's remember that we're here for the students and not the petty fighting. The entire board allows this to continue. We have to focus on the kids'",
      "<p>Official visit confirmed but diary issues appear to have scuppered plans for initial informal meeting with king</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/jun/25/starmer-welfare-cuts-bill-vote-labour-revolt-welfare-deputy-pmqs-uk-politics-latest-updates-news\">UK politic",
      "Businessman Mark Walter's acquisition of the majority ownership stake of the Lakers is expected to close in the third or fourth quarter of this year."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9d3a/live/1ad58ef0-51b1-11f0-b52c-c776a241c026.jpg",
    "titles": [
      "King to host Trump for full state visit later this year",
      "Justine Bell the third OCDSB trustee to resign in less than a year",
      "UK to host Donald Trump for full state visit this year, says Buckingham Palace",
      "Sale of Lakers expected to close later this year"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.922,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary": "The US President's visit is confirmed but dates are undecided, likely in September. Amidst discussions, a call for focus on student welfare over internal disputes was made. Additionally, an official visit includes plans for a meeting with the king, though initial informal arrangements were hindered by scheduling conflicts. In business news, Mark Walter is set to acquire a majority ownership stake in the Lakers, with the deal expected to close in the latter half of the year.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the President's visit and the potential focus on student welfare, but it lacks depth on the implications of this focus. The news about Mark Walter acquiring the Lakers is also informative but doesn't provide actionable insights for the reader."
  },
  {
    "title": "Fan Banned from Rate Field for Derogatory Remarks About Marte's Mother",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 11:44:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A 22-year-old fan has been banned indefinitely from Rate Field after yelling something about Diamondbacks second baseman Ketel Marte's late mother during Tuesday night's game against the White Sox, the team told ESPN on Wednesday morning.",
      "<p>Arizona Diamondbacks star Ketel Marte was brought to tears in the middle of the seventh inning of Tuesday&#8217;s game against the Chicago White Sox.</p>",
      "The Arizona Diamondbacks player was consoled on the field by his coach and teammates while the fan has been banned from Rate Field in Chicago",
      "Geraldo Perdomo called for the fan to be banned"
    ],
    "image_url": "",
    "titles": [
      "ChiSox ban fan for taunt of Marte's late mother",
      "Diamondbacks’ Marte breaks down after fan references his late mother",
      "Arizona Diamondbacks’ Ketel Marte in Tears After Fan Heckles Him About His Late Mother: ‘It Hurt’",
      "Diamondbacks' Ketel Marte breaks down in tears on field after 'idiot' fan heckles him about his late mother"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.989,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.817,
    "summary": "A 22-year-old fan was indefinitely banned from Rate Field for making derogatory remarks about Arizona Diamondbacks second baseman Ketel Marte's late mother during a game against the Chicago White Sox. The incident, which occurred on Tuesday night, visibly upset Marte, leading to him being consoled by his coach and teammates on the field. Teammate Geraldo Perdomo advocated for the fan's ban, which the team confirmed to ESPN the following Wednesday morning.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the incident and the consequences faced by the fan. However, it does not provide deeper insights or actionable takeaways for the reader."
  },
  {
    "title": "Kenya Protests: Thousands Mark Year Since Deadly Unrest, Clash with Police",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 12:18:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Thousands protest in Kenya a year after deadly unrest as anger at police brutality and Ruto’s government persists.",
      "The police fired tear gas at demonstrators who were expressing anger at the government over growing economic hardship and a lack of accountability for killings at earlier rallies.",
      "<p>Nationwide marches planned in honour of those killed during anti-government protests</p><p>Kenyans plan to march countrywide on Wednesday, the first anniversary of the historic storming of parliament by protesters, to honour those killed during last year’s anti-government protests, but there are ",
      "Rights groups say at least 60 people were killed last year by security forces in protests against planned tax rises.",
      "Thousands of protesters barricaded roads in Nairobi, tore down concrete barriers topped with razor wire and hurled back tear gas canisters fired by police.",
      "Security forces fortified Kenya's government buildings with razor wire ahead of a march marking one year since anti-Ruto protesters stormed the parliament. Broadcasters have been ordered to stop showing live coverage.",
      "Kenyan police fired tear gas to disperse protesters marking one year since the deadly 2024 anti-government protests."
    ],
    "image_url": "",
    "titles": [
      "Kenyans take to the streets for protest anniversary",
      "Kenyans Return to the Streets a Year After Deadly Tax Protests",
      "Fears of unrest as Kenyans mark first anniversary of storming of parliament",
      "Clashes at large Kenya rally to mark anniversary of antigovernment protests",
      "Anti-government protests rock Kenya: ‘We are fighting for our rights’",
      "Kenya: Thousands rally on anniversary of deadly protest",
      "Kenyans take to streets a year after deadly anti-govt protests"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.921,
      "consensus": 0.988,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.811,
    "summary": "In Kenya, thousands protested to mark one year since the deadly anti-government unrest, expressing ongoing frustration with President Ruto's administration and police brutality. The demonstrations, aimed at remembering those killed in last year's protests against planned tax increases, saw police firing tear gas at crowds. Rights groups report at least 60 people died at the hands of security forces during those protests. Amidst heightened security and restrictions on live media coverage, protesters in Nairobi clashed with police, dismantling barriers and responding to tear gas. The protests re",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the ongoing unrest in Kenya and the issues related to police brutality and government dissatisfaction. However, it doesn't provide any solutions or progress towards resolving these issues. It also doesn't offer much in terms of actionable insights for the reader."
  },
  {
    "title": "Bezos-Sánchez Venice Wedding Venue Moved Amid Protests",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T00:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "Business Insider"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Jeff Bezos and Lauren Sanchez's Venice wedding party venue was moved out of Venice's city center. Many have protested against the lavish ceremonies because they see it as yet another example of exploitation of the city.",
      "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence.",
      "In Venice, a romantic backdrop of weddings for centuries, the marriage of Jeff Bezos and Lauren Sánchez is providing an economic windfall and stirring protest.",
      "<p>Nuptials of Amazon founder and former TV journalist to kick off on Thursday as activists continue to protest against event</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/24/tell-us-are-you-getting-married-in-venice-this-weekend-italy-jeff-bezos-lauren-sanchez\">Tell us: are you ",
      "Ivanka Trump, Diane von Furstenberg, and Jared Kushner have arrived in Venice for the multiday wedding of Jeff Bezos and Lauren Sánchez."
    ],
    "image_url": "",
    "titles": [
      "Bezos' Venice wedding party venue moved following protests",
      "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
      "Venice, prime wedding spot, braces for a Bezos marital extravaganza",
      "Jeff Bezos and Lauren Sánchez arrive in Venice for divisive wedding",
      "Jeff Bezos and Lauren Sánchez's wedding guest list: A-listers arrive in Italy to celebrate"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.714,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary": "Jeff Bezos and Lauren Sánchez's wedding party in Venice has sparked protests and moved its venue out of the city center. Critics argue the event exploits the city, known for its historical opulence and as a romantic wedding backdrop. Despite the controversy, the wedding, attracting high-profile guests like Ivanka Trump and Jared Kushner, is seen as providing an economic boost to Venice. The decision to relocate the celebration reflects ongoing tensions over the impact of such lavish events on the city.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the impact of high-profile events on cities like Venice. It also raises awareness about the economic implications and the ongoing tensions such events can create. However, it doesn't offer any solutions or improvements to address these issues."
  },
  {
    "title": "Pirates' Cruz, Cubs' Crow-Armstrong Make Costly Errors in Losses",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 11:44:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Pittsburgh Pirates veteran outfielder Oneil Cruz, 26, said he lost track of the outs in the seventh inning, when he didn't run out a double-play grounder, a move that led to his removal in his club's 9-3 loss to the Milwaukee Brewers on Tuesday night.",
      "<p>Tim Micallef brings you the latest edition of Central Sixty, featuring Pete Crow-Armstrong&#8217;s gaffe in the outfield, forgetting how many outs are on the field, which ultimately costed the Cubs the game, as well as a remarkable feat by Auckland City.</p>",
      "Cruz was removed from Tuesday's game after failing to run out a groundball double play"
    ],
    "image_url": "",
    "titles": [
      "Pirates remove Cruz after he loses track of outs",
      "Crow-Armstrong loses track of outs, ultimately costs Cubs the game",
      "Pirates' Oneil Cruz benched over 'energy and effort' after forgetting how many outs there were"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.989,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary": "Pittsburgh Pirates outfielder Oneil Cruz was removed from a game against the Milwaukee Brewers after not running out a double-play grounder, a mistake he attributed to losing track of the outs. This incident occurred during the team's 9-3 loss on Tuesday night. Similarly, Pete Crow-Armstrong of the Cubs made a notable outfield error by forgetting the number of outs, contributing to a game loss. These events highlight moments of inattention in professional baseball.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story increases awareness about specific incidents in recent baseball games, but it doesn't offer much depth or insight beyond reporting these errors. It doesn't provide context or analysis that might help readers understand why such mistakes occur or how they could be prevented."
  },
  {
    "title": "Man Convicted for Teen's Murder with Samurai Sword in London",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 15:27:52 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Daniel Anjorin was attacked with a sword while he was on his way to school in north-east London.",
      "LONDON (AP) — A man armed with a samurai sword who killed a London teenager on his way to school and injured five other people during what the prosecution said was a psychotic episode triggered by drug use was convicted of murder on Wednesday. A jury at London&#8217;s Central Criminal Court found Ma",
      "<p>Marcus Monzo convicted of killing schoolboy in Hainault, north-east London last year </p><p>A man has been found guilty of murdering a 14-year-old schoolboy, Daniel Anjorin, with a samurai sword last year.</p><p>Marcus Monzo, 37, carried out a marauding attack while in a state of cannabis-induced"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c531/live/30fdc430-51d0-11f0-8485-7bd50fa63665.jpg",
    "titles": [
      "Man guilty of murdering schoolboy, 14, in Hainault sword attack",
      "Attacker who killed a London schoolboy with a samurai sword is convicted of murder",
      "Man, 37, guilty of murdering Daniel Anjorin, 14, with sword in London"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.984,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Marcus Monzo, 37, was convicted of murder for killing 14-year-old Daniel Anjorin with a samurai sword in north-east London. The attack occurred while Monzo was experiencing a psychotic episode triggered by cannabis use. In addition to Anjorin's murder, Monzo injured five others during the incident. The conviction was handed down by a jury at London's Central Criminal Court.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a criminal case, but it doesn't provide any deeper insights or actionable information. It also doesn't report on any solutions or progress in addressing the broader issues of violence or mental health."
  },
  {
    "title": "Jay Bilas Spotlights 8 Prospects; Analysis Suggests 5 for Bucks' 47th Pick",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 09:33:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "From the no-brainer to the wild cards to those in between, here are eight prospects who caught Jay Bilas' eye.",
      "Here are five prospects the Milwaukee Bucks should target with their 47th overall pick in the 2025 NBA Draft."
    ],
    "image_url": "",
    "titles": [
      "Bilas: Eight prospects who stand out in this year's NBA draft class",
      "5 Prospects Milwaukee Bucks Should Target In 2025 NBA Draft"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.946,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.735,
    "summary": "Jay Bilas highlighted eight notable prospects, covering a range from obvious choices to unexpected ones. Concurrently, a separate analysis recommended five potential picks for the Milwaukee Bucks to consider for the 47th overall selection in the 2025 NBA Draft. Both pieces offer insight into future talents and strategic drafting considerations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for readers interested in basketball and the NBA Draft. It offers a deeper understanding of the prospects and strategic drafting considerations, contributing to the reader's decision-making."
  },
  {
    "title": "Spain Court Upholds Rubiales Conviction; Newsboys Dropped; MP Faces Legal Action",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 11:44:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Spain's High Court on Wednesday upheld a verdict that found former soccer federation president Luis Rubiales guilty of sexual assault for an unsolicited kiss on the lips of national team player Jenni Hermoso at the 2023 World Cup in Sydney.",
      "<p>Capitol Christian Music Group drops Christian rock band after former singer Tait was accused of sexually assaulting three men</p><p>Newsboys, the legendary Christian rock supergroup, have been <a href=\"https://julieroys.com/breaking-newsboys-dropped-from-label-amid-michael-tait-scandal-and-indust",
      "<p>State MP’s alleged victim spurred to action after learning politician had been appointed as families minister, court hears</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <"
    ],
    "image_url": "",
    "titles": [
      "Court upholds Rubiales sexual assault conviction",
      "Newsboys dropped from label after investigations into claims of sexual assault by Michael Tait",
      "NSW MP Gareth Ward likened to ‘vampire running a blood bank’ by alleged sexual assault victim, court hears"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.989,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.72,
    "summary": "Spain's High Court confirmed a sexual assault conviction against former soccer federation president Luis Rubiales for kissing player Jenni Hermoso without consent during the 2023 World Cup. In separate news, Capitol Christian Music Group dropped the Newsboys after former singer Tait faced accusations of sexually assaulting three men. Additionally, a State MP's appointment as families minister led an alleged victim to take legal action, as reported in court.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about three separate legal cases, contributing to the reader's understanding of these issues. However, it doesn't report on solutions or improvements, nor does it increase clarity around systems or causes."
  },
  {
    "title": "Isar Aerospace Lands $174M for Rockets; Lux Aeterna Gets $4M for Satellites",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 11:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "science"
    ],
    "snippets": [
      "German space startup Isar Aerospace said Wednesday it had secured 150 million euros ($174 million) in funding from a US investment firm, several months after its first test flight of an orbital rocket.",
      "Lux Aeterna, a Denver-based startup, is working on a reusable satellite that has attracted $4 million in pre-seeding funding from investors."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/3-space.jpg",
    "titles": [
      "German space startup secures new funding",
      "New space startup Lux Aeterna wants to make satellites reusable"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "German space startup Isar Aerospace secured 150 million euros ($174 million) in funding from a US investment firm to support its orbital rocket projects. This announcement comes several months after its first test flight. Meanwhile, Denver-based Lux Aeterna raised $4 million in pre-seed funding for its reusable satellite project, signaling growing investor interest in innovative space technologies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it informs readers about the progress and innovation in the space industry. It provides useful information on funding and projects of startups, contributing to the understanding of the current state of the space industry and the growing investor interest in it."
  },
  {
    "title": "Google is bringing Gemini CLI to developers&#8217; terminals",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google has launched a new open-source AI agent that brings Gemini’s coding, content generation, and research capabilities directly into developers’ terminals. Gemini CLI provides a “fundamental upgrade to your command line experience,” according to Google, making it easier for developers to write an",
      "Now, devs who prefer the terminal can get AI assistance, too.",
      "Google is launching a new agentic AI tool that will put its Gemini AI models closer to where developers are already coding. The company announced on Wednesday the launch of Gemini CLI, an agentic AI tool designed to run locally from your terminal. The new tool connects Google&#8217;s Gemini AI model"
    ],
    "image_url": "",
    "titles": [
      "Google is bringing Gemini CLI to developers&#8217; terminals",
      "Gemini CLI is a free, open source coding agent that brings AI to your terminal",
      "Google unveils Gemini CLI, an open-source AI tool for terminals"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.935,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "Without a summary or any additional information, it's impossible to evaluate the constructiveness of this story. It might be informative to developers, but without context, it doesn't offer any insights or awareness."
  },
  {
    "title": "New Dynasty Fantasy Football WR Rankings Highlight Deep Bench Strategy",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 14:30:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "Updated rankings for the wide receiver position in Dynasty leagues",
      "While this may not be as relevant for your leagues with a shallow bench, for deep leagues, getting quality stashes is crucial..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2024/10/03/6b63bf15-31e3-4cab-b8b4-1f852d9716f3/getty-garrett-wilson-jets.jpg",
    "titles": [
      "Dynasty Fantasy Football Wide Receiver Rankings for 2025: Garrett Wilson gets a boost, plus more",
      "Stash These 3 Rookies in Dynasty Fantasy Football"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.964,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary": "Updated rankings for wide receivers in Dynasty fantasy football leagues have been released, emphasizing the importance of securing quality players for teams with deep benches. This update is particularly relevant for those in leagues where having a strong reserve of players can significantly impact long-term success.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers who participate in Dynasty fantasy football leagues. It offers a deeper understanding of the importance of having a strong reserve of players and how it can impact long-term success. However, it does not report on any solutions, improvements, or innovations."
  },
  {
    "title": "Paul Cole Retires After 38 Years in Baseball and Horse Racing",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 24 Jun 2025 21:34:22 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPVWh0ZkR1NVNKWFhwZFlXZnV3MEFLd1gzMTJ0VTltUGJNY3IyTVRudTBzc0VvN0pncnZRUHRyOFB3SzlrVEdmc01xcDJrczhPQ3g0c0FnMFJjVlFuVm5td0VUWW9GRkt1bnc5SjNLQXlWMnZNVmxNbHdHTmxBZTlCbHh1M1ZIZkotQ1ljNlZ0dlZHZnZQMFZ0TTFB?oc=5\" target=\"_blank\">Whit Merrifield Apo",
      "<p>A former Blue Jays All-Star has decided the time has come to hang up his cleats.</p>",
      "Paul Cole, perhaps best known for saddling brilliant 1991 Derby winner Generous, has announced he is to retire following 38 years in the training ranks."
    ],
    "image_url": "",
    "titles": [
      "Whit Merrifield Apologizes to Phillies During Retirement Announcement: 'Sorry I Stunk' - Sports Illustrated",
      "Former Blue Jay Whit Merrifield announces retirement from MLB",
      "Derby-winning trainer Cole announces retirement"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.678,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary": "Former Blue Jays All-Star and renowned horse trainer, Paul Cole, has announced his retirement after a distinguished 38-year career. Cole is celebrated for his role in training Generous, the brilliant winner of the 1991 Derby. This marks the end of an era for Cole, who has been a significant figure in both baseball and horse racing.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Paul Cole's retirement but doesn't provide much depth or insight beyond that. It doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems or causes."
  },
  {
    "title": "UK Backs Universal Theme Park in Bedford, Eyes £50bn Boost, 28,000 Jobs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 08:36:40 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Scale of support for Comcast attraction a sign of government’s desire to attract inward investment",
      "<p>Attraction at site of former brickworks in Bedford could boost UK economy by £50bn and create 28,000 jobs</p><p>The deal to build Universal’s <a href=\"https://www.theguardian.com/travel/2025/apr/09/universal-chooses-bedford-to-be-location-of-its-first-theme-park-in-europe\">new theme park in Bedfo"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2ca6de59-36c6-424b-98d1-636e8079d7a7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK ministers line up £500mn transport package for Universal theme park",
      "Universal theme park deal secured with UK pledge to spend £500m on transport"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.853,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary": "The UK government's support for the new Universal theme park at a former brickworks in Bedford, aimed at boosting the economy by £50bn and creating 28,000 jobs, underscores its commitment to attracting inward investment. This initiative marks Universal's first theme park in Europe, highlighting the significant economic impact anticipated from the project.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and solutions, reporting on a significant initiative that is expected to boost the economy and create jobs. It provides actionable insights for investors and policymakers, and increases awareness about the potential economic impact of such projects."
  },
  {
    "title": "Axiom Mission 4 Launches to ISS with Private Crew Amid Delays",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:35:31 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "After a series of delays from weather to rocket engines to a leak on the International Space Station, NASA has cleared the way for SpaceX to launch the Axiom Space Ax-4 crew on the Space Coast.",
      "NASA, Axiom Space, and SpaceX are targeting 2:31 a.m. EDT, Wednesday, June 25, for launch of the fourth private astronaut mission to the International Space Station, Axiom Mission 4. The mission will lift off from Launch Complex 39A at NASA’s Kennedy Space Center in Florida. The crew will travel to ",
      "As part of NASA’s efforts to expand access to space, four private astronauts are in orbit following the successful launch of the fourth all private astronaut mission to the International Space Station. A SpaceX Dragon spacecraft lifted off at 2:31 a.m. EDT Wednesday from Launch Complex 39A at NASA’s",
      "NASA astronaut Zena Cardman inspects her spacesuit’s wrist mirror in this portrait taken at NASA’s Johnson Space Center in Houston on March 22, 2024. Cardman will launch to the International Space Station as part of NASA’s SpaceX Crew-11 mission. This will be her first spaceflight. Cardman was selec"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/international-space-st-3.jpg",
    "titles": [
      "NASA clears way for SpaceX, Axiom Space to try overnight launch to space station",
      "NASA Sets Coverage for Axiom Mission 4 Launch, Arrival at Station",
      "NASA to Welcome Fourth Private Astronaut Mission to Space Station",
      "NASA Astronaut Zena Cardman"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.966,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary": "NASA, SpaceX, and Axiom Space successfully launched the fourth private astronaut mission, Axiom Mission 4, to the International Space Station. The launch occurred at 2:31 a.m. EDT on Wednesday from Launch Complex 39A at Kennedy Space Center in Florida, despite previous delays due to weather, rocket engine issues, and a leak on the ISS. This mission marks a step forward in NASA's efforts to expand access to space, carrying four private astronauts into orbit aboard a SpaceX Dragon spacecraft.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information on the progress of private space travel and the challenges faced in the process. It helps increase awareness about NASA's efforts to expand access to space and the role of private companies in it. However, it lacks a deeper insight or analysis of the implications of these developments."
  },
  {
    "title": "Bumble Announces 30% Workforce Cut, Affecting 240 Employees",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:23:50 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Founder Whitney Wolfe Herd, who stepped down as CEO at the beginning of 2024, returned to the role earlier this year.",
      "Dating app Bumble announced on Wednesday that it's laying off 30% of its workforce, impacting around 240 positions."
    ],
    "image_url": "",
    "titles": [
      "Bumble jumps 26% as dating company plans to axe 30% of workforce",
      "Bumble to lay off 30% of its workforce"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.983,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary": "Whitney Wolfe Herd, the founder of Bumble, resumed her position as CEO earlier this year after stepping down at the start of 2024. Recently, Bumble announced it would be reducing its workforce by 30%, affecting approximately 240 employees. This decision was made public on Wednesday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story is negative, it provides useful information about a significant decision made by Bumble. It informs readers about the changes in the company's workforce, which could be useful for potential investors, employees, or users of the app. However, it does not offer any solutions or improvements, nor does it increase clarity around systems or impacts."
  },
  {
    "title": "Tesla's Reputation Decline Linked to Falling EU Sales Amid Musk's Controversies",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:05:02 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The U.S. EV maker has sustained brand and reputational damage in part due to CEO Elon Musk's incendiary rhetoric and political activity.",
      "<figure><img alt=\"Sean Gallup / Getty Images Tesla's EU sales declines continued in May even though overall battery-electric vehicle registrations in the bloc surged 25% year-over-year.\" src=\"https://www.investopedia.com/thmb/nEwUdpK8g2GzIJl9r-c7SXE5m5E=/filters:no_upscale():max_bytes(150000):strip_"
    ],
    "image_url": "",
    "titles": [
      "Tesla's European car sales nosedive for fifth month as customers switch to Chinese EVs",
      "Tesla EU Sales Tumble for Fifth Straight Month"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary": "The U.S. electric vehicle (EV) manufacturer has experienced a decline in brand reputation, attributed in part to CEO Elon Musk's controversial statements and political actions. Despite a 25% increase in battery-electric vehicle registrations in the European Union, Tesla's sales in the region have continued to fall. This trend suggests that the company's reputational issues may be affecting its market performance in Europe.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the potential impact of a CEO's public behavior on a company's sales and reputation. It also offers a deeper understanding of the current state of the electric vehicle market in the European Union. However, it lacks a focus on solutions or progress."
  },
  {
    "title": "Panel to Discuss Vaccine Guidance, New Member Sparks Debate",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:30:34 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "It is unclear how Kennedy's new members, including Dr. Robert Malone, will affect the panel's vaccine recommendations.",
      "The panel is scheduled to meet Wednesday with an anti-vaccine agenda."
    ],
    "image_url": "",
    "titles": [
      "CDC vaccine panel holds first meeting since RFK Jr. put immunization critics in place",
      "CDC’s once-revered vaccine panel now a “farce”—calls grow to scrap meeting"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.985,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary": "The panel, including new member Dr. Robert Malone, is set to meet on Wednesday to discuss vaccine recommendations amid concerns over its anti-vaccine agenda. The impact of the new members on the panel's guidance remains uncertain.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a panel discussion on vaccine recommendations and the controversy surrounding a new member. However, it lacks depth or insight as it does not provide any information on the panel's findings or the specific concerns about the new member's anti-vaccine agenda."
  },
  {
    "title": "Mercedes, Audi, Volvo Reject CarPlay Ultra Amid Proprietary System Launches",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 04:00:06 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Ars Technica"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "‘CarPlay Ultra’ rollout comes as auto groups are introducing their own infotainment systems",
      "Mercedes, Audi, and Volvo all say they have no plans to support CarPlay Ultra."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd28f5df6-d8ce-4e7b-ade0-b11343062f8e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Carmakers push back against Apple’s takeover of the dashboard",
      "Apple’s push to take over the dashboard resisted by car makers"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.775,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "The introduction of 'CarPlay Ultra' is happening at a time when automobile manufacturers like Mercedes, Audi, and Volvo are launching their proprietary infotainment systems. These three companies have explicitly stated that they do not intend to support CarPlay Ultra in their vehicles.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the current trends in the automobile industry, particularly the move towards proprietary infotainment systems. It provides useful context for understanding the decisions of Mercedes, Audi, and Volvo. However, it doesn't offer much in terms of solutions or progress, nor does it delve deeply into the implications of these trends."
  },
  {
    "title": "TikTok, Celebs Promote Ad Against Using \"Gay\" as Insult; NYT Examines Iran's Iso",
    "domain": "business",
    "location": "national",
    "published": "Tue, 24 Jun 2025 18:27:11 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "TikTok videos, social media posts, and celebrities are referencing Duff's ad, which discourages people from using the word \"gay\" as an insult.",
      "Christina Goldbaum, a New York Times reporter, and Katrin Bennhold, a senior writer on the international desk, discuss how the power dynamics in the Middle East could change as Iran has become more isolated."
    ],
    "image_url": "",
    "titles": [
      "How the gay anti-bullying ad with Hilary Duff became a cult classic",
      "How Iran Became Isolated"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.635,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "TikTok videos, social media, and celebrities are promoting an ad featuring Duff that discourages using \"gay\" as an insult. Meanwhile, New York Times reporters Christina Goldbaum and Katrin Bennhold analyze how Iran's increasing isolation could shift power dynamics in the Middle East.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story raises awareness about the misuse of the term \"gay\" as an insult and the efforts to combat this behaviour. It also provides useful insights into the potential shift in power dynamics in the Middle East due to Iran's increasing isolation. However, it doesn't provide clear solutions or progress towards resolving these issues."
  },
  {
    "title": "Study Links Baby Toy Preferences with Future IQ; Cat Personalities Vary",
    "domain": "science",
    "location": "global",
    "published": "Tue, 24 Jun 2025 21:49:24 +0000",
    "source": "SciTechDaily",
    "sources": [
      "Phys.org",
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/your-babys-favorite-toy-could-hint-at-their-future-iq/\" rel=\"nofollow\" title=\"Your Baby’s Favorite Toy Could Hint at Their Future IQ\"><img alt=\"Baby Plastic Toy\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/Baby-Plas",
      "If you've ever shared your home with more than one cat, you'll know how different their personalities can be. One might chirp for food, purr loudly on your lap and greet visitors at the door. Another might prefer quiet observation from a distance."
    ],
    "image_url": "",
    "titles": [
      "Your Baby’s Favorite Toy Could Hint at Their Future IQ",
      "Is your cat vocal or quiet? The explanation could be in their genes"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.681,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary": "A study suggests that a baby's preference for certain toys could indicate their future IQ, highlighting the impact of early interactions on cognitive development. Meanwhile, cat owners observe diverse personalities among their pets, with behaviors ranging from sociable and vocal to reserved and observant, showcasing the wide range of feline temperaments.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides basic awareness about new findings in cognitive development and animal behavior. However, it lacks depth and does not provide actionable insights for readers. It would have been more constructive if it had elaborated on how these findings could be used in practical ways or what their implications might be."
  },
  {
    "title": "World-First Study: Bee Hotels Aid Recovery of Bees After Bushfires",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 11:36:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A world-first trial led by University of Southern Queensland (UniSQ) native bee scientist and conservationist Dr. Kit Prendergast has found bee hotels can play a vital role in helping native bee populations recover after bushfires."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/making-a-beeline-bee-h.jpg",
    "titles": [
      "Bee hotels give native pollinators a post-bushfire fighting chance, study reveals"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary": "A trial led by Dr. Kit Prendergast from the University of Southern Queensland has discovered that bee hotels are significantly beneficial for the recovery of native bee populations following bushfires. This world-first research highlights the importance of bee hotels in conservation efforts for native bees affected by such natural disasters.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It informs readers about a novel solution (bee hotels) that has been found to aid the recovery of bee populations after bushfires. It also provides actionable insights on how to contribute to conservation efforts."
  },
  {
    "title": "Better Auth, an authentication tool by a self-taught Ethiopian dev, raises $5M from Peak XV, YC",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:00:16 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Better Auth, which offers a framework that simplifies user authentication for developers, has raised $5M seed funding from Peak XV and others."
    ],
    "image_url": "",
    "titles": [
      "Better Auth, an authentication tool by a self-taught Ethiopian dev, raises $5M from Peak XV, YC"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on the progress of a self-taught Ethiopian developer and the success of his authentication tool. It provides useful information about the tool and its funding, and also highlights the importance of self-education and innovation in the tech industry."
  },
  {
    "title": "Bill Gates-backed AirLoom begins building its first power plant",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 15:10:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Wind power has run into some headwinds, and not the kind that spin its turbines.&#160; Recently, President Trump has decided to wage war against the technology, an unwelcome bit of friction that coincides with rising costs in recent years. Onshore wind power went for $61 per megawatt-hour last year,"
    ],
    "image_url": "",
    "titles": [
      "Bill Gates-backed AirLoom begins building its first power plant"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.455,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress and innovation in the energy sector. It also provides actionable insights on where influential figures like Bill Gates are investing, which could influence readers' decisions in related fields."
  },
  {
    "title": "iPhone users on Google Fi will now get all their voicemails in the Phone app",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T12:02:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google is making a big change to how Fi users on iPhone access their voicemails: instead of getting voicemails from a dedicated tab in the Fi app, iPhone users will be able to get them right from the native iOS Phone app instead. The change started rolling out on Tuesday and will be fully rolled [&#"
    ],
    "image_url": "",
    "titles": [
      "iPhone users on Google Fi will now get all their voicemails in the Phone app"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.448,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information for iPhone users on Google Fi, informing them of a new feature that could improve their user experience. However, it doesn't highlight any significant progress or solutions, nor does it increase awareness around a broader issue."
  },
  {
    "title": "Mark Minervini Shares Investment Strategies from Decades of Trading Experience",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 15:05:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Mark Minervini shares what’s worked for him over his long trading career and talks about how to invest in the stock market now."
    ],
    "image_url": "https://images.mktw.net/im-417920",
    "titles": [
      "Why this famous trader is 100% invested in the S&P 500 right now — even after the U.S. strike on Iran"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "Mark Minervini, a seasoned trader, shared insights from his extensive trading career, offering advice on current stock market investment strategies. He emphasized the importance of leveraging his years of experience to guide investors on how to navigate the market effectively.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive as it provides actionable insights and deeper understanding of stock market investment strategies. It empowers readers with knowledge from an experienced trader which can be useful for their decision-making in investments."
  },
  {
    "title": "New Global Framework Targets Coexistence of Humans and Nature",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As the world faces an escalating planetary crisis, a paper published in Nature offers hope. The paper proposes a bold new way forward; a global framework that measures how well people and nature are thriving together."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2019/nature.jpg",
    "titles": [
      "New global index aims to help people and nature thrive together"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "A recent paper in Nature presents a global framework aimed at addressing the escalating planetary crisis by evaluating the coexistence of human and natural well-being. This innovative approach suggests a path forward by measuring the success of both people and nature in thriving together, offering a hopeful perspective on tackling environmental challenges.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive as it presents a new global framework that aims to balance human and natural well-being. It provides readers with a deeper understanding of a potential solution to the planetary crisis, although it might lack specific actionable insights for individual readers."
  },
  {
    "title": "Boson Sampling Advances Quantum Computing's Edge Over Classical Methods",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:40:40 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "For over a decade, researchers have considered boson sampling—a quantum computing protocol involving light particles—as a key milestone toward demonstrating the advantages of quantum methods over classical computing. But while previous experiments showed that boson sampling is hard to simulate with "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/boson-sampling-finds-f.jpg",
    "titles": [
      "Boson sampling finds first practical applications in quantum AI"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Researchers have been studying boson sampling, a quantum computing protocol using light particles, for over a decade as a significant step in demonstrating quantum computing's superiority over classical methods. Previous experiments confirmed that simulating boson sampling on classical computers is challenging, highlighting the potential advantages of quantum computing techniques.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on the progress in quantum computing, specifically the advancement of boson sampling. It gives the reader a deeper understanding of the potential advantages of quantum computing over classical methods, contributing to their knowledge in this field."
  },
  {
    "title": "Winning capital for your AI startup? Kleida Martiro is leading the conversation at TechCrunch All Stage",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 14:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AI-native startups are rewriting the rules of what early traction looks like — and too often, investors are still playing by the old ones. At TechCrunch All Stage, happening in Boston on July 15, Kleida Martiro, partner at Glasswing Ventures, will lead a breakout that cuts straight to the core of th"
    ],
    "image_url": "",
    "titles": [
      "Winning capital for your AI startup? Kleida Martiro is leading the conversation at TechCrunch All Stage"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.442,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information for AI startups seeking capital, and increases awareness about who is leading the conversation in this area. However, without further context or detail on the solutions or strategies discussed, it doesn't fully highlight progress or solutions."
  },
  {
    "title": "Sitch’s new dating app fuses human matchmaking and AI",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Can AI improve the dating app market? A new dating app called Sitch aims to find out by leveraging human expertise in matchmaking to power its AI model. Today&#8217;s dating apps bank on the speed of onboarding and having millions of options. Users create profiles within seconds by uploading photos "
    ],
    "image_url": "",
    "titles": [
      "Sitch’s new dating app fuses human matchmaking and AI"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it informs readers about a new innovation in the dating app industry, providing useful information about the app's unique approach. However, it doesn't provide deeper insights into the broader implications of AI in dating apps or the potential solutions it offers to existing problems in the dating scene."
  },
  {
    "title": "Ocean Absorbs 25% of Human-Emitted CO2, Easing Climate Change Impact",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:42:25 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As atmospheric carbon dioxide levels continue to rise, the ocean plays a crucial role in helping to reduce the full impact of human-driven climate change by absorbing roughly a quarter of the carbon dioxide emitted by human activity."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/high-resolution-mappin-1.jpg",
    "titles": [
      "High-resolution mapping reveals ocean carbon sink detail"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "The ocean mitigates the effects of climate change by absorbing about 25% of the carbon dioxide (CO2) emitted from human activities. This process helps to lessen the overall impact of increasing atmospheric CO2 levels, demonstrating the ocean's vital role in the global carbon cycle and climate regulation.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the role oceans play in mitigating climate change, increasing awareness about the global carbon cycle and climate regulation. However, it does not offer any actionable insights or report on solutions or improvements."
  },
  {
    "title": "Insta360’s new wireless mic looks no bigger than an Apple AirTag",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T10:10:45-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Having already secured a strong foothold in the action cam market with its Ace Pro lineup, Insta360 is now challenging DJI, Shure, and Rode with the company’s first wireless microphone. Looking comparable in size to an Apple AirTag, the Insta360 Mic Air is one of the smallest and lightest wireless m"
    ],
    "image_url": "",
    "titles": [
      "Insta360’s new wireless mic looks no bigger than an Apple AirTag"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a new product, which can help readers make informed decisions about purchasing. However, it does not report on solutions, improvements, or innovations, nor does it increase awareness about systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Europe Boosts Defense Spending, Still Relies on US Arms",
    "domain": "business",
    "location": "global",
    "published": "2025-06-25T14:52:01Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Europe's defense spending is rising and many officials want to become more independent from US output. But the continent still wants a lot of US gear."
    ],
    "image_url": "https://i.insider.com/685bdeedf748d8c055f45066?format=jpeg",
    "titles": [
      "A key NATO ally said it would be 'really big mistake' for Europe to break away from the US weapons industry"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Europe is increasing its defense spending with the aim of becoming more self-reliant. However, despite these efforts for greater independence, there remains a strong demand within the continent for military equipment from the United States.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about Europe's efforts to increase its defense spending and its continued reliance on US arms. It provides a useful context about the dynamics of international defense strategies. However, it lacks a clear indication of progress or solutions to the dependency issue."
  },
  {
    "title": "New Bat Viruses Related to Nipah Found, Pose Human Risk",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:47:25 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Two newly discovered viruses lurking in bats are dangerously similar to Nipah and Hendra, both of which have caused deadly outbreaks in humans. Found in fruit bats near villages, these viruses may spread through urine-contaminated fruit, raising serious concerns. And that’s just the start—scientists"
    ],
    "image_url": "",
    "titles": [
      "New viruses discovered in bats in China could be the next pandemic threat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Scientists have identified two new viruses in fruit bats that are closely related to the deadly Nipah and Hendra viruses. These viruses, found near human villages, pose a risk of spreading to humans through urine-contaminated fruit. This discovery raises significant concerns about potential future outbreaks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about the potential risks of new viruses spreading to humans. However, it doesn't offer actionable insights or solutions to mitigate these risks, limiting its constructive value."
  },
  {
    "title": "Remedy is in control",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the quiet suburb of Espoo, a short drive west from Helsinki in Finland, is an unassuming building that's home to one of the most confounding studios in games. Remedy Entertainment is known for getting weird. It started with the meta horror of Alan Wake, and has since expanded with Control, a game"
    ],
    "image_url": "",
    "titles": [
      "Remedy is in control"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without context or summary, it's difficult to assess the constructiveness of this story. Based on the title alone, it doesn't appear to provide actionable insights, report on progress, or increase awareness about a particular system, cause, trend, or impact."
  }
]