[
  {
    "title": "Why King Charles III's trip to Canada is more than just a royal visit",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 23:47:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "BBC royal correspondent Daniela Relph on King Charles III's trip to Canada where he will open the country’s parliament."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7309/live/74b74950-380b-11f0-8947-7d6241f9fce9.jpg",
    "titles": [
      "Why King Charles III's trip to Canada is more than just a royal visit"
    ],
    "summary": "King Charles III is set to open Canada's parliament, as reported by BBC royal correspondent Daniela Relph. This marks a significant event in King Charles III's duties as the monarch.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful context for understanding the significance of King Charles III's royal duties and his relationship with Canada. However, it does not provide any actionable insights or report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.885,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.521,
    "normalized_score": 2.16
  },
  {
    "title": "At least 11 hospitalized after shooting in South Carolina: Police",
    "domain": "general",
    "location": "national",
    "published": "Sun, 25 May 2025 23:41:46 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "At least 11 people were transported to the hospital after a shooting in Little River, South Carolina, on Sunday."
    ],
    "image_url": "https://s.abcnews.com/images/US/sc_1748230661591_hpMain_4x3t_384.jpg",
    "titles": [
      "At least 11 hospitalized after shooting in South Carolina: Police"
    ],
    "summary": "On Sunday, a shooting in Little River, South Carolina, resulted in at least 11 individuals being hospitalized.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about a violent incident, it does not offer any deeper understanding, actionable insights, or report on any attempts to solve the problem. It is mainly reactive and sensational.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.507,
    "normalized_score": 1.56
  },
  {
    "title": "Call for freeze on Syrian asylum claims to end",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 23:41:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The UK paused processing of Syrian claims five months ago, following the fall of President Assad."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/86df/live/31fb3880-30ca-11f0-b5da-71555b1343d7.jpg",
    "titles": [
      "Call for freeze on Syrian asylum claims to end"
    ],
    "summary": "The UK halted the processing of asylum claims from Syrians five months ago after President Assad's regime fell. This decision has directly impacted Syrian nationals seeking refuge in the UK, marking a significant change in the country's approach to asylum procedures for Syrians amid the political shift in Syria.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly increases awareness about the UK's asylum procedures and the impacts of political shifts in Syria on Syrian nationals seeking refuge. It also highlights the call to end the freeze on Syrian asylum claims, indicating a potential solution to a problem.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.558,
    "normalized_score": 3.77
  },
  {
    "title": "Trump says he'll delay a threatened 50% tariff on the European Union until July",
    "domain": "general",
    "location": "national",
    "published": "Sun, 25 May 2025 23:35:06 -0400",
    "source": "NPR",
    "sources": [
      "NPR"
    ],
    "snippets": [
      "President Donald Trump said Sunday that the U.S. will delay implementation of a 50% tariff on goods from the European Union from June 1 until July 9 to buy time for negotiations with the bloc."
    ],
    "image_url": "",
    "titles": [
      "Trump says he'll delay a threatened 50% tariff on the European Union until July"
    ],
    "summary": "President Donald Trump announced on Sunday that the U.S. will postpone the imposition of a 50% tariff on European Union goods, originally scheduled for June 1, to July 9. The delay is intended to allow additional time for negotiations between the U.S. and the EU.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a delay in tariff imposition, which can impact international trade and economy. However, it does not go into depth about the reasons for the delay or the potential impacts, nor does it report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.938,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.553,
    "normalized_score": 3.55
  },
  {
    "title": "‘It wasn’t meant to end this way’: Lineker signs off from Match of the Day",
    "domain": "general",
    "location": "global",
    "published": "Sun, 25 May 2025 23:33:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Presenter bids farewell to famous football highlights show as final whistle blows on his career with BBC</p><ul><li><p><a href=\"https://www.theguardian.com/tv-and-radio/2025/may/26/game-changer-gary-lineker-finest-match-of-the-day-moments\">Gary Lineker’s finest Match of the Day TV moments</a></p></li></ul><p>Gary Lineker bade farewell to Match of the Day and his career at the BBC on Sunday night in the only appropriate manner: with a montage.</p><p>There were deep breaths, noises off, the checking of notes. There were tears and celebrations. There was Bobby Robson and Johan Cruyff. There were tributes from colleagues, peers, friends and family and an invitation to “go gallivanting” from Gazza.</p> <a href=\"https://www.theguardian.com/football/2025/may/26/it-wasnt-meant-to-end-this-way-lineker-signs-off-from-match-of-the-day\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/bb217c36a4144fd7909a40203804cfa370055a1d/171_179_656_524/master/656.jpg?width=140&quality=85&auto=format&fit=max&s=7c354716eeccc796ebc12554508dac67",
    "titles": [
      "‘It wasn’t meant to end this way’: Lineker signs off from Match of the Day"
    ],
    "summary": "Gary Lineker has officially retired from his role at BBC's Match of the Day. His departure was marked by a special montage during the final show, featuring memorable moments, tributes from colleagues, and emotional farewells. Lineker's career at the BBC concluded with acknowledgments of his contributions to football broadcasting.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness of Gary Lineker's retirement from BBC's Match of the Day, it does not offer much depth or insight beyond that. It does not provide actionable insights or deeper understanding for the reader, nor does it report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.882,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.49,
    "normalized_score": 0.82
  },
  {
    "title": "Cabrera rallies past Harrington to win Senior PGA Championship",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 23:50:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Angel Cabrera won his second senior major in a week, shooting a three-under 69 and rallying for a one-stroke victory in the Senior PGA Championship."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-angel-cabrera-golf_6927492.jpg?20250525235532",
    "titles": [
      "Cabrera rallies past Harrington to win Senior PGA Championship"
    ],
    "summary": "Angel Cabrera secured his second senior major victory within a week by winning the Senior PGA Championship. He achieved a one-stroke victory with a final round of three-under 69, showcasing his skill and resilience in the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story reports on a specific event in the world of sports, but it does not provide actionable insights or deeper understanding for the reader. It does not report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.886,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.0
  },
  {
    "title": "Griffin digs in to win Charles Schwab Challenge",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 23:39:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Ben Griffin won his first individual PGA Tour victory at the Charles Schwab Challenge, beating Matti Schmid by one shot at Colonial."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-golf-ben-griffin_6927490.jpg?20250525234755",
    "titles": [
      "Griffin digs in to win Charles Schwab Challenge"
    ],
    "summary": "Ben Griffin secured his first individual PGA Tour title at the Charles Schwab Challenge, narrowly defeating Matti Schmid by a single shot at Colonial.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an event in the sports world, specifically a PGA Tour title win. However, it doesn't offer any deeper insight or understanding, nor does it report on solutions, improvements, or innovations. It's a simple reporting of a fact with no additional context or analysis.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.883,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.471,
    "normalized_score": 0.0
  },
  {
    "title": "Dodgers' Shohei Ohtani throws to hitters for first time since surgery as return timeline comes into focus",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 25 May 2025 23:10:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Ohtani threw live batting practice on Sunday at Citi Field"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/25/53ca4476-35f6-45dd-8944-903dac39f0e2/ohtani-getty-27.png",
    "titles": [
      "Dodgers' Shohei Ohtani throws to hitters for first time since surgery as return timeline comes into focus"
    ],
    "summary": "Shohei Ohtani, a player for the Los Angeles Angels, participated in a live batting practice session on Sunday at Citi Field. This event marks a significant step in his training routine, showcasing his skills in a controlled environment.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a player's recovery from surgery and his return to training. It gives readers an understanding of the player's current status and future prospects. However, it doesn't report on any innovative solutions or improvements, nor does it provide a deep understanding of the systems or impacts involved.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.876,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.498,
    "normalized_score": 1.17
  },
  {
    "title": "Knicks vs. Pacers odds, prediction, time: 2025 NBA Eastern Conference finals Game 3 picks by proven model",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 25 May 2025 22:32:54 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "SportsLine's model simulated New York vs. Indiana 10,000 times and revealed its NBA picks for Sunday's 2025 Eastern Conference finals matchup"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/20/4c228839-3cb7-4cd3-a094-9b58705e8b0b/jalen-brunson-knicks-imagn.jpg",
    "titles": [
      "Knicks vs. Pacers odds, prediction, time: 2025 NBA Eastern Conference finals Game 3 picks by proven model"
    ],
    "summary": "SportsLine's model, after running 10,000 simulations, has released its predictions for the 2025 Eastern Conference finals NBA game between New York and Indiana set for Sunday. The outcome provides detailed picks for the matchup, although the specific predictions were not disclosed in the summary provided.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about an upcoming sports event and the predictions made by a model. However, it doesn't provide deeper insights or understanding, such as the basis for the model's predictions or the potential impacts of the game's outcome. It also doesn't report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.868,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.486,
    "normalized_score": 0.65
  },
  {
    "title": "Iwai wins Mexico Riviera Maya Open for first LPGA title",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 25 May 2025 22:31:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Chisato Iwai made five birdies in her opening six holes for a six-under 66 and a six-shot victory in the Mexico Riviera Maya Open for her first LPGA title."
    ],
    "image_url": "https://e1.365dm.com/25/05/1920x1080/skysports-chisato-iwai-mexico-riviera-maya-open_6927475.jpg?20250525223831",
    "titles": [
      "Iwai wins Mexico Riviera Maya Open for first LPGA title"
    ],
    "summary": "Chisato Iwai won her first LPGA title at the Mexico Riviera Maya Open, securing a six-shot victory with a score of six-under 66. She achieved five birdies in her first six holes, leading to her triumph in the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a sports event and its winner. However, it does not provide any actionable insights, deeper understanding, or progress on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.867,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.474,
    "normalized_score": 0.13
  },
  {
    "title": "2025 AMAs: J.Lo And Blake Shelton Among Performers And Presenters",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 23:57:49 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "Find out which stars will be performing and presenting at the 2025 American Music Awards on Monday, hosted by Jennifer Lopez."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/682e79d7a0d1f19842eb1e3c/0x0.jpg?width=960",
    "titles": [
      "2025 AMAs: J.Lo And Blake Shelton Among Performers And Presenters"
    ],
    "summary": "The 2025 American Music Awards, set to take place on Monday, will be hosted by Jennifer Lopez. The event will feature performances and presentations by various stars, although specific names of the participants have not been disclosed in the provided information.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is mainly an announcement about an upcoming event. It doesn't provide actionable insights or a deeper understanding of any particular issue. It doesn't report on solutions, improvements, innovations, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.943,
      "consensus": 0.2,
      "constructiveness": 0.2
    },
    "score": 0.499,
    "normalized_score": 1.21
  },
  {
    "title": "Trump delays 50% tariffs on EU to July 9",
    "domain": "business",
    "location": "national",
    "published": "Sun, 25 May 2025 23:57:12 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune",
      "Financial Times"
    ],
    "snippets": [
      "President of the European Commission Ursula Von der Leyen said that she had a \"good call\" with Trump, but needed until July 9 to \"reach a good deal.\"",
      "Von der Leyen says Brussels ready to move ‘swiftly and decisively’ after ‘good call’ with US president",
      "Trump on Friday threatened to impose a 50% tariff on the EU after complaining the bloc was slow-walking negotiations."
    ],
    "image_url": "",
    "titles": [
      "Trump delays 50% tariffs on EU to July 9",
      "Trump delays imposing 50% tariffs on EU until July 9",
      "Trump extends deadline for 50% tariffs on EU to July 9"
    ],
    "summary": "European Commission President Ursula Von der Leyen reported a positive discussion with US President Trump, indicating Brussels is prepared to act swiftly following the call. However, she mentioned needing until July 9 to finalize a satisfactory deal. This conversation comes after Trump threatened to impose a 50% tariff on the EU, accusing it of delaying negotiations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides context around a significant issue, which is the potential imposition of tariffs by the US on the EU. It could help readers understand the current state of US-EU relations and the potential economic impacts of these tariffs. However, it doesn't clearly highlight progress or solutions, and the information provided is not empowering or actionable for the general reader.",
    "score_components": {
      "magnitude": 0.59,
      "recency": 0.887,
      "consensus": 0.6,
      "constructiveness": 0.8
    },
    "score": 0.702,
    "normalized_score": 10.0
  },
  {
    "title": "‘The Last Of Us’ Season 2, Episode 7 Recap And Review: An Action-Packed But Badly Rushed Finale",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 22:00:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "The Last Of Us rushed its big Season 2 finale, and it's more clear than ever that the show doesn't trust its audience."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6831a2615dec552b5edd9f5c/0x0.jpg?width=960",
    "titles": [
      "‘The Last Of Us’ Season 2, Episode 7 Recap And Review: An Action-Packed But Badly Rushed Finale"
    ],
    "summary": "The Last Of Us Season 2 finale has been criticized for appearing rushed, with critiques highlighting a perceived lack of trust in the audience by the show's creators. This criticism suggests that the finale may have been executed in a way that underestimates the audience's ability to engage with more nuanced storytelling.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the quality of the show's finale, but it doesn't provide much depth or insight beyond the critique of the episode being rushed. It doesn't increase the reader's understanding of the show's narrative or production decisions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.916,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.5,
    "normalized_score": 1.26
  },
  {
    "title": "I’ve studied over 200 kids—the No. 1 ‘new parenting style' for raising highly successful kids: It ‘works better than the rest’",
    "domain": "business",
    "location": "national",
    "published": "Sun, 25 May 2025 21:59:02 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Child psychologist Reem Raouda, who has studied more than 200 child-parent relationships, says popular parenting styles, such as authoritative or gentle parenting, don't always work. Here's a new parenting style that can actually help you raise successful, emotionally intelligent and confident kids."
    ],
    "image_url": "",
    "titles": [
      "I’ve studied over 200 kids—the No. 1 ‘new parenting style' for raising highly successful kids: It ‘works better than the rest’"
    ],
    "summary": "Child psychologist Reem Raouda, after studying over 200 child-parent relationships, challenges the effectiveness of popular parenting styles like authoritative or gentle parenting. Raouda introduces a new parenting approach aimed at fostering success, emotional intelligence, and confidence in children.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides readers with actionable insights into a new parenting style, based on a study of over 200 child-parent relationships. It highlights a potential solution for parents seeking to foster success, emotional intelligence, and confidence in their children.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.86,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.552,
    "normalized_score": 3.51
  },
  {
    "title": "This Administration Gave Boeing A Very Generous Deal On Plane Crashes",
    "domain": "business",
    "location": "global",
    "published": "Sun, 25 May 2025 21:23:23 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "Boeing got a sweetheart deal on Max 737 crashes, with no fraud conviction and no monitor.  Last year Judge O'Connor dismissed its plea, hence, its 2025 chance."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6833c0554f8eaebb8fdcce30/0x0.jpg?width=960",
    "titles": [
      "This Administration Gave Boeing A Very Generous Deal On Plane Crashes"
    ],
    "summary": "Boeing reached an agreement regarding the Max 737 crashes that resulted in no fraud conviction and the absence of a monitor overseeing the company's operations. However, this deal was dismissed last year by Judge O'Connor. As a result, Boeing has an opportunity for reconsideration in 2025.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about the legal and political aspects of Boeing's handling of the Max 737 crashes. It informs readers about the company's agreement and the dismissal by Judge O'Connor, giving them a clearer understanding of the situation. However, it doesn't report on solutions or improvements to prevent similar issues in the future.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.907,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.538,
    "normalized_score": 2.9
  },
  {
    "title": "Groundbreaking Study Reveals Animals Form Long-Term Friendships, Just Like Humans",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 22:57:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/groundbreaking-study-reveals-animals-form-long-term-friendships-just-like-humans/\" rel=\"nofollow\" title=\"Groundbreaking Study Reveals Animals Form Long-Term Friendships, Just Like Humans\"><img alt=\"Two Bluebirds Squawking\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Two-Bluebirds-Squawking-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have uncovered compelling evidence of long-term, reciprocal helping behavior among African starlings, challenging long-held assumptions about cooperation among non-relatives in the animal kingdom. It&#8217;s no surprise that humans often help one another, even when they&#8217;re not related. Just think about the mutual support that keeps your oldest friendships going strong. But proving that this [...]"
    ],
    "image_url": "",
    "titles": [
      "Groundbreaking Study Reveals Animals Form Long-Term Friendships, Just Like Humans"
    ],
    "summary": "A recent study has provided strong evidence that African starlings engage in long-term, reciprocal helping behaviors, similar to human friendships. This discovery challenges previous beliefs about cooperation among non-relatives in the animal kingdom, suggesting that such relationships are more common and complex than previously thought.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of animal behavior, challenging previous beliefs about cooperation among non-relatives in the animal kingdom. However, it does not explicitly report on solutions or improvements, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.873,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.538,
    "normalized_score": 2.9
  },
  {
    "title": "T. rex’s Ancestors Used an Ancient Landbridge To Walk From Asia to North America",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 22:32:23 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/t-rexs-ancestors-used-an-ancient-landbridge-to-walk-from-asia-to-north-america/\" rel=\"nofollow\" title=\"T. rex’s Ancestors Used an Ancient Landbridge To Walk From Asia to North America\"><img alt=\"Recreated Scene of Tyrannosaurus rex Hunting in a Late Cretaceous North American Forest\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"486\" src=\"https://scitechdaily.com/images/Recreated-Scene-of-Tyrannosaurus-rex-Hunting-in-a-Late-Cretaceous-North-American-Forest-777x486.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>T. rex evolved in North America from Asian ancestors. Climate shifts and extinction events helped tyrannosaurids and megaraptors grow in size and spread globally, with different adaptations to their environments. Tyrannosaurus rex evolved in North America, but a new study led by UCL researchers suggests its direct ancestor originated in Asia. Over 70 million years [...]"
    ],
    "image_url": "",
    "titles": [
      "T. rex’s Ancestors Used an Ancient Landbridge To Walk From Asia to North America"
    ],
    "summary": "A new study led by UCL researchers suggests that the direct ancestors of Tyrannosaurus rex originated in Asia and migrated to North America via an ancient landbridge. This migration occurred over 70 million years ago, facilitated by climate shifts and extinction events that allowed tyrannosaurids and megaraptors to grow in size and spread globally. These dinosaurs adapted differently to their environments, with T. rex eventually evolving in North America.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the evolution and migration of dinosaurs, contributing to the reader's understanding of prehistoric life. However, it doesn't offer actionable insights or report on progress or solutions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.868,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.516,
    "normalized_score": 1.95
  },
  {
    "title": "New Research Reveals That Chimpanzees Are Capable of Complex Communication – And We’re Finally Listening",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 22:07:02 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-research-reveals-that-chimpanzees-are-capable-of-complex-communication-and-were-finally-listening/\" rel=\"nofollow\" title=\"New Research Reveals That Chimpanzees Are Capable of Complex Communication – And We’re Finally Listening\"><img alt=\"Chimpanzees Asanti and Akuna Vocalising\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Chimpanzees-Asanti-and-Akuna-Vocalising-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Wild chimpanzees change the meaning of individual calls by combining them in different ways, a behavior that reflects how humans use language to create meaning through combining words. Humans are the only species known to use full language, which involves combining sounds into words and words into structured sentences that convey infinite meanings. This process [...]"
    ],
    "image_url": "",
    "titles": [
      "New Research Reveals That Chimpanzees Are Capable of Complex Communication – And We’re Finally Listening"
    ],
    "summary": "Recent research has discovered that wild chimpanzees have the ability to alter the meanings of their calls by combining them in various sequences, similar to how humans construct meaning through language by combining words into sentences. This finding highlights the complexity of chimpanzee communication and suggests a closer connection to human language capabilities than previously understood.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive, as it not only provides a deeper understanding of chimpanzee communication, but also suggests a closer connection to human language capabilities than previously understood. This could potentially lead to improvements or innovations in our approach to studying and conserving these animals.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.862,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.544,
    "normalized_score": 3.16
  },
  {
    "title": "NOAA's 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 16:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "U.S. forecasters are expecting an above-normal 2025 Atlantic hurricane season, with 13 to 19 named storms, and 6 to 10 of those becoming hurricanes."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2019/2-hurricane.jpg",
    "titles": [
      "NOAA's 2025 hurricane forecast warns of a busy season. A scientist explains why and what meteorologists are watching"
    ],
    "summary": "U.S. forecasters predict an above-normal Atlantic hurricane season for 2025, anticipating 13 to 19 named storms. Of these, 6 to 10 are expected to escalate into hurricanes. This forecast indicates a potentially active and impactful hurricane season.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the upcoming hurricane season, which can help readers prepare. It also raises awareness about the factors that meteorologists consider when making these forecasts. However, it doesn't report on any solutions or improvements to the problem of increasing hurricane activity.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.786,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.519,
    "normalized_score": 2.08
  },
  {
    "title": "Here's how we figured the number of guns illegally trafficked from the US across the border to Mexico",
    "domain": "science",
    "location": "global",
    "published": "Sun, 25 May 2025 16:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Since 2008, the U.S. has spent over US$3 billion to help stabilize Mexico and stem its surge in extreme violence. The U.S. gun industry and interest group lobbyists have undercut these efforts by advocating for lax regulation and enforcement. This has created mayhem south of the border, and its effects have ricocheted to the U.S., boosting illegal drug trade and organized crime."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/gun.jpg",
    "titles": [
      "Here's how we figured the number of guns illegally trafficked from the US across the border to Mexico"
    ],
    "summary": "Since 2008, the U.S. has invested over $3 billion in Mexico to combat extreme violence and stabilize the region. However, this effort has been undermined by the U.S. gun industry and lobbyists promoting weak regulations, contributing to violence in Mexico. This situation has also aggravated the illegal drug trade and organized crime, impacting both countries.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deep understanding of the issue of gun trafficking from the US to Mexico. It highlights the impact of weak regulations and the role of the gun industry and lobbyists. This information can be actionable for policymakers and contributes to a broader understanding of the factors contributing to violence in Mexico.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.784,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.521,
    "normalized_score": 2.16
  }
]