[
  {
    "title": "UK PM Starmer Leaves Summit Early After Manchester Attack on Yom Kippur",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 10:06:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Financial Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "&#039;Appalled&#039; UK PM Starmer departs early from European summit in Copenhagen; decries that this happened on Yom Kippur.",
      "At least two people were killed when a man drove a vehicle toward a crowd of people and launched a stabbing attack near a synagogue in Manchester, police said.",
      "Authorities step up security at Jewish sites after police said people were hit by car and also suffered stab wounds",
      "<p>Keir Starmer to chair Cobra meeting as he condemns ‘appalling’ attack on synagogue during Yom Kippur</p><p><strong>Police have shot a suspect after several people were stabbed and a car was driven at members of the public at the Heaton Park Hebrew congregation synagogue in Crumpsall</strong>, <a ",
      "<p>Suspect also thought to be dead after suspected terror attack that left three more people in serious condition </p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live\">Manchester synagogue stabbing – latest updates</a>"
    ],
    "image_url": "",
    "titles": [
      "UK police shoot man suspected of deadly attack near synagogue, two killed",
      "2 dead in stabbing attack near Manchester synagogue; suspect shot, UK police say",
      "Two dead after attack at Manchester synagogue",
      "Two dead after suspected terror attack on Manchester synagogue, police say, with suspect shot by officers – latest",
      "Police shoot suspect as at least two people killed in car and knife attack at Manchester synagogue"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.957,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UK PM Keir Starmer left a European summit in Copenhagen early, expressing dismay over an attack in Manchester on Yom Kippur. A suspect drove a vehicle into a crowd and stabbed several people near the Heaton Park Hebrew congregation synagogue, resulting in at least two deaths and three seriously injured. The attacker was shot by police. Starmer condemned the violence and plans to chair a Cobra meeting, while authorities have heightened security at Jewish sites.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 09:49:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Huwaida Arraf says the intl community is failing to protect the flotilla &amp; Palestinians under Israel’s genocide in Gaza.",
      "Israel says activists from the Global Sumud Flotilla will be deported to Europe after naval forces stopped most boats bound for Gaza. Turkey and Colombia are among those condemning the interception. Follow DW for more.",
      "The Israeli Navy intercepted the Global Sumud Flotilla from advancing to the Gaza coast. Meanwhile, the Red Cross says Israel's offensive has \"forced\" it to pause activities in Gaza City. DW has more.",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war."
    ],
    "image_url": "",
    "titles": [
      "Israel taking “illegal actions” against Gaza aid flotilla",
      "Middle East: Israel says will deport aid flotilla activists",
      "Middle East: Israel intercepts Gaza aid flotilla",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.952,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Cuts Funding to Dem States Amid Shutdown",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 06:06:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Deutsche Welle",
      "ABC News"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Republicans and Democrats fail to narrow differences on spending bill, as effects of shutdown start showing.",
      "The Trump administration has begun targeting funding projects in Democratic states. And Vice President JD Vance warned that the government might sack federal workers if the shutdown lasts more than a few days.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTh3VTFKSEYxa3hFRVpxN2xuang0cHJGNHVmSkVfaWtKU3F5Y2MtUFVGWndNRGN1d2o4VzdmVFBQTjd5azNYRU1fV2dIeTNKNWp1MWVRWjZleVB4cWFNdWNuamg4U3VpLXlsd253ZERBT2p3R19fNlR0SHducTFCcElKalFOcUtrZDExY3pyZkplSkk?oc=5\" target=\"_blank\">Trump admin uses government ",
      "Vice President JD Vance, while speaking at a White House press briefing, said that he does not think the government shutdown will be long."
    ],
    "image_url": "",
    "titles": [
      "US government shutdown continues, as Trump cuts funds for Democratic states",
      "US shutdown: White House freezes funds for Democratic states",
      "Trump admin uses government sites to blame Democrats for shutdown - Axios",
      "Government shutdown updates: Trump vows to cut 'waste' as shutdown enters 2nd day"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.881,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has started cutting funding for projects in Democratic states amid a government shutdown that began at midnight on Wednesday. With Democrats and Republicans unable to agree on a funding deal, Vice President JD Vance warned of potential layoffs of federal workers if the shutdown extends beyond a few days.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Java School Collapse: 60 Missing, Rescue Shifts to Recovery",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 08:54:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Some families say they&#039;re still holding out hope their loved ones are alive as authorities shift to recovery operation.",
      "Nearly 60 students are still missing after a school collapsed in Java. Rescuers have switched to using heavy machines to clear out debris as the clock is running out to find survivors.",
      "Rescuers saved five more students from under the building on Thursday but said they would end the search three days after the deadly accident."
    ],
    "image_url": "",
    "titles": [
      "‘No signs of life’: Hopes turn to anguish in Indonesia school collapse",
      "Indonesia school collapse: 'No signs of life' detected",
      "No More Signs of Life From Rubble of Collapsed School in Indonesia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nearly 60 students remain missing after a school in Java collapsed. Rescue efforts have transitioned to recovery, with heavy machinery now being used to remove debris. Despite this shift, some families maintain hope for their loved ones' survival. Five students were rescued on Thursday, but authorities plan to conclude the search operations three days post-accident.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 11:23:17 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Four people were injured in a car and stabbing attack on the holiest day in the Jewish religious calendar.",
      "Global Sumud Flotilla had been pressing forward with its mission to break Israel&#039;s siege of Gaza.",
      "The Israeli government said it had detained activists onboard boats trying to take humanitarian goods to the enclave."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5581/live/de8d0720-9f80-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "What we know so far",
      "Israel intercepts Gaza Sumud flotilla vessels: What we know so far",
      "The Global Sumud Flotilla Is Approaching Gaza. Here’s What to Know."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Navy Intercepts Ships with Activists, Including Thunberg, Near Gaza",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 09:57:18 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "South Africa and Turkey have criticised the incident in international waters. Israel says those on board are safe.",
      "At least six ships have been boarded by the Israeli navy so far and more interceptions are expected to take place.",
      "<p>Israeli foreign ministry posts video of Thunberg’s arrest; vessels carrying about 500 activists intercepted about 75 miles off coast of war-torn territory</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/02/gaza-aid-flotilla-greta-thunberg-what-we-know-so-far-israel-interception-"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f5c5/live/96415960-9f5f-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Israel intercepts Gaza flotilla and detains activists including Greta Thunberg",
      "Israeli forces board Gaza flotilla, detain Greta Thunberg, other activists",
      "Gaza aid flotilla: around 40 vessels intercepted by Israeli forces; Greta Thunberg arrested – live"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli navy has intercepted at least six ships carrying around 500 activists, including Greta Thunberg, about 75 miles off the coast of Gaza. Thunberg has been arrested and taken into custody. This action is part of a broader conflict that has resulted in at least 73 Palestinian deaths in Gaza as Israeli forces arrest activists. Further interceptions are anticipated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Eyes Quebec LNG Facility for Europe Exports, Federal Note Reveals",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 11:07:04 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Senior federal officials touted a proposed liquefied natural gas facility in Quebec as having the potential to export “substantial volumes” of LNG to Europe, documents show.",
      "MONTREAL — Senior federal officials touted a proposed liquefied natural gas facility in Quebec as having the potential to export “substantial volumes” of LNG to Europe, documents show. The revelation appears in a federal briefing note prepared in May after Marinvest Energy Canada, a subsidiary of a "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f8b71e167d5a5b85e5dcd3fa91831cb19bda843c7a5471faf1cb834059c1e116.jpg?quality=65&strip=all",
    "titles": [
      "Federal officials were interested in proposed Quebec LNG project, documents show",
      "Federal officials were interested in proposed Quebec LNG project, documents show"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.7,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Senior federal officials in Canada have highlighted a proposed liquefied natural gas (LNG) facility in Quebec for its potential to export significant volumes of LNG to Europe, according to a federal briefing note prepared in May. The facility is associated with Marinvest Energy Canada, a subsidiary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Primatologist Jane Goodall Dies at 91",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-01T18:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CityNews",
      "New Scientist",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.newscientist.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Jane Goodall Institute said the renowned chimpanzee researcher died of natural causes at the age of 91.",
      "Acclaimed conservationist and chimpanzee expert Jane Goodall has died, leaving behind a legacy of empathy for primates and the natural world",
      "Dr. Jane Goodall, one of the world&#8217;s most beloved animal behaviorists and a pioneer in primatology has died at the age of 91, the Jane Goodall Institute confirmed Wednesday. The British scientist, best known for her groundbreaking work with chimpanzees in Tanzania&#8217;s Gombe Stream National"
    ],
    "image_url": "",
    "titles": [
      "Primatologist Jane Goodall has died at the age of 91, her institute has said",
      "Jane Goodall, dogged advocate for the natural world, has died aged 91",
      "Renowned primatologist Dr. Jane Goodall dead at 91"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.69,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jane Goodall, the celebrated primatologist known for her pioneering research on chimpanzee behavior, has died at the age of 91. The Jane Goodall Institute announced she passed away of natural causes during a speaking tour in the US. Goodall, a British scientist, transformed our understanding of apes and was a tireless advocate for the natural world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Payments Unaffected by Shutdown; Neptune Insurance Goes Public",
    "domain": "business",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Wed, 01 Oct 2025 19:29:00 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "www.bbc.co.uk",
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "And what’s behind Trump’s Gaza peace plan?",
      "Social Security benefit payments will still go out on time, according to the agency. But certain services may not be available.",
      "Also: All the news and watercooler chat from Fortune."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Americanswers… on 5 Live! What next after US government shutdown?",
      "What the government shutdown means for Social Security benefits",
      "‘Whoa! Look at this!’ What CEOs are saying about the government shutdown"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.691,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Social Security payments will continue as scheduled despite the government shutdown, which may cause travel delays, park closures, and disruptions in Social Security customer services. Neptune Insurance, the largest private flood insurer in the U.S., went public on the New York Stock Exchange.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canucks Dominate Flames 8-1 in NHL Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 04:00:27 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Quinn Hughes had a goal and two assists, Max Sasson scored twice and the Vancouver Canucks rolled past the Calgary Flames 8-1 on Wednesday in NHL pre-season action.",
      "<p>Quinn Hughes had a goal and three points on the night, Elias Pettersson racked up two points, and the Vancouver Canucks dominated the Calgary Flames 8-1.</p>",
      "<p>Ryan Winterton scored twice, Josh Mahura and Eeli Tolvanen added goals of their own, and Joey Daccord made 32 saves to elevate the Seattle Kraken to a 4-2 victory over the Edmonton Oilers.</p>",
      "<p>Cutter Gauthier, Frank Vatrano, Beckett Sennecke, Sam Colangelo and Yegor Sidorov all scored while Calle Clang finished with 26 saves as the Anaheim Ducks defeated the San Jose Sharks 5-2.</p>",
      "<p>William Karlsson and Brett Howden each scored while Akira Schmid allowed just one goal on 22 shots as the Vegas Golden Knights went on to defeat the Colorado Avalanche 2-1.</p>",
      "<p>Filip Hollander and Matthew Dumba tallied a goal and an assist each, and Arturs Silovs made 27 saves as the Pittsburgh Penguins defeated the Buffalo Sabres 5-3.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f84df23f094608626a4b31a281dbf2df8a194695c62e016a23b580ad66a4a292.jpg?quality=65&strip=all",
    "titles": [
      "Canucks thump Flames 8-1 in pre-season action",
      "NHL Pre-Season Highlights: Canucks 8, Flames 1",
      "NHL Pre-Season Highlights: Kraken 4, Oilers 2",
      "NHL Pre-Season Highlights: Ducks 5, Sharks 2",
      "NHL Pre-Season Highlights: Golden Knights 2, Avalanche 1",
      "NHL Pre-Season Highlights: Penguins 5, Sabres 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In an NHL pre-season game on Wednesday, the Vancouver Canucks decisively defeated the Calgary Flames 8-1. Quinn Hughes contributed significantly with a goal and two assists, while Max Sasson scored twice for the Canucks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gen Z Protests in Morocco, Another African Nation Demand Reforms",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 05:01:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "Gen Z-led protests in two diverse African countries highlight frustration over years of poor governance. Fueled by social media, these youth movements are demanding accountability.",
      "Young people in Morocco are frustrated with social inequalities and demanding better education and health care."
    ],
    "image_url": "",
    "titles": [
      "From Madagascar to Morocco: Gen Z protests shake Africa",
      "Morocco: Gen Z protests turn violent, two killed"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gen Z-led protests in Morocco and another African country are driven by frustration over poor governance. Activists, using social media for mobilization, demand accountability, better education, and health care. These movements highlight the youth's demand for social equality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gov Shutdown Continues: Both Parties Blame Each Other, VP Misleads on Cause",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 10:40:51 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "As a bitter standoff between Republicans and Democrats plays out, there is little sign that either side is willing to budge.",
      "<p>Democrats reject ‘Republican lies’ as both parties try to pin the shutdown blame on each other. Plus, Israeli naval forces board pro-Palestinian flotilla</p><p>Good morning.</p><p>The vice-president, JD Vance, used false claims to blame Democrats for the government shutdown as the White House war",
      "<p>Vice-president falsely says Democrats calling for billions for ‘healthcare for illegal aliens’ as funding deadlock continues</p><p>JD Vance, the US vice-president, used false claims to blame Democrats for the government shutdown as the White House warned that worker layoffs were imminent.</p><p>F"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/778f/live/c54a8ea0-9f16-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "White House says layoffs 'imminent' with no end to shutdown in sight",
      "Vance uses false claims to blame shutdown on Democrats as White House touts imminent layoffs | First Thing",
      "Vance uses false claims to pin shutdown blame on Democrats as White House warns of layoffs"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the midst of a government shutdown, Republicans and Democrats are locked in a standoff, with neither side showing willingness to compromise. Vice-President JD Vance falsely blamed Democrats for the shutdown, accusing them of demanding billions for healthcare for undocumented immigrants. Meanwhile, both parties are attempting to shift the blame onto each other, as the White House warns of impending worker layoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yamamoto's 9 Ks Propel Dodgers to NLDS, Ohtani to Debut vs Phillies",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 00:39:41 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Yoshinobu Yamamoto struck out nine to lead the Dodgers past the Reds and into the NLDS, where Shohei Ohtani will start the opener against the Phillies.",
      "<p>Shohei Ohtani&#8217;s post-season pitching debut will come in Game 1 of the NLDS.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yamamoto puts L.A. in NLDS; Ohtani to start G1",
      "Dodgers’ Shohei Ohtani to start Game 1 of NLDS on mound"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Yoshinobu Yamamoto led the Dodgers to victory over the Reds with nine strikeouts, advancing them to the NLDS. Shohei Ohtani is set to make his post-season pitching debut in Game 1 against the Phillies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chisholm Jr. Leads Yankees to 4-3 Win Over Red Sox, Forces Game 3",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 00:39:41 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "One day after he was benched, Jazz Chisholm turned in a season-saving performance for the Yankees, making a run-saving play with his glove and scoring the tiebreaking run in Wednesday's do-or-die Game 2 against the Red Sox.",
      "<p>After being upset that he wasn&#8217;t in the lineup for Game 1, Jazz Chisholm Jr. came back and had his fingerprints over the Yankees&#8217; Game 2 win on Wednesday.</p>",
      "<p>Ben Rice went 2-for-4 with a solo shot in his first postseason appearance, and Austin Wells knocked in the game-winning run in the eighth inning as the New York Yankees defeated the Boston Red Sox 4-3, to force a winner-take-all Game 3.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chisholm turns page, saves Yanks to force Game 3",
      "Chisholm Jr. shakes off frustration, leads Yankees past Red Sox to force Game 3",
      "MLB Game 2 Highlights: Yankees 4, Red Sox 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jazz Chisholm Jr. delivered a crucial performance in Game 2 for the Yankees, making a key defensive play and scoring the tiebreaking run in a 4-3 victory over the Red Sox. This win, following his benching in Game 1, helped the Yankees force a decisive Game 3. Ben Rice and Austin Wells also contributed significantly, with Rice hitting a solo homer and Wells driving in the game-winning run.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xavien Howard, 32, Retires from NFL Days After Criticized Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 00:39:41 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Veteran cornerback Xavien Howard, 32, informed the Colts of his decision to retire just days after his much-criticized performance against the Rams.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxQMmlxd1huLUhKWHZQT2xaMTRXMHEyWE10a0htN1pXS3JjcHJpSkduX2VPelFncnhpMjR6b3h4THJHRmVwVnFkM0FGdjBRR1lLSjFmbGRQNzdxc21VN2hmeTU2c0FSUUszUmtJV1cwQlEzeEFnTFJPX2tJNXgxWEdSbzhmcUtQUzQwcGNGNFdZaGZXSE85dXhCcUp2RUFyRTQ?oc=5\" target=\"_blank\">Colts CB Xav"
    ],
    "image_url": "",
    "titles": [
      "Colts' Howard abruptly retires, says 'family first'",
      "Colts CB Xavien Howard Abruptly Retires After Rough Game vs. Puka Nacua, Rams - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Veteran cornerback Xavien Howard, aged 32, has announced his retirement from professional football, just days following a criticized performance against the Rams. This decision was communicated to his team, the Colts, marking the end of his career in the NFL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nashville SC Wins First U.S. Open Cup, Beats Austin FC 2-1",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 00:39:41 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Nashville SC beat Austin FC 2-1 in final of the U.S. Open Cup on Wednesday night at Q2 Stadium to win the team's first-ever major trophy.",
      "A narrow win on the road gave Nashville the title, their first as a club"
    ],
    "image_url": "",
    "titles": [
      "Nashville lifts 1st major trophy with Open Cup win",
      "Nashville SC edge Austin FC to win first U.S. Open Cup in club history and Tennessee's first pro sports trophy"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nashville SC won their first major trophy by defeating Austin FC 2-1 in the U.S. Open Cup final on Wednesday night at Q2 Stadium. Sam Surridge scored the decisive goal with a penalty in the 60th minute, securing the victory for Nashville in the historic knockout tournament, which has been held since 1914.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Buffett's Berkshire Acquires OxyChem for $9.7B in Potential Final Deal",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 11:33:35 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "financialpost.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Warren Buffett is staying active even as he gets ready to hand over the CEO reins at the end of this year.",
      "OMAHA, Neb. (AP) &#8212; Warren Buffett announced his biggest deal in years Thursday with Berkshire Hathaway&#8217;s $9.7 billion acquisition of Occidental Petroleum&#8217;s chemical division. The deal for OxyChem could be Buffett&#8217;s last big deal before he hands over the CEO title to Vice Chai"
    ],
    "image_url": "",
    "titles": [
      "Berkshire Hathaway to buy Occidental's OxyChem for $9.7 billion, in Buffett's biggest deal in three years",
      "Buffett’s Berkshire Hathaway to pay $9.7 billion for Occidental Petroleum’s OxyChem"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Warren Buffett, nearing the end of his tenure as CEO, announced Berkshire Hathaway's acquisition of Occidental Petroleum's chemical division, OxyChem, for $9.7 billion. This significant transaction, possibly his last major deal as CEO, underscores Buffett's ongoing active role in the company's major decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chelsea Qualifies for Champions League Amid Fan-Leadership Tensions",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 11:27:04 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Chelsea are back in the Champions League, but relations between parts of the fanbase and the club hierarchy have turned sour.",
      "Chelsea are back in the Champions League, but relations between parts of the fanbase and the club hierarchy have turned sour."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4ea3/live/c8cd74d0-9a29-11f0-b7a7-6962c574e78f.jpg",
    "titles": [
      "Tickets, bots & touts - is Chelsea relationship with fans turning sour?",
      "Tickets, bots & touts - is Chelsea relationship with fans turning sour?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chelsea has secured a spot in the Champions League, but tensions have risen between some fans and the club's leadership. The situation remains strained as both sides navigate their differences.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "F1 Singapore Grand Prix Declared 'Heat Hazard' Amid 31C Forecast",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 11:26:31 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Formula 1's governing body declares this weekend's Singapore Grand Prix a 'heat hazard' race with temperatures expected to reach 31C.",
      "Formula 1's governing body declares this weekend's Singapore Grand Prix a 'heat hazard' race with temperatures expected to reach 31C."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8207/live/df9be340-9f79-11f0-9ccd-4dc2d8fa5ad2.jpg",
    "titles": [
      "Singapore GP declared F1's first 'heat hazard' race",
      "Singapore GP declared F1's first 'heat hazard' race"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Formula 1's governing body declares this weekend's Singapore Grand Prix a 'heat hazard' race with temperatures expected to reach 31C.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Force Game 3 Against Red Sox; Chisholm Proves Point with Key Performance",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 05:37:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.pinstripealley.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "A win against the Red Sox Wednesday night forced a do-or-die Game 3",
      "After riding the pine on Tuesday, the rookie phenom’s first-inning blast was a statement of intent."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/1b3c9dcc-03e5-48ae-8de3-fcd123571de5/jazz-getty.png",
    "titles": [
      "Jazz Chisholm Jr., Ben Rice help Yankees stave off MLB playoff elimination in Game 2 after sitting Game 1",
      "Ben Rice set the tone for the Yankees with his big homer to begin elimination Game 2"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Yankees forced a decisive Game 3 against the Red Sox after winning Wednesday night. Jazz Chisholm Jr., who did not start in the opener, played a crucial role in Game 2's victory. Chisholm's performance underscored his belief that he should have been in the lineup for Game 1, proving his point to manager Aaron Boone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Mulls \"Drone Wall\" for Eastern Border Security Boost",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 05:39:08 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A series of airspace violations allegedly involving Russian jets or drones have been reported in recent weeks.",
      "The European Union is talking about shoring up defenses in its eastern airspace. Recent Russian drone incursions have lent urgency to the project."
    ],
    "image_url": "",
    "titles": [
      "‘We stand ready’: Defense giants welcome Europe’s push to build a drone wall to repel Russia",
      "What Is Europe’s ‘Drone Wall’?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "EU leaders are discussing implementing new defense measures, including a \"drone wall\" near the Russian border, to strengthen eastern Europe's airspace. This comes in response to recent Russian drone incursions, highlighting the urgency of enhancing security in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Criticized for Bad Bunny Super Bowl Choice, Trump Official Suggests ICE Pres",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 02:48:45 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE95NUtINmxkUlliMzFCZTV6QV8zSkdyRDV3WllfOEdOWFdIUnlpeGRkVW93U25sYWl6VDZDRGQwZ0RZdkNGd3l6ZUs0RjhnaV93Z3NVc3NTMHAzemVFekRvN1Z5cUNKQmFPYXJnZ0Z2RkhCNXM?oc=5\" target=\"_blank\">Bad Bunny could see ICE at Super Bowl show, Trump official suggests</a>&",
      "The NFL received right-wing backlash from its decision to have Bad Bunny headline its Super Bowl halftime show."
    ],
    "image_url": "",
    "titles": [
      "Bad Bunny could see ICE at Super Bowl show, Trump official suggests - Axios",
      "ICE Will Be On Patrol At Bad Bunny’s ‘Shameful’ Super Bowl Halftime Show, Trump Adviser Says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.805,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The NFL faced criticism for choosing Bad Bunny to headline the Super Bowl halftime show. A Trump official suggested ICE could be present at the event. The outcome of this situation is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Northern Irish Designer Debuts at Dior, Unites Collections at Paris Fashion Week",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 17:15:51 GMT",
    "source": "The Guardian",
    "sources": [
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>All eyes were on the Northern Irish designer’s debut – not just to reinvent Dior, but to jolt fashion itself out of its slump</p><p>It was the biggest Paris fashion week moment in years. There were two best actress Oscar winners in the audience (Mikey Madison, Charlize Theron) and the daughter of",
      "In unifying Dior women's and men's collections into a cohesive whole, Anderson has vastly strengthened brand identity making for increased brand equity."
    ],
    "image_url": "https://i.guim.co.uk/img/media/0cbda7dcc41269294e847b6f4a8110af5247b9e3/505_0_2743_2194/master/2743.jpg?width=140&quality=85&auto=format&fit=max&s=85cf79001647ed1aa2b51dd35c5b7d1f",
    "titles": [
      "‘Dior is drama’: Jonathan Anderson goes for the jugular at Paris fashion week",
      "Dior Under Jonathan Anderson, Decrypted And Unboxed"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.66,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.587,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At Paris Fashion Week, Northern Irish designer's debut for Dior, aimed at revitalizing the brand and the fashion industry, was highly anticipated. The event, attended by Oscar winners Mikey Madison and Charlize Theron, marked a significant moment as the designer successfully merged Dior's women's and men's collections, enhancing the brand's identity and equity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Samsung, SK Hynix Partner to Boost AI Chips, Stocks Surge",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 08:46:31 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "The partnership will \"focus on increasing the supply of advanced memory chips essential for next-generation AI and expanding data center capacity in Korea.\"",
      "Heavyweight Samsung Electronics and SK Hynix soared over 4% and 11%, respectively."
    ],
    "image_url": "",
    "titles": [
      "SK Hynix shares hit 25-year high, Samsung also surges as chipmakers partner with OpenAI",
      "South Korea's Kospi hits record high as Samsung and SK Hynix soar on OpenAI partnership"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.912,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.457,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Samsung Electronics and SK Hynix announced a partnership aimed at boosting the supply of advanced memory chips for AI and expanding data center capacity in Korea. Following the announcement, Samsung's stock rose over 4%, while SK Hynix's stock increased by more than 11%.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Mandates AI Safety Transparency, First State to Do So",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 20:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "“Are bills like SB 53 the thing that will stop us from beating China? No,” said Adam Billen, vice president of public policy at youth-led advocacy group Encode AI. “I think it is just genuinely intellectually dishonest to say that that is the thing that will stop us in the race.”",
      "California just made history as the first state to require AI safety transparency from the biggest labs in the industry. Governor Newsom signed SB 53 into law this week, mandating that AI giants like OpenAI and Anthropic disclose, and stick to, their safety protocols. The decision is already sparkin"
    ],
    "image_url": "",
    "titles": [
      "California’s new AI safety law shows regulation and innovation don’t have to clash",
      "Why California’s new AI safety law succeeded where SB 1047 failed"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.713,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California has become the first state to mandate AI safety transparency from major labs, with Governor Newsom signing SB 53 into law. This requires companies like OpenAI and Anthropic to disclose their safety protocols. Adam Billen from Encode AI commented that attributing the slowing of U.S. competitiveness with China to such laws is \"intellectually dishonest.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]