[
  {
    "title": "6.9 Earthquake in Philippines Kills 60, Injures 140 in Cebu and Bogo",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 04:37:45 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR",
      "New York Times",
      "Washington Post",
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "abcnews.go.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The death toll was expected to rise from the Tuesday magnitude-6.9 earthquake that trapped an unspecified number of residents in the hard-hit city of Bogo and outlying rural towns in Cebu province.",
      "Local authorities say nearly 70 people have been killed and hospitals in the Cebu province are overwhelmed.",
      "A powerful earthquake has struck Cebu in the central Philippines, collapsing homes and businesses.",
      "Injured patients have overwhelmed the main hospital in Bogo city where children and adults were seen screaming while receiving treatment in the driveway.",
      "Rescuers are using backhoes and sniffer dogs to look for survivors in collapsed houses and other damaged buildings in the central Philippines, a day after an earthquake killed at least 69 people",
      "A 6.9-magnitude earthquake struck the central Philippines, damaging numerous businesses and leaving towns without power. Casualty numbers are expected to rise",
      "The 6.9-magnitude earthquake shook the province of Cebu, killing at least 69 people and injuring more than 150. Heavy rainfall has hampered rescue efforts."
    ],
    "image_url": "",
    "titles": [
      "Dozens killed in a powerful earthquake that hit the Philippines",
      "Deadly earthquake hits Philippines: What we know so far",
      "Videos capture 6.9 magnitude earthquake as it hits the Philippines",
      "Philippines hit by 6.9 magnitude earthquake, dozens dead",
      "At least 69 people killed in a powerful earthquake that hit the Philippines",
      "Powerful earthquake in central Philippines kills at least 69",
      "Earthquake in Philippines Kills Dozens, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.927,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.855,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.9 earthquake hit central Philippines, affecting the province of Cebu and the coastal city of Bogo, resulting in at least 60 deaths and over 140 injuries, according to a civil defence official. The quake caused widespread power outages, building and road damage, and hampered rescue operations due to heavy rainfall. Rescuers continue to search for survivors amidst the debris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oktoberfest Closed Temporarily After Bomb Threat, Police Investigate Link",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 10:05:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Washington Post",
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Police are investigating whether an explosion in northern Munich is linked to the popular beer festival.",
      "Germany's world-famous Oktoberfest beer festival is closed until the evening as police look into a bomb threat. Munich authorities earlier linked the festival site to a private house fire. DW has the latest.",
      "Police in the southern German city of Munich said the famous Oktoberfest event would be closed until Wednesday afternoon.",
      "Authorities said the threat to the annual beer celebration could be related to an explosion that occurred at a house in northern Munich.",
      "The German authorities said the rare decision was taken after an earlier explosion in a residential area of the city."
    ],
    "image_url": "",
    "titles": [
      "Munich’s world-famous Oktoberfest suspended in Germany after ‘bomb threat’",
      "Germany news: Oktoberfest on hold after bomb threat",
      "Munich Oktoberfest closed after bomb threat and deadly explosion, police say",
      "Bomb threat temporarily closes Oktoberfest in Munich",
      "Oktoberfest Closed Because of Bomb Threat in Munich"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.956,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.82,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oktoberfest in Munich was temporarily closed due to a bomb threat, as police investigate a possible link between an explosion in a northern Munich residential area and the world-famous beer festival. Authorities have decided to shut down the event until Wednesday afternoon for safety reasons, following the incident at a private house. The festival is expected to reopen later in the evening.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia School Collapse Kills 3, Injures 100 During Prayer",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 07:00:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The BBC reports from a nearby centre as rescuers race to find 38 people believed to still be trapped.",
      "Indonesia's disaster management agency said at least six children are still alive under the rubble, as workers race against time to save lives.",
      "<p>Desperate search for more than 90 missing after building collapses while students held prayers at school in Sidoarjo</p><p>Parents and rescuers in Indonesia were desperately searching for dozens of teenage boys believed to be trapped, a day after the collapse of an Islamic boarding school which h",
      "<p>Instability of building in East Java town hampers search but 99 boys and school staff known to have survived</p><p>Parents were desperately searching for scores of missing teenage boys feared trapped under huge piles of concrete on Tuesday after a building at an Islamic boarding school collapsed ",
      "Workers rushed to free potential survivors two days after an Islamic boarding school collapsed during a prayer service, killing at least three students.",
      "At least three children were killed and about 100 injured after an Islamic boarding school collapsed during a prayer service, officials said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/39b0/live/ce231ea0-9e91-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Watch: Families in anxious wait for students trapped under collapsed school in Indonesia",
      "Indonesia school collapse: Over 90 students still trapped",
      "Indonesia school collapse: 91 missing and three dead as rescuers search rubble for second day",
      "Indonesia school collapse: three dead and over 90 missing as rescue effort continues",
      "Time Running Out for Trapped Students After School Collapse in Indonesia",
      "Dozens of Students Are Missing After School Collapses in Indonesia"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.878,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A school building in Indonesia collapsed during prayer time, resulting in at least three children dead and approximately 100 injured. The incident occurred at an Islamic boarding school. Rescue efforts were temporarily halted due to the risk of further collapse as authorities and rescuers work to find survivors and recover bodies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shuts Down Amid Congressional Deadlock",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 07:14:41 -0400",
    "source": "NPR",
    "sources": [
      "Phys.org",
      "ABC News",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com",
      "phys.org"
    ],
    "snippets": [
      "The federal government has shut down for the first time since 2019. Mass layoffs have been threatened. And, President Trump announced a pricing deal with Pfizer.",
      "The federal government officially entered a shutdown at 12:01 a.m. Wednesday amid an impasse on Capitol Hill over competing congressional spending bills.",
      "The federal government is officially shut down. ABC News' Jay O'Brien explains how we got here.",
      "The U.S. government faces a shutdown on Oct. 1 unless Congress passes a spending bill to keep the government funded."
    ],
    "image_url": "",
    "titles": [
      "What happens now that the government has shut down. And, a pricing deal with Pfizer",
      "The US government has shut down. Here's what to know",
      "WATCH:  The US government has shut down for the first time in nearly 7 years",
      "Q&A: What happens during a government shutdown?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.979,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. federal government officially shut down at 12:01 a.m. Wednesday due to a deadlock in Congress over spending bills. This marks the first government shutdown since 2019. Amidst the shutdown, President Trump announced a pricing deal with Pfizer. The shutdown threatens mass layoffs unless resolved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan's Internet Severed, Disrupting Communication Amid Ban Denials",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 10:23:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The hardline rulers have previously announced local blackouts as part of attempts to combat &#039;immoral activities&#039;.",
      "Two weeks after the Taliban signaled plans to ban fiber-optic internet, nearly all links to the outside world are cut. But regime denied it is a “ban on the internet.”",
      "<p>From the safety of Australia, I watch in despair as my loved ones in Kabul navigate this digital darkness – a calculated effort to silence dissent </p><p></p><p>The internet was my lifeline, a slender thread connecting me from Australia to my family in Afghanistan, bridging continents and time zo"
    ],
    "image_url": "",
    "titles": [
      "The Taliban rejects reports of nationwide internet ban in Afghanistan",
      "Taliban’s ongoing internet shutdown paralyzes Afghanistan",
      "My calls and emails to family in Afghanistan go unanswered. The Taliban’s internet shutdown has left us all helpless | Shadi Khan Saif"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.962,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two weeks after the Taliban hinted at restricting fiber-optic internet to combat 'immoral activities,' almost all external internet connections in Afghanistan have been severed, despite the regime's denial of an internet ban. This move has significantly impacted communication, isolating individuals and stifling dissent, as described by a person observing from Australia who has lost their digital connection to family in Kabul.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jannik Sinner Wins China Open, Secures Season's Third Title",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 08:13:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sky Sports",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Sinner rebounds from his recent US Open final defeat to Carlos Alcaraz with a third title of the season in Beijing.",
      "<ul><li><p>Italian swats aside American Learner Tien 6-2, 6-2</p></li><li><p>24-year-old’s first title on the regular tour this season</p></li></ul><p>Jannik Sinner continued to piece together one of the greatest seasons of his career as he clinched his 21st career title at the China Open with a com",
      "Jannik Sinner secured his second China Open title in three years and third tournament victory of 2025 with a straight-sets win over a game Lerner Tien in Beijing."
    ],
    "image_url": "",
    "titles": [
      "Jannik Sinner beats Learner Tien to win China Open final",
      "Jannik Sinner clinches first title since Wimbledon with China Open triumph",
      "Sinner defeats game Tien to win second China Open title"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jannik Sinner won his third title of the season and his second China Open in three years by defeating Learner Tien 6-2, 6-2 in Beijing. This victory marks the Italian's 21st career title and his first on the regular tour this season, rebounding from a recent US Open final loss to Carlos Alcaraz.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Leigh Leopards Withdraw from Semi-Final Over Ticket Dispute",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 11:42:53 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Wigan say that Leigh Leopards have informed them they \"do not intend to fulfil\" Friday's Super League play-off semi-final.",
      "Wigan say that Leigh Leopards have informed them they &quot;do not intend to fulfil&quot; Friday's Super League play-off semi-final.",
      "Wigan Warriors have claimed Leigh Leopards do not intend to fulfil Friday's Super League semi-final due to a dispute over ticket allocation."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c33e/live/adedcd70-9ea9-11f0-9d1f-e7d83132d3ab.jpg",
    "titles": [
      "Leigh 'do not intend to fulfil' Wigan semi-final",
      "Leigh 'do not intend to fulfil' Wigan semi-final",
      "Wigan claim Leigh pull out of semi-final over ticket dispute"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.968,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Leigh Leopards informed Wigan Warriors they will not participate in the Super League play-off semi-final scheduled for Friday, according to Wigan. The decision is reportedly due to a dispute over ticket allocation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Shutdown Begins After Funding Impasse",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-01T04:05:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "The US federal government has shut down after Democrats and Republicans failed to agree on a stopgap funding bill. Follow DW for more.",
      "Capitol Hill impasse threatens hundreds of thousands of jobs and billions of dollars in lost economic output",
      "<p>Democrats accuse Republicans of ‘risking America’s healthcare’ in spending bill. Plus, Trump says military should use US cities as training grounds</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get ",
      "<p>First shutdown in nearly seven years as Republicans accused of ‘risking America’s healthcare’ in spending bill</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news\">US g"
    ],
    "image_url": "",
    "titles": [
      "US federal government shuts down amid funding standstill",
      "US government shuts down as lawmakers fail to reach deal",
      "First Thing: US government shuts down after Democrats refuse to back Republican funding plan",
      "US government shuts down after Democrats refuse to back Republican funding plan"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US federal government has entered its first shutdown in nearly seven years due to a failure between Democrats and Republicans to agree on a stopgap funding bill. This impasse threatens hundreds of thousands of jobs and significant economic output. Democrats have accused Republicans of jeopardizing healthcare in the spending bill, amidst discussions by Trump on military use of US cities for training.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Shuts Down Over Funding Dispute",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 04:30:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The shutdown comes as Republicans fail to reach deal with Democrats concerned by steep hikes in health insurance costs.",
      "The US government has officially shut down after lawmakers couldn't agree on a funding deal. Who is impacted when the government can't pay its bills? Could the Trump administration use it as an excuse for more layoffs?",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5HZHNXQVlPVGdlc3dJQ05yRk96MU1ZeEluMHJ5clV1Q2RUM1ptbU4ySEhwWDRXcUdBUzd2Um4wdV9zZ01wb1g0dUFxTlFjcjZmdUxyR0F4X0tiT0ZWVnA3clNHSndkZVpDVFVUaGIyam9aOUVXWFNORHV5TlI?oc=5\" target=\"_blank\">What a government shutdown will likely mean for national par"
    ],
    "image_url": "",
    "titles": [
      "LIVE: US government shutdown starts as Trump threatens mass layoffs",
      "US government shutdown: What happens and who's affected?",
      "What a government shutdown will likely mean for national parks - Axios"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US government has officially shut down due to a failure to reach a funding agreement, primarily over disagreements on health insurance costs. This impasse resulted from Republicans and Democrats not coming to terms. The shutdown impacts government operations and raises concerns about potential layoffs and the effects on national parks and services.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crochet Leads Red Sox to Victory Over Yankees in AL Wild Card Game 1",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 03:53:07 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Crochet retired 17 batters in a row after allowing a solo home run as the Red Sox took Wild Card Series Game 1",
      "Garrett Crochet dominated the Yankees in Boston's win in Game 1 of the AL wild-card series",
      "<p>Caleb Joseph breaks down how Boston Red Sox&#8217;s Garrett Crochet and Aroldis Chapman shut down the Yankees lineup in Game 1.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/01/a70c83c5-5522-4cdf-87c3-eccaaf32b1a3/crochet-getty.png",
    "titles": [
      "Red Sox ace Garrett Crochet stifles Yankees, saving his best for last in first playoff start",
      "Red Sox Watch Garrett Crochet Dominate And Get To The Eighth Inning With Ease Against Yankees",
      "How Red Sox’s Crochet silenced the Yankees in first post-season start"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Garrett Crochet of the Boston Red Sox retired 17 consecutive batters following a solo home run, leading to a victory over the New York Yankees in Game 1 of the AL Wild Card Series. Crochet's performance, alongside Aroldis Chapman, was pivotal in shutting down the Yankees' lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Five Canadian Provinces Raise Minimum Wage Amid Inflation Concerns",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 01 Oct 2025 08:04:14 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Five provinces are increasing their minimum wage today to support workers amid affordability issues.",
      "Five provinces are increasing their minimum wage today to support workers amid affordability issues. The hikes will apply to Ontario, Manitoba, Saskatchewan, Nova Scotia and Prince Edward Island. The provinces have tied their increases to Canada&#8217;s steadily growing consumer price index, which i"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/9c1118806b9ab5968d8298643cbe413d18565bb48d29ae2e519cb8a39d8590b3.jpg?quality=65&strip=all",
    "titles": [
      "Five provinces boost minimum wage, Alberta lowest",
      "Five Canadian provinces boost their minimum wage, Alberta now lowest"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.916,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Today, Ontario, Manitoba, Saskatchewan, Nova Scotia, and Prince Edward Island are raising their minimum wage to help workers cope with affordability challenges. These increases are linked to Canada's rising consumer price index, reflecting a response to inflation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Develop Technique to Create Eggs from Skin Cells for Infertility Trea",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 03:58:03 GMT",
    "source": "Axios",
    "sources": [
      "Phys.org",
      "Axios",
      "Wired"
    ],
    "domains": [
      "news.google.com",
      "www.wired.com",
      "phys.org"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFBPWUgxZ2JoczhjdnB3cGRpQmw0YW1uWTMydG9lbjhVYmhXOFpCSmpmaGJQU2xSMmc0YlBOVnBfRE1IaG1nLVpLeExJXzUtWDVuWWs4aEx5a0cyUDZOOW1XLWRtZi1EY3Y3TElUZDRjdjNtZDBZNl9OSl84VHVkdw?oc=5\" target=\"_blank\">Scientists turn human skin cells into \"functional\" eggs</",
      "The embryos weren’t used to try to establish a pregnancy, but the researchers behind the technique say it could one day be used to address infertility.",
      "Scientists said Tuesday they have turned human skin cells into eggs and fertilized them with sperm in the lab for the first time—a breakthrough that is hoped to one day let infertile people have children."
    ],
    "image_url": "",
    "titles": [
      "Scientists turn human skin cells into \"functional\" eggs - Axios",
      "Scientists Made Human Eggs From Skin Cells and Used Them to Form Embryos",
      "Human skin cells turned into fertilisable eggs for first time"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have developed a technique to create eggs from the DNA of adult skin cells, offering a potential future treatment for infertility. This method could also enable gay couples to have genetically related children. However, the embryos created were not used to attempt pregnancy. The researchers believe this approach could one day help address infertility issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Security Council Votes to Expand Haiti Mission with 5,500 Troops",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 20:11:39 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Unit will have up to 5,500 soldiers and police officers who will tackle the violence that has overwhelmed the country</p><p>The United Nations has adopted a resolution to transform a security mission in gang-dominated Haiti into a larger, fully fledged force with military troops.</p><p>The new un",
      "The Security Council vote was an acknowledgment that the police mission it once backed had failed to wrest back control of the beleaguered Caribbean nation.",
      "The vote on Tuesday would establish a force of up to 5,500 soldiers and police officers. It was unclear what countries were willing to contribute personnel or money."
    ],
    "image_url": "https://i.guim.co.uk/img/media/e6dd4a78b46089079d5287720264c35c3ab7e64b/371_0_4333_3466/master/4333.jpg?width=140&quality=85&auto=format&fit=max&s=98c9f2339c883ff5a89605094fa6c7f4",
    "titles": [
      "UN security council approves new military force to fight Haiti gangs",
      "U.N. approves militarized force to take on Haiti’s gangs",
      "U.N. Security Council Approves Larger Force to Fight Gangs in Haiti"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.701,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.684,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United Nations Security Council has voted to expand a security mission in Haiti into a larger force with up to 5,500 soldiers and police officers. This decision aims to neutralize, isolate, and deter gangs that have overwhelmed the country. The move acknowledges the failure of the previous police mission to control the situation in Haiti. However, the contributing countries and funding details remain unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:42:02 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOeHlpLWZjbFpUazZha2YxampoeWJfUktad1haSV9tMC1LdTZjNVdqUkR1OElXbmxkeG9uODl3MGlMUFBuTDlwQnJPbzRpMG02MGdKakVDcjUzY1RoVFFSVTlYcC1VSTl5dFYwUDNCTlVkOXZnTUJhZjRuNWxjdGJULU1MODFjRWNKaGc?oc=5\" target=\"_blank\">Qatar, Egypt and Turkey urge Hamas to ac",
      "The Israeli premier’s reluctance to fully withdraw troops or make way for a Palestinian state, combined with Hamas’s reluctance to disarm, may result in a fragile deal, analysts say.",
      "It would end the war and secure the release of all hostages. Hamas would give up its arms and its power, while a transitional government is set up. Hamas has not agreed and the terms will be hard for it to swallow."
    ],
    "image_url": "",
    "titles": [
      "Qatar, Egypt and Turkey urge Hamas to accept Trump's Gaza peace plan - Axios",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "Trump’s Gaza Plan: What We Know"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.694,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' Saleh Admits Misstep in Words Against Jaguars' Coach After Loss",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 07:21:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "San Francisco 49ers defensive coordinator Robert Saleh told reporters on Tuesday that he \"could have found a better choice of words\" during his argument with Jacksonville coach Liam Coen on Sunday, following the Jaguars' 26-21 victory at Levi's Stadium.",
      "<p>San Francisco 49ers defensive coordinator Robert Saleh said Tuesday his choice of words was poor when he said Jacksonville coach Liam Coen&#8217;s staff was elite at sign-stealing in a legal fashion.</p>"
    ],
    "image_url": "",
    "titles": [
      "Saleh rues 'wrong choice of words' in Coen spat",
      "Saleh regrets ‘bad choice of words’ in sign-stealing comment about Jags"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "San Francisco 49ers defensive coordinator Robert Saleh admitted to poorly choosing his words during a dispute with Jacksonville coach Liam Coen after the Jaguars' 26-21 win on Sunday. Saleh had accused Coen's staff of being exceptionally good at legally stealing signs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crochet Leads Red Sox to 3-1 Win Over Yankees in AL Wild Card Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 07:21:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Boston ace Garrett Crochet pitched into the eighth inning on Tuesday night, at one point retiring 17 consecutive batters, in a sparkling pitching performance that sent the visiting Red Sox past the New York Yankees 3-1 in their AL Wild Card Series opener.",
      "<p>If Garrett Crochet wasn&#8217;t already a household name in baseball, that should change after his starmaking performance on Tuesday in the Bronx.</p>"
    ],
    "image_url": "",
    "titles": [
      "Crochet retires 17 straight as Red Sox swipe G1",
      "Crochet authors star-making performance as Red Sox take Game 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Garrett Crochet led the Boston Red Sox to a 3-1 victory over the New York Yankees in the AL Wild Card Series opener by pitching into the eighth inning and retiring 17 consecutive batters. His standout performance in the game has elevated his status in baseball.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kimmel, Colbert Host Crossover Event; Discuss Shows' Futures",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 05:27:47 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com"
    ],
    "snippets": [
      "On Tuesday night, in New York City, they united in a special talk show crossover of <em>Jimmy Kimmel Live!</em> on ABC and <em>The</em> <em>Late Show with Stephen Colbert</em> on CBS.",
      "Kimmel described his show’s suspension as an “emotional roller coaster” while Colbert discussed how he learned that his show had been canceled."
    ],
    "image_url": "",
    "titles": [
      "Kimmel and Colbert appear as guests on each other's shows",
      "‘A Fun Way To Drive The President Nuts’: Kimmel And Colbert Appear On Each Other's Shows"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Tuesday night in New York City, Jimmy Kimmel and Stephen Colbert participated in a unique crossover event between their respective talk shows, <em>Jimmy Kimmel Live!</em> on ABC and <em>The Late Show with Stephen Colbert</em> on CBS. During the event, Kimmel opened up about the \"emotional roller coaster\" of his show's suspension, while Colbert shared his experience of learning about his show's cancellation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Strikes Deal to Lower U.S. Drug Prices",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 07:11:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "US consumers not expected to start seeing lower prices under the Pfizer deal until 2026.",
      "The deal comes after Trump sent letters to Pfizer and 16 other drugmakers calling on them to take steps to lower drug prices by Sept. 29."
    ],
    "image_url": "",
    "titles": [
      "Pfizer strikes deal with Trump administration to cut US drug prices",
      "Trump, Pfizer agree to lower U.S. drug prices, exempt company from pharma tariffs"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration announced a deal with Pfizer and other drugmakers aimed at lowering U.S. drug prices. Details on how the initiative will work are unclear, but it follows Trump's letters to 17 drug companies urging price reductions by Sept. 29. The outcome or effectiveness of this agreement remains unspecified.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government to Acquire 5% Stake in Lithium Americas for Nevada Project",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 09:11:22 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "U.S. Energy Secretary Chris Wright told Bloomberg TV that the U.S. government will take a 5% stake in the company.",
      "The U.S. Department of Energy has taken equity stakes in Canadian company Lithium Americas and its Nevada mining joint venture with General Motors as part of a renegotiation of a federal loan. Under the new terms, the U.S. government will take a 5% equity ownership in Lithium Americas and a 5% owner"
    ],
    "image_url": "",
    "titles": [
      "Lithium Americas stock pops 35% as government takes a stake to boost Nevada project",
      "U.S. government takes stake in Canadian lithium miner and its Nevada mining project"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government has agreed to acquire a 5% stake in Lithium Americas Corp., as announced by Energy Secretary Chris Wright. This move supports the Canadian company's development of the Thacker Pass lithium project in Nevada, aiming to boost lithium production.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oura Unveils Colorful Ceramic Smart Rings, No Gen 5 in 2023",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-01T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Oura isn’t launching a fifth-gen smart ring this year. Instead, it’s zhuzhing up its lineup with colorful ceramic versions of its Oura Ring 4. The ceramic rings start at $499, and will come in four colors: midnight (teal), petal (pink), tide (mint green), and cloud (white). The rings utilize zirconi",
      "The new Oura Ring 4 Ceramic is made from zirconia ceramic, which the company says allows for durability and lightweight comfort."
    ],
    "image_url": "",
    "titles": [
      "Oura adds colorful ceramic rings and charging case to lineup",
      "Oura launches Ring 4 Ceramic collection, new charging case, and a ‘health panel’ feature"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oura has announced it will not release a fifth-generation smart ring in 2023, opting instead to introduce colorful ceramic versions of its current Oura Ring 4. These new editions, made from durable and lightweight zirconia ceramic, are available in four colors: midnight (teal), petal (pink), tide (mint green), and cloud (white), starting at $499.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SEC Quarterbacks in Spotlight as LSU Drops in ESPN's SP+ Rankings",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 11:38:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "lsutigerswire.usatoday.com"
    ],
    "snippets": [
      "SEC quarterbacks are making waves entering Week 6 of the season",
      "How far did LSU football fall in ESPN's SP+ rankings after the Tigers suffered their first loss of the season?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/0bfacf0b-d7ba-462c-8dd5-cdefb2161729/pavia-qb-power-rankings-copy.jpg",
    "titles": [
      "College Football QB Power Rankings: Ole Miss' Trinidad Chambliss, Vanderbilt's Diego Pavia on the rise",
      "LSU football rankings: Tigers fall in SP+ rankings after Ole Miss loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SEC quarterbacks are gaining attention as Week 6 of the season approaches. Following LSU's first loss, the team dropped in ESPN's SP+ rankings. The extent of the fall was not specified in the provided information.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football: Start/Bench Advice for QBs McConkey, Marks",
    "domain": "business",
    "source_domain": "touchdownwire.usatoday.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 11:38:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "touchdownwire.usatoday.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Here are a few Start/Sit QBs that will lead you to a win in your league, and a few that may keep you dwelling in the basement.",
      "Week 5 fantasy football start or sit choices, featuring Ladd McConkey, Woody Marks and more players that you should leave on your bench or put on your starting lineup"
    ],
    "image_url": "",
    "titles": [
      "Fantasy Football Start 'Em, Sit 'Em Week 5: QB Edition",
      "Fantasy Football Start Or Sit Week 5: Ladd McConkey, Woody Marks And More"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 5 fantasy football advice suggests starting or benching specific quarterbacks to optimize chances of winning in your league. Players like Ladd McConkey and Woody Marks are highlighted as key figures to either start or sit, aiming to guide fantasy football players in making strategic lineup decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA Coaching Changes in Five Cities; Reeve Fined for Conduct",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:33:09 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The WNBA coaching carousel starts with openings at Dallas, Seattle and New York, plus new teams Portland and Toronto.",
      "The Storm also let Noelle Quinn go"
    ],
    "image_url": "",
    "titles": [
      "WNBA coaching tracker for 2026: Wings part with Chris Koclanes",
      "WNBA coaching tracker: Liberty fire Sandy Brondello; Wings part ways with Chris Koclanes after one season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The WNBA has coaching vacancies in Dallas, Seattle, New York, Portland, and Toronto. Seattle's Noelle Quinn and Dallas's Chris Koclanes were let go. Additionally, Minnesota Lynx's Cheryl Reeve faced a significant fine for her comments and behavior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "BBC Sport Wins Rights to UEFA Women's Champions League for Five Years",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 10:04:27 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com"
    ],
    "snippets": [
      "BBC Sport signs a five-year deal to broadcast live Women's Champions League matches from this season.",
      "The UEFA Women's Champions League is about to begin its league phase. Here's every 2025-26 jersey of every team in the competition -- ranked!"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a34d/live/d38a91b0-9d25-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "BBC to show live Women's Champions League matches",
      "Ranking every Women's Champions League kit in league phase"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "BBC Sport has secured a five-year agreement to broadcast live UEFA Women's Champions League matches starting this season. This deal coincides with the commencement of the league phase of the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Mulls \"Drone Wall\" for Eastern Border Security Boost",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 09:12:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A number of European countries have reported airspace incursions involving either Russian jets or, allegedly, drones recently.",
      "The European Union is talking about shoring up defenses in its eastern airspace. Recent Russian drone incursions have lent urgency to the project."
    ],
    "image_url": "",
    "titles": [
      "What is the drone wall that Europe wants to deter Russia?",
      "What Is Europe’s ‘Drone Wall’?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "EU leaders are discussing implementing new defense measures, including a \"drone wall\" near the Russian border, to strengthen eastern Europe's airspace. This comes in response to recent Russian drone incursions, highlighting the urgency of enhancing security in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Escalates Legal Action Against AI Firms with Cease and Desist to Characte",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:34:03 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9naW4zYmdWaGMzRUdseTJzRVdLOTVLNDJKZXoyNS1SVjhOY0ZuN2pvUFE1cTh0M0o3UlJ4QnF2U1JpWTlWaDFLSVVINGozTzJHMEVQRl9oeG9TOTlOVWthZXh6MHBiN0ptc21LSF9JOEp2Zw?oc=5\" target=\"_blank\">Scoop: Disney sends cease and desist letter to Character.AI</a>&nbsp;&nbs",
      "Disney is already involved in an ongoing lawsuit against AI image creator Midjourney."
    ],
    "image_url": "",
    "titles": [
      "Scoop: Disney sends cease and desist letter to Character.AI - Axios",
      "Disney sent cease and desist letter to Character.AI over use of copyrighted characters"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.692,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Disney has issued a cease and desist letter to Character.AI, escalating its legal actions in the tech space. This follows an ongoing lawsuit against AI image creator Midjourney, indicating Disney's increasing legal scrutiny of AI companies using its copyrighted content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]