[
  {
    "title": "Senate Advances Bill to End 40-Day Government Shutdown",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 22:57:33 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press",
      "Deutsche Welle",
      "ABC News",
      "The Guardian",
      "Reuters",
      "BBC",
      "Business Insider"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "dw.com",
      "abcnews.go.com",
      "theguardian.com",
      "bbc.com",
      "businessinsider.com"
    ],
    "snippets": [
      "The Senate voted late Sunday evening on a compromise that could reopen the government following the longest shutdown in history.",
      "Senate takes first step toward ending the government shutdown AP News",
      "A group of Democrats voted with Republicans to advance a measure to end a 40-day shutdown, the longest in US history.",
      "Trump offers more insight into proposal that directs subsidies directly to the American people to pay for health care rather than sending funds insurance companies.",
      "Senators vote on advancing House-passed stopgap funding bill, suggesting end to historic 40-day shutdown in reach The US Senate on Sunday took a key vote on a bill that would end the record-setting federal government shutdown without extending the healthcare subsidies that Democrats have demanded. S",
      "Aussie gains, yen weakens as end to US shutdown looks possible Reuters",
      "US Senate advances bill to end federal shutdown Reuters",
      "The measure signals a major breakthrough but the deal still needs to get over more hurdles in Congress.",
      "Six Democratic Senators split with their party and voted to advance a package that would reopen the government."
    ],
    "image_url": "",
    "titles": [
      "Senators take first step toward reopening the government after historic shutdown",
      "Senate takes first step toward ending the government shutdown - AP News",
      "US Senate takes big step toward ending shutdown",
      "Government shutdown updates: Senate vote marks step towards ending federal shutdown",
      "US Senate vote marks step towards ending federal shutdown",
      "Aussie gains, yen weakens as end to US shutdown looks possible - Reuters",
      "US Senate advances bill to end federal shutdown - Reuters",
      "US Senate passes deal aimed at ending government shutdown",
      "Washington just moved one step closer to ending the longest government shutdown in US history"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603659/government-shutdown-senate-agreement",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxQbG9UajMzY19TYzBKbmpPOGw1d1NJdGkxQWJnZ1F5TVA3SjBYenFQaElPenV5WGJYRk5TLVJlUHc4UW9RbjYxYlVYMTNGRHlKWjdOa2gxY2RjWGt5WUJaOWFFRTNHY210Tndud2ZSaGUxZlV2d0owYm5UZ3VfVmxqVjNVLTFFODFmLXB6VTBMSUNRYUV6WlNYYl9B?oc=5",
      "https://www.dw.com/en/us-senate-takes-big-step-toward-ending-shutdown/a-74681536?maca=en-rss-en-top-1022-rdf",
      "https://abcnews.go.com/Politics/live-updates/government-shutdown-live-updates/?id=127124906",
      "https://www.theguardian.com/us-news/2025/nov/09/senate-moves-vote-federal-government-shutdown",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTmw0T1pCdDFROTMtVFU4bVBqOXBCMGZPdkM1cFJRd1RTNTRGNjl5em9YZFltbnZCZFVLTGR4UHhzdTU1Ymt2RG9rV3pkaTEzbGRmeHZrRWhSVzd1ZmJYZDZFRXdBcm9kakFMZW5EZXJUb294anZBeFhuXzFKb2FVVFItQ3RUY2ZVVHFHYUwxTS1DTDFpcTgyUThWOTEtX0tpVUMydVp4VnlTODlodmRzZXI3TjJTY3VHZmIxLXg5VXI?oc=5",
      "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPNlVaalFLU21CMS1yNE1CemNaano0MEhDQmRHZUt6V2Q4ZnlvM2t6OFFzdndvZXdScEVzMHJ4dTZsNDV0SzBJX09iS0g5RXVIbGZFZnR2NXBVRjlRUlNkREFVNFphV0Z0ME1XODZfcjE2MDR3Xzhhc0JsRl9OVC1sejItLVpKUTBtTmUzQmp1WS0zZlRzQ2JzOUJiOXY5NTV3X200X3h4T2NvTnQ0eWppSUdQdUVwM0hlQ1FQU1g5OEZPcjkzY2JWOFBTUEMtYTB2Nk1v?oc=5",
      "https://www.bbc.com/news/articles/cpd2p2eddnzo?at_medium=RSS&at_campaign=rss",
      "https://www.businessinsider.com/government-shutdown-deal-negotiations-senate-sunday-session-2025-11"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603659/government-shutdown-senate-agreement",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.878,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.871,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Senate voted late Sunday to advance a bill aimed at ending the record 40-day federal government shutdown, marking a significant step toward reopening the government. The compromise measure, which passed with support from both Democrats and Republicans, does not extend healthcare subsidies as previously demanded by Democrats. Six Democratic senators broke ranks to vote with Republicans. The bill still faces additional hurdles before becoming law. This development suggests a potential end to the longest government shutdown in US history.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Fung-wong Hits Philippines: 4 Dead, 1.4M Displaced",
    "domain": "science",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 10 Nov 2025 03:53:51 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Associated Press",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "CBC News",
      "Phys.org"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com",
      "cbc.ca",
      "phys.org"
    ],
    "snippets": [
      "Typhoon Fung-wong blew out of the Philippines after setting off floods and landslides, knocking out power to entire provinces, killing at least four people and displacing more than 1.4 million.",
      "Typhoon Fung-wong weakens in the Philippines; four dead Reuters",
      "Super Typhoon Fung-wong slams into Philippines, two dead Reuters",
      "Super Typhoon Fung-wong slams into Philippines, killing 2 and displacing 1 million AP News",
      "Typhoon Fung-wong blows away from the Philippines, leaving 4 dead and 1.4 million displaced AP News",
      "Destructive winds and rainfall hit archipelago, while a cold spell in Florida prompts fears of falling iguanas Typhoon Fung-Wong, locally known as Uwan, is the second in a week to affect the Philippines after making landfall on Sunday evening. The weather system prompted warnings for heavy rainfall",
      "Less than a week after a storm left more than 200 people dead in the Philippines, an even stronger one hit.",
      "Grabbing children and leaving their homes behind, residents evacuated before Typhoon Fung-wong hit.",
      "Typhoon Fung-wong made landfall on the main island of Luzon, prompting the evacuation of more than one million people, just days after an earlier storm killed over 200.",
      "More than 1.4 million people were evacuated across the country as the storm triggered flash flooding, landslides and gale-force winds Super typhoon Fung-wong has blown through the Philippines, leaving at least two dead, 1.4 million people evacuated and widespread damage in its wake. More than 1.4 mi",
      "Typhoon Fung-wong blew out of the northwestern Philippines on Monday after setting off floods and landslides, knocking out power to entire provinces, killing at least four people and displacing more than 1.4 million others",
      "Super Typhoon Fung-wong slammed ashore Sunday on the northeastern coast of the Philippines, where the massive storm had already left at least two people dead and forced more than a million people to evacuate from flood- and landslide-prone areas, officials said.",
      "Super Typhoon Fung-wong slammed into the Philippines' eastern seaboard on Sunday, the national weather service said, after killing at least two people and forcing more than a million to evacuate."
    ],
    "image_url": "",
    "titles": [
      "Typhoon Fung-wong leaves 4 dead and 1.4 million displaced in the Philippines",
      "Typhoon Fung-wong weakens in the Philippines; four dead - Reuters",
      "Super Typhoon Fung-wong slams into Philippines, two dead - Reuters",
      "Super Typhoon Fung-wong slams into Philippines, killing 2 and displacing 1 million - AP News",
      "Typhoon Fung-wong blows away from the Philippines, leaving 4 dead and 1.4 million displaced - AP News",
      "Weather tracker: Typhoon Fung-Wong becomes second in a week to hit the Philippines",
      "Super Typhoon Fung-wong slams Philippines in wake of Typhoon Kalmaegi",
      "A Million Evacuated as Typhoon Fung-Wong Hit the Philippines",
      "Super Typhoon Fung-wong Hits Philippines Days After Last Storm",
      "Two dead and more than a million displaced after super typhoon Fung-wong slams the Philippines",
      "Typhoon Fung-wong blows away from Philippines, leaving 4 dead and 1.4 million displaced",
      "Super Typhoon Fung-wong hits Philippines after more than 1 million people evacuated",
      "Super Typhoon Fung-wong makes landfall in Philippines"
    ],
    "url": "https://www.npr.org/2025/11/10/g-s1-97144/typhoon-fung-wong-philippines",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxOTVo2VlFIVGx5WEw1NlNNZHFuZHBrSmFfbkNaa0tLeElqSFBtYjFhOVcwdWNSMFdDaUgtcTNfU0thaHdWSzNqS3ExVjVGVDdNZzdjT3dtQXJkLWtTNVk3SW5uSTdLVElEZXJ2cDF6NVFuVXVPV2d1MGc3MnhRaEhSazc2SHZLaW5LUVROYUxfRkxQZ2xfcjZNbHppel80eURfMEdoZVpra2xacHpnUlp3MUJaMFdRelZEdm8wb2hBbDhuUGFLZGhN?oc=5",
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxQM0lMOURwdWNUalpaMVU0ODFGUzlkMnk5VGpfYm9pRWJKNTFZOVpCVGlPM3ZGN3NoX1pORE1heEwyRHJ1SU16TklueG9uQ0NQWkFMNnhleGs2bzlwODlPZTRVb0k3Smk0ZlVrXy1Ic1JVQW1mdHdqcHR2N1ZUdjZzNE1WNnZaVk56YU5CZVMzRFV2SlpkVGlPQVNsbHpXMF9zWmpjMVNOMHdRYTgzOXZqaDNsTzBLZHVGUmU1YXZYeGdYVnlUMEtkM3ltVm5oUQ?oc=5",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOTzd1cWRDdlAzVFpMb1ZvVlhPOEhjd1R4aDFqbmFYcmlRUkpmZTZpdXBTX29KaENPcjd0bjRvTlp0dmtVY2o2d1p2Z090aHR1NllGWkFYQjl6V0pxTVpUaWoyZ3UySVdQQTdTSTdwSjJKWFFhaGRKaHRXOENpSlgycnB5TG5ZamNtSXVsMWRTZ1BiTzREaWVsY0pxbDJXQ1NoYmlMWlNFZENsamVNMTJGVDZuaWhjdw?oc=5",
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxOR2RDd2hodlZmRDNmQl9lWVlENkdCd0szZXBsbmIxYWlxQlBxRGJudUpiLXNoV1ZpNVZmdUpRTUZyb1RoR2Vac1lKdFZHRW10SURuMFVzbXgyRFJFZW9aYVkySUZIMmVjaVB0Sm5IclVTTzNldHVPb2xwakNKeEhJcEE2cUk0ajBoM1g3V2pBcHU3akRPSGRqMTFPcmcyYmN1bWlGOXphQXVEX19wUEtFZVBST3dYWG8?oc=5",
      "https://www.theguardian.com/environment/2025/nov/10/weather-tracker-typhoon-fung-wong-philippines",
      "https://www.washingtonpost.com/world/2025/11/09/philippines-typhoon-uwan-fung-wong-cyclone-storm/",
      "https://www.nytimes.com/2025/11/10/world/asia/typhoon-fung-wong-philippines-evacuation.html",
      "https://www.nytimes.com/2025/11/09/world/asia/philippines-typhoon-fung-wong.html",
      "https://www.theguardian.com/world/2025/nov/10/super-typhoon-fung-wong-philippines",
      "https://www.cbc.ca/news/world/typhoon-fung-wong-blows-away-from-philippines-leaving-4-dead-and-1-4-million-displaced-9.6973057?cmp=rss",
      "https://www.cbc.ca/news/world/super-typhoon-the-philippines-evacuation-9.6972581?cmp=rss",
      "https://phys.org/news/2025-11-super-typhoon-fung-wong-landfall.html"
    ],
    "link": "https://www.npr.org/2025/11/10/g-s1-97144/typhoon-fung-wong-philippines",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.973,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.87,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Typhoon Fung-wong, after hitting the Philippines, caused widespread destruction, triggering floods and landslides, and leading to power outages across provinces. The storm resulted in at least four fatalities and displaced over 1.4 million people. The typhoon, which made landfall on the northeastern coast of Luzon, weakened as it moved away from the Philippines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "BBC Leaders Resign Over Trump Speech Edit Controversy",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 09:20:02 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Deutsche Welle",
      "Axios",
      "Financial Times",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "dw.com",
      "ft.com",
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "BBC boss and head of news quit after criticism of Trump documentary edit Reuters",
      "The director general and the UK broadcaster's top news executive quit in a row over the editing of a speech Donald Trump made before protesters attacked the US Capitol in Washington.",
      "BBC leaders quit after backlash over edit of Trump's Jan. 6 speech in documentary Axios",
      "Exit comes after broadcaster accused of bias on US president, Gaza war and its coverage of rights of transgender people",
      "The BBC has come under fire over a Panorama documentary that was accused of misleadingly editing a speech by Donald Trump.",
      "The abrupt moves followed furor over claims that a documentary had misleadingly edited footage of President Trump’s speech before the Jan. 6 Capitol riot."
    ],
    "image_url": "",
    "titles": [
      "BBC boss and head of news quit after criticism of Trump documentary edit - Reuters",
      "BBC bosses resign amid fury over Trump documentary edit",
      "BBC leaders quit after backlash over edit of Trump's Jan. 6 speech in documentary - Axios",
      "BBC boss Tim Davie resigns over Trump documentary edit",
      "Why has Tim Davie resigned and what was the Trump documentary edit?",
      "BBC Director Tim Davie and CEO Deborah Turness Quit Following Trump Documentary Turmoil"
    ],
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxONXRQUTNWVXpscXh4c1MwMHVGUzAwNW0zRlRSNi14VVk2QXp1VWdLQjVpcDZGZWhTT0tCclZoYTBtZDBHWFk4amR6MnRFT3hNVmpXdklQZjlfMkxfTW4yZEZ1SWpHV1hKMHFYZ2tIdldzT01EQWpfd2c1ci1oUVZiZmJMRktSaEwwVnpPZzNWYk9MUDBGWF81UkkwZE1TZVhrWjJ2aURrTWstOWZ0YmhZajFuMFFaTzd1bTRvRTYzeGVNaWJwNnpuQ0VLSGM4X1Y3TjJJ?oc=5",
    "alternate_urls": [
      "https://www.dw.com/en/bbc-bosses-resign-amid-fury-over-trump-documentary-edit/a-74680557?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxNeFRFQ1BGVUJKNzJHN1F0VVlaM0RNUW56cGo0eFFqTmNYdFUzcC1BV0N6dFloZnJnQktFYzN4dU1CR2U4NnJRMWFjcHFoSm5BcFVabnRZdWxJUXctRURjMWVuS0NoNFdJRXJ2bU82NWRycGpCRFZEQTlPeG9sd2FpZ1B3?oc=5",
      "https://www.ft.com/content/ccc0ec9a-aba6-4380-aeaa-ffe5fe803578",
      "https://www.bbc.com/news/articles/c0mx28vlp4wo?at_medium=RSS&at_campaign=rss",
      "https://www.nytimes.com/2025/11/09/world/europe/bbc-resignations.html"
    ],
    "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxONXRQUTNWVXpscXh4c1MwMHVGUzAwNW0zRlRSNi14VVk2QXp1VWdLQjVpcDZGZWhTT0tCclZoYTBtZDBHWFk4amR6MnRFT3hNVmpXdklQZjlfMkxfTW4yZEZ1SWpHV1hKMHFYZ2tIdldzT01EQWpfd2c1ci1oUVZiZmJMRktSaEwwVnpPZzNWYk9MUDBGWF81UkkwZE1TZVhrWjJ2aURrTWstOWZ0YmhZajFuMFFaTzd1bTRvRTYzeGVNaWJwNnpuQ0VLSGM4X1Y3TjJJ?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.982,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.846,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The BBC's director general and head of news resigned following criticism over the misleading editing of Donald Trump's speech in a documentary, ahead of the Capitol riot on January 6. The controversy, part of broader accusations of bias in the broadcaster's coverage, prompted their departure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Advances Bill to End Historic US Shutdown; Awaits House, President Approv",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 05:35:16 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Jazeera",
      "Axios",
      "Financial Times",
      "The Guardian",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "ft.com",
      "theguardian.com",
      "marketwatch.com"
    ],
    "snippets": [
      "Morning Bid: Markets rejoice potential end to US government shutdown Reuters",
      "Global shares jump as investors eye potential end to US government shutdown Reuters",
      "VIEW Markets cheer signs of progress to end US government shutdown Reuters",
      "US Senate vote to end shutdown delivers reprieve to investors worried about AI valuations and weakness in US economy.",
      "Eight Democrats join Republicans in vote toward ending the longest government shutdown in US history.",
      "Centrist Democrats strike deal to reopen government but without a guaranteed extension of healthcare subsidies.",
      "Senate votes to move forward with deal to end government shutdown Axios",
      "Deal to end government shutdown in reach Axios",
      "Eight Democrats cross party lines to back deal seeking to reopen federal administration after record impasse",
      "US stock futures gain and Treasury yields tick up in ‘relief rally’",
      "The amended package will still have to be passed by the House and sent to Trump for his signature, a process that could take days The Senate on Sunday made significant progress towards ending the longest US government shutdown in history , narrowly advancing a compromise bill to reauthorize funding",
      "U.S. stock futures gained Sunday, despite coming off the worst week for tech stocks since April, as investors welcomed a tentative Senate deal that may soon end the government shutdown."
    ],
    "image_url": "",
    "titles": [
      "Morning Bid: Markets rejoice potential end to US government shutdown - Reuters",
      "Global shares jump as investors eye potential end to US government shutdown - Reuters",
      "VIEW Markets cheer signs of progress to end US government shutdown - Reuters",
      "Stock markets surge after US lawmakers move to end government shutdown",
      "Democrats break rank as US Senate advances bill to end government shutdown",
      "US Senate nears vote on bill that could end 40-day government shutdown",
      "Senate votes to move forward with deal to end government shutdown - Axios",
      "Deal to end government shutdown in reach - Axios",
      "Senators take first step to end US government shutdown",
      "Global markets rise as US senators move to end shutdown",
      "Senate advances funding bill to end longest US government shutdown in history",
      "U.S. stock futures rise as Senate advances deal to end government shutdown"
    ],
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOTGI3dTIycmlYbERERk9QQTB6WHE5TVprT29aU2FGdnNPWUNNeHZCem02Y1A2R3ZLWWNwRWVmZVlRTEFXVEdwMXpEVkRrY1ZtakNTOV95a25CVG03Um14cTB2SHQ0MWZld2t5d0JIdHZMNGhZcER3LU53bG1OME1xVl8weWQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxOLUZpcDZkYmNHYkhTOWhySFRwc3JfYjU4cmVMNW1vMmVMMW1meDA2SGc1VlppZmRjLXVKd3NENXl5bjB6cHowOWtqZVl4V0xzTmttRWtxSHl4Sll3aFNWMjhtbVcxYVhDWU84bkxJTjcwQ2tSZjMtVi11aGxPaGRpRVZuVQ?oc=5",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNMzlpWWpHX01pVU9idmlCY0o1QWV3UHAtbGpJaTZ2ZElNZUk3amxkeTZob19vYm14MFZzSVpYTUJaeFRUdkNHUjByMndESEwyTW1mM1J3VlRmV0lDU2J0TGNNeEFpOElPd0NGMGV0VmZ5dmZuNVloY0UxTHlSRGdjUGprZE56TERuWkNSUG1hOHdPcm5rTlMxbUhCblR0dGE4TEFSaWJuOE4?oc=5",
      "https://www.aljazeera.com/economy/2025/11/10/stock-markets-surge-after-us-lawmakers-move-to-end-government-shutdown?traffic_source=rss",
      "https://www.aljazeera.com/news/2025/11/10/us-senators-advance-bill-to-end-record-government-shutdown?traffic_source=rss",
      "https://www.aljazeera.com/news/2025/11/10/us-senate-nears-vote-on-bill-to-end-40-day-government-shutdown?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUDJBakVlZS1iOWF4Q00tWV9kN3dBRmdUSnp6RTh1S2NHajFDNGVYaHdEdWdub2JmRzJMUjBjMTdPZkZ2OWwxWlJ0NXNXMVF6bjQyTV8waV82Q2h6TUgtblRpUnd6RV84amNpdUpmcDFzaGFjbW9nUW13U3dHVk8xNTc0a1lhbkZPT1p2M3Z0d0pXazA?oc=5",
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOMVRFNU1OTXBvTk5MSThfNkdSRWtfSk9jc2pYZFpRYXBTS3ZNeEJ6cm1HMmhhdkRWNk1YU3VQNGdxZHd5Z0tUS1VkamJZVmdiSXNNWkFCLW1PVkduZ1RPTFB0SWtaZWI3NFh1NWhVbnZNc1BMdVBJRGRtMElHZUlYTVFkYnh6QmNuLUpZ?oc=5",
      "https://www.ft.com/content/66869481-4189-438b-9c16-94560861c08f",
      "https://www.ft.com/content/fca83dc8-385a-4218-864e-c0f00a82ac27",
      "https://www.theguardian.com/us-news/2025/nov/10/us-government-shutdown-update-senate-funding-bill",
      "https://www.marketwatch.com/story/u-s-stock-futures-rise-amid-new-hope-of-imminent-deal-to-end-government-shutdown-3f66f418?mod=mw_rss_topstories"
    ],
    "link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOTGI3dTIycmlYbERERk9QQTB6WHE5TVprT29aU2FGdnNPWUNNeHZCem02Y1A2R3ZLWWNwRWVmZVlRTEFXVEdwMXpEVkRrY1ZtakNTOV95a25CVG03Um14cTB2SHQ0MWZld2t5d0JIdHZMNGhZcER3LU53bG1OME1xVl8weWQ?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.909,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.842,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Senate has made progress toward ending the longest government shutdown in US history, with a compromise bill advancing that could reopen the government. Eight Democrats joined Republicans in support of the deal, which lacks a guarantee for extended healthcare subsidies. The agreement, still requiring House approval and the President's signature, has prompted a positive reaction from markets, with US stock futures and Treasury yields rising in anticipation of the resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cleveland Pitchers Indicted in MLB Bribery Scandal",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 18:23:41 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press",
      "CBS Sports",
      "CBC News",
      "Fortune",
      "CityNews"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "cbssports.com",
      "cbc.ca",
      "fortune.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Two Major League Baseball pitchers have been indicted on charges they took bribes to give bettors advance notice of the types of pitches they'd throw and intentionally tossed balls instead of strikes.",
      "MLB pitchers Emmanuel Clase and Luis Ortiz charged with taking bribes to rig pitches for bettors AP News",
      "Each pitcher could face up to 65 years in prison if convicted on all charges",
      "Cleveland Guardians pitchers Emmanuel Clase and Luis Ortiz have been charged with taking bribes from sports bettors to intentionally throw certain types of pitches, including tossing balls instead of strikes to ensure successful bets.",
      "Ortiz, 26, was arrested by the FBI on Sunday at Boston Logan International Airport. He is expected to appear in federal court in Boston on Monday. Clase, 27, is not yet in custody.",
      "NEW YORK (AP) — Cleveland Guardians pitchers Emmanuel Clase and Luis Ortiz have been indicted on charges they took bribes from sports bettors to throw certain types of pitches, including tossing balls in the dirt instead of strikes, to ensure successful bets. According to the indictment unsealed Sun"
    ],
    "image_url": "",
    "titles": [
      "MLB pitchers Emmanuel Clase and Luis Ortiz charged with taking bribes to rig pitches",
      "MLB pitchers Emmanuel Clase and Luis Ortiz charged with taking bribes to rig pitches for bettors - AP News",
      "Guardians pitchers Emmanuel Clase, Luis L. Ortiz indicted for allegedly rigging pitches in MLB betting scheme",
      "Guardians' Clase, Ortiz charged with taking bribes to rig pitches for bettors",
      "MLB’s Emmanuel Clase and Luis Ortiz charged with taking bribes to rig pitches so gamblers could win in-game prop bets",
      "MLB pitchers Emmanuel Clase and Luis Ortiz charged with taking bribes to rig pitches for bettors"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603653/baseball-cleveland-guardians-pitchers-bribes-charged-gambling",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTWpQR1pPd0ViNHhTOXc1ZHpZMklxSjdfeC1rSGVWZDdUNWVDdG5MbHhlZDU4MXBzcHFzVkVnRkhPZ2tXb2IzSGh2eTlpcWZvdjhmamV0X0w1T3kzSHJvdDJrdW1Zc3hPQWFQdDI4My1SQVM3RjA4UmVNYTk3UDRfUWtjMXNvdnc1bGVqUjlQTl9BbEVabV9TZA?oc=5",
      "https://www.cbssports.com/mlb/news/mlb-betting-scandal-emmanuel-clase-luis-l-ortiz-pitch-rigging-doj-indictment/",
      "https://www.cbc.ca/sports/baseball/mlb/emmanuel-clase-luis-ortiz-indicted-charges-sports-betting-mlb-9.6972814?cmp=rss",
      "https://fortune.com/2025/11/09/emmanuel-clase-luis-ortiz-mlb-sports-betting-bribes-pitches-in-game-prop-bets/",
      "https://ottawa.citynews.ca/2025/11/09/mlb-pitchers-charged-with-taking-bribes-to-rig-pitches-for-bettors/"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603653/baseball-cleveland-guardians-pitchers-bribes-charged-gambling",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.799,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.83,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Cleveland Guardians pitchers Emmanuel Clase and Luis Ortiz were indicted for taking bribes to influence MLB game outcomes by signaling pitch types to bettors and intentionally throwing balls. Both have been on paid leave since July amid an MLB investigation into suspicious betting patterns. Clase and Ortiz face charges including wire fraud conspiracy. Ortiz is currently in custody.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Basketball Legend Lenny Wilkens Dies at 88",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 05:13:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "ESPN",
      "CBC News",
      "Sports Illustrated",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "aljazeera.com",
      "abcnews.go.com",
      "espn.com",
      "cbc.ca",
      "news.google.com",
      "sportsnet.ca",
      "cbssports.com"
    ],
    "snippets": [
      "Wilkens' family announced the news but did not divulge a cause of death of the Basketball Hall of Fame player and coach.",
      "Wilkens brought his calm and savvy style as a point guard to the sideline.",
      "Lenny Wilkens, a smooth playmaker who was inducted into the Basketball Hall of Fame as both a player and a coach, has died. He was 88.",
      "Lenny Wilkens, a three-time inductee into the Basketball Hall of Fame who was enshrined as both a player and a coach, has died, his family said Sunday. He was 88. The family said Wilkens was surrounded by loved ones when he died and did not immediately release a cause of death.",
      "Lenny Wilkens, Hall of Fame NBA Player and Coach, Dies at 88 Sports Illustrated",
      "SEATTLE — Lenny Wilkens, a three-time inductee into the Basketball Hall of Fame who was enshrined as both a player and a coach, has died, his family said Sunday. He was 88. The family said Wilkens was surrounded by loved ones when he died and did not immediately release a cause of death. Wilkens was one of the finest point guards of his era who later brought his calm and savvy style to the sideline, first as a player-coach and then evolving into one of the game’s great coaches. He coached 2,487 games in the NBA, which is still a record. He became a Hall of Famer as a player, as a coach and...",
      "Wilkens enjoyed one of the most decorated careers in basketball history"
    ],
    "image_url": "",
    "titles": [
      "Lenny Wilkens, legendary NBA player and coach, dies at 88",
      "Hall of Famer Lenny Wilkens, godfather of Seattle basketball, dies at 88",
      "Legendary NBA player, coach Wilkens dies at 88",
      "Hall of Famer and former Raptors coach Lenny Wilkens dies at 88",
      "Lenny Wilkens, Hall of Fame NBA Player and Coach, Dies at 88 - Sports Illustrated",
      "Former Raptors head coach Lenny Wilkens dead at 88",
      "Lenny Wilkens, NBA's most prolific coach and three-time Hall of Fame inductee, dies at age 88"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/10/lenny-wilkens-legendary-nba-player-and-coach-dies-at-88?traffic_source=rss",
    "alternate_urls": [
      "https://abcnews.go.com/Sports/wireStory/hall-famer-lenny-wilkens-godfather-seattle-basketball-dies-127363114",
      "https://www.espn.com/nba/story/_/id/46910949/legendary-nba-player-coach-lenny-wilkens-dies-88",
      "https://www.cbc.ca/sports/basketball/nba/lenny-wilkins-obit-9.6972940?cmp=rss",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQU1pSYnpkU0lUYjhzUVpMMmtCOUJuT1YwX25jYW11LU9VblliMS02V3U3akZrV3NJRlY1YmRUWXc3WWhfalJvd1JjMzh3c0xsSGIxVXFBbnNYeHY4dGRuVVpBUjhvZVFYN0RCRkJKbFpCWFpvT1d4NlB3S05GRV9tR2w1T1FaX1pt?oc=5",
      "https://www.cbssports.com/nba/news/lenny-wilkens-dies-nba-coach-champion-hall-of-fame/"
    ],
    "link": "https://www.aljazeera.com/sports/2025/11/10/lenny-wilkens-legendary-nba-player-and-coach-dies-at-88?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.902,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lenny Wilkens, a celebrated figure in basketball known for his distinguished career as both a player and a coach, has passed away at the age of 88. His family confirmed his death, stating he was surrounded by loved ones, but did not provide a cause of death. Wilkens was a three-time inductee into the Basketball Hall of Fame, recognized for his achievements on the court as a point guard and on the sidelines as a coach. He holds the record for coaching 2,487 NBA games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "BBC Leaders Resign After Criticism Over Trump Speech Edit",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 13:41:57 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press",
      "Al Jazeera",
      "LA Times",
      "CBC News",
      "CityNews"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "aljazeera.com",
      "latimes.com",
      "cbc.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The BBC said that director-general Tim Davie and head of news Deborah Turness have resigned after criticism of the broadcaster's editing of a speech by U.S. President Donald Trump.",
      "Top BBC bosses resign after criticism of the broadcaster’s editing of a Trump speech AP News",
      "Davie's exit caps week of attacks on UK's public broadcaster, with Trump press secretary calling it '100% fake news'.",
      "BBC Director-General Tim Davie and BBC News Chief Executive Deborah Turness announce they are leaving their positions amid debate over a broadcast featuring an edited version of President Trump's speech before the Jan. 6 riot at the Capitol.",
      "The head of the BBC and the British broadcaster's top news executive both resigned Sunday after criticism of the way the organization edited a speech by U.S. President Donald Trump.",
      "LONDON (AP) — The head of the BBC and the British broadcaster’s top news executive both resigned Sunday after criticism of the way the organization edited a speech by U.S. President Donald Trump. The BBC said Director-General Tim Davie and news CEO Deborah Turness had both decided to leave the corpo"
    ],
    "image_url": "",
    "titles": [
      "BBC director resigns after criticism of the broadcaster's editing of a Trump speech",
      "Top BBC bosses resign after criticism of the broadcaster’s editing of a Trump speech - AP News",
      "BBC boss Tim Davie resigns after criticism over Trump speech edit",
      "BBC leaders resign after the broadcaster's editing of a Trump speech is called misleading",
      "BBC director, head of news resign after criticism of Trump speech edits",
      "Top BBC bosses resign after criticism of the broadcaster’s editing of a Trump speech"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603609/bbc-director-resigns-after-criticism-of-the-broadcasters-editing-of-a-trump-speech",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxPQ3VhUkJZeHBHbXZDRXJtdzNYRmNtR1p5QTBHSnFBVzB6ZnJfelF2blQtdW12VWRSNndtdXBHV1FuTy11NERWWk1tQlVrbzFXcy1OampYS0ktckVyTmJLeHhGUlVUN2l2YVdhdHQ0XzhER2FoWXVqd1dUemNKMlU1VHdKWmRUcDI3QzdKR0dfUW1oOTVqT0RvaGdrQkdHaEtQLTJJ?oc=5",
      "https://www.aljazeera.com/news/2025/11/9/bbc-director-general-tim-davie-resigns-over-editing-of-trump-speech?traffic_source=rss",
      "https://www.latimes.com/world-nation/story/2025-11-09/bbc-director-general-tim-davie-bbc-news-ceo-deborah-turness-resign",
      "https://www.cbc.ca/news/world/bbc-director-resigns-9.6972781?cmp=rss",
      "https://ottawa.citynews.ca/2025/11/09/bbc-director-resigns-after-criticism-of-the-broadcasters-editing-of-a-trump-speech/"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603609/bbc-director-resigns-after-criticism-of-the-broadcasters-editing-of-a-trump-speech",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.724,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.82,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The BBC's Director-General Tim Davie and Head of News Deborah Turness resigned following criticism over the editing of a speech by U.S. President Donald Trump. Their resignations were announced by the BBC and confirmed in a statement on Sunday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Orders States to End Expanded SNAP Benefits Amid Shutdown",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 12:27:05 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "CNBC",
      "CBC News",
      "Global News",
      "Bloomberg",
      "Fortune",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "cnbc.com",
      "cbc.ca",
      "globalnews.ca",
      "fortune.com"
    ],
    "snippets": [
      "The Trump administration late Saturday directed states that they must \"immediately undo\" any actions they have made to provide full benefits to low-income families via SNAP.",
      "Trump administration orders states to \"undo\" full SNAP benefits Axios",
      "The Trump administration has resisted continuing the SNAP program, which provides food stamps to 42 million Americans, during the government shutdown.",
      "U.S. President Donald Trump's administration is demanding states \"undo\" full SNAP food benefits paid out under judges' orders over the past week, now that the U.S. Supreme Court has stayed those rulings — marking the latest swing in a seesawing legal battle over the anti-hunger program used by 42 mi",
      "States administering a federal food aid program serving about 42 million Americans faced uncertainty Monday over whether they can — and should — provide full monthly benefits during an ongoing legal battle involving the U.S. government shutdown.",
      "Trump Administration Tells States to Undo Full Food-Aid Funding Bloomberg.com",
      "In a filing in federal court on Sunday, the agency said states moved too quickly and erroneously released full money SNAP Benefits after last week's rulings.",
      "Trump administration demands states 'undo' full SNAP payouts as states warn of 'catastrophic impact' AP News"
    ],
    "image_url": "",
    "titles": [
      "Trump admin order to 'immediately undo' full SNAP benefits leaves states scrambling",
      "Trump administration orders states to \"undo\" full SNAP benefits - Axios",
      "Trump administration demands that states 'undo' full SNAP benefit payments",
      "Trump administration wants U.S. states to 'undo' full payouts of food aid benefits",
      "States face uncertainty as Trump administration tries to reverse SNAP food payments",
      "Trump Administration Tells States to Undo Full Food-Aid Funding - Bloomberg.com",
      "Trump administration demands states ‘undo’ full SNAP payouts and warns of penalties if they refuse",
      "Trump administration demands states 'undo' full SNAP payouts as states warn of 'catastrophic impact' - AP News"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603417/full-snap-benefits-trump-states-order",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMieEFVX3lxTE02YkFkV1VTOUVLM3hTTEtESlRpM1RWNFJUYVA0bmFoellqMnJwSkRIVXFyQnZoVlkzb090cUdpT01heUV6dXA5ZEVkTDNJX1ZkQ0l2cGtIN0hOY05hRll0N2tYMUdWazdjeUFzdnA2WDRiZjQ2Z3Rlcw?oc=5",
      "https://www.cnbc.com/2025/11/09/snap-trump-states-food-patrick-penn.html",
      "https://www.cbc.ca/news/world/trump-administration-snap-food-benefits-stamps-9.6972770?cmp=rss",
      "https://globalnews.ca/news/11519240/states-face-uncertainty-as-trump-administration-tries-to-reverse-snap-food-payments/",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNbjBaUlgzVGpPaDUtYjZTeGxYcEh1X2xDSDd6TVhMZThCQkRZbnRNYnhPSkh6MThiX3VuZGxjYU12Wkhfdy1qZHlyTUI0Q3JHVi1SbU1sNmYwc09jX1ROZ0taVFp3RzFvbWJiaDJMWDkxTFRNZVNGNzNfNlI5ajhSa3E0eVVEQ1RwNV9RV0pNc3EyUmk4cFpjdExJZ3F3UEZTSnNfVmd5OGlIeGU5UE5zTmpVZw?oc=5",
      "https://fortune.com/2025/11/09/trump-administration-undo-full-snap-payouts-usda-penalties-shutdown/",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxON214eHFvWFQ3WVZfU0M5TGZkS0RzcmFXNWw3YW0wNk5ZYXphVEZnSkZja09kVWZuWi1fb0EyOTUzd21TT1YzZ1hQSUlLUll2bURHTjRsR0hqM3dvdzY2TDZqbURSUnFkd0p4ak1Hd195SUhBZFdOWml0VUpJZV83c05ZUUNLNWcwYmdBM01jMmZZYWVqZm9YR1FsUGVnNGtwc2pYX2xYbU8wRXVaNGMybjhOaXA?oc=5"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603417/full-snap-benefits-trump-states-order",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.706,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.816,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has ordered states to reverse actions that provided full SNAP (Supplemental Nutrition Assistance Program) benefits to low-income families amid the government shutdown. This directive affects 42 million Americans dependent on food stamps. The decision, enforced through potential financial penalties for non-compliance, follows a Supreme Court stay on lower court rulings that had allowed the benefits. This move has sparked concerns over the potential catastrophic impact on those reliant on the program during the shutdown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants QB Jaxson Dart Suffers Concussion, Fans React to Loss and Coaching",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 10 Nov 2025 02:12:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Giants rookie quarterback Jaxson Dart was ruled out in the fourth quarter against the Bears with a concussion.",
      "Dart's historic day ended early with an injury",
      "New York Giants quarterback Jaxson Dart left Sunday’s game at Chicago after he was hit hard on a designed run in the third quarter.",
      "Brian Daboll Noncommittal About Giants' QB Plans After Jaxson Dart Concussion Sports Illustrated",
      "Giants Fans Want Brian Daboll Fired After Embarrassing Collapse vs. Bears Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Giants' Dart suffers concussion in loss to Bears",
      "Jaxson Dart exits Giants vs. Bears game with concussion after making NFL history",
      "Giants QB Jaxson Dart ruled out vs. Bears with concussion",
      "Brian Daboll Noncommittal About Giants' QB Plans After Jaxson Dart Concussion - Sports Illustrated",
      "Giants Fans Want Brian Daboll Fired After Embarrassing Collapse vs. Bears - Sports Illustrated"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/46908188/giants-qb-dart-suffers-concussion-bears",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/jaxson-dart-injury-updates-giants-qb-bears-game-head-injury-russell-wilson/",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxOeHg0Q2FiZHJ5TWF4eXAzODUtLThvVnA5LXZ6N28yZmZoUGpKZGtkdnJnYnkyUjdvbUJaV3AxYjF2TlhaSzZVUzlFRkgyUm4zaUM2MTluRzFrMGR6S1VBc0duWS1iblh2dXZCM2Etak9QMTVmNHJiRUljaG9iY1ZKMnVQTEtoSzJxYnNrWWdLZzVISUhlM3B4alFMUlN1aFlF?oc=5",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNemFBeGZNQWJ5bTB2Z2xKX08zanFGRGVTWElLRmhNRG9hNm5tbmNXMDN5d0EzLW1VWU5FSzdFNzJ0Zi05aThJRk1XYzJYTVZlMWNrY2lGMlJLUmtXQXpmTGdoM1ZrZnpXbXQxcGJvZ3ZWaDR2Nml0REtpTThaaVFpVDVVUmo1S09o?oc=5"
    ],
    "link": "https://www.espn.com/nfl/story/_/id/46908188/giants-qb-dart-suffers-concussion-bears",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.94,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New York Giants rookie quarterback Jaxson Dart was ruled out during the fourth quarter of a game against the Chicago Bears due to a concussion. This occurred after Dart was hit hard on a designed run in the third quarter. Following the injury, Giants coach Brian Daboll did not provide specific plans for the quarterback position moving forward. Additionally, the team's loss to the Bears has led to a backlash from fans, with some calling for Daboll's firing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Confirms Return of Soldier's Remains from Gaza After 11 Years",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 09:27:54 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Associated Press",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "news.google.com",
      "aljazeera.com",
      "dw.com"
    ],
    "snippets": [
      "Hadar Goldin was killed on Aug. 1, 2014, two hours after a ceasefire took effect ending that year's war between Israel and Hamas.",
      "The Israeli military confirmed the soldier's body had been returned from Gaza after 11 years on Sunday.",
      "Israel confirms receiving the remains of a soldier killed in Gaza in 2014 AP News",
      "Body identified as Israeli soldier Hadar Goldin with the remains of four other deceased captives still in Gaza.",
      "After conducting forensic tests, Israel has confirmed that the remains belong to Hadar Goldin, a soldier killed in Gaza during a humanitarian ceasefire in the 2014 war."
    ],
    "image_url": "",
    "titles": [
      "Israel receives remains of hostage that Hamas says is IDF soldier killed in 2014",
      "Israel receives body of soldier killed in 2014 in Gaza",
      "Israel confirms receiving the remains of a soldier killed in Gaza in 2014 - AP News",
      "Israel receives remains of soldier killed in Gaza in 2014",
      "Hamas hands over body of soldier killed in 2014 Gaza war"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603375/hamas-returns-idf-soldier-hadar-goldin-killed-2014",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c2kp3yjy8q7o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPdTlzZElwWDd0WGJBRTBMcjVKZ2FzYU0takVYR1NxTlVveXhkbFBzdjJidlhLYmZKQVlJUGVUMnVhRkV6NDRuMzduT1NGWHhuS3RvcGs3R2hRMl9HQzZCUDVsWi15OTM4aXF2eFhDcWRtemI1a292M2duaU5qclZIQ0R3UW1odVNZNTloTzZfcVhlTFlEVDlmRHBXVUttSHNQUmdtVE5HZGFtUQ?oc=5",
      "https://www.aljazeera.com/news/2025/11/9/israel-receives-remains-of-soldier-captured-in-gaza-in-2014?traffic_source=rss",
      "https://www.dw.com/en/hamas-hands-over-body-of-soldier-killed-in-2014-gaza-war/a-74679855?maca=en-rss-en-top-1022-rdf"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603375/hamas-returns-idf-soldier-hadar-goldin-killed-2014",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.663,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel confirmed the return of Hadar Goldin's remains, a soldier killed in Gaza during a 2014 ceasefire, after 11 years. The Israeli military received his body from Gaza, with the remains of four other captives still held. Forensic tests verified the identity of the remains as Goldin's.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korea's Ex-President Yoon Indicted for Allegedly Provoking North Korea",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 04:00:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "dw.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "South Korea special prosecutor indicts ex-President Yoon on more charges Reuters",
      "Yoon Suk Yeol ordered drone flights over North Korea to create pretext for martial law, prosecutors allege.",
      "A special prosecutor accused Yoon Suk Yeol, South Korea's ousted president, of trying to stoke tensions by ordering drones into North Korea.",
      "Special prosecutors accused ex-president Yoon Suk Yeol of attempting to goad North Korea into conflict as a pretext for declaring martial law in December 2024."
    ],
    "image_url": "",
    "titles": [
      "South Korea special prosecutor indicts ex-President Yoon on more charges - Reuters",
      "South Korea indicts ex-leader Yoon on charges of aiding the enemy",
      "South Korea's ex-president Yoon indicted on new charges",
      "Special counsel indicts former South Korean president on new charges"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNQTRHeWxMRVRsYVdTZVdoekg2MlJXZENzdFBBYWVZZlVmd0JVR1gtM2hXeTNobzNkR0NfVG1TamtTWlBobmtCWEdhZFJHYnhZS0VfVGhVbzFwNTdncmJHLXI2SFBDMnczOUdBbmFtY1M1MURueThXTWxYUGRHY25XblJyVldpc0JQY01ucXBpcWZ4WWJXSWFuQW1QZXVCWXVTbzl4TFZxQzFuTGllUkZMaWVqOEFIUEZmLXBycE1hVThMZw?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/10/south-korea-indicts-ex-leader-yoon-on-charges-of-aiding-the-enemy?traffic_source=rss",
      "https://www.dw.com/en/south-korea-s-ex-president-yoon-indicted-on-new-charges/a-74681478?maca=en-rss-en-top-1022-rdf",
      "https://www.washingtonpost.com/world/2025/11/10/yoon-suk-yeol-treason-charges/"
    ],
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNQTRHeWxMRVRsYVdTZVdoekg2MlJXZENzdFBBYWVZZlVmd0JVR1gtM2hXeTNobzNkR0NfVG1TamtTWlBobmtCWEdhZFJHYnhZS0VfVGhVbzFwNTdncmJHLXI2SFBDMnczOUdBbmFtY1M1MURueThXTWxYUGRHY25XblJyVldpc0JQY01ucXBpcWZ4WWJXSWFuQW1QZXVCWXVTbzl4TFZxQzFuTGllUkZMaWVqOEFIUEZmLXBycE1hVThMZw?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.879,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A special prosecutor in South Korea has indicted former President Yoon Suk Yeol on charges of attempting to provoke North Korea by ordering drone flights over its territory. These actions were allegedly aimed at creating a pretext for declaring martial law. This development marks a significant escalation in the legal challenges facing Yoon, who has been accused of trying to stoke tensions with North Korea for political purposes.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brindley's OT Goal Lifts Avalanche Over Canucks 5-4; MacKinnon Shines",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 10 Nov 2025 06:06:24 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Gavin Brindley scored 68 seconds into overtime to give the Colorado Avalanche a 5-4 NHL win over the Vancouver Canucks Sunday night.",
      "MacKinnon has 5 points, Avalanche recover to defeat Canucks in OT NHL.com",
      "Nathan MacKinnon had a massive night, scoring a pair of goals and adding three assists, including helping set up Gavin Brindley’s first career OT-winner to lead the Colorado Avalanche past the Vancouver Canucks 5-4."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/2a9a95846a486141cb1056f3d2e1cb0d77b1664bdee69cf433d1193f0e633b69.jpg?quality=65&strip=all",
    "titles": [
      "MacKinnon nets 5 points as Avalanche beat Canucks",
      "MacKinnon has 5 points, Avalanche recover to defeat Canucks in OT - NHL.com",
      "NHL Highlights: Avalanche 5, Canucks 4 (OT)"
    ],
    "url": "https://globalnews.ca/news/11519282/mackinnon-nets-5-points-as-avalanche-beat-canucks/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxQc3RhWUp3aF8tMVJOc0g4bWdZdlBrQ0VyaWFKS1h1Vk9XczRuVi1nU2pOQXpaV1VwZ0hHczVuaG9WZktIcHlOemhqaEJMcjdWQjZkTjhTQzMxcmRUeVpFUW5iQ2JUOUJ0Y0hVX0ZRTHVmU0txSk1hS2pJV0o3bl9ubFZpOG8zVEVMNVR3VFBzQkZNdw?oc=5"
    ],
    "link": "https://globalnews.ca/news/11519282/mackinnon-nets-5-points-as-avalanche-beat-canucks/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.918,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gavin Brindley scored in overtime, securing a 5-4 victory for the Colorado Avalanche against the Vancouver Canucks. Nathan MacKinnon starred with two goals and three assists, playing a crucial role in the win by assisting Brindley's game-winning goal. This match marked Brindley's first career overtime winner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Pledges $2,000 \"Dividend\" for Americans Amid Tariff Policy Review",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 09 Nov 2025 23:57:26 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "LA Times",
      "Fortune",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "latimes.com",
      "fortune.com",
      "marketwatch.com"
    ],
    "snippets": [
      "Trump again promises $2,000 tariff dividend as SCOTUS decision looms Axios",
      "\"A dividend of at least $2000 a person (not including high income people!) will be paid to everyone,\" President Trump posted on his social media platform.",
      "\"The $2,000 dividend could come in lots of forms, in lots of ways,\" Bessent said.",
      "President Donald Trump on Sunday floated the idea of payments of at least $2,000 to most Americans to show the benefits of his tariff policy."
    ],
    "image_url": "",
    "titles": [
      "Trump again promises $2,000 tariff dividend as SCOTUS decision looms - Axios",
      "Trump says Americans will receive $2,000 tariff dividend",
      "Trump promises a $2,000 tariff ‘dividend’ that Treasury secretary says could come via tax cuts already signed into law",
      "Trump floats idea of $2,000 tariff dividend checks to most Americans"
    ],
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE05SzJuRm51cEtIVHBNZV9rQ3Nzam9BNkhRTG9JQVl2RkI1RnE3U0ZUaGlndzNvNVlHeXl4dnIyQzN2Mmc5NWZGREtiWTAyam9XeWJKYWx2TTFERzNxVHNucFV4bEhhbkRfakVwZjlCai1sdHdvMlFzNVhUeC14UQ?oc=5",
    "alternate_urls": [
      "https://www.latimes.com/world-nation/story/2025-11-09/trump-says-americans-will-receive-2-000-tariff-dividend",
      "https://fortune.com/2025/11/09/trump-tariff-dividend-2000-revenue-bessent-tax-cuts-tips-social-security-overtime/",
      "https://www.marketwatch.com/story/trump-floats-idea-of-2-000-tariff-dividend-checks-to-most-americans-e8ec5952?mod=mw_rss_topstories"
    ],
    "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTE05SzJuRm51cEtIVHBNZV9rQ3Nzam9BNkhRTG9JQVl2RkI1RnE3U0ZUaGlndzNvNVlHeXl4dnIyQzN2Mmc5NWZGREtiWTAyam9XeWJKYWx2TTFERzNxVHNucFV4bEhhbkRfakVwZjlCai1sdHdvMlFzNVhUeC14UQ?oc=5",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.808,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Trump has promised a \"dividend\" of at least $2,000 for all Americans, excluding high-income individuals, linked to his tariff policy. This statement comes as the Supreme Court reviews challenges to the policy. Trump suggested on Truth Social that the payment could be distributed in various forms, potentially through tax cuts, according to Bloomberg. The final method of distribution remains unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former NFL Commissioner Paul Tagliabue Dies at 84",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 09 Nov 2025 14:17:04 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press",
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Paul Tagliabue, who helped bring labor peace and riches to the NFL during his 17 years as commissioner but was criticized for not taking stronger action on concussions, died on Sunday at 84 years old.",
      "Paul Tagliabue, NFL commissioner of 17 years who led an era of riches and expansion, dies at 84 AP News",
      "Paul Tagliabue, the NFL commissioner who ran the league for 17 years in an era of riches and expansion, has died at 84.",
      "NEW YORK (AP) — Paul Tagliabue, who helped bring labor peace and riches to the NFL during his 17 years as commissioner but was criticized for not taking stronger action on concussions, died Sunday from heart failure. He was 84. NFL spokesman Brian McCarthy said Tagliabue’s family informed the league"
    ],
    "image_url": "",
    "titles": [
      "Paul Tagliabue, NFL commissioner for 17 years, dies at 84",
      "Paul Tagliabue, NFL commissioner of 17 years who led an era of riches and expansion, dies at 84 - AP News",
      "Paul Tagliabue, former NFL commissioner for 17 years, dies at 84",
      "Paul Tagliabue, NFL commissioner of 17 years who led an era of riches and expansion, dies at 84"
    ],
    "url": "https://www.npr.org/2025/11/09/nx-s1-5603612/paul-tagliabue-nfl-commissioner-dies",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxNaV9udjdxTlM0UkVMZ2pBdWtIX2VweWh1ODFWclByQzJBQk1jZlVvcl9mb21kMWY0TjNzMEkyNlZTdTAxU2FIS19PaG1mUTRoMzBSZFAyNVdhN1dZb1ZYTmJaM3ZJOElLMUQ5cjFNdl9YSm52d1ptMEFPVGlVQmpDNVE1ZGk4MHlCdnJ2aWEtYWNjd0Y4Qkd0RGFCckk?oc=5",
      "https://ottawa.citynews.ca/2025/11/09/paul-tagliabue-nfl-commissioner-of-17-years-who-led-an-era-of-riches-and-expansion-dies-at-84/"
    ],
    "link": "https://www.npr.org/2025/11/09/nx-s1-5603612/paul-tagliabue-nfl-commissioner-dies",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.733,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paul Tagliabue, former NFL commissioner for 17 years and Pro Football Hall of Fame inductee in 2020, died at 84 from heart failure, as confirmed by his family. Tagliabue, known for his role in the league's growth and labor peace, faced criticism for his handling of concussion issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Norris Wins Brazilian GP, Extends Lead in F1 Championship",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 10 Nov 2025 00:29:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Al Jazeera",
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "sportsnet.ca",
      "forbes.com"
    ],
    "snippets": [
      "Norris wins Formula 1’s Brazilian Grand Prix to extend his lead with 3 races left AP News",
      "Lando Norris increased his championship points lead over McLaren teammate Oscar Piastri with three races remaining.",
      "McLaren driver Lando Norris significantly extended his lead in the F1 championship after winning the Brazilian Grand Prix on Sunday, with his main rival and teammate Oscar Piastri receiving a 10-second penalty and again failing to make the podium.",
      "Lando Norris extended his championship lead with a victory in Sao Paulo, while Max Verstappen completed a masterful comeback from the pit lane to finish in third."
    ],
    "image_url": "",
    "titles": [
      "Norris wins Formula 1’s Brazilian Grand Prix to extend his lead with 3 races left - AP News",
      "Norris wins Brazil GP to extend F1 championship lead over Piastri",
      "McLaren’s Lando Norris wins Brazilian Grand Prix",
      "2025 F1 Brazilian Grand Prix Race Results: Norris Wins, Verstappen Goes From Pit Lane To Podium"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNZmlVRDhCOHpKMGxqcjg3Sl9LTi1zODdoN0twWVdkTmhEM19yVElDUG9PY3djTW1uT2hVYXVZVE1DMnp0YjJBQlBpczNsUTJIdXRURkZaUjlHTHpRS0RvS19zTXJfcENfWXpsSThXZnJCNmxmVlpVU0pqb2tmU3NFVHVVYUcwNU5wZDdTQi1nWmh6RmNwdEc2TUQwWVQ2Y3RFeXc?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/sports/2025/11/10/lando-norris-wins-brazil-gp-to-extend-f1-championship-lead-over-piastri?traffic_source=rss",
      "https://www.forbes.com/sites/yaraelshebiny/2025/11/09/2025-f1-brazilian-grand-prix-race-results-norris-wins-verstappen-goes-from-pit-lane-to-podium/"
    ],
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNZmlVRDhCOHpKMGxqcjg3Sl9LTi1zODdoN0twWVdkTmhEM19yVElDUG9PY3djTW1uT2hVYXVZVE1DMnp0YjJBQlBpczNsUTJIdXRURkZaUjlHTHpRS0RvS19zTXJfcENfWXpsSThXZnJCNmxmVlpVU0pqb2tmU3NFVHVVYUcwNU5wZDdTQi1nWmh6RmNwdEc2TUQwWVQ2Y3RFeXc?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.817,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lando Norris won the Formula 1 Brazilian Grand Prix, significantly extending his championship lead over teammate Oscar Piastri. Piastri received a 10-second penalty and didn't make the podium, while Max Verstappen secured third place after starting from the pit lane. With three races left, Norris strengthens his position in the championship standings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Advances Plan to End US Shutdown, Markets Rally",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 04:25:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Forbes",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "forbes.com",
      "fortune.com"
    ],
    "snippets": [
      "Senate Advances Plan to End Shutdown After Some Democrats Agree Bloomberg.com",
      "Aluminum Rises With Copper as US Government Shutdown Nears End Bloomberg.com",
      "Thune Plans Test Vote on Shutdown as Democrats Lean Toward Deal Bloomberg.com",
      "EM Stocks, Currencies Gain as US Shutdown Approaches End Bloomberg.com",
      "The deal, which does not include any guarantees on extending health care subsidies, came under sharp criticism from several Democratic leaders.",
      "The agreement does not guarantee the Affordable Care Act subsidies will be extended, as Democrats have demanded for almost six weeks."
    ],
    "image_url": "",
    "titles": [
      "Senate Advances Plan to End Shutdown After Some Democrats Agree - Bloomberg.com",
      "Aluminum Rises With Copper as US Government Shutdown Nears End - Bloomberg.com",
      "Thune Plans Test Vote on Shutdown as Democrats Lean Toward Deal - Bloomberg.com",
      "EM Stocks, Currencies Gain as US Shutdown Approaches End - Bloomberg.com",
      "Senate Advances Deal To End Shutdown As 8 Democrats Break Rank",
      "Senate takes first step to end shutdown as Bernie Sanders says moderate Democrats voting with GOP are making a ‘horrific mistake’"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPbEJGUHkzTE5UanpPMHdfcHNSUjRJMWVDV2ZqWWZBYmQ5ZTB4UkYyRk5oR3ZYa3RqSVdUR2tKeWJIY0lNcTMwV0pkbWRjc1cwVkwyN011bXpLUUZFUjl6bmFTNV92ekpoT1NTckh6d1QyR3pyVWp0NnNwM3U3TG5xZFgwWkZQdmt5bEJmZ2cxV2l4NXVJV3V0cFZhS0NNRW41STlYT3Y2YUFNc0tGMkw1R1o4TQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxQRGxSejFNR0xYVU5PVktxVnp4bmlSdF9GZFBEWENiMTJVS2FOMjFSY3RaVzdiUnc2UjZpclBWN3NXZUVxam5qN1NBT2lTUFM4eU52S0NWblpmTmtSUl9YT1pDS0MtOWZwTkFCTkpRLTVjUTY2dk9NZGdzcldZc2pfZWZYdEliaHNGZnpTZF9pdDN3TFI1dkkwRE0yZEFJa3FFOXRoNEN5dTV2eWdlUVNQWE14Zw?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNcTdPdUEtei00UzEwblFPb0YtbTFJUzhfWjZ3dE54V05uVzJRNzZadEFzVC1tUW16bUhENDc2TVhPZkNIZ3M5WWlEelBvYTZGTTBDRjBEZWNrTmJUVlFIS25icm1SYUdHV3dPOVgzZ2FQeGVhUWJ6czZNYk9NdTlmaFI0VmNPdERiOGtaX2N4bllYLXhQejljUHhqelBaVjJRaDBVVERuNjBicnZkbUVRNmpvSVQ?oc=5",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQcWx5S1Z1TjNidWtBNjRRRUtaNFF0OXhienVJNmVRQTVKTFM3T2l4LXBjc0dmd1liSHRYQVRpQVRmazNuSzJwblI1dnNIamJGM1ZzNEVRM1BKWUdCbElENGJOa0tlXzdZdkhlbXpNYU01bGRNYUVIU0lRWkxaRm9RVzRIMnEyQUVpX3BRR05RZEpieHBGZDQ5b2dScmxncTVSSjhTRW1xb1ljdw?oc=5",
      "https://www.forbes.com/sites/siladityaray/2025/11/10/senate-votes-to-advance-deal-to-end-shutdown-as-8-democrats-break-rank/",
      "https://fortune.com/2025/11/09/government-shutdown-senate-vote-aca-subsidies-bernie-sanders-moderate-democrats/"
    ],
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPbEJGUHkzTE5UanpPMHdfcHNSUjRJMWVDV2ZqWWZBYmQ5ZTB4UkYyRk5oR3ZYa3RqSVdUR2tKeWJIY0lNcTMwV0pkbWRjc1cwVkwyN011bXpLUUZFUjl6bmFTNV92ekpoT1NTckh6d1QyR3pyVWp0NnNwM3U3TG5xZFgwWkZQdmt5bEJmZ2cxV2l4NXVJV3V0cFZhS0NNRW41STlYT3Y2YUFNc0tGMkw1R1o4TQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.887,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Senate has advanced a plan to end the US government shutdown after securing some Democratic support, despite the deal lacking guarantees for extending Affordable Care Act subsidies—a point of contention among Democrats. This development has positively impacted financial markets, with aluminum and copper prices rising and emerging market stocks and currencies gaining.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: development, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Diageo Appoints Ex-Tesco Chief Sir Dave Lewis as CEO, Shares Jump",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 09:15:09 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Spirits giant Diageo brings in former Tesco chief Dave Lewis to revive growth Reuters",
      "Shares in FTSE 100 drinks group jump on appointment of consumer industry veteran to revive fortunes",
      "Appointment of Sir Dave Lewis as CEO represents major coup for struggling FTSE 100 firm • Business live – latest updates The executive credited with steering Tesco out of the worst financial crisis in its history has been handed the top job at the struggling Guinness maker Diageo. On 1 January, Dave"
    ],
    "image_url": "",
    "titles": [
      "Spirits giant Diageo brings in former Tesco chief Dave Lewis to revive growth - Reuters",
      "Diageo names former Tesco boss Dave Lewis as chief",
      "Troubled drinks giant Diageo names former Tesco boss to lead turnaround push"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPOG1HQ2k2LXd6Z1VSeFlGb3FWVVZ3NXd4SWh5clZTMW04bzRHSThURHgxRHRQcUs2cUNJUE1oY3Jsd2I3M0VsM1F4TlZGT3BnSlVuVUV6YnUtYWpid3AxOG8xUW5DdUlBb2laTEFOc2JVSW9BVUFWUFVWQTNNZ0ZRNUlueUdRY0wwbE9qQmhfNlY0Qy0wY0tKLWtYWWFvcFhLQVRQbmJUc2NJX2FtakdfQmZDRWduT05aYmtXOFFJVkk?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/83113082-98bc-4be8-a8fc-5a9c2849e538",
      "https://www.theguardian.com/business/2025/nov/10/diageo-ceo-former-tesco-boss-dave-lewis"
    ],
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPOG1HQ2k2LXd6Z1VSeFlGb3FWVVZ3NXd4SWh5clZTMW04bzRHSThURHgxRHRQcUs2cUNJUE1oY3Jsd2I3M0VsM1F4TlZGT3BnSlVuVUV6YnUtYWpid3AxOG8xUW5DdUlBb2laTEFOc2JVSW9BVUFWUFVWQTNNZ0ZRNUlueUdRY0wwbE9qQmhfNlY0Qy0wY0tKLWtYWWFvcFhLQVRQbmJUc2NJX2FtakdfQmZDRWduT05aYmtXOFFJVkk?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.981,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Diageo, a leading spirits company, appointed former Tesco chief Sir Dave Lewis as CEO to boost growth, effective January 1. His appointment, seen as a significant move for the FTSE 100 company, led to a jump in Diageo's shares. Lewis is known for his successful turnaround of Tesco, marking this as a strategic effort to revive Diageo's fortunes.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia Awards Ex-President Suharto National Hero Status Amid Criticism",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 06:42:22 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Indonesia grants national hero status to late strongman President Suharto Reuters",
      "Activists condemn award by ex-son-in-law President Prabowo, branding it betrayal of Soeharto's victims and democracy.",
      "Former leader presided over period marked by corruption, nepotism, censorship and claims of rights abuses Indonesia has awarded former authoritarian leader Suharto the title of national hero, in a move that has sparked accusations of historical revisionism in the world’s third-largest democracy. The"
    ],
    "image_url": "",
    "titles": [
      "Indonesia grants national hero status to late strongman President Suharto - Reuters",
      "Indonesia makes former president Soeharto posthumous national hero",
      "Fury as Indonesia declares late authoritarian ruler Suharto a national hero"
    ],
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPRjhXVkdWdllWMVV0bXRGbXBHTklMSG5NYndLUzNvY21nVE5ONWwyQnJheEdhbHBHMzhueTBma3ZWTjlwYURpdksta0R5a1lqdktEaXNLNDZMWGhTT1ptVVlzYlFRUHBKbUdxMDRNODVOanp2MTZvRVAzci03NVhyNmhma3pHbk02M292XzlKZTlwLVlNM3MzcmpDUU5WSUdGY19QVkZjam00aFR6Qm1tUVVxV2JmbVozYUtDaWU2ZXd1X2lyMnBN?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/10/indonesia-makes-former-president-soeharto-posthumous-national-hero?traffic_source=rss",
      "https://www.theguardian.com/world/2025/nov/10/indonesia-declares-president-suharto-national-hero"
    ],
    "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPRjhXVkdWdllWMVV0bXRGbXBHTklMSG5NYndLUzNvY21nVE5ONWwyQnJheEdhbHBHMzhueTBma3ZWTjlwYURpdksta0R5a1lqdktEaXNLNDZMWGhTT1ptVVlzYlFRUHBKbUdxMDRNODVOanp2MTZvRVAzci03NVhyNmhma3pHbk02M292XzlKZTlwLVlNM3MzcmpDUU5WSUdGY19QVkZjam00aFR6Qm1tUVVxV2JmbVozYUtDaWU2ZXd1X2lyMnBN?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Indonesia has posthumously awarded former President Suharto national hero status, a decision made by his ex-son-in-law, President Prabowo. This move has faced criticism from activists who see it as a betrayal of Suharto's victims and an affront to democracy, given Suharto's tenure was marred by corruption, nepotism, censorship, and human rights abuses. Critics accuse the government of historical revisionism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Air Travel Crisis: Over 2,500 Flights Canceled, More Cuts Expected",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 10 Nov 2025 01:04:37 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Duffy: Air travel will slow to a \"trickle\" before Thanksgiving Axios",
      "Airlines will have to slash hundreds of more flights if shutdown continues into next week.",
      "Duffy Warns Thanksgiving Holiday Travel to Slow to a Trickle Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Duffy: Air travel will slow to a \"trickle\" before Thanksgiving - Axios",
      "Transportation Sec. Duffy warns air travel will be 'reduced to a trickle,' with flight cancellations worsening as the shutdown drags on",
      "Duffy Warns Thanksgiving Holiday Travel to Slow to a Trickle - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxONzhhSUpZSGJfZHpEU3lpbUNPcW8zczFCcmVReHNNMXpVeEh2V1VZaEpwZFNsTnhsOFBIZm40Zjg4eFNQOHUwejZ1YWpIS2FtYmhaSWJGWUhEZ21iXzRGcTQyN1BiQXJKX1ZIZnV3akpZV1lZdzVfMDZvTjNSWlNlVGRpWXpGejhNVVNZV2JFZTFDUQ?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/08/government-shutdown-flight-cancelations-faa.html",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPR0xVNkl0ZDlJS3hObExOTWpiMnl4dzZ5dUtsNVlmeWc2RnlsX01iUHRWbExlVXdBRmN0QzVLa09YdEdKQTdGQmxLMTczSUZMT3ZpS2lkcDF0V0ZMV1Yyd0hIZFo5dFRPSUlENTFFOGtYTnJFSHN4VnJ4b19USlBpa1hfSUt4T2Y2aHVHYXptSVhyT2ZmV2NFeHR6ODRtTUp4XzM2Z1pyWXVidUc1M0lyQmJQOA?oc=5"
    ],
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxONzhhSUpZSGJfZHpEU3lpbUNPcW8zczFCcmVReHNNMXpVeEh2V1VZaEpwZFNsTnhsOFBIZm40Zjg4eFNQOHUwejZ1YWpIS2FtYmhaSWJGWUhEZ21iXzRGcTQyN1BiQXJKX1ZIZnV3akpZV1lZdzVfMDZvTjNSWlNlVGRpWXpGejhNVVNZV2JFZTFDUQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.827,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Air travel in the U.S. is facing significant disruption, with over 2,500 flights already canceled. The Transportation Secretary warned that flight reductions could reach 20% if the current shutdown continues into next week. Airlines may cut hundreds more flights, potentially slowing air travel to a \"trickle\" before Thanksgiving, as reported by Axios and observed at major airports nationwide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chara, Keith, Thornton Among 2023 Hockey Hall of Fame Inductees",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 09 Nov 2025 23:50:05 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "CBC",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Matthews salutes Thornton after Hockey Hall of Fame induction NHL.com",
      "Zdeno Chara and Duncan Keith will be inducted into the Hall of Fame alongside fellow former players Joe Thornton, Alexander Mogilny, Jennifer Botterill and Brianna Decker on Monday in Toronto. Jack Parker and Danièle Sauvageau will enter as builders.",
      "Zdeno Chara could hardly believe what had just unfolded. Duncan Keith was in the same boat — at the opposite end of the emotional spectrum. Chara and his Boston Bruins held a 2-1 lead late in Game 6 of the 2013 Stanley Cup final against Keith and the Chicago Blackhawks. A victory on home ice would ensure a winner-take-all finale back in the Windy City. That script then flipped in dramatic fashion. The visitors scored twice in a jaw-dropping 17-second span to stun the Bruins 3-2 and claim the Blackhawks’ second Cup in four years. “Shocking for us,” Chara recalled more than a decade later...."
    ],
    "image_url": "",
    "titles": [
      "Matthews salutes Thornton after Hockey Hall of Fame induction - NHL.com",
      "Chara, Keith, Thornton and rest of Hockey Hall of Fame's 2025 class set for Monday induction",
      "‘Very fortunate’: Hockey Hall of Fame’s 2025 class set for induction"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdjZyNU44bHQxYXZvUWw1S1YtbkNXb0NGWDRRZHhpV1JoWkswd1pILW9oaUZlTDZ5NFBJek5hb2pTWjNIaWRLTG5XaExScEVmOTJDRUE5LTdQTFlteGdtZFh3R2MyM2xSZml3VHpqcXNjaFBUSkRkTzlPRW1sZnpfOFU0RzVSNHk2UHlITTd1NnR6Q0g2Rk1UNUNqWmpXREJ2Q1E?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/sports/hockey/nhl/chara-keith-thornton-hockey-hall-of-fame-2025-class-9.6972731?cmp=rss"
    ],
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdjZyNU44bHQxYXZvUWw1S1YtbkNXb0NGWDRRZHhpV1JoWkswd1pILW9oaUZlTDZ5NFBJek5hb2pTWjNIaWRLTG5XaExScEVmOTJDRUE5LTdQTFlteGdtZFh3R2MyM2xSZml3VHpqcXNjaFBUSkRkTzlPRW1sZnpfOFU0RzVSNHk2UHlITTd1NnR6Q0g2Rk1UNUNqWmpXREJ2Q1E?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.806,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Zdeno Chara, Duncan Keith, Joe Thornton, Alexander Mogilny, Jennifer Botterill, and Brianna Decker were inducted into the Hockey Hall of Fame, with Jack Parker and Danièle Sauvageau entering as builders. The ceremony took place in Toronto. The news recalls a dramatic moment from the 2013 Stanley Cup final where Chara's Bruins lost to Keith's Blackhawks after Chicago scored twice in 17 seconds to win the Cup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Maple Leafs Coach Berube Critiques Team's Defense After Hurricanes Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 10 Nov 2025 05:07:41 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Craig Berube has a front-row seat to what is quickly becoming a horror show.",
      "Toronto Maple Leafs head coach Craig Berube sounds off on the team’s defensive effort against the Hurricanes, stating the roster doesn’t have the proper mindset at the moment and details the need to value the defensive side of the puck more."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/9d01ae5c773fbe95f178e1e4645006a453b0a165079e599c5ec62ddbc5716ebb.jpg?quality=65&strip=all",
    "titles": [
      "Berube blasts Maple Leafs’ defensive commitment",
      "‘We didn’t check anyone’: Berube sounds off on Maple Leafs defence"
    ],
    "url": "https://globalnews.ca/news/11519229/berube-blasts-maple-leafs-defensive-commitment/",
    "alternate_urls": [],
    "link": "https://globalnews.ca/news/11519229/berube-blasts-maple-leafs-defensive-commitment/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Toronto Maple Leafs head coach Craig Berube criticized the team's defensive effort following a game against the Hurricanes. He highlighted a lack of proper mindset within the roster and emphasized the need to prioritize defense.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Channels, Including ESPN, Go Dark on YouTube TV Amid Dispute",
    "domain": "technology",
    "source_domain": "businessinsider.com",
    "location": "global",
    "published": "2025-11-09T22:50:24Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "businessinsider.com",
      "techcrunch.com",
      "theverge.com"
    ],
    "snippets": [
      "Disney and YouTube TV's parent company, Google, have yet to agree on a new licensing contract, leaving YouTube TV subscribers in a bind.",
      "YouTube TV subscribers unhappy about going more than a week without ESPN, ABC, and other Disney networks will be getting a $20 credit that can be applied to their next billing statement.",
      "On October 31st, ESPN, ABC, Nat Geo, and over 20 other Disney-owned channels went dark on YouTube TV. As the two sides disagree about terms for a new content distribution contract, Google has accused Disney of trying to raise prices for its customers in an effort to boost its own Hulu + Live TV and"
    ],
    "image_url": "https://i.insider.com/6911065762a04500b3160afa?format=jpeg",
    "titles": [
      "YouTube TV is now offering customers a $20 credit as its conflict with Disney drags on",
      "YouTube TV is giving customers a $20 credit for Disney blackout",
      "YouTube TV, ESPN, and Disney: the latest on the blackout"
    ],
    "url": "https://www.businessinsider.com/youtubetv-credit-disney-google-licensing-negotiations-2025-11",
    "alternate_urls": [
      "https://techcrunch.com/2025/11/09/youtube-tv-is-giving-customers-a-20-credit-for-disney-blackout/",
      "https://www.theverge.com/news/817403/youtube-tv-disney-espn-blackout-updates"
    ],
    "link": "https://www.businessinsider.com/youtubetv-credit-disney-google-licensing-negotiations-2025-11",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.789,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney and Google have not reached a new licensing agreement, causing over 20 Disney-owned channels, including ESPN and ABC, to go dark on YouTube TV since October 31st. As negotiations continue, with Google accusing Disney of attempting to raise prices, YouTube TV is offering subscribers a $20 credit for the inconvenience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syrian President al-Sharaa to Meet Trump at White House, First Since 1946",
    "domain": "general",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 05:00:54 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "theguardian.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Ahmed al-Sharaa is expected to push for full lifting of remaining sanctions imposed during 13-year civil war Syria’s president, Ahmed al-Sharaa , will on Monday hold talks with Donald Trump at the White House, the first such official visit by a Syrian leader since national independence in 1946. He i",
      "Ahmed al-Sharaa, the rebel leader who became Syria’s president after ousting Bashar al-Assad, has walked an improbable path from al-Qaeda to the West Wing."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9c0b7031ba7e6fb03da3bec0fa2ef7ac08eb80c8/1526_205_3652_2922/master/3652.jpg?width=140&quality=85&auto=format&fit=max&s=4d4ea5b6ca7f7cd8b3837df8a3351889",
    "titles": [
      "Syrian president to hold talks with Trump at White House",
      "Syrian president to meet with Trump in White House after unlikely ascent"
    ],
    "url": "https://www.theguardian.com/world/2025/nov/10/syrian-president-talks-trump-white-house",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/10/sharaa-trump-white-house-syria/"
    ],
    "link": "https://www.theguardian.com/world/2025/nov/10/syrian-president-talks-trump-white-house",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.898,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ahmed al-Sharaa, Syria's president and former rebel leader, will meet with Donald Trump at the White House on Monday, marking the first official visit by a Syrian leader since 1946. Al-Sharaa, who rose to power after ousting Bashar al-Assad and has a history with al-Qaeda, aims to discuss the full lifting of sanctions imposed during Syria's 13-year civil war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Airlines Cancel 2,700+ Flights Amid Shutdown, Affecting Thanksgiving Travel",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 10 Nov 2025 02:57:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "CityNews"
    ],
    "domains": [
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "US airlines’ daily cancellations exceed 2,700 as shutdown impact extends AP News",
      "WASHINGTON (AP) — U.S. airlines canceled more than 2,100 flights on Sunday as Transportation Secretary Sean Duffy warned that air traffic in the U.S. could “slow to a trickle” if the federal government shutdown lingers into the busy Thanksgiving travel holiday season. The slowdown at 40 of the natio"
    ],
    "image_url": "",
    "titles": [
      "US airlines’ daily cancellations exceed 2,700 as shutdown impact extends - AP News",
      "US airlines’ daily cancellations top 2,000 for first time since shutdown cuts began"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaG5IVkZGRnYzZG1uZGc5SFZ5bFE2V1VPdmo5cWdnUHFlSWNUdGpFTWVQX1dqMURuTHJLa3IzSlowbV9PZkJkaVV6RXc3dkc0cExZTVpYeHBQVlVGcUlITjFKdVVLRE5QYklIbjktSDhjR19pdnE0ZXBKd0F6Z2p2VXQ0THJhRFd6bXZ5cmc2V2xLVGRYMTVwT3Z6Z21DRy10Nnc?oc=5",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/11/09/us-airlines-daily-cancellations-top-2000/"
    ],
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaG5IVkZGRnYzZG1uZGc5SFZ5bFE2V1VPdmo5cWdnUHFlSWNUdGpFTWVQX1dqMURuTHJLa3IzSlowbV9PZkJkaVV6RXc3dkc0cExZTVpYeHBQVlVGcUlITjFKdVVLRE5QYklIbjktSDhjR19pdnE0ZXBKd0F6Z2p2VXQ0THJhRFd6bXZ5cmc2V2xLVGRYMTVwT3Z6Z21DRy10Nnc?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. airlines canceled over 2,100 flights on Sunday, with the total exceeding 2,700 due to the federal government shutdown. Transportation Secretary Sean Duffy warned that air traffic could significantly slow, impacting the Thanksgiving travel season. The disruption affects 40 national airports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super-Typhoon in Philippines: 2 Dead, 1.4M Displaced",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 10 Nov 2025 06:37:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Powerful storm set off floods and landslides, killing at least two and displacing 1.4 million .",
      "At least two people found dead as super-typhoon hits Philippines, days after Typhoon Kalmaegi killed at least 224 More than 1 million people have been evacuated from their homes in the Philippines and at least two people have been killed as Typhoon Fung-wong – the second big storm to hit in days – m"
    ],
    "image_url": "",
    "titles": [
      "Philippines assesses damage after deadly Typhoon Fung-wong",
      "More than 1 million evacuated in the Philippines as Typhoon Fung-wong makes landfall"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/10/philippines-assesses-damage-after-deadly-typhoon-fung-wong?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/09/more-than-100000-evacuated-in-the-philippines-as-fung-wong-intensifies-into-super-typhoon"
    ],
    "link": "https://www.aljazeera.com/news/2025/11/10/philippines-assesses-damage-after-deadly-typhoon-fung-wong?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A super-typhoon in the Philippines resulted in at least two deaths and displaced over 1.4 million people. This follows Typhoon Kalmaegi, which claimed at least 224 lives. Typhoon Fung-wong, marking the second major storm in a short period, caused widespread evacuations and significant damage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Returns Remains of Lt. Hadar Goldin to Israel from 2014 Gaza War",
    "domain": "general",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Sun, 09 Nov 2025 19:03:59 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Here’s what to know about hostages and others whose bodies have been returned by Hamas to Israel, and those who remain in Gaza.",
      "Hamas returned to Israel the remains of Lt. Hadar Goldin, who was killed in a 2014 war in Gaza."
    ],
    "image_url": "",
    "titles": [
      "Body of Israeli soldier Hadar Goldin returned from Gaza after 11 years",
      "Hamas Hands Over Body of Hadar Goldin, Israeli Soldier Held Since 2014"
    ],
    "url": "https://www.washingtonpost.com/world/2025/10/14/hamas-gaza-israel-hostages-killed/",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/09/world/middleeast/hamas-hadar-goldin-israel.html"
    ],
    "link": "https://www.washingtonpost.com/world/2025/10/14/hamas-gaza-israel-hostages-killed/",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.73,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has returned the remains of Lt. Hadar Goldin to Israel. Goldin was killed in the 2014 Gaza war. This development is part of the ongoing issue of hostages and remains of individuals between Israel and Hamas, with some still remaining in Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Origin Delays New Glenn Rocket Launch Due to Weather",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 09 Nov 2025 21:45:37 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Jeff Bezos’ Blue Origin Rocket Set to Launch First NASA Mission Bloomberg.com",
      "Blue Origin, the space company owned by billionaire Jeff Bezos, was forced Sunday to postpone the anticipated launch of its New Glenn rocket due to unfavorable weather conditions.",
      "New Glenn, the towering rocket built by Jeff Bezos's space company Blue Origin, is set to take off on its second mission Sunday as competition intensifies with Elon Musk's SpaceX."
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos’ Blue Origin Rocket Set to Launch First NASA Mission - Bloomberg.com",
      "Bezos's Blue Origin postpones rocket launch over weather",
      "Bezos's Blue Origin set to launch NASA mission to Mars"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNTEN0bl9UQWRLdVdNeExyNW50Zm1Fb04xTUR3U3FoWFpoaXlrNFg2V0hXZVVPMWdMR1lZbHEyN1dDNW0tYUFIOEZfcDVkZ3M0ay05V1l1R3M0eFFDRnpaTzhwVm9ldEV0NGtLYmlXWE85eU5GVC1qZmhwMFVPS0poUThtYV9UdXAtQTJicWxnX2RHYW45cU9waTRsU3YtYTI0aXFKZjhJWUFIeXJONnhKSi1OZw?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2025-11-bezos-blue-postpones-rocket-weather.html",
      "https://phys.org/news/2025-11-bezos-blue-nasa-mission-mars.html"
    ],
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNTEN0bl9UQWRLdVdNeExyNW50Zm1Fb04xTUR3U3FoWFpoaXlrNFg2V0hXZVVPMWdMR1lZbHEyN1dDNW0tYUFIOEZfcDVkZ3M0ay05V1l1R3M0eFFDRnpaTzhwVm9ldEV0NGtLYmlXWE85eU5GVC1qZmhwMFVPS0poUThtYV9UdXAtQTJicWxnX2RHYW45cU9waTRsU3YtYTI0aXFKZjhJWUFIeXJONnhKSi1OZw?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.772,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Blue Origin, owned by Jeff Bezos, postponed the launch of its New Glenn rocket, initially planned for its first NASA mission, due to bad weather. This event marks a significant step for Blue Origin as it competes with Elon Musk's SpaceX.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]