[
  {
    "title": "James Comey Pleads Not Guilty to Lying to Congress, Trial Set for Jan 5",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 10:52:38 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "The Guardian",
      "Forbes",
      "Financial Times",
      "Global News",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.forbes.com",
      "www.theguardian.com",
      "globalnews.ca",
      "www.aljazeera.com",
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "The former FBI director, who has long been one of President Trump's most vocal critics, was indicted last month on two counts stemming from his testimony before the Senate Judiciary Committee in September 2020.",
      "Trump critic James Comey pleads not guilty to charges that he made false statements to Congress.",
      "The Trump administration has accused the former FBI director of lying to Congress. Comey had led the FBI's investigation into Russian election meddling in 2016, and Trump had asked the Justice Department to pursue Comey.",
      "Former FBI chief who oversaw probe into Donald Trump’s alleged links to Russia will face trial on January 5",
      "<p>Case marks significant step in Trump’s efforts to politicize the justice department and punish political enemies</p><p>The former FBI director James Comey pleaded not guilty in court on Wednesday in connection <a href=\"https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indic",
      "Former FBI Director James Comey has pleased not guilty to a Justice Department case accusing him of lying to the Senate Judiciary Committee in 2020.",
      "Comey's arraignment came amid new reporting suggesting the Justice Department may not have a strong case against Trump’s longtime political foe."
    ],
    "image_url": "",
    "titles": [
      "Former FBI director Comey pleads not guilty to federal charges of lying to Congress",
      "Trump live: Ex-FBI chief Comey pleads not guilty",
      "Former-FBI director James Comey enters not guilty plea",
      "James Comey pleads not guilty to charge of lying to US Congress",
      "Ex-FBI director James Comey pleads not guilty on lying to Congress charge",
      "Ex-FBI head James Comey pleads not guilty in case pushed by Trump",
      "Former FBI Director Comey Will Go To Trial In January As He Pleads Not Guilty To Criminal Charges"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.972,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.879,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey, a critic of President Trump, pleaded not guilty to charges of making false statements to Congress during his 2020 testimony regarding the FBI's investigation into Russian election interference. His indictment and arraignment mark a significant development in what critics see as Trump's attempt to use the Justice Department against political adversaries. Comey's trial is scheduled for January 5. Reports suggest the case against Comey may lack strength.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Edmonton Oilers Extend Mattias Ekholm with $12M Contract for 3 Years",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 10:49:37 EST",
    "source": "ESPN",
    "sources": [
      "Global News",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Oilers have signed defenseman Mattias Ekholm to a three-year, $12 million extension.",
      "The Edmonton Oilers have signed defenceman Mattias Ekholm to a three-year, US$12-million contract extension, the team announced Wednesday.",
      "<p>After locking down their captain for two years and ramping up the urgency to win a Stanley Cup, the Edmonton Oilers took care of another piece of business on Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Oilers follow McDavid extension with Ekholm deal",
      "Oilers sign Ekholm to three-year extension",
      "Oilers sign Mattias Ekholm to three-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.971,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Edmonton Oilers have signed defenseman Mattias Ekholm to a three-year contract extension worth $12 million, as announced by the team. This move is part of the Oilers' efforts to strengthen their roster in pursuit of a Stanley Cup victory.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Stops Flotilla Trying to Break Gaza Blockade, Detains Activists",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:28:18 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>New group of vessels intercepted in international waters while at least seven people from previous flotilla still held</p><p>A Gaza-bound humanitarian flotilla aimed at breaking Israel’s naval blockade has been intercepted by the Israeli military, days after the detention of activists on an earli",
      "It was the second attempt in as many weeks to breach the restrictions around the Gaza Strip. Neither has succeeded.",
      "TEL AVIV, Israel (AP) — The Israeli military intercepted a nine-boat flotilla trying to break Israel’s naval blockade of Gaza early Wednesday in the Mediterranean Sea and detained scores of activists on board, the flotilla organizers and the Israeli Foreign Ministry said. The ministry said the 145 a"
    ],
    "image_url": "https://i.guim.co.uk/img/media/300d199ae1759e9f15131c5c96115464947dd5a0/77_0_2433_1947/master/2433.jpg?width=140&quality=85&auto=format&fit=max&s=c84fed7503fa6253762f877289148d27",
    "titles": [
      "Israel halts another Gaza aid flotilla as MEPs demand activists’ release",
      "Israel Intercepts Another Activist Flotilla That Aimed to Break Gaza Blockade",
      "Israeli military intercepts another flotilla heading to Gaza and detains scores of activists"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli military intercepted a nine-boat flotilla attempting to break Israel's naval blockade of Gaza in the Mediterranean Sea, detaining scores of activists. This incident marks the second unsuccessful attempt in recent weeks to breach the blockade, with at least seven activists from a previous flotilla still being held.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Football Projections: Top Picks & Risers Revealed",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 15:53:18 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "SportsLine's model reveals its Week 6 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "Jayden Daniels, Christian McCaffrey, Puka Nacua, and Tyler Warren highlight positional rankings for Week 6 of the 2025 NFL season.",
      "From Bo Nix to Isiah Pacheco, here are the biggest fantasy football Week 6 risers and fallers to guide your lineup decisions."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2024/11/16/42d77343-1b6f-431c-bfa1-2fe19500eeef/jared-goff-cbs-3.jpg",
    "titles": [
      "Fantasy Football Rankings, sleepers, streamers, cheat sheets for NFL Week 6, 2025 in PPR, standard leagues",
      "Matthew Berry’s Fantasy Football Rankings for Week 6 of 2025 season",
      "Week 6 Fantasy Football Stock Report: Risers And Fallers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine released Week 6 Fantasy football projections, PPR rankings, and start-sit advice, highlighting Jayden Daniels, Christian McCaffrey, Puka Nacua, and Tyler Warren. The report also identifies the week's major risers, including Bo Nix and Isiah Pacheco, to assist in lineup decisions for platforms like CBS Sports, ESPN, and Yahoo.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kemi Badenoch Pledges to Scrap Stamp Duty on Primary Homes to Cut Deficit",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:17:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The Tory leader says the move would help millions buy a home, in her annual conference speech.",
      "Leader pitches Conservatives as party of spending control with promise to drive down Britain’s deficit",
      "<p>Leader announces tax cut plan for England and Northern Ireland in speech aimed at boosting fiscal credibility</p><p>The Conservatives will scrap stamp duty on sales of primary residences if they win the next election, Kemi Badenoch has said, in a policy-heavy speech designed to improve her standi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3560/live/3eedd230-a444-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Conservatives would scrap stamp duty on main homes, Badenoch says",
      "Badenoch vows to scrap stamp duty",
      "Tories will scrap stamp duty on primary residences, Kemi Badenoch tells conference"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.961,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Conservative Party leader, Kemi Badenoch, has promised to eliminate stamp duty on sales of primary residences to reduce Britain's deficit and boost the party's fiscal reputation. This policy, aimed at freeing up the housing market and enhancing social mobility, was announced in a speech focusing on fiscal responsibility. Concurrently, the Labour deputy leadership election begins, with Lucy Powell viewed as the frontrunner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stanford Football Gets $50M Boost from Alum for Revival with Andrew Luck",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 10:49:37 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Stanford football program received a $50 million gift from a former player, the school announced Wednesday, marking a significant donation as it attempts to revive the fortunes of the program under general manager Andrew Luck.",
      "Stanford football has received a $50 million gift from former player Bradford Freeman, the school announced Wednesday, a boost to a program seeking a turnaround under general manager Andrew Luck.  Among other things, the donation will cover five new football scholarships and help with name, image an"
    ],
    "image_url": "",
    "titles": [
      "Former player donates $50M to Stanford football",
      "Stanford football receives $50 million gift from former player Bradford Freeman"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Stanford football received a $50 million donation from ex-player Bradford Freeman, announced on Wednesday. This significant contribution aims to rejuvenate the program with Andrew Luck as general manager. The funds will support five new scholarships and assist with name, image, and likeness endeavors.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Accuses Pritzker, Chicago Leaders Without Evidence",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 13:14:30 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNODU0dE5Ea1BGZFR0dl8yOWs0c1MtMnlpV2JmLVpZUUJ6em5Ta3lIOXhCLWdmZ1FPOG9NTnlwUHhWSkU2ekhaXy1jRVFhTElkS2VfR0hPT21taTJadkpVd3c5VWRZZDJTQjlHQ2RGemNOTWtWZ0JQdGNZUmZid0lDbzFTRUd5Zw?oc=5\" target=\"_blank\">Trump baselessly calls for Pritzker, Chicago ",
      "The president claimed the two leaders failed to “protect Ice Officers.”"
    ],
    "image_url": "",
    "titles": [
      "Trump baselessly calls for Pritzker, Chicago mayor to be jailed - Axios",
      "Trump Says Illinois Gov. J.B. Pritzker And Chicago Mayor Brandon Johnson Should Be Jailed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump made baseless accusations against Governor Pritzker and Chicago's leadership, alleging their failure to protect ICE officers. No evidence was provided to support his claims.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mariners' Raleigh Gifts Bat to Fan After ALDS Game 3 Win Over Tigers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 11:53:09 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "After the game, Cal Raleigh posed alongside the fan with an autographed bat to say thanks.",
      "<p>They say never meet your heroes, but sometimes fate has other plans. While the Seattle Mariners were busy celebrating an 8-4 win over the Detroit Tigers in Game 3 of their ALDS matchup — to take a 2-1 series lead — one fan got a couple more reasons to cheer.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Dump 61 Here': Raleigh meets fan who caught his home run ball",
      "Mariners fan sporting ‘Dump 61 here’ shirt catches homer, meets Raleigh"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Following the Seattle Mariners' 8-4 victory over the Detroit Tigers in Game 3 of their ALDS matchup, securing a 2-1 series lead, Cal Raleigh, a player from the Mariners, expressed gratitude to a fan by posing for a photo and gifting an autographed bat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel in Chemistry for Pioneers of Pollution-Fighting Frameworks",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 06:08:02 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "From capturing carbon dioxide from the atmosphere or sucking water out of dry desert air, the trio's new form of molecular architecture can absorb and contain gases inside metal organic frameworks.",
      "The work that won Susumu Kitagawa, Richard Robson and Omar M. Yaghi the 2025 Nobel Prize in chemistry could help tackle challenges such as climate change and lack of fresh water."
    ],
    "image_url": "",
    "titles": [
      "Research on metal-organic frameworks gets the chemistry Nobel Prize",
      "Trio wins chemistry Nobel Prize for metal organic framework"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar M. Yaghi were awarded the 2025 Nobel Prize in Chemistry for their development of metal–organic frameworks. These structures are capable of capturing carbon dioxide, storing toxic gases, catalyzing chemical reactions, and harvesting water from desert air. Their groundbreaking work offers potential solutions to global challenges like climate change and water scarcity.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Winnipeg Jets Sign Kyle Connor to $96M, Eight-Year Extension",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 10:49:37 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Winnipeg Jets have signed star forward Kyle Connor to an eight-year, $96 million extension, the team announced on Wednesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNYTBSYy1FTHpWemx3TVBHbU1qTEhNVS1EbFItd3RBN3FlVTMxOU1valNoTHpWWGQ0Ym8wVjhiYUhJcmJ2SHgzSENMcU9QT3RTRHBSek1rSEtYRUFYTHJ1SkEwbzFQU2tvcWhRWGtlbElKbnBoVkhEZDNoNkdYQUFrMDhFNENYSXIwX2ViNjR5Y2N2Z0dwN1RwVWE5RQ?oc=5\" target=\"_blank\">RELEASE: Jets sig"
    ],
    "image_url": "",
    "titles": [
      "Jets lock up forward Connor with $96M extension",
      "RELEASE: Jets sign Connor to an eight-year contract extension - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Winnipeg Jets have signed Kyle Connor, a star forward, to an eight-year, $96 million extension. The team announced this on Wednesday. The deal secures Connor's future with the Jets for a significant period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Darius Slayton Likely Out vs. Eagles Due to Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 10:49:37 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sportsnaut.com",
      "www.espn.com"
    ],
    "snippets": [
      "Giants wide receiver Darius Slayton (hamstring) is not expected to play Thursday night against the Eagles, sources tell ESPN's Jeremy Fowler.",
      "The New York Giants (1-4) will look to rebound quickly from their 26-14 defeat at the hands of the previous"
    ],
    "image_url": "",
    "titles": [
      "Sources: Giants WR Slayton likely out vs. Eagles",
      "Four Keys to a Giants Upset Over the Eagles"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Darius Slayton, Giants wide receiver, is likely to miss Thursday's game against the Eagles due to a hamstring injury, as reported by ESPN's Jeremy Fowler. This comes as the New York Giants, with a 1-4 record, aim to recover from a 26-14 loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Real Madrid Eyes Haaland, Rodrygo Reveals Offers Amid Transfer Speculation",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 04:59:13 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Real Madrid are ready to replace Vinícius Júnior with Manchester City striker Erling Haaland. Transfer Talk has the latest news and rumors.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPNFFyanRWM2hYYUtZM21fYzkwdHA4VDZOUHRqcUZwTDRNZWJrX1IwMGl1VDk2MVQ4bFRwYXlKTkJNdjVvVlNqTG9yblFOSWdWZVNYNGNRc2RGSTNDUUhtSUhCRzZqa1J2WVNaM01yR1Z5dkVnUTZKV0g4bU1VZ0c0Z1ZxMUVFMVhrVjYw?oc=5\" target=\"_blank\">‘I Have Offers’—Rodrygo Breaks Silence ",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBlaEZBZHM0Uzh6TTFWQnRQSG04d3BHWXYtS1FrOGN0WHBXUHRHU2M4NzdkNEI1ck9NTjlvUXB6dnMyUExCdnpyZmh5Wmp4SEVxNlQ2c1dwU21qN1I1YlZ4X0xVVHRzN19hWk1aZE80Nklnb1I0YXEwQ3B3?oc=5\" target=\"_blank\">The Pivotal Moment That Made Rodrygo Choose Real Madrid Over Ba"
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Vini Jr. out, Haaland in at Real Madrid?",
      "‘I Have Offers’—Rodrygo Breaks Silence on Transfer Rumors, Real Madrid Future - Sports Illustrated",
      "The Pivotal Moment That Made Rodrygo Choose Real Madrid Over Barcelona - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Real Madrid is considering replacing Vinícius Júnior with Manchester City's Erling Haaland, according to Transfer Talk. Meanwhile, Rodrygo has publicly acknowledged receiving offers, without specifying from which clubs, amid speculation about his future. This development comes as Rodrygo reflects on his pivotal decision to join Real Madrid over Barcelona.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England's 'Golden Generation' Blames Tactics, Management for Failures",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:26:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Tactical shortcomings, misguided managers or stellar opponents - why do England's so-called 'Golden Generation' think they failed to deliver success?",
      "Tactical shortcomings, misguided managers or stellar opponents - why do England's so-called 'Golden Generation' think they failed to deliver success?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3eac/live/fa17dbb0-a44d-11f0-8a21-ff96e44d1cc2.jpg",
    "titles": [
      "How England's 'Golden Generation' describe the reasons why they failed",
      "How England's 'Golden Generation' describe the reasons why they failed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.964,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England's 'Golden Generation' of football players reflect on their lack of success, attributing it to tactical shortcomings, poor management decisions, and facing strong opponents. They believe these factors contributed to their failure to achieve significant success in international competitions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Drops Spying Charges Against Two Men Due to Insufficient Evidence",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:02:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Prosecutors say they were unable to obtain evidence from the government to meet the threshold for prosecution.",
      "<p>Ministers and officials did not provide statements that China was threat despite ‘many months’ of effort to obtain them</p><p>Charges against two men accused of spying for China <a href=\"https://www.theguardian.com/uk-news/2025/sep/15/british-prosecutors-drop-case-against-two-men-accused-of-spyin"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/99b2/live/668aeee0-a3b3-11f0-9871-a159926144cf.jpg",
    "titles": [
      "Spy case collapse blamed on UK government failure to label China a threat",
      "China ‘spies’ case was dropped after government failed to provide evidence of Beijing threat"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British prosecutors dropped charges against two men accused of spying for China due to a lack of evidence. Despite efforts over many months, prosecutors could not obtain necessary statements from ministers and officials to meet the threshold for prosecution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bank of England Warns of AI Market Correction Risk",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 13:37:34 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Bank of England has warned that risk of a sharp market correction has increased, amid stretched AI-related valuations.",
      "<p>Possibility of ‘sharp market correction has increased’, says Bank’s financial policy committee </p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/08/spot-gold-rises-above-4000-first-time-vertu-motors-warns-profit-hit-jlr-disruption-federal-reserve-imf-business-live\">Busine"
    ],
    "image_url": "",
    "titles": [
      "Bank of England warns of 'sharp market correction' if AI bubble bursts",
      "Bank of England warns of growing risk that AI bubble could burst"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Bank of England's financial policy committee has cautioned about a heightened risk of a sharp market correction due to inflated AI-related valuations. The warning comes amidst concerns over market stability and potential disruptions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Witkoff, Kushner in Egypt for Gaza Ceasefire Talks Amid Prisoner Swap Proposal",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:21:29 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Steve Witkoff and Jared Kushner's arrival in Egypt comes after Hamas submitted a list of Palestinian prisoners it wants Israel to release in exchange for hostages.",
      "Steve Witkoff and Jared Kushner joined Gaza ceasefire talks in Egypt, signaling some hope for a breakthrough though major sticking points remain."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d0a4/live/5d0e8c80-a432-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Key US and regional mediators join talks in push to end Gaza war",
      "Senior U.S. negotiators join Gaza ceasefire talks as momentum builds"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Steve Witkoff and Jared Kushner arrived in Egypt to participate in Gaza ceasefire talks following Hamas's submission of a list of Palestinian prisoners for a potential exchange with Israel for hostages. Their involvement suggests a possibility for progress, although significant challenges persist.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Final Day of Amazon Prime October Sale Ends Tonight",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-08T10:19:05-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com"
    ],
    "snippets": [
      "We’re now in the second and final day of Amazon’s October Prime Day sale. That means it’s time to squeeze as much value out of your Prime subscription as you can until Thursday at 3AM ET / 12AM PT, which is when several deals will enter a brief hibernation ahead of Black Friday and Cyber [&#8230;]",
      "Updated deals on keyboards, laptops, chargers, cameras, and lots of other stuff!"
    ],
    "image_url": "",
    "titles": [
      "The 207 best October Prime Day deals",
      "It’s Prime Day 2025 part two, and here are more of the best deals we could find"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's October Prime Day sale is in its final day, ending Thursday at 3AM ET / 12AM PT. This event offers Prime subscribers exclusive deals on a variety of products including keyboards, laptops, chargers, and cameras. After this sale, these deals will pause until Black Friday and Cyber Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Furyk, Weir Discuss Strategies for World Champions Cup at Feather Sound",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 10:00:19 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "Captains Jim Furyk and Mike Weir share their insights in the lead up to the global golf battle royale set to hit the fairways of Feather Sound Country Club.",
      "<p>Mike Weir is back in the captain&#8217;s chair. The Canadian will lead Team International at December&#8217;s World Champions Cup.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e5b5beb2839f3ebe05d452/0x0.jpg?width=960",
    "titles": [
      "Three Globe-Spanning Teams Prepare For Skechers World Champions Cup",
      "Mike Weir to captain Team International at senior tour’s World Champions Cup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Captains Jim Furyk and Mike Weir discuss strategies before the World Champions Cup at Feather Sound Country Club. Mike Weir returns as captain for Team International in the December event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gisele Pelicot Testifies in Retrial, Accuses Dogan of Rape and Cowardice",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T13:28:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Gisele Pelicot has testified in the appeal hearing of the only man contesting his conviction of raping her in the presence of her husband. She told the man she never gave him consent and accused him of cowardice.",
      "<p>Woman says at retrial of Husamettin Dogan that ‘no victim should feel shame’ as court shown video evidence</p><p><a href=\"https://www.theguardian.com/world/gisele-pelicot-rape-trial\">Gisèle Pelicot</a>, who survived almost a decade of rape by dozens of men after she was drugged by her ex-husband,"
    ],
    "image_url": "",
    "titles": [
      "Pelicot tells rape appellant she 'never' gave him consent",
      "Gisèle Pelicot tells appeal trial she never gave consent to man convicted of rape"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gisele Pelicot testified against Husamettin Dogan, the only man appealing his rape conviction, stating she did not consent and accused him of cowardice. During the retrial, she emphasized that no victim should feel shame. The court was presented with video evidence of her ordeal, which spanned nearly a decade involving multiple assailants after being drugged by her ex-husband.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "900 Stranded on Everest's Chinese Side Rescued After Snowstorm",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 01:02:59 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "About 900 hikers, guides and other staff who were stranded by a weekend snowstorm on the Chinese side of Mount Everest have reached safety, state media said late Tuesday.",
      "Some 580 hikers and over 300 mountain guides, yak handlers or support staff were rescued, Chinese state media said, after heavy snows stranded them on Mount Everest."
    ],
    "image_url": "",
    "titles": [
      "Hundreds of hikers rescued from Mount Everest after severe snowstorm",
      "Hundreds of Mount Everest hikers rescued from snowstorm; 10 remain"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Approximately 900 individuals, including hikers, guides, yak herders, and staff, stranded by a weekend snowstorm on the Chinese side of Mount Everest, were safely rescued by late Tuesday. The group, caught in a heavy snowstorm starting Friday, has now reached safety, according to state media reports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Germany to Expand Police Powers to Down Drones Amid Budget Cuts",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T12:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Following a series of recent incidents, the German government wants to boost police powers to shoot down drones. Meanwhile, Finance Minister Lars Klingbeil has warned of cuts to plug a budget deficit. DW has more.",
      "<p>Cabinet agrees draft legislation after spate of sightings, including over Munich airport</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates\">Europe live – latest updates</a></p></li></ul><p>German police will be allowe"
    ],
    "image_url": "",
    "titles": [
      "Germany news: Police to be allowed to shoot down drones",
      "Germany draws up law to allow police to shoot down drones"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The German government is moving to enhance police authority to shoot down drones following a series of incidents, including sightings over Munich airport. This decision comes as part of draft legislation agreed upon by the cabinet. Concurrently, Finance Minister Lars Klingbeil has indicated forthcoming budget cuts to address a deficit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OMB: 2019 Back Pay Law Doesn't Cover Furloughed Workers Amid Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 09:58:23 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUS1lYl9GYkRZTWZLaTRhZ0dCMjg1SGJXUUpzdVpoUzdCTjB6VFpuUmpEX2lLMF82N0xtdURXZFY1aUtnZmZQN2FhWUc4ZjY1UWRsNldxaDJ3ZW9VZHJyU2xOeHFVUHliZXJ3OE1zY00tOVRjY1J5cnp6aWRObXhXakY3RFhwQktj?oc=5\" target=\"_blank\">Congress erupts over \"lawless\" Trump threat",
      "Trump also said at the White House that if the shutdown drags on several days longer, a \"substantial\" number of jobs \"will never come back.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQeTdNcElLQ2hOX1pDXzdzZktyX2t2M2lheUM5YlMxZ0sxODRybHJWMXpaeW1OU3EzbWp4ZFRhYjcwV0lYY1lsTkhDdEtpeGx3Z2FTM3RJMUpPRUJ0MTZsYVlJMUtxU2pucWlLbXBtY1NPRWNDODZjNDlkdXZjd1hxUWRYRjQ?oc=5\" target=\"_blank\">Scoop: White House memo says furloughed federal "
    ],
    "image_url": "",
    "titles": [
      "Congress erupts over \"lawless\" Trump threat not to pay back furloughed federal workers - Axios",
      "Trump suggests not all furloughed workers will get back pay: 'It depends'",
      "Scoop: White House memo says furloughed federal workers aren't entitled to backpay - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House's Office of Management and Budget (OMB) contends that a 2019 law ensuring federal employees receive back pay after a shutdown does not apply to furloughed workers. This interpretation has sparked controversy amid the ongoing government shutdown, leaving furloughed federal employees at risk of not getting back pay as previously guaranteed by the 2019 legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SoftBank Acquires ABB's Robotics Division for $5.4 Billion to Boost AI Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 07:07:06 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "SoftBank Group on Monday said it had agreed to buy the robotics division of Swiss engineering firm ABB for $5.4 billion.",
      "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier."
    ],
    "image_url": "",
    "titles": [
      "SoftBank to buy ABB robotics unit for $5.4 billion as it boosts its AI play",
      "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.81,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SoftBank Group announced its acquisition of the robotics division of ABB, a Swiss engineering firm, for $5.4 billion. This move aims to expand SoftBank's involvement in robotics, emphasizing the company's focus on physical AI as a key area of future development.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nobel Chemistry Prize Awarded for Metal-Organic Frameworks Innovation",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:58:33 +0100",
    "source": "New Scientist",
    "sources": [
      "The Guardian",
      "New Scientist"
    ],
    "domains": [
      "www.newscientist.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Susumu Kitagawa, Richard Robson and Omar Yaghi have been honoured for the development of metal-organic frameworks, porous materials that can capture water or pollutants",
      "<p>Trio honoured for developing revolutionary materials for applications ranging from gas storage to drug delivery</p><p>The Nobel prize in chemistry has been awarded to three scientists who created revolutionary porous materials that can harvest water from desert air, capture carbon dioxide from in"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/10/08110541/SEI_269475037.jpg",
    "titles": [
      "Nobel prize in chemistry awarded for work on molecular architecture",
      "Nobel prize in chemistry awarded to scientists for work on ‘Hermione’s handbag’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the Nobel Prize in Chemistry for creating metal-organic frameworks. These innovative porous materials have applications ranging from capturing water in deserts to storing gases and delivering drugs. This recognition highlights their significant contribution to science and various industries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cristiano Ronaldo's Net Worth Hits $1.4 Billion After Al-Nassr Deal",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 10:42:19 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Portugal striker Cristiano Ronaldo is worth $1.4bn (£1.04bn), according to financial information and media firm Bloomberg.",
      "The former Manchester United and Real Madrid forward&#039;s wealth has been boosted by his contract extension with Al-Nassr."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/59d5/live/3b1694d0-a42b-11f0-ba96-81d873a15aec.jpg",
    "titles": [
      "Ronaldo is Bloomberg's first billionaire footballer",
      "Cristiano Ronaldo becomes first billionaire footballer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cristiano Ronaldo, the Portugal striker formerly with Manchester United and Real Madrid, has a net worth of $1.4 billion, reports Bloomberg. His wealth increased following a contract extension with Al-Nassr.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Freida Parton Clarifies Concern Over Dolly Parton's Health, Eases Alarm",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 01:21:12 GMT",
    "source": "The Guardian",
    "sources": [
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Freida Parton says she has been ‘up all night praying’ but later clarifies comments, saying ‘I didn’t mean to scare anyone’</p><p>Dolly Parton’s sister says she has been “up all night praying” for the singer as she continues to deal <a href=\"https://www.theguardian.com/music/2025/sep/29/dolly-par",
      "Is Dolly Parton okay? The singer’s sister sparked concern on Tuesday about Dolly’s health after asking fans for their prayers, then clarified what’s really going on."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9301399dbef0dce5b8480184107f9cf70eaa7771/181_0_3474_2778/master/3474.jpg?width=140&quality=85&auto=format&fit=max&s=3ca3f26c0f336445490875071a74b93f",
    "titles": [
      "Dolly Parton ‘going to be just fine’, singer’s sister says as she calls for prayers amid health problems",
      "What’s Going On With Dolly Parton? Her Sister Speaks Out After Asking For Prayers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.719,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Freida Parton initially caused concern by stating she had been \"up all night praying\" for her sister, Dolly Parton, hinting at health issues. However, she later clarified her comments, assuring that she did not intend to alarm anyone. The exact status of Dolly Parton's health was not detailed, but the clarification suggests the situation may not be as dire as initially feared.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches Cheaper Model Y and 3, Prices Start at $36,990",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 20:50:52 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1XbFl5VFNyZnlQcGxoU21ZN0FTQTAxa1h1NU4zRzRaLXQzYUF4UjFiNFQ5ZllrbUs5SkNpM010SVR6bnZxdWp3MWItMkpNaVlGVV95S1cyYUpKQjJsMTlvUXNCemVHZUQ1WUFDM2t5bmg?oc=5\" target=\"_blank\">Tesla debuts cheaper versions of Model Y and Model 3 electric vehicles</a>&n",
      "The long-awaited cheaper Model 3 and Model Y are finally here, but they start at $36,990 and $39,990, respectively -- just a few thousand dollars less than Tesla's current offerings."
    ],
    "image_url": "",
    "titles": [
      "Tesla debuts cheaper versions of Model Y and Model 3 electric vehicles - Axios",
      "Tesla reveals slightly cheaper ‘standard’ versions of the Model 3 and Model Y"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.654,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk announced Tesla will sell more affordable versions of the Model Y to meet high demand, acknowledging the current price is too high for many consumers. The cheaper trims of the Model Y and Model 3 are now available, starting at $39,990 and $36,990, respectively. These prices, while lower, remain closer to $40,000, slightly missing the mass-market target price of under $30,000 that investors hoped for.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]