[
  {
    "title": "US Airstrikes Target Iran's Nuclear Sites, Escalate Regional Tensions",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 21:41:06 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "ABC News",
      "Axios",
      "CNBC",
      "The Guardian",
      "Ottawa Citizen",
      "Bloomberg",
      "New York Times",
      "CBC News",
      "LA Times",
      "Business Insider",
      "The Verge",
      "Washington Post",
      "Fortune",
      "Financial Post",
      "Investopedia",
      "Financial Times",
      "CityNews",
      "MarketWatch",
      "Global News",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "business",
      "technology",
      "general"
    ],
    "snippets": [
      "The \"tortuous\" US-Iran relationship was tested at least once before, but this is of far greater magnitude",
      "The US has bombed Iran - and Iran says it reserves all options to respond.",
      "OTTAWA — Prime Minister Mark Carney called for de-escalation on Sunday after the United States carried out strikes against three Iranian nuclear sites earlier in the day. Carney issued a social media post shortly before 8 a.m. Eastern saying the U.S. military action was &#8220;designed to alleviate&",
      "The B-2 is the only U.S. aircraft able to carry the bunker-busting bombs thought to be capable of penetrating Iran’s Fordow nuclear enrichment facility.",
      "Iranian Canadians and Jewish groups turned worried eyes to the Middle East on Sunday, as U.S. strikes against three Iranian nuclear sites raised fears of escalating violence. Nimâ Machouf, a member of a Montreal Iranian women&#8217;s association, said family members in Iran are living &#8220;from on",
      "Donald Trump on Saturday announced the US had launched strikes on three major Iranian nuclear targets. Here's how business leaders reacted.",
      "<p>Trump claims the assault ‘totally obliterated’ the key facilities, but what do we know about its impact?</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/22/israel-iran-war-live-trump-says-us-has-attacked-nuclear-sites-in-iran-including-fordow\">Middle East crisis – latest up",
      "\"It will take some time for this conflict to settle, but the market will view the worst is now in the rear-view mirror,\" Dan Ives wrote.",
      "The nuclear fuel enrichment plant was built deep inside a mountain in order to withstand an attack.",
      "US B-2 Spirit stealth bomber aircraft dropped heavy bunker-buster bombs on Fordow and other Iranian nuclear sites.",
      "The task of ensuring Iran doesn’t build a weapon might just have got tougher.",
      "Initial military assessments of the buried nuclear site contrast with the statement on the strike there made by President Trump.",
      "Ventilation shafts “are probably the most vulnerable points of the facility,” one expert said.",
      "We compare and contrast Tulsi Gabbard’s congressional testimony that Iran is not building a nuclear weapon, with her rec",
      "A timeline of how the complex mission unfolded was laid out in a Pentagon briefing.",
      "Code-named \"Operation Midnight Hammer,\" the top-secret U.S. attack on Iran's nuclear facilities was launched overnight .",
      "The vice president stopped short of backing President Trump’s assertion that the three bombed facilities had been “totally obliterated.”",
      "B-2 stealth bombers, fighter aircraft and submarine-launched cruise missiles struck Fordo, Natanz and Isfahan during “Operation Midnight Hammer.”",
      "In phone interviews, people in Iran voiced fear, sorrow and grief after waking up to the news of strikes on the country’s nuclear facilities.",
      "<p>Iranian Americans described 'very mixed and complicated' feelings over the U.S. bombing in Iran, torn between revulsion for the government in Tehran and concern that escalating conflict could have deadly consequences.</p>",
      "President Donald Trump addresses the nation from the White House.",
      "Oil surged after the US struck Iran’s three main nuclear sites and threatened further attacks, exacerbating a crisis in the Middle East and stoking concerns that energy supplies from the region could be disrupted.",
      "Based on the closing price of Brent crude on Friday, a 10% jump would send the global oil benchmark to nearly $85 per barrel.",
      "Arab rulers had feted Trump and urged him to avoid military option that would leave them exposed to retaliation",
      "The head of the United Nations atomic watchdog called for a return to diplomacy after the US strikes on Iran’s nuclear program, saying there’s “a window of opportunity” to return to dialogue.",
      "President Donald Trump announced late Saturday the U.S. had joined Israel’s attack on Iran’s nuclear sites, putting the country in the middle of a Middle Eastern war and setting up a potentially volatile market reaction.",
      "Markets across the Middle East ended mostly higher on Sunday after the U.S. entered the war between Israel and Iran.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBGN2pLeEFCWHU3c1hQdG1yOTlzaXpyb1Z1Y3kyZlFDVUdYWEc1Q1NFOHNRdk5XaTc3M1lDUVB0WnZUd2o3c2xpbmFETTVSODc3MU1xTmw4YklkcFhMUDJOdXZKQlZqRG9zNFZIQnoyQjI0MlU?oc=5\" target=\"_blank\">MAGA unites around Trump over Iran strikes — for now</a>&nbsp;&nbsp;<fon",
      "Trump took to Truth Social Friday morning to again make unverified claims that the 2020 election was fraudulent and called for a special prosecutor.",
      "“It’s not politically correct to use the term, ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change???”",
      "<p>The US president hailed the ‘monumental’ damage to Iran’s nuclear programme and praised the military’s ‘great skill’ in carrying out the strikes</p><ul><li><p>Full report: <a href=\"https://www.theguardian.com/world/2025/jun/22/us-attacks-on-iran-inflicted-major-destruction-pentagon-officials-say\"",
      "US president joins Israel’s attacks on Tehran months after vowing to keep America out of new conflicts",
      "Tehran’s grand strategy has failed, but that is no guarantee Israel and America can succeed",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1LTmJvc0tPZ0t1NjBVOUN0ZFU1c19uU0c5S082N3daR1cxTnV6UFd2cHJTWE9PeWVWNHVPU2ItRjFvMFltRGZMV2UtdElTdTdhR0VoZ1hVLTJPUmQzYnRTRnltbEdubjRlNlpabTJvMmE0bHhNR2RhV3ZVcw?oc=5\" target=\"_blank\">At Trump's request, Israel cleared way for U.S. bombers in Ir",
      "The United States’ overnight attack could cause further escalation. To Israelis, it is already seen as a victory for Israel, and for Prime Minister Benjamin Netanyahu.",
      "Republicans in Congress praised President Trump’s decision to hit Iran. Many Democrats and some G.O.P. lawmakers said he should have consulted Congress.",
      "President Donald Trump said the U.S. attacked three sites in Iran related to the country's nuclear program.",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE8tMXlsbHBKS1pQLUgzTlFhNDVYS2lGU3g3eC1OUGUzQ0duSzlONUZxU2d2X2VPVUo0RU9TdWFwc1hpWGZ3WWYxMy1EUFNzcHpOTUlELVdjaWVuZVhFY1dXVmxrRTF3NTdvaFlUVQ?oc=5\" target=\"_blank\">U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says</a>&nb",
      "\"Perhaps they should follow President Trump's lead and give peace a chance,\" Vance said.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE1lVnF1UlNSM1dFb1ZwcTVWX1Atb25PY1pyb0RtTnQ2cWJsN0RtZXpRbEFtUkxPdzAtWmJOOUZyQjFnbEVmcHhJa01Xa09lUDEtek4xVkl1elZyN0dWZEFGdXBBTHBRVGVQdFU1eGJuZ3NGWlBVVmx6Q3VWeWM?oc=5\" target=\"_blank\">Top Democrats left in dark on Iran strike plans</a>&nbsp;&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWWhOa1oyTURGNnpWLXdWQlVid3h6NUpUbGhjQ1dWbmlPM2o0MVZKOGt4NzV0MHM4ejd2NDUwcDJNXzN6UEZWUXIwREt3VlNHYWhFYkxqSzBaeVJkY2MxMnNTVERteVdBRlJNOV9YcG5fZERwY1E?oc=5\" target=\"_blank\">Trump administration says U.S. does not seek regime change in Iran</",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTFBQYnFkWGR1ZTY3WDk4M3pxWnBwdTJWbnpnRUNESUJTRTlPck5DYzdNWXdRUEhHM2JmTTFiSFhKektSdWNtUllCQlZ0a2FOZjZMekNSTFF6QWxQdXBRZGZ1VEUwdjBlZ3Rr?oc=5\" target=\"_blank\">Trump floats regime change in Iran</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "The risk of a spiraling conflagration that pulls the U.S. in deeper flies in the face of Trump’s own rhetoric about righting the wrongs of an earlier era of U.S. overreach.",
      "<p>The United States has joined Israel in its attacks on Iranian nuclear sites. Michael Safi hears from reporter Hugo Lowell and world affairs correspondent Andrew Roth on what happens now</p> <a href=\"https://www.theguardian.com/news/audio/2025/jun/22/why-trump-bombed-iran-podcast\">Continue reading",
      "The US president hopes that his display of power in Iran will stop the war — but that is not his decision to make",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9ELVJYWU5YTzdWLTF5NGNtbGYtVUoyUVAxVUd0YXNLVEhxeUgzOHAxY1ZESDhPN2d4a085RWhITE1nMExHNS1EbHZXbDVwd1EzWWY2SHNpNHVVN0dad3NiVl96N21XU00wNDg2UDFBOFlIMXZCWkI1Mnd0OWNXTkk?oc=5\" target=\"_blank\">Scoop: Trump's back channel to Iran failed after supreme",
      "Downing Street says the PM and US president agreed to stay in close contact after speaking on Sunday evening.",
      "<p>PM calls on Tehran to return to negotiations and holds talks with Macron and Merz after US attack on three nuclear sites</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/22/israel-iran-war-live-trump-says-us-has-attacked-nuclear-sites-in-iran-including-fordow\">Middle East cr",
      "Arab governments, especially in the gulf, had once taken a hawkish line toward Iran but now worry U.S. strikes could upend regional stability and hurt business.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1XNm1yYTVSeUJIS0tobkw4M3FwQWlubUgwUjJnNVFTOUNXd3dVUEZNSDdORlFLSmNDM3FySjZPVG5qZzJZMUdGTExiR1JqTlB2UndYTXFidm9aeUdBT2hKZlFFMklwZ1lFWVZfcjFUTWloTzdLcm5FbA?oc=5\" target=\"_blank\">AOC floats Trump impeachment over Iran strikes</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1zTEFvazFLblpzaENEZ3JNWU0xZGZ5VG9hal9GY00xNjluVnVpVmhPYXd1V1JfMWwzUGRGMks4RlB5bjI2YTdtQVI0OWJPaE5Fcm1sVkxpNm5tYkpHUzFleVJpeW5rMV9KbTNJNUVxbFlxWVd1N192emJFMA?oc=5\" target=\"_blank\">\"It was a headfake\": Inside Trump's secret orders to strike I",
      "\"And then it's not the U.S. and ongoing war. Rather it's a big win. It's not peace, but it's a big win for Trump. And it's an even bigger win for the Israeli prime minister.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxQdUdaZE9OcHlJQm1DT29UT3RVVnRrV2lEVm93RGlrcTZPZmxKYXh5cUZYMnBBX2p4Rl9DWEN1TE5ELUw2TGkxbmVoTWZWa1Fqc3JZR001MDhaeTZnb0dVTWlEX3IwSmR2bUNmUWFmUzR3c0VyYnpXVDF0c1lBdW52WG4tXzVoZWZ1R204Z1llZkdSQjZKdHR5VUJaUmgyalk?oc=5\" target=\"_blank\">Oil Soars as",
      "Trump appears to contradict that later Sunday, questioning the possibility of &#039;regime change.&#039;",
      "Top U.S. officials detailed a devastating but “limited” strike on Iran’s nuclear facilities, warning that future attacks could follow if Iran retaliates.",
      "US lawmakers and American citizens have condemned Donald Trump’s decision to bomb Iran&#039;s nuclear sites.",
      "Lawmakers expressed surprise after the President Trump announced the U.S. had attacked three Iranian nuclear sites.",
      "Saudi Arabia, Qatar and other Gulf Arab countries expressed dismay over the American attack, but stopped short of condemning the United States, a key ally.",
      "<figure><img alt=\"Carlos Barria / Pool / Getty Images Middle East equities were rallying Sunday on hopes U.S. attack would hasten a resolution.\" src=\"https://www.investopedia.com/thmb/FVFtXMfh6dCMA0p_sPsSGGYfXmY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2220645738-",
      "Vice President JD Vance's remarks come after Defense Secretary Pete Hegseth said Iran's \"nuclear ambitions have been obliterated\" following Saturday's strikes.",
      "US Secretary of Defense Pete Hegseth says US strikes have ‘devastated the Iranian nuclear programme’",
      "Donald Trump claims Iran’s key nuclear enrichment facilities &#039;totally obliterated&#039; after US bombs three nuclear sites.",
      "Iranian authorities say those who favour US and Israeli strikes are committing &#039;treason&#039; and will face consequences.",
      "<p>IDF says remains of two civilians and one soldier were retrieved in ‘special operation’ on Saturday</p><p>Israel announced on Sunday it had recovered the bodies of two civilians and one soldier held hostage in Gaza, amid its wars in Gaza and Iran.</p><p>The Israeli military said it recovered the ",
      "<img alt=\"A tent encampment is seen amid the rubble of a destroyed city.\" height=\"349\" src=\"https://i.cbc.ca/1.7568108.1750612965!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/aptopix-israel-palestinians.jpg\" title=\"A tent camp for displaced Palestinians stretches among the ruins of building",
      "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel. Dozens were freed or killed, and at least 20 are believed to be alive in Gaza.",
      "Israeli forces continue to kill people across Gaza amid a food and fuel shortage, worsening the humanitarian crisis.",
      "<p>Witnesses and NGO records show hundreds have been killed since GHF began distributing food but it says its model is working</p><p>Just after midnight on Thursday morning, Abdullah Ahmed left his sleeping wife and children in their small and crowded home in the battered al-Bureij camp in central G",
      "The retrieval of the bodies of three Israelis taken hostage by Hamas jolted Israelis’ focus back to a conflict that had been overshadowed by the escalating crisis with Iran.",
      "Its proxy forces around the region have been largely silent in offering concrete support after attacks by Israel and now the United States.",
      "Israeli forces recovered the bodies of three hostages taken to Gaza during the Oct. 7, 2023, attacks, authorities announced Sunday.",
      "Iranian President Masoud Pezeshkian joined a crowd in Tehran on Sunday condemning the US strikes on Iran.",
      "<p>Weakening of ‘axis of resistance’ forces leaves Iran with limited options if it chooses to retaliate</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/22/israel-iran-war-live-trump-says-us-has-attacked-nuclear-sites-in-iran-including-fordow\">Middle East crisis – latest update",
      "The bodies of Yonatan Samrano, Sgt Shai Levinson and Ofra Kedar were recovered on Saturday.",
      "The US struck Iran’s Fordow, Natanz, and Isfahan nuclear sites, escalating tensions with Iran.",
      "The sites targeted include a uranium enrichment facility at Fordo.",
      "With just one victory in three games, the Ottawa Redblacks can be considered no worse than No. 4 on anyone&#8217;s current list of CFL power rankings. How much higher they go will depend on their defence. After losing their first two games to the only 3-0 teams in the league, Mother Nature thought i",
      "US military aircraft hit three of Iran's nuclear sites, dropping a \"full payload\" of bombs on the heavily protected Fordow, Trump said.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10YUtRd3lzVXY5bFRDZ2c5WUotYlRTbUlpcGl4SVFpT1ZqczFNNnlWWTduUVdSbTVvZmJDbDlydHBPTUFkcFpaWGJmd0k0ZWZvR2I3WWZ2cER4QURwLUdIVi1JZTZMTUxwSVZTcGxNempXc1l5UE0zeER3?oc=5\" target=\"_blank\">Live: US Says It Launched Airstrikes on Iran Nuclear Sites</a>&",
      "After the Iran bombings, more officers were placed at religious, cultural and diplomatic locations, Mayor Eric Adams said. The M.T.A. and the Port Authority have activated counterterrorism protocols.",
      "Iranian Canadians and Jewish organizations watched the situation in the Middle East with growing concern on Sunday, as U.S. airstrikes sparked fears of intensifying conflict.",
      "Senior U.S. officials said the attack had severely damaged Iran’s nuclear facilities but conceded they did not know the whereabouts of its supply of near-bomb-grade uranium. President Trump suggested that a new government could take over in Tehran.",
      "<p>Much could go wrong for the US and the Middle East as Trump and Netanyahu pursue the disempowerment of Iran</p><ul><li><p> <a href=\"https://www.theguardian.com/world/live/2025/jun/22/israel-iran-war-live-trump-says-us-has-attacked-nuclear-sites-in-iran-including-fordow\">Middle East crisis – lates",
      "<figure><img alt=\"President Donald Trump said the U.S. military struck three nuclear sites in Iran on Saturday, June 21, 2025.\" src=\"https://www.investopedia.com/thmb/YdhD6bc8lMk62T_nWSXoNHrpbew=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2220646012-ff17aa5d0c7749338",
      "The raids attacked research and centrifuge arrays that Tehran has built up over decades",
      "President’s social media posts contradict officials’ claims that US does not seek to topple government",
      "World leaders reacted to President Donald Trump's announcement Saturday that the U.S. had carried out a \"very successful attack\" on three nuclear sites in Iran, including Fordo.",
      "Maxar Technologies released satellite imagery on Sunday showing activity at Iran's Fordo nuclear facility prior to U.S. air strikes.",
      "Defense Secretary Pete Hegseth echoed remarks made by President Donald Trump Saturday following strikes on three major nuclear enrichment facilities in Iran.",
      "The United States struck three nuclear sites in Iran on Saturday, plunging the U.S. into a battle waged over the past several days between Israel and Iran.",
      "By bombing three nuclear sites in Iran, the United States has joined Israel’s war against the country. Now it is bracing for Iranian retaliation.",
      "Known as the Joint Comprehensive Plan of Action, or JCPOA, the deal followed two years of negotiations during the Obama administration.",
      "Will the U.S. intervention continue? Will Trump’s domestic political coalition hold? What impact might a surge in oil prices have on inflation in the U.S.?",
      "Plus, a farmer’s fire brigade in Canada.",
      "Monotype is keen for you to know what AI might do in typography. As one of the largest type design companies in the world, Monotype owns Helvetica, Futura, and Gill Sans - among 250,000 other fonts. In the typography giant's 2025 Re:Vision trends report, published in February, Monotype devotes an en",
      "The broader crypto market has also tanked, dropping 7% over the past 24 hours.",
      "The US Air Force says the GBU-57 bunker-buster bomb can penetrate up to 200 feet below ground before exploding.",
      "Shipowners could ignore the advice because the Gulf is too important a region for them to avoid and rates can always rise to compensate for the risk.",
      "The US military's surprise B-2 bomber strikes on Iran's nuclear sites relied on deception and strategic misdirection, military leaders said.",
      "US Air Force B-2 Spirit bombers struck Iran's nuclear facilities, and a guided-missile submarine also launched strikes.",
      "‘Tactical surprise’ and ‘misdirection’ allowed American B-2 bombers to attack Iranian nuclear sites without drawing fire",
      "Initial assessment suggests massive damage to Iran's nuclear facilities, according to Trump administration officials.",
      "<p>Foreign affairs minister Penny Wong refuses to say whether Pine Gap facility in NT was used in the American bombing of three Iranian sites</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/23/australia-news-live-anthony-albanese-labor-coalition-trump-iran-israel-nsw-",
      "<p>Former adviser to Penny Wong argues Australia should make clear ‘we are a country that stands up … for the rules-based order’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/22/australia-news-live-richard-marles-andrew-hastie-iran-israel-anthony-albanese-penny-wong",
      "Prime Minister Mark Carney has called for a de-escalation of hostilities in the Middle East and for parties to 'return immediately to the negotiating table.'",
      "Iranian officials had warned the U.S. to stay out, saying it would have dire consequences for the entire region.",
      "US airstrikes on Iranian nuclear facilities are sharpening the focus on one option Iran has yet to really deploy in the conflict: disrupting regional oil trade, especially through the critical Strait of Hormuz.",
      "Iran’s foreign minister warned that the U.S. decision to join Israel’s war against Iran would have “everlasting consequences.”",
      "Donald Trump says US bombing attacks he ordered have &#039;totally obliterated&#039; Iran&#039;s key nuclear sites.",
      "<p>The Guardian’s picture editors select photographs from around the world.<br />Warning: gallery contains sensitive images</p> <a href=\"https://www.theguardian.com/news/gallery/2025/jun/22/iran-israel-yacht-jaws-photos-of-the-weekend\">Continue reading...</a>",
      "The fight between two well-armed Mideast powers has their neighbors worried about the conflict spreading, a concern only deepened by U.S. involvement.",
      "Amid fears of more dangerous escalation across the Middle East, some leaders condemned the attacks, and others urged restraint.",
      "The BBC asked Texans and those visiting the state about US President Trump's decision to bomb three nuclear sites.",
      "Both elation and fear were widespread in Israel amid uncertainty over what comes next.",
      "The mood in the government after the U.S. attacks is one of defeat and humiliation. But state media are showing people going about their daily routines.",
      "President Trump avoided asking Congress for permission before striking Iran, despite the Constitution saying only the legislature can declare war.",
      "The nation’s supreme leader may choose to back down after a first round of retaliation, or prefer martyrdom and building a nuclear weapon.",
      "Senate Intelligence Chair Tom Cotton said Sunday that the US must \"be prepared for Iran to retaliate\" following Saturday night's strikes.",
      "Starmer maintains diplomacy is the answer but Trump has so far chosen a different path, our political editor writes.",
      "Iran’s foreign minister called the attack a “betrayal” in the middle of negotiations and said it would have “everlasting consequences.”",
      "Trump said the U.S. hit the Fordow, Natanz and Isfahan nuclear sites. Iran’s foreign minister called it a “dangerous military operation” against his country.",
      "<figure><img alt=\"Kamil Krzaczynski/ AFP / Getty The Federal Reserve opted to leave its benchmark interest rate unchanged last week. Fed Chair Jerome Powell said that the central bank needs to assess the impact of tariffs on inflation in the coming months.\" src=\"https://www.investopedia.com/thmb/YHK",
      "IDF signals it will continue offensive while assessing impact of US raid on nuclear sites",
      "Comments towards Tehran come after top US officials insisted they were not seeking a different government there",
      "International benchmark Brent rises to almost $80 as geopolitical risks mount",
      "This is your weekly lookahead at the key global events that could move markets and shape policy.",
      "Iran launched its 20th wave of missile and drone strikes against Israeli military targets, according to Iran state-owned media Fars.",
      "The choice of how to retaliate is existential as a wider war risks not only increased violence but could also threaten regime survival, according to analysts.",
      "Rep. Jim Himes said it was still too soon to know if U.S. strikes against Iranian facilities had substantially weakened the country’s nuclear program.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNdTVnNkdMVFNqbEg2c09mVzZ2MDFDUE5NYmFwb2VYaF95QTBmOXR0WE5wMF84R1d4cnR0N0xmNGhDRTh4MmZYMWFITm5CVFc1TTlCWmNlcFJ5SVRrdTFIUGVRVTJPMEpNQlRESG9JaWhLVW9xR3o3WVBLOUp3ZmlFamdFazBEam1hZkE?oc=5\" target=\"_blank\">Trump's Iran strikes meet bipartisan blo",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE8xSG50ZXVKZHhyNnVnRExMUDJsblVXbW1CSTdnb3FqQV9tZHpQM3A4MTVGc2Q2Rl9pbmJEd3NXOVlfVkpmRDdDalBCWElmbjBOTnVFN0RHQkhWWmN3MG5hZlhtSHZ3c0VpUFo4?oc=5\" target=\"_blank\">Scoop: Trump launches MAGA PAC in effort to oust Rep. Massie from Congress</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOU2Vrd05uekpSN3gzTXJZMXV0OTBPY1N2bEZWTEczYU1CaDBFWEZjMHBpRExSQ2NMZDA3TFRtXzQ2MXdyeHY4MUtqWVRPTkgtRjlQR2JEZlVMNnZTWWowcEdwNXFzWjNEbWplM3lmaFZNMFhRc0hsX09weHQ0cUZtUA?oc=5\" target=\"_blank\">U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnig",
      "US President Donald Trump ordered the US military to bomb three nuclear sites in Iran. Here’s what we know.",
      "Iran’s Foreign Minister Abbas Araghchi says US Israel crossed &#039;a very big red line&#039; by attacking three nuclear sites.",
      "Four years ago, Trump used a swear word for Netanyahu. On Sunday, he said they worked as a team. We track that shift.",
      "“Extremely severe damage and destruction.” The US military struck the Fordow, Isfahan and Natanz nuclear sites in Iran.",
      "And Iran warns of \"everlasting consequences\"."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4879/live/def7c1b0-4fb1-11f0-86d5-3b52b53af158.jpg",
    "titles": [
      "An unprecedented moment - but what US and Iran do next could be even more momentous",
      "US strikes Iran, what comes next?",
      "Carney says Middle East ‘highly volatile’ after U.S. strikes Iran, calls for calm",
      "Trump says key Iranian nuclear facilities ‘totally obliterated’ in U.S. strikes",
      "Iranian Canadians and others watch and worry after U.S. strikes on nuclear sites",
      "Business leaders from Bill Ackman to Jason Calacanis react to the US strike on Iran's nuclear sites",
      "How effective was the US attack on Iran’s nuclear sites? A visual guide",
      "Dow futures drop 150 points while oil prices jump after the U.S. bombs Iran’s nuclear sites and widens Mideast conflict",
      "Here’s What to Know About Fordo, Iran’s Best-Protected Nuclear Site",
      "Satellite images show the damage at Iran's deeply buried Fordow nuclear site after massive US strikes",
      "Satellite Images Undermine Trump’s Claim Iran’s Atomic Sites Destroyed",
      "Iran’s Fordo Nuclear Site Said to Look Severely Damaged, Not Destroyed",
      "Satellite Images Show What U.S. May Have Targeted at Iran’s Fordo Nuclear Site",
      "Tulsi Gabbard on Iran’s nuclear capabilities",
      "Decoy flights and seven B-2 stealth bombers - how US says it hit Iran's nuclear sites",
      "How bunker-busters and B-2 stealth bombers hit Iran's nuclear program",
      "Vance says Iran’s nuclear program has been ‘substantially delayed.’",
      "Pentagon Details Multipronged Attack on Iranian Nuclear Sites",
      "‘We’re All in Shock’: Iranians React to U.S. Attack on Nuclear Sites",
      "L.A.'s Iranian community grapples with reactions to U.S. military attack",
      "WATCH:  US attack on Iran ‘a spectacular military success,’ Trump says",
      "Oil Spikes as Trump’s Attack on Iran Ramps Up Risks to Supplies",
      "Oil prices could spike 10% after the U.S. attack on Iran —  ‘But don’t be fooled, this may not last’",
      "Gulf allies shaken by Trump’s Iran strikes",
      "UN Nuclear Chief Urges Halt to Iran Strikes to Allow Inspections",
      "Investors brace for ‘unpredictable spillovers’ in markets after Trump announces Iran strikes",
      "Gulf markets end higher, shielded from major turmoil after the U.S. strike on Iran",
      "MAGA unites around Trump over Iran strikes — for now - Axios",
      "Trump admin live updates: After strike on Iran, Trump focuses on his megabill",
      "Trump is open to regime change in Iran, after his administration said that wasn’t the goal",
      "Israel-Iran war live: Trump floats regime change to ‘make Iran great again’; Iran parliament votes to shut Hormuz strait",
      "Trump gambles his presidency as US enters war with Iran",
      "The perils of war with Iran",
      "At Trump's request, Israel cleared way for U.S. bombers in Iran - Axios",
      "Trump’s Strike on Iran Cements Netanyahu’s Political Comeback",
      "Republican Lawmakers Cheer Strike on Iran as Top Democrats Condemn It",
      "Israel-Iran live updates: Trump says 'MAKE IRAN GREAT AGAIN,' hints at regime change",
      "U.S. has \"no interest\" in putting troops on the ground in Iran, Vance says - Axios",
      "JD Vance says Iran is ‘clearly not very good at war’ and should seek peace while declaring the U.S. has ‘no interest’ in ground troops",
      "Top Democrats left in dark on Iran strike plans - Axios",
      "Trump administration says U.S. does not seek regime change in Iran - Axios",
      "Trump floats regime change in Iran - Axios",
      "Trump bombs Iran, raising the ghosts of Iraq",
      "Why Trump bombed Iran – podcast",
      "Trump has opened a Pandora’s box",
      "Scoop: Trump's back channel to Iran failed after supreme leader went dark - Axios",
      "Starmer and Trump discuss need for Iran to return to negotiations",
      "Keir Starmer backs US strike on Iran but warns of wider escalation risk",
      "Arab states fear they’ll pay a price if strikes on Iran prompt wider war",
      "AOC floats Trump impeachment over Iran strikes - Axios",
      "\"It was a headfake\": Inside Trump's secret orders to strike Iran - Axios",
      "U.S. attacks on Iran resemble a ‘TikTok-style war’ and may be peak military involvement, geopolitical expert says",
      "Oil Soars as Trump’s Attack on Iran Boosts Risks to Supplies - Bloomberg",
      "Senior Trump officials say US attacks on Iran ‘not about regime change’",
      "U.S. officials detail Iran bombing raid, noting ‘limited’ attack for now",
      "US lawmakers condemn Trump for ‘unconstitutional’ attack on Iran",
      "Congressional leaders react to Trump ordering attack on Iran",
      "Gulf Countries Voice Concern After U.S. Attack on Iran Nuclear Sites",
      "Investors Brace for Market Fallout From U.S. Strike on Iran Nuclear Sites",
      "U.S. isn't at war with Iran, 'we're at war with Iran's nuclear program,' Vance says",
      "Pentagon chief says US strikes have ‘devastated’ Iran’s nuclear programme",
      "How far will US strikes set back Iran’s nuclear programme?",
      "Iranians react after US bombs three nuclear sites in support of Israel",
      "Israel recovers bodies of three hostages held in Gaza",
      "Israel says remains of 3 more hostages recovered, as refugee camp in Gaza struck",
      "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "Israel recovers bodies of three Gaza captives as it kills 33 Palestinians",
      "Gaza slides into lethal chaos as desperate Palestinians fight to survive",
      "Israel Recovers Bodies of Three Hostages Held by Hamas in Gaza",
      "Iran’s Allies Are Not Offering Support in Its Conflict With Israel",
      "Israel recovers bodies of three hostages from Gaza, IDF says",
      "Iran’s president joins Tehran protest condemning US, Israel",
      "Iran’s proxy militias may not want to help if Tehran opts to hit back at US",
      "Israel recovers bodies of three hostages from Gaza",
      "Satellite images show damage from US strikes on Iran’s Fordow nuclear site",
      "What we know about US attacks on three nuclear sites",
      "What do we know about the Ottawa Redblacks through one-sixth of the CFL season?",
      "US warplanes bombed Iran's most protected nuclear site. Trump says it was 'totally obliterated.'",
      "Live: US Says It Launched Airstrikes on Iran Nuclear Sites - Bloomberg",
      "NYC Increases Police Presence at Vulnerable Sites After U.S. Bombings in Iran",
      "Iranian Canadians and others watch and worry after U.S. strikes on nuclear sites",
      "Live Updates: Fate of Iran’s Uranium Stockpile Unclear After U.S. Strikes",
      "US bombing of Iran’s nuclear facilities is Trump’s biggest gamble yet as president",
      "US Completes 'Very Successful Attack' on Iran Nuclear Sites, Trump Says",
      "In maps: Iran’s three nuclear sites targeted by US bombers",
      "Trump taunts Iran with prospect of ‘regime change’ after strike on nuclear sites",
      "World leaders react after Trump says U.S. has bombed 3 nuclear sites in Iran, including Fordo",
      "Satellite images show activity at Iran's Fordo nuclear facility before U.S. air strikes",
      "Hegseth claims Iran's nuclear ambitions 'obliterated' after U.S. strikes",
      "US hits 3 Iranian nuclear sites, Trump says, plunging America into conflict",
      "With Decision to Bomb Iran, Trump Injects U.S. Into Middle East Conflict",
      "What was in the Iran nuclear deal and why did Trump withdraw the US from it?",
      "6 questions investors should be asking as U.S. strikes Iran",
      "Monday Briefing: The U.S. Struck Iran",
      "What happens when AI comes for our fonts?",
      "Bitcoin plummets below $100,000 after U.S. strikes Iran nuclear sites",
      "The US military used a 30,000-pound bunker-buster bomb for the first time in combat in strikes on Iranian nuke sites",
      "Shipping on high alert in Mideast after U.S. strikes on Iran",
      "How the US military tricked everyone to surprise Iran with B-2 bomber strikes on its nuclear sites",
      "The US military struck Iran with some of its most elusive weapons: stealth bombers and a hidden submarine",
      "How the US used stealth and decoys to launch surprise attack on Iran",
      "U.S. Strikes Iran (Live Updates): Iran And Israel Exchange Fire After U.S. Strikes Iranian Nuclear Facilities",
      "Australian government backs US strikes on Iran but urges ‘peaceful settlement from here’",
      "Albanese government criticised for ‘weak’ response to US attacks on Iran as experts decry ‘flagrant breach’ of law",
      "Carney calls for de-escalation, ‘diplomatic solution’ after U.S. strikes on Iran",
      "How Iran could retaliate after U.S. strikes on its nuclear program",
      "How a Cornered Iran Could Wreak Havoc on Global Oil Trade",
      "Iran Had Vowed to Retaliate. Now, It Faces Grim Choices.",
      "Will Iran retaliate or capitulate?",
      "Strikes on Iran and Israel, a hoisted yacht and Jaws rides again - photos of the weekend",
      "As U.S. Enters War Against Iran, the Mideast Fears What’s Next",
      "World Leaders React to the U.S. Strikes on Iran",
      "'Necessary' or 'unfounded'? Americans in Texas respond to US strikes",
      "Some Israelis Expect New Era After U.S. Strikes on Iran. Others Are Skeptical.",
      "After U.S. Strikes, Iranian Officials Try to Project a Sense of Normalcy",
      "Is the U.S. at War With Iran? What to Know About Trump, Congress and War Powers",
      "Will Iran Decide to Retaliate Against the U.S.?",
      "Senate Intel Chair Cotton: 'We have to be prepared for Iran to retaliate'",
      "Chris Mason: UK's position on Iran is clear but will the US listen?",
      "After U.S. Strikes on Iran, Prospects for Diplomacy Look Dim",
      "Israel-Iran live updates: Officials assess damage from U.S. strikes on Iran, as Trump raises possibility of regime change",
      "What to Expect in Markets This Week:  Investors Digest News of US Strikes on Iran, Await May PCE Inflation, Powell Testimony, Earnings from Nike, FedEx, Micron",
      "Israel weighs next phase of Iran campaign after US strikes",
      "Netanyahu says Israel is close to fulfilling goals of Iran campaign",
      "Oil price jumps after US strikes Iran",
      "The Week Ahead: What's next after U.S. strikes on Iran and Europe's 5% defense problem",
      "Iran says it reserves all options after ‘outrageous’ U.S. strikes, launches fresh attacks on Israel",
      "Iran says ‘all options’ on table; bigger conflict may threaten regime’s survival",
      "Top Democrat says Trump strikes on Iran a 'massive, massive gamble'",
      "Trump's Iran strikes meet bipartisan blowback in Congress over war powers - Axios",
      "Scoop: Trump launches MAGA PAC in effort to oust Rep. Massie from Congress - Axios",
      "U.S. used 14 bunker-busters, 7 B-2 bombers in \"Midnight Hammer\" strikes on Iran - Axios",
      "US bombs Iran: What we know about US strikes on Iran’s nuclear facilities",
      "Iran warns US of consequences after strikes, says Trump betrayed his voters",
      "US attacks Iran: How Trump rejoined ‘team’ Netanyahu",
      "US strikes Iran in ‘Operation Midnight Hammer’",
      "The US Bombs Iranian Nuclear Sites"
    ],
    "score_components": {
      "magnitude": 0.95,
      "recency": 0.95,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.883,
    "summary": "The United States conducted airstrikes on three nuclear sites in Iran, marking a significant escalation in the conflict between Israel and Iran. The operation, named \"Operation Midnight Hammer,\" involved B-2 stealth bombers, fighter aircraft, and submarine-launched cruise missiles targeting the Fordo, Natanz, and Isfahan sites. The strikes have led to widespread reactions, including fear and anger within Iran, international calls for de-escalation, and varied responses from global leaders. Initial assessments suggest the attacks caused massive damage to Iran's nuclear capabilities. President D",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant international event, offering readers some insight into the geopolitical situation. However, it does not suggest any solutions, improvements, or innovations, and it does not provide a comprehensive understanding of the causes or impacts of the situation."
  },
  {
    "title": "Iran Parliament Backs Strait of Hormuz Closure Idea Amid US Tensions",
    "domain": "general",
    "location": "national",
    "published": "Sun, 22 Jun 2025 15:33:45 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Financial Post",
      "Axios",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE11NldzRS1CR2dBVFFCdWo4bGxYWTJ6WGliUGQ0NURBNm15ZmczWnI5N3I0Y3FzQUhqcXV4WFE4N0RaNnVNN01yOXFhLUdDa1BWUENPY3c4RXJ3QmFVVXFRZS1mOWRVVzRsZ1JhckNSWQ?oc=5\" target=\"_blank\">Iran parliament reportedly backs closing Strait of Hormuz, which could spike ",
      "Possibility of Iran shutting the Strait of Hormuz, a key lane for Middle Eastern oil and gas shipments, is remote despite U.S. attacks on its nuclear sites. Here's why.",
      "Iran's foreign minister warned earlier Sunday that the Islamic Republic \"reserves all options to defend its sovereignty\" after U.S. airstrikes.",
      "The Strait of Hormuz isn’t the only concern when it comes to flows of crude and other energy products out of the Middle East.",
      "The dollar strengthened in early trading as investors sought to shield against mounting geopolitical risks following the US strikes on Iran."
    ],
    "image_url": "",
    "titles": [
      "Iran parliament reportedly backs closing Strait of Hormuz, which could spike oil prices - Axios",
      "Strait Of Hormuz: Why Iran Is Unlikely To Block Key Oil Shipping Route",
      "U.S. calls on China to prevent Iran from closing Strait of Hormuz and disrupting global oil flows",
      "It isn’t just the Strait of Hormuz. Oil traders and global investors await Iran’s response to U.S. strike.",
      "Dollar Gains in Early Trading as World Awaits Iran’s Response"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.836,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "Iran's parliament has reportedly supported the idea of closing the Strait of Hormuz, a crucial passage for Middle Eastern oil and gas exports, in response to U.S. airstrikes on its nuclear sites. Despite this, the likelihood of the strait's closure remains low. Iran's foreign minister has stated the country reserves all options to defend its sovereignty. The situation has led to increased geopolitical risks, contributing to a stronger dollar in early trading as investors seek protection.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant geopolitical event, providing context about the strategic importance of the Strait of Hormuz and the potential economic impacts of its closure. However, it does not report on any solutions or attempts to solve the problem."
  },
  {
    "title": "Bradley Rallies to Win Travelers Championship; Minjee Lee Clinches Third Major",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 23:02:59 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "Sky Sports",
      "CBS Sports",
      "ESPN",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "American Keegan Bradley pips England's Tommy Fleetwood on the 18th hole to claim the Travelers Championship.",
      "Keegan Bradley extended Tommy Fleetwood&#8217;s wait for a maiden PGA Tour title after snatching a dramatic victory in a thrilling finish to the Travelers Championship.",
      "<p>Ryder Cup captain Keegan Bradley rallied from three shots behind with four holes to play and birdied the 18th hole before a delirious home crowd Sunday for a 2-under 68 to win the Travelers Championship.</p>",
      "<p>New England&#8217;s own Keegan Bradley caps off the comeback on the 72nd hole to win the Travelers Championship at TPC River Highlands in Cromwell, Conn., during the final signature event of the year.</p>",
      "CROMWELL — Sooner or later, the sun begins to set, the crowd gathers, but falls silent and the storylines fade to irrelevance. And then all that remains are those few precious feet and inches of real estate between the ball and the 18th hole. The Travelers Championship has long been known for moment",
      "Ryder Cup captain Keegan Bradley rallied from three shots behind with four holes to play and birdied the 18th hole before a delirious home crowd Sunday for a 2-under 68 to win the Travelers Championship.  The victory only strengthened the case for Bradley to bring his clubs to Bethpage Black for the",
      "<p>Minjee Lee closed with a 2-over 74 but never gave up the lead Sunday in the final round of the KPMG Women’s PGA Championship to win her third major title. </p>",
      "Highlights from the final round of the KPMG Women's PGA Championship at PGA Frisco.",
      "Miguel Angel Jimenez won the Kaulig Companies Championship on Sunday for his fourth PGA Tour Champions victory of the season.",
      "<ul><li><p>Lee finishes with 72-hole four-under 284 total in Texas</p></li><li><p>She becomes just third Australian to win three different majors</p></li></ul><p>Cementing her greatness, Australian golf superstar Minjee Lee claimed a historic third career major with a steely victory at the big-money",
      "Minjee Lee closed with a 2-over 74 but never gave up the lead Sunday in the final round of the KPMG Women's PGA Championship to win her third major title.",
      "Australia's Minjee Lee wins the PGA Championship to claim the third major of her career.",
      "The final signature event of the season brought with it another significant payout at the Travelers Championship",
      "An incredible final hole played out at the Travelers Championship, as Keegan Bradley sensationally denied Tommy Fleetwood a maiden PGA Tour title.",
      "<ul><li><p>English golfer three-putts on 18th while Bradley birdies it</p></li><li><p>American Ryder Cup captain wins by one shot</p></li></ul><p>The US Ryder Cup captain, Keegan Bradley, birdied the final hole of the Travelers Championship and soared past England’s Tommy Fleetwood to win the tourna",
      "Highlights from the final round of the Travelers Championship as Tommy Fleetwood narrowly missed out on a maiden PGA Tour title at the hands of Keegan Bradley."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/14fa/live/162513e0-4fbc-11f0-a3d1-13e3453a986d.jpg",
    "titles": [
      "Heartbreak for Fleetwood as Bradley denies him first PGA title",
      "Bradley snatches PGA Tour victory from Fleetwood after final-hole drama",
      "Keegan Bradley pulls stunner to deny Fleetwood, win Travelers Championship",
      "Keegan Bradley caps off comeback on 72nd hole to win Travelers Championship",
      "Dom Amore: In dramatic Travelers finish, Keegan Bradley, Captain America, was Captain Clutch",
      "US Ryder Cup captain Bradley wins the Travelers. Lee and Jimenez take major titles",
      "Minjee Lee wins the KPMG Women’s PGA Championship for her 3rd major title",
      "Minjee Lee wins third major title at Women's PGA Championship",
      "Miguel Angel Jimenez forces playoff, wins with a 20-footer at Kaulig Companies Championship",
      "Australia’s Minjee Lee wins historic third major at Women’s PGA Championship",
      "M. Lee wins Women's PGA for third major crown",
      "Lee claims third major with PGA Championship victory",
      "2025 Travelers Championship purse, prize money: Payouts for Keegan Bradley, players from $20 million pool",
      "INCREDIBLE SCENES! Dramatic chip-in, Fleetwood falters and Bradley birdies to win!",
      "Bradley overhauls Fleetwood on final hole to win Travelers Championship",
      "Fleetwood misses out to Bradley in DRAMATIC finish!"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.977,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary": "Keegan Bradley won the Travelers Championship at TPC River Highlands in Cromwell, Connecticut, rallying from three shots behind with four holes remaining. He birdied the 18th hole, securing a 2-under 68 victory before a supportive home crowd. This win prevented England's Tommy Fleetwood from claiming his first PGA Tour title, as Fleetwood three-putted the 18th. In other golf news, Minjee Lee won the KPMG Women’s PGA Championship, marking her third major title. Lee's win solidifies her as the third Australian to win three different majors.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the outcomes of two major golf tournaments. While it might be interesting to golf fans, it doesn't provide a deeper understanding of the sport, actionable insights, or information about any improvements or innovations in the sport."
  },
  {
    "title": "IS Suicide Bomber Kills 22 at Damascus Church Service",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 21:26:21 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The interior ministry says a man affiliated with IS entered a church and opened fire before blowing himself up.",
      "<p>Evening attack is first major atrocity by Islamist terror group in Syria since President al-Assad was deposed</p><p>A suicide bombing by Islamic State (IS) targeting a church in Damascus has killed 22 people and wounded 63, Syrian state media have said.</p><p>The attack on Sunday night was the fi",
      "The attack on a Greek Orthodox service made clear the challenges facing Syria’s new government in a country long pitted by sectarian divides.",
      "Blast in Dweil’a on the outskirts of Syria&#039;s capital was carried out as people were praying inside the Mar Elias Church."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c5c3/live/17cf3e10-4f93-11f0-a466-d54f65b60deb.jpg",
    "titles": [
      "Suicide bombing at Damascus church kills 22, Syrian authorities say",
      "Islamic State suicide bombing in Damascus church leaves many dead and dozens injured",
      "Syria Church Bombing Kills at Least 20 in Damascus",
      "At least 20 killed in Damascus church bombing attack, dozens wounded"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.945,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "An Islamic State (IS) suicide bomber attacked a Greek Orthodox church in Damascus, Syria, during a service, killing 22 and wounding 63. The incident occurred in the Dweil’a area on the outskirts of the capital. This marks the first major terrorist act in Syria since President al-Assad's deposition, highlighting the ongoing sectarian challenges the new government faces.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story reports on a tragic event, raising awareness about the ongoing sectarian challenges in Syria. However, it does not provide deeper insights into the root causes of these challenges, potential solutions, or the broader impacts of this event."
  },
  {
    "title": "Brook's 99 Nears India's Score; Match Poised as Teams Enter Day 4",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 17:42:39 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Harry Brook's knock of 99 helps England close the gap to trail by six runs before India get their second innings underway with a score of 90-2 at close of play on day three of the first Test at Headingley.",
      "India has 96-run lead over England with eight wickets remaining going into day four of first cricket Test at Headingley.",
      "India are two down, leading England by 96, going into the fourth morning of the first Test at Headingley after another hugely-absorbing day's play on Sunday.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/cricket/match/2025-06-22/england-cricket-team\">First Test, D3: India 471 &amp; 90-2; England 465</a></p></li><li><p>England captain removes Sai Sudharsan on 30</p></li></ul><p>For all the tired old wisecracks about cricket in Yorkshire being a do",
      "A shock decision at the toss, an India batting collapse, a Jasprit Bumrah masterclass, an Ollie Pope century and some Harry Brook heartbreak later, we are no closer to knowing who is going to win the first Test between England and India at Headingley."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3ad1/live/1bf700b0-4f91-11f0-86d5-3b52b53af158.jpg",
    "titles": [
      "Brook misses out on century as first Test finely poised on day three",
      "India-England: Brooks scores 99, Stokes strikes late on day 3 of first Test",
      "Stokes strikes late to leave England-India Test perfectly poised",
      "Stokes strikes late for England to leave India Test in balance after Brook falls for 99",
      "England and India parity? First Test hangs in the balance"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.874,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.801,
    "summary": "On day three of the first Test at Headingley, Harry Brook scored 99 runs, bringing England close to India's first innings score with a total of 465. India, in their second innings, ended the day at 90-2, leading by 96 runs with eight wickets in hand. The match has seen significant performances, including a century by Ollie Pope and a notable bowling effort from Jasprit Bumrah. The outcome remains uncertain as the teams head into day four.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the ongoing cricket match between England and India. It gives some details about the performances of the players and the current status of the game. However, it does not offer deeper insights or actionable information for the reader."
  },
  {
    "title": "Foster Out, Capers, Tiven, Wright to Referee NBA Game 7",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 21:37:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Yahoo Sports",
      "Forbes",
      "Sportsnet",
      "Sky Sports",
      "CityNews",
      "NHL",
      "CBS Sports",
      "Sports Illustrated",
      "Al Jazeera",
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "business",
      "sports",
      "general"
    ],
    "snippets": [
      "Xabi Alonso gets first victory as Madrid manager, despite his football side playing most of game with only 10 players.",
      "<p>Star German midfielder Jamal Musiala is back training with Bayern Munich on Sunday after he went off only 25 minutes after entering Friday night&#8217;s Club World Cup match for Bayern Munich and was substituted by national team veteran Thomas Müller in the 82nd minute.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9FOTZKalkxMnl1b0ZGcjhhSExHbTdfSXpDdlliNjkxRVJyTjZpcVo3SjJ5TF9XV29vRE9mNEpJejhaYVU0bVBJMTZCT3VGY29yNWxMVXJ5SGdUSERjbm1VX0dOaUVtdEhRMWMxX0hhWS1vcmdHUm9oZG1kdUM?oc=5\" target=\"_blank\">Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First ",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQejJyNmFfQ3paWHhBejJ0WXNBbDBSbW16TzRMYU9Wb29LLTl6QzB1VEdEOXRYN1pONDhoQjVHeGNVcDBDekVsZGJxRWEtb2dmdXEwRzNpVkt0VWxaQXo5eERxNzd5QklISmNaX1F2andUNTJjYkxCTGtOQ0NFUkJYN0JTOE9BX01yVlE?oc=5\" target=\"_blank\">Bayern Munich ‘Targeting Second Liverpoo",
      "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxNUHFtbE11V2lmdnZNRXg5dnZydzJQWUxhbjV0ZEJIODFfcWhCQTBoNnVDUEUtZzVqT1h6M2J4OEdJdmEtd2JjaXB5cUtVNVhFTkxIamE1VDlLWWVLYTM3R05wZ3ZTb1NEUTlpWG9PNGFObU1qaU02TDFzTnJMR0JEaEJnTUtOWVZVX2doaU40bXdxXzdYaThhLXpHdWZGN1Fi?oc=5\" target=\"_blank\">Cubs Star R",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9EQjE2SjUzc19MSEFNNDVMQkhrQjZQYXlMS2p4Xy01SHN1WS0zSkpjRTNnZS0tU2lGa2N3NFZDdU1EVjBqUGZva0pZWWh5VnZTb0lsanlkTEZmUHdYTm5qb296dDVCVnpjYmZLNVdnbFVoVVR3Vk53UXpTanZrV1E?oc=5\" target=\"_blank\">Rockets Acquire Kevin Durant in Blockbuster Trade With S",
      "<p>Kevin Durant is set to add another chapter to his long and winding NBA story.</p>\n<p>The Phoenix Suns have dealt the 15-time All-Star to the Houston Rockets in exchange for Jalen Green, Dillon Brooks, the No. 10 pick in the 2025 draft and five second-round picks ending his fruitless run in the de",
      "After landing Kevin Durant, the Rockets are now No. 2 among NBA teams in 2026 championship odds. Prior to the deal, Houston wasn’t among the top tier.",
      "The Houston Rockets are acquiring 15-time All-Star Kevin Durant from the Phoenix Suns in a blockbuster deal struck on Sunday, according to reports in the US media.",
      "Phoenix Suns All-Star forward Kevin Durant will join his fifth NBA team after being traded to the Houston Rockets.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBRWE0wZVVEaDRoZG1kT2RKcWQ2TVhxcWplYzhneHlqcWdXOUZOMWpwM1VvVW9IQUhvVzAxZzRES3BxcXNWYUZFLUh0STVJd3FLRUxvXzRFX2VYbGFtRlZpU00zSk9TQmFpQzB6aVM2WmJqTXFiYmVJ?oc=5\" target=\"_blank\">Marchment traded to Kraken by Stars for 2 draft picks</a>&nbsp;&nbs",
      "Durant isn't joining another superstar this time, and Houston is ready for takeoff",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPX0hWVHUwS25maUZYclg4aE5LX3lZd09iVS1zS3VjQ3Fsbmd1TEtXMjRoNnpmd01fYWkza05mcWxSN0F4VlhVTnBUNXdrZW45TDBoeW5qWkprdzQwTXlEaVAyXzJoUXZFS1g1bndNaHpCOUJEY01JX0Y2NlRHRUROeGVmWl9LVmdD?oc=5\" target=\"_blank\">Flash Sale: Ja Morant's Nike Sneakers are J",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNc2lFM0ZfTWZ1YllTck56QkFNenZNUkFHVUliUmFQUFVtV2FXSExBQkxrXzVvYXZWNDlaR1RrV3pyVUdISGxsbWg1aGpoUFF5UVF5TnhiRHJ3RFNScGdqLU9za1R6cUdZQjFibXhldW1OSUtSSFp6b1BoZFFRQzgzZ0NyNkhsLXd3azl2cFJFYTlYRUFjOXc?oc=5\" target=\"_blank\">Russell Henley Calls Pen",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE92T3ZzU3RLVUJzdGpQTlJWMzdPQnJqSnBnSjVjVUZFQ1NoZGlVNUpteG1pTmhkbkZBeGhwb0lLUVUtbHo0Rm9zS3VwT1hpanM2c2V1SXpqWncxQi15LWU3NWVuXzVkX0dvdm8tcEw3bThBUQ?oc=5\" target=\"_blank\">USMNT Lose Key Striker to Injury for Remainder of Gold Cup</a>&nbsp;&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPNDNlMk8tNWtIOTRSXzBfS09GTXJsdkVhTXVlMjV6N3pvUGY4QzFhWXdOTHRMY3ZpSnh3cG5Ya1V4b2xWc3MxUXZFazlxOXQ5V3FJWUMtMXBWU25Vb3d5MVJHOGlmWXVITGxialFqOTFuMDBTOWctemFFNXJpeTI0cTNKVGtJNGwwV2VRQw?oc=5\" target=\"_blank\">Ben Griffin Responds to Jack Nicklaus",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxONmxVaTBHT2JtM09menZwcUdWbWlqVjFhaTZqRi1UU2FDUGhNTXVuRVpEeGRpTHlRWm5fMGV5WktDNDZsNUEySHlCMEZoQm90VGdNTzN1b2ZhYlNxT2JKaEpKd2kwNkxDZENSYUNKV1A4N2NHRXpvZnktMUhqdGFmNFlUamRxT210VnhtQmMyNVU2UFVR?oc=5\" target=\"_blank\">Details of Heat’s Failed Fi",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNZFFjNkpuZVdkemhTRmpTeXpuanh4SXR2aHBOVU5zNWlkaGdiU1RBSTUzYzMydm5RVkRYb0ZpV1g0QjRaUTNXZW9KRUdmYmRGbDVyQmFUem5VN21fTU9IMUI0NVJBcldaOEkyQVc1TDFKdl9pcldhRnJHNkdiWGxLNzNLS0lSQVROOWxXLS1ZQ1RRS1U?oc=5\" target=\"_blank\">Pacers vs. Thunder Keys to N",
      "OKLAHOMA CITY (AP) — Oklahoma City Thunder coach Mark Daigneault knows exactly why the NBA Finals are coming down to a Game 7. “It’s a contest of wills,” he said. And to this point, neither side has lost its will. Back and forth they have gone, the Thunder and the Indiana Pacers. Indiana led the [&#",
      "<p>Michael Grange joins Sportsnet Central to discuss why Indiana Pacers&#8217; Pascal Siakam and Oklahoma City Thunder&#8217;s Shai Gilgeous-Alexander are the front runners to win NBA Finals MVP.</p>",
      "<p>It all comes down to Game 7 of the NBA Finals between the Indiana Pacers and Oklahoma City Thunder. Watch live on Sportsnet and Sportsnet+.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPekh6eTZ6b2NITzdkd2taRGFTMGoycUZvNUZUNlgteHFiZm1WTndoUHNySjNRNnNuTFA0VmQtQmF4eUkxOG1wMFR5MWMxOG96T3pESTQ1X1hQSF9Gam5NVmxmRGVhbzlKTVFMWmhKZlp3RjAxNmIzOXhHT05LZU9fNnJSeEJNekRxMml6Mi1BLVZ2NlBw?oc=5\" target=\"_blank\">Travis Hunter Makes NFL His",
      "<p>Two-way college star and reigning Heisman Trophy winner Travis Hunter, the second overall pick in April&#8217;s NFL draft, signed a four-year, $46.6 million contract with the Jacksonville Jaguars on Sunday.</p>",
      "Travis Hunter's four-year, $46.65 million fully guaranteed deal with the Jaguars includes a $30.57 million bonus paid up front.",
      "After officially signing his rookie deal, Jacksonville Jaguars' second overall pick, Travis Hunter, had a brief message.",
      "Tonight is the first NBA Finals Game 7 in almost a decade. Here is what to watch for as the Thunder take on the Pacers.",
      "<ul><li><p>Thunder host Pacers in winner-take-all Game 7</p></li><li><p>Send David an email at <a href=\"mailto:david.lengel@theguardian.com\">david.lengel@theguardian.com</a></p></li></ul><p><strong>Rick the Ruler</strong></p><p>Has Rick Carlisle gotten enough love? I don’t think so. The Pacers head ",
      "<p>Donnovan Bennett takes a look at the four Canadians dominating in the 2025 NBA Finals and how they&#8217;re paving the way for Canada Basketball to become even bigger and better in the future.</p>",
      "The Oklahoma City Thunder are seemingly planning for a Game 7 victory in the NBA Finals. Pacers coach Rick Carlisle said it's &quot;all I'm thinking.&quot;",
      "A video of open-topped buses, wrapped in Thunder blue with “2025 Champions” down the side, circulated on X before Game 7.",
      "Pacers coach Rick Carlisle saw video of the buses being prepared, and he was ... less than happy.",
      "Rick Carlisle seemed very annoyed over the video of the Thunder's championship buses.",
      "Carlisle has plenty of motivational material for the Pacers entering Game 7",
      "Eric Cohen reveals his top 2025 NBA Finals picks for Oklahoma City vs. Indiana in Game 7 on Sunday",
      "SportsLine's proven model has simulated the New York Mets vs. Philadelphia Phillies 10,000 times and released its MLB picks for Sunday Night Baseball",
      "SportsLine's Jon Eimer reveals his picks for the Concacaf Gold Cup 2025 matchup between Haiti and the United States on Sunday",
      "SportsLine's Martin Green reveals his Club World Cup final picks for Al Ain vs. Man City on Sunday",
      "Both are on the outside looking in at a spot in the round of 16",
      "The MLS side look to stun the European champions",
      "SportsLine's computer model has revealed three free NBA prop picks for Indiana vs. Oklahoma City in Game 7 of the 2025 NBA Finals after evaluating the latest NBA odds",
      "Three-leg NBA SGP picks and best bets for Sunday's NBA Finals 2025 Game 7 between Oklahoma City and Indiana",
      "SportsLine's model simulated Oklahoma City vs. Indiana 10,000 times and revealed its NBA picks for Sunday's NBA Finals 2025 Game 7 contest",
      "SportsLine expert Matt Severance reveals his NBA bets and predictions for Sunday's Game 7 of Indiana Pacers vs. Oklahoma City Thunder in the NBA Finals 2025",
      "The experts highlight the bets to make and other betting insights on Game 7 of the NBA Finals.",
      "The first NBA Finals Game 7 in nine years is set for Sunday night",
      "<p>James Capers, Josh Tiven and Sean Wright joined a very small club on Sunday.</p>",
      "The final signature event of the PGA Tour season takes players to Connecticut",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQanlLb3pnUFp6QTFrYWFtSThqVG5ZZUR3WTRxcGhqM2hjYmI1X0NYaFQ5SV91ekFEQkhEQ09iVVNmRmxUUFgxdGpMMjh1Tlc2V1RBT2tnNm9qOWNkS1FpRmE2Y0E3b2ZSeTBmXzA1anNuOWpaMnk3ZFZwTEZLNjhxb201SDhsUzV4enAzaFNXUE5sUWx6eWlKM3ZR?oc=5\" target=\"_blank\">Maple Leafs Reporte",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNb2pBNTI2dC1iM0RldzBUT3BGZzdjRy1sTVFmZU9GUnRSRGxuMlBVTkhIOTk5akM3R2Z2anJocENNa1NHLWVrMDc2Z1IxdGpjTlQ1ZG5pam1ibEY1dXVSa2xHWGUtXy1rUWEzVHpBdEhZb1JkdHZLX3M2aHpOdFlDc19STmRGeHc?oc=5\" target=\"_blank\">Magic Johnson Makes Prediction for Rockets A",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQdmppYnk2WVZxMzBySU91MGQ0NlEtenBRR1FJeXg1Rmo5TGE5NjhTMjZKa21TX0NlZ3VyWWZQeGduWjBjcWFJWFNhVGJWb0NJNEptRHZkd2NUdE9aSXFhMzlJNVdjZm5WenFCbnFYQ1M4QjNxZm9RSktxTG5zc0hPOUZXZjdwT2xDZi1ScXRPSVVVMHRab2xaNQ?oc=5\" target=\"_blank\">New York Yankees Proj",
      "The Kevin Durant era is over in Phoenix. He will be traded to the Houston Rockets in exchange for Jalen Green, Dillon Brooks, and a package of draft compensation.",
      "The Suns and Rockets have agreed to a deal that lands Kevin Durant in Houston. Which side won the trade?",
      "Magic makes bold KD claim.",
      "WWE Hall of Famer Bubba Ray Dudley (Bully Ray) talks about Season 2 of WWE LFG and responds to Ron \"The Truth\" Killings.",
      "Kevin Durant was just traded to the Houston Rockets, and we look at how it affects the Dallas Mavericks moving forward.",
      "Kevin Durant has long had a unique relationship with NBA Twitter, and that includes a handful of old tweets pertaining to Houston and the Rockets.",
      "Durant was on stage when fans began shouting the Rockets trade news",
      "Green headlined the return for Phoenix but for how long?",
      "Houston scores its lone missing piece in a home-run swing for Durant",
      "Phoenix's selection could give us a clue about the direction of the franchise",
      "Durant is joining his fifth NBA team in hopes of winning a third championship",
      "Ex-Sun star believes Jalen Green will not be in Phoenix for long.",
      "Phoenix ultimately couldn't drum up peak value for Durant in a trade",
      "In the last four years, Houston and Phoenix have effectively switched places",
      "Let's dive into the winners and losers from the latest blockbuster trade",
      "The Suns have agreed to trade Kevin Durant to the Rockets for Jalen Green, Dillon Brooks, the No. 10 pick in this year's draft and five second-round picks, sources told ESPN.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPeXFGaG1YTElQb1E0Qk1LR2JwYklnZnpNVzVBRUJUcXhUcWk2OTFzazBMYlFDOHEtOTdoNlYwZEZ3RDVCeTVFRXZLV3htZ2NHdUJ5ZVNDbE9VNnA1eS1hZXBacEk2VzlCLS1HRV9hRmhHekVia2RfMzhOSE0xcm1zSlhPUWJJelhpcHBWcXY4T21UMHlkbkYtNg?oc=5\" target=\"_blank\">Details Released Abou",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQeHBzN1RYbzhXV3hWSWdfYm5zakFUM2cweWJveEcxeDB1VzBDNmJZczY5c204WVVEUzA3ZEZ5Z3haRTNPVlQ1UXMyQ19zU1o5elV2MFRSel9IbWpVOFVPWU1kX1J6NWN2YmtvMzF0VGVqeDJaczR1UVlCMm9mbFp5VkZqT0FFSDA?oc=5\" target=\"_blank\">Eagles 'Weapon' Already Compared To Legend</",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPcVJiM2xWNWRCZmo5NjRPZ0JUYTlEYlR6d2ZVUFB3R2xQSVZPVE5GSXdUWi1ESUtoUWVla0dud2d1R1lGdEFKRVZubG1CWDdFQ19xWlB3SnVENVUwNV95Ny1tRHBzaHFCWk1XYlAzcUtEcEV4VzlXM0FHcEZJUlppcnA3QUUwMUFscTJKNWVweEVqVDg?oc=5\" target=\"_blank\">Former Atlanta Braves All-St",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQR2l3bk9hT3hvdFdGeU95UkxYRlAyQk5WaEVWcEs2aV9NMGNkSXZNU0l6c0F0NUN0cC1hQUFoazZxdTFpUE8zczExNm9jd2tROEdLVVNoYmNSRXR3N1NTNmRqWGFsU1Rza0daNHliQUNCQnhxaVZ3aTR0ZXpxRzJpUnVTTVlZVEE?oc=5\" target=\"_blank\">Predicting Lions' Madden NFL 26 Ratings: Def",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNNTJoNmZYX2tNRnRsbE1MOFc2UjZyMU83Tkc2OGlRRmh1T3RRakNZZTJBMEVuNVdUbUJ4X2xXeUZ5R2taTGJBVEVMTlczQzZCbWZtejE3dDdONmhnLUlhVnZMNEpwMWVMN25DanlGTmdRdkRPU3ZWVEVZZjlJOXctS01uSG41RDhzYzFkZEZ6dw?oc=5\" target=\"_blank\">Roundtable: Lions Player Not Gett",
      "Both sides are looking for their first win of the Club World Cup",
      "SportsLine's Brandt Sutton reveals his soccer picks for the 2025 FIFA Club World Cup group stage match between the CF Pachuca and Real Madrid on Sunday",
      "Los Colchoneros are in need of a result to advance",
      "Xabi Alonso gets his first win as Real Madrid coach, as Juventus secure another huge win to all but secure their spot in the round of 16. Here's what you need to know from Sunday's Club World Cup action.",
      "Turkish attacker Kenan Yildiz is taking advantage of this summer's competition, and that could mean a massive role with the Italian club next season"
    ],
    "image_url": "",
    "titles": [
      "Real Madrid beat Pachuca at Club World Cup despite Asencio’s early red card",
      "Jamal Musiala back at training for Bayern Munich at Club World Cup after injury scare",
      "Real Madrid 3–1 Pachuca: Player Ratings From Emphatic First Win of the Alonso Era - Sports Illustrated",
      "Bayern Munich ‘Targeting Second Liverpool Star’ Alongside Cody Gakpo - Sports Illustrated",
      "Cubs Star Reliever Has Brutal Showing in Triple-A Rehab Appearance - Sports Illustrated",
      "Rockets Acquire Kevin Durant in Blockbuster Trade With Suns - Sports Illustrated",
      "AP Source: Suns trade Kevin Durant to Rockets",
      "With Kevin Durant in hold, Rockets’ odds surge for 2026 NBA Finals",
      "Durant heads to Houston Rockets in stunning deal",
      "Durant traded to Houston Rockets for Green, Brooks, picks: Report",
      "Marchment traded to Kraken by Stars for 2 draft picks - NHL.com",
      "How Kevin Durant's trade to Rockets gives KD perfect situation to rewrite his legacy",
      "Flash Sale: Ja Morant's Nike Sneakers are Just $39 Online - Sports Illustrated",
      "Russell Henley Calls Penalty on Himself at Travelers to Teach His Son a Lesson - Sports Illustrated",
      "USMNT Lose Key Striker to Injury for Remainder of Gold Cup - Sports Illustrated",
      "Ben Griffin Responds to Jack Nicklaus's Subtle Stray After the Memorial Tournament - Sports Illustrated",
      "Details of Heat’s Failed Final Trade Offer for Kevin Durant Revealed - Sports Illustrated",
      "Pacers vs. Thunder Keys to NBA Finals Game 7: Energy, Effort and Will - Sports Illustrated",
      "Game 7: After a back-and-forth NBA Finals, it’s time for the Thunder and Pacers to decide the title",
      "Why Pacers’ Siakam and Thunder’s SGA are NBA Finals MVP front runners",
      "NBA Finals on Sportsnet: Pacers vs. Thunder, Game 7",
      "Travis Hunter Makes NFL History With Huge Payout on Rookie Contract - Sports Illustrated",
      "No. 2 pick Travis Hunter signs 4-year, $46.6M rookie contract with Jaguars",
      "Jags' Hunter signs 4-year deal with $30M up front",
      "Jacksonville Jaguars' Travis Hunter with brief message after signing rookie contract",
      "Stats, Odds To Watch For NBA Finals Game 7 Between Pacers And Thunder",
      "Indiana Pacers v Oklahoma City Thunder: NBA finals Game 7 – live updates",
      "How Canadian players have taken over the NBA Finals",
      "Pacers coach Rick Carlisle fumes over Thunder championship buses before Game 7",
      "Pacers coach Rick Carlisle reacts to video of OKC busses painted up as Thunder NBA champs",
      "OKC already has its championship parade buses ready. That's all Rick Carlisle is 'thinking about right now'",
      "Rick Carlisle had cryptic reaction to video of Thunder’s championship buses before Game 7",
      "Pacers' Rick Carlisle motivated by leaked video of Thunder championship buses: 'That's all I'm thinking about'",
      "2025 NBA Finals odds, predictions, NBA props, bets: Thunder vs. Pacers Game 7 expert pick, score prediction",
      "Mets vs. Phillies odds, prediction, props, time, June 22 bets: Free Sunday Night Baseball picks from top model",
      "USMNT vs. Haiti prediction, odds, time, best bets: Free 2025 Concacaf Gold Cup picks for Sunday, June 22",
      "Man City vs. Al Ain odds, prediction, time: Free 2025 FIFA Club World Cup expert picks for Sunday, June 22",
      "Porto vs. Al Ahly live stream, odds: Where to watch Club World Cup online, pick, prediction, what to know",
      "Seattle Sounders vs. PSG live stream, where to watch Club World Cup: Odds, prediction, pick, lineups",
      "3 best NBA player props, Pacers vs. Thunder Game 7 odds: Use SGA, Myles Turner in 2025 NBA Finals picks, bets",
      "Free NBA picks, odds, player props, SGP bets for 2025 NBA Finals, Game 7: Pacers vs. Thunder same game parlay",
      "Pacers vs. Thunder prediction, odds, line, start time: 2025 NBA Finals Game 7 picks by computer model",
      "2025 NBA Finals odds, Game 7 prediction: Pacers vs. Thunder picks, best bets by NBA expert on 168-91 run",
      "The ultimate NBA Game 7 betting guide: Best bets, insights, advice and more",
      "Where to watch NBA Finals Game 7: Thunder vs. Pacers TV channel, time, odds, live stream",
      "Referees picked by the NBA for Game 7 are James Capers, Josh Tiven, Sean Wright",
      "2025 Travelers Championship TV schedule, coverage, channel, golf live stream, where to watch PGA Tour event",
      "Maple Leafs Reportedly Lowball John Tavares With Initial Contract Offer - Sports Illustrated",
      "Magic Johnson Makes Prediction for Rockets After Kevin Durant Trade - Sports Illustrated",
      "New York Yankees Projected to Land Anthony Volpe Replacement - Sports Illustrated",
      "Houston Rockets Land Kevin Durant In Massive Trade With Phoenix Suns",
      "Grading the deal: Houston goes all-in, but did Phoenix get enough?",
      "Magic Johnson Makes Strong Prediction After Kevin Durant Trade",
      "Bubba Ray Responds To R-Truth And Makes Bold Prediction About WWE LFG",
      "How Blockbuster Kevin Durant Trade Changes Mavericks Playoff Chances",
      "As Kevin Durant joins, Rockets fans bump his old tweets about Houston",
      "WATCH: Kevin Durant, fans react to Rockets trade as news breaks with NBA superstar on stage at Fanatics Fest",
      "Suns not planning to trade Jalen Green after acquiring high-scoring guard in Kevin Durant deal, per report",
      "Kevin Durant trade grades: Rockets launch into contention, Suns eat crow as Jalen Green becomes swing player",
      "2025 NBA Mock Draft: Kevin Durant trade shakes up first round, leaves Suns with complicated decision at No. 10",
      "Kevin Durant trade: Rockets land Suns star in NBA blockbuster as Jalen Green headlines return",
      "Former Suns Star Expects Jalen Green to be Traded Once Again",
      "Kevin Durant trade: Why Heat reportedly rejected offer, plus which teams made a run before Rockets deal",
      "Kevin Durant trade shows just how far Rockets have risen, Suns have fallen",
      "Winners and losers of Kevin Durant trade: Good news for Rockets' Amen Thompson, Heat and Wolves miss out",
      "Sources: Durant to Rockets in blockbuster trade",
      "Details Released About Celtic's Deal For Benjamin Nygren - Sports Illustrated",
      "Eagles 'Weapon' Already Compared To Legend - Sports Illustrated",
      "Former Atlanta Braves All-Star Outfielder DFA'd By Padres - Sports Illustrated",
      "Predicting Lions' Madden NFL 26 Ratings: Defense - Sports Illustrated",
      "Roundtable: Lions Player Not Getting Enough Attention - Sports Illustrated",
      "Real Madrid vs. Pachuca live stream, lineups: Where to watch Club World Cup, match odds, pick, prediction",
      "Real Madrid vs. Pachuca prediction, odds, time, bets: Free 2025 FIFA Club World Cup picks for Sunday, June 22",
      "Atletico Madrid vs. Botafogo live stream, where to watch Club World Cup: Odds, prediction, pick, lineups",
      "Club World Cup updates: Alonso earns first win with Madrid, Juve near to round of 16",
      "Club World Cup creates opportunities for breakout stars, and the next one may just be at Juventus"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.949,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary": "Veteran NBA referee Scott Foster was not chosen to officiate Sunday's Game 7 between the Thunder and Pacers. Instead, referees James Capers, Josh Tiven, and Sean Wright were selected for the crucial final game, marking their entry into a select group of officials entrusted with such high-stakes matches.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the referees chosen for the game, but it lacks depth or insight into why these particular referees were chosen, what this means for the game, or the criteria for selection in high-stakes matches."
  },
  {
    "title": "LSU Wins Second College World Series Title in Three Years",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 19:47:13 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the Men's College World Series finals.",
      "<p>LSU knocked previously unbeaten Coastal Carolina ace Jacob Morrison out of the game with a four-run fourth inning and the Tigers won their second national championship in three years Sunday with a 5-3 victory in the College World Series finals.</p>",
      "The suspensions mean the coaches would miss a potential Game 3",
      "<p>Watch as Coastal Carolina head coach Kevin Schnall and first base coach Matt Schilling are ejected in the bottom of the first inning of Game 2 of the College World Series finals vs. LSU on Sunday.</p>",
      "The Tigers were victorious in Omaha once again, earning their second title in three years"
    ],
    "image_url": "",
    "titles": [
      "LSU chases Coastal, wins 2nd MCWS in 3 years",
      "LSU sweeps Coastal Carolina in College World Series finals for second title in three years",
      "WATCH: Two Coastal Carolina coaches ejected, suspended in first inning of College World Series Game 2",
      "Two coaches get tossed in chaotic first inning of Game 2 at CWS finals",
      "2025 College World Series: Scores, bracket, complete results as LSU wins eighth national title in baseball"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.992,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.79,
    "summary": "LSU defeated Coastal Carolina 5-3 in the Men's College World Series finals, claiming their second national championship in three years. The victory was highlighted by a four-run fourth inning that knocked Coastal Carolina's previously unbeaten ace, Jacob Morrison, out of the game. During the match, Coastal Carolina head coach Kevin Schnall and first base coach Matt Schilling were ejected, resulting in their suspension for a potential Game 3. LSU's win in Omaha reaffirmed their dominance in college baseball.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the outcome of the College World Series finals and highlights some key moments in the game. However, it lacks a deeper analysis of the team's performance over the years, the significance of the win, or the impact of the coaches' ejection."
  },
  {
    "title": "Tesla Launches Robotaxi Service in Austin with Select Model Y Fleet",
    "domain": "business",
    "location": "global",
    "published": "2025-06-22T19:09:41Z",
    "source": "Business Insider",
    "sources": [
      "TechCrunch",
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Today's the day for Tesla's long-awaited Robotaxi launch in Austin, Texas.",
      "Tesla has started giving rides in driverless Model Y SUVs in Austin. Details are still sparse, but limited service is open to vetted and invited riders.",
      "The number of Teslas deployed will be small — just 10 or 12 vehicles — and will only pick up passengers in a limited, geofenced area."
    ],
    "image_url": "https://i.insider.com/6858378f3d5881a51c1bd871?format=jpeg",
    "titles": [
      "Tesla officially launches robotaxis in Austin to a small group of users, charging a $4.20 flat fee per ride",
      "Tesla launches robotaxi rides in Austin with big promises and unanswered questions",
      "Elon Musk launches Tesla robotaxi service in Austin with $4.20 flat fee for customers"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.901,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "Tesla has launched its Robotaxi service in Austin, Texas, deploying a small fleet of driverless Model Y SUVs. Initially, the service is available to a select group of vetted and invited riders. The operation is confined to a limited, geofenced area in the city, with only 10 to 12 vehicles being used for the launch.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress and innovation in the field of autonomous vehicles. It provides useful information about Tesla's new service, which can help readers understand the current state of autonomous vehicle technology and its implementation. It also increases awareness about the systems and trends in this field."
  },
  {
    "title": "White Sox Rally to Beat Blue Jays 4-2, Notch First Late-Game Win",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 23:13:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "TORONTO — The Chicago White Sox entered Sunday 0-38 when trailing after seven innings this season. And despite a strong outing from starter Adrian Houser in his return from the paternity list, the team stood four outs away from having that unwanted streak extended. The Sox trailed the Toronto Blue J",
      "<p>Miguel Vargas added two hits and two RBIs to his season tally, Adrian Houser pitched into the seventh inning, and the Chicago White Sox took a 4-2 win over the Toronto Blue Jays.</p>",
      "<p>Kyle Stowers hit his first home run in 31 games, Otto Lopez drove in a pair of runs, and Sandy Alcantara allowed three runs over six quality innings as the Miami Marlins defeated the Atlanta Braves 5-3.</p>",
      "<p>Tommy Pham drove in three runs on three hits, Bailey Falter pitched into the sixth inning, and the Pittsburgh Pirates cruised to an 8-3 win over the Texas Rangers.</p>",
      "<p>Jazz Chisholm Jr. added two hits and two RBIs to his season tally, Will Warren pitched into the seventh inning, striking out six, and the New York Yankees took a 4-2 win over the Baltimore Orioles.</p>",
      "<p>Jazz Chisholm Jr. hit a go-ahead, two-run double off the right-centre field wall in a three-run eighth inning, leading the New York Yankees over the Baltimore Orioles 4-2 Sunday.</p>",
      "<p>Parker Meadows blasted a three-run homer, Wenceel Pérez added a two-run shot, and the Detroit Tigers crushed the Tampa Bay Rays 9-3.</p>",
      "<p>Cal Raleigh continued his hot streak with a two-run blast, Donovan Solano smacked a pair of two-run shots, and the Seattle Mariners crushed the Chicago Cubs 14-6.</p>",
      "<p>Chris Bassitt tossed six strong innings in a loss to the White Sox on Sunday, once again providing the type of rotation steadiness that has become a Blue Jays cornerstone.</p>",
      "<p>Blue Jays Central&#8217;s Jamie Campbell and Madison Shipman breakdown the eighth-inning collapse that ultimately costed the Toronto Blue Jays a series win over the Chicago White Sox.</p>",
      "<p>Sportsnet&#8217;s Hazel Mae and Shi Davidi break down Toronto Blue Jays reliever Jeff Hoffman&#8217;s eighth-inning hiccup, why manager John Schneider remains confident in him, Chris Bassitt&#8217;s strong outing, and Max Scherzer&#8217;s return to the rotation.</p>",
      "Miguel Vargas doubled in two runs in the eighth inning as the Chicago White Sox rallied past the Toronto Blue Jays 4-2 on Sunday afternoon."
    ],
    "image_url": "",
    "titles": [
      "Chicago White Sox rally on an 8th-inning double by Miguel Vargas to win the Toronto Blue Jays series",
      "MLB Highlights: White Sox 4, Blue Jays 2",
      "MLB Highlights: Marlins 5, Braves 3",
      "MLB Highlights: Pirates 8, Rangers 3",
      "MLB Highlights: Yankees 4, Orioles 2",
      "Chisholm powers Yankees rally for series win over Orioles",
      "MLB Highlights: Tigers 9, Rays 3",
      "MLB Highlights: Mariners 14, Cubs 6",
      "Bassitt provides stability for Blue Jays pitchers despite loss to White Sox",
      "Blue Jays’ eighth-inning collapse spoils series win over White Sox",
      "Blue Jays drop series to White Sox after Hoffman’s latest hiccup",
      "Vargas’s two-run double lifts White Sox over Jays"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.981,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary": "The Chicago White Sox overcame a late-game deficit to beat the Toronto Blue Jays 4-2, marking their first win of the season when trailing after seven innings. Miguel Vargas played a key role, driving in two runs in the eighth inning. Adrian Houser contributed with a strong pitching performance into the seventh inning. The game was part of a series of MLB matches that also saw wins for the Miami Marlins, Pittsburgh Pirates, New York Yankees, Detroit Tigers, and Seattle Mariners, with notable performances from players across the league.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the game's outcome and key players' performances, but it doesn't offer deeper insights into strategies, implications for the season, or the significance of the win beyond the immediate game."
  },
  {
    "title": "Alcaraz Wins Queen's Club Final, Extends Streak to 18 Ahead of Wimbledon",
    "domain": "general",
    "location": "global",
    "published": "Sun, 22 Jun 2025 19:45:02 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Carlos Alcaraz arrived in London with \"no expectations\" but, with Wimbledon only eight days away, he has sent an ominous message to his rivals.",
      "<p>Carlos Alcaraz showed he will be the man to beat at Wimbledon again after defeating Jiri Lehecka in the final at Queen&#8217;s Club on Sunday.</p>",
      "<ul><li><p>Alcaraz overcomes Czech 7-5, 6-7 (5), 6-2 in final</p></li><li><p>Spaniard stretches his unbeaten run to 18 matches</p></li></ul><p>Carlos Alcaraz was not ready for the occasion when he moved within touching distance <a href=\"https://www.theguardian.com/sport/2023/jun/25/alcaraz-wins-quee"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0312/live/01a0f2b0-4f92-11f0-8c9f-31142e36a373.jpg",
    "titles": [
      "Why Queen's champion Alcaraz is 'red-hot favourite' for Wimbledon",
      "Alcaraz takes second straight Queen’s Club victory ahead of Wimbledon title defence",
      "Alcaraz beats Lehecka to extend win streak and regain crown as king of Queen’s Club"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.912,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary": "Carlos Alcaraz, initially arriving in London with \"no expectations\" for Wimbledon, has proven to be a formidable contender by winning the final at Queen's Club. Alcaraz defeated Jiri Lehecka with scores of 7-5, 6-7 (5), 6-2, extending his unbeaten streak to 18 matches. This victory underscores Alcaraz's readiness and positions him as a strong competitor for the upcoming Wimbledon tournament.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Carlos Alcaraz's recent victory at the Queen's Club final and his preparation for the upcoming Wimbledon tournament. It contextualizes his current form and winning streak, providing insights into his potential performance in the upcoming tournament."
  },
  {
    "title": "Guardiola to Trim Man City Roster for Team Harmony, Gündogan May Exit",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 18:54:38 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Pep Guardiola has suggested he will slim down his Manchester City squad before the end of the transfer window to avoid having \"sad\" players next season.",
      "<ul><li><p>Manchester City face Al Ain in their second group game</p></li><li><p>Manager also hints that Gündogan could leave the club</p></li></ul><p>Pep Guardiola has said he will select 10 new players to face Al Ain in Manchester City’s second Club World Cup group game on Sunday night, though Rod"
    ],
    "image_url": "",
    "titles": [
      "Pep: Some City players will be 'sad' if they stay",
      "Pep Guardiola to shuffle City pack with ‘10 new players’ at Club World Cup"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.73,
    "summary": "Pep Guardiola, Manchester City's manager, has announced plans to reduce his team's roster to prevent player discontent in the upcoming season. This decision was shared amidst preparations for their second Club World Cup group game against Al Ain, where Guardiola intends to rotate the squad, introducing 10 new players. Additionally, there are hints that player İlkay Gündogan might leave the club. This move aims to maintain a harmonious team environment and manage the squad's size effectively.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about Manchester City's strategy for the upcoming season, offering insights into the decision-making process of the team's management. It also contextualizes the potential impact of these decisions on the team's harmony and performance. However, it does not offer solutions or highlight progress."
  },
  {
    "title": "OpenAI Removes io Acquisition Details Amid Trademark Lawsuit",
    "domain": "business",
    "location": "global",
    "published": "2025-06-22T23:48:32Z",
    "source": "Business Insider",
    "sources": [
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "OpenAI removed news of its deal with Jony Ive's io from its website on Sunday amid a trademark suit filed by iyO, another AI hardware company.",
      "OpenAI appears to have pulled a much-discussed video promoting the friendship between CEO Sam Altman and legendary Apple designer Jony Ive (plus, incidentally, OpenAI’s $6.5 billion deal to acquire Ive and Altman’s device startup io) from its website and YouTube page."
    ],
    "image_url": "https://i.insider.com/682e0b4aac40ae2b0c9eacd8?format=jpeg",
    "titles": [
      "OpenAI scrubs news of Jony Ive deal amid trademark dispute",
      "OpenAI pulls promotional materials around Jony Ive deal due to court order"
    ],
    "score_components": {
      "magnitude": 0.71,
      "recency": 0.993,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary": "OpenAI retracted information and a promotional video about its $6.5 billion acquisition of the device startup io, co-founded by CEO Sam Altman and Apple's Jony Ive, from its website and YouTube following a trademark lawsuit from iyO, another AI hardware company. This move indicates a response to legal challenges related to the deal and trademark issues.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is useful in that it informs readers about a current event in the tech industry, specifically the legal challenges OpenAI is facing due to a trademark lawsuit. However, it does not provide a deep understanding of the issue or offer any solutions or progress."
  },
  {
    "title": "Jon Jones Retires from UFC, Aspinall Named New Heavyweight Champion",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 19:16:17 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "No, the last chapter of Jon Jones' UFC career doesn't negate his legacy, yet it does add a \"but\" to the end.",
      "With Jon Jones retired, Tom Aspinall is the undisputed UFC heavyweight champion. Aspinall's first title defense could come against Ciryl Gane. We look at the fight odds."
    ],
    "image_url": "",
    "titles": [
      "Okamoto: Jon Jones' MMA résumé isn't ruined by not fighting Tom Aspinall",
      "With Jon Jones Retired, Tom Aspinall Opens As Favorite Over Ciryl Gane"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.982,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.722,
    "summary": "Jon Jones has retired from the UFC, leaving a complex legacy. Despite his achievements, his career's final chapter adds a caveat to his reputation. Following his departure, Tom Aspinall has become the undisputed UFC heavyweight champion, with potential plans for his first title defense against Ciryl Gane being discussed, including fight odds.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant change in the UFC, namely Jon Jones' retirement and Tom Aspinall's ascension to heavyweight champion. It hints at the complexity of Jones' legacy, but doesn't delve into specifics. It also provides some insight into future plans for Aspinall's title defense, contributing to reader understanding of the current state and future of the UFC heavyweight division."
  },
  {
    "title": "NBA Draft Prospect Rankings Released, Key Movements in Top 10 Noted",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 19:47:13 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Who made big jumps in the top 10? Where do the Duke, Rutgers players rank? Here's our final top 100 big board.",
      "Could the draft's No. 4 overall player slide to No. 8?",
      "Matt Miller and Jordan Reid stack their early top-fives at every position and break down the players they'll be watching during the 2025 season.",
      "Our experts reveal their consensus final NBA Draft prospect rankings"
    ],
    "image_url": "",
    "titles": [
      "📈 Final NBA draft big board: Top 100 prospects",
      "2025 NBA Draft: The most likely pick for every team inside the top 10",
      "Who are the best players in the 2026 NFL draft class? We picked the top five at every position",
      "2025 NBA Draft Top 100 Prospect Rankings: Scouting reports for top players on final Big Board"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.992,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.721,
    "summary": "Experts Matt Miller and Jordan Reid have released their final NBA Draft prospect rankings, highlighting significant movements within the top 10, including the positions of Duke and Rutgers players. They also speculate on the possibility of the draft's fourth-ranked player dropping to eighth. Additionally, they share their early top-five rankings for every position, focusing on key players to watch in the 2025 season. This comprehensive analysis aims to provide a clear overview of the talent landscape as the draft approaches.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information and context about the NBA Draft prospect rankings, which can help readers understand the dynamics of the upcoming season. However, it doesn't highlight progress or solutions, and its main focus is on speculation and predictions."
  },
  {
    "title": "Rashford Eyes Future With Lamine Yamal, Dreams of Barcelona Move",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 18:03:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Marcus Rashford has revealed his desire to play in the same team as Lamine Yamal in the future.",
      "<ul><li><p>Manchester United forward talks up 17-year-old</p></li><li><p>Barça also retain interest in Nico Williams</p></li></ul><p>The dream destination for Marcus Rashford after his exit from Manchester United appears to be Barcelona after he declared an interest in playing alongside Lamine Yamal"
    ],
    "image_url": "",
    "titles": [
      "Rashford: Hope to play alongside Yamal one day",
      "Marcus Rashford keen on linking up with Lamine Yamal at Barcelona"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.957,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.707,
    "summary": "Manchester United forward Marcus Rashford has expressed his interest in playing alongside 17-year-old Lamine Yamal in the future, hinting at a potential move to Barcelona as his dream destination after Manchester United. This revelation comes amid Barcelona's ongoing interest in Nico Williams. Rashford's statement highlights his admiration for the young talent and his aspirations for his career path.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about Rashford's aspirations and potential career moves, which could be useful for fans and analysts. However, it does not report on solutions or improvements, nor does it provide a comprehensive understanding of the systems or trends in play."
  },
  {
    "title": "Ohtani Strikes Out Two in Hitless Inning for Dodgers",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 20:53:15 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Ohtani threw just one inning Sunday against the Nationals",
      "<p>Shohei Ohtani records his first two strikeouts as a member of the Los Angeles Dodgers in his second rehab outing against the Washington Nationals.</p>",
      "<p>Shohei Ohtani pitched one hitless inning Sunday in his second mound start for the Los Angeles Dodgers, striking out two and allowing just one baserunner on an error by Mookie Betts.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/22/11e88633-ab67-4bf9-ba93-db7a1443c329/ohtani-imagn-images.png",
    "titles": [
      "WATCH: Shohei Ohtani makes second start of 2025, records first two strikeouts as Dodgers pitcher",
      "Ohtani records back-to-back strikeouts vs. Nationals",
      "Ohtani notches first Dodgers strikeout in sharp second outing"
    ],
    "score_components": {
      "magnitude": 0.73,
      "recency": 0.934,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary": "Shohei Ohtani, in his second rehab start for the Los Angeles Dodgers, pitched one hitless inning against the Washington Nationals on Sunday. He recorded two strikeouts and allowed only one baserunner due to an error by teammate Mookie Betts. This performance marked Ohtani's first strikeouts as a Dodger.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Ohtani's performance in a particular game. It provides some understanding of his current form and the team's performance, but does not provide deeper insights or actionable information for the reader."
  },
  {
    "title": "Concerns Rise Over US Troops' Risk of Retaliation from Iran",
    "domain": "business",
    "location": "global",
    "published": "Sun, 22 Jun 2025 02:44:16 GMT",
    "source": "Financial Times",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "Financial Times"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "Critics concerned that US military personnel could face retaliation by Iran and its proxies",
      "ESPN made a big mistake in its coverage of Caitlin Clark and the Indiana Fever on Sunday.",
      "Clark's on-court decision left some fans worried...",
      "<p>A&#8217;ja Wilson scored 24 points in a battle with cold-shooting Caitlin Clark on Sunday to lead the Aces to an 89-81 victory over the Indiana Fever and stop a three-game Las Vegas skid.</p>",
      "Fans noticed something off about Caitlin Clark during her game on Sunday.",
      "Caitlin Clark and the Indiana Fever took the court for a matchup against the Las Vegas Aces on Sunday afternoon.  The away-team Fever took a 42-36 lead into the halftime break.  Clark finished the first two quarters with eight assists, including six in the first quarter alone.",
      "Caitlin Clark battled A'ja Wilson on Sunday..."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2a35399f-0be1-4979-9dbe-706acd8870dc.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump faces backlash from Maga base",
      "ESPN Facing Backlash During Fever-Aces Game",
      "Fans Concerned for Caitlin Clark After On-Court Decision in Fever-Aces Game",
      "Aces beat cold-shooting Caitlin Clark and Fever to end three-game skid",
      "Fans Notice Something Off About Fever's Caitlin Clark During Sunday's Game vs. Aces",
      "WNBA Fans React to Caitlin Clark's Historic Achievement on Sunday",
      "Indiana Fever React to Caitlin Clark's Moment With WNBA MVP"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.64,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary": "Critics have raised concerns that US military personnel might be at risk of retaliation from Iran and its proxies. This situation underscores the potential for increased tensions between the United States and Iran, highlighting the risks faced by American forces in regions where Iran has significant influence.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the potential risks faced by US military personnel due to increased tensions with Iran. However, it lacks depth and insight, as it does not provide a comprehensive understanding of the causes, trends, or impacts of this situation, nor does it discuss potential solutions or strategies to mitigate these risks."
  },
  {
    "title": "Trump's Tax Package to Halt State AI Regulations, Boosting Tech Firms",
    "domain": "business",
    "location": "national",
    "published": "Sun, 22 Jun 2025 15:57:07 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "TechCrunch"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "A Republican effort to block US states from enforcing new artificial intelligence regulations will remain in President Donald Trump’s massive tax and spending package for now, marking a win for tech companies pushing to stall and override dozens of AI safety laws across the country.",
      "A Republican effort to prevent states from enforcing their own AI regulations cleared a key procedural hurdle on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Senate Can Keep Ban on State AI Rules in Trump Tax Bill",
      "Moratorium on state AI regulation clears Senate hurdle"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.843,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary": "A Republican initiative to prevent US states from implementing new artificial intelligence (AI) regulations will continue to be part of President Donald Trump's extensive tax and spending package. This development is considered a victory for tech companies that are seeking to delay or nullify various AI safety laws nationwide.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the intersection of politics, technology, and regulation. However, it does not clearly highlight solutions or empowering knowledge. It does increase awareness about the impact of political decisions on tech firms and the AI industry."
  },
  {
    "title": "Former Liberal Minister John McCallum Passes Away at 70",
    "domain": "general",
    "location": "national",
    "published": "Sun, 22 Jun 2025 18:22:31 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A statement says McCallum passed away peacefully Saturday surrounded by family.",
      "Former Liberal cabinet minister and Ontario MP John McCallum had died, according to a statement from his family which was posted on Facebook Sunday afternoon. “With heavy hearts, we share the passing of The Honourable John McCallum. He passed away peacefully, surrounded by family on June 21, 2025,” "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/f4a17ac516c9f9ad8763826085e5325c770ea2286129932860cbb60b0a5c029f.jpg?quality=85&strip=all",
    "titles": [
      "John McCallum dead at 75: A political veteran of ‘good humour and grace’",
      "Former cabinet minister John McCallum dead at 75"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.887,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.675,
    "summary": "Former Liberal cabinet minister and Ontario MP John McCallum has died, as confirmed by his family in a statement on Facebook. He passed away peacefully on June 21, 2025, surrounded by family. The announcement was made public on Sunday afternoon, expressing the family's deep sorrow over his passing.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the passing of former Liberal cabinet minister and Ontario MP John McCallum. However, it lacks depth as it does not provide any insights into his contributions or impacts on the political landscape, nor does it provide any actionable information for the reader."
  },
  {
    "title": "Coastal Carolina Coaches Ejected Early in College World Series Final",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 22 Jun 2025 19:47:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Coastal Carolina coach Kevin Schnall, who was ejected in the first inning of the College World Series final against LSU, said his ejection wasn't justified.",
      "<p>Coastal Carolina coach Kevin Schnall, tossed from the game along with first base coach Matt Schilling in the first inning of the College World Series finals Sunday, said his ejection wasn&#8217;t justified and he was wrongly accused of bumping an umpire.</p>"
    ],
    "image_url": "",
    "titles": [
      "Coastal Carolina coach: CWS ejection unwarranted",
      "Coastal Carolina coach says CWS ejection was unwarranted, wrongly accused of bumping ump"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.992,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary": "Coastal Carolina coach Kevin Schnall and first base coach Matt Schilling were ejected in the first inning of the College World Series final against LSU. Schnall argued that his ejection was unjustified, claiming he was wrongly accused of bumping an umpire. The incident occurred during the game's early stages, sparking controversy around the decision.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an incident during a sports event, but it doesn't offer much depth or insight. It does not provide actionable insights or deeper understanding for the reader, nor does it report on solutions or improvements."
  },
  {
    "title": "Tesla’s robotaxi is live: here are some of the first reactions.",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-22T19:58:26-04:00",
    "source": "The Verge",
    "sources": [
      "MarketWatch",
      "The Verge"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Tesla finally did the damn thing. The company launched its hotly anticipated robotaxi service in Austin, Texas, on Sunday, June 22nd — and we’re now starting to see some of the first reactions roll in. But first, we have to get a few important caveats out of the way. Tellingly, the service is not op",
      "The launch of the EV maker’s robotaxi service caps a decade of promises about autonomous vehicles by Tesla CEO Elon Musk."
    ],
    "image_url": "",
    "titles": [
      "Tesla’s robotaxi is live: here are some of the first reactions.",
      "Tesla’s robotaxi launch is here. Here’s what it means for the stock."
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.996,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "Without a summary or further information, it is impossible to evaluate the constructiveness of this story. It could potentially provide insights into the progress of autonomous vehicle technology, but without details, it's unclear if it offers any depth, insight, or value."
  },
  {
    "title": "Former England Bowler Syd Lawrence and FedEx Founder Fred Smith Pass Away",
    "domain": "business",
    "location": "global",
    "published": "Sun, 22 Jun 2025 17:34:28 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia",
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Bloomberg via Getty Images Fred Smith \" src=\"https://www.investopedia.com/thmb/26vf8mOhBn9Mb8IIorpyPTh7etw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-1129092699-891701a40e334843b993a7aa4660ca8f.jpg\" /><figcaption><i><p>Anna Moneym",
      "Fred Smith, the founder of FedEx and a celebrated entrepreneur who frequented Washington, DC, died Saturday at 80."
    ],
    "image_url": "https://www.investopedia.com/thmb/26vf8mOhBn9Mb8IIorpyPTh7etw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-1129092699-891701a40e334843b993a7aa4660ca8f.jpg",
    "titles": [
      "FedEx Founder Fred Smith Dies at 80",
      "FedEx founder Fred Smith is dead at 80"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.872,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary": "David 'Syd' Lawrence, a former England and Gloucestershire fast bowler, has passed away at the age of 61 after being diagnosed with Motor Neurone Disease last year. Lawrence took 18 wickets in five Tests for England. Separately, Fred Smith, the founder of FedEx and a Vietnam War veteran, has died at the age of 80. Smith started FedEx in 1973 with 14 planes, transforming it into a global express delivery giant.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the deaths of two notable figures, it does not provide much depth or insight beyond these facts. It does not offer actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Battery Performance Doubled with Dry Electrode Breakthrough",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 22:03:33 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/battery-breakthrough-scientists-double-performance-with-dry-electrodes/\" rel=\"nofollow\" title=\"Battery Breakthrough: Scientists Double Performance With Dry Electrodes\"><img alt=\"Battery Technology Charging\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"432\" s"
    ],
    "image_url": "",
    "titles": [
      "Battery Breakthrough: Scientists Double Performance With Dry Electrodes"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.453,
    "summary": "Scientists have achieved a breakthrough in battery technology by doubling performance using dry electrodes. This advancement could significantly enhance the efficiency and longevity of batteries, marking a pivotal development in energy storage solutions.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant innovation that could improve energy storage solutions. It provides useful insights into the progress being made in battery technology, contributing to the reader's understanding of this field."
  },
  {
    "title": "Study Identifies Key Phrases to Boost Child Cooperation, Reduce Tantrums",
    "domain": "business",
    "location": "national",
    "published": "Sun, 22 Jun 2025 23:56:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Child psychologist Reem Raouda has studied more than 200 child-parent relationships. She found the five phrases that get kids to listen without throwing a tantrum. It's language that makes \"children actually want to cooperate,\" she says."
    ],
    "image_url": "",
    "titles": [
      "I've studied over 200 kids—parents who have an easy time getting their child to listen never use these 5 'toxic' phrases"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "Child psychologist Reem Raouda conducted a study on over 200 child-parent relationships, identifying five phrases that effectively encourage children to cooperate without causing tantrums. Her research highlights language that motivates children to willingly listen and engage positively with their parents.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It not only provides a deeper understanding of child-parent relationships and communication strategies, but also offers actionable insights for parents or caregivers. It reports on a solution to a common problem, thereby empowering readers with knowledge."
  },
  {
    "title": "Breakthrough in UV Detection with Diamond-Platinum Nanowires",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 23:13:35 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/breakthrough-in-solar-blind-tech-diamond-nanowires-set-a-new-benchmark/\" rel=\"nofollow\" title=\"Breakthrough in Solar-Blind Tech: Diamond Nanowires Set a New Benchmark\"><img alt=\"Single Crystal Diamond Nanowires Embedded With Platinum Nanoparticles for High Temperatu"
    ],
    "image_url": "",
    "titles": [
      "Breakthrough in Solar-Blind Tech: Diamond Nanowires Set a New Benchmark"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Researchers have achieved a significant breakthrough in solar-blind technology by developing diamond nanowires embedded with platinum nanoparticles. This new technology sets a new benchmark for efficiency and performance in detecting ultraviolet (UV) light without interference from visible light. The advancement promises improvements in various applications, including communications, environmental monitoring, and military uses.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a significant innovation in the field of solar-blind technology. It provides readers with an understanding of the potential applications and benefits of this breakthrough, such as improvements in communications, environmental monitoring, and military uses. This empowers readers with knowledge about advancements in this field."
  },
  {
    "title": "Korean Scientists Unveil Breakthrough in Energy Storage Technology",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 22:38:50 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/overcoming-long-held-limitations-korean-scientists-unveil-next-generation-energy-storage-technology/\" rel=\"nofollow\" title=\"Overcoming Long-Held Limitations: Korean Scientists Unveil Next-Generation Energy Storage Technology\"><img alt=\"Solar Supercapacitor Art Conce"
    ],
    "image_url": "",
    "titles": [
      "Overcoming Long-Held Limitations: Korean Scientists Unveil Next-Generation Energy Storage Technology"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Korean scientists have developed a new energy storage technology, addressing long-standing limitations in the field. This next-generation technology aims to enhance the efficiency and capacity of energy storage systems, potentially leading to significant advancements in various applications, including renewable energy sources and electric vehicles. The breakthrough was announced on SciTechDaily, highlighting its potential impact on overcoming current energy storage challenges.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant innovation in energy storage technology, providing readers with actionable insights about the potential applications and benefits of this breakthrough. It highlights progress in addressing long-standing limitations in the field, which could lead to advancements in renewable energy sources and electric vehicles. This story contributes meaningfully to the reader’s understanding of this topic."
  },
  {
    "title": "Thai Leader Expands Cabinet, Takes Firm Stance in Cambodia Border Dispute",
    "domain": "business",
    "location": "national",
    "published": "Sun, 22 Jun 2025 21:18:33 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Thai leader Paetongtarn Shinawatra looks poised to brazen out a political crisis engulfing her government, with a cabinet expansion to keep her coalition intact and a tougher stance in a simmering border dispute with Cambodia."
    ],
    "image_url": "",
    "titles": [
      "Thai PM Paetongtarn Defies Calls to Quit as Border Spat Escalates"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "Thai leader Paetongtarn Shinawatra is addressing a political crisis by expanding her cabinet to maintain coalition unity and adopting a firmer approach in the ongoing border dispute with Cambodia. This strategy aims to stabilize her government amidst the challenges.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the political situation in Thailand and the leader's strategy to address a crisis. It increases awareness about the political system and the ongoing border dispute with Cambodia. However, it doesn't offer a deep insight into the causes or potential solutions to the problem."
  },
  {
    "title": "Why Danny Boyle shot ‘28 Years Later’ on iPhones",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 20:22:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Director Danny Boyle famously shot his post-apocalyptic classic “28 Days Later” on Canon digital cameras, making it easier for him to capture eerie scenes of an abandoned London, and giving the movie’s fast-moving zombies a terrifying immediacy. To make his decades-later sequel “28 Years Later” (whi"
    ],
    "image_url": "",
    "titles": [
      "Why Danny Boyle shot ‘28 Years Later’ on iPhones"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.924,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.427,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story could potentially provide insights into the use of technology in film-making. It could be useful to readers interested in film production or the creative use of everyday technology. However, without the summary, it's hard to determine if it offers solutions or innovations."
  },
  {
    "title": "US-China Trade War Strains Japan's Daido Steel Amid Sector Pressures",
    "domain": "business",
    "location": "national",
    "published": "Sun, 22 Jun 2025 21:18:19 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "As the US-China trade war expands into the auto, steel and rare earths sectors, few companies are feeling the pressure more than top Japanese car parts supplier Daido Steel Co."
    ],
    "image_url": "",
    "titles": [
      "Honda Supplier Rethinks China Relationship as Trade War Bites"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424,
    "summary": "The US-China trade war, now impacting the auto, steel, and rare earths sectors, is placing significant pressure on Daido Steel Co., a leading Japanese car parts supplier. This escalation affects companies deeply involved in these industries, highlighting Daido Steel's challenges amidst growing international trade tensions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insights about the impact of the US-China trade war on specific industries and companies, such as Daido Steel. It helps readers understand the broader implications of international trade tensions. However, it does not offer any solutions or progress towards resolving the issue."
  },
  {
    "title": "ESA's LISA Project to Study Dark Universe with Space Antenna",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 16:08:33 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/esa-is-building-a-massive-space-antenna-to-listen-to-the-dark-universe/\" rel=\"nofollow\" title=\"ESA Is Building a Massive Space Antenna to Listen to the Dark Universe\"><img alt=\"ESA LISA Mission Artwork\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\""
    ],
    "image_url": "",
    "titles": [
      "ESA Is Building a Massive Space Antenna to Listen to the Dark Universe"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.846,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "The European Space Agency (ESA) is constructing a large space antenna, named LISA (Laser Interferometer Space Antenna), designed to study the dark universe. LISA aims to detect and observe gravitational waves, which are ripples in the fabric of spacetime caused by massive cosmic events. This mission will provide insights into phenomena such as black holes and the formation of galaxies. The project's goal is to enhance our understanding of the universe's unseen aspects.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an innovative attempt to solve a problem - understanding the unseen aspects of the universe. It provides actionable insights into the ESA's ongoing efforts to study gravitational waves and the dark universe, contributing meaningfully to the reader's understanding of space exploration."
  },
  {
    "title": "Scientists Stress Role of Archaeology in Studying Climate Impact on Humans",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 11:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "How does climate change affect the way humans organize themselves? How has it shaped the course of human evolution? An international team of scientists, including scientists from the Université de Montréal, think the key to answering those questions is to pay more attention to the archaeological rec"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-blueprint-for-adapti.jpg",
    "titles": [
      "How archaeology can offer a blueprint for adapting to climate change"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.841,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "An international team of scientists, with members from the Université de Montréal, has emphasized the importance of archaeological records in understanding how climate change has influenced human organization and evolution. They suggest that examining past human responses to climate shifts can provide valuable insights into our own societal adaptations and evolutionary changes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the importance of archaeological records in understanding the impact of climate change on human evolution and societal adaptations. It offers empowering knowledge and increases clarity around the systems and impacts of climate change."
  },
  {
    "title": "The stablecoin evangelist: Katie Haun’s fight for digital dollars",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 18:43:27 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In 2018, when Bitcoin was trading around $4,000 and most Americans, at least, thought cryptocurrency was a fad, Katie Haun found herself on a debate stage in Mexico City opposite Paul Krugman, the Nobel Prize-winning economist who had dismissed digital assets as near worthless. As Krugman focused on"
    ],
    "image_url": "",
    "titles": [
      "The stablecoin evangelist: Katie Haun’s fight for digital dollars"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.893,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.42,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story seems to offer insights into the world of digital currencies and the role of key players in this field. It could be useful for readers interested in finance, technology, and trends in digital currencies. However, without a summary, it's hard to determine the depth of the information provided."
  },
  {
    "title": "OpenAI and Jony Ive&#8217;s &#8216;io&#8217; brand has vanished, but their AI hardware deal remains",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-22T17:44:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI has scrubbed mentions of io, the hardware startup co-founded by famous Apple designer Jony Ive, from its website and social media channels. The sudden change closely follows their recent announcement of OpenAI&#8217;s nearly $6.5 billion acquisition and plans to create dedicated AI hardware. "
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Jony Ive&#8217;s &#8216;io&#8217; brand has vanished, but their AI hardware deal remains"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing business deals between OpenAI and Jony Ive's brand. However, without more context or details on the implications or progress of this deal, the story's constructiveness is limited."
  },
  {
    "title": "WVU Student Finds Microplastics in Appalachian Stream Fish",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:00:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "When West Virginia University biology undergraduate student Isabella Tuzzio tested fish from central Appalachian streams, her research revealed microplastics in every fish she sampled."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/student-discovers-wide.jpg",
    "titles": [
      "Student discovers widespread microplastic pollution in Appalachian streams and fish"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.88,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "Isabella Tuzzio, an undergraduate student at West Virginia University, conducted research on fish from central Appalachian streams and found microplastics in every fish she sampled. This discovery highlights the widespread issue of pollution in aquatic environments, specifically pointing to the presence of microplastics in the ecosystem affecting local wildlife.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it increases awareness about the issue of pollution, specifically the presence of microplastics in aquatic ecosystems. The research findings provide useful insights, even though the topic is negative, and can potentially inform decisions and actions related to environmental conservation."
  },
  {
    "title": "Pluto's Atmosphere Alters Moon Charon's Color, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 16:43:08 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-crazy-idea-proven-true-plutos-breath-changes-its-moons-color/\" rel=\"nofollow\" title=\"A “Crazy Idea” Proven True: Pluto’s Breath Changes Its Moon’s Color\"><img alt=\"NASA New Horizonsf Pluto Surface Atmospheric Haze\" class=\"webfeedsFeaturedVisual wp-post-image\" heig"
    ],
    "image_url": "",
    "titles": [
      "A “Crazy Idea” Proven True: Pluto’s Breath Changes Its Moon’s Color"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.856,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.413,
    "summary": "Researchers have confirmed that Pluto's atmosphere, composed of nitrogen and other gases, interacts with its moon, Charon, altering Charon's color. This phenomenon occurs as Pluto's escaping atmosphere deposits a thin layer of particles on Charon, gradually changing its surface color. This discovery, made possible by observations from the New Horizons spacecraft, supports the theory that planetary atmospheres can affect the surfaces of nearby celestial bodies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of the interaction between planetary atmospheres and nearby celestial bodies. It doesn't report on solutions or improvements but increases awareness about the dynamics of our solar system, which is valuable for readers interested in astronomy."
  },
  {
    "title": "Humans Inhabit Diverse Environments Globally, Showcasing Adaptability",
    "domain": "science",
    "location": "global",
    "published": "Sun, 22 Jun 2025 13:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Humans are the only animal that lives in virtually every possible environment, from rainforests to deserts to tundra."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/early-humans-adapted-t.jpg",
    "titles": [
      "Early humans survived in a range of extreme environments before global migration, study says"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.87,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.386,
    "summary": "Humans are unique among animals for their ability to inhabit a wide range of environments across the globe, including rainforests, deserts, and tundra regions. This adaptability allows humans to live in virtually every possible climate and geographical area on Earth.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides basic awareness about human adaptability, it lacks depth and does not offer actionable insights or highlight any progress or solutions. It does not significantly contribute to the reader's understanding or decision-making."
  },
  {
    "title": "LinkedIn CEO says AI writing assistant is not as popular as expected",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:06:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "While LinkedIn users seem to have embraced AI, there’s one area that’s seen less uptake than expected, according to CEO Ryan Roslansky: the AI-generated suggestions for polishing your LinkedIn posts."
    ],
    "image_url": "",
    "titles": [
      "LinkedIn CEO says AI writing assistant is not as popular as expected"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.381,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "Without a summary, it's hard to fully assess the story. However, based on the title, it seems to offer basic awareness about the performance of a specific AI tool. But it lacks depth or insight into why this is the case, what it means for LinkedIn, or what it suggests about AI tools more broadly."
  },
  {
    "title": "Weird-shaped notebooks make me want to write again",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-22T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Andru Marino is an audio and video producer at The Verge. “I make videos on our YouTube / TikTok / Instagram channels, and have produced our podcasts like Vergecast, Decoder, and Why’d You Push That Button?” He also keeps a lot of notes, and his latest favorite places to keep them are the Triangle a"
    ],
    "image_url": "",
    "titles": [
      "Weird-shaped notebooks make me want to write again"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.361,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Again, without a summary, it's difficult to fully evaluate. But based on the title, this story seems to offer basic awareness about an individual's personal experience with a product. It lacks depth or insight into why these notebooks are effective, how they might benefit others, or any broader trends in notebook design or writing habits."
  },
  {
    "title": "Last day to save on your TechCrunch All Stage pass — prices go up tonight",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 22 Jun 2025 14:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It’s now or never — this is your final day to lock in savings for TechCrunch All Stage, happening July 15 in Boston. Prices increase tonight, June 22, at 11:59 p.m. PT. If you’ve been thinking about attending, now’s the time to commit. Register here. TC All Stage brings together founders, investors,"
    ],
    "image_url": "",
    "titles": [
      "Last day to save on your TechCrunch All Stage pass — prices go up tonight"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.354,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a time-sensitive offer, but it doesn't provide deeper insight, progress, or actionable knowledge beyond that. Its usefulness is limited to those specifically interested in attending the event."
  }
]