[
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 16:24:50 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "As Israel intercepted the aid ships, an airstrike also killed at least one aid worker in Gaza.",
      "Several boats from the Global Sumud Flotilla arrived at Israel’s Ashdod port on Thursday flying Palestinian flags.",
      "Protesters in cities around the world have condemned Israel&#039;s interception of the humanitarian flotilla bound for Gaza.",
      "Israel says activists from the Global Sumud Flotilla will be deported to Europe after naval forces stopped most boats bound for Gaza. Turkey and Colombia are among those condemning the interception. Follow DW for more.",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war.",
      "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave.",
      "<p>Activists from Global Sumud flotilla including Greta Thunberg arrested as final boat is presumed intercepted in Palestinian waters</p><p>Israel says it has stopped a pro-Palestinian flotilla carrying aid from reaching Gaza, with its navy intercepting all but one of the vessels trying to breach th"
    ],
    "image_url": "",
    "titles": [
      "Israel intercepts aid flotilla headed for Gaza",
      "Intercepted Gaza flotilla boats arrive at Israel’s Ashdod port",
      "Global protests against Israel’s intercepton of Gaza flotilla",
      "Middle East: Israel says will deport aid flotilla activists",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
      "Israel Detains Activists After Intercepting Flotilla Headed to Gaza: What to Know",
      "Israel stops 41 boats in aid flotilla with one ‘still sailing strong’"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.924,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 20:46:16 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian",
      "Al Jazeera",
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.co.uk",
      "www.theguardian.com",
      "www.ft.com",
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Keir Starmer says Britain must defeat rising antisemitic hatred.",
      "Residents in UK&#039;s Crumpsall say they are shocked after a car and knife attack near synagogue kills two people.",
      "Authorities in the UK are investigating what they described as a terrorist incident outside a synagogue in Manchester.",
      "UK police have confirmed the identity of a man who was shot by police after attacking a synagogue in Manchester. Three other people have been arrested in connection with what police have called a 'terrorist incident.\"",
      "Police say the perpetrator is a British citizen of Syrian descent after Starmer denounces terrorist incident",
      "<p>Greater Manchester police name Jihad Al-Shamie, 35, a British citizen, and say three people are in custody on charges of preparing acts of terrorism</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/02/police-at-scene-of-reported-stabbing-at-synagogue-in-manchester\">Full story: ",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "<p>Witnesses screamed ‘he’s got a bomb’ and ‘shoot him’ before suspect was killed by armed police</p><p>Worshippers had arrived early for a special morning service at Heaton Park shul in north Manchester. It was Yom Kippur, the holiest day in the Jewish calendar, and rabbi Daniel Walker was leading ",
      "<p>North of England editor Josh Halliday reports from the scene of the attack on Heaton Park Hebrew Congregation synagogue, in which two people were killed and three others seriously injured, in what appears to be the worst antisemitic incident in the UK in living memory</p><p>On Thursday morning at"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f3c3/live/f10ff160-9fbb-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack: Worshippers helped stop suspect entering synagogue",
      "Manchester Synagogue Attack: What We Know So Far",
      "Shock and disbelief as Manchester community reels from synagogue attack",
      "What we know about deadly UK synagogue attack",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Two killed in attack at Manchester synagogue",
      "Manchester synagogue attack suspect named by police after two people killed and three injured – as it happened",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Six minutes of terror: how Manchester synagogue attack unfolded",
      "The Manchester synagogue terror attack – Today in Focus Extra"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.912,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Labels Caribbean Cartels \"Unlawful Combatants,\" Orders Strikes",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 21:05:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Forbes",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Memo reported by US media shows Trump justification for strikes on alleged drug smugglers experts say likely illegal.",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress.",
      "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”",
      "The U.S. military has carried out multiple strikes targeting alleged drug smuggling boats in the region in recent weeks."
    ],
    "image_url": "",
    "titles": [
      "Trump memo says US in ‘non-international armed conflict’ with cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress",
      "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told",
      "Trump Says U.S. Engaged In ‘Armed Conflict’ With Caribbean Drug Cartels, Declaring Them ‘Unlawful Combatants’"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.937,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump declared drug cartels in the Caribbean as \"unlawful combatants,\" indicating the U.S. is in a \"non-international conflict\" with them, per a White House memo. Following this declaration, the U.S. military executed several strikes against boats suspected of drug smuggling in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President, Budget Director Discuss Shutdown on Day 2 Amid Firing Warnings",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:58:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "ABC News",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.ft.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The US presidents meets with the White House budget director as the shutdown continues into a second day, amid impasse.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTh3VTFKSEYxa3hFRVpxN2xuang0cHJGNHVmSkVfaWtKU3F5Y2MtUFVGWndNRGN1d2o4VzdmVFBQTjd5azNYRU1fV2dIeTNKNWp1MWVRWjZleVB4cWFNdWNuamg4U3VpLXlsd253ZERBT2p3R19fNlR0SHducTFCcElKalFOcUtrZDExY3pyZkplSkk?oc=5\" target=\"_blank\">Trump admin uses government ",
      "The White House also said the prospect of mass firings of federal workers was \"very real.\"",
      "Democrats accuse White House of using closure as cover for project to shrink government"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens to cut ‘Democratic agencies’ amid government shutdown",
      "Trump admin uses government sites to blame Democrats for shutdown - Axios",
      "Trump openly threatens to use shutdown to target Democrats for cuts",
      "Trump threatens permanent spending cuts as US shutdown continues"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.86,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President met with the White House budget director as the government shutdown entered its second day due to a stalemate. During this period, the White House warned of a \"very real\" risk of mass firings among federal workers. Democrats have accused the administration of using the shutdown as an opportunity to reduce the size of the government.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:49:04 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The Energy Department's cancellations of projects directly affected 16 states won by Kamala Harris in the 2024 presidential election.",
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "",
    "titles": [
      "Energy Dept. axes hundreds of 'green' projects in 'blue states' during shutdown",
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 23:49:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Jihad Al-Shamie, a 35-year-old British man of Syrian descent, is named as the synagogue attacker.",
      "<p>Police say Jihad Al-Shamie, a British citizen of Syrian descent, was behind car and knife attack that left three people seriously injured</p><p>Police have shot dead a terrorist who killed two people and seriously injured three others in an attack at a synagogue in Manchester on Yom Kippur, the h",
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3d24/live/ee9ed3b0-9fa2-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Police name Manchester attacker who killed two at synagogue",
      "Manchester attack: two killed and three injured after terrorist drives into grounds of synagogue and stabs worshippers",
      "Two killed in attack at synagogue on Yom Kippur in England"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Predicts Yankees-Red Sox Wild Card Winner; Padres-Cubs Battle for NLD",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 22:10:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.pinstripealley.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's model simulated Boston vs. New York 10,000 times and revealed its MLB picks for Thursday's American League Wild Card Game 3 matchup at Yankee Stadium in New York",
      "Two rookies take the mound in a winner-take-all rivalry clash.",
      "<p>The Padres and Cubs battle it out to determine who advances to the NLDS. Watch Game 3 of the wild-card series on Sportsnet 360 or Sportsnet+ at 5 p.m. ET / 2 p.m. PT.</p>",
      "<p>The Yankees and Red Sox look to book their ticket to the ALDS. Watch Game 3 on Sportsnet and follow the action using the MLB Live Tracker. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/502b0cbc-3743-45bd-9e2c-c0b7653b2b1e/aaron-judge-new-york-yankees-imagn-images-8.jpg",
    "titles": [
      "Red Sox vs. Yankees prediction, odds, time: 2025 MLB picks, best bets for AL Wild Card Game 3 by top model",
      "AL Wild Card Series Game 3: New York Yankees vs. Boston Red Sox",
      "NL Wild Card Series on Sportsnet: Padres vs. Cubs, Game 3",
      "AL Wild Card Series on Sportsnet: Yankees vs. Red Sox, Game 3"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine simulated the Boston vs. New York MLB American League Wild Card Game 3 at Yankee Stadium 10,000 times, providing predictions for the outcome. Meanwhile, rookies will face off in this crucial winner-take-all game. Concurrently, the Padres and Cubs are set to determine who advances to the NLDS in Game 3, available on Sportsnet 360 or Sportsnet+ at 5 p.m. ET. The Yankees and Red Sox also vie for a spot in the ALDS, with their game being broadcast on Sportsnet, accompanied by a live tracker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Discuss Agency Cuts with Budget Director Vought",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 13:23:02 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQLURNREVuNHRwS0tzX2ZsSzZjOE1TN2FjR2MyMzBZUkEwRHhrVFBkRlJhM0lTalNPa3R4dHk4eGY0cEZqN3ZGYzlxOE9GWHNIQW00cXFfQVJFT0ZQNmVWemx2M0RscXN0cHpxNUxvQmI2eEhFQm5tT0hVYnpOVGlQS29HRmtUZw?oc=5\" target=\"_blank\">\"Unprecedented opportunity\": Trump, Vought to",
      "Trump in a Truth Social post said he will meet with Office of Management and Budget Director Russell Vought to discuss cutting agencies.",
      "<p>Republicans and Democrats engage in war of words as White House also uses impasse to cut government spending</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates\">US government shutdown – latest updates</a></p></li></ul><p>"
    ],
    "image_url": "",
    "titles": [
      "\"Unprecedented opportunity\": Trump, Vought to decide which \"Democrat\" agencies to cut - Axios",
      "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities",
      "Trump sees ‘unprecedented opportunity’ to punish Democrats as shutdown enters day two"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.782,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Trump announced on Truth Social that he plans to meet with Office of Management and Budget Director Russell Vought to discuss reducing government agencies. The outcome of the meeting and any subsequent actions are yet to be determined.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Hikes Lease Prices Amid Record Q3 Deliveries, Tax Credit Expiry",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:32:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Analysts expect sales by the electric automaker to slump in the months ahead.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1kanBtZU5jREtadjBQYm1GUG9PZG9JOUFiVkhDM2N5Tk9yOURCOTgtYlRaektiU05Gc0t4TUtpZklaWWlhUHJRVEFZc2RTRGZiZzlaNktmaVAxVTFXWFhycmVwZGpHaS1SRl9IcHZvYw?oc=5\" target=\"_blank\">Tesla hikes lease prices as EV tax credit expires</a>&nbsp;&nbsp;<font color=",
      "Tesla's third-quarter deliveries got a boost as some consumers rush to buy electric vehicles before a federal tax credit expired."
    ],
    "image_url": "",
    "titles": [
      "Tesla sales jump as buyers scramble before EV tax credit expires",
      "Tesla hikes lease prices as EV tax credit expires - Axios",
      "Tesla deliveries rise 7% before EV tax credits expire"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.853,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla increased its lease prices following a surge in third-quarter deliveries, with 497,000 vehicles delivered as consumers rushed to purchase electric vehicles before the expiration of a $7,500 federal tax credit on September 30. This expiration motivated buyers and contributed to Tesla's sales growth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Morocco Protests Turn Violent: 2 Dead, Hundreds Injured; Unrest in Madagascar",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:39:45 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Police say they shot dead two people who were part of a crowd trying to storm a police station.",
      "After almost a week of regular demonstrations, protests in Morocco turned violent, resulting in hundreds injured and two deaths. Who's behind the protests, what are they demanding, and where might this end?",
      "A youth-led movement against the president of Madagascar is sustaining protests across the country. John Eligon, the Johannesburg bureau chief for The New York Times, explains what’s happened."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/56aa/live/c7c27130-9f7e-11f0-8978-23dd7eb26e73.jpg",
    "titles": [
      "First killings in Morocco since Gen Z protests erupted",
      "Morocco's Gen Z protests: What you need to know",
      "What We Know About the Protests in Madagascar"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.837,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Morocco, protests demanding unspecified changes turned violent, leading to two deaths and hundreds injured as police shot two individuals storming a station. Meanwhile, in Madagascar, a youth-led movement protests against the president, as reported by John Eligon. Both countries are experiencing significant unrest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tigers Advance to ALDS with 6-3 Win Over Guardians",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 18:37:38 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Detroit Tigers have defeated the Cleveland Guardians 6-3, advancing to the American League Division Series.",
      "<p>Dillon Dingler homered in the sixth inning, Wenceel Pérez drove in a pair of runs in a four-run seventh and the Detroit Tigers defeated the Cleveland Guardians 6-3 Thursday to advance to the American League Division Series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tigers topple Guardians in wild card, reach ALDS",
      "Tigers eliminate Guardians with Game 3 win, advance to ALDS vs. Mariners"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Detroit Tigers beat the Cleveland Guardians 6-3, advancing to the American League Division Series. Key players included Dillon Dingler, who homered in the sixth inning, and Wenceel Pérez, who drove in two runs during a four-run seventh inning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario College Strike Enters Week 4; Rallies and Disruptions Continue",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Thu, 02 Oct 2025 21:21:11 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The labour dispute began Sept. 11.",
      "Ontario&#8217;s college support workers held rallies at several colleges across the province on Thursday, as the ongoing strike is about to enter its fourth week. Around 400 people gathered at Humber College&#8217;s North Campus, and Toronto police warned drivers to expect &#8220;extreme delays&#822"
    ],
    "image_url": "",
    "titles": [
      "Striking support workers block access to Algonquin College",
      "Ontario college support workers hold rallies amid ongoing strike"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ontario's college support workers have been on strike since September 11, entering their fourth week. Rallies took place across the province, with about 400 people at Humber College's North Campus. The strike has caused significant disruptions, including traffic delays warned by Toronto police.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Newsom Warns CA Universities Against Trump's Funding Compact",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 22:21:23 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "LA Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.latimes.com"
    ],
    "snippets": [
      "<p>Governor Gavin Newsom urges schools not to sign ‘radical agreement’ to cuts to departments, students and speech</p><p>Any California universities that sign the Trump administration’s proposed “Compact for Academic Excellence in Higher Education” will “instantly” lose their state funding, Californ",
      "<p>The White House is asking nine major universities, including USC, to commit to President Trump's political priorities in exchange for more favorable access to federal money.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/979e317e5490bb651f3ae6c4e0894bae953927b0/147_0_4297_3438/master/4297.jpg?width=140&quality=85&auto=format&fit=max&s=437a1296eceadc1b81e241ecdeea0392",
    "titles": [
      "California vows to ‘instantly’ cut funding to universities that cave to Trump ‘compact’",
      "Newsom threatens to cut state funding to universities that sign Trump's political compact"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Governor Gavin Newsom warned California universities against signing the Trump administration's \"Compact for Academic Excellence in Higher Education,\" which ties federal funding to the commitment to the President's political priorities. Newsom stated that any university agreeing to this would immediately lose state funding. This directive particularly targets nine major universities, including USC, emphasizing the administration's attempt to align higher education with specific political goals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caitlin Clark Out of 3×3 League Season Due to Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 22:20:33 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Clark only played 13 games during her sophomore WNBA campaign due to an array of lower-body injuries",
      "WNBA star Caitlin Clark will not be joining Unrivaled — the 3×3 women’s basketball league that will be entering its second season — this winter, a source briefed on the situation confirmed Thursday. Front Office Sports first reported the news. The league has announced all but two of the 48 players f"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/2ffcaea9-04c4-41f5-80fa-a42020385b21/caitlin-clark-getty-4.png",
    "titles": [
      "WNBA star Caitlin Clark will not play in Unrivaled during offseason, per report",
      "Caitlin Clark will not play in Unrivaled this winter: Source"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caitlin Clark, a WNBA star, will miss joining the 3×3 women's basketball league, Unrivaled, in its second season due to lower-body injuries that limited her to 13 games in her sophomore WNBA campaign. This was confirmed by a source and reported by Front Office Sports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine's Hartstein Predicts Week 5 NFL Game: SF vs. LA Rams",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:33:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.battleredblog.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Larry Hartstein has revealed his picks for San Francisco vs. Los Angeles Rams in the Week 5 NFL matchup from SoFi Stadium in Inglewood, Calif.",
      "They say if it’s on, it’s on, but is it really on?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/23/fd65de5b-f5be-49e3-8ae7-25a62954e94c/template-pic.jpg",
    "titles": [
      "Thursday Night Football prediction, odds, spread, bets, line: Rams vs. 49ers picks from expert on 25-10 roll",
      "Thursday Night Football Open Thread – San Francisco 49ers at Los Angeles Rams"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Larry Hartstein, a SportsLine expert, has made his predictions for the Week 5 NFL game between San Francisco and the Los Angeles Rams at SoFi Stadium in Inglewood, California. The outcome of his picks has not been disclosed in the information provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FIFA Reveals \"Trionda\" as 2026 World Cup Official Ball, Honors Hosts",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:18:04 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "onefootball.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Trionda is the first official match ball for the World Cup to be tested based on the climate of the tournament's host cities",
      "FIFA officially unveiled the TRIONDA, the ball that will take center stage at the FIFA World Cup 2026™, with a design that pays tribute to the three co-hosting countries: Canada, Mexico, and the Uni...",
      "FIFA has officially revealed the ball that will define the 2026 World Cup, announcing today that the tournament will be played with the Adidas &quot;Trionda&quot;. The ball’s name is a fusion of “tri” and..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/acdab3d5-b52a-4731-8ce0-77efe3836d3e/ball-1.jpg",
    "titles": [
      "All about Trionda, Adidas' ball for the 2026 World Cup: More rounds of testing, AI advancements",
      "⚽ The official ball for World Cup 2026: FIFA unveils the TRIONDA",
      "🚨 BREAKING: FIFA unveil official 2026 World Cup ball — “Trionda”"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "FIFA unveiled the \"Trionda\" as the official match ball for the 2026 World Cup, co-hosted by Canada, Mexico, and the United States. The ball's design honors the three countries and is the first to be tested based on the host cities' climates, ensuring optimal performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Food Report Update Faces Misinformation by Pro-Meat Groups",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-02T22:33:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "A major scientific update to one of the most influential food and planetary health reports of the last decade is in the crosshairs of a pro-meat misinformation campaign.",
      "Emergency investment in the technology does not amount to a long-term defence strategy"
    ],
    "image_url": "",
    "titles": [
      "Online attacks threaten major climate-friendly diet report",
      "Drone attacks threaten us all"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A significant update to a key report on food and planetary health faces a misinformation campaign by pro-meat advocates. Despite emergency funding in technology, experts argue it's not a sustainable long-term defense strategy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Baltimore Judge Denies Asylum for Salvadoran in High-Profile Case",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 19:23:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The ruling is the latest twist in a case that has become emblematic of President Trump&#039;s mass deportation campaign.",
      "<p>Ábrego, who was deported to El Salvador in March before being returned to the US, has 30 days to appeal ruling</p><p>An immigration judge in Baltimore has denied Kilmar Ábrego García’s bid for asylum on Thursday, but he has 30 days to appeal.</p><p>Ábrego’s case has drawn national attention since"
    ],
    "image_url": "",
    "titles": [
      "US judge rejects Abrego Garcia’s asylum bid after wrongful deportation",
      "Judge denies Kilmar Ábrego García’s bid for asylum in the US"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An immigration judge in Baltimore denied Kilmar Ábrego García's asylum bid, part of a case that has highlighted President Trump's deportation efforts. Ábrego, deported to El Salvador in March and later returned to the US, now has 30 days to appeal the decision. This case has gained national attention.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince William Aims for a Reign His Son Would Admire, Seeks Less Press Intrusion",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 21:00:33 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Shitt's Creek and American Pie actor Eugene Levy asks Prince William about his future role as King.",
      "<p>William tells interviewer Eugene Levy of hopes to do work ‘my son is proud of’ as well as sparing him press intrusion</p><p>Prince William has said “change is on my agenda – change for the good” when he becomes king.</p><p>In one of his most personal interviews yet, the Prince of Wales set out hi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/58f6/live/d9b19600-9fb0-11f0-8410-854cfa733f11.jpg",
    "titles": [
      "I'll change the monarchy when I'm king, says Prince William",
      "Prince William describes agenda of ‘change for the good’ when king"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.916,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eugene Levy interviewed Prince William, who expressed his desire to make his future reign as king one that his son would be proud of, emphasizing the importance of positive change and reducing press intrusion. William's comments, revealing a personal and forward-looking approach to his eventual role as king, were shared in one of his most intimate interviews to date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Josh Hart Ejected in Knicks' Preseason Opener for Throwing Ball at Opponent",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 21:31:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The preseason got off to an unfortunate start for the Knicks",
      "<p>Knicks forward Josh Hart was ejected from the opening game of the pre-season Thursday after slipping to the court, then throwing the ball when a Philadelphia player tried to take it from him while he was on his back.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/7413aaf7-91ec-4688-b5d0-379385374115/hart-getty.png",
    "titles": [
      "WATCH: Knicks' Josh Hart gets ejected and injured at the same time during preseason game vs. 76ers",
      "Hart ejected from Knicks’ pre-season game after throwing ball"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the Knicks' preseason opener, forward Josh Hart was ejected for throwing the ball at a Philadelphia player after slipping and falling to the court. This incident occurred as the player attempted to take the ball from him while he was down.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rangers Loss Attributed to Mentality by Russell Martin, Not Tactics",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 23:29:58 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "After another defeat for Rangers, Russell Martin says mentality is to blame and not the tactical approach of his team.",
      "After another defeat for Rangers, Russell Martin says mentality is to blame and not the tactical approach of his team."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0f93/live/f0500020-9fe4-11f0-9462-afec1c2fb901.jpg",
    "titles": [
      "Martin's mentality mantra soundtracks another Rangers loss",
      "Martin's mentality mantra soundtracks another Rangers loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rangers faced another defeat, with Russell Martin attributing the loss to mentality rather than tactics. The team's focus on mindset over strategy is highlighted as a key factor in their recent performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Perplexity's Comet Browser Now Free, Aims to Elevate Content Quality",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:56:13 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Perplexity initially launched Comet in July to Perplexity Max subscribers for $200 a month",
      "AI search startup Perplexity is making its new Comet browser available to everyone in the world for free as it works to position the product against big browsers and search engines. For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via "
    ],
    "image_url": "",
    "titles": [
      "Perplexity AI rolls out Comet browser for free worldwide",
      "Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Perplexity launched its Comet browser in July for $200 a month to Perplexity Max subscribers. Now, the AI startup has made Comet free for all users, aiming to combat low-quality content and collaborating with publishers like CNN and The Washington Post. This move positions Comet as a competitor to major browsers and includes a 'background assistant' feature for certain paid subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Postecoglou Faces Early Setback as Nottingham Forest Loses in Europa League",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 21:04:37 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<p>Ange Postecoglou finds himself in an ominously tight spot after 23 days in the job. As Midtjylland streamed forward on the counterattack in the 88th minute, the Nottingham Forest manager rested his hands on his head, convinced how the next few seconds would play out. Forest, as he feared, would c",
      "Sky Sports reporter Anton Toloui and journalist Adam Bate reflect on Nottingham Forest's defeat to FC Midtjylland in the Europa League."
    ],
    "image_url": "https://i.guim.co.uk/img/media/df0fcd828439a73e8e6c904c6bc394f34f5f44d2/9_0_2270_1816/master/2270.jpg?width=140&quality=85&auto=format&fit=max&s=8fb879dd25ec0f79eceec68f0957833f",
    "titles": [
      "Nottingham Forest fans call for Postecoglou axe after 23 days following European defeat",
      "The Verdict: Forest fans show frustration at Ange after European defeat"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ange Postecoglou, the Nottingham Forest manager, experienced a challenging moment 23 days into his job when his team lost to FC Midtjylland in the Europa League. The defeat came after a counterattack by Midtjylland in the 88th minute, leaving Postecoglou visibly distressed. Sky Sports reporter Anton Toloui and journalist Adam Bate discussed the match's outcome and its implications for Postecoglou's tenure at Nottingham Forest.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France Arrests Chinese Captain; Moscow Decries Act as Piracy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 17:51:04 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Chinese national faces a count of refusing to follow naval instructions while piloting the vessel.",
      "Moscow considers France&#039;s detention of the ship, and arrest of the captain, an act of piracy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/838e/live/99859c60-9fb6-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Captain of tanker linked to Russian 'shadow fleet' charged in France",
      "France detains Russian ‘shadow’ tanker to disrupt war in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.858,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Chinese captain was arrested by France for not complying with naval instructions while piloting a ship. Moscow has labeled France's actions, including the detention of the ship and the arrest, as piracy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches \"Add to Delivery\" Feature for Prime Members in the US",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-02T13:36:32-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon has announced a new shopping feature for US Prime members called Add to Delivery that lets you add additional items to completed orders that have yet to be delivered, instead of having to create an entirely new order. The feature is only available on Amazon’s app and on Amazon.com when access",
      "Amazon's new \"Add to today's delivery\" button makes it easier for Prime members to buy more and tack on items to existing orders."
    ],
    "image_url": "",
    "titles": [
      "Amazon now lets Prime members add items to completed orders",
      "Amazon now lets Prime members add items to upcoming orders with one tap"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon launched a feature for US Prime members called \"Add to Delivery,\" allowing them to add items to orders already in progress. This aims to streamline shopping by eliminating the need for separate orders for additional items. The feature is accessible exclusively through the Amazon app and website.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]