[
  {
    "title": "Renowned Primatologist Jane Goodall Dies at 91",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 14:28:16 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera",
      "New Scientist",
      "CityNews",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.newscientist.com",
      "ottawa.citynews.ca",
      "www.dw.com"
    ],
    "snippets": [
      "Jane Goodall, primatologist who transformed our understanding of the lives of apes, has died, according to an announcement from the Jane Goodall Institute.",
      "The Jane Goodall Institute says famed primatologist died in California during US speaking tour.",
      "The Jane Goodall Institute said the renowned chimpanzee researcher died of natural causes at the age of 91.",
      "Acclaimed conservationist and chimpanzee expert Jane Goodall has died, leaving behind a legacy of empathy for primates and the natural world",
      "<p>Jane Goodall Institute says ‘tireless advocate’ for natural world died in California during US speaking tour</p><p>The world-renowned primatologist Jane Goodall has died at the age of 91, her institute has said.</p><p>The Jane Goodall Institute announced that she had died of natural causes while ",
      "Dr. Jane Goodall, one of the world&#8217;s most beloved animal behaviorists and a pioneer in primatology has died at the age of 91, the Jane Goodall Institute confirmed Wednesday. The British scientist, best known for her groundbreaking work with chimpanzees in Tanzania&#8217;s Gombe Stream National"
    ],
    "image_url": "",
    "titles": [
      "Jane Goodall, legendary primatologist, has died at age 91",
      "Jane Goodall, conservationist and chimpanzee expert, dies aged 91",
      "Primatologist Jane Goodall has died at the age of 91, her institute has said",
      "Jane Goodall, dogged advocate for the natural world, has died aged 91",
      "Jane Goodall, world-renowned primatologist, dies aged 91",
      "Renowned primatologist Dr. Jane Goodall dead at 91"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.816,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.843,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jane Goodall, the celebrated primatologist known for her pioneering research on chimpanzee behavior, has died at the age of 91. The Jane Goodall Institute announced she passed away of natural causes during a speaking tour in the US. Goodall, a British scientist, transformed our understanding of apes and was a tireless advocate for the natural world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Navy Stops Flotilla Near Gaza; Red Cross Halts Gaza Activities",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 16:12:53 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "NPR",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Global Sumud Flotilla, with Greta Thunberg, Nelson Mandela's grandson and European lawmakers aboard, includes some 50 boats and 500 activists and is carrying a symbolic amount of humanitarian aid.",
      "Climate activist Greta Thunberg is among activists on the Global Sumud Flotilla being taken to an Israeli port.",
      "Activists on the Global Sumud Flotilla shared a video they said showed Israeli vessels intercepting the fleet.",
      "The Israeli Navy intercepted the Global Sumud Flotilla from advancing to the Gaza coast. Meanwhile, the Red Cross says Israel's offensive has \"forced\" it to pause activities in Gaza City. DW has more."
    ],
    "image_url": "",
    "titles": [
      "Activists say Israel's navy has begun intercepting a Gaza-bound aid flotilla",
      "Israeli naval ships intercept Gaza-bound flotilla",
      "Israel begins to intercept Global Sumud Flotilla vessels",
      "Middle East: Israel intercepts Gaza aid flotilla"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.847,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli Navy intercepted the Global Sumud Flotilla, which was heading towards the Gaza coast. The flotilla had entered what it described as a \"high-risk zone.\" Following the interception, the Red Cross announced a pause in its activities in Gaza City due to Israel's offensive. This development was reported by activists on the flotilla and covered by DW.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Blocks Trump's Bid to Dismiss Fed's Cook Amid Fraud Claims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 16:33:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "LA Times",
      "Axios",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "www.ft.com",
      "www.latimes.com",
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "High court to hear arguments in January on whether Cook will lose her job but says she may stay in her post until then.",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTFA2cnJlZ3pzUFl1b3Z0MXdHbFJzN2o3UndHdEFwb0pUVmg3dTd5ZU5pSnYtVnRVSWtMRWh6VXFYbHN0VFh0SFgwV1VnT1MzLUwtaVpjYjk3cjVMcVVPNEZoOTRITWVBWkNsOXRn?oc=5\" target=\"_blank\">Supreme Court says Fed governor Cook can remain in job pending arguments</a>&nbsp;&",
      "President Donald Trump has sought to fire Federal Reserve Governor Lisa Cook, citing claims that she committed mortgage fraud in connection with two homes.",
      "Justices defer decision on president’s bid to sack central banker until January 2026",
      "<p>If Trump can oust Lisa Cook, he could have majority control of the Federal Reserve.</p>"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court temporarily blocks Fed Governor Cook firing",
      "Supreme Court says Fed governor Cook can remain in job pending arguments - Axios",
      "Supreme Court lets Fed Governor Lisa Cook keep job pending January oral argument",
      "Supreme Court blocks Trump from immediately firing Fed’s Lisa Cook",
      "Supreme Court puts off decision on whether Trump may fire Federal Reserve Governor Lisa Cook"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.785,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court has temporarily halted President Trump's attempt to dismiss Federal Reserve Governor Lisa Cook, amidst allegations of mortgage fraud. This decision preserves the central bank's independence for now and marks a significant moment as it's the first instance of a president attempting to fire a Fed official. Cook will maintain her position pending further court deliberations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oktoberfest Reopens After Closure Due to Bomb Threat Linked to Domestic Dispute",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-01T14:42:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "CityNews",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Explosions and a fire at a detached house in northern Munich triggered a large police response. The suspect was found injured and later died, but authorities found no link or threat to the Oktoberfest beer festival.",
      "<p>Beer festival had closed after 57-year-old man shot parents, set house on fire, and left note mentioning event</p><p>A German man went on a deadly gun, explosives and arson rampage against his family and then killed himself on Wednesday, prompting security fears in Munich that closed the world-fa",
      "Hours after a written threat, by a suspect who killed himself, authorities said the beer celebration would reopen after a search of the grounds found no explosives.",
      "The German authorities said the decision to close the festival grounds was taken after an earlier explosion in a residential area of the city that appeared linked to a domestic dispute.",
      "MUNICH (AP) — The Oktoberfest fairgrounds closed for several hours Wednesday as police conducted a security sweep of the famed beer festival due to a bomb threat by a suspect linked to an explosion across town in northern Munich. Police in Bavaria, the state where Munich is located, said the suspect"
    ],
    "image_url": "",
    "titles": [
      "Oktoberfest back on after Munich bomb scare",
      "Munich Oktoberfest reopens after man’s deadly arson attack and bomb threat",
      "Oktoberfest in Munich cleared to reopen after bomb threat",
      "Bomb Threat Delays Oktoberfest in Munich",
      "Police say Oktoberfest reopens after a security sweep due to a bomb threat"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.755,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Oktoberfest beer festival in Munich, Germany, was temporarily closed due to a bomb threat linked to an explosion and fire in a residential area, suspected to be connected to a domestic dispute. The threat came from a suspect who later committed suicide. After a thorough security sweep of the festival grounds revealed no explosives, authorities announced the event would reopen on Wednesday evening. The closure was a precautionary measure to ensure public safety.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Faces Government Shutdown Amid Failed Party Negotiations",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:25:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Bloomberg",
      "Axios"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "At some point, public pressure and political pain will see one side yield to bring this latest US government shutdown to an end.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxOQjIyY0NZSTlTM0RUaDFLbWFUUFRxMmRxdmt5a2V4bW5aNFIwRTZmeHo0dEo0MEhQeVZ5cWtDYThhM2tLdjVyYnFNemJKM29ha29Hczh0V0xlbjV3TFUwQ0xmY1hXSXR6R0NqZlpfSnNFM2dBcGRXd0NDclhYUThkbUNkZ3ViTkFVQ1Q3ZFBxcTk?oc=5\" target=\"_blank\">The seven Democratic senators wh",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPSmo1bGlBQjhwYmIwQnEtWHZhcmUycEJLUzU5TGpLaFpJQmN5WExKZWJzd2RuZi02VTI2M1VhQnlFNmV4OVdra0V2eVVUSkNKenFma2d4QzJfT0JGV0hlby1sYmtZRE1yU0NjYjVXRmpwckVEVHFQQkM1RlFub1pLOHdVMnVLV2o0Tl9RRk1Kb2s?oc=5\" target=\"_blank\">How the government shutdown coul",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE01UGNibVdPTktuZVRPNmt1OE1WbTNnUm5uVW5XR1NnVERQWWhUWnd6SldNVDJ4ajZsU2ZmbXp4Mmk3c0tfV29mMmhVaHJOVHpYMmlkUDFaR2Rrdld3RGlHTkhtWl9NXzNaMmlxS1RvUllrM1ZLT1Nr?oc=5\" target=\"_blank\">Democrats take the fight to Trump on government shutdown</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPc2FrNE5HdEtPQXE1VmkwSHJMWU5ySzFMLVZrclluZkFTd1FLX04tQlhWMlJlRWVBclpVeC04cHBONHR4NjJTZHJmYlA4T0duNWdfOE9ZMkZGc0wyV0IxNmxud01SOTJDcmc0V2cxazhiRDZTSlFpUDlyS2ZrMEdhVA?oc=5\" target=\"_blank\">House Democrat rages against his own party on the gov",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNc3FTdjJNd1ZmUGRNSnNldl9DNGhtem8tSHNrRnZjOGlEODdicEdBTFUxY0tGT0psUGl1X0w0V3gyMHVwTlVRbXA2MkpoWVMxWDdNOUxhb2liS0NMWDliT2Z5V0tRYkh3OFFSOWN1ZFhrNkJzRk5HVG11QUpULXRvRTVZOE1DUEhmaDRJX0Y1UkFWZ0JubkFpZjlVOA?oc=5\" target=\"_blank\">How the federal g",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNZWs1VTJ6cXZPcWNldWwzYWd1UkNPbmkxTWxnOHRGemZKZXh2YktHTENmS1d5c1R5RnZxWEt3a1BQU002X2poU3l2aV9EbWNEc1dUYUVfbzBuQ0RHSDhqYVpXNmxkQVM0VlF4V0otZXRZNFcxZzJ2V1hoaVN1RVFmZEFsbnU?oc=5\" target=\"_blank\">Federal government shutdown begins after Congres",
      "<p>After weeks of threats from both sides and negotiations that went nowhere, the US is once again experiencing a government shutdown. This week, Jonathan Freedland speaks to Marianna Sotomayor, a congressional reporter at the Washington Post, to look at who should take the blame, who suffers, and w",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOZEY2THVMcW5BREdYSml2YXp2dWlOamVnc0twN2NTVFJLNmlCN0tjelFEYjZBeEtfWnZWdW9BSzlZbEFPTl9IcUtIUUFZYUl1ZmlIQkZPNmpYUEZ1b0pVUEdydHVVYUp3Qkg3VWVxRDN1WDlhNkJPY29sUXNYOVAzdS15X1dPM0dheS05TEs4bVl0ZjRrMmcyaw?oc=5\" target=\"_blank\">Another US Government"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/843d/live/f62328b0-9ef9-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Four ways US government shutdown could end",
      "The seven Democratic senators whose votes could be key to ending the government shutdown - Axios",
      "How the government shutdown could disrupt daily life - Axios",
      "Democrats take the fight to Trump on government shutdown - Axios",
      "House Democrat rages against his own party on the government shutdown - Axios",
      "How the federal government shutdown will impact Arizona - Axios",
      "Federal government shutdown begins after Congress fails to act - Axios",
      "US government shutdown: now what? – podcast",
      "Another US Government Shutdown Is Here. Why It Keeps Happening - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.799,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US is experiencing another government shutdown after negotiations between parties failed. Public pressure and political dynamics suggest one side may eventually yield to end the deadlock. This shutdown is marked by the threat of mass layoffs, with potential \"reductions in force\" starting imminently. The situation remains unresolved, impacting various sectors and government functions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nashville SC Wins First U.S. Open Cup, Beats Austin FC 2-1",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 22:43:54 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Nashville SC beat Austin FC 2-1 in final of the U.S. Open Cup on Wednesday night at Q2 Stadium to win the team's first-ever major trophy.",
      "A narrow win on the road gave Nashville the title, their first as a club",
      "Sam Surridge converted the game-winning penalty in the 60th minute as Nashville SC beat Austin FC 2-1 in the US Open Cup final in Austin, Texas, on Wednesday.Victory in the US Open Cup, the knockout tournament that dates back to 1914 when it was founded as the National Challenge Cup, saw Nashville c"
    ],
    "image_url": "",
    "titles": [
      "Nashville lifts 1st major trophy with Open Cup win",
      "Nashville SC edge Austin FC to win first U.S. Open Cup in club history and Tennessee's first pro sports trophy",
      "Surridge penalty lifts Nashville over Austin for US Open Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nashville SC won their first major trophy by defeating Austin FC 2-1 in the U.S. Open Cup final on Wednesday night at Q2 Stadium. Sam Surridge scored the decisive goal with a penalty in the 60th minute, securing the victory for Nashville in the historic knockout tournament, which has been held since 1914.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nikola Jovic Signs $62.4M, 4-Year Extension with Miami Heat",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 01:20:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.sun-sentinel.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Miami's status in the weakened Eastern Conference is difficult to predict",
      "BOCA RATON, Fla. — One preseason waiting game is over for the Miami Heat, with an NBA source confirming to the Sun Sentinel that fourth-year forward Nikola Jovic has agreed to a four-year, $62.4 million extension. The contract, according to the source, is a straight four years, with no option clause",
      "<p>After a career-best junior season in the NBA, Nikola Jovic has earned himself a lucrative pay raise. The forward has reportedly agreed to a four-year, $62.4 million rookie-scale contract extension with the Miami Heat, ESPN&#8217;s Shams Charania reported on Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/a80e613a-fc94-4137-b9f6-4f1f989a2e36/100125-nikolajovic.jpg",
    "titles": [
      "Heat, Nikola Jović reportedly agree to four-year contract extension with franchise sitting at crossroads",
      "Nikola Jovic agrees to four-year, $62.4 million extension with Heat",
      "Report: Heat sign Nikola Jovic to four-year, $62.4M extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nikola Jovic has signed a four-year, $62.4 million extension with the Miami Heat, following a standout junior season. The contract is confirmed to be a straight deal with no option clause. This development comes as the Miami Heat prepares for the upcoming season in the Eastern Conference.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 23:21:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Global Sumud Flotilla had been pressing forward with its mission to break Israel&#039;s siege of Gaza.",
      "Organizers said 13 boats have been intercepted as the convoy presses on toward the Palestinian enclave to try to break the Israeli blockade and deliver aid.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war."
    ],
    "image_url": "",
    "titles": [
      "Israel intercepts Gaza Sumud flotilla vessels: What we know so far",
      "Israel intercepts Gaza aid flotilla, activist Greta Thunberg detained",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.904,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eric Dier's Late Penalty Secures 2-2 Draw for Monaco Against Man City",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 21:19:07 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Former Tottenham Hotspur defender Eric Dier wins a dramatic late penalty before converting to seal a 2-2 draw for Monaco against Manchester City in the Champions League.",
      "<p>It had been a subdued night in Monaco, with Manchester City sleepwalking to victory until Nico González kicked Eric Dier in the face in a failed attempt to defend a free-kick. Chaos ensued with a melee as City lost their cool and the chance of a perfect Champions League start, before Dier calmly ",
      "Manchester City's awayday blues haunted them again as Monaco snatched a late 2-2 draw in their Champions League league phase clash through Eric Dier's controversial late penalty."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f77f/live/936f2a60-9f0e-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Late Dier penalty helps Monaco snatch draw against Man City",
      "Late Dier penalty for Monaco pegs back Manchester City after Haaland double",
      "Wasteful Man City held by Monaco after controversial late penalty"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.848,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Eric Dier, a former Tottenham Hotspur defender, secured a 2-2 draw for Monaco against Manchester City in the Champions League by winning and converting a dramatic late penalty. The match turned chaotic after Nico González's failed attempt to clear a free-kick resulted in him kicking Dier in the face, leading to a melee. This incident prevented Manchester City from achieving a perfect start in the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arsenal Beats Olympiakos 2-0, Maintains Perfect Season Start",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 21:15:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Goals from Gabriel Martinelli and Bukayo Saka help Arsenal continue their perfect start to the Champions League season as the Gunners secure a 2-0 victory against Olympiakos.",
      "<p>They like to talk about invincibility in this part of north London and it remains the only way to describe Mikel Arteta’s record with Arsenal in European group‑phase games at the Emirates Stadium. It is now eight wins out of eight in the Champions League with zero goals conceded. And if you add i",
      "Arsenal made it two wins out of two in the Champions League as Bukayo Saka&#8217;s stoppage-time goal sealed a 2-0 victory over Olympiakos at the Emirates Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8b42/live/806e3180-9f0a-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Martinelli and Saka lead Arsenal to victory against Olympiacos",
      "Martinelli and Saka on the money as Arsenal sweep Olympiakos aside",
      "Odegaard shines as Saka strike seals 'dynamic' Arsenal win over Olympiakos"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.848,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Arsenal secured a 2-0 win against Olympiakos in the Champions League, with goals from Gabriel Martinelli and Bukayo Saka. This victory maintains Arsenal's perfect start to the season, making it two wins from two games. It also continues Mikel Arteta's flawless record in European group-phase games at the Emirates Stadium, with eight wins and no goals conceded.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three Arrested in Berlin for Alleged Plot Against Jewish Targets",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:19:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The men are suspected of of being &#039;foreign operatives&#039; for Hamas and will appear in court Thursday, prosecutors say.",
      "Authorities said two Germans and one Lebanese national had procured weapons to be used in violent acts targeting Israeli or Jewish institutions in Germany.",
      "Police seized weapons and ammunition while arresting the three men in Berlin, Germany’s federal prosecutor’s office said."
    ],
    "image_url": "",
    "titles": [
      "Germany arrests three men suspected of targeting Jewish institutions",
      "Germany arrests 3 suspected Hamas members",
      "Germany arrests three suspected Hamas members in plot to attack Jews"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.814,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two Germans and one Lebanese national, suspected of being Hamas operatives, were arrested in Berlin for planning violent acts against Israeli or Jewish institutions in Germany. Authorities seized an AK-47, pistols, and ammunition. They are set to appear in court Thursday, according to prosecutors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canucks Dominate Flames 8-1 in NHL Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 04:00:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Quinn Hughes had a goal and two assists, Max Sasson scored twice and the Vancouver Canucks rolled past the Calgary Flames 8-1 on Wednesday in NHL pre-season action.",
      "<p>The Calgary Flames host the Vancouver Canucks in a pre-season clash on Wednesday. Live coverage on Sportsnet and Sportsnet+ begins at 9 p.m. ET / 6 p.m. PT, or follow along with our live tracker.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f84df23f094608626a4b31a281dbf2df8a194695c62e016a23b580ad66a4a292.jpg?quality=65&strip=all",
    "titles": [
      "Canucks thump Flames 8-1 in pre-season action",
      "NHL Pre-season on Sportsnet: Canucks vs. Flames"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In an NHL pre-season game on Wednesday, the Vancouver Canucks decisively defeated the Calgary Flames 8-1. Quinn Hughes contributed significantly with a goal and two assists, while Max Sasson scored twice for the Canucks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pope Leo XIV Criticizes Climate Change Skeptics, Echoes Francis's Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 16:58:20 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "In his first major statement on climate change, the pontiff criticises those who minimise climate change.",
      "The pope invoked his predecessor, Francis, for whom the environment was a core issue, but stopped short of criticizing world leaders dismissive of climate change.",
      "<p>Pontiff laments that some ‘ridicule those who speak of global warming’, days after Trump’s claims of ‘con job’</p><p>Pope Leo XIV has taken aim at people who “ridicule those who speak of global warming” as he embraced Pope Francis’s environmental legacy and made it his own in some of his stronges"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/db01/live/edb94e60-9ee1-11f0-98b1-59d49dad95e6.jpg",
    "titles": [
      "Pope Leo condemns climate change critics",
      "Pope Leo Calls for Unity on Climate at a Divided Moment",
      "‘Listen to the cry of the Earth’: Pope Leo takes aim at climate change sceptics"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.775,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Pope Leo XIV criticized individuals who minimize or ridicule the issue of climate change, aligning with his predecessor Pope Francis's emphasis on environmental concerns. This statement came shortly after President Trump dismissed global warming as a \"con job.\" The Pope did not directly criticize world leaders but expressed concern over the dismissal of climate change discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "6.9 Earthquake in Philippines Kills 60, Injures 140 in Cebu and Bogo",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 15:42:47 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>More than 700 aftershocks recorded while rescuers search for casualties in coastal city of Bogo</p><p>Rescuers in the Philippines combed through rubble and mud after the deadliest earthquake in more than a decade killed at least 69 people, with patients overwhelming hospitals on the island of Ceb",
      "A 6.9-magnitude earthquake struck the central Philippines, damaging numerous businesses and leaving towns without power. Casualty numbers are expected to rise.",
      "The 6.9-magnitude earthquake shook the province of Cebu, killing at least 69 people and injuring more than 150. Heavy rainfall has hampered rescue efforts."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9c1cba601e3a57b1545419a6bd406cb035ce4e0f/408_0_2500_2000/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=fd5e030becb8499f9a24ab32e6e9e223",
    "titles": [
      "Philippines earthquake death toll rises to at least 69 as Cebu hospitals struggle",
      "Powerful earthquake in central Philippines kills at least 69",
      "Earthquake in Philippines Kills Dozens, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.755,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.9 earthquake hit central Philippines, affecting the province of Cebu and the coastal city of Bogo, resulting in at least 60 deaths and over 140 injuries, according to a civil defence official. The quake caused widespread power outages, building and road damage, and hampered rescue operations due to heavy rainfall. Rescuers continue to search for survivors amidst the debris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seven Men Sentenced in Rochdale Child Abuse Case",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 12:52:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Two girls were repeatedly raped and assaulted from the age of 13 in the Greater Manchester town.",
      "Seven men in all were sentenced on Wednesday over their roles in a decades-old national scandal in Britain involving child sexual abuse.",
      "<p>Six other men sentenced to terms of up to 29 years after two girls treated as ‘sex slaves’ from the age of 13 </p><p>Seven men who groomed two vulnerable teenage girls in Rochdale and treated them as “sex slaves” have been jailed for between 12 and 35 years.</p><p>The ringleader, Mohammed Zahid, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2076/live/e2ba9430-9ed0-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Rochdale grooming gang ringleader jailed for 35 years",
      "U.K. ‘Grooming Gang’ Leader Sentenced to 35 Years for Rape",
      "Ringleader of Rochdale grooming gang jailed for 35 years for rape and abuse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.712,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Seven men were sentenced for grooming and sexually abusing two teenage girls in Rochdale, Greater Manchester, starting when the victims were 13. The sentences ranged from 12 to 35 years, with Mohammed Zahid identified as the ringleader. This case is part of a larger national scandal in Britain concerning child sexual abuse.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xavien Howard, 32, Retires from NFL Days After Criticized Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 22:43:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Veteran cornerback Xavien Howard, 32, informed the Colts of his decision to retire just days after his much-criticized performance against the Rams.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxQMmlxd1huLUhKWHZQT2xaMTRXMHEyWE10a0htN1pXS3JjcHJpSkduX2VPelFncnhpMjR6b3h4THJHRmVwVnFkM0FGdjBRR1lLSjFmbGRQNzdxc21VN2hmeTU2c0FSUUszUmtJV1cwQlEzeEFnTFJPX2tJNXgxWEdSbzhmcUtQUzQwcGNGNFdZaGZXSE85dXhCcUp2RUFyRTQ?oc=5\" target=\"_blank\">Colts CB Xav"
    ],
    "image_url": "",
    "titles": [
      "Colts' Howard abruptly retires, says 'family first'",
      "Colts CB Xavien Howard Abruptly Retires After Rough Game vs. Puka Nacua, Rams - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Veteran cornerback Xavien Howard, aged 32, has announced his retirement from professional football, just days following a criticized performance against the Rams. This decision was communicated to his team, the Colts, marking the end of his career in the NFL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas, Phoenix Vie for 2025 WNBA Title Starting Friday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 19:16:19 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Las Vegas hosts Phoenix on Friday to open the WNBA Finals. The team whose big three plays the best will win the title.",
      "It's Las Vegas vs. Phoenix for the 2025 title"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals first look: How the Aces and Mercury match up",
      "2025 WNBA Finals: Aces vs. Mercury schedule, prediction, players to watch"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.66,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Las Vegas and Phoenix are set to compete in the WNBA Finals starting Friday, with the 2025 title at stake. The outcome will likely hinge on which team's top three players perform best.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Force Game 3 Against Red Sox; Chisholm Proves Point with Key Performance",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 02:09:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "A win against the Red Sox Wednesday night forced a do-or-die Game 3",
      "Jazz Chisholm didn't start the Yankees' opener vs. the Red Sox but played hero in Game 2.",
      "Jazz Chisholm Jr. believed he should have been in the Yankees' lineup in Game 1, and he reminded Aaron Boone why in Game 2."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/02/1b3c9dcc-03e5-48ae-8de3-fcd123571de5/jazz-getty.png",
    "titles": [
      "Jazz Chisholm Jr., Ben Rice help Yankees stave off MLB playoff elimination in Game 2 after sitting Game 1",
      "Jazz Chisholm crushed someone in 'MLB The Show' after Yankees' bitter Game 1 loss",
      "How Jazz Chisholm Jr. backed up Game 1 comments with heroics in Yankees' playoff win over Red Sox"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.958,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Yankees forced a decisive Game 3 against the Red Sox after winning Wednesday night. Jazz Chisholm Jr., who did not start in the opener, played a crucial role in Game 2's victory. Chisholm's performance underscored his belief that he should have been in the lineup for Game 1, proving his point to manager Aaron Boone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Cuts Funding to Dem States Amid Shutdown",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-02T01:31:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Forbes"
    ],
    "domains": [
      "www.dw.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The Trump administration has begun targeting funding projects in Democratic states. And Vice President JD Vance warned that the government might sack federal workers if the shutdown lasts more than a few days.",
      "The government shut down began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "US shutdown: White House freezes funds for Democratic states",
      "Government Shutdown Begins: White House Guts Funding For Democratic-Favored Projects"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration has started cutting funding for projects in Democratic states amid a government shutdown that began at midnight on Wednesday. With Democrats and Republicans unable to agree on a funding deal, Vice President JD Vance warned of potential layoffs of federal workers if the shutdown extends beyond a few days.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Criticized for Bad Bunny Super Bowl Choice, Trump Official Suggests ICE Pres",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 02:48:45 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE95NUtINmxkUlliMzFCZTV6QV8zSkdyRDV3WllfOEdOWFdIUnlpeGRkVW93U25sYWl6VDZDRGQwZ0RZdkNGd3l6ZUs0RjhnaV93Z3NVc3NTMHAzemVFekRvN1Z5cUNKQmFPYXJnZ0Z2RkhCNXM?oc=5\" target=\"_blank\">Bad Bunny could see ICE at Super Bowl show, Trump official suggests</a>&",
      "The NFL received right-wing backlash from its decision to have Bad Bunny headline its Super Bowl halftime show."
    ],
    "image_url": "",
    "titles": [
      "Bad Bunny could see ICE at Super Bowl show, Trump official suggests - Axios",
      "ICE Will Be On Patrol At Bad Bunny’s ‘Shameful’ Super Bowl Halftime Show, Trump Adviser Says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL faced criticism for choosing Bad Bunny to headline the Super Bowl halftime show. A Trump official suggested ICE could be present at the event. The outcome of this situation is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Intercept Flotilla, Arrest Thunberg; Gaza Exodus Intensifies",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 23:07:36 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "As Israel cut off northern Gaza, the Global Sumud Flotilla was intercepted by Israeli forces, who arrested the activist Greta Thunberg aboard one of the vessels.",
      "Hundreds of thousands of Palestinians have fled Israel’s assault on Gaza City, but many are believed to remain, having nowhere to go or no means to leave."
    ],
    "image_url": "",
    "titles": [
      "Israel steps up Gaza City assault as Hamas weighs Trump peace deal",
      "Israel Escalates Gaza Offensive as Hamas Mulls Trump Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli forces intercepted the Global Sumud Flotilla, arresting activist Greta Thunberg among others, as they attempted to reach northern Gaza. Concurrently, Israel's military actions in Gaza City prompted hundreds of thousands of Palestinians to flee, though many remain trapped due to lack of resources or escape routes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Payments Unaffected by Shutdown; Neptune Insurance Goes Public",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 23:13:48 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxNbG1aZHpQTUl3QmNnUmE0REVPMVRBMXNLNXlCSFBORGxDdjR1aDI1MnJUem44bTF1Nko1M1UxeUxVeVJULUh1cmkxWGx6WVRqVmx3eG9SMk81d0d5Mks1b0gwc2pkMnVFQ0hYMDlXby1yMHBuTDIxTkRWdkNIaXNrRXdxTnZPSG9feDBmTVBjSno0THM0SjFSaUtmQ0hEa1dE?oc=5\" target=\"_blank\">What the sh",
      "Social Security benefit payments will still go out on time, according to the agency. But certain services may not be available.",
      "Neptune Insurance, the nation's largest private flood insurance, goes public on the New York Stock Exchange Wednesday."
    ],
    "image_url": "",
    "titles": [
      "What the shutdown means for Washington state - Axios",
      "What the government shutdown means for Social Security benefits",
      "Government shutdown means opportune timing for Neptune Flood IPO"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.883,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Social Security payments will continue as scheduled despite the government shutdown, which may cause travel delays, park closures, and disruptions in Social Security customer services. Neptune Insurance, the largest private flood insurer in the U.S., went public on the New York Stock Exchange.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jane Goodall, Celebrated Primatologist, Dies at 91",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-01T21:27:51Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Jane Goodall's powers of observation revealed facts scholars had overlooked for years. She died at 91 on October 1.",
      "British primatologist Jane Goodall, who transformed the study of chimpanzees and became one of the world's most prominent wildlife advocates, has died at the age of 91, her institute announced Wednesday."
    ],
    "image_url": "https://i.insider.com/67589aa6dc8b666017f25e33?format=jpeg",
    "titles": [
      "Jane Goodall, chimpanzee researcher and conservationist, is dead at 91",
      "Renowned British chimpanzee expert Jane Goodall dies at 91"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.869,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Renowned British primatologist and conservationist Jane Goodall, celebrated for her groundbreaking research on chimpanzees and advocacy for wildlife, passed away at the age of 91 on October 1, as announced by her institute.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Acquires 10% Stake in Major Lithium Mine Projects",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:23:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Verge",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Vancouver-based Lithium Americas is developing one of world&#039;s largest lithium mines in northern Nevada.",
      "Donald Trump’s administration is taking a 5 percent equity ownership of mining company Lithium Americas, on top of another 5 percent stake in the company’s joint mining project with GM in Nevada, the Department of Energy announced yesterday. The mine at Thacker Pass is expected to become the largest"
    ],
    "image_url": "",
    "titles": [
      "US takes a stake in another firm, this time a large lithium mine",
      "US government takes equity stake in one of the world’s largest lithium mines"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. Department of Energy, under Donald Trump's administration, acquired a 5% equity stake in Lithium Americas, a Vancouver-based company developing one of the world's largest lithium mines in northern Nevada. Additionally, the government secured another 5% stake in the company's joint venture with GM at the same location, Thacker Pass, which is anticipated to become the largest lithium mine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Central Bankers, Led by Powell, Favor Caution in Monetary Policies",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 18:07:09 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Chair Jerome Powell and his fellow central bankers likely will err on the side of caution, which would be a bias towards easing.",
      "It’s a bad time for the data to disappear."
    ],
    "image_url": "",
    "titles": [
      "The government shutdown is likely to cement additional Fed interest rate cuts",
      "Government shutdown means Fed lacks crucial data as it considers rate cuts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.794,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Federal Reserve Chair Jerome Powell and other central bankers are inclined to prioritize caution, suggesting a tendency towards easing monetary policies. This approach comes at a challenging time when data availability is limited.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Orders Apple for iCloud Access Again Amid Privacy Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 14:26:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "It is the latest development in a privacy row which has pitted the UK against the tech giant and the Trump administration.",
      "Order issued in September comes after Trump administration said London had backed down in fight over encryption"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c43/live/45f4f830-9eca-11f0-8281-d137a399b095.jpg",
    "titles": [
      "Government issues new data demand for UK Apple users",
      "UK makes new attempt to access Apple cloud data"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.735,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.K. Home Office has issued a second order for access to Apple users' encrypted iCloud backups, following a failed attempt earlier this year. This action is part of an ongoing privacy dispute involving the UK, the tech giant, and the Trump administration. The controversy escalated after the Trump administration claimed that London had conceded in a battle over encryption.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LUX-ZEPLIN Detector Advances Dark Matter Search, Sets New WIMP Limits",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 03:21:00 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "The LUX-ZEPLIN detector is breaking new ground in the hunt for dark matter, setting unprecedented limits on WIMP particles. Its results not only narrow the possibilities for dark matter but also open exciting paths toward other rare physics discoveries.",
      "<a href=\"https://scitechdaily.com/scientists-find-cosmic-fingerprints-of-mysterious-dark-matter/\" rel=\"nofollow\" title=\"Scientists Find Cosmic “Fingerprints” of Mysterious Dark Matter\"><img alt=\"Galaxy Dark Matter Halo Art Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\""
    ],
    "image_url": "",
    "titles": [
      "Scientists may be closing in on dark matter’s true identity",
      "Scientists Find Cosmic “Fingerprints” of Mysterious Dark Matter"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.648,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The LUX-ZEPLIN detector has achieved significant progress in the search for dark matter by establishing new limits on WIMP particles. This advancement not only refines the search for dark matter but also enhances the potential for discovering other rare physics phenomena.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Rover Finds Signs of Ancient Lake, Possible Microbial Activity on Mars",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 00:54:17 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Perseverance rover data shows Jezero Crater once held a calm lake, leaving behind mudstones rich in organic-linked minerals. The presence of iron-phosphate and iron-sulfide nodules suggests processes resembling microbial activity on Earth. Scientists caution that only Earth-based labs can confirm th",
      "<a href=\"https://scitechdaily.com/scientists-just-found-the-oldest-dome-head-dinosaur-ever/\" rel=\"nofollow\" title=\"Scientists Just Found the Oldest Dome-Head Dinosaur Ever\"><img alt=\"Pachycephalosaurs Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"474\" src=\"https://scitechdaily.c"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found the strongest signs of life on Mars yet",
      "Scientists Just Found the Oldest Dome-Head Dinosaur Ever"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.615,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.578,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA's Perseverance rover has discovered that Jezero Crater on Mars once contained a calm lake, evidenced by mudstones rich in organic-linked minerals. The detection of iron-phosphate and iron-sulfide nodules within these rocks suggests processes that could be similar to microbial activity found on Earth. However, scientists emphasize that definitive confirmation of microbial life requires analysis in Earth-based laboratories.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Mandates AI Safety Transparency, First State to Do So",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 20:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "“Are bills like SB 53 the thing that will stop us from beating China? No,” said Adam Billen, vice president of public policy at youth-led advocacy group Encode AI. “I think it is just genuinely intellectually dishonest to say that that is the thing that will stop us in the race.”",
      "California just made history as the first state to require AI safety transparency from the biggest labs in the industry. Governor Newsom signed SB 53 into law this week, mandating that AI giants like OpenAI and Anthropic disclose, and stick to, their safety protocols. The decision is already sparkin"
    ],
    "image_url": "",
    "titles": [
      "California’s new AI safety law shows regulation and innovation don’t have to clash",
      "Why California’s new AI safety law succeeded where SB 1047 failed"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.843,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.444,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California has become the first state to mandate AI safety transparency from major labs, with Governor Newsom signing SB 53 into law. This requires companies like OpenAI and Anthropic to disclose their safety protocols. Adam Billen from Encode AI commented that attributing the slowing of U.S. competitiveness with China to such laws is \"intellectually dishonest.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]