[
  {
    "title": "The truth about life on other planets - and what it means for humans",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 00:11:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Could discoveries of alien life ever change the human psyche in how we view ourselves and each other?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/468f/live/8b7c5530-1b6a-11f0-a455-cf1d5f751d2f.png",
    "titles": [
      "The truth about life on other planets - and what it means for humans"
    ],
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story provides empowering knowledge about potential extraterrestrial life and its implications for humans, contributing to a deeper understanding of our universe.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.791,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.50775,
    "normalized_score": 10.0,
    "summary": "The question of whether discoveries of alien life could alter the human psyche and our perspectives on ourselves and each other remains speculative. It touches on profound implications for humanity's self-understanding and relationships, suggesting potential shifts in societal, philosophical, and possibly religious views. However, without concrete discoveries of extraterrestrial life, the exact nature and extent of these changes are currently theoretical and subject to debate among scientists, philosophers, and theologians."
  },
  {
    "title": "Hamas accuses Israel of weaponising aid as Gaza’s hunger crisis worsens",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 10:26:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel&#039;s defence minister admits blockade is a &#039;pressure lever&#039; against Hamas and there are no plans to ease it."
    ],
    "image_url": "",
    "titles": [
      "Hamas accuses Israel of weaponising aid as Gaza’s hunger crisis worsens"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.933,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48525000000000007,
    "normalized_score": 9.1,
    "summary": "Israel's Defense Minister acknowledged that the blockade on Gaza serves as a 'pressure lever' against Hamas, indicating that there are currently no intentions to relax the restrictions. This statement confirms the strategic use of the blockade in Israel's approach to dealing with Hamas."
  },
  {
    "title": "Child among three killed in Russia’s attack on Ukraine before Paris talks",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 08:39:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deadly air attack on the city of Dnipro comes hours before Ukrainian officials meet US and European officials in Paris."
    ],
    "image_url": "",
    "titles": [
      "Child among three killed in Russia’s attack on Ukraine before Paris talks"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.908,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.479,
    "normalized_score": 8.85,
    "summary": "A deadly air attack targeted the city of Dnipro shortly before Ukrainian officials were scheduled to meet with US and European representatives in Paris. The timing of the attack underscores ongoing tensions and conflicts in the region, though the outcome of the meeting in Paris following the attack was not detailed in the provided information."
  },
  {
    "title": "Dozens killed in Israeli attacks on Gaza’s tent camps for displaced people",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 09:45:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israeli attacks target displaced people in and around southern Gaza&#039;s al-Mawasi, as well as in Beit Lahiya in the north."
    ],
    "image_url": "",
    "titles": [
      "Dozens killed in Israeli attacks on Gaza’s tent camps for displaced people"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.924,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.477,
    "normalized_score": 8.77,
    "summary": "Israeli forces conducted attacks in southern Gaza, specifically targeting the al-Mawasi area, and extended their operations to Beit Lahiya in the north. These attacks were directed at locations where displaced people were reported to be situated."
  },
  {
    "title": "Trump’s claims about tariffs and trade with China",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 12:00:02 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "@khalidmajzoubofficial reviews claims the White House has made about China and its new tariffs"
    ],
    "image_url": "",
    "titles": [
      "Trump’s claims about tariffs and trade with China"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.28,
      "recency": 0.955,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47275,
    "normalized_score": 8.6,
    "summary": "Khalid Majzoub, through his official platform, scrutinized the claims made by the White House regarding China's imposition of new tariffs. The review aimed to assess the accuracy and implications of the White House's statements on this matter. The outcome or specific conclusions of Majzoub's review were not disclosed in the provided content."
  },
  {
    "title": "Tour of Britain Women route unveiled with Glasgow circuit to host final stage",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 15:05:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lotte Kopecky may be in action to defend her title ahead of a tilt at the Tour de France Femmes"
    ],
    "image_url": "",
    "titles": [
      "Tour of Britain Women route unveiled with Glasgow circuit to host final stage"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35525000000000007,
    "normalized_score": 3.89,
    "summary": "Lotte Kopecky is set to defend her title in an upcoming competition, with plans to also compete in the Tour de France Femmes. This move indicates her active participation in major cycling events and showcases her ambition to excel in the sport."
  },
  {
    "title": "Jayson Tatum and Paolo Banchero to headline Celtics playoff series against Orlando",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 15:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jayson Tatum and Paolo Banchero will be the marquee matchup throughout the Boston Celtics opening round series against the Orlando Magic"
    ],
    "image_url": "",
    "titles": [
      "Jayson Tatum and Paolo Banchero to headline Celtics playoff series against Orlando"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "Jayson Tatum of the Boston Celtics and Paolo Banchero of the Orlando Magic are set to be the highlight players in their teams' opening round series of the NBA playoffs. This matchup is anticipated to draw significant attention as both players are key figures for their respective teams."
  },
  {
    "title": "Florida basketball adds star Princeton guard Xaivian Lee via the NCAA transfer portal",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:59:47 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Florida Gators added one of the best guards in the NCAA transfer portal on Wednesday with former Princeton standout Xaivian Lee."
    ],
    "image_url": "",
    "titles": [
      "Florida basketball adds star Princeton guard Xaivian Lee via the NCAA transfer portal"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "On Wednesday, the Florida Gators enhanced their basketball team by acquiring Xaivian Lee, a highly regarded guard from Princeton, through the NCAA transfer portal."
  },
  {
    "title": "Which Indiana Fever, Caitlin Fever games will Indianapolis fans be able to watch on TV?",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:59:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Indiana Fever and WTHR announced a multi-year extension of its distribution agreement that will air 18 games in central Indiana."
    ],
    "image_url": "",
    "titles": [
      "Which Indiana Fever, Caitlin Fever games will Indianapolis fans be able to watch on TV?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "The Indiana Fever and WTHR have renewed their distribution agreement for multiple years, ensuring that 18 of the team's games will be broadcast in central Indiana. This extension continues the partnership between the Fever and WTHR, allowing fans in the region access to a significant portion of the team's games."
  },
  {
    "title": "RBC Heritage 2025: First-round tee times, pairings at Harbour Town",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:51:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tee times and pairings for the first round of the PGA Tour's RBC Heritage."
    ],
    "image_url": "",
    "titles": [
      "RBC Heritage 2025: First-round tee times, pairings at Harbour Town"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 3.86,
    "summary": "The PGA Tour has announced the tee times and pairings for the first round of the RBC Heritage. This information is crucial for fans and players alike to know when and with whom the golfers will start the tournament. The specific details of the pairings and the schedule have been made public, setting the stage for the commencement of the event."
  },
  {
    "title": "Trump Calls For Fed Chair Powell's 'Termination' Over His Reluctance To Cut Rates",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:05:41 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Getty Images\" src=\"https://www.investopedia.com/thmb/yktD1KkPpOZrIal6_YLnU4oc0eg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208513468-f65012f431ed44269eefbfce595f1b14.jpg\" title=\"Federal Reserve Chairman Jerome Powell departs after speaking during a Society for Advancing Business Editing and Writing (SABEW) Annual Conference on April 04, 2025 in Arlington, Virginia. \" /><figcaption><i><p>Anna Moneymaker / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>President Donald Trump said Thursday that Federal Reserve Chair Jerome Powell should be \"terminated,\" renewing his attacks on the central bank's independence.<br /></li><li>Trump's threats came after Powell suggested the Federal Reserve was worried about inflation, implying the Fed is in no hurry to cut interest rates, as Trump has long demanded.<br /></li><li>Powell has said he would not resign from his post if Trump asked, and the Supreme Court could ultimately decide whether the president has the authority to fire the Fed chair.<br /></li></ul><br /><br /><p>President Donald Trump renewed his talk of firing Federal Reserve Chair Jerome Powell Thursday after the central banker signaled he was in no hurry to lower borrowing costs, as Trump has long demanded.<br /><br />Trump attacked Powell in a social media post following Powell’s comments Wednesday that Trump's spate of larger-than-expected tariffs could <a href=\"https://www.investopedia.com/federal-reserve-chair-jerome-powell-emphasizes-inflation-risks-of-trump-tariffs-trade-war-11716687\">pose a \"challenging\" scenario</a> for the Fed by slowing down the economy while pushing up prices.<span class=\"ql-inline-citation\"></span> Powell said officials at the central bank expect <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">the import taxes Trump imposed</a> this month to push up prices and are determined not to let that bout of price increases turn into a prolonged period of inflation.<br /><br />\"Powell’s termination cannot come fast enough!\" Trump wrote in a post on Truth Social.<br /><br />Trump's call for \"termination\" escalated his long-running attacks on Powell and his <a href=\"https://www.investopedia.com/what-would-happen-if-the-fed-answered-to-the-president-8644170\">attempts to exert more influence</a> over the Federal Reserve, which is outside the White House's direct control.</p><p>Trump has long pressured Powell and the Fed to lower the central bank's benchmark interest rate, which influences borrowing costs on all kinds of loans. The Fed has held the rate higher than usual since 2022, when it raised rates to slow the economy and counteract surging inflation.</p><p>The Fed is a unique government institution that was <a href=\"https://www.investopedia.com/powell-defends-fed-independence-8756337\">set up to be independent</a> so that it can make <a href=\"https://www.investopedia.com/monetary-policy-4689792\">monetary policy</a> decisions based on economic strategy rather than political considerations.<br /><br />Trump has tested that independence by threatening to remove Powell before his term ends in May 2026. Trump appointed Powell to his current post in 2018, and former President Joe Biden gave Powell another four-year term in 2022. In both his terms in office, Trump has frequently criticized Powell and pushed him to lower interest rates. Lower rates could boost the economy and potentially benefit Trump politically, at the risk of stoking inflation in the long run.<br /></p><h2>Powell's Not Stepping Down Willingly</h2><p>However, any move to fire Powell would be a reversal for Trump, who said in December that <a href=\"https://www.investopedia.com/trump-said-he-won-t-replace-fed-chair-powell-but-that-likely-won-t-avert-conflict-8758143\">he had no plans to have the Fed chair removed</a>. It would also set up a legal clash: Powell has said he would <a href=\"https://www.investopedia.com/federal-reserve-fomc-meeting-november-2024-interest-rates-8741570\">not resign from his post</a> if Trump asked, and that it's illegal for the president to fire the Fed chair.<br /><br />That question could ultimately be decided by the Supreme Court, which, according to a <em>Wall Street Journal</em> report Wednesday, is taking up a case considering whether the president has the authority to fire the heads of government agencies previously considered independent of White House control.<br /><br />\"I don't think that that decision will apply to the Fed, but I don't know,\" Powell said of the case Wednesday.<span class=\"ql-inline-citation\"></span> \"But it's a situation that we're monitoring carefully.\"</p><p>The dispute takes place at a pivotal time for the central bank's dual mission to keep interest rates high enough to keep inflation down but not so high that they stifle the job market. This task could become complicated or impossible if Trump's tariffs cause \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/s/stagflation.asp\">stagflation</a>\" to set in.<br /><br />Trump said Powell was “TOO LATE AND WRONG,\" digging at the central bank's track record on managing inflation. Trump and other critics, even Powell himself, have said that in hindsight, the Fed was too slow to raise interest rates in 2022 after inflation began to surge as the economy reopened from the pandemic.<span class=\"ql-inline-citation\"></span><br /><br />Trump cited recent economic data to argue that now is the time for the Fed to cut rates. Inflation <a href=\"https://www.investopedia.com/inflation-unexpectedly-fell-in-march-amid-tariff-turmoil-11712611\">retreated unexpectedly</a> in March due to dropping oil and gas prices. Cooling inflation would normally prompt the Fed to lower interest rates, but Fed officials expect Trump's wave of import taxes to raise prices and potentially set off a fresh round of high inflation.<br /><br />Trump also cited the European Central Bank's recent string of interest rate cuts, suggesting the Fed is out of step with its European counterpart.<span class=\"ql-inline-citation\"></span><br /></p><p>“Oil prices are down, groceries (even eggs!) are down [sic], and the USA is getting RICH ON TARIFFS,” Trump wrote in the post. “Too Late should have lowered Interest Rates, like the ECB, long ago, but he should certainly lower them now.\"<br /><br />Consumer prices for groceries, including for eggs, actually rose in March according to data from the Bureau of Labor Statistics.<span class=\"ql-inline-citation\"></span><span class=\"ql-inline-citation\"></span> <a href=\"https://www.investopedia.com/falling-wholesale-prices-could-mean-cheaper-eggs-are-coming-11713545\">Wholesale prices for eggs fell</a>, suggesting prices on store shelves could follow suit.<span class=\"ql-inline-citation\"></span><br /></p><p><em>Senior Editor Nisha Gopalan contributed to this story.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/yktD1KkPpOZrIal6_YLnU4oc0eg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208513468-f65012f431ed44269eefbfce595f1b14.jpg",
    "titles": [
      "Trump Calls For Fed Chair Powell's 'Termination' Over His Reluctance To Cut Rates"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46799999999999997,
    "normalized_score": 8.41,
    "summary": "President Donald Trump has intensified his criticism of Federal Reserve Chair Jerome Powell, suggesting Powell should be \"terminated\" for not lowering interest rates as Trump desires. This follows Powell's remarks indicating the Federal Reserve's concern over inflation and reluctance to cut rates, despite Trump's demands. Powell, appointed by Trump in 2018 and reappointed by Biden in 2022, has stated he will not resign if asked and highlighted the Fed's independence from political influence. The legality of firing Powell could be decided by the Supreme Court, amidst debates over the president'"
  },
  {
    "title": "ECB cuts rates to 2.25% amid Trump trade war",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:06:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Growth and inflation set to slow as central bankers prepare for tariff impact"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1f5a06e7-9620-4ceb-bedc-2a3ee9e13d62.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "ECB cuts rates to 2.25% amid Trump trade war"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46199999999999997,
    "normalized_score": 8.17,
    "summary": "Central bankers are anticipating a slowdown in both growth and inflation due to the expected impact of tariffs. This preparation suggests adjustments in monetary policy may be on the horizon to mitigate the economic effects of these trade barriers."
  },
  {
    "title": "IMF chief cuts growth forecast over ‘off the charts’ trade uncertainty",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:01:54 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kristalina Georgieva warns that Donald Trump’s tariff ‘reboot’ threatens to raise prices and play havoc with markets"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fced1de9b-08b4-41a2-a82e-1c1e799ddb64.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "IMF chief cuts growth forecast over ‘off the charts’ trade uncertainty"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46175,
    "normalized_score": 8.16,
    "summary": "Kristalina Georgieva, the IMF Managing Director, has expressed concerns that Donald Trump's plan to reintroduce tariffs could lead to higher prices and disrupt market stability. This warning highlights the potential economic impacts of the proposed tariff policy changes."
  },
  {
    "title": "Trump says Fed chair’s ‘termination cannot come fast enough’",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 10:59:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Attack follows pressure from US president for central bank to cut interest rates"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F70405974-1de3-4094-b04e-d423f29eb5ec.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump says Fed chair’s ‘termination cannot come fast enough’"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.941,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45724999999999993,
    "normalized_score": 7.98,
    "summary": "Following calls from the US President for the central bank to lower interest rates, there has been an attack on the central bank's policies. The President's pressure aims to stimulate economic growth by reducing borrowing costs, leading to a public confrontation with the central bank's decision-making."
  },
  {
    "title": "UK bans EVs from some military bases over Chinese spy fears",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:26:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Concerns that sensors in electric vehicles could be used to gather intelligence"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbd90ab33-ba98-408a-80a6-c4525124ae16.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK bans EVs from some military bases over Chinese spy fears"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.988,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45699999999999996,
    "normalized_score": 7.97,
    "summary": "There are growing concerns that sensors in electric vehicles (EVs) could potentially be exploited to collect intelligence data. These sensors, integral to the operation and safety features of EVs, have capabilities that could be misused for surveillance or data gathering beyond their intended function. The current status of these concerns highlights the need for scrutiny and possibly enhanced security measures to protect users' privacy and prevent unauthorized data collection."
  },
  {
    "title": "Why claims about \"resurrecting\" dire wolves are the tip of the iceberg",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:00:16 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colossal Biosciences’s \"de-extinction\" news is just the latest in a slew of eyebrow-raising claims by privately funded researchers. Is the bar for belief lower when those making the claims have a lot of money, wonders Jonathan R. Goodman"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17114542/SEI_247544614.jpg",
    "titles": [
      "Why claims about \"resurrecting\" dire wolves are the tip of the iceberg"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45825000000000005,
    "normalized_score": 8.02,
    "summary": "Colossal Biosciences has announced plans for \"de-extinction,\" sparking debate on the credibility of claims from privately funded researchers. Jonathan R. Goodman highlights concerns over whether financial backing lowers the threshold for public belief in such scientific claims."
  },
  {
    "title": "Does the shipping industry's plan for net zero add up?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 15:00:42 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "New global rules will see a carbon levy applied to emissions from shipping for the first time, but analysts say the package falls short of what is needed"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17113354/SEI_247759338.jpg",
    "titles": [
      "Does the shipping industry's plan for net zero add up?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45575,
    "normalized_score": 7.92,
    "summary": "New global regulations introduce a carbon levy on shipping emissions, marking the first instance of such a measure. However, analysts critique the package as insufficient for addressing the necessary environmental targets."
  },
  {
    "title": "A classic hacking technique works on some quantum computers",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:00:52 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two independent research teams have developed methods for hacking noisy quantum computers based on a row-hammer attack, a type of interference used to infiltrate traditional computers"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15184836/SEI_247621663.jpg",
    "titles": [
      "A classic hacking technique works on some quantum computers"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45225000000000004,
    "normalized_score": 7.78,
    "summary": "Two independent research teams have developed hacking methods targeting noisy quantum computers using a row-hammer attack, traditionally employed against conventional computers. This approach leverages interference techniques to infiltrate the systems."
  },
  {
    "title": "Ancient computer's gears may not have been able to turn",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 09:00:00 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 2000-year-old Antikythera mechanism may have been a kind of astronomical calculator, but researchers are unsure whether it would have worked without jamming"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15143746/SEI_247633284.jpg",
    "titles": [
      "Ancient computer's gears may not have been able to turn"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.899,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43474999999999997,
    "normalized_score": 7.08,
    "summary": "The Antikythera mechanism, a 2000-year-old device, is thought to have served as an astronomical calculator. However, researchers are currently uncertain if the mechanism could have functioned without jamming, indicating a lack of consensus on its operational feasibility."
  },
  {
    "title": "Should your menstrual phase dictate what you eat and how you exercise?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 08:00:02 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The idea of varying your lifestyle throughout your menstrual cycle to help relieve PMS or period pain seems intuitive, but the evidence reveals a nuanced picture, finds columnist Alexandra Thompson"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16123629/SEI_246686431.jpg",
    "titles": [
      "Should your menstrual phase dictate what you eat and how you exercise?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.885,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43125,
    "normalized_score": 6.94,
    "summary": "Columnist Alexandra Thompson explored the concept of adjusting lifestyle habits according to the menstrual cycle to alleviate PMS and period pain. The investigation into this practice reveals a complex and nuanced reality, indicating that while the idea seems intuitive, the supporting evidence varies in its conclusions."
  },
  {
    "title": "Trump Calls For Fed Chair Powell's 'Termination' Over His Reluctance To Cut Rates",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:05:41 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Getty Images\" src=\"https://www.investopedia.com/thmb/yktD1KkPpOZrIal6_YLnU4oc0eg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208513468-f65012f431ed44269eefbfce595f1b14.jpg\" title=\"Federal Reserve Chairman Jerome Powell departs after speaking during a Society for Advancing Business Editing and Writing (SABEW) Annual Conference on April 04, 2025 in Arlington, Virginia. \" /><figcaption><i><p>Anna Moneymaker / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>President Donald Trump said Thursday that Federal Reserve Chair Jerome Powell should be \"terminated,\" renewing his attacks on the central bank's independence.<br /></li><li>Trump's threats came after Powell suggested the Federal Reserve was worried about inflation, implying the Fed is in no hurry to cut interest rates, as Trump has long demanded.<br /></li><li>Powell has said he would not resign from his post if Trump asked, and the Supreme Court could ultimately decide whether the president has the authority to fire the Fed chair.<br /></li></ul><br /><br /><p>President Donald Trump renewed his talk of firing Federal Reserve Chair Jerome Powell Thursday after the central banker signaled he was in no hurry to lower borrowing costs, as Trump has long demanded.<br /><br />Trump attacked Powell in a social media post following Powell’s comments Wednesday that Trump's spate of larger-than-expected tariffs could <a href=\"https://www.investopedia.com/federal-reserve-chair-jerome-powell-emphasizes-inflation-risks-of-trump-tariffs-trade-war-11716687\">pose a \"challenging\" scenario</a> for the Fed by slowing down the economy while pushing up prices.<span class=\"ql-inline-citation\"></span> Powell said officials at the central bank expect <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">the import taxes Trump imposed</a> this month to push up prices and are determined not to let that bout of price increases turn into a prolonged period of inflation.<br /><br />\"Powell’s termination cannot come fast enough!\" Trump wrote in a post on Truth Social.<br /><br />Trump's call for \"termination\" escalated his long-running attacks on Powell and his <a href=\"https://www.investopedia.com/what-would-happen-if-the-fed-answered-to-the-president-8644170\">attempts to exert more influence</a> over the Federal Reserve, which is outside the White House's direct control.</p><p>Trump has long pressured Powell and the Fed to lower the central bank's benchmark interest rate, which influences borrowing costs on all kinds of loans. The Fed has held the rate higher than usual since 2022, when it raised rates to slow the economy and counteract surging inflation.</p><p>The Fed is a unique government institution that was <a href=\"https://www.investopedia.com/powell-defends-fed-independence-8756337\">set up to be independent</a> so that it can make <a href=\"https://www.investopedia.com/monetary-policy-4689792\">monetary policy</a> decisions based on economic strategy rather than political considerations.<br /><br />Trump has tested that independence by threatening to remove Powell before his term ends in May 2026. Trump appointed Powell to his current post in 2018, and former President Joe Biden gave Powell another four-year term in 2022. In both his terms in office, Trump has frequently criticized Powell and pushed him to lower interest rates. Lower rates could boost the economy and potentially benefit Trump politically, at the risk of stoking inflation in the long run.<br /></p><h2>Powell's Not Stepping Down Willingly</h2><p>However, any move to fire Powell would be a reversal for Trump, who said in December that <a href=\"https://www.investopedia.com/trump-said-he-won-t-replace-fed-chair-powell-but-that-likely-won-t-avert-conflict-8758143\">he had no plans to have the Fed chair removed</a>. It would also set up a legal clash: Powell has said he would <a href=\"https://www.investopedia.com/federal-reserve-fomc-meeting-november-2024-interest-rates-8741570\">not resign from his post</a> if Trump asked, and that it's illegal for the president to fire the Fed chair.<br /><br />That question could ultimately be decided by the Supreme Court, which, according to a <em>Wall Street Journal</em> report Wednesday, is taking up a case considering whether the president has the authority to fire the heads of government agencies previously considered independent of White House control.<br /><br />\"I don't think that that decision will apply to the Fed, but I don't know,\" Powell said of the case Wednesday.<span class=\"ql-inline-citation\"></span> \"But it's a situation that we're monitoring carefully.\"</p><p>The dispute takes place at a pivotal time for the central bank's dual mission to keep interest rates high enough to keep inflation down but not so high that they stifle the job market. This task could become complicated or impossible if Trump's tariffs cause \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/s/stagflation.asp\">stagflation</a>\" to set in.<br /><br />Trump said Powell was “TOO LATE AND WRONG,\" digging at the central bank's track record on managing inflation. Trump and other critics, even Powell himself, have said that in hindsight, the Fed was too slow to raise interest rates in 2022 after inflation began to surge as the economy reopened from the pandemic.<span class=\"ql-inline-citation\"></span><br /><br />Trump cited recent economic data to argue that now is the time for the Fed to cut rates. Inflation <a href=\"https://www.investopedia.com/inflation-unexpectedly-fell-in-march-amid-tariff-turmoil-11712611\">retreated unexpectedly</a> in March due to dropping oil and gas prices. Cooling inflation would normally prompt the Fed to lower interest rates, but Fed officials expect Trump's wave of import taxes to raise prices and potentially set off a fresh round of high inflation.<br /><br />Trump also cited the European Central Bank's recent string of interest rate cuts, suggesting the Fed is out of step with its European counterpart.<span class=\"ql-inline-citation\"></span><br /></p><p>“Oil prices are down, groceries (even eggs!) are down [sic], and the USA is getting RICH ON TARIFFS,” Trump wrote in the post. “Too Late should have lowered Interest Rates, like the ECB, long ago, but he should certainly lower them now.\"<br /><br />Consumer prices for groceries, including for eggs, actually rose in March according to data from the Bureau of Labor Statistics.<span class=\"ql-inline-citation\"></span><span class=\"ql-inline-citation\"></span> <a href=\"https://www.investopedia.com/falling-wholesale-prices-could-mean-cheaper-eggs-are-coming-11713545\">Wholesale prices for eggs fell</a>, suggesting prices on store shelves could follow suit.<span class=\"ql-inline-citation\"></span><br /></p><p><em>Senior Editor Nisha Gopalan contributed to this story.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/yktD1KkPpOZrIal6_YLnU4oc0eg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208513468-f65012f431ed44269eefbfce595f1b14.jpg",
    "titles": [
      "Trump Calls For Fed Chair Powell's 'Termination' Over His Reluctance To Cut Rates"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46799999999999997,
    "normalized_score": 8.41,
    "summary": "President Donald Trump has intensified his criticism of Federal Reserve Chair Jerome Powell, suggesting Powell should be \"terminated\" for not lowering interest rates as Trump desires. This follows Powell's remarks indicating the Federal Reserve's concern over inflation and reluctance to cut rates, despite Trump's demands. Powell, appointed by Trump in 2018 and reappointed by Biden in 2022, has stated he will not resign if asked and highlighted the Fed's independence from political influence. The legality of firing Powell could be decided by the Supreme Court, amidst debates over the president'"
  },
  {
    "title": "ECB cuts rates to 2.25% amid Trump trade war",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:06:31 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Growth and inflation set to slow as central bankers prepare for tariff impact"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1f5a06e7-9620-4ceb-bedc-2a3ee9e13d62.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "ECB cuts rates to 2.25% amid Trump trade war"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.984,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46199999999999997,
    "normalized_score": 8.17,
    "summary": "Central bankers are anticipating a slowdown in both growth and inflation due to the expected impact of tariffs. This preparation suggests adjustments in monetary policy may be on the horizon to mitigate the economic effects of these trade barriers."
  },
  {
    "title": "IMF chief cuts growth forecast over ‘off the charts’ trade uncertainty",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:01:54 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kristalina Georgieva warns that Donald Trump’s tariff ‘reboot’ threatens to raise prices and play havoc with markets"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fced1de9b-08b4-41a2-a82e-1c1e799ddb64.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "IMF chief cuts growth forecast over ‘off the charts’ trade uncertainty"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46175,
    "normalized_score": 8.16,
    "summary": "Kristalina Georgieva, the IMF Managing Director, has expressed concerns that Donald Trump's plan to reintroduce tariffs could lead to higher prices and disrupt market stability. This warning highlights the potential economic impacts of the proposed tariff policy changes."
  },
  {
    "title": "Trump says Fed chair’s ‘termination cannot come fast enough’",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 10:59:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Attack follows pressure from US president for central bank to cut interest rates"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F70405974-1de3-4094-b04e-d423f29eb5ec.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump says Fed chair’s ‘termination cannot come fast enough’"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.941,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45724999999999993,
    "normalized_score": 7.98,
    "summary": "Following calls from the US President for the central bank to lower interest rates, there has been an attack on the central bank's policies. The President's pressure aims to stimulate economic growth by reducing borrowing costs, leading to a public confrontation with the central bank's decision-making."
  },
  {
    "title": "UK bans EVs from some military bases over Chinese spy fears",
    "domain": "business",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:26:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Concerns that sensors in electric vehicles could be used to gather intelligence"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbd90ab33-ba98-408a-80a6-c4525124ae16.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK bans EVs from some military bases over Chinese spy fears"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.988,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45699999999999996,
    "normalized_score": 7.97,
    "summary": "There are growing concerns that sensors in electric vehicles (EVs) could potentially be exploited to collect intelligence data. These sensors, integral to the operation and safety features of EVs, have capabilities that could be misused for surveillance or data gathering beyond their intended function. The current status of these concerns highlights the need for scrutiny and possibly enhanced security measures to protect users' privacy and prevent unauthorized data collection."
  },
  {
    "title": "The truth about life on other planets - and what it means for humans",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 00:11:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Could discoveries of alien life ever change the human psyche in how we view ourselves and each other?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/468f/live/8b7c5530-1b6a-11f0-a455-cf1d5f751d2f.png",
    "titles": [
      "The truth about life on other planets - and what it means for humans"
    ],
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story provides empowering knowledge about potential extraterrestrial life and its implications for humans, contributing to a deeper understanding of our universe.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.791,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.50775,
    "normalized_score": 10.0,
    "summary": "The question of whether discoveries of alien life could alter the human psyche and our perspectives on ourselves and each other remains speculative. It touches on profound implications for humanity's self-understanding and relationships, suggesting potential shifts in societal, philosophical, and possibly religious views. However, without concrete discoveries of extraterrestrial life, the exact nature and extent of these changes are currently theoretical and subject to debate among scientists, philosophers, and theologians."
  },
  {
    "title": "Hamas accuses Israel of weaponising aid as Gaza’s hunger crisis worsens",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 10:26:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel&#039;s defence minister admits blockade is a &#039;pressure lever&#039; against Hamas and there are no plans to ease it."
    ],
    "image_url": "",
    "titles": [
      "Hamas accuses Israel of weaponising aid as Gaza’s hunger crisis worsens"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.933,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48525000000000007,
    "normalized_score": 9.1,
    "summary": "Israel's Defense Minister acknowledged that the blockade on Gaza serves as a 'pressure lever' against Hamas, indicating that there are currently no intentions to relax the restrictions. This statement confirms the strategic use of the blockade in Israel's approach to dealing with Hamas."
  },
  {
    "title": "Child among three killed in Russia’s attack on Ukraine before Paris talks",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 08:39:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Deadly air attack on the city of Dnipro comes hours before Ukrainian officials meet US and European officials in Paris."
    ],
    "image_url": "",
    "titles": [
      "Child among three killed in Russia’s attack on Ukraine before Paris talks"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.908,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.479,
    "normalized_score": 8.85,
    "summary": "A deadly air attack targeted the city of Dnipro shortly before Ukrainian officials were scheduled to meet with US and European representatives in Paris. The timing of the attack underscores ongoing tensions and conflicts in the region, though the outcome of the meeting in Paris following the attack was not detailed in the provided information."
  },
  {
    "title": "Dozens killed in Israeli attacks on Gaza’s tent camps for displaced people",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 09:45:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israeli attacks target displaced people in and around southern Gaza&#039;s al-Mawasi, as well as in Beit Lahiya in the north."
    ],
    "image_url": "",
    "titles": [
      "Dozens killed in Israeli attacks on Gaza’s tent camps for displaced people"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.924,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.477,
    "normalized_score": 8.77,
    "summary": "Israeli forces conducted attacks in southern Gaza, specifically targeting the al-Mawasi area, and extended their operations to Beit Lahiya in the north. These attacks were directed at locations where displaced people were reported to be situated."
  },
  {
    "title": "Trump’s claims about tariffs and trade with China",
    "domain": "general",
    "location": "global",
    "published": "Thu, 17 Apr 2025 12:00:02 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "@khalidmajzoubofficial reviews claims the White House has made about China and its new tariffs"
    ],
    "image_url": "",
    "titles": [
      "Trump’s claims about tariffs and trade with China"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.28,
      "recency": 0.955,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47275,
    "normalized_score": 8.6,
    "summary": "Khalid Majzoub, through his official platform, scrutinized the claims made by the White House regarding China's imposition of new tariffs. The review aimed to assess the accuracy and implications of the White House's statements on this matter. The outcome or specific conclusions of Majzoub's review were not disclosed in the provided content."
  },
  {
    "title": "Why claims about \"resurrecting\" dire wolves are the tip of the iceberg",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:00:16 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colossal Biosciences’s \"de-extinction\" news is just the latest in a slew of eyebrow-raising claims by privately funded researchers. Is the bar for belief lower when those making the claims have a lot of money, wonders Jonathan R. Goodman"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17114542/SEI_247544614.jpg",
    "titles": [
      "Why claims about \"resurrecting\" dire wolves are the tip of the iceberg"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45825000000000005,
    "normalized_score": 8.02,
    "summary": "Colossal Biosciences has announced plans for \"de-extinction,\" sparking debate on the credibility of claims from privately funded researchers. Jonathan R. Goodman highlights concerns over whether financial backing lowers the threshold for public belief in such scientific claims."
  },
  {
    "title": "Does the shipping industry's plan for net zero add up?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 15:00:42 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "New global rules will see a carbon levy applied to emissions from shipping for the first time, but analysts say the package falls short of what is needed"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17113354/SEI_247759338.jpg",
    "titles": [
      "Does the shipping industry's plan for net zero add up?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45575,
    "normalized_score": 7.92,
    "summary": "New global regulations introduce a carbon levy on shipping emissions, marking the first instance of such a measure. However, analysts critique the package as insufficient for addressing the necessary environmental targets."
  },
  {
    "title": "A classic hacking technique works on some quantum computers",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 14:00:52 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Two independent research teams have developed methods for hacking noisy quantum computers based on a row-hammer attack, a type of interference used to infiltrate traditional computers"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15184836/SEI_247621663.jpg",
    "titles": [
      "A classic hacking technique works on some quantum computers"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45225000000000004,
    "normalized_score": 7.78,
    "summary": "Two independent research teams have developed hacking methods targeting noisy quantum computers using a row-hammer attack, traditionally employed against conventional computers. This approach leverages interference techniques to infiltrate the systems."
  },
  {
    "title": "Ancient computer's gears may not have been able to turn",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 09:00:00 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The 2000-year-old Antikythera mechanism may have been a kind of astronomical calculator, but researchers are unsure whether it would have worked without jamming"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/15143746/SEI_247633284.jpg",
    "titles": [
      "Ancient computer's gears may not have been able to turn"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.899,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43474999999999997,
    "normalized_score": 7.08,
    "summary": "The Antikythera mechanism, a 2000-year-old device, is thought to have served as an astronomical calculator. However, researchers are currently uncertain if the mechanism could have functioned without jamming, indicating a lack of consensus on its operational feasibility."
  },
  {
    "title": "Should your menstrual phase dictate what you eat and how you exercise?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 17 Apr 2025 08:00:02 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The idea of varying your lifestyle throughout your menstrual cycle to help relieve PMS or period pain seems intuitive, but the evidence reveals a nuanced picture, finds columnist Alexandra Thompson"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16123629/SEI_246686431.jpg",
    "titles": [
      "Should your menstrual phase dictate what you eat and how you exercise?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.885,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43125,
    "normalized_score": 6.94,
    "summary": "Columnist Alexandra Thompson explored the concept of adjusting lifestyle habits according to the menstrual cycle to alleviate PMS and period pain. The investigation into this practice reveals a complex and nuanced reality, indicating that while the idea seems intuitive, the supporting evidence varies in its conclusions."
  },
  {
    "title": "Tour of Britain Women route unveiled with Glasgow circuit to host final stage",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 15:05:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Lotte Kopecky may be in action to defend her title ahead of a tilt at the Tour de France Femmes"
    ],
    "image_url": "",
    "titles": [
      "Tour of Britain Women route unveiled with Glasgow circuit to host final stage"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35525000000000007,
    "normalized_score": 3.89,
    "summary": "Lotte Kopecky is set to defend her title in an upcoming competition, with plans to also compete in the Tour de France Femmes. This move indicates her active participation in major cycling events and showcases her ambition to excel in the sport."
  },
  {
    "title": "Jayson Tatum and Paolo Banchero to headline Celtics playoff series against Orlando",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 15:00:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Jayson Tatum and Paolo Banchero will be the marquee matchup throughout the Boston Celtics opening round series against the Orlando Magic"
    ],
    "image_url": "",
    "titles": [
      "Jayson Tatum and Paolo Banchero to headline Celtics playoff series against Orlando"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "Jayson Tatum of the Boston Celtics and Paolo Banchero of the Orlando Magic are set to be the highlight players in their teams' opening round series of the NBA playoffs. This matchup is anticipated to draw significant attention as both players are key figures for their respective teams."
  },
  {
    "title": "Florida basketball adds star Princeton guard Xaivian Lee via the NCAA transfer portal",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:59:47 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Florida Gators added one of the best guards in the NCAA transfer portal on Wednesday with former Princeton standout Xaivian Lee."
    ],
    "image_url": "",
    "titles": [
      "Florida basketball adds star Princeton guard Xaivian Lee via the NCAA transfer portal"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "On Wednesday, the Florida Gators enhanced their basketball team by acquiring Xaivian Lee, a highly regarded guard from Princeton, through the NCAA transfer portal."
  },
  {
    "title": "Which Indiana Fever, Caitlin Fever games will Indianapolis fans be able to watch on TV?",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:59:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Indiana Fever and WTHR announced a multi-year extension of its distribution agreement that will air 18 games in central Indiana."
    ],
    "image_url": "",
    "titles": [
      "Which Indiana Fever, Caitlin Fever games will Indianapolis fans be able to watch on TV?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.88,
    "summary": "The Indiana Fever and WTHR have renewed their distribution agreement for multiple years, ensuring that 18 of the team's games will be broadcast in central Indiana. This extension continues the partnership between the Fever and WTHR, allowing fans in the region access to a significant portion of the team's games."
  },
  {
    "title": "RBC Heritage 2025: First-round tee times, pairings at Harbour Town",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 17 Apr 2025 14:51:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tee times and pairings for the first round of the PGA Tour's RBC Heritage."
    ],
    "image_url": "",
    "titles": [
      "RBC Heritage 2025: First-round tee times, pairings at Harbour Town"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 3.86,
    "summary": "The PGA Tour has announced the tee times and pairings for the first round of the RBC Heritage. This information is crucial for fans and players alike to know when and with whom the golfers will start the tournament. The specific details of the pairings and the schedule have been made public, setting the stage for the commencement of the event."
  }
]