[
  {
    "title": "Two Detainees Killed in Targeted Shooting at Dallas ICE Facility",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 24 Sep 2025 09:17:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "Deutsche Welle",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "www.dw.com",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Authorities are investigating a fatal shooting Wednesday at a federal immigration detention facility in Dallas. Two detainees were killed in what the FBI says was an act \"of targeted violence.\"",
      "US Homeland Security Secretary Kristi Noem said that the shooter is dead from a self-inflicted gunshot wound. The motive of the attack is still unclear.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE54X1N4YjVLWDZFT3AtdW43eWlfY1Y2dHR3Q2trUk02S0t5TE1NYjB3VC1UdFJOTVBXRzU3MF9raUJqNC13WEszQ2R6NkhXX3daM0NZM3hnQS1laTI0ODA4aGFVU185clZ3Y0toOFBtSUc0Ymp6RXgwT3hB?oc=5\" target=\"_blank\">Two detainees killed in shooting at Dallas ICE facility</a>&nbs",
      "A sniper opened fire on the Dallas Immigration and Customs Enforcement field office on Wednesday morning.",
      "DHS Secretary Kristi Noem said authorities do not know the motive for the shooting, but \"we know that our ICE law enforcement is facing unprecedented violence.\""
    ],
    "image_url": "",
    "titles": [
      "Shooting at ICE detention facility in Dallas kills 2 detainees, injures 1 other",
      "Texas: ICE facility shooting in Dallas leaves two dead",
      "Two detainees killed in shooting at Dallas ICE facility - Axios",
      "Sniper opens fire on Dallas ICE facility, killing 2 detainees, wounding 1: DHS",
      "2 ICE detainees dead, 1 wounded in Dallas shooting; gunman identified"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.865,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fatal shooting occurred at a Dallas ICE facility on Wednesday, resulting in the deaths of two detainees in an act described by the FBI as \"targeted violence.\" The shooter died from a self-inflicted gunshot wound. The motive remains unclear, as investigations continue. Homeland Security Secretary Kristi Noem highlighted the increasing violence faced by ICE law enforcement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ragasa Storm Kills 17 in Taiwan, Affects South China Sea Region",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 12:19:49 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Ragasa is the world's strongest storm this year and has been roaring over the South China Sea for days.",
      "<p>This blog is now closed, you can read more on this story here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/24/super-typhoon-ragasa-update-path-hong-kong-taiwan-china\">Ragasa: 17 killed in Taiwan as storm batters Hong Kong</a></p></li><li><p><a href=\"https://www.theguardian.c",
      "<p>Chinese businesses and schools shut and residents in high-rises ordered to evacuate as storm makes landfall on Guangdong coast</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates\">Super Typhoon ",
      "Almost 2 million people were evacuated across southern China as the world’s strongest typhoon this year continued its deadly rampage in Asia.",
      "One million residents of Guangdong, in southern China, were evacuated before the powerful storm made landfall on Wednesday. At least 21 people have been killed along its path this week.",
      "Hundreds of firefighters and soldiers dispatched to Guangfu have gone door to door to check for trapped residents."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c7bf/live/4b4fc860-993d-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Typhoon Ragasa makes landfall in China after 17 killed in Taiwan",
      "As it happened – deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
      "Super Typhoon Ragasa: 17 killed in Taiwan and Hong Kong battered as storm hits China",
      "Super Typhoon Ragasa kills 17 in Taiwan, causes mayhem in southern China",
      "Typhoon Ragasa Slams Into China After Deaths in Taiwan and the Philippines",
      "Typhoon Ragasa Tears Through Guangfu in Taiwan, Killing at Least 17"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.83,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.769,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ragasa, the strongest storm of the year, has caused significant damage across the South China Sea region, resulting in at least 17 deaths in Taiwan. It has also affected Hong Kong, with the aftermath prompting hundreds of firefighters and soldiers to conduct door-to-door checks in Guangfu for trapped residents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Revises Stance on Ukraine, Backs Territory Reclaim with NATO Support",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 13:03:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Donald Trump has said he believes Ukraine can reclaim all the territory lost to Russia.",
      "Ukrainian President Volodymyr Zelenskyy has welcomed U.S. President Donald Trump's latest comments.",
      "At the United Nations, Trump lectured world leaders — then later abandoned his insistence that Ukraine give up land for a peace deal.",
      "President Trump’s pivot could give him room to distance himself from a conflict that he once promised to solve in days or weeks."
    ],
    "image_url": "",
    "titles": [
      "Trump signals major shift on Ukraine war and taking back territory",
      "Defense stocks rally as Trump, in a major shift, says Ukraine can win back territory from Russia",
      "A Speech and a Shift on Ukraine",
      "In a Sudden Shift, Trump Says Ukraine Can Win the War With Russia"
    ],
    "score_components": {
      "magnitude": 0.907,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has shifted his stance on the conflict between Ukraine and Russia, now stating that Ukraine can reclaim its territory with support from NATO and Europe. This marks a significant change from his previous position, where he suggested both Kyiv and Moscow might need to cede land to end the conflict. Trump's updated view aligns with increased assistance for Ukraine and suggests a strategic distance from the conflict, which he once claimed he could resolve quickly. Ukrainian President Zelenskyy has expressed gratitude towards Trump for his efforts to end the war.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kremlin: Little Progress in US-Russia Relations; Trump Suggests NATO Aid for Ukr",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 13:17:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump&#039;s most recent flip-flop comes after a meeting with Ukrainian President Volodymyr Zelenskyy on the UNGA sidelines.",
      "Ukrainian President Volodymyr Zelenskyy praised his “productive meeting” with U.S. President Donald Trump on the sidelines of the United Nations General Assembly.",
      "Trump’s statement that Ukraine could retake all of its territory lost to Russia with NATO’s help was a dramatic change in U.S. rhetoric on the war."
    ],
    "image_url": "",
    "titles": [
      "Russia a ‘paper tiger’: How Trump changed his position on Ukraine, NATO",
      "Kremlin says Russia is not a 'paper tiger' after Trump criticism",
      "Russia hits back at Trump after his abrupt swing toward Ukraine"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.865,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Kremlin stated that efforts to improve US-Russia relations have produced minimal results, amid concerns in Europe about the conflict in Ukraine spreading. Additionally, former U.S. President Trump suggested that Ukraine could reclaim all territories lost to Russia with NATO's assistance, marking a significant shift in the U.S. stance on the conflict.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Eyes Stake in Lithium Americas to Secure Mineral Supply Chain",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 16:19:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "It is the latest move by the White House to take direct ownership in the U.S. critical mineral supply chain.",
      "A Trump administration stake in Lithium Americas would follow stakes in Intel and MP Materials.",
      "Lithium Americas asked for a small change to the loan repayment period, which spurred the latest Trump administration request for equity."
    ],
    "image_url": "",
    "titles": [
      "Lithium Americas soars 100% as Trump administration seeks equity stake in Canadian miner",
      "Lithium Americas could be the Trump administration’s next investment, after chips and rare earths",
      "Trump administration wants 10% stake in American lithium miner that sells to GM"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.902,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House has taken a new step in securing the U.S. critical mineral supply chain by considering a stake in Lithium Americas. This follows previous investments in Intel and MP Materials during the Trump administration, marking a continued effort to strengthen national control over essential resources.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 4 Fantasy Football: PPR, Dynasty Rankings, and Start-Sit Advice Released",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 08:04:09 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Bleacher Report",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.bleedinggreennation.com",
      "news.google.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR, as well as Eric Karabell's superflex ranks.",
      "﻿﻿100% accurate ranking of all 32 NFL teams.﻿",
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxONXdHZmplbmFnWV9OZjl4MFhFTGpwX1hmTTFNbklzNlNvaloxQm05NzBWUjd4QTJqMWVWdjZ1VHB4cW83ODdSLTd1YXBqOFl2cDhEQmliM1RHMk91bE94YWVqSEtMdFJubnZ3cWg2VEVuWEpLVFhuNUREWjB1a3JQdkJOUXo1TDl2YVllMkQyWEdxazcxTVJ6OG50U0JsQQ?oc=5\" target=\"_blank\">B/R's Week 4 "
    ],
    "image_url": "",
    "titles": [
      "Rankings for Week 4",
      "NFL Power Rankings: Week 4 Edition",
      "B/R's Week 4 PPR Fantasy Football 2025 Player Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "This week's fantasy football updates include individual and composite PPR rankings for various positions and Eric Karabell's superflex rankings. Additionally, updated Dynasty rankings are available for quarterbacks, running backs, wide receivers, and tight ends. SportsLine has also released Week 4 Fantasy football projections, PPR rankings, and start-sit advice applicable to CBS Sports, ESPN, and Yahoo platforms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Instagram Hits 3 Billion Users, Unveils New Content Control Features",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 18:55:46 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
      "Instagram now has 3 billion monthly active users, according to Meta CEO Mark Zuckerberg. This milestone comes almost four years after Instagram reportedly hit 2 billion monthly users in December 2021, catching up to other Meta platforms. Zuckerberg announced that Facebook had surpassed 3 billion use",
      "As Instagram celebrates the 3 billion milestone, it also plans to roll out features that help users control what content is algorithmically recommended to them."
    ],
    "image_url": "",
    "titles": [
      "Profit-taking hits the AI trade again, and Instagram reaches 3 billion monthly users",
      "Instagram hits 3 billion monthly users",
      "Instagram now has 3 billion monthly active users, will test features to help users control their feeds"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.953,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Instagram has reached 3 billion monthly active users, as announced by Meta CEO Mark Zuckerberg. This growth milestone arrives nearly four years after the platform reported 2 billion users in December 2021. Alongside this achievement, Instagram is introducing new features to allow users more control over algorithmically recommended content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jessica Chastain's \"The Savant\" Pulled from Apple TV+ Schedule",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 15:54:52 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.theverge.com"
    ],
    "snippets": [
      "<p>The Savant pulled from Apple TV+ release schedule ‘after careful consideration’</p><p>Jessica Chastain-led series The Savant has been pulled from the Apple TV+ release schedule.</p><p>The thriller was set to begin on 26 September but its release has been postponed.</p> <a href=\"https://www.thegua",
      "“The Savant” star Jessica Chastain says she is “not aligned” with the streamer’s decision to postpone the premiere of the series following the assassination of right-wing activist and podcaster Charlie Kirk.",
      "Just a day after Apple announced that it was pausing the premiere of The Savant, its upcoming show about domestic extremism, star Jessica Chastain says that she disagrees with the decision. In a lengthy statement on Instagram, Chastain said that while the team at Apple TV Plus are “incredible collab"
    ],
    "image_url": "https://i.guim.co.uk/img/media/471cfb9ab346f95293d8715d8270a3aa44dd493d/720_0_7200_5760/master/7200.jpg?width=140&quality=85&auto=format&fit=max&s=8b672750d5d507e53b60a4428afedec7",
    "titles": [
      "Apple postpones Jessica Chastain series about domestic extremism",
      "Jessica Chastain Disagrees With Apple TV+ Postponing ‘The Savant’",
      "Jessica Chastain says she and Apple are &#8216;not aligned&#8217; on decision to halt The Savant"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.895,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Savant, a thriller series led by Jessica Chastain and focused on preventing domestic terrorism, was scheduled to premiere on Apple TV+ on September 26. However, after careful consideration, the show has been removed from the release schedule, and it is currently unclear if or when it will debut.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested in West Sussex Over Airport Delays Incident",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 11:53:42 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The National Crime Agency (NCA) said a man in his forties was arrested in West Sussex.",
      "British authorities detained a man in his 40s over a series of cyberattacks that grounded flights at major European airports. Such attacks against transport hubs are on the rise.",
      "<p>Man in West Sussex was held as part of investigation into last weekend’s incident affecting Collins Aerospace</p><p>A man has been arrested in the UK in connection with the <a href=\"https://www.theguardian.com/business/2025/sep/21/delays-continue-at-heathrow-brussels-and-berlin-airports-after-all"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a132/live/f7b9e9a0-9938-11f0-869a-3fa4ad43e8ee.jpg",
    "titles": [
      "Man arrested in connection with cyber-attack on airports",
      "Suspect arrested in the UK over airport cyberattacks",
      "UK arrest over cyberattack that hit Heathrow and European airports"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.823,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A man in his forties was arrested in West Sussex by the National Crime Agency as part of an investigation into an incident last weekend that impacted Collins Aerospace, causing delays at Heathrow, Brussels, and Berlin airports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthony Santander Returns to Blue Jays for Red Sox Series",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 24 Sep 2025 19:46:58 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Veteran slugger Anthony Santander is back in the starting lineup for the Toronto Blue Jays.",
      "<p>Anthony Santander will make his long-awaited return to the lineup when the Toronto Blue Jays continue their series against the Boston Red Sox Wednesday. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/aab6e0a5acd5714dfe4678d9684619d007fc33534bc9374628aa1b6c8c56e443.jpg?quality=65&strip=all",
    "titles": [
      "Santander returns to starting lineup for Jays",
      "Santander returns to Blue Jays’ starting lineup vs. Red Sox"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthony Santander has returned to the Toronto Blue Jays' starting lineup for their series against the Boston Red Sox on Wednesday. This marks his long-awaited comeback to the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump-Epstein Statue Installed on National Mall Sparks Reactions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 24 Sep 2025 14:14:03 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "The statue of Trump and Epstein holding hands mid-frolic wasn't the first anti-Trump artwork on the National Mall in recent months. But it was the first to be removed, despite having a permit.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE05dXcza3hWam52VE5DbndEN21YR2IxYzVLZVBDUko0TVdKRTJTUkFHSVhGLXdKS1kyR1dselB3RG9Yd3VrUVpvVWptelFmcDVzdjdLSVZOTWc2S3QzaFhsNnpFekdWZXFYWGU3eVlhM3gyaWhsc2pNU2pn?oc=5\" target=\"_blank\">Statue of Trump and Epstein holding hands appears on the Nation"
    ],
    "image_url": "",
    "titles": [
      "A statue of Trump and Epstein holding hands in D.C. is removed as fast as it appeared",
      "Statue of Trump and Epstein holding hands appears on the National Mall - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A bronze statue depicting Donald Trump and Jeffrey Epstein holding hands and frolicking has been installed on the east end of the National Mall in Washington DC. Created by an anonymous artist, the statue features both men with wide grins and a foot kicked back in joy, sparking reactions among residents and tourists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "R.J. White Reveals Week 4 NFL Survivor Pick for ESPN Challenge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 13:39:13 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "NFL survivor pool strategy, predictions and picks for this week's ESPN Eliminator Challenge.",
      "SportsLine's No. 1 NFL expert R.J. White just locked in his top Week 4 NFL survivor pick"
    ],
    "image_url": "",
    "titles": [
      "Survivor pool strategy: The top teams to take in Week 4",
      "Week 4 NFL survivor pool picks, advice, strategy: Elite NFL expert reveals knockout pick, teams to avoid"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "R.J. White, SportsLine's top NFL expert, has made his Week 4 NFL survivor pick for ESPN's Eliminator Challenge. This selection is part of his strategy and predictions for this week's NFL games, aimed at guiding participants in making informed choices in their survivor pools.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Urges More Arms at U.N., Accuses Russia of Arms Race",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 24 Sep 2025 11:41:51 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy addressed the U.N. General Assembly a day after President Trump made another shift in his stance on Russia's war in Ukraine.",
      "President Volodymyr Zelensky said more weapons were needed to defend his country and the free world, blaming Russia for spurring a dangerous new arms race."
    ],
    "image_url": "",
    "titles": [
      "Ukraine's Zelenskyy issues a stark warning about a global arms race and AI war",
      "Zelensky Issues Call to Arms, Saying Global Institutions Have Failed"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.909,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy spoke at the U.N. General Assembly, calling for more weapons to defend Ukraine against Russia's aggression. He accused Russia of initiating a new arms race, following a change in stance by President Trump on the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Pledges Emission Cuts and Renewable Boost at U.N. Climate Conference",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 19:58:40 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "President Xi Jinping told a U.N. climate conference that his country would seek to reduce emissions by at least 7 to 10 percent by 2035. Ukraine’s president appealed for more weapons to fight Russia and warned of the dangers of a new arms race.",
      "President Xi Jinping told a U.N. climate summit that China will reduce emissions across its economy, expand renewables sixfold and make electric cars “mainstream.”",
      "China, the world’s largest polluter, set a target to cut economywide net greenhouse gas emissions 7% to 10% over the next decade, a strategy that’s seen as too modest to put the nation on a path to net zero and galvanize global climate action."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/24/multimedia/24unga-china-lhzt/24unga-china-lhzt-mediumSquareAt3X.jpg",
    "titles": [
      "U.N. General Assembly Updates: China, for First Time, Vows to Reduce Greenhouse Gas Emissions",
      "At U.N. Summit, China Promises to Reduce Greenhouse Gas Emissions",
      "China Vows to Cut Greenhouse Gas Emissions 7% to 10% by 2035"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a U.N. climate conference, President Xi Jinping announced China's commitment to reduce its greenhouse gas emissions by 7-10% by 2035, expand renewable energy sixfold, and mainstream electric vehicles. This move by the world's largest polluter is criticized for being insufficient to achieve net-zero emissions and stimulate worldwide climate action. Concurrently, Ukraine's president requested additional weapons to combat Russia and highlighted the risk of an escalating arms race.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators' Batherson Could Miss Season Start Due to Injury",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Wed, 24 Sep 2025 13:19:54 EDT",
    "source": "Sportsnet",
    "sources": [
      "Ottawa Citizen",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "<p>Drake Batherson&#8217;s status for the start of the season is now uncertain.</p>",
      "The Ottawa Senators have taken a big hit before the season starts. Winger Drake Batherson, who left Tuesday&#8217;s skate early while with the group that wasn&#8217;t playing against the Toronto Maple Leafs, is out at least two weeks with a pulled muscle in his upper body. Coach Travis Green confirm"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/03/Drake-Batherson-1.jpg",
    "titles": [
      "Senators’ Drake Batherson out at least two weeks with upper-body injury",
      "Senators suffer blow as Drake Batherson sidelined with muscle injury"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Drake Batherson, a winger for the Ottawa Senators, is potentially out for the season's start after sustaining a pulled muscle in his upper body. He left a skate session early on Tuesday and is sidelined for at least two weeks, confirmed by Coach Travis Green.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ottawa Police to Begin Wearing Body Cameras in November",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Wed, 24 Sep 2025 18:17:51 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "A small number of officers will being wearing the cameras in November, with more planned to be issued in the coming years.",
      "After a decision from the police services board earlier this year, some Ottawa officers will have body-worn cameras while on duty starting in November. According to the press release, 30 Axon cameras will be issued to members of the Crisis Intervention Team and some Change Agents. These officers wil"
    ],
    "image_url": "",
    "titles": [
      "Ottawa Police Service to start deploying body-worn cameras",
      "Body-worn cameras rolling out in November for Ottawa police"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Starting November, select Ottawa police officers, including members of the Crisis Intervention Team and Change Agents, will wear body-worn cameras as part of a program approved by the police services board earlier this year. Initially, 30 Axon cameras will be distributed, with plans to expand the program in the coming years.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Negotiates Stake in Canadian Mining Firm Amid Loan Talks",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 17:47:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The US government is reportedly considering as much as a 10 percent stake in the company.",
      "A proposed stake comes as the Canadian mining company negotiates terms for a multibillion-dollar loan with the Trump administration."
    ],
    "image_url": "",
    "titles": [
      "Lithium Americas’ stock surges amid possible US government stake",
      "Lithium Americas Shares Surge 90% As Trump Requests Stake"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US government is reportedly in talks to acquire up to a 10 percent stake in a Canadian mining company. This development is part of negotiations for a multibillion-dollar loan between the company and the Trump administration.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 4 Fantasy Football: Improved Prospects for Robinson, Skattebo",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 19:35:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Wide receivers you want in your Week 4 lineups, and those you should avoid",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxQOHVrVVVzaU1hWG52Y3NucFFHSE1uVmZtbE5fd0VCbmpMQmJ6NDRsVUJEOEZuaTFJdEE3U25idkVBOXloVGdRU3gyaXVWTy03UThXVDdlNE05aUxXTm5FdXhXZWljeWd6TXFJT1NKTW52aXR0dlk0TjdGbjJQc3M5TVRwTVFickc2UFRuMFZSWlRSd21EMWc4WEdpTkw?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxNbjltUUg4dWNodlpaWl9temU1aG1aZGo4WXhZcDJ4Y0hESF8yZW5VX3NFZ0poMHdyOW01Wm5vVXl2LW1iTm02MFhQRnVscUJTUzREWmEwLVkwdDJnclpLS1JzQmM2bXg2OXRaY3NsTjRUMGxyeWstaDBJS1hGRGFzdTc1eHNXTkIxdWhGZWVjUlB4Y3RLbTZWMlRoX2w4UEE?oc=5\" target=\"_blank\">Defense & Ki",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNeEVya2lWdDRodHRXQW16WWlOWTBpZS11VDl3eHVSbWpEZnNVUnRUeVRubGFPeTh1cG92LVI4eW43MnVVYmh1aXJfTGRVVnplQjROekNpNTRiejZESGdmMFYzZEJjR25ERUxjTUdqQndITGJ0VWxUT3B1S3RNanpCb21udllab3Q5c2dGTEh3MWFnaHR3UU1Beg?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2023/08/29/e0d87174-884f-4d91-8191-fcea5512946a/michael-pittman-colts-usatsi.jpg",
    "titles": [
      "Fantasy Football Week 4 Start 'Em & Sit 'Em Wide Receivers: Consider Michael Pittman a No. 2 WR in all leagues",
      "Running Back Start ‘Em, Sit ‘Em for Fantasy Football Week 4 - Sports Illustrated",
      "Defense & Kicker Start 'Em, Sit 'Em For Fantasy Football Week 4 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 4 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 4 fantasy football updates, Wan'Dale Robinson and Cam Skattebo are expected to see improved performances. Chet Gresham has provided rankings for the top 32 kickers and top 32 D/STs. Additionally, advice on whether to start or sit players such as Kenneth Walker, Jameson Williams, and others is available, helping fantasy team owners make informed decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ron Ruzewski Named Andretti Global's IndyCar Team Principal",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 15:07:32 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After losing his job at Team Penske over a rules violation before Indianapolis 500 qualifications, Ron Ruzewski is back in IndyCar as Team Principal at Andretti Global.",
      "<p> TWG Motorsports made yet another power move for Andretti Global on Wednesday by naming Ron Ruzewski, one of three Team Penske executives fired during an Indianapolis 500 scandal, team principal of its IndyCar team.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d43e3e70a0a72d46a2ed9f/0x0.jpg?width=960",
    "titles": [
      "Ex Team Penske Director Ron Ruzewski New Team Principal At Andretti",
      "Andretti Global hires Ron Ruzewski as team principal, reuniting him with Will Power"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ron Ruzewski, previously fired from Team Penske due to a rules violation before the Indianapolis 500 qualifications, has been appointed as the Team Principal of Andretti Global's IndyCar team by TWG Motorsports. This marks his return to IndyCar racing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Man Arrested for Ransomware Attack on European Airports",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-24T12:41:48-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "The UK’s National Crime Agency arrested a man in West Sussex in connection with a ransomware attack that caused significant flight delays last week and forced many airlines to check passengers and luggage manually. The cyberattack impacted several airports across Europe, including London’s Heathrow ",
      "RTX, the parent company of Collins Aerospace, confirmed in a legally required notice that the disruption was ransomware-related."
    ],
    "image_url": "",
    "titles": [
      "UK arrests man in airport ransomware attack that caused delays across Europe",
      "UK arrests man linked to ransomware attack that caused airport disruptions across Europe"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK's National Crime Agency arrested a man in West Sussex for a ransomware attack that led to significant flight delays and manual check-ins at several European airports, including London's Heathrow. RTX, Collins Aerospace's parent company, confirmed the incident was due to ransomware.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WHO: No Link Between Acetaminophen in Pregnancy and Autism Risk",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 18:52:09 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>Body says research has found ‘no consistent association’ and urges pregnant women to follow doctors’ advice</p><p>The World Health Organization (WHO) is pushing back against contested claims by the Trump administration that acetaminophen use during pregnancy heightens the risk of autism, further ",
      "\"I think science ought to guide these discussions and our decision-making around our health,” Thune said."
    ],
    "image_url": "https://i.guim.co.uk/img/media/f71d588daedac9bf6c2f3a23d833701edb88864f/276_0_2767_2213/master/2767.jpg?width=140&quality=85&auto=format&fit=max&s=c6601b7ef7c74724df78fc4876288d92",
    "titles": [
      "WHO rejects Trump’s claims of link between Tylenol and autism",
      "Thune Becomes Highest-Ranking Republican To Cast Doubt On Trump’s Claims About Tylenol And Autism"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The World Health Organization (WHO) has stated that there is \"no consistent association\" between acetaminophen use during pregnancy and an increased risk of autism. They advise pregnant women to follow their doctors' recommendations. This statement counters claims by the Trump administration about the drug's risks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Family of Three First to Enter UK Under New \"One In, One Out\" Policy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 18:38:51 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A family of three are the first people to be allowed into the country from France, the Home Office says.",
      "<p>Small child part of first reciprocal intake after removal of four asylum seekers from Britain to France over past week</p><p>A family of three including a small child have become the first arrivals from France under Keir Starmer’s “one in, one out” deal, the Home Office has said.</p><p>The move f"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3ef1/live/1e403150-9967-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "First migrants arrive in UK from France under 'one in one out' deal",
      "Family of three are first arrivals in UK under ‘one in, one out’ immigration deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A family of three, including a small child, became the first to enter the UK from France under a new \"one in, one out\" policy, following the removal of four asylum seekers to France, the Home Office confirmed. This marks the initial reciprocal intake under the agreement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube Launches \"Hide\" Button for Ending Video Recommendations",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-24T12:25:45-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "YouTube will finally let you dismiss the pop-ups that fill your screen with recommendations at the end of a video. Now, when you come across an end screen, you can select a new “hide” button in the top-right corner of the video so you can finish what you’re watching without distractions. YouTube say",
      "The decision to let users hide end screens is a welcome addition to the platform, especially since they can end up covering the last bit of a video and make it hard to see what's happening in some cases."
    ],
    "image_url": "",
    "titles": [
      "YouTube will now let you hide those pesky end screens",
      "YouTube now lets you hide recommendation pop-ups at the end of videos"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.923,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "YouTube has introduced a \"hide\" button allowing users to dismiss recommendation pop-ups at the end of videos. This feature aims to enhance viewer experience by preventing distractions and ensuring the final moments of videos are visible without being obscured by suggestions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran's President Downplays Nuclear Ambitions Amid EU Talks, Zelenskyy Warns on P",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-24T15:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Iranian President Pezeshkian downplayed Iran's nuclear aspirations ahead of expected snapback sanctions from European countries. Meanwhile, Ukraine's Zelenskyy warned that Putin wants to expand his war. DW has more.",
      "The speech came as Iran and Europe negotiate over sanctions on the sidelines at the U.N. General Assembly. But Ayatollah Ali Khamenei said he opposed talks with the U.S., a key European demand."
    ],
    "image_url": "",
    "titles": [
      "UNGA: Iran does not seek nuclear weapon, president says",
      "Supreme Leader Says Iran Has No Plans for Nuclear Weapon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Iranian President Pezeshkian minimized Iran's nuclear goals amid negotiations with Europe at the U.N. General Assembly, facing potential immediate sanctions from European nations. Concurrently, Ukraine's President Zelenskyy cautioned that Putin aims to widen his military campaign. Negotiations are complicated by Ayatollah Khamenei's rejection of talks with the U.S., a critical condition from Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube to Allow Banned Misinformation Channels to Seek Reinstatement",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 14:51:40 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "\"YouTube values conservative voices on its platform and recognizes that these creators have extensive reach and play an important role in civic discourse,\" the company's legal counsel wrote.",
      "Alphabet blames the Biden administration for its moderation decisions."
    ],
    "image_url": "",
    "titles": [
      "YouTube will reinstate accounts banned for spreading misinformation",
      "YouTube will restore channels banned for COVID and election misinformation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube, owned by Alphabet, announced it will enable channels banned for spreading COVID-19 and election misinformation in 2020 to apply for reinstatement. This marks a reversal of its prior policy treating such violations as permanent. The decision was disclosed in a letter to the House Judiciary Committee, where Alphabet suggested the Biden administration influenced its moderation policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants Bench Russell Wilson, Name Jaxson Dart Starting QB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:44:09 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "This is all about New York's rookie QB, and the coach and GM, and little to do with Russell Wilson.",
      "<p>Brian Daboll on Wednesday declined to explain the move of benching Russell Wilson and making Jaxson Dart the New York Giants&#8217; starting quarterback, other than to repeatedly say it was his decision to turn to the rookie right away and for the rest of the season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Futures of Giants' Brian Daboll, Joe Schoen hinge on Jaxson Dart's instant success",
      "Brian Daboll says selecting Jaxson Dart as Giants’ starting QB is his decision"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.613,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.603,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Giants' head coach Brian Daboll announced the decision to bench Russell Wilson and appoint Jaxson Dart as the starting quarterback for the rest of the season. Daboll emphasized that this decision was solely his, choosing to focus on the rookie QB without providing further explanations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots' Gonzalez Expected to Return Against Panthers After Injury",
    "domain": "sports",
    "source_domain": "www.patspulpit.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 19:51:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "patriotswire.usatoday.com",
      "www.patspulpit.com"
    ],
    "snippets": [
      "The Patriots’ star cornerback could be returning this week against the Panthers.",
      "Patriots cornerback Christian Gonzalez reportedly didn't have a setback with his hamstring injury."
    ],
    "image_url": "",
    "titles": [
      "Christian Gonzalez eyes long-awaited season debut after hamstring injury",
      "Latest Christian Gonzalez update adds new layer of mystery to injury"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.992,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Patriots cornerback Christian Gonzalez, who had been sidelined due to a hamstring injury, is reportedly on track for a return in the upcoming game against the Panthers, with no setbacks in his recovery reported.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Panthers Win Despite Missing Key Players, Including Legette",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 19:54:19 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "pantherswire.usatoday.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "The Panthers didn't have wide receiver Xavier Legette in last Sunday's win over the Falcons and two other wideouts joined him as non-participants in practice on Wednesday.",
      "The Panthers held out seven players from practice on Wednesday, including all three of their starting wide receivers."
    ],
    "image_url": "",
    "titles": [
      "Tetairoa McMillan, Xavier Legette out of Panthers practice Wednesday",
      "WRs Tetairoa McMillan, Xavier Legette among 7 Panthers held out from Wednesday's practice"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.993,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Panthers missed wide receiver Xavier Legette in their recent win against the Falcons. On Wednesday, they also held out seven players from practice, including all three starting wide receivers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]