[
  {
    "title": "Trump heads to Saudi Arabia eyeing more investment in US",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:44:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d0c6/live/34153be0-2c09-11f0-8da1-ad2bbee6cda5.jpg",
    "titles": [
      "Trump heads to Saudi Arabia eyeing more investment in US"
    ],
    "summary": "The President is visiting Saudi Arabia, Qatar, and the UAE with the aim of encouraging these countries to increase their purchases from the United States. This trip is part of a broader effort to strengthen economic ties between the U.S. and these nations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the President's visit to Saudi Arabia and the intended economic implications of the visit. However, it lacks depth in explaining the potential impacts and does not report on any solutions or innovations.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.773,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.495,
    "normalized_score": 4.13
  },
  {
    "title": "Hamas Says It Will Release Its Last American Hostage",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:29:01 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The announcement, which did not say when the hostage, Edan Alexander, would be set free, came as President Trump planned to visit the region."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/11/multimedia/11int-israel-hostage-hbvk/11int-israel-hostage-hbvk-mediumSquareAt3X-v2.jpg",
    "titles": [
      "Hamas Says It Will Release Its Last American Hostage"
    ],
    "summary": "The announcement revealed that hostage Edan Alexander will be released, although it did not specify a date. This news coincides with President Trump's planned visit to the region.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the hostage situation and its potential resolution. However, it does not provide additional insights or context about the situation, the reasons behind the hostage-taking, or the implications of the release.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.769,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.476,
    "normalized_score": 2.99
  },
  {
    "title": "The rare disease in a remote town where 'almost everyone is a cousin'",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:05:45 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Many children in a Brazil town lost the ability to walk, so one scientist set about discovering why."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fac6/live/0a621d00-f45e-11ef-896e-d7e7fb1719a4.png",
    "titles": [
      "The rare disease in a remote town where 'almost everyone is a cousin'"
    ],
    "summary": "In a Brazilian town, a significant number of children suddenly lost the ability to walk, prompting an investigation by a scientist. The investigation aimed to uncover the cause of this alarming condition, focusing on environmental, dietary, and other potential factors that could lead to such a sudden loss of motor functions among the children. The current status of the investigation or its findings were not specified.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a rare disease in a remote town, but it does not provide any actionable insights or deeper understanding. The story also lacks information about any attempts to solve the problem or the impacts of the disease on the town's population.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.455,
    "normalized_score": 1.74
  },
  {
    "title": "Why Burkina Faso's junta leader has captured hearts and minds around the world",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:05:24 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Capt Ibrahim Traoré, 37, is portraying himself as a champion of pan-Africanism."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/616c/live/ccdf1ec0-2c47-11f0-8ff1-59f5dcf8e9f5.jpg",
    "titles": [
      "Why Burkina Faso's junta leader has captured hearts and minds around the world"
    ],
    "summary": "Capt. Ibrahim Traoré, aged 37, has been positioning himself as a proponent of pan-Africanism. This stance emphasizes unity and solidarity among African countries and peoples, advocating for collective self-reliance and economic, social, and political progress across the continent.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the political stance of Burkina Faso's junta leader and his emphasis on pan-Africanism. It helps in understanding the current political landscape in Africa, but it doesn't provide any concrete solutions or progress towards solving any existing problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.495,
    "normalized_score": 4.13
  },
  {
    "title": "Less than 1% of UK biosecurity budget goes on tackling invasive species, figures show",
    "domain": "general",
    "location": "global",
    "published": "Sun, 11 May 2025 23:01:36 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Conservationists call for more funding and warn of danger to ‘cherished’ native species, from water voles to ladybirds</p><p>Less than 1% of the government’s biosecurity budget goes on tackling invasive species, despite the danger they pose to British wildlife, figures suggest.</p><p>Conservationists warned the funding to address non-native plants and animals was failing to match the risk they posed to “cherished” native species, from water voles to ladybirds, as well as to waterways, homes, businesses and local green spaces.</p> <a href=\"https://www.theguardian.com/environment/2025/may/12/less-than-1-of-uk-biosecurity-budget-goes-on-tackling-invasive-species-figures-show\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f8329a8ab8d560bb76384aee03f3b80316a1325c/267_221_1433_1146/master/1433.jpg?width=140&quality=85&auto=format&fit=max&s=440f785bf36dc4f62d0c6b85260afafb",
    "titles": [
      "Less than 1% of UK biosecurity budget goes on tackling invasive species, figures show"
    ],
    "summary": "Conservationists have raised concerns that less than 1% of the UK government's biosecurity budget is allocated to combat invasive species, posing significant threats to native wildlife, including water voles and ladybirds. They argue that the current funding does not reflect the substantial risk these non-native plants and animals present to ecosystems, homes, businesses, and local green spaces, calling for increased financial support to protect cherished native species.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story increases awareness about the underfunding of efforts to combat invasive species in the UK. It provides clarity on the impact of this issue on ecosystems and calls for increased financial support. However, it doesn't report on any solutions or improvements, just the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.763,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.504,
    "normalized_score": 4.67
  },
  {
    "title": "Transfer rumors, news: Jadon Sancho's next move could be to Bayer Leverkusen",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 11 May 2025 20:57:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Bayer Leverkusen are willing to offer Man United's Jadon Sancho a career lifeline this summer. Transfer Talk has the latest news, gossip and rumors."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Jadon Sancho's next move could be to Bayer Leverkusen"
    ],
    "summary": "Bayer Leverkusen is reportedly interested in offering Manchester United player Jadon Sancho a chance to join their team this summer, according to Transfer Talk's latest updates on football news, gossip, and rumors.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story might be of interest to football fans, it doesn't provide any deep insights or actionable information. It's mostly speculation and gossip, offering minimal depth or insight.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.734,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.426,
    "normalized_score": 0.0
  },
  {
    "title": "Blackmore retires: 'My days of being a jockey have come to an end'",
    "domain": "sports",
    "location": "global",
    "published": "Mon, 12 May 2025 16:48:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Rachael Blackmore has announced that she is retiring from racing, stating on social media that her \"days of being a jockey have come to an end\"."
    ],
    "image_url": "https://e2.365dm.com/25/03/1920x1080/skysports-blackmore-racing_6855239.jpg?20250313163348",
    "titles": [
      "Blackmore retires: 'My days of being a jockey have come to an end'"
    ],
    "summary": "Rachael Blackmore, a renowned jockey, has officially announced her retirement from racing. She shared the news on social media, stating that her career as a jockey has concluded.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Rachael Blackmore's retirement but doesn't offer any deeper insights or context about her career, the impact of her retirement on the racing industry, or any potential successors.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.01,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.509,
    "normalized_score": 4.97
  },
  {
    "title": "Eagles get rival Cowboys for NFL regular-season opener on September 4",
    "domain": "sports",
    "location": "global",
    "published": "Mon, 12 May 2025 16:29:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "The Philadelphia Eagles will start defending their NFL championship at home on September 4 against arch rival Dallas Cowboys."
    ],
    "image_url": "https://e0.365dm.com/25/02/1920x1080/skysports-philadelphia-eagles_6824686.jpg?20250210130054",
    "titles": [
      "Eagles get rival Cowboys for NFL regular-season opener on September 4"
    ],
    "summary": "The Philadelphia Eagles, the current NFL champions, are set to begin their title defense at home on September 4, facing their arch-rivals, the Dallas Cowboys. This marks the official start of their championship defense journey for the season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides awareness about the upcoming NFL season and the first match, it doesn't provide any actionable insights or deeper understanding for the reader. It also doesn't report on any improvements, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.005,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.527,
    "normalized_score": 6.05
  },
  {
    "title": "Sabu was Sabu until the very end",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 12 May 2025 15:56:36 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Three weeks before his death Sunday, the 60-year-old hardcore wrestling legend pulled off a swan song worthy of the homicidal, genocidal, death–defying maniac."
    ],
    "image_url": "",
    "titles": [
      "Sabu was Sabu until the very end"
    ],
    "summary": "Three weeks before his death at the age of 60, a renowned hardcore wrestling legend delivered a final performance that lived up to his reputation as a \"homicidal, genocidal, death-defying maniac.\" This event marked the culmination of his career in the wrestling industry.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful context about the wrestling legend's final performance, highlighting the end of his career. However, it doesn't provide any deeper insights into his impact on the wrestling industry, his career highlights, or how his legacy might continue.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 6.53
  },
  {
    "title": "Gauff too much for Raducanu in Rome",
    "domain": "sports",
    "location": "global",
    "published": "Mon, 12 May 2025 15:55:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Highlights of Emma Raducanu against Coco Gauff from the Italian Open."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-gauff-coco-emma-raducanu_6914304.jpg?20250512160423",
    "titles": [
      "Gauff too much for Raducanu in Rome"
    ],
    "summary": "In a highly anticipated match at the Italian Open, Emma Raducanu faced off against Coco Gauff. The encounter showcased the talent of two of tennis's rising stars. The match concluded with Coco Gauff securing a victory over Emma Raducanu. The outcome adds a significant win to Gauff's career and highlights the competitive spirit and skill level of both young athletes in the tournament.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story offers basic awareness about a specific tennis match and its outcome. It does not provide deeper insights into the strategies used, the significance of the match in the larger context of the tournament, or the potential impacts on the players' careers. Therefore, it has limited usefulness and does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.4
    },
    "score": 0.515,
    "normalized_score": 5.33
  },
  {
    "title": "China, US Officials Say Progress Was Made in Trade Talks Over the Weekend",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:32:46 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Valentin Flauraud / AFP via Getty Images Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer speak to the media after talks with Chinese officials on tariffs in Geneva on May 11.\" src=\"https://www.investopedia.com/thmb/RvXVX5lYrGr2dPTMHdOEcHzzDOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213984182-6b2364055df741d48df08842826cafc1.jpg\" title=\"Scott Bessent and Jamieson Greer stand in front of the doorway at  the residence of the permanent Swiss ambassador to the United Nations. Microphones are pointed toward them as they address reporters.\" /><figcaption><i><p>Valentin Flauraud / AFP via Getty Images</p> Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer speak to the media after talks with Chinese officials on tariffs in Geneva on May 11.</i></figcaption></figure><p>Both U.S. and Chinese officials described the weekend's trade talks as productive, providing hope that the world's largest economies could end the trade spat spurred in recent weeks.</p><p>U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer spoke with reporters Sunday after trade discussions with Chinese officials ended in Switzerland. Bessent said “substantial progress” was made during the talks and that more details would be released Monday.<span class=\"ql-inline-citation\"></span></p><p>On the Chinese side, Vice Premier He Lifeng said the weekend's discussions were “an important first step” in negotiations.<span class=\"ql-inline-citation\"></span></p><p>Going into the weekend, traders hoped the talks <a href=\"https://www.investopedia.com/us-and-china-are-meeting-to-talk-trade-tariffs-this-weekend-heres-what-we-know-update-11731774\">would be a turning point</a> for the two largest economies, which have recently engaged in tit-for-tat tariffs. The ratcheting of import duties resulted in 145% tariffs on Chinese goods coming into the U.S. China has levied tariffs of 125% on U.S. goods.</p><p>S&amp;P 500, Dow and Nasdaq futures all rose more than 1% after the positive talk from government officials.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/RvXVX5lYrGr2dPTMHdOEcHzzDOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213984182-6b2364055df741d48df08842826cafc1.jpg",
    "titles": [
      "China, US Officials Say Progress Was Made in Trade Talks Over the Weekend"
    ],
    "summary": "U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer announced \"substantial progress\" in trade talks with Chinese officials in Geneva on May 11, signaling a potential easing of recent tensions between the world's largest economies. Both sides described the discussions as productive, with China's Vice Premier He Lifeng calling it \"an important first step.\" The negotiations aimed to address the significant tariffs imposed by both countries, which had escalated to 145% on Chinese goods by the U.S. and 125% by China on U.S. goods. The positive outcomes of the talks led to ",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in an important international issue, providing useful information about the ongoing trade talks between the U.S. and China. It increases awareness around the systems and impacts of international trade, and the potential implications of these discussions on global economics. However, the story could provide more details on the specific issues being addressed and the potential solutions being proposed.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.77,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.525,
    "normalized_score": 5.93
  },
  {
    "title": "Trump Seeks to Lower Pharmaceutical Costs",
    "domain": "business",
    "location": "global",
    "published": "Sun, 11 May 2025 23:06:34 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Anna Moneymaker / Getty Images\" src=\"https://www.investopedia.com/thmb/_OFkHlav0_VpQ4dPupAnMHHu6Lw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214075981-77d9f69347be4797b6b4619f6e2b0f82.jpg\" title=\"President Donald Trump  address reporters in the Oval Office at the White House.\" /><figcaption><i><p>Anna Moneymaker / Getty Images</p></i></figcaption></figure><p>President Donald Trump says he is looking to reduce the price of prescription drugs this week.</p><p>In a post on Truth Social Sunday evening, Trump said he would sign an executive order Monday morning to ensure the U.S. pays the same price as the lowest costs paid by any other nation.<span class=\"ql-inline-citation\"></span> He said he expects the order will reduce the cost of pharmaceuticals by 30% to 80%.</p><p>\"Our Country will finally be treated fairly, and our citizens [sic] Healthcare Costs will be reduced by numbers never even thought of before,\" he wrote in the post. \"Additionally, on top of everything else, the United States will save TRILLIONS OF DOLLARS.\"</p><p>It is unclear if the executive order is a tariff on pharmaceuticals that Trump has <a href=\"https://www.investopedia.com/trump-suggests-25-tariffs-on-auto-chip-pharma-imports-reports-say-11682149\">suggested since February</a>. The president did not provide further details about how the order would be executed.</p><p>Trump is expected to sign the order at 9 a.m. Eastern Time.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/_OFkHlav0_VpQ4dPupAnMHHu6Lw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214075981-77d9f69347be4797b6b4619f6e2b0f82.jpg",
    "titles": [
      "Trump Seeks to Lower Pharmaceutical Costs"
    ],
    "summary": "President Donald Trump announced his intention to sign an executive order aimed at lowering the price of prescription drugs in the U.S. According to his statement on Truth Social, the order, expected to be signed at 9 a.m. Eastern Time, will align U.S. drug prices with those of the lowest-paying nation, potentially reducing costs by 30% to 80%. Trump claims this action will lead to unprecedented reductions in healthcare costs and save the U.S. trillions of dollars. However, details on the execution of the order remain unspecified, including whether it involves tariffs on pharmaceutical imports",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about a significant policy proposal aimed at reducing healthcare costs, which could have a major impact on many Americans. However, it lacks specific details about how the proposed executive order will be implemented and how it will affect the pharmaceutical industry and consumers. Therefore, while it provides useful context, its usefulness for decision-making and sense of agency is somewhat limited.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.513,
    "normalized_score": 5.21
  },
  {
    "title": "Here are the 3 things we're watching in the stock market in the week ahead",
    "domain": "business",
    "location": "national",
    "published": "Sun, 11 May 2025 17:22:23 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The economic data calendar is jam-packed, and trade headlines will dominate too."
    ],
    "image_url": "",
    "titles": [
      "Here are the 3 things we're watching in the stock market in the week ahead"
    ],
    "summary": "The economic calendar is filled with important data releases, and trade-related news is expected to significantly influence markets.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information for those interested in the stock market, providing a heads up on what to watch out for in the coming week. However, it lacks depth and does not provide any solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.684,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.461,
    "normalized_score": 2.1
  },
  {
    "title": "Consumer Stocks Pop After US-China Trade War Eases",
    "domain": "business",
    "location": "global",
    "published": "Mon, 12 May 2025 16:00:07 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Kevin Carter / Getty Images\" src=\"https://www.investopedia.com/thmb/DPwru3gI3JyhoYdeaQPd4vsDYx8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2189633230-3437bcd963e5429c9196266fda41efbd.jpg\" title=\"A Williams-Sonoma store is displayed. \" /><figcaption><i><p>Kevin Carter / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>News of the agreement between the U.S. and China to lower tariffs for 90 days sent stocks up, particularly shares in consumer discretionary companies.</li><li>Furniture and home goods stores, such as Williams-Sonoma and Wayfair, along with athletic retailers, including Dick's and Nike, made significant gains.</li><li>Toy makers also stand to benefit from the deescalation, J.P. Morgan said in a research note Monday.</li></ul><br /><br /><p>Consumer stocks ranging from cruise operators to furniture retailers jumped Monday, lifted by U.S.-China trade developments.</p><p>The S&amp;P 500's consumer discretionary sector was recently up more than 5%, helped by news that the U.S. and China have walked back tariffs. Those gains, which easily outpaced those for the broader index, came as the <a href=\"https://www.investopedia.com/global-stocks-soar-as-us-china-slash-tariffs-11732791\">White House announced</a> a 90-day deescalation period in the trade war with China. (Read <em>Investopedia's</em> full coverage of <a href=\"https://www.investopedia.com/dow-jones-today-05122025-11732807\">today's trading here</a>.)</p><p>Some of the biggest gainers in the index included cruise operators Carnival (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CCL\">CCL</a>) and Norwegian Cruise Line (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NCLH\">NCLH</a>); athleticwear sellers Lululemon Athletica (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;LULU\">LULU</a>) and Nike (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NKE\">NKE</a>); and furniture and home goods company Williams-Sonoma (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;WSM\">WSM</a>).</p><p>J.P. Morgan analysts in a Monday note examined how much companies would need to hike prices to maintain their gross profit while paying tariffs. Those that no longer need to consider steep price increases, which could deter customers, stand to benefit from the 90-day pause, analysts said. This includes toy companies, sporting goods stores and furniture and home good retailers.</p><p>Some of the companies named by J.P. Morgan saw their stock soar on Monday, including furniture retailers Wayfair (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;W\">W</a>) and RH (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;RH\">RH</a>), whose shares were recently up more than 21% and 17%, respectively; sports retailers Academy Sports &amp; Outdoors (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;ASO\">ASO</a>) and Dick's (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;DKS\">DKS</a>), whose shares gained about 15% and 9.5%, respectively; and toy company Mattel (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;MAT\">MAT</a>), whose stock rose about 9.6%.</p><p>While working towards a longer-term agreement, the U.S. will lower tariffs on Chinese imports to 30%, and China will cut its tax on U.S. imports to 10%, the Trump administration said early Monday.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/DPwru3gI3JyhoYdeaQPd4vsDYx8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2189633230-3437bcd963e5429c9196266fda41efbd.jpg",
    "titles": [
      "Consumer Stocks Pop After US-China Trade War Eases"
    ],
    "summary": "The U.S. and China have agreed to a 90-day period to lower tariffs, boosting stocks, especially in the consumer discretionary sector. Shares of companies like Williams-Sonoma, Wayfair, Nike, and toy makers surged following the announcement. The S&P 500's consumer discretionary sector saw a more than 5% increase. The temporary deescalation in the trade war allows companies to avoid steep price increases, benefiting from the tariff pause. This move is part of efforts towards a longer-term trade agreement, with the U.S. reducing tariffs on Chinese imports to 30% and China cutting its tax on U.S. ",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for investors and deepens understanding of the impact of geopolitical events on the stock market. It also reports on the progress made in the U.S.-China trade war, which is a solution to a significant problem.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.593,
    "normalized_score": 10.0
  },
  {
    "title": "Top Stock Movers Now: Apple, NRG Energy, Newmont, and More",
    "domain": "business",
    "location": "global",
    "published": "Mon, 12 May 2025 15:58:11 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Kevin Carter / Getty Images A shopper walks a dog by an Apple store at the Westfield UTC shopping center on May 1, 2025 in San Diego, California.\" src=\"https://www.investopedia.com/thmb/QzgHdo2frnRyq_OVciwMJtCWTBs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2212371162-7a543bdc3e2c4fe392ee889e43c2046c.jpg\" title=\"Apple store\" /><figcaption><i><p>Kevin Carter / Getty Images</p> A shopper walks a dog by an Apple store at the Westfield UTC shopping center on May 1, 2025 in San Diego, California.</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>U.S. equities soared at midday following the agreement between the U.S. and China to lower tariffs for 90 days.</li><li>NRG Energy's first-quarter results easily topped estimates. Separately, the firm doubled its power generation capacity by purchasing key assets from LS Power for $12 billion.</li><li>The tariff news sent gold prices sinking, dragging shares of Newmont and other gold miners.</li></ul><br /><br /><p>U.S. equities soared at midday after the U.S. and China agreed to slash their tariffs for 90 days. The <a href=\"https://www.investopedia.com/terms/n/nasdaq.asp\">Nasdaq</a> jumped about 3.5%, while the <a href=\"https://www.investopedia.com/terms/d/djia.asp\">Dow Jones Industrial Average</a> and <a href=\"https://www.investopedia.com/terms/s/sp500.asp\">S&amp;P 500</a> were up more than 2%.</p><p>Shares of Apple (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AAPL\">AAPL</a>), Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>), Tesla (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TSLA\">TSLA</a>), and other tech companies with major business ties with China were up.</p><p>The tariff news also boosted shares of toolmaker Stanley Black &amp; Decker (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;SWK\">SWK</a>), which had recently warned the initial duties would significantly impact profits.</p><p>NRG Energy (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NRG\">NRG</a>) was the best-performing stock in the S&amp;P 500 as the nuclear power provider's first-quarter results easily exceeded estimates. Separately, the company purchased the natural gas generation and power plant platform from LS Power for about $12 billion, doubling its generation capacity.</p><p>Next Technology Holding (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NXTT\">NXTT</a>) soared for a second straight session after the company revealed it added 5,000 bitcoin to its portfolio this year and plans to add more.</p><p>Shares of Newmont (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NEM\">NEM</a>) and rival gold miners tumbled along with the price of the precious metal on the tariff deal. Gold had been soaring as a <a href=\"https://www.investopedia.com/terms/s/safe-haven.asp\">haven</a> for investors concerned about the effects of tariffs.</p><p>Shares of Cigna Group (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CI\">CI</a>) fell when the health insurer came under fire for denying coverage for a patient awaiting an experimental treatment for lung cancer. </p><p>Oil futures rose. The yield on the 10-year Treasury note advanced. The U.S. dollar gained on the euro, pound, and yen. Most major cryptocurrencies were lower. <br /></p><figure><img alt=\"TradingView\" src=\"https://www.investopedia.com/thmb/m0xC8VCbPFRpuf7M7TgqQeetkws=/fit-in/640x480/NRG_2025-05-12_11-18-14-c7a05c93e0c349e8acf01de297402274.png\" title=\"NRG\" /><figcaption><i><p>TradingView</p></i></figcaption></figure>"
    ],
    "image_url": "https://www.investopedia.com/thmb/QzgHdo2frnRyq_OVciwMJtCWTBs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2212371162-7a543bdc3e2c4fe392ee889e43c2046c.jpg",
    "titles": [
      "Top Stock Movers Now: Apple, NRG Energy, Newmont, and More"
    ],
    "summary": "U.S. equities experienced significant gains following a 90-day agreement between the U.S. and China to reduce tariffs, with the Nasdaq, Dow Jones, and S&P 500 all seeing increases. This announcement positively affected shares of tech companies like Apple, Nvidia, and Tesla, which have substantial business in China, as well as Stanley Black & Decker. NRG Energy outperformed in the S&P 500 after surpassing first-quarter estimates and doubling its power generation capacity with a $12 billion purchase from LS Power. Meanwhile, gold prices and related stocks, such as Newmont, declined due to the ta",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the current state of the stock market, highlighting specific companies that are performing well or poorly. However, it doesn't provide much insight into why these changes are happening or any potential solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 8.92
  },
  {
    "title": "Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 21:04:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/natural-mushroom-compound-shows-promise-in-treating-parkinsons-symptoms/\" rel=\"nofollow\" title=\"Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms\"><img alt=\"Parkinson&#039;s Hand Tremors\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Parkinsons-Hand-Tremors-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A pilot study by UCSF reveals unexpected results, with psilocybin therapy leading to significant improvements in mood, cognitive function, and motor symptoms. Psilocybin, a naturally occurring compound found in certain mushrooms, has shown potential in treating depression and anxiety. Researchers at UC San Francisco set out to explore whether psilocybin could also benefit individuals with [...]"
    ],
    "image_url": "",
    "titles": [
      "Natural Mushroom Compound Shows Promise in Treating Parkinson’s Symptoms"
    ],
    "summary": "A pilot study conducted by the University of California, San Francisco (UCSF) found that psilocybin therapy, which uses a compound found in certain mushrooms, resulted in significant improvements in mood, cognitive function, and motor symptoms in patients. This suggests psilocybin's potential for treating Parkinson’s symptoms, alongside its previously noted benefits for depression and anxiety.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a potential solution for treating Parkinson's symptoms, providing actionable insights for those affected by the disease, and increasing awareness about the potential use of natural compounds in medical treatments.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.736,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.506,
    "normalized_score": 4.79
  },
  {
    "title": "Scientists Have Found a Drug That Slashes Blood Pressure in Weeks",
    "domain": "science",
    "location": "global",
    "published": "Sun, 11 May 2025 20:35:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-have-found-a-drug-that-slashes-blood-pressure-in-weeks/\" rel=\"nofollow\" title=\"Scientists Have Found a Drug That Slashes Blood Pressure in Weeks\"><img alt=\"Measuring Blood Pressure\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Measuring-Blood-Pressure-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have discovered a promising new therapy for resistant high blood pressure, leading to a 15-point drop in systolic levels. Researchers at the University of California, San Diego School of Medicine have identified a potential new treatment for individuals with uncontrolled or treatment-resistant hypertension, a condition commonly referred to as high blood pressure. The investigational [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Have Found a Drug That Slashes Blood Pressure in Weeks"
    ],
    "summary": "Scientists at the University of California, San Diego School of Medicine have discovered a new drug that significantly reduces systolic blood pressure by 15 points in individuals with resistant high blood pressure. This promising therapy offers hope for those with treatment-resistant hypertension, potentially improving the management of the condition.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant innovation in the treatment of high blood pressure, which could be useful to those suffering from the condition. It provides a deeper understanding of potential medical advancements, making it constructive.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.729,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.504,
    "normalized_score": 4.67
  },
  {
    "title": "The EPA Will Likely Gut Team That Studies Health Risks From Chemicals",
    "domain": "science",
    "location": "global",
    "published": "Mon, 12 May 2025 15:29:32 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "Reorganizations at the EPA may get rid of the agency’s fundamental program for research around the risks of toxic chemicals."
    ],
    "image_url": "https://media.wired.com/photos/681b88fd3c3a66840c38ab63/master/pass/GettyImages-2212809340.jpg",
    "titles": [
      "The EPA Will Likely Gut Team That Studies Health Risks From Chemicals"
    ],
    "summary": "The Environmental Protection Agency (EPA) is considering reorganizations that could potentially eliminate its key program focused on researching the risks associated with toxic chemicals. This change is part of a broader review of the agency's structure and priorities.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story increases awareness about potential changes within the EPA and their potential impacts on public health. However, it does not provide solutions or empower the reader with actionable insights, making it somewhat less constructive.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.563,
    "normalized_score": 8.2
  },
  {
    "title": "15-Month-Old Babies Can Learn Words for Objects They’ve Never Seen",
    "domain": "science",
    "location": "global",
    "published": "Mon, 12 May 2025 14:06:21 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/15-month-old-babies-can-learn-words-for-objects-theyve-never-seen/\" rel=\"nofollow\" title=\"15-Month-Old Babies Can Learn Words for Objects They’ve Never Seen\"><img alt=\"Infant Baby Brain Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Infant-Baby-Brain-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The study presents new evidence that infants are capable of learning words solely through exposure to language. Human language enables us to learn the meanings of words for things we’ve never directly experienced. We do this effortlessly in everyday conversation, often using context to infer the meaning of unfamiliar words. But how early in life [...]"
    ],
    "image_url": "",
    "titles": [
      "15-Month-Old Babies Can Learn Words for Objects They’ve Never Seen"
    ],
    "summary": "A study has revealed that 15-month-old babies can learn the words for objects they have never seen before, demonstrating early language acquisition skills. This finding underscores the ability of infants to understand and learn new words through exposure to language, highlighting the human capacity to infer meanings of unfamiliar words from context.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it provides valuable insights into early language acquisition skills in infants, contributing to a deeper understanding of child development. It highlights the progress in scientific research on language learning and could be useful for parents, educators, and pediatricians.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.972,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.577,
    "normalized_score": 9.04
  },
  {
    "title": "How “Natural” Cinnamon Supplements Could Disrupt Your Health Regimen",
    "domain": "science",
    "location": "global",
    "published": "Mon, 12 May 2025 13:41:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/how-natural-cinnamon-supplements-could-disrupt-your-health-regimen/\" rel=\"nofollow\" title=\"How “Natural” Cinnamon Supplements Could Disrupt Your Health Regimen\"><img alt=\"Cinnamon Herb Drug Interactions\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"435\" src=\"https://scitechdaily.com/images/Cinnamon-Herb-Drug-Interactions-777x435.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers examine how cinnamon interacts with prescription medications. Cinnamon is one of the oldest and most widely used spices in the world, but a new study from the National Center for Natural Products Research suggests that a compound in cinnamon may interfere with certain prescription medications. In a study published in Food Chemistry: Molecular Sciences, [...]"
    ],
    "image_url": "",
    "titles": [
      "How “Natural” Cinnamon Supplements Could Disrupt Your Health Regimen"
    ],
    "summary": "A study by the National Center for Natural Products Research, published in Food Chemistry: Molecular Sciences, reveals that a compound found in cinnamon could potentially interfere with certain prescription medications. This research highlights the importance of considering dietary supplements, such as cinnamon, in the context of overall health and medication management.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about potential interactions between dietary supplements and prescription medications, which can be actionable for readers. It raises awareness about the importance of considering dietary supplements in the context of overall health and medication management. However, it doesn't report on solutions or improvements to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.967,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.566,
    "normalized_score": 8.38
  }
]