[
  {
    "title": "Bolsonaro Convicted of Coup Attempt, Sentenced to 27 Years",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 11 Sep 2025 15:13:28 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "NPR",
      "ABC News",
      "Deutsche Welle",
      "CNBC",
      "BBC",
      "CityNews",
      "Washington Post",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "ottawa.citynews.ca",
      "news.google.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "www.bbc.com",
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "A historic conviction: Brazil's Supreme Court delivers a majority vote to convict former President Jair Bolsonaro over a plot to overthrow the government.",
      "The former president has been found guilty of trying to mount coup to cling to power after he lost the election.",
      "Sentence comes shortly after a majority of justices voted to convict the former Brazilian leader on five charges.",
      "The majority of a panel of Supreme Court justices voted to convict the far-right former Brazilian leader of trying to overturn his election defeat to Lula da Silva in 2022. He was sentenced to 27 years in prison.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNcjU5cFFFU0QwWlBWSENibWZGNzlRZVVNc2JqR2VOOHNCRGZ5NmZBNlVqSmt2MzFsZUdqbmhjZDlUOUhwNTdScVpNRU9YQjIzZmNxbE91RG1wa3lUY1BMNUJRbS1hV21TMXRKR0NNZk55SXotX3NYTVp5NFY3WHZhSA?oc=5\" target=\"_blank\">Brazil's Bolsonaro gets 27-year jail sentence for cou",
      "A panel of Brazilian Supreme Court justices has sentenced former president Jair Bolsonaro to 27 years and three months in prison after convicting him of attempting a coup to remain in office despite his 2022 electoral defeat",
      "The chances of a near-term de-escalation between the U.S. and Brazil are low, Morningstar analysts said, adding the bilateral relationship is likely to deteriorate further.",
      "Brazil’s Supreme Court ruled the former president tried to reverse his 2022 election loss with a plot that included plans to assassinate President Luiz Inácio Lula da Silva.",
      "Brazil’s Supreme Court convicted the former president of trying to cling to power after losing the 2022 election, including a plan to assassinate his opponent.",
      "BRASILIA, Brazil (AP) — A panel of Brazilian Supreme Court justices sentenced former president Jair Bolsonaro to 27 years and three months in prison Thursday after convicting him of attempting a coup to remain in office despite his 2022 electoral defeat. Bolsonaro, who has always denied any wrongdoi"
    ],
    "image_url": "",
    "titles": [
      "Brazil's ex-President Bolsonaro sentenced to 27 years for coup plot",
      "Former president Bolsonaro sentenced to 27 years in prison for plotting Brazil coup",
      "Brazil Supreme Court sentences Bolsonaro to 27 years over coup plot",
      "Brazil: Bolsonaro sentenced to 27 years for attempted coup",
      "Brazil's Bolsonaro gets 27-year jail sentence for coup plot - Axios",
      "Brazil's Bolsonaro sentenced to more than 27 years in prison for coup attempt",
      "U.S. warns of response to 'witch hunt' after Brazil’s Bolsonaro sentenced to 27 years",
      "Bolsonaro sentenced to over 27 years in prison for coup plot in Brazil",
      "Bolsonaro Convicted of Attempting a Coup in Brazil, Sentenced to 27 Years in Prison",
      "Brazilian Supreme Court panel sentences Bolsonaro to more than 27 years in prison for coup attempt"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.764,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Brazilian President Jair Bolsonaro has been convicted by the country's Supreme Court for attempting a coup to stay in power after losing the 2022 election to Luiz Inácio Lula da Silva. The court found him guilty of plotting to overturn the election results, including plans to assassinate President Lula. Bolsonaro has been sentenced to 27 years and three months in prison.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Detained South Korean Workers Depart Georgia for Home Amid Uncertainty",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 11 Sep 2025 14:37:03 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "CNBC",
      "BBC",
      "Financial Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com",
      "www.bbc.com",
      "financialpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "A plane carrying more than 300 workers from South Korea who were detained during an immigration raid at a battery factory in Georgia last week left Atlanta around noon Thursday, bound for South Korea.",
      "Media and some protesters gather at the airport as more than 300 workers detained in the US last week return.",
      "The plane carrying workers detained in an immigration raid of a Georgia Hyundai-LG plant last week left the U.S., bound for South Korea.",
      "It is unclear when the South Korean detainees will be repatriated. They were previously scheduled to depart the United States on Wednesday.",
      "INCHEON, South Korea (AP) &#8212; More than 300 South Korean workers detained in an immigration raid in the United States last week were brought back home on a charter plane and reunited with their loved ones on Friday. They were among about 475 people detained during the Sept. 4 immigration raid at"
    ],
    "image_url": "",
    "titles": [
      "South Korean workers detained in immigration raid leave Atlanta and head home",
      "South Korean workers detained in US raid arrive home",
      "Plane carrying Hyundai, LG workers detained in immigration raid departs for South Korea",
      "Delayed Release of Workers Detained in Georgia Raid Fuels Anger in Korea",
      "South Korean workers released after days of detention in Georgia return home"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.754,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.812,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A plane with over 300 South Korean workers, detained in an immigration raid at a Hyundai-LG battery factory in Georgia, departed from Atlanta for South Korea on Thursday. The repatriation was initially planned for Wednesday but was delayed. The current status of their repatriation remains unclear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Hunts Suspect in Fatal Shooting of Activist Charlie Kirk at Utah Event",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 18:09:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "CNBC",
      "CityNews",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "news.google.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The FBI has released photos of a person of interest in the fatal shooting of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNRWpQY3RqQ0VJa0RjMExFOFpNN3N1aEsyQjZRb0otNlFxVUJxdHRwZUVwaHZwazFDcnRhMHNjdV93amJmbElIclBxYUdXQWJfSXhDNHhTQXd3bllzdTl2ZDA3dTQ1TmYwUzQtYkNTWlpoTk1pbVJqVE1oSW1IOVR4SjVWYzBpaWM4Rk5CeWdGaw?oc=5\" target=\"_blank\">Police release photo of person of",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE84NHlabDJMTFp5ZGwxX18wamhGSEhwOG5tSFY2c2lhaGhHVDMxdk83cVhuTjA0VXF0ZE5DXzg2b2ladWNSZGJmSWxkRmJxQ0lYcVNrWjNoX1RyOWlIVTBFRWtUSEpXVUtEZWUtWko3MjdZZi1RMVIwSWVkd1VRY2c?oc=5\" target=\"_blank\">Roblox removes \"over 100 experiences\" tied to Charlie Ki",
      "The FBI released images of a person of interest sought in connection with the fatal shooting of Charlie Kirk during an event at Utah Valley University on Wednesday.",
      "Kirk, a close ally of President Donald Trump, was killed by a gunman during a political event at Utah Valley University in Orem.",
      "Authorities said a \"high-powered, bolt-action rifle\" was recovered in a wooded area near the university where Charlie Kirk was shot on Wednesday.",
      "The shooter who assassinated&#160;conservative activist Charlie Kirk&#160;and then vanished off a roof and into the woods remained at large more than 24 hours later Thursday as federal investigators appealed for the public&#8217;s help by releasing photos of the person they believe is responsible. I"
    ],
    "image_url": "",
    "titles": [
      "FBI releases photos of person of interest in Charlie Kirk shooting",
      "Police release photo of person of interest in Charlie Kirk shooting death - Axios",
      "Roblox removes \"over 100 experiences\" tied to Charlie Kirk shooting - Axios",
      "WATCH:  FBI releases images of person of interest amid manhunt for Charlie Kirk's killer",
      "Charlie Kirk shooting: FBI shares person of interest photos, offers $100,000 reward",
      "FBI releases video, photos of 'person of interest' in Charlie Kirk shooter manhunt after rifle recovered",
      "FBI releases photos of person of interest in Charlie Kirk’s Utah university campus killing"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.747,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is actively searching for a person of interest in the fatal shooting of conservative activist Charlie Kirk, which occurred during a political event at Utah Valley University. Authorities have released photos of the suspect and recovered a high-powered, bolt-action rifle near the scene. Despite these developments, the shooter remains at large. Officials are offering a reward for information leading to the identification and arrest of the individual responsible for Kirk's death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk, Conservative Activist, Fatally Shot at Utah Event; Manhunt Ongoing",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 00:00:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "LA Times",
      "The Guardian",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.latimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A federal manhunt is under way for anyone involved in the assassination of the conservative commentator and Trump ally.",
      "The FBI said it is working alongside state and local law enforcement to \"to fully investigate and seek justice in the fatal shooting\" of Charlie Kirk.",
      "<p>‘We cannot do our job without the public’s help,’ Utah’s governor said, adding the FBI had received more than 7,000 leads and tips so far</p><p>In addition to the video, Utah officials have released the county dispatch audio on the moment police were alerted to the shooting of Charlie Kirk on Wed",
      "<p>FBI reward of $100,000 and direct appeals for public support appear to signal law enforcement’s continued struggles to identify the killer of Trump ally</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\">",
      "<p>Conservative activist and Trump ally was shot dead at a Utah Valley University event on Wednesday</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump\">Charlie Kirk shooting – latest updates</a></p></li><li>",
      "<p>Authorities said Thursday that they have fresh leads in their massive manhunt for a college-age person of interest in the fatal shooting of Charlie Kirk.</p>",
      "Utah Gov. Spencer Cox urged the public to help authorities with the investigation by sharing any information they may have."
    ],
    "image_url": "",
    "titles": [
      "LIVE: Charlie Kirk shot dead; new video, images of suspect shooter released",
      "Video shows Charlie Kirk shooting suspect jump down from roof, make getaway",
      "Charlie Kirk’s killer still at large as video of suspect released – live",
      "Charlie Kirk shooting: new video of suspect released by FBI amid urgent appeal for help from the public",
      "How the Charlie Kirk shooting unfolded – in maps, videos and images",
      "Authorities release video of Charlie Kirk shooting suspect jumping off roof",
      "Charlie Kirk Shooting: Authorities Release New Video Of Suspected Gunman, Seek Public Help (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.844,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, a conservative activist and ally of Donald Trump, was shot and killed during a speaking event at Utah Valley University. The incident led to widespread chaos, and a manhunt for the shooter is currently underway. The details surrounding the attack remain unclear. Kirk was the executive director of Turning Point USA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Judge Ties DiMaggio at 4th on Yankees' HR List with 361st Career Homer",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 02:50:29 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Just two days after passing Yogi Berra on the Yankees' all-time home run list, Aaron Judge hit two home runs Thursday to tie Joe DiMaggio for fourth with 361 career home runs.",
      "Judge belted the home run off the Tigers' Sawyer Gipson-Long",
      "<p>Yankees captain Aaron Judge hit his 361st career home run in the third inning Thursday night against the Detroit Tigers, tying Hall of Fame outfielder Joe DiMaggio for fourth place in franchise history.</p>"
    ],
    "image_url": "",
    "titles": [
      "Judge belts 2 HRs, ties DiMaggio on Yanks' list",
      "Yankees' Aaron Judge ties Joe DiMaggio on franchise home run list with career homer No. 361",
      "Aaron Judge tie Joe DiMaggio for Yankees homers in win over Tigers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Judge hit his 361st career home run, tying Joe DiMaggio for fourth on the Yankees' all-time list. This milestone was reached during a game against the Detroit Tigers, with the home run coming off pitcher Sawyer Gipson-Long.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Campus Police Review Event Security After Charlie Kirk's Killing",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 11 Sep 2025 21:41:20 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "How much security at a campus event is enough? Campus police are mulling the question.",
      "Why the right wing influencer was shot and what next for the US?",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOX2VidFVGc0pXSTNJNXpXU3pZZEJDMDdTeTAxLVhYeWozX0FBSVBQUzN3OFBVYkx3T09UeDNtYVFKU2UzSGJ0NFpxUlRMeWxGdDdZM1YxU25kcF9XSlczZVlydDcyb3dndkJ3MFJWQ1ZFMm8xMzhjSm02b0NEbmZCcktQZnY?oc=5\" target=\"_blank\">Charlie Kirk killing deepens America's violent s"
    ],
    "image_url": "",
    "titles": [
      "Charlie Kirk's killing raises the stakes for campus security",
      "Charlie Kirk's killing: A dangerous moment for America?",
      "Charlie Kirk killing deepens America's violent spiral - Axios"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.874,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Campus police are evaluating security levels for events amidst discussions on safety. Meanwhile, the killing of right-wing influencer Charlie Kirk has intensified debates on violence in America. The current focus is on reassessing security measures and understanding the implications of such incidents on national discourse.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Economy Stagnates with Manufacturing Hit, Faces 2025 Slowdown",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 07:41:52 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The economy failed to grow following the biggest contraction in manufacturing output for a year.",
      "Economists expect a slowdown to take hold of the U.K. in the latter half of 2025.",
      "Stagnation underlines challenge facing government in November Budget"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8122/live/765e3600-8d93-11f0-86a6-31d968008d8a.jpg",
    "titles": [
      "UK economy saw zero growth in July",
      "UK economy stalls in July, as slowdown sets in",
      "UK economy failed to grow in July"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.K. economy showed no growth after experiencing the largest decrease in manufacturing output in a year. Economists predict a slowdown in the latter half of 2025. This stagnation highlights the challenges the government faces for the November Budget.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Commanders' Ekeler Suffers Achilles Injury, MRI Scheduled",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 05:23:58 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Ekeler will have an MRI on Friday to determine the severity of the injury",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPT0paOEhteC1fUUZ6azJ4ZFlMU0Ztd0dreXFualVTUFY5a0tVdlpGZ3Nndnh2TW8xeGM3bXJsYWluRTFsM2RlNjFIWkI5ZTdMdDNvQjRkYWRMZ1NSQUxoZ0lyQldOdUIwblBGWllldlVZclJnSmwyTXRxZWdPMDhNQnZBTW1zTDY3el9SLVhDYw?oc=5\" target=\"_blank\">Commanders' Austin Ekeler Carted ",
      "<p>Running back Austin Ekeler was carted off the field against the Packers after suffering a non-contact Achilles injury. The team ruled him out for the remainder of the game. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/12/6472b95b-b2a3-4b3b-b7d1-614a7d895ef8/ekeler.jpg",
    "titles": [
      "Austin Ekeler injury: Commanders believe running back tore Achilles vs. Packers, per report",
      "Commanders' Austin Ekeler Carted Off Field After Achilles Injury - Sports Illustrated",
      "Report: Commanders RB Austin Ekeler suffers torn Achilles"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.944,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Austin Ekeler, a running back for the Commanders, was carted off the field with a non-contact Achilles injury during a game against the Packers and will not return to that game. He is scheduled for an MRI on Friday to assess the injury's severity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Microsoft Update Partnership for AI Collaboration",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 22:49:57 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE55bEFNZFUxcW11SV9kTGxiQ0h1NDIxLW1FLVY0RVdTcnZKTy1EYmZCRHVfdElLQzB4REd5VDVKaWhfVjdHZzFQbDNoOHYxLVdYUWlvd3lKNk1uV2lVWkgtOTMyQlJTcllHc0hPR2J2WEFHOFk?oc=5\" target=\"_blank\">OpenAI and Microsoft reach tentative deal to revise partnership</a>&nbsp",
      "OpenAI and Microsoft have reached a preliminary agreement over the terms of their partnership, moving forward a high-stakes AI alliance.",
      "Companies work to finalize terms as OpenAI pursues for-profit restructuring."
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Microsoft reach tentative deal to revise partnership - Axios",
      "OpenAI and Microsoft reach tentative deal after dispute over partnership terms",
      "OpenAI and Microsoft sign preliminary deal to revise partnership terms"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.806,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI and Microsoft have tentatively agreed to update their partnership terms, advancing their collaboration in artificial intelligence. Both parties are in the process of finalizing the agreement as OpenAI seeks to restructure into a for-profit entity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk Fatally Shot at Utah Speaking Event; Shooter College-Aged",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 03:25:05 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The FBI releases new pictures of a \"person of interest\" as a large manhunt is under way for the suspect.",
      "The right-wing pundit died from a single gunshot at a Utah campus event. Authorities say they have footage of the shooter, who \"appears to be of college age.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBFNEhoclJBZ1JFQjA3ZUphZGxtMWdoSFRvUGp2T1V0bFdHbjNkVElmd1VxUVJHQ1ZHZFhDOGhxRXJnOXlMclBxX3dpQTUtREhhWDRvOTRoTlFoTHNPME5GOEFTbWR6M1EtLTA3Q2tKMWh2WHlvQTN3UVl3?oc=5\" target=\"_blank\">Search ongoing for Charlie Kirk shooting suspect, rifle found n"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ac14/live/48996c50-8f08-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Rifle found but suspect still at large - what we know about the shooting",
      "Charlie Kirk shooting: Rifle found but killer still at large",
      "Search ongoing for Charlie Kirk shooting suspect, rifle found near campus - Axios"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.887,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, a 31-year-old right-wing activist and ally of Donald Trump, was fatally shot at a speaking event at Utah Valley University in Orem, Utah. Authorities are investigating the incident and have identified the shooter as appearing to be of college age, based on footage. Kirk died from a single gunshot wound during the political event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crawford Eyes Undisputed Champion Title Against Alvarez This Saturday",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 22:50:02 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportingnews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Crawford will become a three-weight-class undisputed champion if he beats Canelo",
      "How much will it cost fans to watch the Canelo-Crawford bout on Saturday night?",
      "We prepare you for Saturday's boxing match between Canelo Alvarez and Terence Crawford by looking at the betting odds, line movement, and offering picks and predictions."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/04/ca7d2c0d-caca-4987-b68e-119ead14d70e/canelo-alvarez-saul-terence-crawford-bud-zuffa-boxing-mma-news-today-sept-4-2025.jpg",
    "titles": [
      "Canelo Alvarez vs. Terence Crawford fight: Date, odds, start time, undercard, PPV price, complete guide",
      "Is Canelo Alvarez vs. Terence Crawford free on Netflix? Cost, live stream, start time for 2025 boxing fight",
      "Canelo Alvarez Vs. Terence Crawford Fight: Odds, Picks And Predictions"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.823,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Terence Crawford aims to become a three-weight-class undisputed champion in his upcoming match against Canelo Alvarez on Saturday. Fans interested in watching the bout will need to check the cost, as details were not provided. Pre-match analyses include betting odds, line movements, and expert predictions to guide viewers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acquitted Players Eligible to Sign with NHL Teams After Suspension",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 21:18:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawa.citynews.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Five Hockey Canada players were charged with sexual assault before being acquitted in July",
      "<p>The NHL and NHLPA have agreed that the five players acquitted in the 2018 sexual assault trial will be suspended until Dec. 1, although they will have the opportunity to sign with NHL teams as soon as Oct. 15, Sportsnet has learned.</p>",
      "The five players acquitted in the Hockey Canada sexual assault trial can return to the NHL when their suspensions end &#8220;no sooner&#8221; than Dec. 1, the NHL announced Thursday. The players, who are all unrestricted free agents, can sign with a team on Oct. 15 as they wait for full reinstatemen"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/11/11817eee-2006-4f54-b2b0-3edfe614f3a4/hockeycanada.jpg",
    "titles": [
      "NHL issues suspension to Hockey Canada players acquitted in 2018 sexual assault trial",
      "NHL suspends players acquitted in 2018 sexual assault trial until Dec. 1",
      "NHL suspends players acquitted in 2018 sexual assault trial until Dec. 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.797,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Five players, previously charged and then acquitted of sexual assault from a 2018 incident, will be eligible to sign with NHL teams starting October 15. They will be suspended until December 1, following an agreement between the NHL and NHLPA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas Aces Set WNBA Record in 103-75 Win, Secure 16th Straight Victory",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 02:50:29 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Aces head into the playoffs with a full head of steam after hitting a WNBA record 22 3-pointers in their 16th consecutive win Thursday night in their regular-season finale.",
      "<p>A’ja Wilson had 23 points and 19 rebounds, Jewell Loyd added 21 points and the Las Vegas Aces made a single-game WNBA record 22 3-pointers in their 16th consecutive win, 103-75 over the Los Angeles Sparks on Thursday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Aces close with record 22 3s in 16th straight win",
      "Aces set WNBA record with 22 3-pointers in win over Sparks"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Las Vegas Aces set a WNBA record with 22 3-pointers in a 103-75 win over the Los Angeles Sparks, marking their 16th consecutive victory. A’ja Wilson contributed 23 points and 19 rebounds, while Jewell Loyd added 21 points. This win concluded their regular season, propelling them into the playoffs with significant momentum.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jonathan Toews Prepares for NHL Return After 2-Year Break",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 12 Sep 2025 01:36:54 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Jets forward Jonathan Toews is skating with his new teammates ahead of next week's training camp.",
      "<p>Jonathan Toews is embarking on the next phase of his goal to return to the NHL after a two-year absence due to illness.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/3d31c3d25e078a099dca176acaf8637e925b4987df5a51cc0e242bd6c375078d.jpg?quality=65&strip=all",
    "titles": [
      "Jonathan Toews skates with hometown Jets ahead of comeback season",
      "Jonathan Toews skates with hometown Jets ahead of comeback season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jonathan Toews, a Jets forward, is preparing for his return to the NHL after a two-year hiatus caused by illness. He has begun skating with his new teammates before the upcoming training camp next week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Packers' Jayden Reed Suffers Broken Collarbone in Uncounted Play",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 02:50:29 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Packers receiver Jayden Reed broke his collarbone on a play that didn't count during the opening drive of Thursday's 27-18 win against the Commanders at Lambeau Field.",
      "<p>The Green Bay Packers will be without wide receiver Jayden Reed for the foreseeable future.</p>"
    ],
    "image_url": "",
    "titles": [
      "WR Reed breaks collarbone in Packers' victory",
      "Packers’ Jayden Reed suffers fractured collarbone vs. Commanders"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jayden Reed, a wide receiver for the Green Bay Packers, suffered a broken collarbone during a play that was ultimately not counted in Thursday's game against the Commanders at Lambeau Field. The injury occurred during the opening drive, leading to a 27-18 victory for the Packers. Reed will be sidelined for an indefinite period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Packers Secure 27-18 Victory Over Commanders, Continue Strong Season Start",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 00:28:13 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.bbc.com",
      "www.espn.com"
    ],
    "snippets": [
      "Remember when the Packers couldn't beat any playoff-caliber teams? Not anymore, after their last two wins.",
      "The Green Bay Packers maintain their impressive start to the new NFL season by claiming a 27-18 win over the Washington Commanders."
    ],
    "image_url": "",
    "titles": [
      "Packers continue impressive start to season with victory over Commanders",
      "Packers beat Commanders to maintain winning start"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Green Bay Packers have improved their performance, securing a 27-18 victory against the Washington Commanders. This win continues their strong start to the NFL season, demonstrating their ability to compete against playoff-caliber teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince Harry Visits Kyiv, Pledges Support for Wounded Soldiers",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 07:24:02 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia.",
      "<p>Exclusive: Prince and team from his Invictus Games Foundation were invited to Kyiv and will detail new initiatives to support wounded</p><p>Prince Harry has made a surprise visit to Kyiv after an invitation from the Ukrainian government, saying he wanted to do “everything possible” to help the re"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ad7d/live/fdd52f50-8fa8-11f0-a14f-a32aad03416f.jpg",
    "titles": [
      "Prince Harry vows to help war injured during surprise visit to Ukraine",
      "Prince Harry makes surprise visit to Ukraine pledging support for thousands injured in war"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince Harry visited Kyiv, Ukraine, following an invitation from the Ukrainian government. He expressed a desire to aid the recovery of military personnel injured in the war with Russia. During his visit, he and his Invictus Games Foundation team announced new initiatives to support wounded soldiers, emphasizing his commitment to assisting in their rehabilitation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyclone Freddy Destroys Malawian Farmer's Lifelong Work",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 12 Sep 2025 04:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Financial Post",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "financialpost.com"
    ],
    "snippets": [
      "Alex Maere survived the destruction of Cyclone Freddy when it tore through southern Malawi in 2023. His farm didn't.",
      "MULANJE, Malawi (AP) &#8212; Alex Maere survived the destruction of Cyclone Freddy when it tore through southern Malawi in 2023. His farm didn&#8217;t. The 59-year-old saw decades of work disappear with the precious soil that the floods stripped from his small-scale farm in the foothills of Mount Mu"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-malawi-is-taking-a.jpg",
    "titles": [
      "How Malawi is taking AI technology to small-scale farmers who don't have smartphones",
      "How Malawi is taking AI technology to small-scale farmers who don’t have smartphones"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In 2023, Cyclone Freddy devastated southern Malawi, significantly impacting Alex Maere, a 59-year-old farmer. While Maere survived the cyclone, his farm, located in the foothills of Mount Mulanje, was destroyed. Decades of his work were lost as the floods caused by the cyclone stripped away the soil, ruining his agricultural livelihood.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Ambassador Mandelson Dismissed Over Epstein Ties",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 12:03:57 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Washington Post",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOMGE3clNfTVROTmlZRzRLeEZSeExTYUFvN1FoTENuckdGRlR5UWJYM1Q5RHk2TXBYR1V1bnJ1SzVuSVpPVlQtOUhyUVdSYlBid2tkLTl6UlZuVVZQUVlRZ284cjJ6NEF2VXFzaUJTbVZ0UFRJMmZya0hhRkVaM1ZnWWJTUGc1UQ?oc=5\" target=\"_blank\">U.K. fires ambassador to the U.S. over Epstei",
      "British Prime Minister Keir Starmer fired Peter Mandelson after diplomats said “additional information” emerged about his links with sex offender Jeffrey Epstein.",
      "The British government said it withdrew the envoy after newly revealed emails showed the depth of his relationship with Jeffrey Epstein."
    ],
    "image_url": "",
    "titles": [
      "U.K. fires ambassador to the U.S. over Epstein revelations - Axios",
      "U.K. dismisses ambassador to U.S. over links to Jeffrey Epstein",
      "U.K. Ambassador to U.S., Peter Mandelson, Fired Over Epstein Links"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.644,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Peter Mandelson has been dismissed from his role as a U.K. ambassador due to his close relationship with the late sex offender Jeffrey Epstein. This decision came after leaked emails revealed Mandelson expressing a deep friendship with Epstein, referring to him as his \"best pal\" and expressing distress over Epstein's situation. The British government, led by Prime Minister Keir Starmer, acted after additional information about Mandelson's connections with Epstein emerged, including further anticipated correspondence. Mandelson's dismissal follows intense criticism and scrutiny over his ties to",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Adobe Shares Fall in 2023 Despite Beating Wall Street Forecasts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 02:43:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Adobe shares have dropped this year, badly underperforming the broader market.",
      "The software company exceeds Wall Street’s revenue and earnings estimates, with AI-influenced revenue streams picking up steam"
    ],
    "image_url": "",
    "titles": [
      "Adobe's stock gains on earnings, revenue beat",
      "Adobe’s earnings beat shows investors that AI is finally paying off, and the stock rises"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Adobe's shares have fallen significantly in 2023, lagging behind the broader market performance. Despite this, the company has surpassed Wall Street's expectations for revenue and earnings, partly due to the growth of AI-influenced revenue streams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI, Microsoft Revise Partnership Ahead of Potential IPO",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 23:48:48 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.ft.com"
    ],
    "snippets": [
      "Nonbinding term marks progress in talks to enable ChatGPT maker’s eventual IPO",
      "OpenAI and Microsoft say they reached a nonbinding agreement on a revised partnership."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F676164a8-92e8-4773-b692-99c0a63638a3.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "OpenAI and Microsoft sketch out deal to unlock for-profit restructuring",
      "OpenAI secures Microsoft’s blessing to transition its for-profit arm"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.823,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI and Microsoft have reached a non-binding agreement on a revised partnership, marking progress in discussions aimed at facilitating OpenAI's potential future Initial Public Offering (IPO).",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paramount Skydance Eyes Takeover of Warner Bros. Discovery",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 22:24:07 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOby1DalpHTVNJdFF4aUxYY0tkWjdUdS1USzRpQjhWM3pLa24yQm9HYTE3WjZ3a3hUQnNGbnh4TnFYNzBPaXdiWVRzX2NJeThJa0dYZFZWcTU1dUx6YXlJcjAxblhMRGtBdW5YcDZfVk45T3JhQ1lOczBFb3NNVEloVHlYREoxZw?oc=5\" target=\"_blank\">Warner Bros. Discovery stock soars on Paramou",
      "The Wall Street Journal reported the recently merged Paramount Skydance was preparing a takeover bid for the entirety of WBD.",
      "Paramount Skydance CEO and Chairman David Ellison could buy Warner Bros. Discovery and add major TV and film franchises as well as sports rights to his empire."
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. Discovery stock soars on Paramount Skydance interest - Axios",
      "Paramount Skydance is preparing a bid for Warner Bros. Discovery, sources say",
      "Here's what Paramount Skydance would be buying in a deal for Warner Bros. Discovery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.799,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paramount Skydance, led by CEO David Ellison, is reportedly preparing a takeover bid for Warner Bros. Discovery (WBD), aiming to merge two major media conglomerates. The deal would include assets like CNN, HBO, and the studios behind Barbie and Harry Potter. This move could significantly expand Ellison's media empire, incorporating a wide range of TV, film franchises, and sports rights. The bid is said to be primarily in cash, backed by the wealthy Ellison family.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Forbes Summit: Leaders Focus on Empowering Young Women and Female Athletes",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 20:39:33 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Meredith Maskara and Girl Scouts speak to investing and mentoring young women in Tomorrow's Power Women at the 2025 Forbes Power Women's Summit.",
      "At the 2025 Forbes Power Women's Summit, Stephanie Marciano, Head of Brand &amp; Sports Marketing, Ally , Renee Montgomery, 2x WNBA Champion &amp; Co-owner, Atlanta Dream and Midge Purce, Forward, Gotham FC talk women's sports viewership, and the future positive investments in women's sports."
    ],
    "image_url": "https://img.connatix.com/d6f2b18a-48af-446f-bce0-31011a2e52a4/1_th.jpg",
    "titles": [
      "2025 Forbes Power Women's Summit | Tomorrow’s Power Women",
      "2025 Forbes Power Women's Summit | Women Powering The Sports Revolution"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.855,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the 2025 Forbes Power Women's Summit, leaders including Meredith Maskara discussed investing in and mentoring young women for future leadership. Additionally, figures like Stephanie Marciano, Renee Montgomery, and Midge Purce engaged in a dialogue about increasing viewership and investments in women's sports, highlighting the growing recognition and support for female athletes and their contributions to the sports industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  }
]