[
  {
    "title": "WATCH:  Multiple fire departments battle large brush fire on Cape Cod, Massachusetts",
    "domain": "general",
    "location": "national",
    "published": "Thu, 01 May 2025 21:17:27 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "What started as a controlled burn at Joint Base Cape Cod has exploded into a major brush fire in Sandwich, Massachusetts."
    ],
    "image_url": "https://s.abcnews.com/images/WNT/250501_wn_vo_fire_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Multiple fire departments battle large brush fire on Cape Cod, Massachusetts"
    ],
    "summary": "A controlled burn at Joint Base Cape Cod escalated into a significant brush fire in Sandwich, Massachusetts. The situation has moved beyond the initial containment efforts, leading to an expanded emergency response to address the blaze.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a significant brush fire in Cape Cod, Massachusetts. However, it lacks depth and actionable insights for the reader. It does not discuss the causes, potential solutions, or the broader impacts of such incidents.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.683,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.451,
    "normalized_score": 3.11
  },
  {
    "title": "WATCH:  Woman in Australia hangs out with mob of kangaroos",
    "domain": "general",
    "location": "national",
    "published": "Thu, 01 May 2025 20:27:01 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "A woman in Australia struck a pose with her new friends — a mob of kangaroos who were content to just hang out with her."
    ],
    "image_url": "https://s.abcnews.com/images/International/250501_abc_social_kangaroo_vert_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Woman in Australia hangs out with mob of kangaroos"
    ],
    "summary": "In Australia, a woman took a photo posing with a group of kangaroos. The kangaroos appeared calm and were willing to be near her, allowing for a unique interaction. This incident highlights a peaceful encounter between humans and wildlife in the region.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers a basic awareness of a peaceful encounter between a woman and a group of kangaroos in Australia. However, it doesn't provide any deeper understanding, actionable insights, or context about the relationship between humans and wildlife in the region.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.672,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.427,
    "normalized_score": 1.87
  },
  {
    "title": "Lethbridge Hurricanes reflect on 2024/25 season",
    "domain": "general",
    "location": "national",
    "published": "Fri, 02 May 2025 23:55:36 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Following a third-round sweep by the Medicine Hat Tigers, the Lethbridge Hurricanes are saying goodbye to some players, while others look ahead to next season."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/WHL-PLAYOFFS-LOGO.bmp",
    "titles": [
      "Lethbridge Hurricanes reflect on 2024/25 season"
    ],
    "summary": "The Lethbridge Hurricanes were eliminated from the playoffs after a third-round sweep by the Medicine Hat Tigers. As a result, the team is parting ways with some of its players, while those remaining are preparing for the next season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Lethbridge Hurricanes' performance and their future plans in response to their elimination from the playoffs. However, it does not report on any solutions, improvements, or innovations, nor does it increase clarity around systems or trends in the sport.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 8.5
  },
  {
    "title": "'Unparalleled' snake antivenom made from man bitten 200 times",
    "domain": "general",
    "location": "global",
    "published": "Fri, 02 May 2025 23:48:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Scientists hope to make a universal antivenom from the extraordinary blood of a man exposed to snake venom for decades."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d853/live/fe6df930-2737-11f0-afbf-ddff77f40225.jpg",
    "titles": [
      "'Unparalleled' snake antivenom made from man bitten 200 times"
    ],
    "summary": "Scientists are working on creating a universal antivenom using the unique blood of a man who has been exposed to snake venom for many years. This innovative approach aims to provide a more effective treatment against snake bites globally.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovative solution to a global problem, providing readers with insights into the progress being made in the field of antivenom development. It increases awareness about the potential for a universal antivenom and the unique approach being used.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.584,
    "normalized_score": 10.0
  },
  {
    "title": "Saskatchewan’s front-line physicians press ministers for action, answers",
    "domain": "general",
    "location": "national",
    "published": "Fri, 02 May 2025 23:48:19 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Saskatchewan doctors pressed provincial health ministers for answers on staffing, outdated tech, and called for more say in how care is delivered across the province."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/SMA-ASSEMBLY.bmp",
    "titles": [
      "Saskatchewan’s front-line physicians press ministers for action, answers"
    ],
    "summary": "Saskatchewan doctors have approached provincial health ministers seeking resolutions for issues such as staffing shortages, the use of outdated technology, and have requested greater involvement in decision-making processes regarding healthcare delivery across the province.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is informative and provides context for understanding the challenges facing healthcare delivery in Saskatchewan. It doesn't specifically report on solutions or progress, but it does highlight the steps being taken by physicians to address these issues, which could lead to improvements in the future.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.564,
    "normalized_score": 8.96
  },
  {
    "title": "Which players are most deserving of winning the Stanley Cup?",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 2 May 2025 19:51:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Using a proprietary formula, we've determined the most worthy contenders this postseason, led by Brent Burns."
    ],
    "image_url": "",
    "titles": [
      "Which players are most deserving of winning the Stanley Cup?"
    ],
    "summary": "A proprietary formula has identified the top contenders for this postseason, with Brent Burns leading the pack. The method and criteria used for this determination remain undisclosed, but Burns has been highlighted as a standout player in the analysis.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story may interest sports fans, it offers minimal depth or insight. The criteria used for determining the top contenders are not disclosed, limiting its usefulness. It doesn't report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.488,
    "normalized_score": 5.03
  },
  {
    "title": "Stanley Cup playoffs daily: Preview for Jets-Blues Game 6",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 2 May 2025 19:51:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Can Winnipeg close it out, or will there be a Game 7? Plus, recaps and three stars from a busy Thursday."
    ],
    "image_url": "",
    "titles": [
      "Stanley Cup playoffs daily: Preview for Jets-Blues Game 6"
    ],
    "summary": "The outcome of whether Winnipeg can secure a series win or if a Game 7 will be necessary remains undecided. The article also provides recaps and highlights the three standout players from a series of games that took place on Thursday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the upcoming Jets-Blues game and recaps of previous games. However, it lacks depth or insight into the strategies or dynamics that might influence the outcome of the game. It doesn't provide actionable insights or deeper understanding for the reader.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.496,
    "normalized_score": 5.44
  },
  {
    "title": "O's GM on pitching collapse: 'My responsibility'",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 2 May 2025 19:50:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Orioles general manager Mike Elias took responsibility for the collapse of Baltimore's starting rotation, which has been a factor in the team's struggles this season."
    ],
    "image_url": "",
    "titles": [
      "O's GM on pitching collapse: 'My responsibility'"
    ],
    "summary": "Orioles General Manager Mike Elias acknowledged his role in the failure of Baltimore's starting pitching rotation, attributing it as a significant reason for the team's poor performance this season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the acknowledgment of responsibility by the Orioles' General Manager for the team's poor performance, providing some insight into the dynamics within the team. However, it doesn't suggest any solutions or improvements, nor does it provide a deeper understanding of the systemic issues that led to the pitching collapse.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.538,
    "normalized_score": 7.62
  },
  {
    "title": "Grizzlies name Iisalo as coach after interim stint",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 2 May 2025 19:50:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "The Grizzlies have hired Tuomas Iisalo as the franchise's next head coach after he led Memphis into the playoffs following the late-season firing of Taylor Jenkins."
    ],
    "image_url": "",
    "titles": [
      "Grizzlies name Iisalo as coach after interim stint"
    ],
    "summary": "The Memphis Grizzlies have appointed Tuomas Iisalo as their new head coach, following his role in guiding the team into the playoffs after Taylor Jenkins was dismissed late in the season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the appointment of a new head coach for the Memphis Grizzlies. However, it doesn't provide any actionable insights or deeper understanding about the decision-making process behind the appointment, or how this change might affect the team's future performance.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.508,
    "normalized_score": 6.06
  },
  {
    "title": "Source: LeBron suffered MCL sprain in G5 loss",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 2 May 2025 19:50:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Lakers star LeBron James suffered a Grade 2 MCL sprain in his left knee in the fourth quarter of Wednesday's Game 5 loss to the Timberwolves, a source told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Source: LeBron suffered MCL sprain in G5 loss"
    ],
    "summary": "LeBron James, a star player for the Lakers, incurred a Grade 2 MCL sprain in his left knee during the fourth quarter of Game 5 against the Timberwolves, leading to a loss for his team. This information was confirmed by a source to ESPN.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an event in the sports world, but it doesn't offer much depth or insight beyond the fact that LeBron James was injured during a game. It doesn't contribute to the reader's understanding or decision-making in a significant way.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.941,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.496,
    "normalized_score": 5.44
  },
  {
    "title": "United cuts Newark schedule after hundreds of flight disruptions, blaming FAA staffing, technology problems",
    "domain": "business",
    "location": "national",
    "published": "Fri, 02 May 2025 23:06:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "United Airlines said FAA staffing and technology problems have contributed to hundreds of flight delays this week."
    ],
    "image_url": "",
    "titles": [
      "United cuts Newark schedule after hundreds of flight disruptions, blaming FAA staffing, technology problems"
    ],
    "summary": "United Airlines reported that FAA staffing shortages and technological issues have led to significant flight delays this week, affecting hundreds of flights.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about an ongoing issue with United Airlines, providing context about why the airline is experiencing delays. It could be useful to passengers planning to fly with United in the near future. However, it doesn't report on any solutions or improvements to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.551,
    "normalized_score": 8.29
  },
  {
    "title": "Nigel Farage’s Reform UK hammers Tories and Labour in local election rout",
    "domain": "business",
    "location": "global",
    "published": "Fri, 02 May 2025 22:46:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Big two parties lose ground while rightwing rival surges in council and mayoral polls"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Facdc1ccf-8ee7-4ef6-9ba4-970c430c87ce.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Nigel Farage’s Reform UK hammers Tories and Labour in local election rout"
    ],
    "summary": "In recent council and mayoral elections, the two major political parties experienced a decline in support, while a right-wing rival saw a significant increase in its voter base. This shift indicates a change in the political landscape, with the right-wing party gaining ground in local government positions.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about a shift in the political landscape in the UK, which could help readers understand future political developments. It also increases awareness about the causes and impacts of these changes. However, it doesn't highlight any solutions or progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.982,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.57,
    "normalized_score": 9.27
  },
  {
    "title": "In Wall Street’s epic comeback, unsolved market mysteries abound",
    "domain": "business",
    "location": "global",
    "published": "Fri, 02 May 2025 22:19:28 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The financial ecosystem is flashing warning signs for the likes of hedge funds and day traders plunging back into risk."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2212034566-e1746224036327.jpg?w=2048",
    "titles": [
      "In Wall Street’s epic comeback, unsolved market mysteries abound"
    ],
    "summary": "The financial ecosystem is currently showing warning signs, indicating potential risks for hedge funds and day traders who are re-engaging in high-risk investments.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful insights into the current state of the financial ecosystem, which can be helpful for readers involved in the financial sector. However, it does not report on any solutions or improvements and does not deeply increase clarity around the system.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.976,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.548,
    "normalized_score": 8.13
  },
  {
    "title": "United to cut Newark operations as FAA issues snarl flights",
    "domain": "business",
    "location": "global",
    "published": "Fri, 02 May 2025 22:01:36 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The “long-simmering FAA challenges boiled over this week,” United Chief Executive Officer Scott Kirby said in a letter to customers Friday."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2203159557-e1746222984535.jpg?w=2048",
    "titles": [
      "United to cut Newark operations as FAA issues snarl flights"
    ],
    "summary": "United Airlines CEO Scott Kirby addressed ongoing FAA issues in a recent letter to customers, indicating that the challenges the Federal Aviation Administration has been facing have intensified this week. Kirby's statement suggests a significant impact on the airline's operations due to these challenges.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing FAA issues and their impact on United Airlines' operations. However, it doesn't provide actionable insights for the reader, nor does it report on any solutions or improvements to the situation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.971,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.537,
    "normalized_score": 7.56
  },
  {
    "title": "Waltz used Signal-like app at White House day before ouster as national security advisor",
    "domain": "business",
    "location": "national",
    "published": "Fri, 02 May 2025 21:46:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "President Trump recently discouraged the use of the Signal app after controversy over a group chat of administration officials detailed military plans."
    ],
    "image_url": "",
    "titles": [
      "Waltz used Signal-like app at White House day before ouster as national security advisor"
    ],
    "summary": "President Trump has advised against using the Signal app following a controversy involving a group chat among administration officials that exposed military plans. This stance comes after sensitive information was reportedly shared within the app's chat feature.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the potential risks associated with using certain communication apps, which could be useful for readers. However, it does not report on any solutions to the problem or provide a deeper understanding of the issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.968,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.546,
    "normalized_score": 8.03
  },
  {
    "title": "Is your heart aging too fast?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 01 May 2025 22:56:34 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Researchers have developed a revolutionary new way to find out the 'true age' of your heart using MRI. A new study shows how an MRI scan can reveal your heart's functional age -- and how unhealthy lifestyles can dramatically accelerate this figure. It is hoped that the findings could transform how heart disease is diagnosed -- offering a lifeline to millions by catching problems before they become deadly. The team say their cutting-edge technique is a 'game changer'."
    ],
    "image_url": "",
    "titles": [
      "Is your heart aging too fast?"
    ],
    "summary": "Researchers have developed a method to determine the 'true age' of the heart using MRI scans, showing how lifestyle choices can accelerate heart aging. This technique, described as a 'game changer,' could revolutionize heart disease diagnosis by identifying issues early, potentially saving millions of lives. The study highlights the potential of MRI in revealing the heart's functional age and the impact of unhealthy lifestyles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.651,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.391,
    "normalized_score": 0.0
  },
  {
    "title": "This Giant Telescope Shoots Lasers Into Space – And It’s Brilliant",
    "domain": "science",
    "location": "global",
    "published": "Fri, 02 May 2025 23:28:08 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-giant-telescope-shoots-lasers-into-space-and-its-brilliant/\" rel=\"nofollow\" title=\"This Giant Telescope Shoots Lasers Into Space – And It’s Brilliant\"><img alt=\"ESO Very Large Telescope UT4 Four Laser Beams\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/ESO-Very-Large-Telescope-UT4-Four-Laser-Beams-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>At the Paranal Observatory, the UT4 telescope doesn&#8217;t just stargaze—it actively creates its own stars using powerful lasers to battle atmospheric turbulence. Thanks to its advanced adaptive optics system, UT4 delivers incredibly sharp images from the ground, rivaling the view from space. A Majestic Night at Paranal This majestic image captures a stunning view of [...]"
    ],
    "image_url": "",
    "titles": [
      "This Giant Telescope Shoots Lasers Into Space – And It’s Brilliant"
    ],
    "summary": "The UT4 telescope at the Paranal Observatory uses powerful lasers to create artificial stars, combating atmospheric turbulence. This technique, part of its advanced adaptive optics system, allows UT4 to produce exceptionally sharp images from the ground, comparable to those taken from space. This innovation enhances the telescope's ability to observe celestial objects with remarkable clarity.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant improvement in telescope technology. It provides a deeper understanding of how the UT4 telescope uses lasers to combat atmospheric turbulence, thereby enhancing its ability to produce sharp images. This contributes meaningfully to the reader's understanding of technological advancements in space observation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.991,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 9.95
  },
  {
    "title": "James Webb Unveils “Torch Dragon,” a Galaxy That Shouldn’t Exist Yet",
    "domain": "science",
    "location": "global",
    "published": "Fri, 02 May 2025 23:03:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/james-webb-unveils-torch-dragon-a-galaxy-that-shouldnt-exist-yet/\" rel=\"nofollow\" title=\"James Webb Unveils “Torch Dragon,” a Galaxy That Shouldn’t Exist Yet\"><img alt=\"Zhúlóng Galaxy Location\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"308\" src=\"https://scitechdaily.com/images/Zhulong-Galaxy-Location-777x308.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Astronomers using the James Webb Space Telescope have discovered Zhúlóng, the most distant known spiral galaxy, existing just one billion years after the Big Bang. Defying expectations, Zhúlóng already sports a mature, Milky Way–like structure, showing that spiral arms and organized galactic forms can arise far earlier than previously believed. Its discovery through the groundbreaking [...]"
    ],
    "image_url": "",
    "titles": [
      "James Webb Unveils “Torch Dragon,” a Galaxy That Shouldn’t Exist Yet"
    ],
    "summary": "Astronomers have discovered the most distant known spiral galaxy, named Zhúlóng, using the James Webb Space Telescope. Existing just one billion years after the Big Bang, Zhúlóng's mature, Milky Way–like structure challenges previous beliefs, indicating that spiral arms and organized galactic forms can develop much earlier than thought.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into a significant discovery in astronomy that challenges previous beliefs. It increases clarity around the development of galactic forms and the capabilities of the James Webb Space Telescope. However, it does not explicitly highlight solutions or progress in addressing a problem, hence the slightly lower score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.571,
    "normalized_score": 9.33
  },
  {
    "title": "Alien Earths Everywhere: How Cosmic Light Revealed a Universe of Hidden Worlds",
    "domain": "science",
    "location": "global",
    "published": "Fri, 02 May 2025 22:38:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/alien-earths-everywhere-how-cosmic-light-revealed-a-universe-of-hidden-worlds/\" rel=\"nofollow\" title=\"Alien Earths Everywhere: How Cosmic Light Revealed a Universe of Hidden Worlds\"><img alt=\"Earth Like Exoplanets Common Across Cosmos\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Earth-Like-Exoplanets-Common-Across-Cosmos-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Super-Earths, larger planets similar to Earth, are far more common across the universe than scientists previously believed, according to a groundbreaking microlensing study using KMTNet telescopes. Researchers discovered that these planets can orbit their stars at vast distances, similar to gas giants like Jupiter, hinting at a hidden abundance of alien worlds. Using rare cosmic [...]"
    ],
    "image_url": "",
    "titles": [
      "Alien Earths Everywhere: How Cosmic Light Revealed a Universe of Hidden Worlds"
    ],
    "summary": "A groundbreaking study using KMTNet telescopes has found that Super-Earths, planets larger but similar to Earth, are much more common in the universe than previously thought. Researchers discovered these planets often orbit their stars from great distances, similar to gas giants such as Jupiter, suggesting a vast, previously unseen abundance of alien worlds.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it contributes to the reader's understanding of the universe, specifically the prevalence of Super-Earths. It reports on a significant innovation in the field of astronomy and offers actionable insights into the nature of these planets.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.98,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.58,
    "normalized_score": 9.79
  },
  {
    "title": "Disastrous back-to-back heatwaves and droughts surge across Eurasia",
    "domain": "science",
    "location": "global",
    "published": "Fri, 02 May 2025 20:00:11 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Regions from Ukraine to Mongolia are seeing a spike in paired heatwave-drought events as climate change alters weather patterns across the planet"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/01155654/SEI_249542526.jpg",
    "titles": [
      "Disastrous back-to-back heatwaves and droughts surge across Eurasia"
    ],
    "summary": "Regions stretching from Ukraine to Mongolia are experiencing an increase in simultaneous heatwave-drought events, a consequence of shifting weather patterns attributed to climate change. This trend underscores the growing impact of global warming on diverse ecosystems and human communities across these areas.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the impact of climate change on weather patterns, ecosystems, and human communities. It raises awareness about the severity of global warming, although it doesn't highlight specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.929,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.554,
    "normalized_score": 8.45
  }
]