[
  {
    "title": "South Korea to Repatriate 300 Workers Detained in ICE Raid at Hyundai-LG in Geor",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 07:13:08 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Business Insider",
      "NPR",
      "CityNews",
      "Financial Times",
      "Fortune",
      "Washington Post"
    ],
    "domains": [
      "fortune.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.businessinsider.com",
      "www.ft.com",
      "ottawa.citynews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "More than 300 South Korean workers were detained in an immigration raid on Thursday. Presidential chief of staff Kang Hoon-sik said South Korea plans to send a charter plane to bring the workers home.",
      "Hyundai-LG site in Georgia targeted in biggest ICE operation of Trump’s administration",
      "South Korea said it intends to repatriate the workers, after more than 300 of its nationals were detained during an immigration raid on a factory in Georgia.",
      "The South Korean government said on Sunday that it would send a charter plane to the United States to retrieve hundreds of workers detained in an immigration raid.",
      "South Korea plans to send a charter plane to bring the workers home as soon as remaining administrative steps are completed.",
      "SEOUL, South Korea (AP) — More than 300 South Korean workers detained following a massive immigration raid at a Hyundai plant in Georgia will be released and brought home, the South Korean government announced Sunday. Kang Hoon-sik, chief of staff for President Lee Jae Myung, said that South Korea a",
      "\"This, in fact, was the largest single-site enforcement operation in the history of Homeland Security investigations,\" a DHS official said."
    ],
    "image_url": "",
    "titles": [
      "South Korea says it has reached a deal with the US for the release of workers in a Georgia plant",
      "South Korea charters plane to repatriate workers after US battery factory raid",
      "South Korea announces deal to repatriate workers detained in Hyundai raid",
      "South Korea Negotiates Release of Korean Workers Detained in Georgia Raid",
      "South Korea to bring home 300 workers detained in massive Hyundai plant raid in Georgia",
      "South Korea will bring home 300 workers detained in massive Hyundai plant raid in Georgia",
      "South Korea says it has finished talks with the US to return nationals detained in an ICE raid on a Hyundai facility"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.902,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.865,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 300 South Korean workers were detained in the largest ICE raid of Trump's administration at a Hyundai-LG site in Georgia. South Korea announced plans to repatriate the workers, stating a charter plane will be sent to the U.S. once administrative procedures are completed. The South Korean government's action follows the significant immigration enforcement operation, highlighting its commitment to assisting its nationals abroad.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Japan PM Ishiba Resigns After Election Loss, Aims to Unite Party",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 05:13:46 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "New York Times",
      "ABC News",
      "NPR",
      "Deutsche Welle",
      "Le Monde",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.lemonde.fr",
      "www.dw.com",
      "www.theguardian.com",
      "abcnews.go.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "Japan's Prime Minister Shigeru Ishiba has expressed his intention on Sunday to step down following growing calls from his party to take responsibility for a historic defeat in July's parliamentary election.",
      "The prime minister had struggled to inspire confidence as Japan faced economic headwinds.",
      "Shigeru Ishiba's ruling coalition suffered a historic setback in national elections in July.",
      "Japan&rsquo;s Prime Minister Shigeru Ishiba has announced he will step down following growing calls from his party to take responsibility for a historic defeat in July&rsquo;s parliamentary election",
      "Ishiba had faced calls for his resignation after the ruling Liberal Democratic Party failed to secure a majority in the lower house election on Oct. 27.",
      "The embattled leader is trying to head off a deep split in his party over a right-wing political surge, a weakened economy and turbulent trade relations with the United States.",
      "Lors de son entrée en fonction il y a un an, il s’était engagé à « créer un nouveau Japon » et à répondre à « l’urgence silencieuse » du déclin démographique avant de convoquer des élections législatives anticipées et de perdre la majorité au Parlement.",
      "<p>Public broadcaster says prime minister has made decision to avoid divide within his Liberal Democratic party</p><p><a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s prime minister, <a href=\"https://www.theguardian.com/world/2024/sep/27/who-is-new-japan-prime-minister-shigeru-ishiba\">S"
    ],
    "image_url": "",
    "titles": [
      "Japan's Prime Minister Shigeru Ishiba to resign",
      "Japan's Prime Minister Shigeru Ishiba resigns after election defeats",
      "Japanese Prime Minister Ishiba announces resignation",
      "Japan's Prime Minister Shigeru Ishiba resigns",
      "Japan Prime Minister Ishiba Shigeru says he will step down after election setback",
      "Prime Minister Shigeru Ishiba of Japan Says He Will Step Down",
      "Le premier ministre du Japon, Shigeru Ishiba, annonce sa démission",
      "Japan PM Shigeru Ishiba to resign amid fallout from disastrous elections"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.865,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.848,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Japan's Prime Minister Shigeru Ishiba has announced his resignation due to pressure from his party after a significant defeat in the July parliamentary elections. His decision aims to prevent a split in the Liberal Democratic Party, following criticism over handling the economy, a right-wing political rise, and strained U.S. trade relations. Ishiba, who took office with promises of revitalizing Japan and addressing demographic challenges, faced further calls for resignation after failing to secure a majority in the October 27 lower house election.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlo Acutis Canonized as First Millennial Saint by Pope Leo XIV",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 04:00:00 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera",
      "NPR",
      "CityNews",
      "Deutsche Welle",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "ottawa.citynews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "Carlo Acutis, who died of leukemia at 15 in 2006, is known in the Catholic Church as \"God's influencer\" for harnessing technology to spread the word about miracles.",
      "The Catholic Church is about to canonize its first saint of the millennial generation.",
      "Before his death at 15, Carlo Acutis was known for his love of technology and had created a website to document miracles.",
      "'Cyber-apostle' Carlo Acutis, who died of leukaemia in 2006 aged just 15, was officially canonized at the Vatican on Sunday. Pope Leo said he was happy to see many young Catholics attending the ceremony.",
      "Carlo Acutis, a digital pioneer, used his computer skills to spread Catholic teaching globally.",
      "<p>London-born Italian, who died in 2006, built websites to spread Catholic teaching and is credited with two miracles</p><p>A London-born Italian teenage computer whiz who died in 2006 age 15, has been declared the Catholic church’s first millennial saint during an open-air mass in a packed St Pete",
      "He played video games like other teenagers but was also fascinated by the Eucharist and, since his death from leukemia at age 15, is credited with two miracles.",
      "Carlo, who died at 15, was canonized alongside Pier Giorgio Frassati, who also died young. The church is looking to the two saints to inspire new generations of Catholics.",
      "VATICAN CITY (AP) — Pope Leo XIV declared a 15-year-old computer whiz the Catholic Church’s first millennial saint Sunday, giving the next generation of Catholics a relatable role model who used technology to spread the faith and earn the nickname “God’s influencer.” Leo canonized Carlo Acutis, who "
    ],
    "image_url": "",
    "titles": [
      "A teen nicknamed 'God's influencer' has become the first millennial saint",
      "They called him 'God's influencer,' the Catholic Church canonizes the first millennial saint",
      "Teen gamer who 'performed miracles' becomes  first millennial saint",
      "Vatican: 'God's influencer' declared first millennial saint",
      "Pope Leo declares teen millennial , known as ‘God’s influencer’, a saint",
      "Carlo Acutis, ‘God’s influencer’ who died age 15, declared a saint by Pope Leo",
      "Pope Leo canonizes Carlo Acutis, the teen deemed ‘God’s Influencer’",
      "Carlo Acutis, Known as ‘God’s Influencer,’ Is Declared a Saint by Pope Leo XIV",
      "Pope Leo XIV declares teen computer whiz Carlo Acutis the first millennial saint"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.843,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.844,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlo Acutis, a London-born Italian teenager who died of leukemia in 2006 at age 15, was canonized by Pope Leo XIV at the Vatican, becoming the Catholic Church's first millennial saint. Known as \"God's influencer\" and a \"cyber-apostle,\" Acutis used his computer skills to document and spread Catholic teachings, particularly about miracles. His canonization, celebrated in an open-air mass attended by many young Catholics, highlights his role as a relatable figure for new generations, emphasizing his blend of typical teenage interests and devout faith. Acutis is credited with two miracles since h",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sabalenka Wins Second Straight US Open, Clinches Fourth Grand Slam Title",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-07T02:19:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "Sports Illustrated",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "news.google.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Belarusian tennis player Aryna Sabalenka has successfully defended her US Open crown, becoming the first woman since Serena Williams in 2014 to do so.",
      "<ul><li><p>Sabalenka overcomes American 6-3, 7-6 (3)</p></li><li><p>World No 1 clinches fourth grand slam title</p></li></ul><p>At the end of an excruciating season filled with near-misses and heartbreak at the final hurdle, Aryna Sabalenka began her third consecutive US Open final with one final ch",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5qUi1lMnQwOURJNXJyQjVCbFpYOFFWc3Qyc2xmTnVkN1BVT09qcWg0OTZIbUppaTA0d0hIYjFyVTRHelN3VXpMc3Rnc2tJSU1FMG9lZnJYWEVQV1NEUzROSnV1ZkpjMDhsbzNGMV9jZklmSlJp?oc=5\" target=\"_blank\">Aryna Sabalenka Ascends to Another Level in Dominant U.S. Open Victory<",
      "World No 1 Aryna Sabalenka successfully defended her US Open title with a thrilling 6-4 7-6 (7-3) win over Amanda Anisimova in New York.",
      "<p>Aryna Sabalenka did not make many mistakes despite not sacrificing any power — well, until near the end — and outplayed Amanda Anisimova for a 6-3, 7-6 (3) victory in the US Open final Saturday, making her the first woman to win the tournament in consecutive years since Serena Williams more than "
    ],
    "image_url": "",
    "titles": [
      "Aryna Sabalenka wins second straight US Open title",
      "Aryna Sabalenka sweeps aside Amanda Anisimova to retain US Open title",
      "Aryna Sabalenka Ascends to Another Level in Dominant U.S. Open Victory - Sports Illustrated",
      "Sabalenka retains US Open title with thrilling win over Anisimova",
      "Sabalenka defeats Anisimova for her second consecutive US Open title"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.749,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aryna Sabalenka won her second consecutive US Open title, defeating Amanda Anisimova 6-3, 7-6 (3). This victory marks Sabalenka's first major win of the year and her fourth Grand Slam title overall. She becomes the first woman to win back-to-back US Open titles since Serena Williams in 2014.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia's Air Assault on Ukraine: 805 Drones, 13 Missiles, 5 Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 11:39:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "It is the first time a Kyiv government building - in the heavily protected city centre - has been hit since Russia launched its full-scale invasion.",
      "Russia carries out massive strikes, attacking Ukraine with 805 drones and 13 missiles. The attacks set fire to Ukraine's cabinet of ministers building. DW has the latest.",
      "Russia unleashed a massive air assault on Ukraine early Sunday, setting the main government building in Kyiv ablaze for the first time during the war.",
      "Ukrainian officials said the assault killed at least five people around the country and that it was the first time a government building in the capital had been damaged since the war began in 2022."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e006/live/9d7ada90-8bae-11f0-94f7-a595856b120f.jpg",
    "titles": [
      "Zelensky condemns 'ruthless attack' after Russia hits main government building in Kyiv",
      "Ukraine: Russia hits government building amid record assault",
      "Russia’s largest ever air attack on Ukraine burns Kyiv government building",
      "Russia Strikes Ukraine Government Building in Largest Drone Assault of War"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.891,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia launched a significant air assault on Ukraine, employing 805 drones and 13 missiles, targeting various locations including Kyiv. This attack marked the first time a government building in Kyiv's city center was hit, specifically setting the Cabinet of Ministers building on fire. The assault resulted in at least five fatalities across Ukraine. This incident is notable for the damage to a key government facility in Kyiv since the full-scale invasion began in 2022.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Wins Italian GP, Ends Winless Streak; Norris Narrows Piastri's Lead",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 11:25:50 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Max Verstappen took his third victory of the season with a dominant performance ahead of the championship-leading McLarens at the Italian Grand Prix.",
      "Max Verstappen emphatically ended his nine-race wait for another victory by winning the Italian Grand Prix at a canter as Lando Norris eventually trimmed Oscar Piastri's world title lead after late McLaren pit-stop drama.",
      "<p>Max Verstappen claimed a dominant victory at the Italian Grand Prix on Sunday ahead of title contenders and McLaren teammates Lando Norris and Oscar Piastri.</p>"
    ],
    "image_url": "",
    "titles": [
      "Verstappen dominates McLarens to win Italian GP",
      "Verstappen ends win drought with Norris-Piastri in late Italian GP swap",
      "Verstappen claims dominant victory at Italian Grand Prix for first win since May"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.985,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen won the Italian Grand Prix, marking his third victory of the season and ending a nine-race winless streak. He finished ahead of McLaren drivers Lando Norris and Oscar Piastri, with Norris closing in on Piastri's championship lead after a late pit-stop issue for McLaren.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "890 Arrested at London Protest Against Palestine Action Ban",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:21:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Organisers say detained demonstrators include &#039;vicars and priests, war veterans and descendants of Holocaust survivors&#039;.",
      "Protesters chant against police actions as detentions surpass 400, prompting debates on freedom of speech in the UK.",
      "London force hits out at ‘exceptional level of abuse’ at demonstration in support of banned group",
      "<p>Demonstration in central London on Saturday led to 857 arrests under Terrorism Act</p><p>A total of 890 arrests were made at a demonstration in central London on Saturday against the banning of the protest group Palestine Action.</p><p>Police arrested 857 people under the Terrorism Act for showin"
    ],
    "image_url": "",
    "titles": [
      "UK police arrest almost 900 protesters at pro-Palestine Action rally",
      "British police arrest nearly 900 at pro-Palestine London protest",
      "Met police arrest almost 900 people at Palestine Action protest",
      "Almost 900 people arrested at Palestine Action ban protest, say Met police"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a demonstration in central London against the banning of Palestine Action, 890 individuals were arrested, with 857 detentions under the Terrorism Act. The protesters, including vicars, priests, war veterans, and Holocaust survivors' descendants, voiced opposition to police actions. The London police force criticized the 'exceptional level of abuse' they faced during the event. This incident has sparked discussions on freedom of speech in the UK.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vignola's Hat-Trick Leads Everton to 4-1 Win Over Liverpool in Derby",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 15:42:55 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "An &quot;exceptional performance&quot; is the perfect way for Ornella Vignola to announce herself on the Women's Super League stage.",
      "<p>Ornella Vignola announced her arrival to the Women’s Super League with a stunning hat-trick at Anfield to fire her Everton side to yet another Merseyside derby win.</p><p>In a smash-and-grab first half, Everton came from behind to secure a 4-1 victory after Cornelia Kapocs had given the hosts a d",
      "Ornella Vignola scored a hat-trick on her Women's Super League debut for Everton as the Toffees secured a 4-1 win in the Merseyside derby against Liverpool."
    ],
    "image_url": "",
    "titles": [
      "'Hungry' Vignola's dream debut shows Everton potential",
      "Ornella Vignola enjoys dream debut as Everton dispatch Liverpool at Anfield",
      "Vignola nets debut hat-trick as Everton beat Liverpool - WSL round-up and highlights"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ornella Vignola made a remarkable debut in the Women's Super League by scoring a hat-trick for Everton in a 4-1 victory over Liverpool in the Merseyside derby. Her performance helped Everton come from behind to secure the win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Wins Italian GP; McLaren's Team Orders Spark Controversy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:50:57 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "McLaren's approach to racing in the title fight between their drivers sparked controversy as Red Bull's Max Verstappen won the Italian Grand Prix.",
      "McLaren's approach to racing in the title fight between their drivers sparked controversy as Red Bull's Max Verstappen won the Italian Grand Prix.",
      "<ul><li><p>Dutchman wins ahead of Lando Norris and Oscar Piastri</p></li><li><p>McLaren impose orders on drivers after slow pit stop</p></li></ul><p>Max Verstappen won the Italian Grand Prix, with a dominant run at Monza for Red Bull. Having fought a frenetic scrap on the opening laps, during which "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bc86/live/b65e77c0-8bf8-11f0-b408-eb76b3029b4b.jpg",
    "titles": [
      "Piastri told to let Norris past as Verstappen wins",
      "Piastri told to let Norris past as Verstappen wins",
      "Verstappen wins Italian GP as Norris closes gap on Piastri amid pit-stop controversy"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen won the Italian Grand Prix at Monza, leading ahead of McLaren's Lando Norris and Oscar Piastri. McLaren's decision to impose team orders on their drivers after a slow pit stop sparked controversy during the race.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Crash: Cable Snap Identified as Critical Failure",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-06T23:55:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Initial findings revealed that the funiculr accident occurred within 50 seconds. Officials called the deadly crash one of Lisbon's worst tragedies in recent memory.",
      "Portuguese authorities released a highly anticipated preliminary report into the disaster, which killed 16 people this week.",
      "<p>Investigators say it had not been possible to visually inspect section of cable that separated before incident</p><p>A cable linking two carriages snapped shortly before Wednesday’s funicular crash in Lisbon that killed 16 people, accident inspectors have said in a report.</p><p>An operator tried"
    ],
    "image_url": "",
    "titles": [
      "Lisbon funicular cable disconnected before crash — report",
      "Authorities Point to Cable Disconnecting in First Report on Lisbon Funicular Crash",
      "Lisbon funicular cable snapped before deadly crash, report finds"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.713,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A preliminary report on the Lisbon funicular crash, which resulted in 16 deaths, identified a cable snap as the critical failure. Investigators noted the rest of the system was functional but highlighted that the section of cable that failed had not been visually inspected prior to the incident. This crash is considered one of Lisbon's worst tragedies in recent memory. The investigation is ongoing to determine the exact cause of the cable failure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Clay's Playbook Adds Shadow Report for Week 1 NFL Fantasy Insights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 11:39:17 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Mike Clay's Playbook now includes Shadow Reports, providing an all-encompassing look at Week 1's matchups to exploit and avoid in fantasy.",
      "SportsLine's model reveals its Week 1 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN, and Yahoo"
    ],
    "image_url": "",
    "titles": [
      "Fantasy rankings for Week 1",
      "🏈 The Playbook: Week 1 fantasy football guide",
      "Fantasy Football Rankings, streamers, sleepers, model cheat sheets for Week 1, 2025 for PPR, standard leagues"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Clay's Playbook has expanded to include the Shadow Report, offering detailed insights on Week 1 NFL matchups for fantasy football players. This comprehensive guide aims to help users make informed decisions on starting or sitting players based on matchups and weather forecasts, among other factors. All relevant fantasy football content for Week 1 is now accessible in one location to assist players in dominating their matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick Wins First Game at UNC, Bans Patriots Scouts",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 11:25:50 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Bill Belichick picked up win No. 1 at North Carolina as it beat Charlotte 20-3. He also confirmed that Patriots scouts have been banned from the Tar Heels facility, saying, \"It's obvious I'm not welcome at their facility, so they're not welcome at ours.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPZzVYQTRuS3YxUkJWellGWVFDY0dsWXFSYTJieE5oOGxqaGZXOTBudF9aeC1qTXlqeFk4blZoOE1GTjJkTzQwWmF4RGo4emVBMHl0bmQ4dzNWRm9LLVhYTEFWd1l0UW9GcWhHZU9ONGN6SWRERzZ4ZUpTRENoZU1zRUtR?oc=5\" target=\"_blank\">Bill Belichick Confirms Patriots Scouts Are Banned "
    ],
    "image_url": "",
    "titles": [
      "Belichick wins 1st at UNC, confirms Patriots ban",
      "Bill Belichick Confirms Patriots Scouts Are Banned From North Carolina - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bill Belichick, now coaching at North Carolina, achieved his first win with the team, defeating Charlotte 20-3. He also stated that New England Patriots scouts are banned from UNC facilities due to a personal unwelcome feeling, reciprocating the ban at Patriots facilities. This decision was explained as stemming from his own treatment by UNC.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Travis Kelce on Engagement to Taylor Swift: \"Living Life on a High\"",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 11:28:49 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Chiefs tight end kept things lighthearted about his relationship and engagement to the superstar singer/songwriter.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPNnFGVTIyZkI3d1FUNl9CS2NiRXN2Q0w3LXFmdl9xMmpaX3dERGxuSXJYMm9nTzJCYXBvTVB2eU4ySW52RmxXTU9QcmMyRWRYZldGa2NyLUF3bVdvTWtTZWU0SjU4WFVwYWtkLVNQMFJVN1JoSnhoR2JITFU5c1BzOVgzMXFUd0ZnaDR3S1Vn?oc=5\" target=\"_blank\">Chargers DT Who Slapped Travis Kelc"
    ],
    "image_url": "",
    "titles": [
      "Travis Kelce talks engagement to Taylor Swift in Brazil",
      "Chargers DT Who Slapped Travis Kelce Takes Dig at Taylor Swift After Win vs. Chiefs - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Kansas City Chiefs tight end Travis Kelce, after announcing his engagement to pop superstar Taylor Swift, shared he's \"living life on a high.\" His comments, made during a press conference, amused teammates and reporters. Kelce, a three-time Super Bowl winner, kept the mood light when discussing how his life has changed since the engagement went public.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' McCaffrey Limited in Practice, Expected to Play Season Opener",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 15:34:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "McCaffrey popped up on the injury report on Thursday as a limited participant",
      "<p>San Francisco 49ers star running back Christian McCaffrey is expected to be good to go for the season opener. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/07/585ef228-2880-4db3-9065-f641dd7329cc/christian-mccaffrey.jpg",
    "titles": [
      "Christian McCaffrey injury: 49ers star RB will play against Seahawks in Week 1, per report",
      "49ers RB Christian McCaffrey to play vs. Seahawks despite calf issue"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian McCaffrey, the San Francisco 49ers running back, was listed as a limited participant in Thursday's injury report. Despite this, he is expected to be fully available for the season opener.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Saskatchewan Orders Evacuation of \"Queen of Canada\" Followers' School",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 07 Sep 2025 00:28:48 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Provincial officials in Saskatchewan say parts of a former school that was serving as a compound for the self-proclaimed \"Queen of Canada\" and her followers have been declared unfit for human habitation, and the residents have been ordered out.",
      "Provincial officials in Saskatchewan say parts of a former school that was serving as a compound for the self-proclaimed &#8220;Queen of Canada&#8221; and her followers have been declared unfit for human habitation, and the residents have been ordered out.&#160; The Saskatchewan Health Authority say"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/2d5c1ae6e9c3504925c91d7de0df16d32df3d2990652542ca04b26cd9d587de7.jpg?quality=65&strip=all",
    "titles": [
      "Sask. officials declare compound a health threat",
      "Health officials declare ‘Queen of Canada’s’ compound a threat to public safety"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.721,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Saskatchewan officials declared parts of a former school used by the self-proclaimed \"Queen of Canada\" and her followers unfit for human habitation. Residents have been ordered to leave.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft Reports Cable Damage Causing Delays in Middle East",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:20:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Unexplained damage to the cables is causing delays in traffic going through the Middle East, the tech giant says.",
      "Microsoft warns customers of &#039;increased latency&#039; in connectivity and says efforts are under way to resolve the issue."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6627/live/1abc34d0-8bec-11f0-ab2a-4b19af1c03ef.jpg",
    "titles": [
      "Microsoft cloud services disrupted by Red Sea cable cuts",
      "Internet disruptions in Middle East and South Asia after Red Sea cable cuts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Microsoft has reported unexplained damage to cables, leading to traffic delays in the Middle East. The company warned customers of increased latency in connectivity and is currently working to resolve the issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "London Underground Staff Start Five-Day Strike Over Pay, Conditions",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 12:32:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "London Underground staff start a five-day walkout over pay and conditions.",
      "Union says management has refused to engage on pay and working conditions"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/71fe/live/a85e6b00-89a3-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Five-day London Underground strike under way",
      "TfL warns of severe disruption from London Underground strike"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "London Underground staff began a five-day strike due to disputes over pay and working conditions. The union claims management has not engaged in discussions to address their concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]