[
  {
    "title": "Senate Votes 52-48 to End Trump's Emergency Tariff Powers on Brazil Imports",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Tue, 28 Oct 2025 19:47:12 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian",
      "Financial Post",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "Five Republicans joined with Democrats on a vote to end the national emergency that President Trump has declared as the basis for sweeping tariffs on Brazil.",
      "Senate rejects Trump tariffs on Brazil Axios",
      "Vote passes 52-48 with Republican support in rare bipartisan rebuke of US president’s trade policies The US Senate on Tuesday approved a measure that would terminate Donald Trump’s sweeping tariffs on Brazilian imports, including coffee, beef and other products, in a rare bipartisan show of oppositi",
      "A handful of Republican senators joined with Democrats to pass legislation aimed at canceling Donald Trump’s tariffs on Brazil, underscoring a fracture in the president’s party on a signature economic issue.",
      "Senate votes to block tariffs on Brazil. It shows some pushback to Trump trade policy AP News"
    ],
    "image_url": "",
    "titles": [
      "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
      "Senate rejects Trump tariffs on Brazil - Axios",
      "US Senate votes to rescind Trump’s tariffs on Brazil",
      "GOP-Held Senate Splits From Trump in Move to End Brazil Tariffs",
      "Senate votes to block tariffs on Brazil. It shows some pushback to Trump trade policy - AP News"
    ],
    "url": "https://www.npr.org/2025/10/28/nx-s1-5589180/trump-tariffs-senate-vote",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxPeTdJZjJEZUxVUXZKcmZ5eXg0Q2VTTzA5WUJLcDZDbGhnb1NCVlowMEZibWIzMVQzSXQyb0QtcVhRR0w0TXo0bncxVzU4T3llYWZ1eUloZUoySGJ6dHZ4YWliVTJmTDhneGp1UngtUkV3ZlQ2dDRlNlFnRmlnczdJQUlEaw?oc=5",
      "https://www.theguardian.com/us-news/2025/oct/28/us-senate-trump-tariffs-brazil",
      "https://financialpost.com/pmn/business-pmn/gop-held-senate-splits-from-trump-in-move-to-end-brazil-tariffs",
      "https://news.google.com/rss/articles/CBMihwFBVV95cUxQLWlZUW9MVl9nbE45LVlJX0pndGxRd2hpNjk2TGl5VEhNc0lxWHhyTUpWNlpCOVB0cDFVQy01QkN4OFRCOTZYZGd2Wm9YTzJXZ3QyTEFMeS04eF9ycjBjWW5VOWtHSGlOcy15LVpjeDZWVGRuN1lVNTFSWW9xcThsdHdna3Nta0k?oc=5"
    ],
    "link": "https://www.npr.org/2025/10/28/nx-s1-5589180/trump-tariffs-senate-vote",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.991,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Senate voted 52-48 to end the national emergency declared by President Trump, which was used to impose tariffs on Brazilian imports like coffee and beef. This rare bipartisan action, with five Republicans joining Democrats, represents a significant rebuke of Trump's trade policies and highlights a division within the Republican Party on this issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hurricane Melissa Hits Jamaica as Record-Breaking Cat 5 Storm",
    "domain": "science",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Tue, 28 Oct 2025 13:48:02 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Associated Press",
      "Deutsche Welle",
      "Axios",
      "ABC News",
      "Phys.org",
      "BBC",
      "The Guardian",
      "New York Times",
      "Bloomberg",
      "Al Jazeera",
      "New Scientist",
      "Live Science",
      "CBC News",
      "Forbes"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "dw.com",
      "abcnews.go.com",
      "phys.org",
      "bbc.com",
      "theguardian.com",
      "nytimes.com",
      "aljazeera.com",
      "newscientist.com",
      "livescience.com",
      "cbc.ca",
      "forbes.com"
    ],
    "snippets": [
      "The Caribbean storm — among the most powerful in history, with 185 mph winds — is expected to bring flash-flooding and landslides as it slowly moves across the island and heads north toward Cuba.",
      "Category 5 hurricane Melissa makes landfall in Jamaica, NHC says Reuters",
      "Hurricane Melissa live updates: Jamaica faces strongest storm in decades Reuters",
      "Hurricane Melissa, Jamaica's strongest-ever storm, weakens to Category 4 Reuters",
      "Category 5 Hurricane Melissa brings flooding and catastrophic winds to Jamaica AP News",
      "Hurricane Melissa bears down on Jamaica and threatens to be the island's strongest recorded storm AP News",
      "Hurricane Melissa threatens catastrophic flash flooding and landslides in the Caribbean AP News",
      "Hurricane Melissa is battering Jamaica as a catastrophic Category 5 storm the strongest ever recorded on the island. Follow DW for more.",
      "\"Catastrophic\" Hurricane Melissa makes landfall in Jamaica Axios",
      "Melissa is set to bring catastrophic winds, rain, flooding and storm surge to Jamaica, where residents and tourists are sheltering in place.",
      "Ferocious winds and torrential rain tore into Jamaica Tuesday as Hurricane Melissa made landfall, the worst storm ever to strike the island nation and one of the most powerful hurricanes on record.",
      "Hurricane Melissa, an intense Category 5 storm, brought violent winds and heavy rainfall to Jamaica after making landfall Tuesday and continues to threaten parts of the Caribbean as it tracks through. Melissa was then forecast to cross Cuba and the Bahamas through Wednesday.",
      "The eye of the storm has passed over Jamaica but it is still battering the island - the eye is now heading towards Cuba.",
      "Government says it has done all it can to prepare for strongest hurricane in country since records began Hurricane Melissa – latest updates Hurricane Melissa has made landfall in Jamaica, where sheltering residents braced themselves against ferocious winds, heavy flood waters and landslides from the",
      "The Category 5 storm, whose sustained wind speeds surpassed those of Hurricane Katrina, peeled roofs off homes, swelled rivers and drew dire warnings from officials.",
      "Hurricane Melissa Batters Jamaica and Now Inches Toward Cuba Bloomberg",
      "Hurricane Melissa Nears Jamaica as Island’s Worst-Ever Storm Bloomberg",
      "World Meteorological Organization dubs slow-moving Melissa the ‘storm of the century’ as Cuba braces for impact.",
      "Hurricane Melissa, now a powerful Category 5 storm, is expected to be the worst storm Jamaica has ever seen.",
      "Hurricane Melissa kills 3 in Jamaica ahead of expected landfall in Caribbean nation Axios",
      "Hurricane Melissa became one of the most powerful hurricanes on record to make landfall in the Atlantic Basin.",
      "The monster hurricane pummelling Jamaica is powered by abnormal sea surface temperatures in the Caribbean, which were made at least 500 times more likely by global warming",
      "Slow-moving giant makes landfall and will linger over the island before slamming into Cuba Hurricane Melissa – latest updates Hurricane Melissa has made landfall in Jamaica as a catastrophic category 5 storm, the strongest to lash the island since record-keeping began in 1851. The slow-moving giant",
      "The U.S. Air Force's \"Hurricane Hunters\" have flown inside the eye of Hurricane Melissa, capturing eerie footage of the historic storm that is expected to cause widespread devastation in Jamaica.",
      "Hurricane Melissa made landfall on Jamaica Tuesday as the strongest storm to hit the Caribbean island since records were first kept 174 years ago. It is tied for the strongest Atlantic hurricane to ever hit land.",
      "Hurricane Melissa made landfall as one of the strongest storms in the history of the Atlantic basin."
    ],
    "image_url": "",
    "titles": [
      "Category 5 Hurricane Melissa brings flooding and catastrophic winds to Jamaica",
      "Category 5 hurricane Melissa makes landfall in Jamaica, NHC says - Reuters",
      "Hurricane Melissa live updates: Jamaica faces strongest storm in decades - Reuters",
      "Hurricane Melissa, Jamaica's strongest-ever storm, weakens to Category 4 - Reuters",
      "Category 5 Hurricane Melissa brings flooding and catastrophic winds to Jamaica - AP News",
      "Hurricane Melissa bears down on Jamaica and threatens to be the island's strongest recorded storm - AP News",
      "Hurricane Melissa threatens catastrophic flash flooding and landslides in the Caribbean - AP News",
      "Hurricane Melissa makes landfall in Jamaica as Category 5 storm",
      "\"Catastrophic\" Hurricane Melissa makes landfall in Jamaica - Axios",
      "WATCH:  Hurricane Melissa has made landfall in Jamaica as a Category 5 hurricane",
      "Monster Hurricane Melissa makes landfall in Jamaica",
      "What to know about Hurricane Melissa",
      "Windows blown in, trees uprooted and croc warnings - Hurricane Melissa batters Jamaica",
      "‘Storm of the century’: record-breaking Hurricane Melissa hits Jamaica",
      "Hurricane Melissa Hits Jamaica as One of the Most Powerful on Record",
      "Hurricane Melissa Batters Jamaica and Now Inches Toward Cuba - Bloomberg",
      "Hurricane Melissa Nears Jamaica as Island’s Worst-Ever Storm - Bloomberg",
      "Eye of Hurricane Melissa exits Jamaica, heads towards Cuba",
      "Hurricane Melissa path: Tracking the devastating Category 5 storm after landfall",
      "Hurricane Melissa kills 3 in Jamaica ahead of expected landfall in Caribbean nation - Axios",
      "Melissa ties with 2 other storms for strongest hurricane to make landfall in Atlantic",
      "Why Hurricane Melissa is one of the strongest Atlantic storms ever",
      "Hurricane Melissa: a visual guide to Jamaica’s strongest storm since 1851",
      "Watch Air Force fly inside the eye of Hurricane Melissa as experts warn 'storm of the century' will be catastrophic for Jamaica",
      "Eye of Melissa moves past Jamaica after hitting as strongest hurricane in the region in 174 years",
      "Hurricane Melissa Live Updates: Over Half A Million Jamaicans Without Power As Storm Rips Through Caribbean"
    ],
    "url": "https://www.npr.org/2025/10/28/g-s1-95381/hurricane-melissa-jamaica-landfall",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxPUW9rUjV5akhmUVpYT0xiN0dwOWNfdXNHTk1zNUdrUHRvMjlrMTVMSVZuS1c1Q2xCMkFYUC1TOEFUZTdxQjRxWHlBcWd4WWdVXzlpYzMyS3lIQW1DMGRuQWNNbDBRWnc1X3FULXVuR0dTRVdGbHZnVHdvYjMwNWNOUFBvZk5wZ0k3N1U1ODdEdUVPTEJ5eE1ZUVRkTzBIVFh4RldOZXZmSHgtZV9RNXhMeDhDZFY0Rlh4LUJTbDFUS0JGN29G?oc=5",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxPR1RUQ0Rjbng1WkZEeXdFbUVvNkNuRkpzc0lGVE9BV2dyRFVHYUpvM2VvQzJsbExsNm5fb2pmN3c5NEo0LUM0VnY1cFpmSnZ4WWFBWlNIUTNZU0dOV1NZV01fX0pFSUhhcGxwNE9zR3Q2OVNpYTBJNFp6ZHdELWZZb1dhUlFJNFM4OW9POGhB?oc=5",
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxQSlJNblFuT1pTNWRISjR3Nm1fRmt5Q3IxZzZoOTg3cFY1M3RtbGNTbE84d0w1THVRLW0xS18zVlpYTjdpbzRWaHQzcHBhb2NqTFRQM0FOZ2U4NEhoWlpGYnFqNGQtOHBYVExPWERtMW8wSTdfRlNyVi1jVmMtZHV4Ynd1NWpBbnVvVm84eHJLOUdpWjZhZXk4akdERzJ1QWhNTjFoUmQyd1BLUzV2MTFMcC1XSEwzV3h4dGxiSUktamxSdlZKNVZEQzNtdnpLbWc?oc=5",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQMWFacWZWdFhsOV9PZU8yYlpqUjF3M2Zna0pMbExlYzJvRkdUUVNhTy1JamtyU0YxdEZIRy0wX1N3MGtrMFpIR2RCUjh6akgtOVpjdVBsckdmTHVITmc1U2Vidlo0bnBxOG5tM0ppWElNcFJnb1Ntei15UTNBejQwYlJUbTNqVTVFOFVvbC1QM2N6SUM0NEFSTEM0UmFsb1JfWWlTOEtVdjlncW8?oc=5",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxQR2EzeXB1UHRnMVl5WDcyNFFBNWNsdjg5ME1ydkFoVWREeFptVUJGSS1PRE1pdEtnaHNkVjE3RlJUcE1jcjI2SGZRcVhkU1FHem5YZ3RrWmk5VWNTclpheTlVUzN4bEhQakFhRG5tYU01UTF6S1FkY25JbUxZMHVWcXdRRUxvYTNQY0xZLVVibWtXWkh5NzBvV2RJaW8?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxORXBma1dkZ2h5ODJ6ZUIyLVJDU1FFVHBtWlFGYm5iWnhQU0MwUnJJUmM0a1VVbjJuQ1BWZFM5Z21Yd1IxdS04WDJvbFN2b0d1bjF0MmhVX1RWbi1xa1gzcnZJZkFESWpaT2lDY0g4aXVVSDdCWFZIRk1YdlVlZU9uYW1adWZ6MjRDSUNKRlZxb3BMUTBBR2haa2U0akJ6c3VubVNRbElQQTlVWW56?oc=5",
      "https://www.dw.com/en/hurricane-melissa-makes-landfall-in-jamaica-as-category-5-storm/live-74514852?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE5sbmVPc00xMWpFdXEyX3pLVzFXY1B1SXpKT09lcTZkLWxjc1gyZVU1ZkFDYnhhWWdUdUJaYncyckhWSHp2N2Rjc2R3Q0x6TE0xNmE3NXhwd25jWHpaUlVfaFdLLVNBRjRYdkVYeHdTeUowOFRWRk1iWkE1Zw?oc=5",
      "https://abcnews.go.com/US/video/hurricane-melissa-made-landfall-jamaica-category-5-hurricane-126948204",
      "https://phys.org/news/2025-10-monster-hurricane-melissa-landfall-jamaica.html",
      "https://phys.org/news/2025-10-hurricane-melissa.html",
      "https://www.bbc.com/news/articles/cqx3g2v7275o?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/world/2025/oct/28/hurricane-melissa-makes-landfall-in-jamaica",
      "https://www.nytimes.com/2025/10/28/world/americas/hurricane-melissa-jamaica.html",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPNWIxTWR6dEYzemxPV2NnZmZNeFpfVzRNZnpqTzNhNTVFS3NmX0dtd09scUthNEMwaW51WDJNOW1CWEdXeVpLb3lweC1TX0Z4cE9GbnZJcDd2ZFlCM0FJdWlFbXNrT0RZVWhBMEhrUVhLQ0lNQmdWZmFBSGhPdFkwZ0tFeWo0VEtRM1JFM2xXZDZDdnZwWGZQUWg3X1J1c0xheVFKM19SQmpCNnhYMC1STjdn?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPa3JGbk5Zd21xR3RWeUdPOVc3a3h4djRVbWFRTXN0dVcxcWFNS1QtTnRaTjhtX1FrTXMwSDQ3WUUwR3JXcTVwYzAzUnBoQ1dLVERtcUp5bmhwN0FvWWh4OEVYWlhCRlIyZTYtTHJtazVMZDRDR1FrQnJUaVFIVFpTWk9YVy15ZHVVcG1ta0s2TnhjTVQxSURCNGVySjd0SGpuR0xHUm51MHpNbHNTVmFiaA?oc=5",
      "https://www.aljazeera.com/news/2025/10/28/catastrophic-category-5-hurricane-melissa-makes-landfall-in-jamaica?traffic_source=rss",
      "https://abcnews.go.com/US/hurricane-melissa-path-track-category-5-storm/story?id=126893988",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxOVlVfcndzMVVfYkxSa0FtM2ctX1VwWHZkR2JrTTNaTGxCeWd2aFByTXNDR0tiX2pMY2xpWEIxWW9WOUw5LTl5bGVSRnRSM1VkSzJhNTE4blRRNDUzRl9RazJaMGVyZnFvQmhZd3hoRnZTQzlkbEZJU1ZoYXlqa2JpNi1oWEYtSEJrZHVCeEpjVmk?oc=5",
      "https://abcnews.go.com/US/hurricane-melissa-ranks-strongest-atlantic-storms-make-landfall/story?id=126943257",
      "https://www.newscientist.com/article/2501770-why-hurricane-melissa-is-one-of-the-strongest-atlantic-storms-ever/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "https://www.theguardian.com/world/2025/oct/28/hurricane-melissa-a-visual-guide-to-the-strongest-storm-to-hit-jamaica-in-almost-two-centuries",
      "https://www.livescience.com/planet-earth/hurricanes/watch-air-force-fly-inside-the-eye-of-hurricane-melissa-as-experts-warn-storm-of-the-century-will-be-catastrophic-for-jamaica",
      "https://www.cbc.ca/news/world/hurricane-melissa-tuesday-st-ann-jamaica-santiago-cuba-9.6956280?cmp=rss",
      "https://www.forbes.com/sites/zacharyfolk/2025/10/28/hurricane-melissa-live-updates-over-half-a-million-jamaicans-without-power-as-storm-rips-through-caribbean/"
    ],
    "link": "https://www.npr.org/2025/10/28/g-s1-95381/hurricane-melissa-jamaica-landfall",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.875,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.85,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hurricane Melissa, a Category 5 storm, made landfall in Jamaica as the strongest storm to hit the island since records began in 1851, with winds reaching 185 mph. It caused catastrophic damage, including flash flooding, landslides, and severe structural damage. The storm has killed at least 3 people in Jamaica and is expected to continue causing devastation as it moves toward Cuba. This event marks Melissa as one of the most powerful hurricanes on record in the Atlantic Basin, exacerbated by unusually high sea temperatures linked to global warming.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Launches Airstrikes on Gaza, Citing Ceasefire Violations by Hamas",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Tue, 28 Oct 2025 13:14:10 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Al Jazeera",
      "Financial Times",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "Reuters",
      "Al Arabiya",
      "Deutsche Welle",
      "Axios",
      "Bloomberg"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "aljazeera.com",
      "ft.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com",
      "dw.com"
    ],
    "snippets": [
      "Israel's military has begun striking the Gaza Strip again, as Israel and Hamas traded blame for violating the ceasefire brokered by President Trump.",
      "Hamas denies it was behind an attack on Israeli forces inside an area of Gaza under their control and condemns the strikes.",
      "Footage shows emergency crews rescuing civilians from rubble after Israel carried out new strikes across Gaza City.",
      "Palestinian militants deny responsibility for Rafah attack and delays in releasing hostage remains as peace accord frays",
      "Prime minister accuses Hamas of ‘clear violation’ of truce as far-right ministers clamour to resume war Israeli warplanes struck Gaza on Tuesday night, shortly after Israel’s prime minister, Benjamin Netanyahu, ordered the military to carry out “powerful strikes” in Gaza, in the most serious test of",
      "Israel accused Hamas of firing on Israeli troops and returning remains that belonged to a hostage whose body the military had already partially recovered.",
      "The office of the Israeli prime minister said Tuesday evening that he had ordered “forceful strikes,” accusing Hamas of firing on Israeli troops and failing to return hostages’ bodies.",
      "Israel strikes Gaza after accusing Hamas of violating US-brokered ceasefire Reuters",
      "Israeli planes strike Gaza in test of US-brokered ceasefire Al Arabiya English",
      "US Vice President Vance says Gaza ceasefire is holding Al Arabiya English",
      "Israel's prime minister has accused Hamas of breaching the Gaza ceasefire. Israel also accused the militants of returning the wrong hostage remains. Follow DW for more.",
      "Netanyahu orders \"powerful\" strikes in Gaza as ceasefire breaks down Axios",
      "Netanyahu Tells Military to Strike Gaza, Jeopardizing Ceasefire Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "Israel launches renewed strikes in Gaza less than 3 weeks into Trump's ceasefire deal",
      "Israel strikes Gaza after accusing Hamas of ceasefire violations",
      "New Israeli strikes on Gaza threaten fragile ceasefire",
      "Israel launches strikes on Gaza after accusing Hamas of ceasefire violations",
      "Israel strikes Gaza after Netanyahu accuses Hamas of breaching ceasefire",
      "Israel launches strikes on Gaza, claiming Hamas violated truce",
      "Netanyahu Orders Strikes in Gaza, as Israel Says Hamas Violated Cease-Fire",
      "Israel strikes Gaza after accusing Hamas of violating US-brokered ceasefire - Reuters",
      "Israeli planes strike Gaza in test of US-brokered ceasefire - Al Arabiya English",
      "US Vice President Vance says Gaza ceasefire is holding - Al Arabiya English",
      "Israel strikes Gaza after Netanyahu orders 'powerful attacks' amid hostage remains mix-up",
      "Netanyahu orders \"powerful\" strikes in Gaza as ceasefire breaks down - Axios",
      "Netanyahu Tells Military to Strike Gaza, Jeopardizing Ceasefire - Bloomberg"
    ],
    "url": "https://www.npr.org/2025/10/28/g-s1-95372/netanyahu-israel-strikes-gaza-hamas",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cgjdy5eevn2o?at_medium=RSS&at_campaign=rss",
      "https://www.aljazeera.com/video/newsfeed/2025/10/28/new-israeli-strikes-on-gaza-threaten-fragile-ceasefire?traffic_source=rss",
      "https://www.ft.com/content/f2b25bc1-58ac-40cc-96c1-756672fee14e",
      "https://www.theguardian.com/world/2025/oct/28/returned-body-parts-were-of-hostage-recovered-two-years-ago-israel-says",
      "https://www.washingtonpost.com/world/2025/10/28/netanyahu-gaza-strikes-hamas/",
      "https://www.nytimes.com/2025/10/28/world/middleeast/israel-gaza-netanyahu-strikes.html",
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxQY2xFYVYtNWNLQlh0bU1RRU9aRVlFS0tWd2hWOC00LThUWHMwMEVfTVJTOWx1dWZUSDZRQkNDQXVPX3d5RS03TUZEQ243d0F0aGI4Z0dFNjhJSHEtQTVHa2RaVUtXWHZiXzBoOWpvSFN5NzZFRXJlZ25QV1RpSGlRWmNvODJUcGl0d2FxRWZLcWlVa1g2VHU5MFZRLUNBeTV2Q0djakdzQ000Tjlob0dlTllpeDgzakNCZlRsbXlyRFd4TF9rLV9TenZ1U1NIUQ?oc=5",
      "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNcVJkNEhlY2xsME1uaG9YSEg2aDk1QmhzN1lZcVBvU1hsUFNhTE8wTzB3QzhLeEg4TnFGOEQ4R2t0NzJpUDAyWDZXZFZYTDFRWDZFRUlQTThFdWtQQ0F5d1pCa3lhanF6djZsaWlCZHpxM1RMOVE0OW1raFYyZzZpQzhYYVpGc0s0eDRMYmpWdmpJakJQSVlsS2ttVDlyTklrc0dqdjU1THBtVmdyNERIQ1FMZ1RpUU1IcXJvdmR0N3VLdmJUYWMwOHdLUnhJUmRvOW1ZNno0XzJQVUl4aHfSAeMBQVVfeXFMTWFQSmdLNzZyM0Q0WnpNWEY1dWlzanQ4ZU5ZVFdPZllEUEN2TUdPWEM0VnJLUUpBV3JONU5BbWx4VUw0Unh5WUNGTFdZZ3FMcG00MVF0Y2tXaExZMVZmR2FYR1BZMWQzcTZSTW5icHJ3ajlTYVhWXzJxMTZua0NPRUhhSm9oSWdyZUNDWVM4Z0ZVMS1fRGlpbmd5UzBBY3lvS3NocG5WWFZkdHRFaDZqT2FLVFlRNURwNmRhRE1NSUJ5b295cE1WbzdzaURXVzRaTnJtZURzWDlGMU41XzVRSS1UTWs?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRC1jd2NBTktHbXNZYVkwaGhKNGF4Yko5cjRSTFRQU3pCOXV1cklZM2pUeHFuSXJfTmF2YlYwOXprSS1vTk5vTFZMU2FwSExUUnJKSGZIaDdEclA0aHJpTUdmVFFCR29PQVFnY2RsRmVaZGI3c2lXTmQ2UUEyV01nRVo3YkR6QTdmdGdlSktRWjFwQkdBWU5RNkllcGNNWDNrNHE2TDNRd1U5TmVJU2hsaWRR0gG3AUFVX3lxTE42bHVydzdBWmRZRG5Od1BKTzU0MUZHbDJfQmJaMEdDMHVkXy1uN0NDZkhrV3hma3BLMUdMdGVSZWJWWl81cWI3WnMzbVFGOUNHSW14TDN6TkdxY0JfWkRJbjNwN1AtTkZJZ1BVaTFCeGhnMFhtRnNhSmUzR19aLUZaOWVZQkdYdmYwdnJTNjg1cVY0ZnRkLU5MODJSRjlmdVBpSHRFLU1kamcyU2p3R0ViNkNyZDlVQQ?oc=5",
      "https://www.dw.com/en/israel-strikes-gaza-after-netanyahu-orders-powerful-attacks-amid-hostage-remains-mix-up/live-74524474?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMif0FVX3lxTE84a0xxMXVjZnUyNlB1Y1RJaG54SjJ6SV9OOVc4cGpiTjFuSDhhTTJ4b2NJOXpTUC1Od055ZGtVV1U1dElBZllhLU42ZDdqckttaUQ1T2s3RkpFZmZRUGZkQzVuMnh2bzMyd3JyUVhWQk5wUVAtd3dpZThKZUR1YjA?oc=5",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNQjRwTXk5M0dvVkJmcS1EU2tpQ01fdEJoWmtuRjJLczlVamVVbGV6YzRuM3dhb010R0xKMm03UDhrZm9sYUVWX0g3S2dSWXo5UzJEdVhfdlBpcEpCSmxhdEM2bWREVkhRM3Z5SXRfR1VXdDA1WlFmSk5UV1hKMEdvREN1c3JmVWdxeTh6a3RLUDB4Skd2bWRITndtNFJUel9seXpub1pBNHJMaWNYRnlPLWI3RQ?oc=5"
    ],
    "link": "https://www.npr.org/2025/10/28/g-s1-95372/netanyahu-israel-strikes-gaza-hamas",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.865,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.848,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel has resumed airstrikes on Gaza, accusing Hamas of violating a US-brokered ceasefire by attacking Israeli troops and mishandling the return of hostage remains. Despite these allegations, Hamas denies responsibility for the attacks and criticizes the Israeli strikes. The escalation marks a significant test of the ceasefire, with Netanyahu ordering \"powerful strikes\" in response. Emergency crews have been shown rescuing civilians from the aftermath in Gaza City.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon to Cut 14,000 Jobs in Streamlining Effort, Focus on AI",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 13:27:55 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "BBC",
      "Deutsche Welle",
      "Axios",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "CBC News",
      "Associated Press",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "bbc.com",
      "dw.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "UPS cut 48,000 jobs so far in 2025 Reuters",
      "Amazon to cut about 14,000 corporate jobs in AI push Reuters",
      "The company says the opportunities provided by AI means it needs to be \"organised more leanly.\"",
      "Amazon hired as its delivery demand peaked during the COVID pandemic, meaning analysts anticipated layoffs. The company is also in the process of boosting its AI spending with a view to streamlining.",
      "Amazon will cut 14,000 corporate roles, nods to AI-driven changes Axios",
      "The company said it's cutting roles in order to help make the company leaner and less bureaucratic, while it looks to invest in generative AI.",
      "Job losses come as chief oversees a cost-cutting drive amid increased AI spending",
      "Retail giant, which is vying to reverse pandemic hiring spree, attempts to cut costs and slim down its operation Amazon has confirmed plans to lay off 14,000 corporate workers, as part of a wave of cuts expected to hit tens of thousands of jobs. The Seattle-based retail giant, which is vying to reve",
      "Amazon will cut about 14,000 corporate jobs as the online retail giant ramps up spending on artificial intelligence while cutting costs elsewhere.",
      "Amazon cuts 14,000 corporate jobs as spending on artificial intelligence accelerates AP News",
      "Amazon to Cut 14,000 Jobs as CEO Jassy Taps AI to Reduce Costs Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "UPS cut 48,000 jobs so far in 2025 - Reuters",
      "Amazon to cut about 14,000 corporate jobs in AI push - Reuters",
      "Amazon confirms 14,000 corporate job losses as it focuses on AI",
      "Amazon to cut 14,000 corporate jobs amid AI investment",
      "Amazon will cut 14,000 corporate roles, nods to AI-driven changes - Axios",
      "Amazon laying off about 14,000 corporate workers as it invests more in AI",
      "Amazon to cut 14,000 corporate jobs",
      "Amazon confirms plans to lay off 14,000 corporate workers as part of wave of cuts",
      "Amazon cutting 14,000 corporate jobs to spend more on AI",
      "Amazon cuts 14,000 corporate jobs as spending on artificial intelligence accelerates - AP News",
      "Amazon to Cut 14,000 Jobs as CEO Jassy Taps AI to Reduce Costs - Bloomberg"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNTTd2VmtzLUZJNENLVmtTOUFTcjhUVmRvZXc5NV8wdWRpOEwwZ1doZVJhd3hZVDBpeVo0cTRWZ1B3VjdDYkhRX3JZQ1VQNlZjbHNSOTRmTlkyRXdmMkhVazl5U0R2Ykw2bUJjV09qeGVzV1NfVUxiUm9BSUpiZWZ6SWlUQVR4a1c3RnpWSFptUjEybnJ4MnY5MWlLVjRZckhzWVE?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPZ0xrYWl0T3IzWlVHSEtWN0ZMckJTcjJudWt4NjN4RUQzZ2xDSzl4Y0Fpck5CNFFOaUdndlpRS1QyZ2tVTDF6UDdTajJhM0lvVzBhOWFQZmlQN1dCb0g2MjBDdkJyZkp6alRMdWQ3LU5oZ0o0cnpWQnVGbGFvbWNTV3M4Q1U4TGFaSlRZ?oc=5",
      "https://www.bbc.com/news/articles/c1m3zm9jnl1o?at_medium=RSS&at_campaign=rss",
      "https://www.dw.com/en/amazon-to-cut-14-000-corporate-jobs-amid-ai-investment/a-74524365?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMibEFVX3lxTE5yTk9TeXRzdEdJay04R3NBM2ZVUU04UTVfOENFNktwdjVpLUxYamVQbi04ODNlQUxjR2FxUEtsY1haWm41ZENJLVY3YVJKNmIzTEhGMGhjTS12U1VxMjdQX21SazdwSFNjdF9OZA?oc=5",
      "https://www.cnbc.com/2025/10/28/amazon-layoffs-corporate-workers-ai.html",
      "https://www.ft.com/content/106a0ea2-5f76-47c3-b1d6-c6b425b556fc",
      "https://www.theguardian.com/technology/2025/oct/27/amazon-corporate-jobs-cuts",
      "https://www.cbc.ca/news/business/amazon-14000-corporate-layoffs-artificial-intelligence-9.6956357?cmp=rss",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOSDlKTlJ0ZUpYMm9xVERhWHNNTUFfZWpWdEVCVERYNXZtUjNhcElmaG5BWkRKZjdsR3YxS3FuZGVUUy1tQkR0Si00bWlSV0laVi1OZjJRTDVETzA3WGozZThHd3hQZG9OVTFLZW9DZlk0TmVHYnFwakFLS3dwWXJNaVdLaWVBR3dwWDFvcVpLZlZLdk9HUGJTMGhPcHVZTGk1RVhPQzY0MFZFZw?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxOWkl1Y3VfeFE4Um5UWlFLNkZzdm00WGh5YTF1M2JNQnZaWm82Wm1fS29sdTFjd3pSX3lraXBVUmxXUmVTSVpkOUxWUkJ0VWtTS0MxVVFfdEhVNDZQcUkyS05xYWV4TTdLVzktSE5FMTEwT3hWV3YxR3F3Wjd6ZWNzTkNEVXdPQWVyOGNFN3NDYThENGlXaGFRelMwS1hacG4zbThvSzZaSHNxSE5S?oc=5"
    ],
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNTTd2VmtzLUZJNENLVmtTOUFTcjhUVmRvZXc5NV8wdWRpOEwwZ1doZVJhd3hZVDBpeVo0cTRWZ1B3VjdDYkhRX3JZQ1VQNlZjbHNSOTRmTlkyRXdmMkhVazl5U0R2Ykw2bUJjV09qeGVzV1NfVUxiUm9BSUpiZWZ6SWlUQVR4a1c3RnpWSFptUjEybnJ4MnY5MWlLVjRZckhzWVE?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.799,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon has announced plans to eliminate approximately 14,000 corporate positions as part of a strategy to streamline operations and reduce expenses. This decision aligns with the company's increased focus on artificial intelligence (AI) and follows a period of significant hiring during the COVID-19 pandemic. The layoffs are part of Amazon's broader effort to become leaner and more efficient, amid a push to enhance its AI capabilities.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strikes on Suspected Drug Boats in Pacific Kill 14; Mexico Criticizes Actio",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 16:49:36 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "BBC",
      "Associated Press",
      "Al Jazeera",
      "Washington Post",
      "CBC News",
      "Deutsche Welle",
      "LA Times"
    ],
    "domains": [
      "news.google.com",
      "bbc.com",
      "aljazeera.com",
      "washingtonpost.com",
      "cbc.ca",
      "dw.com",
      "latimes.com"
    ],
    "snippets": [
      "New US strikes kill 14 alleged drug traffickers, Mexico leads rescue of survivor Reuters",
      "Mexico's navy is searching for the sole survivor of the latest attack on boats the US says were carrying drugs in both the Pacific and Caribbean.",
      "US launches strikes on 4 alleged drug-running boats in the eastern Pacific, killing 14 AP News",
      "The string of strikes in the Eastern Pacific Ocean brings the total known death toll from the US bombing campaign to 57.",
      "The U.S. military has struck four alleged drug boats in the eastern Pacific, killing 14 and leaving one survivor.",
      "Three strikes conducted by the U.S. military on boats in the eastern Pacific Ocean killed 14 people and left one survivor, U.S. Defence Secretary Pete Hegseth said on Tuesday, alleging those on board were drug traffickers.",
      "Secretary of War Pete Hegseth posted a video on social media of a strike on several vessels, saying the attacks will continue.",
      "The Trump administration said Tuesday that it had attacked four vessels off what Mexico said was its Pacific coast, a move condemned by Mexican President Claudia Sheinbaum."
    ],
    "image_url": "",
    "titles": [
      "New US strikes kill 14 alleged drug traffickers, Mexico leads rescue of survivor - Reuters",
      "US kills 14 in strikes on four alleged drug boats in Pacific",
      "US launches strikes on 4 alleged drug-running boats in the eastern Pacific, killing 14 - AP News",
      "US kills 14 people in three strikes on alleged drug-smuggling boats",
      "U.S. military strikes four alleged drug boats in eastern Pacific, killing 14",
      "U.S. strikes on alleged drug boats kill 14 people in Pacific waters, defence secretary says",
      "US: Strike on suspected drug traffickers kills 14",
      "Mexican president condemns U.S. strikes that killed 14 alleged drug traffickers"
    ],
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPcFMwWHJ1c24xb3Yta3pCenZianZqbUoyTE4zVTRtdmVSem5VcjNrRnNrdEc1Nkc4aWlaRHlTSy0yQzVUZkRmYVpzbklGdTVmcE9fWEJQM3Z5ak1FVVZ3RFFOQV9IN09jSTYtd0xJMnZmcENvcF9rSFc0dXpmaFVITWF2a1RabW5BSlczZ2VBNTVJN3pxQTVBd2VKTHJuaFJjdnlyWGpR?oc=5",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c0ex94eeljeo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxPRVAtZkFnd2hTMXRYWjF1U1BFcUpWOU9NamJSMGd6Yk9Pd2gzbUJyV0RGNDRDOURZRmh5SkxhSGduazNkckZFQkEtdkRVOHpTaVNYcEpNcW50Q0F4ZWNkakl1dGJjNmJERGVBZXVYNHU2ZWlXWGxMWVZFOUloUnBCY3BTZEVjeW9hTy01TU80dWxRdw?oc=5",
      "https://www.aljazeera.com/news/2025/10/28/us-kills-14-people-in-three-strikes-on-alleged-drug-smuggling-boats?traffic_source=rss",
      "https://www.washingtonpost.com/national-security/2025/10/28/drug-boat-strike-mexico-pacific-hegseth/",
      "https://www.cbc.ca/news/world/us-hegseth-three-deadly-boat-strikes-pacific-9.6956503?cmp=rss",
      "https://www.dw.com/en/us-strike-on-suspected-drug-traffickers-kills-14/a-74528075?maca=en-rss-en-top-1022-rdf",
      "https://www.latimes.com/world-nation/story/2025-10-28/hegseth-says-us-carried-out-3-strikes-on-alleged-drug-running-boats-in-eastern-pacific-killing-14"
    ],
    "link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPcFMwWHJ1c24xb3Yta3pCenZianZqbUoyTE4zVTRtdmVSem5VcjNrRnNrdEc1Nkc4aWlaRHlTSy0yQzVUZkRmYVpzbklGdTVmcE9fWEJQM3Z5ak1FVVZ3RFFOQV9IN09jSTYtd0xJMnZmcENvcF9rSFc0dXpmaFVITWF2a1RabW5BSlczZ2VBNTVJN3pxQTVBd2VKTHJuaFJjdnlyWGpR?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.857,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. military conducted strikes on four boats in the eastern Pacific, alleged to be involved in drug trafficking, resulting in 14 deaths and one survivor. These actions are part of a campaign that has now killed a total of 57 individuals. Mexico's navy is actively searching for the survivor. The operation has drawn criticism from Mexico, with President Claudia Sheinbaum condemning the strikes. U.S. Defense Secretary Pete Hegseth confirmed the operations and indicated they would continue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays' Springer Misses World Series Game 4 Due to Injury",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 19:39:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Blue Jays star George Springer is not in the starting lineup for Game 4 of the World Series after leaving early Monday night with right side discomfort.",
      "Springer left Monday's Game 3 early with right side discomfort",
      "Blue Jays Make George Springer Lineup Decision for World Series Game 4 After Injury Sports Illustrated",
      "Toronto Blue Jays slugger George Springer was not in the starting lineup for Game 4 of the World Series against the Los Angeles Dodgers on Tuesday after suffering an injury to his right side a night earlier. Bo Bichette replaced Springer as designated hitter and was slotted third in the batting order. Nathan Lukes moved up a spot to the leadoff position and Addison Barger was in the cleanup spot for Game 4 (Sportsnet, 8 p.m. ET / 5 p.m. PT). Speaking during a pre-game media availability, Blue Jays manager John Schneider said he considered a couple different versions of the lineup as he wanted...",
      "Even if he’s prevented from taking another swing, Shohei Ohtani will still have the opportunity to determine the path of this Fall Classic.",
      "Hazel Mae, Kevin Pillar, and Caleb Joseph discuss Toronto Blue Jays designated hitter George Springer not making the starting lineup for Game 4 of the World Series against the Los Angeles Dodgers and how his absence will impact the team."
    ],
    "image_url": "",
    "titles": [
      "Injured Springer not in Jays' lineup for Game 4",
      "George Springer injury update: Blue Jays slugger out of Game 4 lineup, likely to stay on World Series roster",
      "Blue Jays Make George Springer Lineup Decision for World Series Game 4 After Injury - Sports Illustrated",
      "George Springer not in Blue Jays’ lineup for Game 4 of World Series",
      "After torturing Blue Jays, Ohtani could decide path of World Series in Game 4",
      "How will loss of Springer impact Blue Jays’ World Series aspirations?"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/46762000/george-springer-not-blue-jays-starting-lineup-world-series-game-4-vs-dodgers",
    "alternate_urls": [
      "https://www.cbssports.com/mlb/news/george-springer-injury-update-blue-jays-world-series-roster/",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxNM1RVQnBxSmpvTDRkREVhbEttWTZEaVFCdXNiTUdteGVrakFjdzU1V1JhMU9aMlFfTHhubkdkWFdySDhQZlQ2ZE1FMGxleW16UDlwcjh5NlVzekNlTWNYMlZnYm1KLVc3c3FCNUJjczRZZjUtZjFQbFZXR0pNeUZEVGtnNDV1UlFVMGZrVURER1hKX2FGT0E?oc=5"
    ],
    "link": "https://www.espn.com/mlb/story/_/id/46762000/george-springer-not-blue-jays-starting-lineup-world-series-game-4-vs-dodgers",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.988,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "George Springer, the Toronto Blue Jays star, was sidelined for Game 4 of the World Series against the Los Angeles Dodgers due to right side discomfort experienced during Game 3. Bo Bichette stepped in as the designated hitter, with Nathan Lukes and Addison Barger adjusting their positions in the lineup. The Blue Jays manager, John Schneider, explored various lineup options before finalizing the adjustments for the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Extends Order Blocking Trump Admin from Firing Workers Amid Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 20:35:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Axios",
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Judge extends order barring the Trump administration from firing federal workers during the shutdown AP News",
      "Trump indefinitely barred from firing federal workers during shutdown Axios",
      "D.C.-area Dems scoff at federal workers union's call to end shutdown Axios",
      "Largest federal workers union demands Congress end \"avoidable\" shutdown Axios",
      "A federal judge extended a temporary order blocking the Trump administration's mass-layoff plans during the government shutdown, multiple news outlets reported.",
      "The judge previously issued a temporary restraining order against the job cuts that was set to expire on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Judge extends order barring the Trump administration from firing federal workers during the shutdown - AP News",
      "Trump indefinitely barred from firing federal workers during shutdown - Axios",
      "D.C.-area Dems scoff at federal workers union's call to end shutdown - Axios",
      "Largest federal workers union demands Congress end \"avoidable\" shutdown - Axios",
      "Judge extends ban on Trump firing federal workers during government shutdown",
      "A federal judge just indefinitely barred the Trump administration from firing federal employees during the government shutdown"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSGhieDFrNU8yVTMzNXB6SzhLWjEtTmhtYkVmLWNkU3J3RTZFeGlQLTdMUkdQck5kVW9jSWoxWUNLOW9mbkZyaHF2dkxRNGlxR0FzLU1Pc2FPaFloTHFTeDF1X0Q0Q0JoUmwzREhBU3NpdzZ2QXhPRkx3OEdKXzVCVW9KazVXQmpSa3k1M3pOSWwzdw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxNVXRhZXo4MFp3emtpM1M1QVF6VVQzQ3haVW8zeG5iMWhxX1daXzhRUzlzM3JBVWtQNUxWVjFnUndLbnJzOGo2N0hqNFh6emhyX183RGdTUlpzVTVyZ01qQ0loNWNHMmtERjlsZW1EczBrUmpDMm1wQnRTYVpOVTZ2V2tfelB0UQ?oc=5",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPdjRyY25MczcwYkhPbGZUaTBrbEJyNWhSNWw0ZDAxUF9kWHMwY2wwQ2NKMUdDbHYwZGFXY0FYWEJyS0hsdHVna1JKR1JZLTNQQXpaejNwa2pVS3VVUHIzN1ZXOUp0YmtjLUhwNU8xODJNMHRzNGlzSExIV2M4UGt0a0pqYUhydFpE?oc=5",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxQRmtva1daRWlwcjVWQ205Zlpmdzd6QWs2eXhOTDkxb0pmT21VMkNTMnV1aEFsekZwUjRPNFd6S2taUDhLMmo2d0VITHhXNEJYemtPVUg4c2RuUkNvbEtKYlp2Ry02ZmNwWVFNYjZILXdWSzE5bVFWY1F2NXN4d0xRemZB?oc=5",
      "https://www.cnbc.com/2025/10/28/judge-ban-trump-government-shutdown-layoffs.html",
      "https://fortune.com/2025/10/28/federal-judge-barred-trump-administration-firing-federal-employees-government-shutdown/"
    ],
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSGhieDFrNU8yVTMzNXB6SzhLWjEtTmhtYkVmLWNkU3J3RTZFeGlQLTdMUkdQck5kVW9jSWoxWUNLOW9mbkZyaHF2dkxRNGlxR0FzLU1Pc2FPaFloTHFTeDF1X0Q0Q0JoUmwzREhBU3NpdzZ2QXhPRkx3OEdKXzVCVW9KazVXQmpSa3k1M3pOSWwzdw?oc=5",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.927,
      "consensus": 0.888,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge has indefinitely extended a temporary order preventing the Trump administration from firing federal workers during the government shutdown. This decision comes amid calls from the largest federal workers union for Congress to end the shutdown, which they describe as \"avoidable.\" Despite the union's demands, some D.C.-area Democrats have dismissed their call to action. The judge's ruling blocks any plans for mass layoffs that were set to take place during the shutdown.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Texas Sues Tylenol Makers Over Alleged Autism Risk Concealment",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 20:50:10 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Axios",
      "ABC News",
      "CBC News"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "cbc.ca"
    ],
    "snippets": [
      "Texas sues Tylenol makers J&J and Kenvue, claiming they hid drug's autism risks Reuters",
      "Texas sues Tylenol maker over claims they hid autism risks Axios",
      "Last month, President Trump claimed that Tylenol use during pregnancy is linked to an increased risk of autism, despite limited evidence to suggest an association.",
      "The lawsuit by Texas Attorney General Ken Paxton comes weeks after U.S. President Donald Trump linked Tylenol use during pregnancy to autism in children. The claim is a long-standing one that researchers have not found conclusive evidence to support."
    ],
    "image_url": "",
    "titles": [
      "Texas sues Tylenol makers J&J and Kenvue, claiming they hid drug's autism risks - Reuters",
      "Texas sues Tylenol maker over claims they hid autism risks - Axios",
      "WATCH:  Texas attorney general sues makers of Tylenol over alleged autism claims",
      "Texas sues Tylenol makers J&J and Kenvue, citing unproven link between the drug and autism"
    ],
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQ3BqVENueXJVdm82SkVxbncyekk4SzBIbjZkXzFHaVVhQS02TUxpVWwwdzdrcEtfRjFGSDR2U2dqOW5TbzI4MWFrNTRocnUxekRieHBqb3llbDlLNDFyOW1RMG5Zd1dPWThVUWxLLWxGYVFoMDMzQjY5aW5IbFgwa25oNTR0U1B6MWdjWnVBU2xQdHpGTkFQUG5VZVBIeWtfMFpnXw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVXQtRnowT2QwMWx5SEVjZ1lWTEZPQUt0WnE1Mkp5MHRtc3duSXNfNFBGanZra3JIT2RDaG1wd2Q5UzA3Rk9IYk1pMFpGclBlNmJDcG5NWXZ2OXdzQlc1WThoYXJSX2tYS1hMNmtTT2lSYUdpWW1EaGFFZWpNcTdnNUZDWQ?oc=5",
      "https://abcnews.go.com/US/video/texas-attorney-general-sues-makers-tylenol-alleged-autism-126941535",
      "https://www.cbc.ca/news/health/texas-sues-tylenol-makers-9.6956726?cmp=rss"
    ],
    "link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQ3BqVENueXJVdm82SkVxbncyekk4SzBIbjZkXzFHaVVhQS02TUxpVWwwdzdrcEtfRjFGSDR2U2dqOW5TbzI4MWFrNTRocnUxekRieHBqb3llbDlLNDFyOW1RMG5Zd1dPWThVUWxLLWxGYVFoMDMzQjY5aW5IbFgwa25oNTR0U1B6MWdjWnVBU2xQdHpGTkFQUG5VZVBIeWtfMFpnXw?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.932,
      "consensus": 0.888,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Texas has filed a lawsuit against Tylenol manufacturers Johnson & Johnson and Kenvue, accusing them of concealing the drug's potential autism risks. This legal action follows recent comments by President Trump suggesting a link between Tylenol use during pregnancy and increased autism risk in children, a claim that lacks conclusive scientific support.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rio Police Raid on Red Command Kills 64, Deadliest in State History",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 17:57:46 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Jazeera",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "nytimes.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "At least 60 dead in Rio de Janeiro police operation, local media reports Reuters",
      "At least 64 killed in Rio police raids ahead of climate conferences Reuters",
      "The raid is already being called the most lethal police action in the history of the state of Rio de Janeiro, Brazil.",
      "The authorities said the deadliest operation in Rio’s history had killed four police officers and at least 60 other people. It was an attack on “narco-terrorists,” the state governor said.",
      "The operation was the deadliest in Rio state history. Authorities said they were targeting the Red Command, one of Brazil’s most powerful organized crime groups."
    ],
    "image_url": "",
    "titles": [
      "At least 60 dead in Rio de Janeiro police operation, local media reports - Reuters",
      "At least 64 killed in Rio police raids ahead of climate conferences - Reuters",
      "Police operation in Rio de Janeiro favelas leaves at least 60 people dead",
      "At Least 64 Dead in Rio de Janeiro as Brazilian Police Crack Down on Drug Gangs",
      "Police raid of Rio favelas leaves at least 64 dead"
    ],
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPZmNyZHNMZ05PS183VlUzYkpoRl9rbGRqXzhKSDB6WDBwRTFKS09FQ25uNk5NMFdPRGxNNnZsVVJfX1hZN0FOaVZLVnNibHdLc1NadldvdjZlX3k1RmZwOXZzdWVDYWRCRFVQbmUtVjFlZ3VqR0dwTEdPb01fc245eTdrNXZtQ2Q5UURoWmNZM3o4MVFpeUNxak0ySGxNNm45S205Ujg4MmhWV3N5WWRIb2F5Y09HTWc?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPV0s5YVJxNnZfLTc3OEJzLWFPeDJuSmFMQzUwSnNwMDctOHpyUTN2TkVuTHlaaXJsc0dTa3djWXJvNUo5dFY4by12aWxNZW9kclc2OFdSVUdaRDJlQlFYYlB0MGdObkpZclFYZUl1SzRRVTJ3RTdwSXExbUhaSS1sdTlGTmpGa19DRUtRSEFjOUZ4cDExZG1IMW52Um5YdTF4VDBlVEZZenJZWjlYdnUw?oc=5",
      "https://www.aljazeera.com/news/2025/10/28/police-operation-in-rio-de-janeiro-favelas-leaves-dozens-dead?traffic_source=rss",
      "https://www.nytimes.com/2025/10/28/world/brazil-rio-de-janeiro-police-drug-raids-deaths.html",
      "https://www.washingtonpost.com/world/2025/10/28/rio-alemao-penha-brazil-police-raid/"
    ],
    "link": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPZmNyZHNMZ05PS183VlUzYkpoRl9rbGRqXzhKSDB6WDBwRTFKS09FQ25uNk5NMFdPRGxNNnZsVVJfX1hZN0FOaVZLVnNibHdLc1NadldvdjZlX3k1RmZwOXZzdWVDYWRCRFVQbmUtVjFlZ3VqR0dwTEdPb01fc245eTdrNXZtQ2Q5UURoWmNZM3o4MVFpeUNxak0ySGxNNm45S205Ujg4MmhWV3N5WWRIb2F5Y09HTWc?oc=5",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.878,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Rio de Janeiro, Brazil, a police operation targeting the Red Command, a prominent organized crime group, resulted in at least 64 deaths, making it the deadliest in the state's history. The raid, conducted ahead of climate conferences, saw the loss of four police officers and aimed at combating \"narco-terrorists,\" according to the state governor.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers Beat Blue Jays in 18-Inning World Series Game, Lead Series 2-1",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 15:16:37 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "cbssports.com",
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Dodgers beat Blue Jays in 18-inning World Series epic Reuters",
      "SportsLine's model simulated the Toronto Blue Jays vs. the Los Angeles Dodgers 10,000 times and revealed its MLB picks with Shohei Ohtani starting for the Dodgers",
      "The SportsLine Projection Model has revealed its UTEP Miners vs. Kennesaw State Owls picks for Tuesday",
      "SportsLine's model simulated New York Knicks vs. Milwaukee Bucks 10,000 times and revealed its NBA picks",
      "The SportsLine Projection Model has revealed its James Madison Dukes vs. Texas State Bobcats picks for Tuesday",
      "SportsLine's model simulated Philadelphia vs. Washington 10,000 times and revealed its NBA predictions for Tuesday's matchup",
      "Odds for the Los Angeles Dodgers vs Toronto Blue Jays World Series including results, MVP and stat leaders.",
      "The Toronto Blue Jays will look to bounce back from a gutting loss as they face the Los Angeles Dodgers in Game 4 of the World Series on Tuesday. Los Angeles leads the series 2-1. Live coverage on Sportsnet and Sportsnet+ begins at 8 p.m. ET / 5 p.m. PT, or follow along with our live tracker.",
      "Trey Yesavage is going to get the ball in another huge situation for the Toronto Blue Jays . The rookie right-hander will start Game 5 of the World Series on Wednesday against the Los Angeles Dodgers, the Blue Jays announced Tuesday prior to Game 4. It will be the fifth start of the playoffs and second of the World Series for the 22-year-old Yesavage, who made his MLB debut in September and had just three major-league starts before the post-season. “Each day I learn something new,” said Yesavage to media before Game 4. “I take something away from my game or someone else’s game. So, just...",
      "Blake Snell could have the World Series in his hands. The Los Angeles Dodgers left-hander will start Game 5 on Wednesday against the Toronto Blue Jays , the team announced on Tuesday. Toronto is expected to name its starter later in the day. Snell, 32, was roughed up in a Game 1 loss to the Blue Jays at Rogers Centre when he allowed five runs on eight hits and three walks over five innings. However, he had been dominant in three previous post-season starts, combining for 21 innings, just two runs and 27 strikeouts. Watch the Blue Jays in the World Series on Sportsnet The Toronto Blue Jays are..."
    ],
    "image_url": "",
    "titles": [
      "Dodgers beat Blue Jays in 18-inning World Series epic - Reuters",
      "Dodgers vs. Blue Jays prediction, odds: 2025 World Series Game 4 betting picks, Ohtani props from proven model",
      "UTEP vs. Kennesaw State prediction, odds, line, time: 2025 college football Week 10 picks by proven model",
      "Knicks vs. Bucks odds, prediction, line, time: 2025 NBA picks for October 28 from proven model",
      "James Madison vs. Texas State prediction, odds: 2025 college football Week 10 picks from proven model",
      "76ers vs. Wizards prediction, odds, start time: 2025 NBA picks, October 28 best bets from proven model",
      "World Series Odds: Dodgers in control as MVP favorite Ohtani takes mound for Game 4",
      "World Series on Sportsnet: Blue Jays vs. Dodgers, Game 4",
      "Blue Jays’ Trey Yesavage to start Game 5 of World Series vs. Dodgers",
      "Dodgers’ Blake Snell to start World Series Game 5 against Blue Jays"
    ],
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQbXVsV3lzY0wyN2IwNUplVzhneWZYZDlpaTZFRWRmWjk1eDFmc2pOTFJ1V3o3VTFqZldMN2VZRzAzMGtWdEctYzJFLXFrNk9XbXdJVFNkc043UVlDU0tHMlJ1V3dqRnVvQklWdFFLRDVSTWVNUWczYUpZaFI4bzdQX1NhdTlHOTN1Z0lkUVFXRi1OTU1ORnAxdg?oc=5",
    "alternate_urls": [
      "https://www.cbssports.com/mlb/news/dodgers-blue-jays-prediction-odds-time-2025-world-series-betting-picks-game-4-shohei-ohtani-props/",
      "https://www.cbssports.com/college-football/news/utep-kennesaw-state-prediction-odds-line-time-2025-college-football-week-10-tuesday-picks/",
      "https://www.cbssports.com/nba/news/knicks-bucks-odds-prediction-line-time-nba-picks-for-october-28/",
      "https://www.cbssports.com/college-football/news/james-madison-texas-state-prediction-odds-line-2025-college-football-week-10-tuesday-picks/",
      "https://www.cbssports.com/nba/news/76ers-wizards-prediction-odds-start-time-2025-nba-picks-october-28-best-bets/",
      "https://www.espn.com/espn/betting/story/_/id/46649339/2025-world-series-betting-odds-baseball-futures-mlb-props-lines-spreads-dodgers-blue-jays"
    ],
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQbXVsV3lzY0wyN2IwNUplVzhneWZYZDlpaTZFRWRmWjk1eDFmc2pOTFJ1V3o3VTFqZldMN2VZRzAzMGtWdEctYzJFLXFrNk9XbXdJVFNkc043UVlDU0tHMlJ1V3dqRnVvQklWdFFLRDVSTWVNUWczYUpZaFI4bzdQX1NhdTlHOTN1Z0lkUVFXRi1OTU1ORnAxdg?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.83,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Dodgers defeated the Toronto Blue Jays in an 18-inning World Series game. Leading the series 2-1, the Dodgers are set to face the Blue Jays again, with Blake Snell starting for Los Angeles in Game 5. The Blue Jays will counter with rookie Trey Yesavage. SportsLine's model has also made predictions for various sports matchups, but the focus remains on the World Series, where the Dodgers currently have the upper hand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prunella Scales, Iconic \"Fawlty Towers\" Star, Dies at 93",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 14:27:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "bbc.com",
      "washingtonpost.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "Fawlty Towers actress Prunella Scales, best known for playing hotel manager Sybil Fawlty, has died aged 93.",
      "The British actress had her most indelible role as the formidable innkeeper Sybil Fawlty, opposite John Cleese in the beloved 1970s sitcom “Fawlty Towers.”",
      "Actor portrayed Sybil Fawlty and later charmed viewers with her canal boat journeys alongside husband Timothy West Prunella Scales: a life in pictures Michael Billington: Scales was a queen of comedy with a passion for classical theatre Share your tributes and memories of Prunella Scales Prunella Sc",
      "Actor Prunella Scales, best known as acid-tongued Sybil Fawlty in the classic British comedy Fawlty Towers, has died, her children said Tuesday. She was 93."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b96a/live/f4aa2480-b406-11f0-b2a1-6f537f66f9aa.jpg",
    "titles": [
      "Watch Prunella Scales's memorable moments in Fawlty Towers",
      "Prunella Scales, comically imperious wife on ‘Fawlty Towers,’ dies at 93",
      "Fawlty Towers actor Prunella Scales dies aged  93",
      "Prunella Scales, sharp-tongued and long-suffering wife on Fawlty Towers, dead at 93"
    ],
    "url": "https://www.bbc.com/news/videos/cvgwv8jjjyno?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/obituaries/2025/10/28/prunella-scales-dead-fawlty-towers/",
      "https://www.theguardian.com/tv-and-radio/2025/oct/28/fawlty-towers-actor-prunella-scales-dies-at-the-age-of-93",
      "https://www.cbc.ca/news/entertainment/obit-uk-actor-prunella-scales-obit-9.6956315?cmp=rss"
    ],
    "link": "https://www.bbc.com/news/videos/cvgwv8jjjyno?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.816,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.752,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prunella Scales, famed for her role as Sybil Fawlty in \"Fawlty Towers,\" has passed away at 93. Renowned for her performance in the iconic British sitcom alongside John Cleese, she also delighted audiences with canal boat journeys with her husband, Timothy West. Her children confirmed her death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ohtani to Pitch Game 4 for Dodgers, Blue Jays Avoid Him, Bieber Reacts",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 17:47:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Who is left to pitch? What will Ohtani do next? Here's what to expect as L.A. and Toronto return for an encore.",
      "Japanese star was almost unstoppable in Game 3 Ohtani will also pitch in Game 4 for Dodgers After watching Shohei Ohtani baffle their pitching staff during Game 3 of the World Series, the Toronto Blue Jays have made a bold decision: they are done pitching to baseball’s biggest star. Blue Jays manage",
      "Blue Jays Fan Justin Bieber Hilariously Reacts to Shohei Ohtani HR During World Series Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "Who is left to pitch? What will Ohtani do next? Here's what to expect in World Series Game 4",
      "Blue Jays will not pitch to devastating Shohei Ohtani for rest of World Series",
      "Blue Jays Fan Justin Bieber Hilariously Reacts to Shohei Ohtani HR During World Series - Bleacher Report"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/46753864/world-series-2025-blue-jays-dodgers-game-3-marathon-game-4-preview-bullpen-ohtani",
    "alternate_urls": [
      "https://www.theguardian.com/sport/2025/oct/28/shohei-ohtani-blue-jays-walk-world-series",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxNc29wNktFUEZnU05BdWZsWUFTdGpJV1NFYUZrcGJkYmxQbGJ5cVF2bGtHMGpjVWpQTmZsdTNHa1FxYkhab2NPa1N1T3g5MkQ3Z3VRRngwd1hxcDhabjhwQ0FKNmFzM2FYQXFGX0pNQUlxZHA0SzE1ejI3NHY1UkxGWGJjdlhfTjhQWUdUTTgxNk1UQTdxOUZVa2R1ZDZDX3g4VjJwZWREYm5nZFpXOGRzX2ZiMlhGUjhFV19tYjFvSDU2MnBHQ1o4?oc=5"
    ],
    "link": "https://www.espn.com/mlb/story/_/id/46753864/world-series-2025-blue-jays-dodgers-game-3-marathon-game-4-preview-bullpen-ohtani",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shohei Ohtani, after an impressive performance in Game 3 of the World Series, will pitch for the Dodgers in Game 4. Following Ohtani's standout game, the Toronto Blue Jays have decided not to pitch to the Japanese star. Additionally, celebrity fan Justin Bieber humorously reacted to an Ohtani home run during the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "24 States Sue Trump Admin Over SNAP Benefit Suspension Amid Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 21:43:44 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "States sue over Trump administration suspending food benefits during shutdown Reuters",
      "Two dozen states sue Trump administration over impending SNAP cuts Axios",
      "The SNAP program provides food stamps to about 42 million Americans. The program is on the verge of running out of funds because of the government shutdown."
    ],
    "image_url": "",
    "titles": [
      "States sue over Trump administration suspending food benefits during shutdown - Reuters",
      "Two dozen states sue Trump administration over impending SNAP cuts - Axios",
      "States sue Trump administration to keep SNAP benefits during government shutdown"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNZmc4ZXF5clhERmduX3R3SjF6UGV5ODh4bGIxcmg1eC02SjFoQlFfWTdONWRQZUl0SC1ucVVkbDVuNmYya2lqUnVxazFBZFNib2JoNVp2RllBWjl3TDE1SFhsRnluWGEtQVZhckZQMS0wU19JZnJNZm1OZGY5dDF5cnJUVXlreldXZG12ejRPYXV3eVFrRXpzQTdwNmxPNEtXOWh2WUdrZVEwMnNGcndqd1Ryb3VUTXZzV3RUWEc2NA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifkFVX3lxTE9vanlzd2RoblN6M2NzSGJTWTM2Q05Xc3QtYkM0YWFaU2hkbGp5UXlEclloX1V3TFdYaF9ld2UxQ3g3eXFvanF4SU9uajE5cGVfTENsNGE4eDlvNjRSMDNiMlBjZnkyRUNIWVplMDU5bkd0QTJiaDVWczZxdEh4UQ?oc=5",
      "https://www.cnbc.com/2025/10/28/trump-snap-benefits-government-shutdown.html"
    ],
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNZmc4ZXF5clhERmduX3R3SjF6UGV5ODh4bGIxcmg1eC02SjFoQlFfWTdONWRQZUl0SC1ucVVkbDVuNmYya2lqUnVxazFBZFNib2JoNVp2RllBWjl3TDE1SFhsRnluWGEtQVZhckZQMS0wU19JZnJNZm1OZGY5dDF5cnJUVXlreldXZG12ejRPYXV3eVFrRXpzQTdwNmxPNEtXOWh2WUdrZVEwMnNGcndqd1Ryb3VUTXZzV3RUWEc2NA?oc=5",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.949,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two dozen states have filed lawsuits against the Trump administration for suspending food benefits under the SNAP program, which aids approximately 42 million Americans. This legal action comes as the program faces a funding crisis due to the government shutdown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Norrie Defeats World No. 1 Alcaraz in Paris Masters Upset",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 22:43:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "British's Cameron Norrie stuns world number one Carlos Alcaraz with a gritty comeback in the second round at the Paris Masters.",
      "British No 2 recovers to win 4-6, 6-3, 6-4 in second round Alcaraz’s fine run ends with tally of 54 unforced errors Cameron Norrie produced the greatest win of his career as he recovered from a set down to topple the world No 1 Carlos Alcaraz 4-6, 6-3, 6-4 in the second round of the Paris Masters. A",
      "Cameron Norrie claimed a shock three-set win over world No 1 Carlos Alcaraz in the second round at the Rolex Paris Masters on Tuesday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/71a4/live/f3a56ba0-b43b-11f0-8619-03f374390a48.jpg",
    "titles": [
      "Norrie stuns Alcaraz for 'biggest win of career'",
      "Cameron Norrie hails ‘biggest win’ after roaring back to beat Carlos Alcaraz in Paris",
      "Norrie lands biggest win of career over world No 1 Alcaraz at Paris Masters"
    ],
    "url": "https://www.bbc.com/sport/tennis/articles/c4gkz8mkjleo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/sport/2025/oct/28/cameron-norrie-hails-biggest-win-career-roaring-back-beat-carlos-alcaraz-paris-masters",
      "https://www.skysports.com/tennis/news/12040/13459396/carlos-alcaraz-suffers-shock-three-set-defeat-to-british-no-2-cameron-norrie-in-second-round-at-the-paris-masters"
    ],
    "link": "https://www.bbc.com/sport/tennis/articles/c4gkz8mkjleo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British tennis player Cameron Norrie achieved a significant victory by defeating world number one Carlos Alcaraz 4-6, 6-3, 6-4 in the second round of the Paris Masters. This match marked the greatest win of Norrie's career, overcoming a set deficit and capitalizing on Alcaraz's 54 unforced errors to secure the comeback.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Media Enters Prediction Markets, Expanding Business Sector",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 19:25:24 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Axios",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Trump Media to enter prediction markets business Reuters",
      "Trump Media enters prediction market business Axios",
      "Trump Media to Enter Booming Prediction Markets Business Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "Trump Media to enter prediction markets business - Reuters",
      "Trump Media enters prediction market business - Axios",
      "Trump Media to Enter Booming Prediction Markets Business - Bloomberg"
    ],
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQUkJWZWFIMXVoQ2piY1hYZjR2MXhxNmpjcHNzTG8yUk9hVWxCU2N5bjlPMUZ6WDJoQXpiWXVXczZWd2RUMEVUdU4wekJlSV9sT1ZITDhpVjVkR1hrNFhfZHF1VUUwOTk1LVdFQUYtUERwakhWejZrSFlkZGxiS2h2bG84WURMNHhaNlJaalNQRkhoX1FvMXg2S3RKWDRzMkVENFU1TnlHUQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMickFVX3lxTE14Ym1xNFZZTi01S0VaUVdPbFF2dmVXeUkycVJqWlFSRFNSX21sSzNWdjlqOGktd3ZlWkxnRUxHckxheDNJbDNKazhiTmNyMERTRmluMWZ4R19RUEs5ZWYtLWp3OEJkc1h4TURwd3g4aDI5Zw?oc=5",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxOYzV5Um1semllSEs5MC00dHpVdWV6dFo0Z2xVVWVkRkhxNnl1TmlidTBveW4ybURBZnZhZi1EODFSdjlrQ1V6U0NMcnltSjlGekpaYmtWbkxndWJzbW45WjRfUWtWODE3dG1SRXpWd192VUUwSktmeHY0S0dTRHJzVnZSX2k3S01DZ1laVHViVXdGMHFKQ0ZYYU1JaUdNOVEwTE5mXzFCNlZRQnJJOW9UQko2MA?oc=5"
    ],
    "link": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQUkJWZWFIMXVoQ2piY1hYZjR2MXhxNmpjcHNzTG8yUk9hVWxCU2N5bjlPMUZ6WDJoQXpiWXVXczZWd2RUMEVUdU4wekJlSV9sT1ZITDhpVjVkR1hrNFhfZHF1VUUwOTk1LVdFQUYtUERwakhWejZrSFlkZGxiS2h2bG84WURMNHhaNlJaalNQRkhoX1FvMXg2S3RKWDRzMkVENFU1TnlHUQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.905,
      "consensus": 0.749,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trump Media has announced its entry into the prediction markets business, according to reports from Reuters, Axios, and Bloomberg. This move marks the company's expansion into a growing financial sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Restructures Microsoft Deal, Valued at $500bn, Gains 27% Stake",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 15:41:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Fortune",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "The deal removes a major constraint on raising capital for OpenAI, the maker of ChatGPT, and values firm at $500bn.",
      "The restructuring ends years of capital constraints for OpenAI, and grants Microsoft long-term technology access and new AGI rights under the updated deal.",
      "OpenAI has become a public benefit corporation, giving Microsoft a 27% stake and long-term access to research methods",
      "OpenAI and Microsoft Are Avoiding a Messy Breakup Bloomberg",
      "OpenAI Gives Microsoft 27% Stake, Completes For-Profit Shift Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "OpenAI restructures into public-benefit firm, Microsoft takes 27% stake",
      "OpenAI completes for-profit restructuring and grants Microsoft a 27% stake in the company",
      "As OpenAI restructures, Microsoft locks in long-term gains",
      "OpenAI and Microsoft Are Avoiding a Messy Breakup - Bloomberg",
      "OpenAI Gives Microsoft 27% Stake, Completes For-Profit Shift - Bloomberg"
    ],
    "url": "https://www.aljazeera.com/economy/2025/10/28/openai-restructures-into-public-benefit-firm-microsoft-takes-27-stake?traffic_source=rss",
    "alternate_urls": [
      "https://fortune.com/2025/10/28/openai-for-profit-restructuring-microsoft-stake/",
      "https://fortune.com/2025/10/28/openai-restructure-for-profit-microsoft-pbc-long-term-gains-agi/",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNVzJ1VURIS2NncGR1M21DNVhTeDFUVGxBX0JWdzVDYmMxVURBaFgtak5xZ3JPZGtCR1dMVXhqVDlSMHgyQnctOFF5SDhHNzNfRVNVN2lTS28tazdHNlNJM0VqbFRRa3VyWG84ZnBoTnczNkNtcERTcmdYQWpHU3dra1phMFp3cmMtbzh2LVgyR2dUd09TZWI0UTVmaVlKQ0dRNGpMSDlB?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQdUppODQ4T3RCcmo4b1ZKbmgwWngxR2pJZzh6MjJNTDdpTXpKNHdKeVNoNXViQTdLVXdLanprdDNJQjNraFE1ZnpLUmlBcHZ3NC03LWFUS3NhTlV5WU41WFRLVzYwMkZ2VXNWZExQRW5kTHJETTg4VUZsWWt3cEdiRnFBRzJyMHFxRnpJYktIRWhZckl3VEhpcjdtaVJWZXVsUkY5VVNpN0VGVXdGNkExeg?oc=5"
    ],
    "link": "https://www.aljazeera.com/economy/2025/10/28/openai-restructures-into-public-benefit-firm-microsoft-takes-27-stake?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.837,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI, the creator of ChatGPT, has restructured its deal with Microsoft, removing capital constraints and valuing the firm at $500bn. This new agreement gives Microsoft a 27% stake in OpenAI, now a public benefit corporation, and ensures Microsoft long-term access to technology and artificial general intelligence (AGI) rights. This move completes OpenAI's shift to a for-profit model while maintaining a partnership with Microsoft.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poilievre Backs Bill C-225 to Address Rising Intimate Partner Violence",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 28 Oct 2025 21:42:13 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Conservatives are pushing a private member's bill they say would combat intimate partner violence — just as a new report tracks how the problem has grown in recent years.",
      "OTTAWA — Conservative Leader Pierre Poilievre called on other parties Tuesday to support a private member’s bill he said would combat intimate partner violence — just as a new report tracks how the problem has grown in recent years. Bill C-225, introduced by Conservative MP Frank Caputo, would autom"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/7602b7a1ab60ca5a2585d8300b28deb7f90c9f3c9224b4bd7230fbf20edcca15_986a2f.jpg?quality=65&strip=all",
    "titles": [
      "Liberals urged to increase penalties for intimate partner violence, murder",
      "Tories call on all parties to back tougher sentences for intimate partner violence"
    ],
    "url": "https://globalnews.ca/news/11499046/intimate-partner-violence-murder-bill-liberals-conservatives-bailey-mccourt/",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/28/tories-call-on-all-parties-to-back-tougher-sentences-for-intimate-partner-violence/"
    ],
    "link": "https://globalnews.ca/news/11499046/intimate-partner-violence-murder-bill-liberals-conservatives-bailey-mccourt/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Conservative Leader Pierre Poilievre is urging support for Bill C-225, introduced by MP Frank Caputo, aimed at combating intimate partner violence, in light of a new report showing an increase in such cases.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Signs $80 Billion Deal with Westinghouse for Nuclear Reactors",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 14:33:40 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Bloomberg",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "marketwatch.com"
    ],
    "snippets": [
      "$80 billion strategic partnership for U.S. nuclear Axios",
      "US Signs $80 Billion Pact With Westinghouse for Nuclear Reactors Bloomberg",
      "The U.S. government announced a pact to build at least $80 billion worth of nuclear reactors, in a pact to meet the growing power demands caused by artificial intelligence."
    ],
    "image_url": "",
    "titles": [
      "$80 billion strategic partnership for U.S. nuclear - Axios",
      "US Signs $80 Billion Pact With Westinghouse for Nuclear Reactors - Bloomberg",
      "U.S. says $80 billion worth of nuclear reactors will be built. Cameco’s stock jumps."
    ],
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNMHJDQUJpeE1FNXdYaDd3TmJuZ2xSMWlQQW9wbEdpeVQzZjNRdWFJX29veUNXMVpkdEpNajZKTGw2bG5rdm1kTW0xVV83Z0NSaVFIeG9CcFE2T1JtMUl0OXFoY3BGS09NUzFGSGgyODBoSV9wSmN2NUJFZmNITzlYVjZ5T3BaajA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQcmFXVEgwOFUzUGdvRzlJWmszSFFLcjF1MVJ6ejM2YndIQ3hjVWhWc1BibzJyTFpRSWhHV04zRDJva2Nqb2pqT1owQkFjT0NkRUQ1elRyOWJpbHF6eVhiNWN5R3ZNMnFRUWFrc3JKM3lLb1V0V3RXUmRpalYtbzhoYnFYam9sWGtoakRUNVpPUTF3dHVPdUFzNFNaa3E4cEZxYi1RZ3N1U0NOV3VuWDdiZW1KX2k?oc=5",
      "https://www.marketwatch.com/story/u-s-says-80-billion-worth-of-nuclear-reactors-will-be-built-camecos-stock-jumps-356b5b0f?mod=mw_rss_topstories"
    ],
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNMHJDQUJpeE1FNXdYaDd3TmJuZ2xSMWlQQW9wbEdpeVQzZjNRdWFJX29veUNXMVpkdEpNajZKTGw2bG5rdm1kTW0xVV83Z0NSaVFIeG9CcFE2T1JtMUl0OXFoY3BGS09NUzFGSGgyODBoSV9wSmN2NUJFZmNITzlYVjZ5T3BaajA?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.818,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government has signed a strategic partnership worth $80 billion with Westinghouse to construct nuclear reactors. This agreement aims to address the increasing power demands fueled by advancements in artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario Proposes Tax Rebate for First-Time Homebuyers, Critics Skeptical",
    "domain": "general",
    "source_domain": "cbc.ca",
    "location": "local",
    "published": "Tue, 28 Oct 2025 13:56:49 EDT",
    "source": "CBC",
    "sources": [
      "CBC",
      "CityNews"
    ],
    "domains": [
      "cbc.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Ontario government is proposing to help first-time homebuyers by lowering costs with a sales tax rebate it says could save up to $130,000, when combined with other provincial and federal saving initiatives.",
      "TORONTO — Some first-time homebuyers in Ontario could soon save tens of thousands of dollars on the cost of a home under a proposal from the provincial government to rebate the HST, but opposition leaders say it is too “unambitious” amid a housing crisis. The Ontario government had previously signal"
    ],
    "image_url": "",
    "titles": [
      "Ontario government proposes tax relief for some first-time homebuyers",
      "Ontario proposes to rebate HST for some first-time homebuyers"
    ],
    "url": "https://www.cbc.ca/news/canada/toronto/ontario-first-time-homebuyer-hst-rebate-9.6956917?cmp=rss",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/28/ontario-proposes-to-rebate-hst-for-some-first-time-homebuyers/"
    ],
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-first-time-homebuyer-hst-rebate-9.6956917?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.68,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Ontario government has proposed a sales tax rebate aimed at assisting first-time homebuyers, potentially saving them up to $130,000 when combined with other provincial and federal initiatives. This move, intended to reduce the financial burden on new homeowners, has been criticized by opposition leaders as insufficient in addressing the broader housing crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heat's Terry Rozier Arrested for Alleged Game Fixing, Faces IRS Lien",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 19:39:23 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Heat guard Terry Rozier, who was placed on leave amid allegations he manipulated his performance in a March 2023 NBA game as part of gambling schemes, was facing an $8 million tax lien from the IRS in November 2023.",
      "Rozier was arrested last week in connection with a gambling scheme"
    ],
    "image_url": "",
    "titles": [
      "Heat's Rozier faced $8M tax lien from IRS in '23",
      "Terry Rozier faced $8 million tax lien amid alleged involvement in sports betting ring"
    ],
    "url": "https://www.espn.com/nba/story/_/id/46760404/heat-terry-rozier-faced-8-million-tax-lien-irs-2023",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/terry-rozier-tax-lien-sports-betting-ring/"
    ],
    "link": "https://www.espn.com/nba/story/_/id/46760404/heat-terry-rozier-faced-8-million-tax-lien-irs-2023",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Terry Rozier, a guard for the Heat, was arrested for his involvement in a gambling scheme allegedly manipulating his performance in a March 2023 NBA game. Additionally, in November 2023, he faced an $8 million tax lien from the IRS. Rozier has been placed on leave by his team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SEC Commissioner Criticizes NCAA's New Betting Rule in Letter",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 19:39:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "SEC commissioner Greg Sankey sent a letter to NCAA president Charlie Baker on Oct. 25, stating that a rule change allowing athletes to bet on professional sports is a step in the wrong direction.",
      "Athletes will soon be permitted to gamble on professional sports"
    ],
    "image_url": "",
    "titles": [
      "Sankey asks NCAA to rescind betting rule change",
      "Greg Sankey urges NCAA to nix rule change permitting sports betting: 'Major step in the wrong direction'"
    ],
    "url": "https://www.espn.com/college-sports/story/_/id/46758191/sankey-implores-ncaa-axe-ruling-allowing-pro-sports-betting",
    "alternate_urls": [
      "https://www.cbssports.com/college-football/news/greg-sankey-ncaa-sports-betting/"
    ],
    "link": "https://www.espn.com/college-sports/story/_/id/46758191/sankey-implores-ncaa-axe-ruling-allowing-pro-sports-betting",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SEC Commissioner Greg Sankey expressed opposition to the NCAA's upcoming rule change in a letter to President Charlie Baker on Oct. 25. The new rule will allow athletes to bet on professional sports, a move Sankey believes is misguided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Saints to Start Rookie QB Tyler Shough Against Rams",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 17:46:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "After benching Spencer Rattler during their Week 8 loss, the Saints will start their second-round pick Sunday.",
      "The struggling New Orleans Saints have decided to give rookie quarterback Tyler Shough his first NFL start against the Rams in Los Angeles on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Why the Saints are turning to QB Tyler Shough now",
      "Saints giving rookie QB Tyler Shough his first NFL start against Rams"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/46759407/why-new-orleans-saints-turning-quarterback-tyler-shough-now-week-9-los-angeles-rams",
    "alternate_urls": [],
    "link": "https://www.espn.com/nfl/story/_/id/46759407/why-new-orleans-saints-turning-quarterback-tyler-shough-now-week-9-los-angeles-rams",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New Orleans Saints will start rookie quarterback Tyler Shough for the first time in their upcoming game against the Rams in Los Angeles, following the benching of Spencer Rattler during their Week 8 loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia to Build AI Supercomputers for US, Eyes Return to China Market",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 22:56:07 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com"
    ],
    "snippets": [
      "Nvidia will build AI supercomputers for US Energy Department, wants to get back into China Reuters",
      "Nvidia is striking deals around the world while also navigating a US-China trade war."
    ],
    "image_url": "",
    "titles": [
      "Nvidia will build AI supercomputers for US Energy Department, wants to get back into China - Reuters",
      "Nvidia will build AI supercomputers for US Department of Energy"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNTjJsbjFmZHpPMEwwWmY2aE9Eb0VwM01ab2FtM1d2OUNqcFoycUZqUjI5UTNyMXlMNVVUOGpFUFJKYTRkNmN0OVhpa1F4OHB5QVVCTFlnWmU2R0pfaUZDTG5XLTlxRmpvNmdOaDFPYkFLSlo5eXl6Wk5aTEppV2RyQlBfY3dnMnpKWG5GUXI2Wk1KRWU4b2lKR0NaaU9FV1ROYW1VQ0NBb3EyUVItUzZQenR3?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/economy/2025/10/28/nvidia-will-build-ai-supercomputers-for-us-department-of-energy?traffic_source=rss"
    ],
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNTjJsbjFmZHpPMEwwWmY2aE9Eb0VwM01ab2FtM1d2OUNqcFoycUZqUjI5UTNyMXlMNVVUOGpFUFJKYTRkNmN0OVhpa1F4OHB5QVVCTFlnWmU2R0pfaUZDTG5XLTlxRmpvNmdOaDFPYkFLSlo5eXl6Wk5aTEppV2RyQlBfY3dnMnpKWG5GUXI2Wk1KRWU4b2lKR0NaaU9FV1ROYW1VQ0NBb3EyUVItUzZQenR3?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nvidia has agreed to construct AI supercomputers for the US Energy Department and is simultaneously seeking ways to re-enter the Chinese market amidst ongoing US-China trade tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Heisman Trophy Rankings and QB Report Cards Released",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 28 Oct 2025 15:18:56 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Individual and composite rankings for each position in PPR and IDP formats, plus Eric Karabell's superflex ranks.",
      "B/R's 2025 Heisman Trophy Rankings after Week 9 Bleacher Report",
      "Report Card Grades for Top 20 College Football QBs After Week 9 Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "Experts' rankings for Week 9",
      "B/R's 2025 Heisman Trophy Rankings after Week 9 - Bleacher Report",
      "Report Card Grades for Top 20 College Football QBs After Week 9 - Bleacher Report"
    ],
    "url": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxPVElZeExuUkpBYmNWUUlJdHRIVnhwUEhBX01helJTYjc5M1NBMGRSZ0ZLU19oNGYzcG9yd1V4ZEVWeEFqYUZiZTJiQWZBWW9RMDF4YW5mNzBhTmpOeThtdkJSdk9DbDNrZlhLN1Bjc1JkRkdkME01MHBXckJlcm56eng4czY0eGRSUmZNTVI2b19NQWxW?oc=5",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQNktZRzk0dEd5S1FaT1J3bWhQdWIzbGJBQWV6bmxBdnJ4MFNQMWpvRDZ0UGp1dWpWWVRXNnFlNUltUU9QbFAzMzFDLXE4RGYyS1p6SXN4SWNSeWRaQnliMWIya09wUGFRYW8tRUpVUExPUWZXeDhKd3Q1Y2R2TWpnT0gxVXBGX2tJdlA3aW9xbk5GVzdqeGY2T0RPQXNmR0tjY1F5RXhCSQ?oc=5"
    ],
    "link": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bleacher Report released its 2025 Heisman Trophy rankings and report card grades for the top 20 college football quarterbacks after Week 9. Additionally, individual and composite rankings for each position in PPR and IDP formats, including Eric Karabell's superflex ranks, were published. These updates provide insights into player performances and future prospects in college football.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "11,000 Air Traffic Controllers Unpaid Amid US Shutdown",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 22:00:28 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Hundreds of air traffic controllers take second jobs as US shutdown continues Reuters",
      "Nearly 11,000 air traffic controllers, deemed essential workers, did not receive wages for two weeks of work Air traffic controllers and Transportation Security Administration employees have missed their first paycheck as the federal government shutdown rolls through its fourth week. They remain req"
    ],
    "image_url": "",
    "titles": [
      "Hundreds of air traffic controllers take second jobs as US shutdown continues - Reuters",
      "Air traffic controllers receive $0 paychecks as government shutdown stretches"
    ],
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNTC1iSk0zbUdBdlhidVNlZkVfelZmWEZHbFpLN19zVjZjTlM5S3JOaE5ZdUMwOXlvR3B1bWNXdV9mM19rcnY4cEhjMjFxYVFjeGVIUlhOV0ExajhBWFNZZlJwUHVSN0dvRkJaWkt4TWoyY1Eyb0VkR2VVdlgxX2lUYXo2dklFelM0bHl6NmtONThsek1jM1A4dkVodnExT3lIdThQUXNmM29FUjlTV3VnNFJwYjE3RWNjeXZLTk9GU0UyWjdtTGc?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/oct/28/air-traffic-controllers-pay-government-shutdown"
    ],
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNTC1iSk0zbUdBdlhidVNlZkVfelZmWEZHbFpLN19zVjZjTlM5S3JOaE5ZdUMwOXlvR3B1bWNXdV9mM19rcnY4cEhjMjFxYVFjeGVIUlhOV0ExajhBWFNZZlJwUHVSN0dvRkJaWkt4TWoyY1Eyb0VkR2VVdlgxX2lUYXo2dklFelM0bHl6NmtONThsek1jM1A4dkVodnExT3lIdThQUXNmM29FUjlTV3VnNFJwYjE3RWNjeXZLTk9GU0UyWjdtTGc?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nearly 11,000 air traffic controllers, deemed essential workers, have not been paid for two weeks due to the ongoing US government shutdown, now in its fourth week. Many have taken second jobs to cope. This marks the first missed paycheck for these workers and Transportation Security Administration employees.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Study Reveals P-bodies Influence on Stem Cell Differentiation",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 10:31:55 GMT",
    "source": "Nature",
    "sources": [
      "Nature",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Selective RNA sequestration in biomolecular condensates directs cell fate transitions Nature",
      "A new study published in Nature Biotechnology shows that stem cell differentiation is linked to cellular structures called P-bodies, providing a potential means of controlling cell identity. Researchers at Baylor College of Medicine, the University of Colorado Boulder and collaborating institutions"
    ],
    "image_url": "",
    "titles": [
      "Selective RNA sequestration in biomolecular condensates directs cell fate transitions - Nature",
      "Unlocking cell identity: RNA sequestration in P-bodies directs cell fate transitions"
    ],
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5Qc001NFVkSHIySU1EV0lrT2ZhMkNuc2RhQmZOOXg4ZnRUb1otb05JLUdJelFQTkZFZ0tDY1Zhdy1ULUF4b0VQeEtvVzEzVk1wdFhuUzVsY0pGUDNmdXJj?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2025-10-cell-identity-rna-sequestration-p.html"
    ],
    "link": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5Qc001NFVkSHIySU1EV0lrT2ZhMkNuc2RhQmZOOXg4ZnRUb1otb05JLUdJelFQTkZFZ0tDY1Zhdy1ULUF4b0VQeEtvVzEzVk1wdFhuUzVsY0pGUDNmdXJj?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.752,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.605,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A study in Nature Biotechnology by researchers from Baylor College of Medicine and the University of Colorado Boulder has discovered that stem cell differentiation is influenced by cellular structures known as P-bodies. This finding suggests a possible method to control cell identity by manipulating these structures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tech Giants Oppose Australia's Youth Social Media Ban, Vow Compliance",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 09:04:12 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Ars Technica"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Meta, TikTok and Snap say they oppose Australia's youth social media ban but will comply with it Reuters",
      "Platforms expect to monitor a range of signals, but age detection will be spotty."
    ],
    "image_url": "",
    "titles": [
      "Meta, TikTok and Snap say they oppose Australia's youth social media ban but will comply with it - Reuters",
      "Australia’s social media ban is “problematic,” but platforms will comply anyway"
    ],
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQdHR6UUdsSmtHNWoxb0Fpc3pfSVQ5YllsUTVsTjZLbGVpcWdkSXdVRHhLZnE3cjVuWmxKc3ZCWm5WV2l3TGRQREptcDBXUkVRa0pKNlRMaWc0SnpmRXhCdDZhYWloVVo1d1RMZUpQQXI1bld6UGMzWnR0YVlxT3JlUlBqU1gzNS1FS1Y1OGh0MTZzbk5fOTlpM1VXQW1uMUVBbkcwS29qa29NNjV3RGt1NlRsWjZBSXI3MmRHaVJod0daMzhHLVpvRWtPZGJTT3FBdzMw?oc=5",
    "alternate_urls": [
      "https://arstechnica.com/tech-policy/2025/10/social-media-firms-abandon-fight-against-australia-law-banning-under-16-users/"
    ],
    "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQdHR6UUdsSmtHNWoxb0Fpc3pfSVQ5YllsUTVsTjZLbGVpcWdkSXdVRHhLZnE3cjVuWmxKc3ZCWm5WV2l3TGRQREptcDBXUkVRa0pKNlRMaWc0SnpmRXhCdDZhYWloVVo1d1RMZUpQQXI1bld6UGMzWnR0YVlxT3JlUlBqU1gzNS1FS1Y1OGh0MTZzbk5fOTlpM1VXQW1uMUVBbkcwS29qa29NNjV3RGt1NlRsWjZBSXI3MmRHaVJod0daMzhHLVpvRWtPZGJTT3FBdzMw?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.729,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta, TikTok, and Snap have expressed opposition to Australia's proposed youth social media ban but have committed to complying with it. These platforms anticipate challenges in accurately detecting users' ages, acknowledging that age verification methods may not be entirely reliable.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientific American Analyzes Hurricane Melissa's Evolution and Impact",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 18:45:00 GMT",
    "source": "Scientific American",
    "sources": [
      "Scientific American"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Monster Hurricane Melissa Explained in Images Scientific American",
      "The Science of How Hurricane Melissa Became So Extreme Scientific American"
    ],
    "image_url": "",
    "titles": [
      "Monster Hurricane Melissa Explained in Images - Scientific American",
      "The Science of How Hurricane Melissa Became So Extreme - Scientific American"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQUmpzb2U4bjM0dWwwM0p3WkpWU0hYX2IyOXRkc1ljNmtxVEctX1NRUmgyWVh1QlMzcE9KM1FtY0w1VTlBNmVOQnBrWVJjaXdMZ0E3SmRMb0pndS1FUkhNb1RZZHJoeWoySks5QThOeEdvQTZSSFN2ZGNNUGxjaUJUNXdVVlljZXhkNWV0V1lFTnM4Z1BmUXFidXhjV29Temh1V09WU0U2ZkQ3NGd2MHA2RlVBbjQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxOWV9FWm1QWFpSZjdfWmpRUjZJc21za3dHbXQweVBLWTg3V3JnLURQUk9MSU5TZnRMd2ROX0s2NWx5UU9NUlkxSU1LRWNCZ3RXZEZuekpfd2l5b0VaVFRtOWtzVXdqWGx0NXdPRC1sVmRXTFl5RlFuODhuaklHY2M1LU1ETndERkllbkJSYVJsVDJFc3VLSnFTTU1DMHZfbEU?oc=5"
    ],
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQUmpzb2U4bjM0dWwwM0p3WkpWU0hYX2IyOXRkc1ljNmtxVEctX1NRUmgyWVh1QlMzcE9KM1FtY0w1VTlBNmVOQnBrWVJjaXdMZ0E3SmRMb0pndS1FUkhNb1RZZHJoeWoySks5QThOeEdvQTZSSFN2ZGNNUGxjaUJUNXdVVlljZXhkNWV0V1lFTnM4Z1BmUXFidXhjV29Temh1V09WU0U2ZkQ3NGd2MHA2RlVBbjQ?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.892,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hurricane Melissa was extensively analyzed by Scientific American, which used images and scientific explanations to detail how it evolved into an extreme weather event. The coverage provided insights into the meteorological conditions and processes that contributed to the hurricane's intensity, offering a comprehensive understanding of its development and impact.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "CyDeploy Innovates with Digital Twin Tech; Elloe AI Launches Fact-Check System",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 28 Oct 2025 18:20:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Tina Williams-Koroma said CyDeploy uses machine learning to understand what happens on a company’s machine and then creates a “digital twin” where system administrators can test updates.",
      "Elloe AI promises a system capable of fact-checking AI outputs, making sure they don’t violate laws and regulations, and that they are safe for the users."
    ],
    "image_url": "",
    "titles": [
      "CyDeploy wants to create a replica of a company’s system to help it test updates before pushing them out — catch it at Disrupt 2025",
      "Elloe AI wants to be the ‘immune system’ for AI — check it out at Disrupt 2025"
    ],
    "url": "https://techcrunch.com/2025/10/28/cydeploy-wants-to-create-a-replica-of-a-companys-system-to-help-it-test-updates-before-pushing-them-out-catch-it-at-disrupt-2025/",
    "alternate_urls": [
      "https://techcrunch.com/2025/10/28/elloe-ai-wants-to-be-the-immune-system-for-ai-check-it-out-at-disrupt-2025/"
    ],
    "link": "https://techcrunch.com/2025/10/28/cydeploy-wants-to-create-a-replica-of-a-companys-system-to-help-it-test-updates-before-pushing-them-out-catch-it-at-disrupt-2025/",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.885,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.452,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "CyDeploy, founded by Tina Williams-Koroma, employs machine learning to analyze company machine activities, creating a \"digital twin\" for testing updates. Elloe AI introduces a system designed to fact-check AI outputs, ensuring compliance with laws and user safety.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]