[
  {
    "title": "US, China Presidents Discuss Social Media App Deal, Plan In-Person Meeting",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 10:59:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "ABC News",
      "Global News",
      "Financial Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "abcnews.go.com",
      "globalnews.ca",
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US and Chinese presidents discuss deal to keep popular social media app online in US, trade relations.",
      "The president said he had a a \"very productive\" phone call with Chinese President Xi and would meet with him next month.",
      "Second conversation between the two leaders since US president’s return to office",
      "The leaders of the world’s two biggest economies will talk for the first time since June. The call could pave the way for an in-person meeting as soon as next month.",
      "The call between the two leaders began around 8 a.m. Washington time, according to a White House official and China's Xinhua News Agency."
    ],
    "image_url": "",
    "titles": [
      "LIVE: China’s Xi says talks with Trump ‘positive’",
      "Trump admin live updates: Trump talks with Xi about trade, TikTok deal",
      "Trump claims TikTok deal approved after call with Xi",
      "Trump and China’s Xi set to discuss trade tensions, TikTok deal",
      "Trump, Xi begin talks to finalize a TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.897,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US and Chinese presidents discussed a deal to keep a popular social media app operating in the US and trade relations during a \"very productive\" phone call. This marks their second conversation since the US president's return to office. They plan to meet in person next month, their first meeting since June. The call, which could lead to improved bilateral relations, started around 8 a.m. Washington time, as confirmed by both the White House and China's Xinhua News Agency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Couple Released from Detention in Afghanistan After 8 Months",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 13:08:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "UK thanks Qatar for leading negotiations for the release of the pair after their arrest in February.",
      "Relatives of Peter Reynolds, 80, and his wife Barbara, 76, had made repeated pleas about their deteriorating health since their arrest in February.",
      "<p>Peter and Barbie Reynolds were arrested and held without charge for eight months, raising fears for their health</p><p>A British couple have been freed from months of detention in Afghanistan to the “immense joy” of their family.</p><p>The Taliban released Barbie Reynolds, 76, and her husband, Pe",
      "Peter and Barbara Reynolds, 80 and 76, ran an education and training company in the country for years, and chose to remain after the Taliban took over in 2021."
    ],
    "image_url": "",
    "titles": [
      "Taliban releases elderly British couple from Afghanistan detention",
      "Taliban release British couple after seven-month ordeal",
      "Family tell of ‘immense joy’ at release of British couple detained in Afghanistan",
      "Taliban Releases British Couple, Peter and Barbie Reynolds, Detained for Months in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.938,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Peter and Barbara Reynolds, a British couple aged 80 and 76, were released from detention in Afghanistan after eight months. Their arrest in February had caused concern over their health. The UK acknowledged Qatar's role in negotiating their release. The couple, who ran an education and training company in Afghanistan and stayed after the Taliban's 2021 takeover, were freed to their family's immense joy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tyler Herro to Miss Season Start Due to Foot Surgery",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 11:21:33 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Heat All-Star Tyler Herro will undergo surgery on his left foot Friday and will be sidelined to start the 2025-26 season.",
      "Herro averaged 23.9 points and was a first-time All-Star last season",
      "<p>All-Star guard Tyler Herro is having surgery to repair a problem affecting his left foot, meaning the Miami Heat will be without their leading returning scorer when training camp starts later this month.</p>"
    ],
    "image_url": "",
    "titles": [
      "Heat's Herro to miss start of season after surgery",
      "Tyler Herro injury: Heat star to miss start of 2025-26 season due to foot surgery, per reports",
      "Heat’s Tyler Herro needs surgery, will miss start of training camp"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Miami Heat's All-Star guard Tyler Herro will have surgery on his left foot and miss the start of the 2025-26 season. Last season, he averaged 23.9 points, marking his first All-Star selection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Drop to 0-3 After Late Interception by Tagovailoa",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 14:24:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Dolphins gave themselves chances at pulling off the upset but instead fell to 0-3",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE44dXV2TjBKT3BjTHRwYmE0VGstaEJyMGNXdTJUdFctUzAzc0JlZ3ZPeUdZak1LaS1FLWVBb0d3QWR5R09XRmNkWURuOWNqdnhZdGttZWhWTGZHQ3pId05SNnBBcUpGNUJ5SHhVeklR?oc=5\" target=\"_blank\">Mike McDaniel, Tua Tagovailoa React to Game-Sealing Interception in Dolphins' L",
      "<p>Watch as Tua Tagovailoa throws a crucial interception late in the fourth quarter to halt the Dolphins&#8217; momentum on offence.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/19/462914fe-4425-4f82-9c9b-432022b319d0/gettyimages-2236190281-1.jpg",
    "titles": [
      "Dolphins' Tua Tagovailoa, Mike McDaniel say 'no moral victories' despite improved effort in loss to Bills",
      "Mike McDaniel, Tua Tagovailoa React to Game-Sealing Interception in Dolphins' Loss - Sports Illustrated",
      "Tagovailoa throws crucial interception to halt Dolphins’ momentum"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dolphins lost to fall to a 0-3 record after Tua Tagovailoa threw a late fourth-quarter interception, stopping the team's offensive momentum. Coach Mike McDaniel and Tagovailoa reacted to the game-sealing play, highlighting a missed opportunity for an upset.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Passes Bill to Avoid Shutdown, Faces Senate Hurdle",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 14:48:41 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOUEJjaEw0bTVLS0g2dnpwaUZLRFRHUzhSeUp0SDZVbjdJNzA4dFNKTy01aDVPcjVTZFhPYnRmNnRvTmZ2Um9PUXVta1hZVWljYWV1dnpqWnpjXzZ2Wl94eW9FcGEwWjFPNXZtbF85ZlV0RldLYlFXS2pKVnF1N3IxOA?oc=5\" target=\"_blank\">House passes short-term funding bill</a>&nbsp;&nbsp;<",
      "The final tally was 217-212.",
      "<p>Republican bill would fund government until 21 November; bill now moves to Senate chamber, where passage is less certain</p><p>Today, lawmakers in the House will vote on legislation, known as a “continuing resolution” (CR), to prevent a looming government shutdown at the end of September.</p><p>T"
    ],
    "image_url": "",
    "titles": [
      "House passes short-term funding bill - Axios",
      "House passes Republicans' short-term government funding bill to avert shutdown",
      "House passes short-term funding bill to avert US government shutdown; legislation moves to Senate – live updates"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The House passed a short-term funding bill with a final vote of 217-212 to prevent a government shutdown at the end of September. The Republican-led bill aims to fund the government until November 21 but faces uncertainty in the Senate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Norris, Piastri Crash in Baku Practice; Hamilton Leads Ferrari One-Two",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 15:44:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Lando Norris crashes his McLaren as Lewis Hamilton leads Charles Leclerc to a Ferrari one-two in Friday practice in Baku.",
      "Lando Norris crashes his McLaren as Lewis Hamilton leads Charles Leclerc to a Ferrari one-two in Friday practice in Baku.",
      "Lewis Hamilton led an impressive Ferrari one-two as McLaren title challengers Lando Norris and Oscar Piastri both hit walls in a dramatic second practice session at the Azerbaijan Grand Prix."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0110/live/59904df0-955a-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Norris crash 'costly' as Hamilton leads Ferrari 1-2",
      "Norris crash 'costly' as Hamilton leads Ferrari 1-2",
      "Hamilton fastest in Baku practice as Norris rues 'costly' crash"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.97,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lando Norris and Oscar Piastri both crashed their McLarens during the second practice session at the Azerbaijan Grand Prix in Baku. Meanwhile, Lewis Hamilton led a Ferrari one-two finish, with Charles Leclerc following close behind in Friday's practice.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nova Scotia Minister Silent on Northern Pulp Cleanup Plan and Costs",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 19 Sep 2025 15:23:45 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Nova Scotia’s environment minister is being tight-lipped on the cleanup plan for the shuttered Northern Pulp mill site in Pictou County.",
      "HALIFAX &#8212; Government officials in Nova Scotia are staying silent on the cleanup plan for the shuttered Northern Pulp mill site in Pictou County, leaving questions unanswered about whether the public will eventually have to foot the bill. Environment Minister Tim Halman would only tell reporter"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/4c7e373e89ca91b49cff567cf3836e5d0e0b534b3d9675f6a6da50baf7aede4e.jpg?quality=65&strip=all",
    "titles": [
      "Nova Scotia’s environment minister silent on shuttered Pictou County mill cleanup",
      "Nova Scotia’s environment minister silent on shuttered Pictou County mill cleanup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.712,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nova Scotia's Environment Minister, Tim Halman, has not disclosed details about the cleanup plan for the closed Northern Pulp mill in Pictou County. There is uncertainty regarding whether the public will bear the cleanup costs, as government officials remain silent on the plan.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Admits Eagles' \"Tush Push\" False Start, Vows Stricter Enforcement",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 11:21:33 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The NFL said the Eagles should have been flagged for at least one false start when they used the tush push against the Chiefs on Sunday and instructed officials this week to call the controversial play \"tight.\"",
      "<p>The NFL said in a training video to officials that the Philadelphia Eagles should have been penalized for at least one false start when they used the tush push against the Kansas City Chiefs in Week 2.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL: Officiate tush push 'tight' after missed call",
      "NFL admits missed penalty on ‘tush push’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL acknowledged that the Philadelphia Eagles committed at least one false start during their Week 2 game against the Kansas City Chiefs using the \"tush push\" technique. Officials have been instructed to enforce rules more strictly on similar plays going forward.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Trade Deadline Approaches; Hill, Cousins in Speculation",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 11:21:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "sportsnaut.com"
    ],
    "snippets": [
      "The NFL trade deadline isn't until Nov. 4, but we're looking ahead. Could Tyreek Hill or Kirk Cousins be moved? Which teams might make deals?",
      "The NFL trade deadline this season is on Nov. 4 at 4:00 PM ET, providing teams with plenty of time"
    ],
    "image_url": "",
    "titles": [
      "🏈 NFL trade deadline: Who could get moved?",
      "NFL Trade Candidates 2025: 8 Players Who Could be Dealt This Season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL trade deadline is set for Nov. 4 at 4:00 PM ET, offering teams ample opportunity to make deals. Speculation surrounds potential moves for players like Tyreek Hill and Kirk Cousins, but no specific trades have been confirmed as of now.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "F1 Moves to Baku for 2025 Season's 17th Round, McLaren Reviews Racing Policy",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 10:59:35 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Formula 1 ventures to Baku, the capital of Azerbaijan for round 17 of the 2025 season. Here's everything you need to know for the weekend.",
      "<p>The Formula 1 title race is heating up, and McLaren&#8217;s golden rule — “Let &#8217;em race” — risks expanding into a whole rule book.</p>"
    ],
    "image_url": "",
    "titles": [
      "What to know ahead of the Azerbaijan Grand Prix",
      "McLaren heads into Azerbaijan Grand Prix on verge of F1 constructors’ title"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Formula 1 heads to Baku, Azerbaijan, for the 17th round of the 2025 season, intensifying the title race. McLaren's policy of allowing drivers to race freely might lead to more comprehensive rules.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA's Artemis Missions Boosted by Advanced Superchips",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 19 Sep 2025 10:18:15 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.nasa.gov"
    ],
    "snippets": [
      "Of the many roads leading to successful Artemis missions, one is paved with high-tech computing chips called superchips. Along the way, a partnership between NASA wind tunnel engineers, data visualization scientists, and software developers verified a quick, cost-effective solution to improve NASA's",
      "By Jill Dunbar Of the many roads leading to successful Artemis missions, one is paved with high-tech computing chips called superchips. Along the way, a partnership between NASA wind tunnel engineers, data visualization scientists, and software developers verified a quick, cost-effective solution to"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/from-supercomputers-to.jpg",
    "titles": [
      "From supercomputers to wind tunnels: NASA's road to Artemis II",
      "From Supercomputers to Wind Tunnels: NASA’s Road to Artemis II"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA's Artemis missions are leveraging high-tech computing chips, known as superchips, to enhance mission success. A collaborative effort among NASA's wind tunnel engineers, data visualization scientists, and software developers has led to the verification of a quick and cost-effective solution, utilizing these superchips, to advance the missions' objectives.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russian MiG-31 Jets Violate Estonian Airspace, Prompt NATO Response",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 15:33:10 GMT",
    "source": "The Guardian",
    "sources": [
      "Global News",
      "The Guardian"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Reported incursion by three fighter jets over Gulf of Finland comes amid increased tension on Nato’s eastern border</p><p>Three Russian MiG-31 fighter jets have violated Estonian airspace for 12 minutes, the Nato member said.</p><p>The alleged incursion over the Gulf of Finland on Friday comes am",
      "Italian Air Force F-35 fighter jets, currently deployed as part of the NATO Baltic Air Policing Mission, responded to the incident, Estonia's government said."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ad8153d4c417cc9f82f553afc2b6951b58116744/870_0_1548_1238/master/1548.jpg?width=140&quality=85&auto=format&fit=max&s=18439187c416d6c8f5f9e98277c6c246",
    "titles": [
      "Estonia accuses Russia of  ‘brazen’ violation of its airspace",
      "Estonia says ‘brazen’ Russian fighters violated its airspace for 12 minutes"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Three Russian MiG-31 fighter jets violated Estonian airspace for 12 minutes over the Gulf of Finland, amid heightened tensions on NATO's eastern border. The incident, reported by Estonia, a NATO member, prompted a response from Italian Air Force F-35 jets deployed for the NATO Baltic Air Policing Mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Noah Lyles Wins 200m World Title Again, Matches Usain Bolt's Record",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 11:13:51 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "Noah Lyles has defended his 200-meter world title for the third time, making him the second man, after Usain Bolt, to accomplish this achievement.",
      "<p>Noah Lyles pulled ahead of Kenny Bednarek heading into the straightaway then held him off down the stretch to capture his fourth title in a much-awaited 200 meters at world championships Friday night.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cd71ed1db129d510de7379/0x0.jpg?width=960",
    "titles": [
      "Noah Lyles Storms To Win His Fourth World Title",
      "Lyles wins his fourth 200-metre world title at world championships"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Noah Lyles successfully defended his 200-meter world title for the third consecutive time, becoming the second man after Usain Bolt to achieve this. In a highly anticipated race at the world championships, Lyles overtook Kenny Bednarek in the straightaway and maintained his lead to win his fourth title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ireland vs. England 2nd T20I Rained Out; Decider on Sunday",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 15:12:16 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>There was no play possible in Malahide as England take a 1-0 lead into the series decider on Sunday</p><p>You knew it, I knew it. This one is kiboshed by rain.</p><p><strong>Still nowt official outta Malahide.</strong> There was some action with the covers a while ago but in a ‘kicking the tyres ",
      "Ireland and England's T20 series will go down to the third and final match on Sunday, the tourists still leading 1-0 after the second T20I was washed out."
    ],
    "image_url": "https://i.guim.co.uk/img/media/07e183db679263d97ff08382caf66c0a559410c9/882_0_4640_3712/master/4640.jpg?width=140&quality=85&auto=format&fit=max&s=b582797af12033d142d7431de1e66932",
    "titles": [
      "Ireland v England: second men’s T20 cricket international abandoned due to rain – as it didn’t happen",
      "Rain ruins second T20I between Ireland and England"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The second T20I match between Ireland and England in Malahide was rained out, with no play possible. As a result, the series will be decided in the third and final match on Sunday, with England currently leading 1-0.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ABC Suspends Jimmy Kimmel's Show After FCC Criticism",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-19T15:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Global News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "globalnews.ca"
    ],
    "snippets": [
      "ABC took comic Jimmy Kimmel's late-night show off the air indefinitely, just hours after a stinging rebuke from Federal Communications Commission (FCC) chairman Brendan Carr.",
      "Jimmy Kimmel has not commented on the suspension following the remarks he made about the shooting death of Charlie Kirk on Monday."
    ],
    "image_url": "",
    "titles": [
      "Stewart, Colbert and Fallon respond to Kimmel suspension",
      "Jon Stewart, Stephen Colbert react to Jimmy Kimmel’s suspension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC suspended Jimmy Kimmel's late-night show indefinitely following critical comments from FCC chairman Brendan Carr. This action came shortly after Kimmel made remarks about the shooting death of Charlie Kirk. Kimmel has yet to respond to the suspension.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ig Nobel Prize Goes to Team for Perfecting Pasta Sauce Research",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 19 Sep 2025 08:46:55 EDT",
    "source": "Phys.org",
    "sources": [
      "Ars Technica",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "arstechnica.com"
    ],
    "snippets": [
      "The Ig Nobel Prize honors research that first makes people laugh, then makes them think. Its 35th award ceremony possibly also makes people hungry: ISTA physicist Fabrizio Olmeda and colleagues researched the secret of a perfect cacio e pepe pasta sauce. They received the popular award for their fin",
      "The annual award ceremony features miniature operas, scientific demos, and the 24/7 lectures."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/2025-ig-physics-nobel-1.jpg",
    "titles": [
      "2025 Ig Physics Nobel Prize goes to perfect pasta sauce",
      "Meet the 2025 Ig Nobel Prize winners"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 35th Ig Nobel Prize ceremony awarded physicist Fabrizio Olmeda and his team for researching the perfect cacio e pepe pasta sauce, highlighting research that amuses and then provokes thought. The event, known for blending science with entertainment, includes mini operas and demos.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Ambulance Workers Arrested in Six Deaths Investigation",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 15:07:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Two ambulance workers have been arrested over the deaths of six adults, Wiltshire Police have said.",
      "<p>Man in his 30s and woman, 59, held on suspicion of gross negligence manslaughter</p><p>Two ambulance trust staff have been arrested in connection with the deaths of six people in Wiltshire, police have said.</p><p>A man in his 30s and a 59-year-old woman, who were both employed by the South Weste"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c483/live/429e6ad0-9561-11f0-a3c3-898ca8bade9c.jpg",
    "titles": [
      "Two ambulance workers arrested after the deaths of six people",
      "Two ambulance trust staff arrested after deaths of six people in Wiltshire"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two ambulance workers, a man in his 30s and a 59-year-old woman, have been arrested by Wiltshire Police on suspicion of gross negligence manslaughter related to the deaths of six adults. Both individuals were staff members of the South Western Ambulance Service.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amy Hunt Wins Silver in Women's 200m at World Athletics Championships",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 13:46:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Great Britain's Amy Hunt announces herself on the global stage by claiming a stunning 200m silver in her first major final at the World Championships in Tokyo.",
      "Great Britain's Amy Hunt takes silver in the women's 200m at the World Athletics Championships in Tokyo.",
      "Amy Hunt claimed Great Britain's second medal of the World Athletics Championships as she took silver in the women's 200 metres in Tokyo."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c137/live/267cbd30-9565-11f0-a3c3-898ca8bade9c.jpg",
    "titles": [
      "Amy Hunt claims GB's second medal at World Athletics with brilliant 200m silver",
      "'Immense performance' - GB's Hunt claims 200m silver",
      "Hunt claims World Athletics silver for Great Britain in Tokyo"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amy Hunt of Great Britain won a silver medal in the women's 200m at the World Athletics Championships in Tokyo, marking her first major final. This achievement secured Great Britain's second medal of the championships.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astronomers Discover Rapidly Growing Black Hole with NASA's Chandra Observatory",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 19 Sep 2025 08:50:27 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.nasa.gov"
    ],
    "snippets": [
      "A black hole is growing at one of the fastest rates ever recorded, according to a team of astronomers. This discovery from NASA's Chandra X-ray Observatory may help explain how some black holes can reach enormous masses relatively quickly after the Big Bang.",
      "A black hole is growing at one of the fastest rates ever recorded, according to a team of astronomers. This discovery from NASA’s Chandra X-ray Observatory may help explain how some black holes can reach enormous masses relatively quickly after the big bang. The black hole weighs about a billion tim"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-chandra-finds-bl.jpg",
    "titles": [
      "Chandra finds black hole that's growing at 2.4 times the Eddington limit",
      "NASA’s Chandra Finds Black Hole With Tremendous Growth"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Astronomers have discovered a black hole growing at one of the fastest rates ever recorded, using NASA's Chandra X-ray Observatory. This finding may shed light on how certain black holes achieve massive sizes shortly after the Big Bang. The black hole in question has a mass of about a billion times that of our sun.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada, Mexico Pledge to Boost Economic, Security Ties Amid US Trade Tensions",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 04:34:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Canadian and Mexican leaders pledge closer coordination on trade amid US President Donald Trump&#039;s trade war.",
      "The leaders of Canada and Mexico have agreed to deepen economic and security ties amid ongoing trade pressure from the Trump administration."
    ],
    "image_url": "",
    "titles": [
      "Canada, Mexico to work together in face of Trump’s US tariff threats",
      "Canada, Mexico eye stronger ties amid Trump tariff threat"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.785,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The leaders of Canada and Mexico have committed to strengthening their economic and security cooperation in response to the trade tensions instigated by US President Donald Trump. This pledge comes as both countries face challenges from Trump's trade policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stricter Measures on Comments After Charlie Kirk Killing",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Thu, 18 Sep 2025 21:48:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.theguardian.com"
    ],
    "snippets": [
      "And we get an inside view of Trump's UK state visit with the president's chief of staff",
      "<p>Employers and officials are cracking down on comments considered ‘inappropriate’ after far-right activist was killed</p><p>In the aftermath of the far-right activist <a href=\"https://www.theguardian.com/us-news/2025/sep/10/who-is-charlie-kirk-profile\">Charlie Kirk</a>’s <a href=\"https://www.thegu"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Has Trump cancelled Jimmy Kimmel over Charlie Kirk?",
      "Dozens of workers disciplined after Charlie Kirk shooting, from journalists to Jimmy Kimmel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.667,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the killing of far-right activist Charlie Kirk, employers and officials are implementing stricter measures against comments deemed 'inappropriate'. This development is part of the broader response to the incident, highlighting efforts to address and moderate public discourse in its aftermath.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK ISA Investments Hit £103B Amid Tax Cut Fears, 15M New Accounts",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 04:00:41 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Latest annual figures show £103bn put into individual savings accounts, with pace likely to have risen since over tax fears",
      "<p>Figures show 15m more tax-efficient savings accounts were opened in 2023-24, with more following as fears grew allowance might be cut</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/19/uk-government-borrowing-rises-consumer-confidence-slips-reeves-budget-business-live-ne"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa4ab343f-9278-4079-9cb3-b0b5ace69de6.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK households prefer cash, as they plough record sums into Isas",
      "UK households put a record £103bn into Isas amid ‘dash for cash’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.76,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the 2023-24 period, £103 billion was invested in individual savings accounts (ISAs) in the UK, with a notable increase in accounts opened—15 million more than the previous year—due to concerns that tax allowances might be reduced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Revoking Licenses of \"Unfair\" Broadcasters, Backs Kimmel Suspensi",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 21:19:22 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTFBKaDZQNGticDMxY3RDbnhMZUxfMjFxRnRZdkJEeU15VkJ2dU1Vb3pwSWozaGh4LU1Wcm05cHdPUjNZR1V2b3g4ZHh4X1lVSmVnVVcwSi1fbFB1dnMzZUM1SWNJYkNCVnFza1hwaUlwYw?oc=5\" target=\"_blank\">Trump floats pulling TV licenses after Kimmel suspension</a>&nbsp;&nbsp;<font",
      "President Donald Trump has applauded the suspension of Jimmy Kimmel's late-night show over comments he made about the man accused of murdering Charlie Kirk."
    ],
    "image_url": "",
    "titles": [
      "Trump floats pulling TV licenses after Kimmel suspension - Axios",
      "Trump floats pulling licenses if networks are 'against' him after Jimmy Kimmel suspended"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.661,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump suggested revoking the licenses of broadcasters he perceives as unfair, following his approval of ABC's decision to suspend \"Jimmy Kimmel Live!\" The show was pulled after Jimmy Kimmel made comments about Charlie Kirk's accused murderer and criticized Trump supporters. Trump also labeled Kimmel as \"not a talented person,\" amid debates over the suspension's impact on free speech.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia Invests $5 Billion in Intel for Data Center, PC Product Development",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 19:24:55 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiXEFVX3lxTE5SNEgyOXVRcjRCUDNCc1VQLUU5Uk1ZeHZWZFcxN25IRkJGbVRSY2JGLUZhSlVFX1gzT0g0VjY5OHFpNURVS1VaWFJtTVBTZW0xbU5jRHk5blpBYWNL?oc=5\" target=\"_blank\">Nvidia to invest $5 billion in Intel and co-develop chips</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f",
      "Intel once considered buying Nvidia outright, but its fortunes have shifted."
    ],
    "image_url": "",
    "titles": [
      "Nvidia to invest $5 billion in Intel and co-develop chips - Axios",
      "Nvidia, Intel to co-develop “multiple generations” of chips as part of $5 billion deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.635,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.592,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nvidia has announced a $5 billion investment in Intel, alongside a partnership to co-develop multiple generations of data center and PC products. This collaboration aims to bolster Intel's position in the market, particularly in AI datacenters and PC chips, following a significant market surge.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  }
]