[
  {
    "title": "Trump Announces Trade Deal with Japan, Easing Tariff Tensions",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 19:39:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Details about the agreement, which US President Donald Trump announced on Truth Social, are limited.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE1pdmFtSEREMmpETllzWG9CSHczT0NucFRQRkZZaWxLMGpFbEhaNDZPQXNtbHQ2S1lLUjZTc21DME9rM2xKZUZPZnpvM1Qwd05ZWmtKUDZmTDJQcmh6V2EyMHM5VHd0WUlWdVBnbFZYb3BFaUpaOUxpd1FjOHA?oc=5\" target=\"_blank\">Trump announces Philippines trade deal, after pact with Indo",
      "In his tariff letter sent out to Japan earlier this month, Trump had threatened 25% tariff on its exports to the U.S. from Aug. 1.",
      "<p>Tokyo’s failure to secure a US trade deal had caused political uproar and economic uncertainty in Japan, with prime minister Shigeru Ishiba reportedly considering his future</p><p>Donald Trump has announced a trade deal with Japan, potentially resolving weeks of fraught negotiations between the t"
    ],
    "image_url": "",
    "titles": [
      "Trump sets 19% tariff on Philippines in new trade deal",
      "Trump announces Philippines trade deal, after pact with Indonesia - Axios",
      "Trump announces 'massive' trade deal with Japan with 15% tariffs",
      "Trump announces Japan trade deal after weeks of fraught negotiations"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.91,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.832,
    "summary": "US President Donald Trump has announced a trade deal with Japan, potentially settling weeks of tense negotiations. This follows Trump's earlier threat to impose a 25% tariff on Japanese exports to the U.S. starting August 1. The announcement comes amid political and economic turmoil in Japan, where Prime Minister Shigeru Ishiba was reportedly considering his future due to the failure to secure a US trade deal. Details of the agreement remain limited.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the recent trade deal between the US and Japan, which could have significant economic implications. However, it lacks depth and details about the deal, and does not clearly explain the potential impacts or solutions to the tariff tensions.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Heavy Metal Icon Ozzy Osbourne Dies at 76 After Parkinson's Battle",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 18:58:58 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The singer helped invent both heavy metal and the image of the wild rock star,  before unlikely reality TV fame.",
      "Heavy metal legend John Michael \"Ozzy\" Osbourne has passed away at the age of 76 after a struggle with advanced Parkinson's disease.",
      "<p>Having escaped a life of drudgery in Birmingham, Ozzy became the rare rock frontman you could relate to – and then, against the odds, a national treasure</p><p>• <a href=\"https://www.theguardian.com/music/2025/jul/22/ozzy-osbourne-black-sabbath-frontman-and-icon-of-british-heavy-metal-dies-aged-7",
      "The Prince of Darkness, Ozzy Osbourne, has died at the age of 76, just weeks after taking to the stage for a final performance with the original members of his old band Black Sabbath in Birmingham, England. No cause of death was revealed. Osbourne had been living with Parkinson&#8217;s Disease &#821"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0460/live/32f29d50-672f-11f0-8dbd-f3d32ebd3327.jpg",
    "titles": [
      "Wild life of Ozzy Osbourne, rock's 'prince of darkness'",
      "Ozzy Osbourne: The Prince of Darkness is dead",
      "Ozzy Osbourne, the people’s Prince of Darkness, took heavy metal into the light",
      "The ‘Prince of Darkness’ Ozzy Osbourne dies at 76"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.898,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.793,
    "summary": "Heavy metal pioneer Ozzy Osbourne, famously known as the \"Prince of Darkness\" and a key figure in the creation of the genre and the wild rock star image, has died at the age of 76. Osbourne, who rose from a challenging background in Birmingham to become a beloved figure in music and later in reality TV, passed away after battling advanced Parkinson's disease. His death comes shortly after a final performance with Black Sabbath in Birmingham, marking the end of an era for fans worldwide.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides a bit more depth than the previous one, mentioning Ozzy Osbourne's battle with Parkinson's disease and his rise from a challenging background. However, it still lacks actionable insights or a clear focus on solutions or improvements. It does raise awareness about Parkinson's disease, but does not delve into the disease or its impacts.",
    "image": {
      "src": "https://live.staticflickr.com/5220/5383419929_5ba549a233_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3046cead-3903-442f-9c71-76d9111a77c6/thumb/",
      "alt": "Bright similarity: Stylish blonde woman tourist in a large straw hat, wearing a heavy gold link chain, silk dress, straw bag, guerrilla wall art of a business man with a brief case, Historical district, Mazatlan, Mexico",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Heavy Metal Icon Ozzy Osbourne Passes Away After Final Concert",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 19:12:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Business Insider",
      "Deutsche Welle"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Osbourne was instrumental in pioneering heavy metal as his band Black Sabbath enjoyed huge success in the 70s.",
      "Ozzy Osbourne was known to fans as \"The Prince of Darkness\" and the \"Godfather of Heavy Metal.\" The British musician's family has announced his death.",
      "<p>The singer, who later became famous on reality TV show The Osbournes, dies less than three weeks after retirement concert</p><p>• <a href=\"https://www.theguardian.com/music/2025/jul/22/ozzy-osbourne-the-peoples-prince-of-darkness-took-heavy-metal-into-the-light\">Alexis Petridis on Ozzy Osbourne, ",
      "Ozzy Osbourne, the cofounding member of Black Sabbath who earned the nickname \"Prince of Darkness,\" died on Tuesday, his family confirmed."
    ],
    "image_url": "",
    "titles": [
      "Ozzy Osbourne, Black Sabbath frontman and heavy metal icon, dies at 76",
      "Ozzy Osbourne, Black Sabbath frontman, dead at 76",
      "Ozzy Osbourne, Black Sabbath frontman and icon of British heavy metal, dies aged 76",
      "Ozzy Osbourne, legendary Black Sabbath front man turned reality TV star, dead at 76"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.902,
      "consensus": 0.985,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary": "Ozzy Osbourne, the British musician known as the \"Prince of Darkness\" and \"Godfather of Heavy Metal\" for his role in pioneering the genre with his band Black Sabbath in the 70s, has died, his family announced. Osbourne, who also gained fame from the reality TV show \"The Osbournes,\" passed away less than three weeks after his retirement concert.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the death of a famous musician, it does not offer much depth or insight. There are no actionable insights or deeper understanding provided, and it does not report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/5220/5383419929_5ba549a233_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3046cead-3903-442f-9c71-76d9111a77c6/thumb/",
      "alt": "Bright similarity: Stylish blonde woman tourist in a large straw hat, wearing a heavy gold link chain, silk dress, straw bag, guerrilla wall art of a business man with a brief case, Historical district, Mazatlan, Mexico",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Amazon to buy AI company Bee that makes wearable listening device",
    "domain": "technology",
    "location": "national",
    "published": "Tue, 22 Jul 2025 20:03:20 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "The Verge",
      "CNBC"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Amazon has launched a flurry of AI products and services, and it recently overhauled its Alexa voice assistant with the technology.",
      "Amazon is acquiring Bee, a startup that puts AI on your wrist. Bee CEO Maria de Lourdes Zollo says on LinkedIn that the company is joining Amazon to help “bring truly personal, agentic AI to even more customers.” Bee makes a $49.99 Fitbit-like device that listens in on your conversations while using",
      "Amazon has acquired the AI wearables startup Bee, which makes a bracelet and an Apple Watch app that record your day-to-day life to function as an AI assistant."
    ],
    "image_url": "",
    "titles": [
      "Amazon to buy AI company Bee that makes wearable listening device",
      "Amazon buys Bee AI wearable that listens to everything you say",
      "Amazon acquires Bee, the AI wearable that records everything you say"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.918,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.78,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about a significant business acquisition in the tech industry. It could help readers understand the direction Amazon is taking with AI and wearable technology, even though it does not report on solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/1978/45567621401_f64ffbcf81_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/770a5efb-4ac3-4c85-87f4-eb2d7d9161fe/thumb/",
      "alt": "Amazon rainforest",
      "credit": "Astro_Alex / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "England Beats Italy 2-1 in Euro 2025 Semi-Final, Advances to Final",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:21:11 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "It had looked like one rescue mission too many for this England team.",
      "<p>Remember the name. Remember the day. Chloe Kelly may have scored the winner, poking in the rebound from her saved penalty deep into extra time, but it was Michelle Agyemang – whose surname translates literally as “saviour of a nation” – who stepped up when it mattered most, scoring the goal to fo",
      "England produced yet more late drama at Euro 2025 as they kept their hopes of back-to-back European Championship successes alive with a spectacular 2-1 semi-final victory over Italy after extra-time."
    ],
    "image_url": "",
    "titles": [
      "Comeback queens strike again as Kelly sends England into Euro 2025 final",
      "Kelly and Agyemang fire England into Euro 2025 final after comeback against Italy",
      "Agyemang 90+6! Kelly 119! England reach Euro 2025 final after more late drama"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.983,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary": "England secured a thrilling 2-1 victory over Italy in the Euro 2025 semi-final, advancing to the final and keeping their ambitions for consecutive European Championship titles alive. The match featured late excitement, with Chloe Kelly scoring the decisive goal in extra time after an initial penalty was saved. Michelle Agyemang also played a crucial role, scoring a vital goal that contributed significantly to the win. This victory underscores England's resilience and ability to perform under pressure.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the result of a football match and the performance of specific players. However, it doesn't provide deeper understanding or actionable insights for the reader, nor does it report on any solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/5557/14949716569_389bd08bcb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/391828c0-8cb0-495b-a8ab-cda4c0018586/thumb/",
      "alt": "York, England",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Kelly's Extra-Time Goal Sends England to Euro 2025 Final with 2-1 Win Over Italy",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 22:37:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Yahoo Sports",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Chloe Kelly scores dramatic late winner in extra time as reigning champions England come from behind to beat Italy 2-1.",
      "England coach Sarina Wiegman said she felt &quot;many emotions&quot; after her team produced another dramatic comeback to beat Italy in extra time on Tuesday and reach the final of the Women's Euro 2025.Meanwhile, Italy coach Andrea Soncin said he was proud of his team despite the agony of seeing th",
      "<p>The substitutes Michelle Agyemang and Chloe Kelly shone as the Lionesses secured dramatic passage to the final</p><p><strong>Hannah Hampton</strong> Looked strong aerially and made a crucial save on 86 minutes, keeping England alive. <strong>7/10</strong></p> <a href=\"https://www.theguardian.com/"
    ],
    "image_url": "",
    "titles": [
      "England beat Italy to reach UEFA Women’s Euro 2025 final",
      "'A bit surreal' - England coach Wiegman hails reaching Euro 2025 final",
      "England 2-1 Italy: Women’s Euro 2025 semi-final player ratings | Tom Garry"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.968,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.763,
    "summary": "Chloe Kelly scored a late winner in extra time, leading England to a 2-1 victory over Italy in the Women's Euro 2025 semi-final. England's coach, Sarina Wiegman, expressed a mix of emotions following the team's dramatic comeback. Italy's coach, Andrea Soncin, praised his team's effort despite the loss. Substitutes Michelle Agyemang and Chloe Kelly played key roles, with England now advancing to the final.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of the event but doesn't provide much depth or insight. It doesn't give the reader actionable insights or deeper understanding, nor does it report on solutions, improvements, innovations, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/7426/10149226046_0d6faeccbe_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ca8f8460-795f-4df5-82c8-cec2a4d69a39/thumb/",
      "alt": "Kelly Splash",
      "credit": "Ian Sane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Rafael Devers Trades Red Sox for Giants, Debuts at First Base",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 22:12:37 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Devers said after he was traded that he would play wherever the Giants wanted",
      "Boston traded Devers to San Francisco in June after his relationship with management deteriorated.",
      "<p>Rafael Devers was in the lineup at first base for the San Francisco Giants at Atlanta on Tuesday night, the slugger&#8217;s first start at the position that he refused to play for his prior team, the Boston Red Sox.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/22/e94639bb-ad7a-4916-bb1c-7f37977c9217/devers-imagn.png",
    "titles": [
      "Giants' Rafael Devers gets first career start at first base after Red Sox drama",
      "Rafael Devers makes his debut at first base for Giants after refusing to play position for Red Sox",
      "Rafael Devers makes first base debut for Giants after refusing to play position for Red Sox"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.96,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary": "Rafael Devers was traded from the Boston Red Sox to the San Francisco Giants in June following a breakdown in his relationship with Boston's management. After the trade, Devers expressed his willingness to play any position for the Giants. He made his first start at first base for the Giants in a game against Atlanta on Tuesday night, a position he had previously refused to play while with the Red Sox.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant trade in Major League Baseball. It gives insight into the player's willingness to adapt to a new role in his new team, which can be useful for fans and analysts. However, it doesn't report on any progress, solutions or improvements, nor does it increase clarity around systems, causes, or trends.",
    "image": {
      "src": "https://live.staticflickr.com/3457/3241205178_d741c2a178_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d01fd56d-1d4f-48dc-80c2-d3b1e2e82193/thumb/",
      "alt": "Rafael Nadal 2009 Melbourne",
      "credit": "Brett Marlow Melbourne Australia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "US Olympic Committee Bars Transgender Women from Women's Sports",
    "domain": "general",
    "location": "national",
    "published": "Tue, 22 Jul 2025 18:42:35 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "The U.S. Olympic and Paralympic Committee tells the federations overseeing swimming, athletics and other sports that it has an \"obligation to comply\" with an executive order issued by President Trump.",
      "<p>The U.S. Olympic and Paralympic Committee has effectively barred transgender women from competing in women’s sports, telling the federations overseeing swimming, athletics and other sports it has an “obligation to comply” with an executive order issued by President Donald Trump.</p>"
    ],
    "image_url": "",
    "titles": [
      "U.S. Olympic and Paralympic officials bar transgender women from Olympic women's sports",
      "U.S. Olympic, Paralympic officials bar transgender women from competing in Olympic women’s sports"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.97,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.71,
    "summary": "The U.S. Olympic and Paralympic Committee has informed sports federations, including those for swimming and athletics, that they must comply with an executive order by President Trump, effectively prohibiting transgender women from participating in women's sports competitions. This decision aligns with the committee's stated obligation to adhere to the executive order.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs the reader about a significant decision by the U.S. Olympic and Paralympic Committee, providing useful context about the issue of transgender women in women's sports. However, it doesn't report on solutions or attempts to solve the problem, nor does it provide a deep understanding of the underlying issues.",
    "image": {
      "src": "https://live.staticflickr.com/21/28096036_7a7f2892c5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/54dc6803-3e6d-488f-873d-2cd0440008aa/thumb/",
      "alt": "US Flag",
      "credit": "ReneS / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "NHL and NHLPA Partner with Italy's Serie A Ahead of 2026 Olympics",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 17:03:06 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "How North American hockey and Italian soccer have come together for a common cause.",
      "<p>The NHL and NHLPA announced a content partnership with top-flight Italian soccer league Lega Serie A on Tuesday ahead of the 2026 Milan-Cortina Olympics.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/687ff8e9694b9024013850d5/0x0.jpg?width=960",
    "titles": [
      "NHL And Serie A Team Up For Milestone Winter Olympics Partnership",
      "NHL, Serie A announce partnership ahead of Milano-Cortina Olympics"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.937,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary": "The NHL and NHLPA have formed a content partnership with Italy's Lega Serie A, announced ahead of the 2026 Milan-Cortina Olympics. This collaboration unites North American hockey and Italian soccer for a common cause, aiming to enhance the visibility and engagement of both sports leading up to the Olympic games.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about a new partnership between North American hockey and Italian soccer, providing context about its timing and purpose. However, it does not delve into specific strategies or plans to enhance visibility and engagement, nor does it highlight the potential impacts of this partnership.",
    "image": {
      "src": "https://live.staticflickr.com/7272/7012024705_6aeaea68b3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c9a5b883-39f6-4aed-b3e2-81ae0150dc23/thumb/",
      "alt": "hockey fighting - MAYBE THE NHL NEEDS A PARENTAL ADVISORY BEFORE GAMES.",
      "credit": "'it was 3 a.m.' / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Microsoft AI Group Expands, Hires 20+ from Competitor",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 19:39:19 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Microsoft's artificial intelligence group has been growing under Mustafa Suleyman, a co-founder of the DeepMind research lab Google acquired years ago.",
      "US tech giant recruits more than 20 people from rival in push to gain edge in the fast-developing technology"
    ],
    "image_url": "",
    "titles": [
      "Microsoft poaches more Google DeepMind AI talent as it beefs up Copilot",
      "Microsoft poaches top Google DeepMind staff in AI talent war"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.91,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary": "Microsoft's artificial intelligence group, led by Mustafa Suleyman, a co-founder of DeepMind, is expanding. The company has recruited over 20 employees from a competitor to enhance its position in the rapidly evolving technology sector.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in Microsoft's artificial intelligence group. It provides empowering knowledge about the company's growth strategy, including the hiring of new talent from a competitor. However, it could provide more insight into the implications of this move for the technology sector and Microsoft's position within it.",
    "image": {
      "src": "https://live.staticflickr.com/2193/2264763977_fbeb2e34ba_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6e22ebe1-7c72-44d0-94c0-5e8181f91752/thumb/",
      "alt": "Microsoft sign outside building 99",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Teen Curtis Shines in Rangers' Champions League Win Over Panathinaikos",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 22:44:43 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Teenage forward Findlay Curtis repays new head coach Russell Martin's show of faith with a key role in Rangers' crucial first-leg win over Panathinaikos in Champions League qualifying.",
      "Teenage forward Findlay Curtis repays new head coach Russell Martin's show of faith with a key role in Rangers' crucial first-leg win over Panathinaikos in Champions League qualifying."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5049/live/4800df70-6740-11f0-89ea-4d6f9851f623.png",
    "titles": [
      "'Cool cat' Curtis ignites Martin's Rangers reign",
      "'Cool cat' Curtis ignites Martin's Rangers reign"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.971,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary": "Teenage forward Findlay Curtis played a significant role in Rangers' crucial first-leg victory over Panathinaikos in the Champions League qualifying round. His performance was a direct response to the confidence placed in him by new head coach Russell Martin.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a football match and the performance of a young player, Findlay Curtis. However, it doesn't provide much in-depth insight or actionable information for the reader, nor does it report on any solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/2641/3814218129_c37358b3f8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/12f09583-1201-4508-9c20-6c24fc868542/thumb/",
      "alt": "Teen Group",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cowboys Start Training Camp; Micah Parsons Joins Amid Contract Talks",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:20:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After a long offseason, the Dallas Cowboys finally kicked off training camp with their first practice on Tuesday. Surprisingly, even",
      "<p>Micah Parsons will participate in Dallas Cowboys training camp, avoiding a potential hold-in as the two-time All-Pro defensive end seeks a contract extension that would likely make him the highest-paid defender in NFL history.</p>"
    ],
    "image_url": "",
    "titles": [
      "Is Micah Parsons Faking an Injury at Cowboys Training Camp?",
      "Micah Parsons set for Cowboys training camp amid contract negotiations"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.983,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary": "The Dallas Cowboys began their training camp with their first practice on Tuesday, with two-time All-Pro defensive end Micah Parsons participating. Parsons, who is in discussions for a contract extension that could make him the highest-paid defender in NFL history, avoided a potential hold-in by joining the team's training activities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Dallas Cowboys' training camp and Micah Parsons' participation despite ongoing contract talks. This gives readers insight into the player's commitment to the team. However, it doesn't highlight any solutions or progress, nor does it increase awareness about systems, causes, or trends.",
    "image": {
      "src": "https://live.staticflickr.com/67/226193738_f15afa71e0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/86cec092-7c35-4011-9715-a0da3608b89f/thumb/",
      "alt": "Cowboys",
      "credit": "literari / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Telegram Introduces Built-In TON Wallet for U.S. Users",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 13:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Telegram’s built-in TON Wallet is launching in the U.S., allowing users to send and manage crypto directly within the app — no downloads or extensions required.",
      "Telegram is expanding access to its crypto wallet for its 87 million users in the US."
    ],
    "image_url": "",
    "titles": [
      "Telegram's crypto wallet goes live to its 87 million U.S. users",
      "Telegram’s crypto wallet launches in the US"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.792,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary": "Telegram has launched its built-in TON Wallet in the U.S., enabling its 87 million users to send and manage cryptocurrency directly within the app without the need for any additional downloads or extensions. This expansion allows for seamless crypto transactions for a vast user base in the United States.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new feature in the Telegram app that allows users to manage cryptocurrency. It highlights an innovation and can help users make informed decisions about using this feature.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Font_Awesome_5_brands_telegram.svg",
      "thumbnail": "https://api.openverse.org/v1/images/6b689722-11e2-4df0-978b-045eaf121d44/thumb/",
      "alt": "Font Awesome 5 brands telegram",
      "credit": "Font Awesome / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Administration Removes Prosecutor Set to Succeed Alina Habba",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 22:32:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Trump administration quickly acted to remove Habba&#039;s replacement following a decision not to extend her term.",
      "<p>Justice department retaliates by removing career prosecutor named as Habba’s replacement</p><p>Alina Habba, Donald Trump’s defence lawyer <a href=\"https://www.theguardian.com/us-news/2024/jan/18/e-jean-carroll-defamation-trial-trump\">during</a> a defamation case brought by the writer <a href=\"htt"
    ],
    "image_url": "",
    "titles": [
      "Judges reject Trump lawyer Alina Habba’s bid to serve as federal prosecutor",
      "Judges end Trump pick Alina Habba’s tenure as New Jersey’s top prosecutor"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.967,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary": "The Trump administration removed the career prosecutor designated to replace Alina Habba after deciding not to extend her term. This action was taken shortly after Habba, who served as Donald Trump's defense lawyer in a defamation case brought by writer E. Jean Carroll, had her term concluded. The Justice Department's decision to remove Habba's successor marks a significant administrative move, reflecting a direct response to the non-extension of Habba's term.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about a significant administrative move by the Trump administration, potentially affecting the Justice Department's future actions. It informs the reader about recent political developments, but it doesn't offer much in the way of solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Raducanu and Norrie Secure Wins at Washington Open",
    "domain": "general",
    "location": "global",
    "published": "Tue, 22 Jul 2025 23:16:14 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Britain's Emma Raducanu and Cameron Norrie both secure impressive victories at the Washington Open.",
      "Britain's Emma Raducanu and Cameron Norrie both secure impressive victories at the Washington Open."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7c52/live/ff8d5300-674d-11f0-9a2f-71177f780e96.jpg",
    "titles": [
      "Brits Raducanu & Norrie cause upsets in Washington",
      "Brits Raducanu & Norrie cause upsets in Washington"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.677,
    "summary": "British tennis players Emma Raducanu and Cameron Norrie achieved notable wins at the Washington Open. Raducanu defeated Shelby Rogers, while Norrie triumphed over Brandon Nakashima. Both players showcased strong performances, advancing in the tournament.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness of the event but doesn't offer much depth or insight. It doesn't give the reader actionable insights or deeper understanding, nor does it report on solutions, improvements, innovations, or attempts to solve problems.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Emma_Raducanu_2021_Transylvania_Open.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4c1da571-67b1-4842-8d97-37c211238166/thumb/",
      "alt": "Emma Raducanu 2021 Transylvania Open",
      "credit": "Nuță Lucian from Cluj-Napoca, Romania / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Microsoft Warns of Chinese Actors Exploiting SharePoint Vulnerability",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 15:31:48 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Two Chinese nation-state actors and one China-based threat actor have tried to exploit the vulnerability for weeks, Microsoft said.",
      "The tech giants have evidence that Chinese hackers are exploiting the new bug, but warned \"multiple actors\" are also hacking into affected SharePoint systems."
    ],
    "image_url": "",
    "titles": [
      "Microsoft says Chinese hacking groups exploited SharePoint vulnerability in attacks",
      "Google, Microsoft say Chinese hackers are exploiting SharePoint zero-day"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.835,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "Microsoft reported that two Chinese nation-state actors and one China-based threat actor have been exploiting a new vulnerability in SharePoint systems for weeks. Additionally, the company warned that \"multiple actors\" are also hacking into affected systems, indicating a broader cybersecurity threat. This situation underscores the active interest of various malicious entities in exploiting software vulnerabilities for unauthorized access.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story raises awareness about a specific cybersecurity threat and the broader issue of software vulnerabilities. However, it does not provide actionable insights for readers or report on specific solutions to the problem.",
    "image": {
      "src": "https://live.staticflickr.com/2193/2264763977_fbeb2e34ba_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6e22ebe1-7c72-44d0-94c0-5e8181f91752/thumb/",
      "alt": "Microsoft sign outside building 99",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Bengals' Hendrickson Skips Camp Amid Contract Dispute",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 21:28:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Hendrickson will train away from his teammates as he tries to work out a new contract with the Bengals",
      "<p>A key face is missing as the Cincinnati Bengals open training camp on Tuesday. Star edge rusher Trey Hendrickson did not report as he seeks a new contract, ESPN&#8217;s Adam Schefter reported.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/22/4f1e4f8b-3493-42d4-b4c9-dfc923254368/gettyimages-2183901221.jpg",
    "titles": [
      "Trey Hendrickson contract dispute: Bengals star pass rusher leaves Cincinnati as training camp begins",
      "Bengals star Trey Hendrickson holding out of training camp"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.945,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Trey Hendrickson, a star edge rusher for the Cincinnati Bengals, did not report to the team's training camp as he seeks a new contract. He will be training away from his teammates during this period. This development was reported by ESPN's Adam Schefter as the Bengals opened their training camp on Tuesday.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a player's decision to skip training camp due to a contract dispute. It provides minimal depth or insight beyond the immediate situation. It does not report on any solutions, improvements, or attempts to solve the problem, nor does it increase clarity around systems, causes, or trends.",
    "image": {
      "src": "https://live.staticflickr.com/819/39094909680_1b0a40a5cd_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8c63ce99-0966-447f-96ee-f199854b8a62/thumb/",
      "alt": "Bengal cat",
      "credit": "Andres Papp / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "SportsLine Model Identifies Top MLB Pitcher Strikeout Bets After 10K Simulations",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 20:39:37 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Tuesday's 15-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/26/944a8cca-30c2-428a-96db-2a2dd19dfa59/jacob-misiorowski-milwaukee-brewers-usatsi.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Back Yankees rookie against Blue Jays"
    ],
    "score_components": {
      "magnitude": 0.209,
      "recency": 0.929,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "The SportsLine Projection Model, after running 10,000 simulations of every MLB game on Tuesday's 15-game schedule, has pinpointed the top three pitcher strikeout prop bets. This analysis is based on comprehensive game simulations to forecast outcomes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights to the reader who may be interested in betting on MLB games. It uses data from comprehensive game simulations to forecast outcomes, thereby contributing to the reader's decision-making process.",
    "image": {
      "src": "https://live.staticflickr.com/7444/9520392082_d8150124ae_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2b9cae6d-91c7-42e8-b840-fb29b27cebc6/thumb/",
      "alt": "BMW 318d Touring Sportsline F31",
      "credit": "nakhon100 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "League Settles Lawsuits with Clemson, Florida State, Ending Dispute",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:28:53 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The league has successfully quelled a rebellion in the form of the lawsuits by member schools Clemson and Florida State."
    ],
    "image_url": "",
    "titles": [
      "The ACC has moved past lawsuits and uncertainty. Commissioner Jim Phillips sees stable years ahead"
    ],
    "score_components": {
      "magnitude": 0.169,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "The league has resolved lawsuits from member schools Clemson and Florida State, effectively ending the rebellion.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story reports on the resolution of a dispute, which is a form of progress. However, it lacks depth as it does not provide details on what the dispute was about or how it was resolved. Therefore, it only partially contributes to the reader's understanding.",
    "image": {
      "src": "https://live.staticflickr.com/8773/17024584826_8c0cd1c221_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4d6adc2f-53bd-42e0-9bbf-844780fd0279/thumb/",
      "alt": "Little League Bat ... Man",
      "credit": "JD Hancock / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Biodegradable Plastic Made with Squid Ink and Citric Acid",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 16:37:52 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Plastics are one of the largest sources of pollution on Earth, lasting for years on land or in water. But a new type of brilliantly colored cellulose-based plastic detailed in ACS Nano could change that. By adding citric acid and squid ink to a cellulose-based polymer, researchers created a variety "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/this-new-colorful-plas.jpg",
    "titles": [
      "New biodegradable plastic shines in vibrant colors without dyes or pigments"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.929,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Researchers have developed a new type of eco-friendly plastic by incorporating citric acid and squid ink into a cellulose-based polymer, as detailed in ACS Nano. This innovation aims to address the global pollution issue caused by traditional plastics, which persist in the environment for years. The resulting material is not only biodegradable but also brilliantly colored, offering a sustainable alternative to conventional plastics.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story highlights an innovative solution to the global pollution issue caused by traditional plastics. It provides useful information about a sustainable alternative to conventional plastics, and it could potentially influence decision-making in industries that rely heavily on plastic.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Suggests Diet Over Exercise Key to Weight Control",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 21:23:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/youre-not-lazy-but-your-diet-might-be-making-you-fat/\" rel=\"nofollow\" title=\"You’re Not Lazy – But Your Diet Might Be Making You Fat\"><img alt=\"Smiling Beautiful Confused Young Redhead Plus Size Woman\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"h"
    ],
    "image_url": "",
    "titles": [
      "You’re Not Lazy – But Your Diet Might Be Making You Fat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "A recent study highlighted by SciTechDaily suggests that dietary choices, rather than laziness, might be a significant factor in weight gain. The research points towards how certain foods can influence one's weight, debunking the common misconception that lack of exercise is the primary cause of obesity. This finding emphasizes the importance of diet in maintaining a healthy weight.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it not only provides readers with actionable insights into maintaining a healthy weight, but also challenges a common misconception about weight gain. It empowers readers with knowledge that can directly impact their decision-making regarding diet and exercise.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Shows Gender Bias Against Women in Politics",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "When women political candidates deviate from expectations or the views of their party, they are judged far more harshly than men by voters, reveals a new study in Politics & Gender."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/woman-boss.jpg",
    "titles": [
      "Women politicians judged more harshly than men, research finds"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary": "A recent study published in Politics & Gender found that women political candidates who diverge from expected behaviors or their party's views face harsher judgment from voters compared to their male counterparts. This outcome highlights a significant gender bias in political evaluations.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it increases awareness about gender bias in politics, providing readers with a deeper understanding of the challenges women face in this field. However, it does not offer any solutions or strategies to address this issue, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gene Discovered That Uses Sunlight to Kill Cancer Cells: Study",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:48:10 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-gene-that-turns-sunshine-into-a-cancer-killer/\" rel=\"nofollow\" title=\"The Gene That Turns Sunshine Into a Cancer Killer\"><img alt=\"Girl Heart Hands Love Sunshine\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Girl"
    ],
    "image_url": "",
    "titles": [
      "The Gene That Turns Sunshine Into a Cancer Killer"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.932,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary": "Researchers have identified a gene that can convert sunlight into a mechanism that kills cancer cells. The study, highlighted by SciTechDaily, focuses on the gene's potential to fight cancer through exposure to sunlight, suggesting a new avenue for cancer treatment. The current status of this discovery is in the research phase, with further studies needed to fully understand its applications and effectiveness in cancer therapy.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant scientific innovation that could potentially lead to a new avenue for cancer treatment. It increases awareness about the potential of genetic research in fighting cancer, although it's still in the research phase.",
    "image": {
      "src": "https://live.staticflickr.com/3815/12493628335_fa0ab71d3e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c7a6d84e-355c-419e-bc06-acfff60b353a/thumb/",
      "alt": "Largest part of an Apollo Lunar Module spacecraft, brought back by Commander Gene Cernan, last man on the moon",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The Escobar Phone scam saga has finally come to an end",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-22T18:27:49-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The former CEO of the company that marketed the sketchy-looking Escobar Fold 1 and Escobar Fold 2 phones — which you may remember from a 2020 video from Marques Brownlee — has pleaded guilty to fraud and money laundering, according to the US Department of Justice. In a plea agreement, United States "
    ],
    "image_url": "",
    "titles": [
      "The Escobar Phone scam saga has finally come to an end"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about the conclusion of a scam saga, which could be useful for those following the story or interested in tech scams. It does not report on solutions or improvements, but it does increase awareness about the potential risks in the tech industry.",
    "image": {
      "src": "https://live.staticflickr.com/8178/7953813066_6c2ee50fc3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4093d7b-daf4-4125-aa3c-a1a0c2e9a342/thumb/",
      "alt": "Escobar returns to the dugout.",
      "credit": "james_in_to / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Windows 11&#8217;s new update will add a bunch of AI features",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-22T16:41:08-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Microsoft is releasing several new AI features for Windows 11, including its Copilot Vision tool that can scan everything on your screen. The features, which are gradually rolling out to everyone now, also include tools that are exclusive to Copilot Plus PCs. For starters, all Windows 11 users can n"
    ],
    "image_url": "",
    "titles": [
      "Windows 11&#8217;s new update will add a bunch of AI features"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.93,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about the new features that will be added in the Windows 11 update. However, without more information on how these AI features can be used or their potential impacts, it lacks a full score.",
    "image": {
      "src": "https://live.staticflickr.com/5135/5459504420_1450c36a5f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ee762f68-414b-4f94-bca3-bc99a72926fe/thumb/",
      "alt": "Window",
      "credit": "Mullica / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK Reports Increase in Dog Thefts During COVID Pandemic",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 14:10:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Dog theft can be a devastating crime. During the COVID pandemic, newspapers suggested there was an epidemic of \"dognapping\" in the UK. If you have a dog, the reports may have alarmed you at a time when there were already many reasons to feel afraid."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/dog.jpg",
    "titles": [
      "Dog thefts: What really happened during the COVID pandemic"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.882,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "During the COVID pandemic, reports in the UK suggested a rise in dog thefts, causing alarm among dog owners. The crime of dog theft can have severe emotional impacts. However, it is essential to verify specific data and statistics to understand the true extent of the issue.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the rise in dog thefts during the pandemic, but it lacks depth or insight into the reasons behind this trend or what actions can be taken in response. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Jakarta and Washington Publish Agreement Details, Move Forward",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 22:07:03 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Jakarta and Washington release details of agreement first announced last week"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb93c693d-7ff2-41f3-a985-eb9d82a71477.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Indonesia agrees to drop non-tariff barriers in Trump trade victory"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Jakarta and Washington have officially released the details of an agreement that was initially announced last week. The publication of these details marks the next step in formalizing the cooperation between the two capitals. The current status of the story is that the agreement is moving forward as planned, with both parties having made the specifics of their arrangement public.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is useful as it provides an update on an ongoing international agreement, but it doesn't provide any deep insights or actionable information. The story does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/1642/25455481630_9a56304dae_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/49b7afe6-cf35-4f5c-b0c3-7ca516f0f109/thumb/",
      "alt": "KD's World Tour: Jakarta",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AI Reveals Papua New Guineans' Genetic Link to Asians",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 15:29:14 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A team of European researchers has shed new light on the genetic origins of Papua New Guineans. The team uses advanced artificial intelligence (AI) tools to demonstrate that Papua New Guineans are closely related to other Asian populations. They share a common ancestry from the same Out of Africa ev"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/papua-new-guinea-1.jpg",
    "titles": [
      "New AI study clarifies the origins of Papua New Guineans"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.907,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "European researchers, utilizing advanced AI tools, have discovered that Papua New Guineans share a close genetic relationship with other Asian populations. This connection is rooted in a common ancestry from the same Out of Africa event, highlighting the deep historical ties between these groups.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of the genetic relationship between Papua New Guineans and other Asian populations, using AI tools. However, it doesn't offer actionable insights or report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Studies Show COVID-19's Long-Term Effects on Brain Health",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 17:00:20 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The covid-19 pandemic changed our lives, and the world, in many ways - and now we are starting to understand its wider neurological effects"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/22151920/SEI_2596765891.jpg",
    "titles": [
      "The pandemic may have aged our brains even before we caught covid-19"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "The COVID-19 pandemic has significantly impacted global health and daily life. Recent studies are beginning to reveal its broader neurological effects, indicating long-term consequences on brain health and function. This ongoing research aims to understand the full scope of COVID-19's impact on the nervous system.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it provides insights into the long-term effects of COVID-19 on brain health. It increases awareness about the ongoing research into the effects of the virus on the nervous system. However, it does not report on any solutions or improvements, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "OpenAI agreed to pay Oracle $30B a year for data center services",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:36:31 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI was the customer that signed the huge deal that Oracle disclosed last month."
    ],
    "image_url": "",
    "titles": [
      "OpenAI agreed to pay Oracle $30B a year for data center services"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.414,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This news provides useful context about the business decisions of OpenAI and Oracle, but it does not provide actionable insights or deeper understanding of the implications of this agreement. More information on how this will affect the operations of OpenAI or the data center services industry would make it more constructive.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Andrej_Karpathy%2C_OpenAI.png",
      "thumbnail": "https://api.openverse.org/v1/images/295e4310-a6a5-419d-b3c5-a830a6e6a434/thumb/",
      "alt": "Andrej Karpathy, OpenAI",
      "credit": "Gladwin Analytics / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "CNU Hosts Annual STEM Day with NASA, Draws 2,000+ Visitors",
    "domain": "science",
    "location": "global",
    "published": "Tue, 22 Jul 2025 21:25:10 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "More than 2,000 curious visitors from Newport News and the surrounding Hampton Roads region of Virginia flocked to Christopher Newport University (CNU) on May 31, 2025 for their annual STEM (Science, Technology, Engineering, &#038; Mathematics) Community Day, and the NASA eClips team from the Nation"
    ],
    "image_url": "",
    "titles": [
      "NASA eClips STEM Student Ambassadors Light Up CNU’s 2025 STEM Community Day"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary": "On May 31, 2025, Christopher Newport University (CNU) in Virginia hosted its annual STEM Community Day, attracting over 2,000 visitors from Newport News and the Hampton Roads area. The event featured the NASA eClips team, showcasing the importance of science, technology, engineering, and mathematics education.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a local event promoting STEM education, increasing awareness about the importance of these fields. However, it lacks depth and does not highlight any specific improvements, innovations, or problem-solving efforts, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/8263/8661134109_1eb3903673_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/287174a7-bcbd-496b-b08b-b39f8404842d/thumb/",
      "alt": "This Maybe One Of Last Photos From CNU",
      "credit": "Tobyotter / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "California backs down to Trump admin, won’t force ISPs to offer $15 broadband",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 19:37:45 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "\"Complete farce\": State lawmaker says US threatened to block broadband funding."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/ethernet-cable-1152x648-1753211398.jpg",
    "titles": [
      "California backs down to Trump admin, won’t force ISPs to offer $15 broadband"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.91,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.411,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant decision in the realm of internet service provision and policy. However, it doesn't clearly highlight progress or solutions, nor does it empower readers with actionable insights. It does, however, provide some context and understanding about the dynamics between state and federal policies.",
    "image": {
      "src": "https://live.staticflickr.com/8354/8254367277_452cb214cb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/aaeaf724-679f-4b83-ab6c-041be5bb3c66/thumb/",
      "alt": "Ferrari California",
      "credit": "PRodriguez- / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "NFL Draft Prospect Zion Bond Accused of Sexual Assault, Investigation Underway",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:01:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A woman accused Bond of sexual assault ahead of the 2025 NFL Draft"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/22/3a7ca02a-d377-48a9-b071-42be46a6b5e6/gettyimages-2188763930-1.jpg",
    "titles": [
      "Ex-Texas, Alabama WR Isaiah Bond's defamation lawsuit against accuser dismissed"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407,
    "summary": "A woman has accused football player Zion Bond of sexual assault just before the 2025 NFL Draft. The accusation has raised concerns and is being investigated. Bond has denied the allegations, and the situation is ongoing as authorities look into the matter.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a serious allegation against a prominent figure. However, it is mostly reactive and does not provide much depth or insight into the situation. It does not report on any solutions or attempts to solve the problem, and it does not empower the reader with knowledge beyond the basic facts of the case.",
    "image": {
      "src": "https://live.staticflickr.com/7271/7734098362_2dd854d516_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/977b0237-5cfd-43d5-a9c7-208195c430f2/thumb/",
      "alt": "CPSC, NFL Tout Safer Play",
      "credit": "USCPSC / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "2025 Aston Martin Vanquish Volante: A-M’s ultimate GT goes topless",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 23:01:05 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Only a handful of the V12 convertibles will come to the US each year."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/IMG_7213-1152x648.jpg",
    "titles": [
      "2025 Aston Martin Vanquish Volante: A-M’s ultimate GT goes topless"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a new car model, but it does not provide deeper insights or actionable information. It does not report on solutions, improvements, or attempts to solve problems, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9F%D1%83%D1%82%D0%B8%D0%BD_%282025-05-22%29_cropped.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bf5bd12a-4d6b-4617-a13a-66eb1f2cf82c/thumb/",
      "alt": "Владимир Путин (2025-05-22) (cropped)",
      "credit": "Пресс-служба Президента России / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Apple Intelligence news summaries are back, with a big red disclaimer",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 20:24:41 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Apple disabled news summaries earlier this year after they mangled headlines."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/apple-summary-26-1152x648-1753213115.jpeg",
    "titles": [
      "Apple Intelligence news summaries are back, with a big red disclaimer"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.925,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the return of Apple Intelligence news summaries, but without more information on what the 'big red disclaimer' entails or why it's significant, it lacks depth and insight.",
    "image": {
      "src": "https://live.staticflickr.com/2833/12956313933_6058b1315e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4939b4c-aa73-4256-bb52-9b25962562d9/thumb/",
      "alt": "Apples",
      "credit": "JeepersMedia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Tech Earnings Season Starts with Alphabet and Tesla Results",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 18:55:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Tech earnings season kicks off on Wednesday after market close with results from Alphabet and Tesla."
    ],
    "image_url": "",
    "titles": [
      "Wall Street is upbeat on tech megacaps, but big questions loom on AI spending, China, Trump tariffs"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.897,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.401,
    "summary": "Tech earnings season began on Wednesday after the market closed, with Alphabet and Tesla releasing their financial results. This marks the start of a period where technology companies report their earnings, providing insight into their financial health and performance.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the commencement of the tech earnings season and the companies kicking it off. However, it could be more constructive by providing context about the companies' previous performances, market expectations, or potential impacts of these results.",
    "image": {
      "src": "https://live.staticflickr.com/3173/5867419816_fc5e3a8a56_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4a1eb12-ddb1-4213-a4ba-9d11c7e98b9a/thumb/",
      "alt": "Tech",
      "credit": "Steverapid / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Auger-Aliassime Understands Fan Disappointment Over Top Players' Absence",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 22 Jul 2025 19:12:20 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Felix Auger-Aliassime feels for Canadian tennis fans who are disappointed by the withdrawals of big-name players from the National Bank Open.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/02/Félix-Auger-Aliassime.jpg",
    "titles": [
      "Canada’s Felix Auger-Aliassime calls National Bank Open withdrawals ‘unfortunate’"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388,
    "summary": "Canadian tennis player Felix Auger-Aliassime empathizes with fans upset by the absence of top players at the National Bank Open. The withdrawals have left fans disappointed, impacting the tournament's lineup.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the situation in the National Bank Open and the reaction of Felix Auger-Aliassime. However, it lacks depth or insight into why top players are absent, how it impacts the tournament beyond fan disappointment, or what might be done to address such situations.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Felix_Auger-Aliassime_2016.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/35c556c5-cf00-4ead-989d-cc49e6a897c9/thumb/",
      "alt": "Felix Auger-Aliassime 2016",
      "credit": "Maxwell Fung / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "AHIP to Release Q2 Financial Results After Market Close on July 30, 2025",
    "domain": "business",
    "location": "national",
    "published": "Tue, 22 Jul 2025 23:03:07 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "VANCOUVER, British Columbia, July 22, 2025 (GLOBE NEWSWIRE) &#8212; American Hotel Income Properties REIT LP (“AHIP”, “the Company”) (TSX: HOT.UN, TSX: HOT.U, TSX: HOT.DB.V) announces today that it intends to release its financial results for the quarter ended June 30, 2025 after market close on Wed"
    ],
    "image_url": "",
    "titles": [
      "American Hotel Income Properties REIT LP to Host Second Quarter 2025 Results Conference Call on August 7, 2025"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387,
    "summary": "American Hotel Income Properties REIT LP, also known as AHIP, plans to disclose its financial results for the quarter ending June 30, 2025, after the market closes on Wednesday. The announcement was made in Vancouver, British Columbia, on July 22, 2025.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the timing of AHIP's financial results release. However, it lacks depth or insight into what to expect from the results, how the company has performed in the past, or what factors might have influenced this quarter's performance.",
    "image": {
      "src": "https://live.staticflickr.com/7014/6540043963_619bb47490.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/34a627a5-3014-4d35-8957-4e3972319009/thumb/",
      "alt": "Lego Star Wars Advent Calendar: Day 18. Y-wing starfighter. The BTL Y-wing starfighter, built by Koensayr Manufacturing, was a mainstay of the Alliance Starfighter Corps. It was often used as an assault bomber to attack enemy capital ahips directly in con",
      "credit": "AngryJulieMonday / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Toy company may regret coming for “Sylvanian Drama” TikToker, experts say",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 22 Jul 2025 21:53:51 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Possible legal paths to revive a shuttered video series on TikTok and Instagram."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-104125130-1024x648.jpg",
    "titles": [
      "Toy company may regret coming for “Sylvanian Drama” TikToker, experts say"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.954,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.383,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a conflict between a toy company and a TikToker, but it doesn't provide deeper understanding or actionable insights. It also doesn't report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/2123/1818329845_4dea0665ca_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/870f8434-cd74-46d8-939c-c10a26f17134/thumb/",
      "alt": "Broken robot toy",
      "credit": "Plutor / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Nicolas Jackson Poised for Manchester United Transfer from Chelsea",
    "domain": "business",
    "location": "global",
    "published": "Tue, 22 Jul 2025 17:30:38 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Nicolas Jackson has been linked with a summer transfer to Manchester United after falling down the pecking order at Chelsea."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/688002933e42a49b586833cb/0x0.jpg?width=960",
    "titles": [
      "Could Unwanted Chelsea Striker Be The Solution To Man Utd’s Problems?"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.946,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.381,
    "summary": "Nicolas Jackson is reportedly set for a summer transfer to Manchester United due to decreased playing time at Chelsea. The player's future seems to be moving towards a switch to Manchester United as he has lost his spot in the Chelsea lineup.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's potential transfer. However, it does not provide deeper insight into the reasons behind the transfer, the implications for both teams, or the player's performance that led to this decision.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Nicola_Sturgeon_2021.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d9f7df1c-b7f1-4441-96cb-d8dfe14e989f/thumb/",
      "alt": "Nicola Sturgeon 2021",
      "credit": "Scottish Government / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  }
]