[
  {
    "title": "Trump to Deploy Troops to Portland, Threatens \"Full Force\" Use",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:12:33 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "Fortune",
      "Axios",
      "Global News",
      "Forbes",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.npr.org",
      "globalnews.ca",
      "fortune.com",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "President Trump said Saturday he will send troops to Portland, \"authorizing Full Force, if necessary\" to handle \"domestic terrorists\" as he expands his controversial deployments to more U.S. cities.",
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local offic",
      "Portland Mayor Keith Wilson said Friday night that the city already was seeing a sudden surge in federal agents, describing armored vehicles and agents arriving on the streets.",
      "President Donald Trump ordered a crackdown on alleged “organized political violence,” claiming “riots” targeted ICE agents.",
      "Trump said the decision was necessary to protect U.S. Immigration and Customs Enforcement facilities."
    ],
    "image_url": "",
    "titles": [
      "Trump says he'll send troops to Portland, Ore., to handle 'domestic terrorists'",
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Donald Trump says he is deploying troops to Portland, Oregon",
      "Trump orders U.S. troops to Portland, Oregon, authorizes ‘full force’",
      "Trump Orders Troops To Portland—Authorizes ‘Full Force’",
      "Trump says he’ll send troops to Portland, Oregon, in latest deployment to US cities"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.903,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.866,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump announced on Saturday that he plans to deploy troops to Portland, Oregon, authorizing the use of \"Full Force\" if needed to counteract what he termed \"domestic terrorists.\" This decision aims to protect U.S. Immigration and Customs Enforcement facilities. The announcement was made via social media, with no immediate details provided by the White House.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Wins Third Women's Rugby World Cup, Defeating Canada 33-13",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:43:53 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC",
      "CityNews",
      "Global News",
      "The Guardian"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.bbc.com",
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "England produce a performance full of power and ferocity to defeat Canada at Twickenham and win the Women's Rugby World Cup for a third time.",
      "England have won their third Rugby World Cup title with a commanding 13-33 performance over Canada in front of an 81,885 person home crowd in Twickenham.",
      "<ul><li><p>Final: Canada 13-33 England</p></li><li><p>Ellie Kildunne shines for largest crowd in women’s rugby history</p></li></ul><p>If this were a movie, the scriptwriters would be shoo-ins for an Oscar, the plot centred on a dominant team who overcame the heartbreak of losing two back-to-back Ru",
      "England finally has a Women's Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.",
      "<p>England finally has a Women&#8217;s Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.</p>",
      "England finally has a Women&#8217;s&#160;Rugby&#160;World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday. Victory by five tries to three capped an astonishing World Cup cycle in which England won every match, 33 in a row,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab87/live/d15f17c0-9bc8-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "England overpower Canada to win Women's World Cup",
      "Dominant England beat Canada to win Rugby World Cup",
      "England outclass Canada to capture glorious Women’s Rugby World Cup triumph",
      "Canada loses in Women’s Rugby World Cup final",
      "Canada drops Women’s Rugby World Cup final against England",
      "Canada loses Women’s Rugby World Cup final 33-13 to England"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.951,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England won their third Women's Rugby World Cup title by defeating Canada 33-13 at Twickenham, in front of a record crowd of 81,885. Ellie Kildunne stood out in a game that marked England's dominance in women's rugby, completing a perfect World Cup cycle with 33 consecutive wins. This victory cements England's status as a powerhouse in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees' Chisholm Jr. Exits Game After Being Hit by Pitch",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 15:46:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.pinstripealley.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Yankees' Jazz Chisholm Jr. left the game against the Orioles in the fifth Saturday after being hit on the left forearm by a pitch from the Orioles' Grant Wolfram.",
      "The second baseman was pulled after getting plunked in the fifth.",
      "<p>New York Yankees second baseman Jazz Chisholm Jr. takes a pitch on the arm from Baltimore Orioles pitcher Grant Wolfram and heads straight to the dugout, being replaced in the game by Jose Caballero.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yanks' Chisholm leaves after being hit by pitch",
      "Jazz Chisholm Jr.’s X-rays negative after getting hit by pitch",
      "Yankees’ Chisholm Jr. leaves game after taking pitch to arm"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jazz Chisholm Jr., the Yankees' second baseman, exited the game in the fifth inning after being hit on the left forearm by a pitch from Orioles' Grant Wolfram. He was replaced by Jose Caballero.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anaheim Ducks Sign Mason McTavish to $42M, Six-Year Extension",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 15:30:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Anaheim Ducks and restricted free-agent center Mason McTavish, the 2021 third overall pick who is entering his fifth season, agreed to a six-year extension, the club announced on Saturday, and an NHL source told ESPN the deal is worth $42 million.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFB6ZVNVb0VVb3RRd0xNYUdMVFFfYlNseUt0RDRyb01LQ3BOQ0FtdGZRLWNrUE9MR3JwMGtTTnVGTXY3dFczQ0Zxalpyc05HYmZodXExQ2RRRHVjMFhBS0ZmNk16dFdQTFY0VjZZUmtWNHptYTM4cDdRamxIaw?oc=5\" target=\"_blank\">Ducks Sign McTavish to Six-Year Contract</a>&nbsp;&nbsp;<font",
      "<p>Sportsnet&#8217;s Elliotte Friedman reported on Saturday that the 22-year-old centre is closing in on a six-year contract extension worth $42 million. The deal carries a $7 million average annual value.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: Ducks give McTavish six-year, $42M deal",
      "Ducks Sign McTavish to Six-Year Contract - NHL.com",
      "Ducks, Mason McTavish agree to six-year, $42M extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.987,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Anaheim Ducks have signed restricted free-agent center Mason McTavish to a six-year extension worth $42 million, as announced by the club and reported by ESPN and Sportsnet's Elliotte Friedman. McTavish, the 2021 third overall pick entering his fifth season, will have an average annual value of $7 million under this deal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 12:11:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "www.dw.com",
      "financialpost.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Unidentified drones seen at several places, including the biggest army base, after a slew of earlier sightings.",
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "<p>Unidentified drones spotted at the countries’ biggest military bases, Karup in Denmark and Orland in Norway</p><p>Unidentified drones have been spotted over major military bases in Denmark and Norway, the latest in a series of sightings some officials have hinted might be linked to Russia.</p><p>",
      "BERLIN (AP) &#8212; The Danish defense ministry said Saturday that &#8220;drones have been observed at several of Danish defense facilities.&#8221; The new drone sightings overnight Friday into Saturday come after there were several drone sightings in the Nordic country earlier this week, with some "
    ],
    "image_url": "",
    "titles": [
      "Denmark reports new drone sightings overnight at military sites",
      "Denmark: New drone sightings over military infrastructure",
      "Denmark and Norway report new drone sightings over major military bases",
      "Denmark reports new drone sightings at military facilities"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.848,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Leads U.S. 8.5-3.5 at Ryder Cup Day 2; McIlroy Shines",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 12:46:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "The bleeding continued for the U.S. team at the 45th Ryder Cup, as the Americans lost three of four foursomes matches and trail the Europeans 8.5-3.5.",
      "<p>⛳ Ryder Cup updates from Bethpage Black</p><p>⛳ <a href=\"https://www.theguardian.com/sport/2025/sep/26/tommy-fleetwood-jon-rahm-rory-mcilroy-ryder-cup-europe-usa\">Ewan Murray’s day-one report</a> | <a href=\"https://www.theguardian.com/sport/2025/sep/25/bethpage-black-hole-by-hole-course-guide-202",
      "<p>President Donald Trump did not attend Day 2 at the Ryder Cup. That was about the only difference Saturday as Europe sent out its same foursomes teams, filled the scoreboard with blue points and delivered a crushing blow to the Americans.</p>",
      "<p>Rory McIlroy was always going to be a leader of men this week, and Friday he proved his worth in spades to open the Ryder Cup. </p>"
    ],
    "image_url": "",
    "titles": [
      "Europe extends Ryder Cup lead over reeling U.S.",
      "Ryder Cup: USA 3½-8½ Europe – visitors extend lead after foursomes",
      "Europe takes commanding Ryder Cup lead after winning another session",
      "McIlroy, Europe grab early Ryder Cup lead as American top dogs falter"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the 45th Ryder Cup, the U.S. team trails Europe 8.5-3.5 after losing three of four foursomes matches on Day 2. Despite changes from Day 1, Europe's strategy remained effective, with notable performance from Rory McIlroy. President Donald Trump did not attend the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 06:36:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The US says it will revoke the visa of Colombian President Gustavo Petro, who urged US soldiers to disobey Trump.",
      "The left-wing Colombian president is a critic of Trump and vocally opposes Israel's operation in Gaza. Petro is in New York for the UN General Assembly and had called on US soldiers to disobey Trump.",
      "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for h",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally."
    ],
    "image_url": "",
    "titles": [
      "US to revoke Colombian President’s visa after Gaza protest speech",
      "Gustavo Petro: US to revoke visa of leftist Colombian leader",
      "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "U.S. Says It Will Revoke Colombian President’s Visa"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.755,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.747,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Killed in Stampede at Vijay's Rally in Tamil Nadu, Toll May Rise",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:31:42 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Tens of thousands had gathered at a campaign event for actor-turned-politician Vijay in India's southern state of Tamil Nadu.",
      "At least 36 people were killed in a stampede at a campaign rally for the popular Tamil actor-turned-politician, officials said.",
      "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay. A health official said the toll was likely to rise."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2b4a/live/55e79ee0-9bc9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Dozens dead in crush at political rally in India",
      "India: Dozens killed at rally for actor-politician Vijay",
      "Stampede at Actor’s Political Rally Kills at Least 36 People in India"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At least 36 people were killed in a stampede during a campaign rally for actor-turned-politician Vijay in Tamil Nadu, India. The event drew tens of thousands of supporters. Health officials warn the death toll may increase.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Schneider Starts in Left Field for Blue Jays in Key Game Against Tampa Bay",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 17:19:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Davis Schneider got the start in left field for the Blue Jays on Saturday against Tampa Bay as Toronto aimed to move closer to clinching the American League East Division title.",
      "<p>Davis Schneider gets the start in left field for the Blue Jays against Tampa Bay as Toronto aims to move closer to clinching the American League East Division title. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/abbdc6aac49cf6bba645a8bfac9300ce00421e95fecf3c337f2a62746fb583e5_5a52f3.jpg?quality=65&strip=all",
    "titles": [
      "Davis Schneider gets start in left field for Jays",
      "Schneider gets start in left field against Rays as Blue Jays aim to trim magic number"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Davis Schneider was selected to start in left field for the Toronto Blue Jays in their game against Tampa Bay. This move is part of Toronto's strategy to advance towards clinching the American League East Division title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Calls for Firing of Microsoft Exec Lisa Monaco Over Biden Ties",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 23:54:26 GMT",
    "source": "Axios",
    "sources": [
      "The Verge",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1RaVR3bjljR29POWhyZ1hONlY1XzB0RktWN1J3d1o1anE3ZHdhbDZXZ1VlbDV3VWFJTUMtdFRteFo4WDlqOHBMYmxoeWdtTzN3VkliRDlBYU91OWhOUGFmMlZzd0dVcE5ZNzlNRg?oc=5\" target=\"_blank\">Trump demands Microsoft oust global affairs chief over Biden-era ties</a>&nbsp;&n",
      "Fox Business anchor Maria Bartiromo brought up Monaco's position at Microsoft during her show. The appointment happened in July.",
      "After successfully manipulating Intel CEO Lip-Bu Tan and eventually failing to cancel Jimmy Kimmel, President Donald Trump has named his next target for retribution: Microsoft head of global affairs Lisa Monaco. He’s calling for her to be fired. On Truth Social, Trump claims that Monaco, who just to"
    ],
    "image_url": "",
    "titles": [
      "Trump demands Microsoft oust global affairs chief over Biden-era ties - Axios",
      "Trump calls for the firing of Lisa Monaco, Microsoft president of global affairs",
      "Trump’s new target: Microsoft head of global affairs Lisa Monaco"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.643,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump called for the firing of Microsoft's President of Global Affairs, Lisa Monaco, on Truth Social. Trump's demand comes after Monaco's appointment in July, citing her ties to the Biden era. This move follows Trump's previous attempts to influence corporate leadership, including Intel CEO Lip-Bu Tan and a failed effort to cancel Jimmy Kimmel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sinclair, Nexstar End Boycott of \"Jimmy Kimmel Live!\", Resume Airing",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 21:57:23 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQcS1vVldJUUsyYmtBTXdWS1FtQllsaWhPMHB1Z0lLc18zMGlvTzVGTVRXQlpGTlBlYmpIX1YyUEpRS01RRFBqbzNSTS1Qb3h2QXVnN2JkcUI3bUxNaTZwdXdHV3V4QTdITV9NUUFoRVJ5YVotQmZQVnR1RlczQzJXdUhRVQ?oc=5\" target=\"_blank\">Jimmy Kimmel to return to Nexstar and Sinclair's ",
      "Broadcast station owners Sinclair and Nexstar will begin airing \"Jimmy Kimmel Live!\" after three days of preempting the program since its return.",
      "Sorry, Brendan Carr: Sinclair and Nexstar stop preempting Kimmel on ABC affiliates."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel to return to Nexstar and Sinclair's ABC affiliates Friday - Axios",
      "Sinclair, Nexstar will bring 'Jimmy Kimmel Live' back to owned ABC stations on Friday",
      "Sinclair gets nothing it asked for, puts Jimmy Kimmel back on anyway"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.617,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sinclair Broadcast Group and Nexstar Media Group have ended their boycott of \"Jimmy Kimmel Live!\", agreeing to resume airing the late-night show on their ABC affiliate stations starting Friday night. This decision comes after a three-day preemption that left approximately 25% of US TV viewers unable to watch the program.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Inter Miami Trails in Supporters' Shield Race; Key Matches Ahead",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 17:52:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The Supporters' Shield race is heating up as Inter Miami are five points off the lead.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPMHJEQTFELWdCSVZwVXk1MjZwX2hlX0hiRngtMzRGbndKdTRMNTBueEpmS0F2aUpsbW1lcHdwejhtQVN1elFtQkRsWFh6RHVST01UenBfZXZFb3JfbGowdE9JT3MyODRLOEpRNFlrZUY3Znl5aTd6UU9faWxvZTRaTm9aNE03S0RzTE8zLQ?oc=5\" target=\"_blank\">How to Watch Chelsea vs. Brighton on ",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPWno5WmtRZHVPZFJjUkhjdnBIQUh5VmtocmliQXhoRWRJeE9jTHBpODFFSUw0cDZFMVIzZFktVjJ3Yng3cWxMTFFGRkZxOWR1TWozd0YwN2FHcHc5cm91aFItVHUtVDFvOVc4OEFiOF90bTRoTTFJZWFVVE1YOXg4Y0l0ZFRPdjBnUjVVQzhn?oc=5\" target=\"_blank\">How to Watch Brentford vs. Man Utd ",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNQUlvTUc5OG1FdDVZWlh1SEltbUhwb1RGSnZRY21jbGZTRk9fcHdnOVJmOV8tcmZaWVpONGIwWHBtcWM3X0tuTHhiTXh4aFZ5Q0xzc09xbGdabWd6Q1NEeGd0ZWE2R3h4UDhwNmU4bUllX1VjUTZ1czZuWF9sU3BCOVhhTmRwNk1LQVBHUA?oc=5\" target=\"_blank\">How to Watch Man City vs. Burnley on "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/27/7998f4c6-8471-4c2b-a480-c4d94ddd1376/untitled-design-2025-09-27t195054-975.png",
    "titles": [
      "How to watch Lionel Messi and Inter Miami vs. Toronto FC live stream: Start time, odds, MLS schedule",
      "How to Watch Chelsea vs. Brighton on TV, Live Stream - Sports Illustrated",
      "How to Watch Brentford vs. Man Utd on TV, Live Stream - Sports Illustrated",
      "How to Watch Man City vs. Burnley on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Inter Miami is currently five points behind in the Supporters' Shield race, indicating a tight competition as the season progresses. For soccer fans looking to catch up on related matches, options to watch include Chelsea vs. Brighton, Brentford vs. Man Utd, and Man City vs. Burnley, with details available through provided links.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bradley Adjusts Strategy for Ryder Cup Day 2 After Morning Setbacks",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 18:32:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "After sticking to the same pairings in the morning backfired, Keegan Bradley is changing it up in the afternoon",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPM09SeG9ydEdBUkR0Y3NqR2tZUkhMTWJNZy1SeDYyWHZXQVJLMThIUFZ6MXAycmlJRlpDRXFOTFpRZGhQaE83amtPNVo0UXdHTzV3YlFWY05BdVBPVHFoYmlHYy1aVzNBR1FybW03d1h6ZTRMcG1sSzlUUXlXUHNWbGNjYzVSVWdhd3NMVg?oc=5\" target=\"_blank\">Ryder Cup Day 2 Morning Foursomes Pai"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/27/153d54fd-7a70-4310-b4a6-32931a0edfbd/scottie-bryson.jpg",
    "titles": [
      "2025 Ryder Cup schedule, matchups: Bryson DeChambeau, Scottie Scheffler headline four-ball pairings on Day 2",
      "Ryder Cup Day 2 Morning Foursomes Pairings: Bryson DeChambeau First Again for U.S. - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Keegan Bradley, after an unsuccessful morning with consistent pairings, has decided to switch strategies for the afternoon sessions of the Ryder Cup Day 2. The change aims to improve outcomes following the morning's setbacks.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sunderland Enters Champions League Places, Forest's Santo Dismissed",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:50:02 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<p>Sunderland continued their dream start back in the Premier League as Omar Alderete’s first-half goal elevated them into the Champions League places but for Nottingham Forest, for whom qualifying for Europe was not enough for Nuno Espírito Santo to keep his job beyond the season’s first internatio",
      "FREE TO WATCH: Highlights from Nottingham Forest&#8217;s match against Sunderland in the Premier League."
    ],
    "image_url": "https://i.guim.co.uk/img/media/e4733f866a165c6bccd60c992ea10b9d5e046f10/144_0_1771_1417/master/1771.jpg?width=140&quality=85&auto=format&fit=max&s=d5db9551b033f371f77cb70057819fc7",
    "titles": [
      "Sunderland sink Nottingham Forest to leave Ange Postecoglou waiting for win",
      "Sunderland secure huge win at Forest to heap more misery on Ange"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sunderland secured a spot in the Champions League places after Omar Alderete scored in the first half, contributing to their successful return to the Premier League. Despite Nottingham Forest's efforts to qualify for Europe, Nuno Espírito Santo was dismissed from his managerial position following the season's first international break.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Dead, 50+ Injured in Stampede at Tamil Nadu Rally",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 19:22:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Vijay, who is a well-known actor and goes by only one name, launched a political party last year.",
      "<p>Victims include eight children at election campaign gathering in Tamil Nadu led by popular actor and politician </p><p>At least 36 people have been killed and more than 50 injured in a stampede at a rally for a popular actor and politician in India.</p><p>The health minister in the southern India"
    ],
    "image_url": "",
    "titles": [
      "At least 31 dead, over 50 injured at Indian actor-politician Vijay’s rally",
      "At least 36 dead and more than 50 injured in stampede at Vijay rally in India"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At least 36 people were killed and over 50 injured in a stampede at a rally in Tamil Nadu, India, led by popular actor and politician Vijay. The incident occurred during an election campaign gathering, with eight children among the victims.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Deploys Troops to Protect Immigration Facilities in Major US City",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:35:45 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The president says the latest move to send troops to a major US city is \"necessary\" to protect immigration detention facilities.",
      "Move to protect immigration enforcement facilities is fourth deployment in Democrat-controlled US cities"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f35b/live/f3e23540-9bcb-11f0-abc3-59cd99a67fd1.jpg",
    "titles": [
      "Trump authorises 'full force' as Portland set to become latest city to see troops deployed",
      "Trump authorises ‘full force’ as he orders troops to Portland to protect ‘war-ravaged’ city"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The President has announced the deployment of troops to a major US city, marking the fourth such action in Democrat-controlled cities. This move aims to safeguard immigration detention facilities, deemed \"necessary\" for their protection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince William Shares 2024 as Toughest Year on \"The Reluctant Traveler\"",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 08:01:02 -0400",
    "source": "ABC News",
    "sources": [
      "CityNews",
      "ABC News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "abcnews.go.com"
    ],
    "snippets": [
      "Prince William has told &ldquo;Schitt's Creek&rdquo; star Eugene Levy that 2024 was the hardest year of his life",
      "LONDON (AP) — Prince William has told “Schitt&#8217;s Creek” star Eugene Levy that 2024 was the hardest year of his life. The royal made an appearance on Levy&#8217;s show “The Reluctant Traveler” and spoke about last year, which saw his wife Kate, the Princess of Wales, and his father King Charles "
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/wirestory_a352852fc546e7182d2354cf5356a967_4x3_384.jpg",
    "titles": [
      "Prince William says 2024 was the hardest year of his life",
      "Prince William says 2024 was the hardest year of his life"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.845,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Prince William revealed to Eugene Levy on \"The Reluctant Traveler\" show that 2024 was the most challenging year of his life. This disclosure was made during an appearance that highlighted personal difficulties, involving his wife Kate, the Princess of Wales, and his father, King Charles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 10:06:23 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "WASHINGTON (AP) — Tensions between the United States and Colombia have escalated with the State Department announcing it was revoking a visa for Gustavo Petro, president of the Latin American country, after he participated in a New York protest where he called on American soldiers to disobey Preside"
    ],
    "image_url": "",
    "titles": [
      "State Department revokes visa for Colombian President Gustavo Petro",
      "US revokes visa for Colombia’s president after he urges American soldiers to disobey Trump"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.812,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Women Die Crossing Channel to Britain in Makeshift Boat",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:54:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Authorities say the pair died off the coast of northern France after about 100 people set off by makeshift boat.",
      "<p>French authorities say about 100 people were attempting to reach the UK on a makeshift boat</p><p>Two women have died while trying to cross the Channel to Britain, French authorities said.</p><p>The incident occurred south of the beaches of Neufchâtel-Hardelot, where about 100 people were trying "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9fb/live/b3e81c80-9b8e-11f0-bdeb-9de9348d5d1d.jpg",
    "titles": [
      "Two women die during failed Channel crossing attempt",
      "Two women die trying to cross Channel from France"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two women died attempting to cross the Channel to Britain in a makeshift boat, according to French authorities. The incident involved around 100 people and occurred south of Neufchâtel-Hardelot, off the coast of northern France.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran Recalls Ambassadors from E3 Over Nuclear Sanctions Move",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 08:31:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The E3 countries triggered the mechanism one month ago to reimpose sanctions, which come into effect on Sunday.",
      "As Iran braces for potential sanctions, it has recalled its ambassadors to Germany, France and the UK. Meanwhile, Lebanon's Hezbollah group marks the first anniversary of the killing of its leader Nasrallah. Follow DW."
    ],
    "image_url": "",
    "titles": [
      "Iran recalls envoys to UK, France, Germany as UN sanctions reimposed",
      "Iran summons European envoys ahead of expected sanctions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.785,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iran has recalled its ambassadors from France, Germany, and the UK in response to the E3 countries triggering a mechanism to reimpose U.N. nuclear sanctions, set to take effect on Sunday. This move comes as Iran prepares for the potential impact of these sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Faces Government Shutdown Over Border Wall Funding Dispute",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 03:23:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "The government previously shut down during President Donald Trump's first term over disputes about funding his planned U.S.-Mexico border wall.",
      "US government shutdowns have become so common in recent decades that every federal agency has a playbook for how to implement them."
    ],
    "image_url": "",
    "titles": [
      "Here's what to know about a federal government shutdown",
      "Here’s What Happens When the US Government Shuts Down"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.691,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During President Donald Trump's first term, the U.S. government experienced a shutdown due to disagreements over funding for a proposed U.S.-Mexico border wall. Government shutdowns have occurred frequently enough in recent years that all federal agencies now have specific guidelines for operating during such shutdowns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Lawmakers Release More Jeffrey Epstein Documents",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 03:39:38 GMT",
    "source": "BBC",
    "sources": [
      "Global News",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "globalnews.ca"
    ],
    "snippets": [
      "More documents related to the late convicted paedophile Jeffrey Epstein have been released by lawmakers in the US.",
      "In an X post referencing a news story about the documents' release, Elon Musk wrote: \"This is false.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e42/live/89472f60-9b53-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Elon Musk and Prince Andrew named in new Epstein files",
      "Elon Musk, Peter Thiel named in newly released Epstein estate documents"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.695,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "More documents related to the late convicted paedophile Jeffrey Epstein have been released by lawmakers in the US.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]