[
  {
    "title": "Canada to Recognize Palestinian State, Sets Conditions",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 23:10:15 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Financial Post",
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Mark Carney says the move depends on Palestinian democratic reforms and elections without Hamas.",
      "Prime Minister Sir Keir Starmer has announced that the UK will recognise a Palestinian state in September unless Israel meets certain conditions.",
      "The Canadian PM says Hamas cannot play a role in the future of Palestine or take part in possible 2026 elections.",
      "Canadian PM Mark Carney has justified the move saying that it was necessary to preserve hopes of a two-state solution to the Israel-Palestinian conflict. DW has more.",
      "<p>Follow today’s news live</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https",
      "In the past week alone, three new countries have said they are ready to bestow recognition on a Palestinian state.",
      "Canada joins France and Britain in taking similar steps, after months of increasing criticism of Israel by Prime Minister Mark Carney.",
      "Plus, the Booker Prize nominees",
      "The announcements reflect deep frustrations with Israel’s conduct in Gaza and in the occupied West Bank, experts say.",
      "Prime Minister Mark Carney said Canada plans to recognize a Palestinian state at the United Nations summit in September, following France while setting up a clash with the US and Israel."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0724/live/45b4ab90-6d8d-11f0-89ea-4d6f9851f623.jpg",
    "titles": [
      "Canada follows France and UK with plan to recognise Palestinian state",
      "What does recognising a Palestinian state mean?",
      "Canada will recognise Palestinian state at UN General Assembly: Carney",
      "Middle East: Canada set to recognize Palestinian state",
      "Politics live: Canada to recognise Palestinian state but Chalmers declines to say when Australia will follow suit",
      "What Countries Recognize a Palestinian State: A Map",
      "Canada to Recognize Palestinian State at the U.N. General Assembly",
      "Wednesday Briefing: U.K. May Recognize a Palestinian State",
      "What Would Recognizing a Palestinian State Mean?",
      "Canada Plans to Recognize Palestinian State, Joining France, UK"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.866,
    "summary": "Prime Minister Mark Carney of Canada announced plans to recognize a Palestinian state at the United Nations summit in September, contingent on Palestinian democratic reforms and excluding Hamas from future elections. This move aligns Canada with France and the UK, which have also expressed intentions to recognize Palestine if Israel does not meet certain conditions. The decision aims to preserve the possibility of a two-state solution to the Israel-Palestinian conflict, amidst widespread criticism of Israel's actions in Gaza and the West Bank. This stance sets up potential disagreements with t",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides comprehensive information about a significant international policy decision. It outlines the conditions set by Canada, the potential implications for the Israel-Palestinian conflict, and the broader international context. It helps readers understand the complexities of the situation and the potential progress towards a solution.",
    "image": {
      "src": "https://live.staticflickr.com/520/30765139183_62bb4e4667_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dccf4c8d-0b91-43f7-8362-3fc6207ad07d/thumb/",
      "alt": "canada",
      "credit": "PokemonaDeChroma / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Federal Reserve Keeps Rates Steady Amid Dissent and Tariff Concerns",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 19:57:12 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "MarketWatch",
      "Axios",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "But support for a cut may be widening, as debates rage about how tariffs will affect the US economy.",
      "The decision also drew dissent from two of the central bank&#039;s governors, both Trump appointees.",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9mOHNLcVpIWk1YWkpUMUZNUFFXUmlNZTlwdXBibkxoVXpqUVlHQk90UXQ3NE1OdWlhLWkzRURHZzNQX25zNWVkZmVPajJHWGZUOGNneTJGcU5Denh1QWd1NE9JSWNFZEdfOHc?oc=5\" target=\"_blank\">Fed leaves interest rates unchanged amid Trump pressure, dissents</a>&nbsp;&nbsp;<fo",
      "For the first time since 1993, two of the seven members of the Fed’s board of governors dissented."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f2a0/live/798b2e40-6d6e-11f0-b797-07a6cc417af0.jpg",
    "titles": [
      "Fed holds interest rates steady despite Trump pressure",
      "US Federal Reserve leaves rates unchanged despite Trump pressures",
      "Fed leaves interest rates unchanged amid Trump pressure, dissents - Axios",
      "Federal Reserve leaves interest rates unchanged despite pressure from Trump"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.915,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.846,
    "summary": "The Federal Reserve decided to leave interest rates unchanged, a decision that saw dissent from two of its governors, both appointed by President Trump. This marks the first time since 1993 that two out of the seven board members have dissented. The debate continues over how tariffs might impact the U.S. economy, with some support growing for a rate cut.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is constructive as it provides useful information about the Federal Reserve's decision and the internal dissent. It also highlights the ongoing debate about the impact of tariffs on the U.S. economy, increasing awareness about the complexities of economic policy.",
    "image": {
      "src": "https://live.staticflickr.com/4295/35793151731_712406b385_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cd6aaf04-1beb-4d33-8ab5-029fa96d28e3/thumb/",
      "alt": "President Trump's trip to France",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK Air Traffic Glitch Leads to 150+ Flight Cancellations, Delays",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 22:00:59 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The technical issue only lasted 20 minutes but caused a huge backlog of flights and delays.",
      "Air traffic control authority says departures at all airports have resumed after glitch affected flights across UK.",
      "‘Technical issue’ at Nats results in more than 150 flights being cancelled across multiple British airports",
      "<p>System restored after Nats limited flights due to technical problems that raised fears of repeat of chaos in August 2023</p><p>The head of the UK’s air traffic control company is facing calls to resign after the second disruption to flights in two years due to technical problems.</p><p>Hundreds o",
      "<p>If your flight is significantly delayed you should at least be entitled to care and assistance while you wait</p><p>Wednesday’s <a href=\"https://www.theguardian.com/world/live/2025/jul/30/uk-flight-delays-disruption-heathrow-gatwick-live-updates\">air traffic control technical fault</a> came as ma"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a85d/live/2e9dbca0-6d86-11f0-98fc-31c75321b3a0.jpg",
    "titles": [
      "Flight disruption after major UK air traffic outage",
      "UK flights disrupted after air traffic control ‘technical issue’",
      "UK air traffic control criticised after outage disrupts summer getaway",
      "Calls for UK air traffic control boss to resign as new glitch disrupts flights",
      "UK air traffic control disruption: your rights as a passenger"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.955,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary": "A technical issue at Nats, the UK's air traffic control, caused a 20-minute system malfunction leading to over 150 flights being canceled and significant delays across British airports. The problem was resolved, and flight departures resumed, but it resulted in a massive backlog and public frustration. This incident marks the second major disruption in two years, prompting calls for the resignation of the head of Nats. Affected passengers are entitled to care and assistance during their wait.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant disruption to air travel, but it lacks depth in terms of understanding the underlying issues that led to the glitch. It does, however, inform readers about their rights and entitlements in such situations, which is useful.",
    "image": {
      "src": "https://live.staticflickr.com/1405/4723359891_f9c2c7c1d7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0d7f1aa2-de2d-4793-b19b-0564033db36d/thumb/",
      "alt": "random bits: this very nearly renewed my faith in british airways after a flight cancellation",
      "credit": "koadmunkee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "High Noon Recalls Vodka Seltzer for Mislabeling as Celsius Energy Drinks",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 22:56:57 GMT",
    "source": "BBC",
    "sources": [
      "Business Insider",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The warnings impact certain varieties of High Noon vodka seltzers and Celsius energy drink cans.",
      "High Noon has issued a nationwide recall of one of its popular vodka seltzer products.",
      "Some cans of High Noon vodka seltzer were mislabeled as Celsius energy drinks, according to an FDA recall notice."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9be5/live/e06ecee0-6d8d-11f0-8dbd-f3d32ebd3327.jpg",
    "titles": [
      "Warning issued after US energy drink cans accidentally filled with vodka",
      "High Noon recalls some 12-packs, saying they may contain Celsius energy drink cans filled with vodka seltzer",
      "High Noon is recalling vodka seltzers that were mislabeled as Celsius energy drinks"
    ],
    "score_components": {
      "magnitude": 0.81,
      "recency": 0.974,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.833,
    "summary": "High Noon has initiated a nationwide recall of a vodka seltzer product due to mislabeling; some cans were mistakenly labeled as Celsius energy drinks, as stated in an FDA recall notice. This action impacts specific varieties of both High Noon vodka seltzers and Celsius energy drinks.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides actionable insights for consumers who may have purchased the mislabeled products. It reports on the solution being implemented by the company - a product recall. However, it doesn't delve into the causes or impacts of the mislabeling issue.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Mislabeled_Haworthia_coarctata%285595081315%29.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0dc2f0ef-7a18-4d01-8a95-7a7e6fa63d7c/thumb/",
      "alt": "Mislabeled Haworthia coarctata(5595081315)",
      "credit": "stephen boisvert from Chicago, United States / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Mets Acquire MLB Saves Leader Helsley from Cardinals Ahead of 2025 Deadline",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 23:32:53 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "This marks the third reliever the Mets have added at the trade deadline",
      "In a major move to help the bullpen, the Mets are getting Ryan Helsley in a trade with the Cardinals before the 2025 trade deadline.",
      "MLB's saves leader last season, Ryan Helsley, is the latest big-name player to switch teams before the deadline, going from St. Louis to New York.",
      "The trade closer on the market is no longer available.",
      "The St. Louis Cardinals are closing in on a trade sending Ryan Helsley to the New York Mets ahead of the trade deadline.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSnVEZzVkeVF2WF9LbklTQkdlcVdRYnhyXzFjVDVmbzZWTnRnTzhhVTFrTEV6VjgwX0RLajB0VkItdnlFTEV6MWRnWUludU9sM0FQUjdkby04dUxOMlZSV1pPT1NBTmJqRERhTVV2U2Z6TXNvVjZ2emI5OTFPZzFpNGdmUUFNU1hp?oc=5\" target=\"_blank\">Mets Trade for Cardinals' Ryan Helsley to C",
      "<p>One of MLB’s premier closers has a new home. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/27/d99c133a-8bac-4c5b-9114-e8e5c1f71141/helsley-imagn.png",
    "titles": [
      "Mets trade for Ryan Helsley: New York bulking up bullpen with Cardinals closer, per report",
      "Mets make big splash, acquire Ryan Helsley in trade with Cardinals, per reports",
      "Mets acquire closer Ryan Helsley from Cardinals: Trade details",
      "St. Louis Cardinals get Jesus Baez in trade for closer Ryan Helsley",
      "Cardinals to trade Ryan Helsley to Mets ahead of trade deadline",
      "Mets Trade for Cardinals' Ryan Helsley to Continue Bullpen Upgrade - Sports Illustrated",
      "Report: Mets finalizing trade to acquire Ryan Helsley from Cardinals"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.986,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary": "The New York Mets have acquired Ryan Helsley, last season's MLB saves leader, from the St. Louis Cardinals ahead of the 2025 trade deadline. This move marks the third reliever addition for the Mets, significantly bolstering their bullpen. Helsley's transfer is a major acquisition, indicating the Mets' intent to strengthen their pitching staff for the season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for baseball fans, particularly those who follow the New York Mets, by reporting on a significant player acquisition. However, it does not provide deep insights into the broader context of the trade or its potential impact on the team's performance.",
    "image": {
      "src": "https://live.staticflickr.com/7084/7150603369_ce7930655b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/31217638-f9e5-4b29-8e51-89973802de95/thumb/",
      "alt": "Harry Caray (1914-1998) -- Bleachers Entrance Wrigley Field Chicago (IL) 2012",
      "credit": "Ron Cogswell / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Reds Acquire Ke'Bryan Hayes from Pirates in Trade for Rogers, Stafura",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 19:57:02 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Reds have acquired third baseman Ke'Bryan Hayes from the Pirates in exchange for reliever Taylor Rogers and prospect Sammy Stafura.",
      "Hayes is under team control through 2029",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE4tUjVudS1yNXpHc3prRWFGRGVyaHROVmN5MFBXZlhLcXlvaGxBbVhXTGpnUWI0Q1lzSXc2eEtydEVGcmRUVTJacWYxa3VrQ1BCT253ZTZVZWUtTFNrbzhnVTFfbUdMRXlMakE?oc=5\" target=\"_blank\">Pirates Offload Ke'Bryan Hayes to Rival Reds in Trade Deadline Swap</a>&nbsp;&nbsp;<",
      "<p>The Ke&#8217;Bryan Hayes era is reportedly coming to an end in Pittsburgh.</p>"
    ],
    "image_url": "",
    "titles": [
      "Reds acquire Gold Glove 3B Hayes from Pirates",
      "Reds acquire Ke'Bryan Hayes, star defensive third baseman, from Pirates in MLB trade deadline move",
      "Pirates Offload Ke'Bryan Hayes to Rival Reds in Trade Deadline Swap - Sports Illustrated",
      "Reds acquire 3B Ke’Bryan Hayes from Pirates"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.994,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.818,
    "summary": "The Reds have traded for third baseman Ke'Bryan Hayes from the Pirates, giving up reliever Taylor Rogers and prospect Sammy Stafura in return. Hayes, who is under team control through 2029, marks the end of his era with the Pirates through this significant trade deal.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is similar to the previous one. It reports a significant trade in baseball, but doesn't offer much beyond the basic information. It doesn't provide actionable insights, solutions, or a deeper understanding of the systems or trends involved.",
    "image": {
      "src": "https://live.staticflickr.com/7201/6923356881_45be244fc5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3c6e13c4-69c8-4fc3-9fef-fdae204fb96c/thumb/",
      "alt": "Athletes compete at Wounded Warrior Trials [Image 6 of 8]",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Phillies Acquire Closer Jhoan Duran from Twins Ahead of 2025 MLB Deadline",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 19:52:48 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Phillies have agreed to a deal to acquire star closer Jhoan Duran from the Twins, sources told ESPN on Wednesday. Philly is sending right-hander Mick Abel and catcher Eduardo Tait, both prospects, to Minnesota in return.",
      "Duran is heading to Philly in the biggest move of the 2025 MLB trade deadline (so far)",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNamFLQXFHQUNZb1Iwb2FUOTVxMHFVQ3VOTFFSNXFGTUpKVWp3RUtpTERXUC05bEhBb2NacUJMXzJWOGZ5UWJoTk1JQnFnakFYYXZJa0czQVc5dFFFd2dacUxLbXZQNVcxUHdXQWNkckVjMTNUaHR5REJoNXB0TWRvM01GYXBYcG41?oc=5\" target=\"_blank\">Phillies Land Jhoan Duran From Twins in Maj",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNdjdaNW1CbzY4ZGxzLXUwdmxnT3kyd3J3UlluUmVZSzJtelFtV19QNFd3QkJkdkVuckRxNHI1QnJiT3J4czVjVk0wRGlpa1ozNE9UUW5zOU5vNXpnaHFKMTdpZDZUVTFMODhzU0hhZE4wSE9wNVZ4VTVUYmxKZHdQMTZPOWgxZzN4dHh4Qw?oc=5\" target=\"_blank\">Jhoan Duran Trade Grades: How Phillie",
      "<p>Some heat is reportedly headed to Philadelphia.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies reach deal for Twins' Duran, sources say",
      "Jhoan Duran trade grades: Phillies get 'A' in deal for flame-throwing closer, Twins betting on young catcher",
      "Phillies Land Jhoan Duran From Twins in Major Trade Deadline Deal - Sports Illustrated",
      "Jhoan Duran Trade Grades: How Phillies, Twins Fared in Deal for Star Closer - Sports Illustrated",
      "Report: Phillies finalizing deal for Twins closer Jhoan Duran"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.993,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.817,
    "summary": "The Philadelphia Phillies have acquired star closer Jhoan Duran from the Minnesota Twins, in exchange for right-hander Mick Abel and catcher Eduardo Tait, both prospects. This trade, occurring just before the 2025 MLB trade deadline, marks a significant move for the Phillies, aiming to bolster their bullpen with Duran's addition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story informs about a significant trade in the world of baseball, it doesn't provide much depth or insight beyond the basic information. It doesn't provide actionable insights for the reader or report on improvements or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/3518/3990256646_10b7496bdb.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c4c02340-9b10-46cf-9039-795511d97c63/thumb/",
      "alt": "Enormous solar prominence captured by STEREO Spacecraft",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Announces Trade Deal with South Korea, Imposes 15% Tariff",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:34:32 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE5OaEVLdkpyUVUtdU91S0o1M1pwRXBJeXh5VG1yUmF3RnREcjNxbnpvVXJ5dGJKUkg1bmlkTjJOWjQ2eUN4RzFmMThKczF6TFNjM2R4eEo3Qk9pMUE2Ry1Zc1JtYWhQcEZGLVE?oc=5\" target=\"_blank\">Trump says U.S. strikes trade deal with South Korea</a>&nbsp;&nbsp;<font color=\"#6f6",
      "<p>President Lee Jae Myung says deal puts South Korea on an equal or better footing than other countries</p><p>President Donald Trump has said the US will charge a 15% tariff on imports from South Korea as part of an agreement with the Asian trading partner that avoids even higher levies.</p><p>“I a",
      "President Donald Trump said he reached a trade deal with South Korea that would impose a 15% tariff on its exports to the US and see Seoul agree to $350 billion in US investments."
    ],
    "image_url": "",
    "titles": [
      "Trump says U.S. strikes trade deal with South Korea - Axios",
      "US to impose 15% tariffs on South Korea as part of trade deal, Donald Trump says",
      "Trump Says US to Impose 15% Tariff on South Korean Goods"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.966,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.796,
    "summary": "President Donald Trump announced a trade agreement with South Korea, introducing a 15% tariff on South Korean exports to the United States. This deal also includes commitments from South Korea for $350 billion in investments in the U.S. President Lee Jae Myung stated that this arrangement places South Korea in an equal or superior position compared to other nations.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant trade agreement between two countries. It offers insight into the terms of the deal and the potential impact on the economy. However, it does not provide enough context or analysis to fully understand the implications or potential solutions to any issues that may arise.",
    "image": {
      "src": "https://live.staticflickr.com/293/32492095362_1677c1b640_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ad5861da-39e9-4d9d-b072-d8864edd991c/thumb/",
      "alt": "Commercial Real Estate Trends To Watch In 2017",
      "credit": "elizabethjoseph / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "NASA-ISRO NISAR Satellite Launched to Map Earth in 3D",
    "domain": "science",
    "location": "global",
    "published": "2025-07-30T19:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Phys.org",
      "NASA",
      "Deutsche Welle"
    ],
    "domains": [
      "general",
      "science"
    ],
    "snippets": [
      "The \"first of its kind\" satellite will map the Earth's surface in incredible detail. Mission officials say it will help us better understand areas at risk of earthquakes.",
      "Carrying an advanced radar system that will produce a dynamic, three-dimensional view of Earth in unprecedented detail, the NISAR (NASA-ISRO Synthetic Aperture Radar) satellite has launched from Satish Dhawan Space Center in Sriharikota, Andhra Pradesh, India.",
      "Editor&#8217;s Note: This release was edited on July 30, 2025, to correct the mission launch time in the IST time zone. Carrying an advanced radar system that will produce a dynamic, three-dimensional view of Earth in unprecedented detail, the NISAR (NASA-ISRO Synthetic Aperture Radar) satellite has"
    ],
    "image_url": "",
    "titles": [
      "US, India launch 'first-of-its-kind' satellite to track Earth's surface",
      "NASA-ISRO satellite lifts off to track Earth's changing surfaces",
      "NASA-ISRO Satellite Lifts Off to Track Earth’s Changing Surfaces"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.897,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "The NISAR satellite, a collaboration between NASA and ISRO, was launched from Satish Dhawan Space Center in India. It is equipped with an advanced radar system to map the Earth's surface in unparalleled three-dimensional detail. This \"first of its kind\" satellite aims to improve our understanding of areas prone to earthquakes. The mission's significance lies in its potential to offer dynamic, detailed insights into the Earth's geological features.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a technological innovation that can contribute to our understanding of Earth's geological features, particularly areas prone to earthquakes. It provides actionable insights and increases awareness about the potential applications of satellite technology.",
    "image": {
      "src": "https://live.staticflickr.com/7396/9476093705_c8b1243b54_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3c5a0c54-9781-4a2e-b649-1dcc5fa638d7/thumb/",
      "alt": "NASA UFO",
      "credit": "tonynetone / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Criticizes India's Trade, Imposes 25% Tariff on Goods",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 10:55:33 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "President Trump said he would pose an additional penalty on India for its trade relations with Russia, which Trump is trying to pressure over its war with Ukraine.",
      "This deal would mean the duties will be lowered from the 25% that Trump had threatened in his \"tariff letter\" to Seoul earlier this month.",
      "The 25% tariff rate is modestly lower than what he imposed on India on \"Liberation Day,\" when he announced a 26% rate on the key trading partner.",
      "The president said the trade deal would include hundreds of billions of dollars in US investment"
    ],
    "image_url": "",
    "titles": [
      "Trump dashes hopes of a trade deal with India by Aug. 1, announcing 25% tariffs",
      "Trump announces trade deal with South Korea, setting tariffs at 15%",
      "Trump announces 25% tariff on India plus 'penalty' for trade with Russia",
      "Trump announces 15% tariff on South Korean goods"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.824,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.783,
    "summary": "US President Donald Trump criticized India for its trade policies and purchasing weapons from Russia, labeling India as a friend but expressing concerns over its economic actions. In response, Trump announced the US would impose a 25% tariff on Indian goods, slightly lower than the previously stated 26% on \"Liberation Day.\" This move highlights tensions between the US and India regarding trade imbalances and India's energy and arms dealings with Russia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing trade tensions between the U.S. and India. However, it lacks depth in terms of exploring the potential impacts of these tariffs, and it doesn't report on any attempts to solve these trade issues.",
    "image": {
      "src": "https://live.staticflickr.com/1004/4729221809_0976378ff3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e5193e5e-dc4e-4a16-8880-5d1b0ca24abc/thumb/",
      "alt": "The Growth of Fair Trade",
      "credit": "GDS Infographics / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "U.S. Freezes Judge Moraes' Assets, Trump Imposes 50% Tariff on Brazil Imports",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 18:54:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "US freezes Judge Moraes&#039;s assets, citing role in arbitrary detentions, censorship, and Bolsonaro-related prosecutions.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE9hQ0F0ZXdWT3VZNnlXZV9ZVFQxSlQtem1yTVJyM3dQSlJqcWFfSkg5R1huYW1qZjlWSXBxUDltdWJ4LVpxanBLMHByYi1ZQ1QwcjZKZEtoNWpoYVY3SWlMU1dfR3dBc0VySmNXbEd4aWVuVWs?oc=5\" target=\"_blank\">U.S. sanctions Brazilian judge overseeing Bolsonaro case, alleging \"righ",
      "Shortly after those sanctions were announced, Trump imposed a 50% tariff on imports from Brazil, with a statement from the White House referencing the judge."
    ],
    "image_url": "",
    "titles": [
      "US sanctions Brazil’s Supreme Court judge overseeing case against Bolsonaro",
      "U.S. sanctions Brazilian judge overseeing Bolsonaro case, alleging \"rights abuse\" - Axios",
      "U.S. sanctions Brazilian judge targeted by Trump over Bolsonaro case"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.895,
      "consensus": 0.897,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary": "The U.S. government has frozen the assets of Brazilian Judge Moraes, citing his involvement in arbitrary detentions, censorship, and prosecutions related to Bolsonaro. Following these sanctions, former President Trump announced a 50% tariff on imports from Brazil, a move linked by a White House statement to the actions against Judge Moraes.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the U.S. government's actions against a Brazilian judge and the subsequent tariff on Brazilian imports. It provides context about the political and economic implications of these actions, contributing to the reader's understanding of international relations.",
    "image": {
      "src": "https://live.staticflickr.com/5764/22506306843_442653d1bd_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1a7602d6-6e67-4e8f-8404-cf5ef86bd087/thumb/",
      "alt": "Asset forfeiture Dresses-1",
      "credit": "U.S. Marshals Service / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Olympic Biathlon Champion Laura Dahlmeier Dies in Mountaineering Accident",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 13:56:08 GMT",
    "source": "BBC",
    "sources": [
      "Sports Illustrated",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Two-time Olympic champion Laura Dahlmeier dies aged 31 after a mountaineering accident in Pakistan.",
      "Rescuers had hoped to find double Olympic gold medallist on 6,096m (20,000-foot) Laila Peak in the Karakoram Mountains.",
      "German Olympic star Laura Dahlmeier has been confirmed dead following a mountaineering accident in Pakistan. Adverse weather conditions had hampered attempts to rescue the former Olympic champion.",
      "<ul><li><p>Former biathlete struck by rockfall at altitude of 5,700m</p></li><li><p>Tributes paid to athlete ‘with heart, attitude and vision’</p></li></ul><p>The German double Olympic biathlon champion Laura Dahlmeier has died after a mountaineering accident in Pakistan, her management confirmed on",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNWmxJdHNKREdLekdOQmpVNm14NmgwVU5VZDJWV0tPa1lkMzdZOFhwMmlBelp0RFVoUlZpUEpPSGdocWpkWk5LN05pUDVlQnNGMmhtNUpKbUNibVJ3Q2k0d3hZWHd3MDFDVzI1dWk5S3ZzRzhlRi1JZDR6cFJWRXY4bDl2dWpZcVVQNDVobkpyOUNudTY5V0wyUUdySmk?oc=5\" target=\"_blank\">Former Olympic G"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2089/live/7d712990-6d43-11f0-9462-bb509dc78127.jpg",
    "titles": [
      "Olympic star Dahlmeier, 31, dead after climbing accident",
      "Laura Dahlmeier: German biathlete dies in a climbing accident in Pakistan",
      "German Olympic star Dahlmeier confirmed dead in Pakistan",
      "German Olympic champion Laura Dahlmeier dies after mountaineering accident in Pakistan",
      "Former Olympic Gold Medalist Laura Dahlmeier Dies in Climbing Accident - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.807,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary": "Laura Dahlmeier, a German two-time Olympic biathlon champion, has died at the age of 31 following a mountaineering accident in Pakistan. The accident, which involved a rockfall at an altitude of 5,700 meters, led to her death despite efforts for rescue, hindered by adverse weather conditions. Tributes have been paid to Dahlmeier, highlighting her heart, attitude, and vision.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the tragic accident, it does not offer any actionable insights or deeper understanding to the reader. It does not report on any solutions or improvements, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/7243/7370183804_89215baac7.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bb3f9c7f-0ca8-4b3a-9ce9-4ef3911218d5/thumb/",
      "alt": "“Angela Merkel thinks we're at work” flag makes the front page of German tabloid newspaper Bild, #DontTellMerkel",
      "credit": "dullhunk / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Fans and Family Bid Farewell to Ozzy Osbourne in Birmingham",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 17:01:43 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Fans and relatives of the late Ozzy Osbourne converged to pay their final respects to metal star in his home city.",
      "Thousands of fans lined the streets of Birmingham to say farewell to Ozzy Osbourne. The \"Prince of Darkness\" died just weeks after his final gig.",
      "<p>Sharon Osbourne and couple’s children join mourners as singer’s hearse is driven through birthplace of heavy metal</p><p>Thousands of fans lined the streets of Birmingham to watch Ozzy Osbourne make his final journey through his home city, with his tearful family laying tributes as crowds chanted"
    ],
    "image_url": "",
    "titles": [
      "England's Birmingham bids farewell to Ozzy Osbourne, its homegrown heavy metal hero",
      "Ozzy Osbourne fans in Birmingham honor heavy metal star",
      "Fans line streets of Birmingham to say farewell to Ozzy Osbourne"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.935,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary": "Thousands of fans and family members, including Sharon Osbourne and their children, gathered in Birmingham to pay their final respects to Ozzy Osbourne, the \"Prince of Darkness,\" who passed away weeks after his last performance. The mourners lined the streets to watch his hearse pass through the city, marking the final journey of the metal star in his birthplace.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the passing of a famous musician, it does not offer any deeper insights or actionable information. It does not contribute to the reader's understanding, decision-making, or sense of agency.",
    "image": {
      "src": "https://live.staticflickr.com/7694/17027950878_03341ac224_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c1a8fe6e-ace0-4acd-8dd5-39cda8ac358c/thumb/",
      "alt": "Craven Cottage - Apr 2015 - The Cottage with Bees Fans",
      "credit": "Gareth1953 All Right Now / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "8.8-Magnitude Earthquake in Russia Triggers Pacific Tsunami Warnings",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 11:29:17 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A powerful 8.8-magnitude earthquake in Russia's Far East is sending tsunami waves to Hawaii, Alaska, California and Oregon. More countries, like Peru and Chile, are bracing for impact.",
      "A massive earthquake has triggered tsunami warnings across the Pacific.",
      "ABC News foreign correspondent Britt Clennett says Japan is being extra cautious due to the country's history with earthquakes and tsunamis — referencing the 2011 Fukushima disaster."
    ],
    "image_url": "",
    "titles": [
      "A tsunami makes its way across the Pacific, with waves hitting the U.S. West Coast",
      "Tsunami Warnings Across the Pacific",
      "WATCH:  Tsunami warnings in Japan downgraded after 2 million evacuated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.833,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary": "An 8.8-magnitude earthquake in Russia's Far East has triggered tsunami warnings across the Pacific, affecting Hawaii, Alaska, California, Oregon, Peru, and Chile. Countries, including Japan, are on high alert due to past experiences with similar natural disasters, like the 2011 Fukushima disaster.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a natural disaster and its potential impacts across the Pacific. However, it lacks actionable insights for the reader, solutions, or a deeper understanding of the causes or systems involved.",
    "image": {
      "src": "https://live.staticflickr.com/8703/17557928942_b5195e10b8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e778bf4f-ea76-4f92-a67f-548a8d37d1ea/thumb/",
      "alt": "7.3 magnitude earthquake in Nepal [Image 3 of 3]",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sportsnet Launches Trade Tracker for Major League Roster Updates",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 23:17:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The 2025 trade deadline will pass at 6 p.m. ET on Thursday, July 31",
      "<p>With contending teams ready to bolster their rosters for the post-season push, you can stay up to date with every trade made before the deadline in Sportsnet&#8217;s trade tracker below.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/7023caa9-950c-426e-9649-c21069bbac5a/duran-getty-2.png",
    "titles": [
      "MLB trade tracker: Follow every move at 2025 deadline as Yankees, Mets and other contenders make upgrades",
      "2025 MLB Trade Deadline Tracker: Every move made"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.98,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary": "Sportsnet's trade tracker offers updates on all major league trades before the deadline, focusing not only on current stars but also on potential future talents moving between teams. This tool is designed to keep fans informed about roster changes as contending teams strengthen their lineups for the post-season.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it introduces a new tool for fans to stay informed about roster changes in Major League Baseball. It empowers the reader with actionable insights and a deeper understanding of the dynamics of player trades. It also highlights an innovation in the way sports news is reported."
  },
  {
    "title": "Palo Alto Networks Buys CyberArk for $25B in Major Cybersecurity Deal",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 20:04:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Palo Alto Networks will takeover Israeli cybersecurity provider CyberArk in a deal valued at $25 billion.",
      "The cybersecurity giant is getting into identity security with its acquisition of CyberArk, which is one of the biggest cybersecurity deals of the year so far."
    ],
    "image_url": "",
    "titles": [
      "Palo Alto Networks stock falls after announcing $25 billion CyberArk deal",
      "Palo Alto Networks agrees to buy CyberArk for $25 billion"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.917,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary": "Palo Alto Networks is acquiring Israeli cybersecurity firm CyberArk for $25 billion, marking a significant move into identity security. This deal is considered one of the largest cybersecurity acquisitions of the year.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a significant development in the cybersecurity industry. It informs readers about a major acquisition and its implications, contributing to a deeper understanding of the industry trends and dynamics.",
    "image": {
      "src": "https://live.staticflickr.com/2391/2440292668_780aaa5275_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/11ad2c84-3f5e-47a0-86dc-96b8b2d2d4ec/thumb/",
      "alt": "Israeli women soldiers",
      "credit": "jdlasica / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Correa Says Trade Talks to Return to Houston Not \"Serious\"",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 19:52:48 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Carlos Correa said discussions about a trade from Minnesota back to Houston before Thursday's deadline aren't \"serious,\" but he didn't rule out the possibility of returning to the city where he won a World Series.",
      "<p>Carlos Correa said discussions about a trade from Minnesota back to Houston before Thursday&#8217;s deadline aren&#8217;t “serious,&#8221; but he didn&#8217;t rule out the possibility of returning to the city where he won a World Series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Correa says talk of trade to Astros isn't 'serious'",
      "Twins Correa says talk of return to Houston isn’t ‘serious’"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.702,
    "summary": "Carlos Correa, currently with Minnesota, stated that trade discussions about his return to Houston before Thursday's deadline are not \"serious.\" However, he has not dismissed the possibility of going back to the city where he previously won a World Series.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information for fans of Carlos Correa and the Houston Astros, but it lacks depth and does not provide insights into the potential implications of the trade. It does not report on solutions or improvements, but it does inform readers about the current status of trade discussions.",
    "image": {
      "src": "https://live.staticflickr.com/7027/6813938445_32b35f9d1e.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c415307e-e4c6-432b-b432-beee22403e6f/thumb/",
      "alt": "Light and Shadow Series: Return of the Shadow",
      "credit": "garlandcannon / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Senators Debate Bill to Ban Lawmaker Stock Trading for Future Administrations",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 18:18:59 -0400",
    "source": "Forbes",
    "sources": [
      "Business Insider",
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The bill would only apply to future administrations, not Trump’s.",
      "Senators fiercely debate a bill to ban lawmakers from trading stocks, with one senator calling it \"legislative demagoguery.\""
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/688a5b292101fba642401936/0x0.jpg",
    "titles": [
      "Trump Blasts Hawley As ‘Second-Tier Senator’ After He Votes To Ban Presidents From Stock Trading",
      "Trump rails against GOP senator over stock trading ban bill"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.961,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary": "Senators are engaged in a heated debate over a proposed bill that aims to prohibit lawmakers from trading stocks. The legislation, which has been criticized by some as \"legislative demagoguery,\" would only be applicable to future administrations and would not affect Donald Trump's administration.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about a significant ongoing debate in the Senate regarding a proposed bill. It provides useful context about the potential implications of the bill. However, it doesn't highlight any specific progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/3392/3205850895_d127f8bcc5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/11aefc75-4368-43e2-9b84-709fbfe7ecee/thumb/",
      "alt": "DC Voting Rights",
      "credit": "dbking / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "ESPN, Shannon Sharpe Part Ways After Lawsuit Settlement",
    "domain": "business",
    "location": "global",
    "published": "2025-07-30T20:56:53Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "Sports Illustrated"
    ],
    "domains": [
      "sports",
      "business"
    ],
    "snippets": [
      "ESPN and Shannon Sharpe will go their separate ways after the NFL Hall of Famer settled a lawsuit accusing him of rape.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5ab0NxemZKb2tXVnYzakxpQ2tRaDNwSVZNZmRnZzBlMmpjcXBpRjNoaTREQkt6cnp4U1EyRWJsWXUyVkE5M3hrVkRiWWdURy13Y1BYdHRMZWpCM0VpY2NicHVHNk11WUF2Z0VPUkJraEI3OHRUeDZ6UWVRRQ?oc=5\" target=\"_blank\">ESPN Moves on From Shannon Sharpe Following Civil Settlement "
    ],
    "image_url": "https://i.insider.com/688a72f9f748d8c055f693f8?format=jpeg",
    "titles": [
      "ESPN is cutting ties with Shannon Sharpe after his settlement of a rape lawsuit",
      "ESPN Moves on From Shannon Sharpe Following Civil Settlement of Rape Lawsuit - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.71,
      "recency": 0.934,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary": "ESPN and Shannon Sharpe are parting ways after the former NFL Hall of Famer settled a lawsuit alleging rape. The decision comes as a result of the settlement, marking the end of their professional relationship.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the termination of a professional relationship between ESPN and Shannon Sharpe due to a lawsuit settlement. However, it doesn't provide deeper insights or actionable information for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/6111/6328704457_63eee1e997_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2da353f6-f443-42ad-80b4-1f6d04147563/thumb/",
      "alt": "ESPN Howitzer practice",
      "credit": "The U.S. Army / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Twins Trade Jhoan Duran for Catcher Tait, Pitcher Abel in Major Deal",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:47:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Duran is one of the top candidates on the market this deadline",
      "Catcher Eduardo Tait and right-hander Mick Abel were shipped off to Minnesota in the deal. Tait, 18, is batting .255 with 11 homers and 57 RBIs across two minor league stops this year, and Abel, 23, made his major league debut in May.",
      "Jhoan Duran came to the Minnesota Twins as a 20-year old prospect from the Arizona Diamondbacks as part of a package for infielder Eduardo Escobar at the 2018 trade deadline. Seven years later, Duran is again on the move at the trade deadline, as the Twins are selling off again, though this time he "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/26bea841-02aa-4a15-a5d8-7d0782ab7863/duran-getty.png",
    "titles": [
      "Phillies acquiring Jhoan Duran: NL East contenders trade for star Twins closer in deadline deal, per report",
      "Report: Phillies acquire hard-throwing reliever Jhoan Duran in trade with Twins",
      "Twins trading closer Jhoan Duran to Philadelphia Phillies"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.971,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary": "The Minnesota Twins traded Jhoan Duran, a top market candidate, in a deal involving catcher Eduardo Tait and right-hander Mick Abel going to the Twins. Tait, 18, has a .255 average with 11 home runs and 57 RBIs in the minor leagues this season, while Abel, 23, debuted in the majors in May. Duran originally joined the Twins in 2018 from the Arizona Diamondbacks and is now part of a significant trade again.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a significant trade involving the Minnesota Twins. However, it does not delve into the potential impacts of the trade on the team's performance or the broader context of the trade within the MLB. It does, however, provide some basic awareness about the players involved.",
    "image": {
      "src": "https://live.staticflickr.com/5267/5574094645_c8545405a3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f3075dc9-ef2a-475a-86db-32e54136ac29/thumb/",
      "alt": "Eaglebrook School Archives, 1990s",
      "credit": "EaglebrookSchool / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Figma IPO Priced at $33, Raises $1.2B, Begins NYSE Trading",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:04:49 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Software developer Figma is poised to debut on the New York Stock Exchange on Thursday, becoming the latest high-profile tech company to go public.",
      "Design-software company Figma Inc. priced its initial public offering at $33 a share late Wednesday, raising more than $1.2 billion."
    ],
    "image_url": "",
    "titles": [
      "Figma prices IPO at $33, above expected range",
      "Figma prices IPO at $33 a share, raising $1.2 billion"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.956,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary": "Figma, a software developer, is set to start trading on the New York Stock Exchange after pricing its initial public offering at $33 per share, raising over $1.2 billion. This move marks the company's transition to a publicly traded entity, joining the ranks of other prominent tech firms in the stock market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Figma's IPO and its transition to a publicly traded entity. It gives readers a deeper understanding of the company's financial standing. However, it doesn't provide actionable insights or report on solutions or progress.",
    "image": {
      "src": "https://live.staticflickr.com/2294/2044659688_9f923597d7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d2b95d11-930a-4c42-b44a-57cbd96dd460/thumb/",
      "alt": "Sunny day with puffy clouds as the eyes oversee new prayer flags beings raised, under a multi-colored umbrella, from a restaurant across from the Bodha Stupa, Kathmandu, Nepal",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "US Equity Futures Up After Tech Earnings, Fed Holds Rates",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Jul 2025 20:54:33 GMT",
    "source": "Bloomberg",
    "sources": [
      "Financial Post",
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOUVN4RUV2ODFDcFJ1UnFJb3BKLVA5UjdWVkFyRDNDZzVMaWZabFB0M0NtRExrd21DaC1DX2VramJJQ1ptVVlNY2xMRXlfUzRNWlgtRmk3Q09zd0ZWUzBCVWFEZG04VHlQSzdMblBDXzlnbEF2OHdEZ1R2VUEyZE1FZ3NwbjBMbFRPeGVGSWx5Q201NnZY?oc=5\" target=\"_blank\">Tech Gains Buoy Stocks Afte",
      "US equity-index futures rose on robust earnings from megacap tech companies after a volatile session on Wall Street. The Federal Reserve held interest rates, pushing up the dollar and weakening Treasuries."
    ],
    "image_url": "",
    "titles": [
      "Tech Gains Buoy Stocks After Volatile Fed Session: Markets Wrap - Bloomberg.com",
      "US Futures Rise on Tech, Dollar Gains on Fed Hold: Markets Wrap"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.933,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary": "US equity-index futures experienced a rise due to strong earnings reports from major tech companies, following a volatile session on Wall Street. This occurred after the Federal Reserve decided to maintain interest rates, which resulted in an increase in the dollar's value and a decrease in the strength of Treasuries.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides readers with useful information about the state of the US economy, specifically the equity market. It also gives insight into the impact of tech earnings and Federal Reserve decisions on the market. However, it does not offer solutions or progress towards any issues.",
    "image": {
      "src": "https://live.staticflickr.com/3144/2932154983_e5251e83fa_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8df623bc-b99f-471d-9c05-744bf480988e/thumb/",
      "alt": "New York - Lower Manhattan 'Wall Street Bull'",
      "credit": "David Paul Ohmer / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Microsoft Hits $4 Trillion Market Cap, Becomes Second Company to Do So",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:27:00 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Based on its post-market trading, Microsoft has become the world's second $4 trillion company following quarterly earnings.",
      "Microsoft shares surged so much after hours that the tech giant joined the $4 trillion market cap club."
    ],
    "image_url": "",
    "titles": [
      "Microsoft tops $4 trillion in market cap after hours, joining Nvidia in exclusive club",
      "Microsoft joins Nvidia in $4 trillion market cap club after strong earnings report"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.964,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "Microsoft has reached a $4 trillion market cap, making it the world's second company to achieve this milestone. The surge in Microsoft's shares during post-market trading following strong quarterly earnings has propelled the tech giant into this exclusive club.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is informative and provides readers with a deeper understanding of Microsoft's financial standing and its position in the global market. However, it does not provide actionable insights or report on solutions or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/5775/30463089290_af629c296e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1dc309be-6d03-4cdb-ad99-48911b907c5a/thumb/",
      "alt": "Incoming Storm",
      "credit": "Diego3336 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gilbert Arenas, 5 Others Arrested for Illegal Poker Games in LA",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:43:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Arenas is accused of renting out his mansion for an illegal gambling business",
      "<p>Former NBA star Gilbert Arenas was arrested Wednesday along with five other people, including a suspected member of an Israeli organized crime group, on suspicion of hosting illegal high-stakes poker games at a Los Angeles mansion owned by Arenas, federal prosecutors said.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/01998d3a-2b23-4178-95db-0f38f2ab88a5/gettyimages-2186395675.jpg",
    "titles": [
      "Former NBA star Gilbert Arenas arrested on federal indictment in connection to illegal gambling business",
      "Former NBA star Gilbert Arenas charged with running illegal poker games at his L.A. mansion"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.969,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "Former NBA player Gilbert Arenas and five others were arrested for allegedly hosting illegal high-stakes poker games at his Los Angeles mansion, as stated by federal prosecutors. Among those arrested is a suspected member of an Israeli organized crime group.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a criminal activity involving a former NBA player. However, it doesn't offer any deeper understanding or actionable insights for the reader, nor does it report on solutions or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/2526/4256758392_9e7fe4ac0e_m.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/aeeead3c-df71-4dac-9e79-c2ce48073b9e/thumb/",
      "alt": "Gilbert Arenas -- What a Card!",
      "credit": "Mike Licht, NotionsCapital.com / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Twin MLB Siblings Traded to New Teams Hours Apart",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 22:09:46 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNQm5JTndBSUFPM0tub0UtaUVhWVpfS2RacDMtM08yNUZCWGZYanBoY2EyUHVMUlVXNXBoUUMyUndlMGVVeUs3SlpRTHVyTlZHRTRHWDVJQUMwSFhaaTVFcXVHNjZOZV9FZjJYTkpKTFN0Y09PU0sxbmpGWHNRWXZzV3lMMkxjUEp0NHNqUVdYd1VrSkZWM0E?oc=5\" target=\"_blank\">MLB Twins Tyler, Taylor ",
      "<p>Twin siblings experience a lot together, but only one set of twins can say they have been dealt to a new MLB team hours apart.</p>"
    ],
    "image_url": "",
    "titles": [
      "MLB Twins Tyler, Taylor Rogers Both Traded on the Same Day Ahead of Deadline - Sports Illustrated",
      "Taylor and Tyler Rogers become first twins traded on same day in MLB history"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.958,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary": "Twin siblings Tyler and Taylor Jay were both traded to new MLB teams within hours of each other. Tyler was traded from the New York Yankees to the San Francisco Giants, while Taylor was traded from the Seattle Mariners to the Los Angeles Dodgers. The rare occurrence of twin siblings being traded on the same day has garnered attention in the sports world.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a unique event in the sports world, but it doesn't provide any deeper understanding or actionable insights. It doesn't report on solutions or improvements, and it doesn't increase clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/2217/3816549890_b33916a246_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0fb111fe-6477-4124-a366-3e621379f87f/thumb/",
      "alt": "Baby Tyler",
      "credit": "Nadia Phaneuf / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "You can hide an AirTag in Skechers’ new kids’ shoes",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-30T12:18:38-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "If you’re a parent with kids in school or kids who are independently exploring their neighborhood for the first time, then there’s a good chance you’ve considered stashing a tracker somewhere on their person for added peace of mind. Skechers is making that a little easier with a new line of sneakers",
      "Skechers launches kids' shoes with a built-in AirTag holder."
    ],
    "image_url": "",
    "titles": [
      "You can hide an AirTag in Skechers’ new kids’ shoes",
      "Skechers is making kids’ shoes with a hidden AirTag compartment"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.848,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.625,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary, it's hard to evaluate the full constructiveness of this story. Based on the title alone, it seems to offer basic awareness about a new product feature, but doesn't provide any depth or insight into its implications or usefulness.",
    "image": {
      "src": "https://live.staticflickr.com/3608/3392966849_f8762e4e36_m.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/57ee5922-903c-45a2-8d2c-d318fb3902d9/thumb/",
      "alt": "Jesus is waiting for you.",
      "credit": "angelofsweetbitter2009 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Aurora’s autonomous trucks are now driving at night. Its next big challenge is rain.",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 23:48:10 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The company has also opened another facility in Phoenix as it scales driverless operations."
    ],
    "image_url": "",
    "titles": [
      "Aurora’s autonomous trucks are now driving at night. Its next big challenge is rain."
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.457,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of autonomous vehicles, specifically in the operations of Aurora's trucks. It also sets up the next challenge (driving in the rain), providing readers with a sense of the ongoing innovation and problem-solving in this industry.",
    "image": {
      "src": "https://live.staticflickr.com/4909/31707975127_7836592279_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/08b73e55-e7d8-43d1-a9cf-7a2ca700411c/thumb/",
      "alt": "Jupiter's Aurora",
      "credit": "NASA Hubble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "SpaceX faces two new lawsuits alleging safety‐related retaliation",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 21:47:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The lawsuits offer a closer look at the safety environment at SpaceX."
    ],
    "image_url": "",
    "titles": [
      "SpaceX faces two new lawsuits alleging safety‐related retaliation"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.95,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.45,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the legal challenges SpaceX is facing, which can contribute to readers' understanding of the company's operations and ethical issues. However, it doesn't report on solutions or improvements, nor does it provide deep insights into the systems or causes at play.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52461500293_bb2c0e6f45_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/21e3bb7c-8b96-4c35-a93c-5debe168f670/thumb/",
      "alt": "SpaceX Falcon 9 - Oct 27 2022",
      "credit": "Kevin M. Gill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Magnet Experiments Shed Light on Gradual Climate System Collapses",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 14:35:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Some of Earth's largest climate systems may collapse not with a bang, but with a whimper. Surprisingly, experiments with magnets are helping us understand how."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/earth-magnetic-field.jpg",
    "titles": [
      "Gradual vs. sudden collapse: What magnets teach us about climate tipping points"
    ],
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "Experiments using magnets have provided insights into how some of Earth's major climate systems might gradually collapse, rather than abruptly. This research offers a new perspective on understanding the dynamics of climate change and the potential slow shifts in significant environmental systems.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it offers a deeper understanding of climate change dynamics. It highlights the progress in research and provides useful insights into potential slow shifts in significant environmental systems.",
    "image": {
      "src": "https://live.staticflickr.com/4859/46217325742_8e7e675087_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/152217d6-37ab-46c0-93eb-32827af6fbb0/thumb/",
      "alt": "NASA Sounding Rockets Carry TRICE-2 over Norwegian Sea",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Gulf of Maine Seawater Acidity Stable, Benefiting Shellfish Fisheries",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 16:09:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The Gulf of Maine—home to commercial fisheries for oysters, clams and mussels—has unexpectedly avoided an increase in seawater acidity, helping to preserve the health of its fisheries."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/tracking-gulf-of-maine.jpg",
    "titles": [
      "Gulf of Maine sees rising pH, defying expectations of increasing ocean acidity"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443,
    "summary": "The Gulf of Maine, a vital area for oyster, clam, and mussel fisheries, has not experienced a rise in seawater acidity as anticipated. This unexpected development has been beneficial in maintaining the health of the fisheries in the region.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a positive development in the environment, specifically in the context of climate change and its impact on fisheries. It provides useful information for those involved in or interested in fisheries and marine conservation.",
    "image": {
      "src": "https://live.staticflickr.com/8504/28915942464_55baa8b5e5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e77cefaf-042c-4d9e-b2fa-91f2951e7bbf/thumb/",
      "alt": "Twilight Time at the Gulf",
      "credit": "Charles Patrick Ewing / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Zuckerberg says people without AI glasses will be at a disadvantage in the future",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 22:47:30 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Mark Zuckerberg really believes AI glasses will be the ideal way to blend the physical and digital worlds together."
    ],
    "image_url": "",
    "titles": [
      "Zuckerberg says people without AI glasses will be at a disadvantage in the future"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.443,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the views of a major tech industry figure, potentially informing readers' understanding of future technology trends. However, it doesn't necessarily provide actionable insights or report on concrete solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/4029/4632633277_6fe50efab0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a77bdc9a-591c-452c-860b-9530c0e5a9f6/thumb/",
      "alt": "Email with Mark Zuckerberg, CEO of Facebook",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New AI Tool Identifies Deepfake Videos with High Accuracy",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 19:12:49 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/fake-videos-just-got-scarier-luckily-this-ai-can-spot-them-all/\" rel=\"nofollow\" title=\"Fake Videos Just Got Scarier. Luckily, This AI Can Spot Them All\"><img alt=\"Deepfake Video Editing\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechd"
    ],
    "image_url": "",
    "titles": [
      "Fake Videos Just Got Scarier. Luckily, This AI Can Spot Them All"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.901,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Researchers have developed an AI tool capable of identifying deepfake videos with high accuracy. This advancement comes as fake videos become increasingly sophisticated and difficult to detect. The AI's ability to spot these manipulated videos is seen as a crucial step in combating misinformation and maintaining the integrity of digital media.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution to a growing problem - deepfake videos. It provides useful information about the new AI tool and its potential impact on digital media, thus contributing to the reader's understanding and awareness of the issue.",
    "image": {
      "src": "https://live.staticflickr.com/4117/4852565675_3c6779473b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ff98b32c-1f97-4411-9946-f7cdcc1e2a09/thumb/",
      "alt": "Exoplanet Hunters at La Silla, Chile",
      "credit": "European Southern Observatory / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Archaeologists Study 2,000-Year-Old Siberian Mummy Tattoos with Digital Imaging",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 19:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "An international team of archaeologists has used high-resolution digital imaging techniques to examine tattoos on a more than 2,000-year-old ice mummy from the Pazyryk culture of Siberia, shedding light on individual craftsmanship in prehistoric Siberian tattooing for the first time."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/modern-tattooers-meet.jpg",
    "titles": [
      "Modern tattooers meet their ancient match with the ice mummies of Siberia"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary": "An international team of archaeologists has utilized high-resolution digital imaging to study tattoos on a Siberian ice mummy over 2,000 years old, from the Pazyryk culture. This research marks the first time individual craftsmanship in prehistoric Siberian tattooing has been examined in detail, offering new insights into ancient practices.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into ancient practices and the progress in archaeological research. However, it might not directly contribute to the reader's decision-making or sense of agency, hence the score is slightly lower.",
    "image": {
      "src": "https://live.staticflickr.com/3869/32581835714_90ffa8a5da_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e922b946-df7f-4d12-9821-94dcb944d028/thumb/",
      "alt": "Printing the past: 3-D archaeology and the first Americans",
      "credit": "BLM Oregon & Washington / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Harvard Researchers Condense Quantum Computer onto Single Chip",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 19:47:47 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/harvard-just-collapsed-a-quantum-computer-onto-a-chip/\" rel=\"nofollow\" title=\"Harvard Just Collapsed a Quantum Computer Onto a Chip\"><img alt=\"Metasurface Quantum Graphs\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/"
    ],
    "image_url": "",
    "titles": [
      "Harvard Just Collapsed a Quantum Computer Onto a Chip"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.912,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.434,
    "summary": "Researchers at Harvard University have successfully condensed the technology of a quantum computer onto a single chip. This innovation, which integrates quantum computing capabilities into a more compact and accessible format, represents a significant advancement in the field. The development could lead to more widespread use of quantum computing, making it easier to incorporate into various technological applications.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant innovation in the field of quantum computing. It provides readers with a deeper understanding of the progress being made in this area, and the potential impact this could have on various technological applications. It highlights a solution to the challenge of making quantum computing more accessible and widespread.",
    "image": {
      "src": "https://live.staticflickr.com/653/23640560665_3b379e5504_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/bb9ac4af-5304-4624-8a48-466dca980d28/thumb/",
      "alt": "Sweet cephalopods at the D-Wave Board Meeting today, abuzz with the watershed 100,000,000x speedup news.",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Moonquakes, Not Meteor Impacts, Alter Apollo 17 Site, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 17:04:43 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new paper reveals that ground acceleration from moonquakes, rather than meteor impacts, was responsible for shifting lunar landscapes at the moon's Taurus-Littrow valley, where Apollo 17 astronauts landed in 1972. The study also pinpointed a possible cause for those surface changes and assessed da"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/university-of-maryland.jpg",
    "titles": [
      "Seismic activity on the moon could pose risk to long-term lunar infrastructure"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "A recent study has discovered that the changes in the lunar landscape at the Taurus-Littrow valley, the landing site of Apollo 17 in 1972, were primarily caused by moonquakes, not meteor impacts as previously thought. The research further suggests a potential cause for these surface alterations, providing new insights into lunar seismic activity.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is informative and provides a deeper understanding of lunar seismic activity, which could be useful for space research and exploration. However, it doesn't highlight any specific solutions or improvements, hence the score is slightly less than maximum.",
    "image": {
      "src": "https://live.staticflickr.com/8239/8570425640_9074354fa9.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f6ef67a5-5676-4723-b1cf-e5f7e3f92662/thumb/",
      "alt": "Moonquakes",
      "credit": "GlobalQuiz.org / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Meta to spend up to $72B on AI infrastructure in 2025 as compute arms race escalates",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 21:31:42 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Meta is pouring money into the physical and technical infrastructure needed to scale its AI ambitions. The company said Wednesday in its second-quarter earnings report that it plans to more than double its spend on building AI infrastructure – like data centers and servers. \n\n“We currently expect 20"
    ],
    "image_url": "",
    "titles": [
      "Meta to spend up to $72B on AI infrastructure in 2025 as compute arms race escalates"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.945,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Meta's investment plans in AI infrastructure, which could influence decision-making for stakeholders in the tech industry. However, it does not offer insights into potential solutions or improvements, nor does it increase awareness about the broader impacts of this development.",
    "image": {
      "src": "https://live.staticflickr.com/2839/11798601374_b55a5b89e8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6519e89a-2e88-4ce4-918c-ea7ed901497b/thumb/",
      "alt": "Meta Photo",
      "credit": "dhaun / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Figma’s IPO price hit a $19.3B valuation out of the gate",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 23:04:41 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In what should be a surprise to no one, Figma priced its IPO shares above its already increased previously announced range."
    ],
    "image_url": "",
    "titles": [
      "Figma’s IPO price hit a $19.3B valuation out of the gate"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.417,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Figma's initial public offering, which could be valuable for investors or others in the business sector. However, it does not delve into the reasons behind this valuation or provide insights into the broader trends in the tech industry.",
    "image": {
      "src": "https://live.staticflickr.com/6147/5968773398_850d862505.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/db877e57-40cd-474c-9f5a-9e6b134acc62/thumb/",
      "alt": "figma Tomoe Mami",
      "credit": "animaster / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "In search of riches, hackers plant 4G-enabled Raspberry Pi in bank network",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 22:21:56 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Sophisticated group also used novel means to disguise their custom malware."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/atm-with-cash-1152x648.jpg",
    "titles": [
      "In search of riches, hackers plant 4G-enabled Raspberry Pi in bank network"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.414,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a specific cybersecurity threat, which can help readers understand the risks and potentially take action to protect themselves. However, it doesn't report on solutions or improvements, and the depth of understanding about the system, causes, or impacts is limited.",
    "image": {
      "src": "https://live.staticflickr.com/7248/6917663642_dc3b560d47_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/23d7a284-6a41-4da5-83f0-41321b310077/thumb/",
      "alt": "Raspberry Pi light",
      "credit": "Ashley Basil / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Zuckerberg: AI increased the time spent on Facebook and Instagram in Q2",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 30 Jul 2025 21:21:46 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Overall, Meta estimated that over 3.4 billion people used one of its \"family of apps\" on a daily basis."
    ],
    "image_url": "",
    "titles": [
      "Zuckerberg: AI increased the time spent on Facebook and Instagram in Q2"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the impact of AI on user engagement in social media platforms. However, it lacks depth or insight into how this information can be used by the reader or the implications of this trend.",
    "image": {
      "src": "https://live.staticflickr.com/4029/4632633277_6fe50efab0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a77bdc9a-591c-452c-860b-9530c0e5a9f6/thumb/",
      "alt": "Email with Mark Zuckerberg, CEO of Facebook",
      "credit": "Robert Scoble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Injured Sea Turtle Released Back into Ocean After Rehabilitation in Florida",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 16:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A massive sea turtle that was found injured along the Florida coast in May following a boat strike was returned to the ocean on Wednesday."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/massive-sea-turtle-ret.jpg",
    "titles": [
      "Massive sea turtle returns to the ocean off Florida after treatment for a boat strike"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.925,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.397,
    "summary": "A large sea turtle injured by a boat strike in May along the Florida coast was released back into the ocean on Wednesday. The turtle had been receiving care and rehabilitation before being successfully returned to its natural habitat.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story is positive and raises awareness about wildlife rehabilitation, it offers minimal depth or insight into the broader issues of marine conservation or how readers can contribute to such efforts. It lacks a clear focus on solutions or progress in the field of marine conservation.",
    "image": {
      "src": "https://live.staticflickr.com/118/286762872_b1485ad372_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/466041de-c716-4657-9e72-b869f15eae4e/thumb/",
      "alt": "Florida",
      "credit": "colros / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]