[
  {
    "title": "Fire on Granville Street Injures Two, Section Closed",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:54:43 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Firefighters said at least two people were hurt, and that Granville Street had been closed between Helmcken and Davie streets."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/VFRS-HOJO.jpeg?quality=85&strip=all",
    "titles": [
      "Crews battle 2-alarm fire at former Howard Johnson hotel in Vancouver"
    ],
    "summary": "A fire incident on Granville Street resulted in at least two people being injured. Consequently, the section of Granville Street between Helmcken and Davie streets has been closed to traffic. Firefighting teams are currently addressing the situation.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an incident that has occurred, but does not provide any deeper understanding or actionable insights for the reader. There is no information about the cause of the fire, potential preventive measures, or how the situation is being addressed beyond immediate firefighting efforts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.461
  },
  {
    "title": "Saskatchewan Gov Claims Reduced Surgical Wait Times; Opposition Disputes",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:53:04 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "WATCH: The Sask Gov. is touting its success in delivering on their promise to shorten surgical wait times in the province, but the opposition says their numbers aren't adding up."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/04/image-14.jpg?quality=85&strip=all",
    "titles": [
      "Saskatchewan’s health minister offers surgical performance update"
    ],
    "summary": "The Saskatchewan Government claims success in reducing surgical wait times, fulfilling a promise to its constituents. However, the opposition challenges the government's claims, suggesting discrepancies in the reported numbers. The current status of surgical wait times in the province remains under debate between the government and opposition parties.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a current debate over surgical wait times in Saskatchewan. It provides some context about the government's claims and the opposition's dispute, which can contribute to readers' understanding of healthcare issues in the province. However, it lacks detail on the specifics of the discrepancies or potential solutions to the issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.488
  },
  {
    "title": "Calgary Mayor Urges Patience, Hospitality Ahead of G7 Summit",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:46:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Days away from the G7 summit in Kananaskis, Calgary Mayor Jyoti Gondek is asking for some of the patience and hospitality residents always show when large events come to Alberta."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/a044f19b80799a24bc6557a254f5a0d112a8068027e444e44cc27e11c8fdcfe3.jpg?quality=85&strip=all",
    "titles": [
      "Calgary residents asked to be patient ahead of G7 summit in Kananaskis"
    ],
    "summary": "As the G7 summit approaches in Kananaskis, Calgary Mayor Jyoti Gondek has called on residents to extend their usual patience and hospitality for the upcoming event. This request underscores the importance of community support in hosting international gatherings.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the upcoming G7 summit and the mayor's call for patience and hospitality. However, it does not provide deeper insights into why such patience and hospitality are necessary, what challenges might be faced during the summit, or how residents can specifically contribute to its success.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.471
  },
  {
    "title": "Decision Made Amid Global Trade War and 'Buy Canadian' Movement",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:40:22 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The decision has landed in the choppy waters of a global trade war and a surging 'buy Canadian' movement that was not on the radar last fall."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/03/queen-of-new-westminster-bc-ferries.png",
    "titles": [
      "BC Ferries’ plan to build new vessels in China takes heat from both sides of the aisle"
    ],
    "summary": "A decision has been made amidst the complexities of a global trade war and the rise of a 'buy Canadian' movement, which was unforeseen last fall. This situation highlights the impact of international trade dynamics and nationalistic economic policies on decision-making processes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some context and understanding about the impact of international trade dynamics and nationalistic economic policies. However, it lacks specific actionable insights or a clear mention of solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.47
  },
  {
    "title": "Texas Governor Deploys National Guard Amid Immigration Raid Protests",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 23:35:46 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>County DA says 99.9% of people ‘have not engaged in any protest at all’ as sheriff says federal troops ‘do not have the powers to arrest or detain’</p><p>Governor Greg Abbott has pledged to deploy National Guard troops across his state of Texas, becoming the first governor to do so as protests against Trump’s immigration raids spread throughout the United States.</p><p>Abbott said on X that the Texas National Guard will “use every tool &amp; strategy to help law enforcement maintain order”.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/6e0933360b21b3a9063d3b21aca73777beac644a/239_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=1d0e987468a035426fff73f99bebeb3c",
    "titles": [
      "Social media ‘grossly distorting’ scale of protest violence, say LA officials – live"
    ],
    "summary": "Governor Greg Abbott has announced the deployment of National Guard troops across Texas in response to protests against Trump's immigration raids, marking him as the first governor to take such action amidst nationwide protests. The County DA highlighted that the vast majority of people have not participated in protests, while the sheriff stated that federal troops lack the authority to arrest or detain individuals. Abbott emphasized that the National Guard will assist law enforcement in maintaining order throughout the state.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the situation in Texas, but it doesn't provide deeper insights or solutions. It also doesn't empower the reader with actionable knowledge or a clear understanding of the underlying systems or causes.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "1950s Indian Head Rockets Players Share Stories at Hall of Fame Event",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:29:21 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Indian Head Rocket players from 1950s Nat Bates and Willie Reeds share their experiences with the team at meet and greet held at the Saskatchewan Hall of Fame"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/IMG_2766.jpg?quality=85&strip=all",
    "titles": [
      "Indian Head Rockets honour 75 years with former players"
    ],
    "summary": "Former Indian Head Rockets players Nat Bates and Willie Reeds, from the 1950s team, shared their experiences at a meet and greet event at the Saskatchewan Hall of Fame. The gathering allowed fans and attendees to hear firsthand accounts of the team's history and the players' personal journeys during their time with the Rockets.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the history of the Indian Head Rockets and the experiences of its players, but it doesn't offer actionable insights or report on progress or solutions. It does, however, increase awareness about the team's past.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.469
  },
  {
    "title": "Father Critically Injured in Leduc Facility Fire",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:26:35 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Brandon Lethbridge, a 28-year-old father, is fighting for his life at an Edmonton hospital after suffering significant burns during a fire at the Leduc Waste Management Facility."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/LEDUC-LANDFILL-FIRE-WEB-feature-image.jpg?quality=85&strip=all",
    "titles": [
      "28-year-old father severely burned while fighting fire at Leduc landfill"
    ],
    "summary": "Brandon Lethbridge, a 28-year-old father, is currently in critical condition at an Edmonton hospital after sustaining severe burns in a fire at the Leduc Waste Management Facility.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a tragic event, but it does not offer any deeper understanding or actionable insights. It does not report on any solutions, improvements, or attempts to solve problems related to the incident.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.439
  },
  {
    "title": "Federal Agents Target California Farms in Immigration Crackdown",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 23:23:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Stepped-up ‘enforcement activity’ to fulfill arrest quotas leads to reports of agents chasing workers across farmland </p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/jun/11/la-protests-los-angeles-curfew-ice-california-governor-donald-trump-us-politics-latest-updates-news\">LA protests – live updates</a></p></li></ul><p>US <a href=\"https://www.theguardian.com/us-news/usimmigration\">immigration</a> officials carried out further “enforcement activity” in California’s agricultural heartland and the Los Angeles area as the conflict between the state and <a...",
      "<p>Alarm spread through California agricultural centers Tuesday as panicked workers reported that federal immigration authorities were showing up at farm fields and packinghouses from the Central Coast to the San Joaquin Valley.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/309d49a891deeaeb3f59d1914e447699f67be66d/553_0_5001_4000/master/5001.jpg?width=140&quality=85&auto=format&fit=max&s=e0f4477bc8cc5ac30c889167afd8cc58",
    "titles": [
      "US immigration officials raid California farms as Trump ramps up conflict",
      "ICE expands immigration raids into California's agricultural heartland"
    ],
    "summary": "Federal immigration officials intensified enforcement activities in California, specifically targeting the state's agricultural regions and the Los Angeles area. This operation has caused widespread alarm among workers in the agricultural sector, with reports of agents appearing at farm fields and packinghouses across Central Coast to the San Joaquin Valley. The enforcement push is part of a broader conflict between California and federal immigration policies.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs and contextualizes the ongoing conflict between California and federal immigration policies. It gives the reader a deeper understanding of the situation and the impacts on the agricultural sector. However, it does not report on any solutions or improvements to the situation.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.985,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.675
  },
  {
    "title": "Bo Melton Temporarily Practices as Cornerback, No Permanent Switch Planned",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:56:36 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Packers have wide receiver Bo Melton taking snaps at cornerback, but Melton makes it clear he is not switching to defense."
    ],
    "image_url": "",
    "titles": [
      "Despite practicing at CB and WR, Bo Melton won't compare himself to Travis Hunter"
    ],
    "summary": "The Green Bay Packers have been utilizing wide receiver Bo Melton in the cornerback position during practices. However, Melton has stated that he does not intend to switch his role to defense permanently. This move appears to be a temporary adjustment rather than a career position change for Melton.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a temporary change in the role of a player in the Green Bay Packers team. However, it does not provide any deeper insights into the reasons behind this move or its potential impacts. It does not report on any innovations or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "Dell Rapids PBR, Harrisburg Woodies Lead SD Amateur Baseball Poll",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 11—WATERTOWN — Dell Rapids PBR (Class B) and the Harrisburg Woodies (Class A) lead their divisions in the first South Dakota amateur baseball poll of the season. PBR finished as the state champions last season and have started the season 5-2, including wins in their last three games over Colman, Hartford/Humboldt Wood Ducks and Flandreau Cardinals. The Flandreau Blue Teal gave PBR its ..."
    ],
    "image_url": "",
    "titles": [
      "Dell Rapids PBR at No. 1 in Class B in first SD amateur baseball rankings for 2025"
    ],
    "summary": "Dell Rapids PBR (Class B) and Harrisburg Woodies (Class A) are leading their divisions in the first South Dakota amateur baseball poll of the season. PBR, the reigning state champions, have a record of 5-2, with recent victories over Colman, Hartford/Humboldt Wood Ducks, and Flandreau Cardinals. The summary does not provide the outcome of PBR's game against the Flandreau Blue Teal.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the current standings in the South Dakota amateur baseball poll. However, it does not offer deeper insights or actionable information for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Mitchell Gold 16U Sweeps Watertown in Doubleheader Wins",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 11—MITCHELL — Mitchell Gold 16-and-under baseball earned a doubleheader sweep over Watertown on Tuesday. Mitchell won 16-6 in six innings in Game 1 and then claimed a 13-3 win in six innings in Game 2. Mitchell benefitted from six errors in Game 1 to earn the win, which was powered by a nine-run fifth inning after Mitchell trailed 4-3 entering their at-bats in the fifth. Kaiden Allen and ..."
    ],
    "image_url": "",
    "titles": [
      "Mitchell Gold earns two wins over Watertown"
    ],
    "summary": "On June 11, the Mitchell Gold 16-and-under baseball team secured a doubleheader victory against Watertown, winning 16-6 and 13-3, both in six innings. In the first game, Mitchell capitalized on six Watertown errors and staged a comeback with a nine-run fifth inning, overturning a 4-3 deficit. The summary does not provide details on individual performances beyond mentioning a player named Kaiden Allen.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides a basic understanding of the game's outcome and a brief description of key moments. However, it lacks depth and insight into the game's overall context, strategies employed, or individual player performances.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "High School Basketball Rules Updated for 2025-26, Clarify Goaltending",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:49:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 11—INDIANAPOLIS — The National Federation of State High School Associations recently approved a series of rule changes to the basketball rulebook for the 2025-26 school year related to the enforcement of goaltending calls. Most notably, a rule has been added to indicate that a ball is considered to be on its downward flight once it contacts the backboard on a legitimate shot attempt and ..."
    ],
    "image_url": "",
    "titles": [
      "High school basketball goaltending addressed in recent national rules changes"
    ],
    "summary": "The National Federation of State High School Associations has approved changes to the basketball rules for the 2025-26 school year, focusing on goaltending enforcement. A significant update is that a ball will be considered on its downward flight once it hits the backboard during a legitimate shot attempt, clarifying goaltending calls.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it informs readers about the changes in high school basketball rules for the upcoming school year. It also provides clarity around the enforcement of goaltending, which could influence player strategy and understanding of the game.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Mitchell High Trap Club Dominates at South Dakota State Tournament",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:48:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 11—MITCHELL — With the pressure ratcheted up at the South Dakota High School Clay Target League state tournament, the Mitchell High School trap shooting club delivered in a big way. Between the trap and skeet disciplines, Mitchell emerged with seven top-three placewinners, including four of nine available individual state titles. Plus, Mitchell won two of three trap team titles. However, ..."
    ],
    "image_url": "",
    "titles": [
      "Young talents step forward to set up Mitchell trap shooting club for future success"
    ],
    "summary": "At the South Dakota High School Clay Target League state tournament, the Mitchell High School trap shooting club excelled, securing seven top-three finishes across trap and skeet disciplines. The club won four individual state titles and two out of three trap team titles, showcasing their significant achievements in the competition.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the achievements of the Mitchell High School trap shooting club at the state tournament. However, it does not offer deeper insights into the sport, the training involved, or the implications of the victory for the team and school.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Knicks Fire Thibodeau After Eastern Conference Finals Loss",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:47:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Knicks have cast a wide net in their head coaching search following their Eastern Conference Finals loss to the Indiana Pacers — a defeat that ultimately led to the decision to part ways with Tom Thibodeau after the franchise’s most successful season in a quarter-century. As part of that process, league sources tell the Daily News the Knicks have reached out to multiple rival organizations ..."
    ],
    "image_url": "",
    "titles": [
      "Knicks OK with coaching due diligence leading to denials: source"
    ],
    "summary": "Following their loss in the Eastern Conference Finals to the Indiana Pacers, the New York Knicks have terminated Tom Thibodeau's role as head coach, marking the end of their most successful season in 25 years. In seeking a new head coach, the Knicks have initiated contact with several rival organizations, as reported by league sources to the Daily News.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about the termination of Tom Thibodeau's role as head coach of the New York Knicks. However, it does not delve into the reasons behind the decision, potential replacements, or the future strategy of the team, leaving readers with minimal depth or insight.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Nationals' DeJong Nears Rehab Assignment After Nose Injury Recovery",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:45:11 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Washington Nationals infielder Paul DeJong, sidelined since his nose was broken by a pitch in mid-April, is taking batting practice and could soon start a minor league rehab assignment.  DeJong took BP on Wednesday with a face protector flap and hit against right-hander Derek Law in a simulated game — and will do so again in a few days, Nationals manager Dave Martinez said.  “If everything goes well, he’s pretty close,” Martinez said."
    ],
    "image_url": "",
    "titles": [
      "Paul DeJong taking batting practice as he recovers from getting hit in the face by a pitch"
    ],
    "summary": "Washington Nationals infielder Paul DeJong, who has been out since mid-April due to a broken nose from a pitch, is making progress in his recovery. He took batting practice with a face protector and participated in a simulated game against right-hander Derek Law. Nationals manager Dave Martinez indicated that if DeJong's recovery continues smoothly, he could start a minor league rehab assignment soon.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the recovery progress of Paul DeJong, a player for the Washington Nationals. It provides context regarding his injury and his potential return to the game. However, it does not delve into the broader impacts of his absence on the team or the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Giants' Darius Slayton Earns League-Wide Recognition for Individual Talent",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 11 Jun 2025 23:41:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "New York Giants receiver Darius Slayton doesn't need a quarterback to receive league-wide recognition."
    ],
    "image_url": "",
    "titles": [
      "Giants Receiver Darius Slayton Listed Among League's Most Underrated"
    ],
    "summary": "New York Giants receiver Darius Slayton has gained league-wide recognition independently of his team's quarterback performance. This acknowledgment highlights Slayton's individual talent and contributions to the game, showcasing his ability to stand out in the NFL based on his own merits.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Darius Slayton's recognition in the NFL. However, it doesn't offer any deep insights or actionable information for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Chime to Go Public, Joining Recent Fintech IPO Wave",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:58:10 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Chime's debut set for Thursday follows recent listings from eToro and Circle, with investors watching closely to gauge broader appetite for fintech offerings.",
      "After a multi-year IPO freeze, fintech companies like Chime are entering the public market with slashed valuations and tempered expectations."
    ],
    "image_url": "",
    "titles": [
      "Chime prices IPO at $27 per share, valuing fintech company at $11.6 billion ahead of Nasdaq debut",
      "Chime's IPO will test public market appetite for fintech as companies line up to exit"
    ],
    "summary": "Chime is set to debut on the public market on Thursday, following recent public listings from other fintech companies like eToro and Circle. This move comes after a period where fintech IPOs were rare, and it reflects a broader trend of such companies going public with reduced valuations and moderated expectations. Investors are keenly observing these listings to assess the overall interest in fintech offerings.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the trend of fintech companies going public and provides context about the market's interest in such offerings. However, it doesn't highlight any solutions or progress in the fintech industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Oracle Surpasses Quarterly Forecasts, Predicts Revenue Growth for 2029",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:17:59 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Oracle reported better-than-expected results for the latest quarter and said it will likely deliver more revenue than it had planned for in fiscal 2029.",
      "<figure><img alt=\"Bloomberg / Getty Images Oracle stock was up about 6% for 2025 through Wednesday’s close.\" src=\"https://www.investopedia.com/thmb/XCfYW4nQG3SDIZclddimzpcq5pI=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217725448-3bccf5465ac54ad6824b04032a9a3942.jpg\" title=\"Oracle signage.\" /><figcaption><i><p>Bloomberg / Getty Images</p> Oracle stock was up about 6% for 2025 through Wednesday’s close.</i></figcaption></figure><p>Oracle (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;ORCL\">ORCL</a>) delivered quarterly results that..."
    ],
    "image_url": "",
    "titles": [
      "Oracle shares climb 8% as earnings, revenue top estimates",
      "Oracle Stock Pops as Revenue Tops Estimates, CEO Projects 'Dramatically Higher' Growth"
    ],
    "summary": "Oracle reported better-than-expected quarterly results and anticipates higher revenue for fiscal 2029. The company's stock saw a 6% increase through Wednesday’s close for the year 2025.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Oracle's financial performance and future predictions. However, it doesn't provide deep insights into why Oracle is performing well or how this impacts the broader tech industry.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.963,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.671
  },
  {
    "title": "Trump Officials Claim Trade Deal Progress, Details Scarce",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:11:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Trump's officials have repeatedly said they are nearing trade deals with several countries, without releasing specifics of most of them."
    ],
    "image_url": "",
    "titles": [
      "Bessent floats extending tariff pause for countries in 'good faith' trade talks"
    ],
    "summary": "Officials from President Trump's administration have claimed progress in reaching trade agreements with multiple countries, yet have not disclosed detailed information about most of these deals. The current status of these trade negotiations remains unclear due to the lack of specifics shared publicly.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the progress of trade deals under the Trump administration, but it lacks depth and insight due to the absence of specific details about the deals.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.398
  },
  {
    "title": "Shaquille O’Neal Settles $1.8M Lawsuit Over FTX Promotion Claims",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 21:45:38 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Shaquille O’Neal has agreed to pay $1.8 million to settle a class action suit accusing him of misleading investors by promoting crypto exchange FTX."
    ],
    "image_url": "",
    "titles": [
      "Shaquille O’Neal to pay $1.8 million to settle FTX investor lawsuit"
    ],
    "summary": "Shaquille O’Neal has settled a class action lawsuit for $1.8 million, after being accused of misleading investors through his promotion of the crypto exchange FTX.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the legal consequences of misleading promotions in the crypto industry. It provides useful information about the responsibility of public figures in promoting investments, even though the topic is negative.",
    "score_components": {
      "magnitude": 0.169,
      "recency": 0.952,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.458
  },
  {
    "title": "GameStop Shifts Strategy to Become Bitcoin Treasury",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:41:16 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images Video-game retailer GameStop is refashioning itself into a Bitcoin treasury.\" src=\"https://www.investopedia.com/thmb/VsZv1ztwd-RB8SXFyk12MRwFxeI=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217971100-8c5adca664944bc78e197908a715d1ae.jpg\" title=\"A GameStop store in New York City on June 4. \" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p> Video-game retailer GameStop is refashioning itself into a Bitcoin treasury.</i></figcaption></figure><p>GameStop (<a..."
    ],
    "image_url": "https://www.investopedia.com/thmb/VsZv1ztwd-RB8SXFyk12MRwFxeI=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217971100-8c5adca664944bc78e197908a715d1ae.jpg",
    "titles": [
      "GameStop Stock Falls After Company Announces Convertible Notes Offering"
    ],
    "summary": "GameStop, a video-game retailer, is transforming its business strategy to become a Bitcoin treasury. This shift marks a significant change in the company's direction, aiming to integrate Bitcoin into its financial operations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an innovative business strategy by GameStop, providing readers with insights into how traditional businesses can adapt to the rise of cryptocurrencies. It reports on a solution to the company's financial operations, offering empowering knowledge to the readers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.442
  },
  {
    "title": "Sundar Pichai Speaks at Google I/O 2025, Unveils New Tech",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:30:57 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"CAMILLE COHEN / Getty Images CEO Sundar Pichai addresses a crowd during Google's annual I/O developers conference on May 20, 2025\" src=\"https://www.investopedia.com/thmb/6snbbWuNmZ-ONp8oY5MRZRS6MWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215577822-47a75431e5254defb1dd57019a2c8389.jpg\" title=\"CEO Sundar Pichai addresses the crowd during Google's annual I/O developers conference.\" /><figcaption><i><p>CAMILLE COHEN / Getty Images</p> CEO Sundar Pichai addresses a crowd during Google's annual I/O developers conference on May 20,..."
    ],
    "image_url": "https://www.investopedia.com/thmb/6snbbWuNmZ-ONp8oY5MRZRS6MWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215577822-47a75431e5254defb1dd57019a2c8389.jpg",
    "titles": [
      "Google Buyouts Could Point to More Tech Layoffs, as Sector Faces Heavy Job Losses"
    ],
    "summary": "On May 20, 2025, Sundar Pichai, CEO of Google, delivered a speech at the company's annual I/O developers conference. The event was documented and shared by CAMILLE COHEN / Getty Images, showcasing Pichai addressing a large audience. This conference is known for revealing Google's latest technological advancements and future plans.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a useful insight into the future plans and technological advancements of Google. However, without specific details on the innovations or solutions presented, it doesn't fully highlight progress or provide empowering knowledge.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.428
  },
  {
    "title": "Oil Prices Hit Four-Year Low Amid Tariff-Driven Uncertainty",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:30:09 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Brandon Bell / Getty Images Oil prices fell to a 4-year low in April amid tariff-induced economic uncertainty.\" src=\"https://www.investopedia.com/thmb/fmJXtNQGgG1wlQaZ-tJ1EYpOk90=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209442497-f490bd34df764f9e8f66fba5da2994a8.jpg\" title=\"An oil pumpjack is seen in a field on April 09, 2025 in Close City, Texas.\" /><figcaption><i><p>Brandon Bell / Getty Images</p> Oil prices fell to a 4-year low in April amid tariff-induced economic uncertainty.</i></figcaption></figure><p>Oil prices rose as a..."
    ],
    "image_url": "https://www.investopedia.com/thmb/fmJXtNQGgG1wlQaZ-tJ1EYpOk90=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209442497-f490bd34df764f9e8f66fba5da2994a8.jpg",
    "titles": [
      "Oil Prices Jump to 2-Month High on Middle East Concerns, Trade Optimism"
    ],
    "summary": "In April, oil prices dropped to a four-year low due to economic uncertainty caused by tariffs. This was visually captured in a photo by Brandon Bell for Getty Images, showing an oil pumpjack in Texas.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the current state of oil prices and the impact of tariffs, providing context to the economic landscape. However, it doesn't offer solutions or insights into how this situation might be resolved or mitigated.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.425
  },
  {
    "title": "Papa John's Shares Surge Amid Talks of Going Private, Hits $1.6B Cap",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:22:05 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Brandon Bell / Getty Images Papa John’s market capitalization is around $1.6 billion\" src=\"https://www.investopedia.com/thmb/tpXOLPDofWYFveSLR7HiPdy6f64=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2152235607-d9959181bac047818de6d4efc1c64d63.jpg\" title=\"A Papa John's store in Austin, Texas, in May 2024\" /><figcaption><i><p>Brandon Bell / Getty Images</p> Papa John’s market capitalization is around $1.6 billion</i></figcaption></figure><p>Shares of Papa John’s jumped Wednesday on the news that the pizza chain might be taken private. </p><p>Papa..."
    ],
    "image_url": "https://www.investopedia.com/thmb/tpXOLPDofWYFveSLR7HiPdy6f64=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2152235607-d9959181bac047818de6d4efc1c64d63.jpg",
    "titles": [
      "Papa John's Stock Jumps on News of Possible Go-Private Deal"
    ],
    "summary": "Shares of Papa John's experienced a significant increase on Wednesday following reports that the pizza chain may be considering a move to go private. This news has contributed to the company's market capitalization reaching approximately $1.6 billion.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story gives readers an understanding of current market trends and the potential strategic direction of Papa John's. However, it lacks depth in explaining the implications of the company going private or how it might affect stakeholders.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "Disney, Universal Sue AI Firm Midjourney Over Copyright Claims",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:58:37 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "CNBC",
      "Investopedia",
      "Business Insider"
    ],
    "domains": [
      "business",
      "science"
    ],
    "snippets": [
      "Two huge movie studios are suing Midjourney, claiming the firm’s AI has been trained on their copyrighted material – the entrance of the Hollywood giants into this legal fight could be a watershed moment for AI and copyright",
      "<figure><img alt=\"Mike Kemp / In Pictures via Getty Images Disney and Universal allege AI image creator Midjourney infringed upon their copyrights, including for \" src=\"https://www.investopedia.com/thmb/vFPk6lGjwt4BIyYdT4DBHaci1Xs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217902300-c0d3508e1e104b6ebdf25b82bb0cd92c.jpg\" /><figcaption><i><p>Mike Kemp / In Pictures via Getty Images</p> Disney and Universal allege AI image creator Midjourney infringed upon their copyrights, including for \"Star Wars\"</i></figcaption></figure><p>Entertainment giants and rivals...",
      "Disney and Universal have sued artificial intelligence image creator Midjourney, alleging copyright infringement, according to court filings.",
      "Disney and Universal sued AI image-generator Midjourney, alleging copyright infringement. They gave side-by-side comparisons as examples."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/11204709/SEI_255170916.jpg",
    "titles": [
      "Disney and Universal lawsuit may be killing blow in AI copyright wars",
      "Disney, Universal Sue AI Image Creator Over Alleged Copyright Infringement",
      "Disney and Universal sue AI image company Midjourney for unlicensed use of Star Wars, The Simpsons and more",
      "Disney says these images show how Midjourney steals its characters"
    ],
    "summary": "Disney and Universal have filed a lawsuit against the artificial intelligence image creator Midjourney, accusing the company of copyright infringement. This legal action is based on allegations detailed in court filings, indicating a dispute over the use of copyrighted material by Midjourney.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a legal dispute involving major entertainment companies and an AI firm. However, it lacks depth or insight into the broader implications of the case, such as the impact on copyright law in the age of AI, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.937,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.821
  },
  {
    "title": "New Study Suggests DNA Separation Requires More Force",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:56:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-more-realistic-look-at-dna-reveals-surprising-new-behaviors/\" rel=\"nofollow\" title=\"A More Realistic Look at DNA Reveals Surprising New Behaviors\"><img alt=\"DNA Functions Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/DNA-Functions-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers at Northwestern University found that DNA strand separation may require more force than previously thought when modeled in a more true-to-life environment. In most..."
    ],
    "image_url": "",
    "titles": [
      "A More Realistic Look at DNA Reveals Surprising New Behaviors"
    ],
    "summary": "Researchers at Northwestern University discovered that separating DNA strands might necessitate more force than previously believed, based on new models simulating a more realistic environment. This finding challenges earlier understandings of DNA behavior.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new scientific discovery related to DNA behavior, contributing to the reader's understanding of the topic. However, it doesn't explicitly report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.429
  },
  {
    "title": "Study Challenges Theory on Origins of Life, Questions Ancient Proteins",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:31:53 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-research-challenges-a-key-theory-about-lifes-origins/\" rel=\"nofollow\" title=\"New Research Challenges a Key Theory About Life’s Origins\"><img alt=\"Luminous Sphere Fish Egg Crop\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Luminous-Sphere-Fish-Egg-Crop-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>What if one of the most iconic building blocks of life was misunderstood all along? A new study challenges long-standing assumptions about ancient proteins and their role..."
    ],
    "image_url": "",
    "titles": [
      "New Research Challenges a Key Theory About Life’s Origins"
    ],
    "summary": "A recent study has called into question long-held beliefs about ancient proteins, suggesting that our understanding of these fundamental components of life may have been incorrect. This research challenges a key theory regarding the origins of life, potentially altering our comprehension of how life on Earth began.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into a new study that challenges long-held beliefs about ancient proteins and the origins of life, enhancing the reader's understanding of the subject. However, it doesn't report on specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "New Cat1 Protein Expands CRISPR's Viral Defense Capabilities",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:06:06 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/its-capable-of-even-more-than-we-thought-scientists-discover-crisprs-new-secret-weapon/\" rel=\"nofollow\" title=\"It’s Capable of Even More Than We Thought: Scientists Discover CRISPR’s New Secret Weapon\"><img alt=\"Medical Doctor Geneticist Hands DNA\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Medical-Doctor-Geneticist-Hands-DNA-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A newly discovered bacterial defense protein named Cat1 reveals an extraordinary method of viral..."
    ],
    "image_url": "",
    "titles": [
      "It’s Capable of Even More Than We Thought: Scientists Discover CRISPR’s New Secret Weapon"
    ],
    "summary": "Scientists have discovered a new bacterial defense protein, Cat1, which showcases an advanced method of viral defense, expanding our understanding of CRISPR technology beyond its known genetic editing capabilities. This breakthrough, revealing CRISPR's additional potential in combating viruses, marks a significant advancement in the field of genetic research.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only provides useful information about a significant advancement in genetic research, but also reports on the discovery of a new bacterial defense protein that could potentially enhance CRISPR's viral defense capabilities. This could empower readers by providing them with knowledge about the progress being made in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.92,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.446
  },
  {
    "title": "Study Shows Oxides Self-Maintain, Hints at Affordable Cancer Drugs",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "With rising cancer rates, we need more good news, and the latest finding that cancer interacts with the nervous system means cheap and readily available drugs could help",
      "A study nearly 10 years in the making has shed new insight into how oxides can regularly sustain themselves, using the oxygen inherent in their own structures."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/10165315/SEI_254891044.jpg",
    "titles": [
      "The discovery that cancer hacks nerves could lead to fairer treatments",
      "Oxide catalysts that sustain themselves could lead to self-healing reactors"
    ],
    "summary": "A decade-long study has revealed that oxides can maintain their structure by utilizing oxygen within themselves. Additionally, recent findings suggest that the interaction between cancer and the nervous system could lead to the use of affordable, accessible drugs to combat rising cancer rates.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the potential for affordable cancer drugs, a solution that could have a significant impact on public health. It also increases awareness about the scientific process and the potential implications of research.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.88,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.691
  },
  {
    "title": "20-Year Span Sees Peace Agreements Resolve Conflicts in 40+ Countries",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 17:17:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Over the past two decades, conflicts in more than 40 countries, including El Salvador, Northern Ireland, Senegal and the Philippines, have ended in comprehensive peace agreements. But these broader accords don't happen all at once."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/peace.jpg",
    "titles": [
      "Partial peace deals may facilitate comprehensive accords, offering roadmap for policymakers"
    ],
    "summary": "Over the last 20 years, comprehensive peace agreements have concluded conflicts in over 40 countries, such as El Salvador, Northern Ireland, Senegal, and the Philippines. These agreements, which aim to resolve disputes and bring about lasting peace, are the result of gradual processes and do not occur overnight.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive, highlighting progress in conflict resolution across multiple countries. It provides useful information about the process of peace agreements and their long-term effects, contributing to a deeper understanding of international relations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.943,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "New Implants Track Brain Development in Frogs from Embryos to Adults",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 17:16:23 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Implants that monitor the neural activity of frog embryos as they grow into tadpoles and then adults could offer a window into the developing brain"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/11155523/SEI_255155459.jpg",
    "titles": [
      "Cyborg tadpoles are helping us learn how brain development starts"
    ],
    "summary": "Researchers have developed implants capable of monitoring the neural activity in frog embryos throughout their development into tadpoles and eventually adults. This technology provides a new method to observe brain development, potentially offering insights into the neural processes of growth and maturation.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive, offering useful insights into a new method for observing brain development. While it does not directly report on a solution or improvement, it does increase awareness about the potential for such advancements in the future.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.849,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.419
  },
  {
    "title": "Baking Challenge: Make a Soufflé with Ingredients Only, No Measurements",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 17:14:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Imagine being tasked with baking a soufflé, except the only instruction provided is an ingredient list without any measurements or temperatures."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/predicting-chemical-st.jpg",
    "titles": [
      "Predicting chemical storm fronts: Framework enables predictive control over patterned polymer formation"
    ],
    "summary": "A challenge involves baking a soufflé with only a list of ingredients provided, lacking specific measurements or temperatures. This scenario requires individuals to rely on their cooking intuition and experience to determine the correct proportions and cooking conditions needed to successfully create the soufflé.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides an actionable challenge for readers to improve their cooking skills. It encourages readers to use their intuition and experience, thus contributing to their decision-making and sense of agency. However, it does not provide any solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.42
  }
]